
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредставлениеСписка = Параметры.ПредставлениеСписка;
	СписокДоговоров.ЗагрузитьЗначения(Параметры.СписокДоговоров.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("ПредставлениеСписка", ПредставлениеСписка);
	ПараметрЗакрытия.Вставить("СписокДоговоров"	, СписокДоговоров);
	
	ЭтаФорма.Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры
