
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("МестоХранения");
	Поля.Добавить("ВидСделки");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидДокумента = "Тикет";
	
	Если  Данные.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда
		Если      Данные.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ВидДокумента = ВидДокумента + " на покупку";
		ИначеЕсли Данные.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ВидДокумента = ВидДокумента + " на продажу";
		КонецЕсли;
			
	ИначеЕсли ЗначениеЗаполнено(Данные.ВидСделки) Тогда
		ВидДокумента = Строка(Данные.ВидСделки);
		
	КонецЕсли;
	
	Представление = ВидДокумента + " " + Данные.Номер + " от " + Данные.Дата;
	
КонецПроцедуры
