
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа
			И Не ЭтотОбъект.ОтложенноеИсполнение
			И ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок
	Тогда
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		Если Не ЭтотОбъект.ОтложенноеИсполнение И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
			ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЭтотОбъект.Рынок);
			
			ЭлементБлокировкиДанных.ИсточникДанных = ЭтотОбъект.ЦенныеБумаги;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ДепозитарныйСчет", "ДепозитарныйСчет");
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ЦеннаяБумага",     "ЦеннаяБумага");
		КонецЕсли;
		
		БлокировкаДанных.Заблокировать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоОперациямСЦеннымиБумагами()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Ссылка КАК Операция,
		|	ВЫБОР
		|		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	Сделка.Организация,
		|	Сделка.СчетДоверительногоУправления,
		|	Сделка.Рынок,
		|	Сделка.ВалютаСделки КАК Валюта,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаПоставки
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаПоставкиПлановая,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаОплаты
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаОплатыПлановая,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаОплаты,
		|	СделкаЦенныеБумаги.Количество,
		|	СделкаЦенныеБумаги.Цена,
		|	СделкаЦенныеБумаги.ЦенаПроцент,
		|	СделкаЦенныеБумаги.ЦенаКупона,
		|	СделкаЦенныеБумаги.Сумма,
		|	СделкаЦенныеБумаги.СуммаКупона,
		|	Сделка.Дата КАК ДатаОперации
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка
		|ГДЕ
		|	Сделка.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СделкаЦенныеБумаги.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОперацииСЦеннымиБумагами.Добавить(), Выборка);
	КонецЦикла;
		
КонецПроцедуры // СформироватьДвиженияПоОперациямСЦеннымиБумагами


Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	ЭтоРынокФьючерсов = (ЭтотОбъект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы"));
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиЦенныхБумаг.Записывать               	= Истина;
	Движения.ОстаткиДенежныхСредств.Записывать           	= Истина;
	Движения.ЗадолженностиПоЦеннымБумагам.Записывать     	= Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать 	= Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать         	= Истина;
	Движения.УсловияСделок.Записывать                    	= Истина;
	Движения.РасходыПоСделке.Записывать						= Истина;
	Движения.РезервыПИФ.Записывать					        = Истина;
	
	Если ЭтотОбъект.ОтложенноеИсполнение Тогда
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ТипЗадолженностиПоЦБ = Перечисления.ТипыЗадолженности.Дебиторская;
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ТипЗадолженностиПоЦБ = Перечисления.ТипыЗадолженности.Кредиторская;
		КонецЕсли;
		
		// задолженность по ц/б
		Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
			Движение = Движения.ЗадолженностиПоЦеннымБумагам.ДобавитьПриход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Основание                    = ЭтотОбъект.Ссылка;
			Движение.ТипЗадолженности             = ТипЗадолженностиПоЦБ;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоСделке;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.Валюта                       = ЭтотОбъект.ВалютаСделки;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
			Движение.Сумма                        = СтрокаЦенныеБумаги.Сумма;
			Движение.СуммаКупона                  = СтрокаЦенныеБумаги.СуммаКупона;
		КонецЦикла;
		
		Если НЕ ЭтоРынокФьючерсов Тогда
			РегистрыНакопления.ЗадолженностиПоДенежнымСредствам.СформироватьСводныеДвиженияПоСделке(ЭтотОбъект, Справочники.ВидыЗадолженности.ПоСделке);
		КонецЕсли;
		
	Иначе
		// остатки ц/б
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ВидДвиженияЦБ = ВидДвиженияНакопления.Приход;
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ВидДвиженияЦБ = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		
		Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
			Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
			Движение.ВидДвижения                  = ВидДвиженияЦБ;
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
		КонецЦикла;
		
		Если НЕ ЭтоРынокФьючерсов Тогда
			РегистрыНакопления.ОстаткиДенежныхСредств.СформироватьСводныеДвиженияПоСделке(ЭтотОбъект, Справочники.ВидыЗадолженности.ПоСделке);
		КонецЕсли;
		
	КонецЕсли;
	
	//Расходы по сделке
	Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
		Если СтрокаЦенныеБумаги.ТорговаяКомиссия > 0 Тогда
			Движение = Движения.РасходыПоСделке.Добавить();
			Движение.Период							= ЭтотОбъект.Дата;
			Движение.Организация					= ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Сделка							= ЭтотОбъект.Ссылка;
			Движение.Рынок							= ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага					= СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.ВидЗадолженности				= Справочники.ВидыЗадолженности.ПоТорговойКомиссии;
			Движение.Валюта							= ЭтотОбъект.ВалютаТорговойКомиссии;
			Движение.Сумма							= СтрокаЦенныеБумаги.ТорговаяКомиссия;
		КонецЕсли;
	КонецЦикла;
	
	//Считаем что торговая комиссия у ПИФ проходит по прочим резервам
	ПрочиеРезервыПИФНачисляетсяВУчете = БухгалтерскийУчет.РезервПИФНачисляетсяВУчете(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.Резервы.ПрочиеВозмещаемыеРасходыУправляющего);
	Если ПрочиеРезервыПИФНачисляетсяВУчете и ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия")>0 Тогда 

		АналитикаТорговойКомисии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
			Дата, 
			Организация, 
			СчетДоверительногоУправления,
			Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
			Перечисления.ВидыУчета.БухгалтерскийУчет,
			"Аналитика");
			
		Если ЗначениеЗаполнено(АналитикаТорговойКомисии) Тогда
				
			РезервПоРасходу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АналитикаТорговойКомисии, "Резерв");
			Если ЗначениеЗаполнено(РезервПоРасходу) Тогда
				
				Движение = Движения.РезервыПИФ.ДобавитьРасход();
				Движение.Период                       = ЭтотОбъект.Дата;
				Движение.Организация                  = ЭтотОбъект.Организация;
				Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
				Движение.Резерв                       = РезервПоРасходу;
				
				ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета");
				Если ЭтотОбъект.ВалютаТорговойКомиссии <> ВалютаУчета Тогда 
					СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия"), ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
					Движение.Валюта = ВалютаУчета;
				Иначе
				    СуммаОперации = ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия");
					Движение.Валюта = ЭтотОбъект.ВалютаТорговойКомиссии;
				КонецЕсли;
				
				Движение.Сумма  = СуммаОперации;
				
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана аналитика  торговой комиссии по бухучету! Списание резервов невозможно!",ЭтотОбъект.Ссылка,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСРегистрамиНакопления.СформироватьСводныеДвиженияПоТорговойКомиссииВСделке(ЭтотОбъект);
	
	РегистрыСведений.УсловияСделок.СформироватьДвижения(ЭтотОбъект);
	РегистрыСведений.ПлановыеДатыОплат.СформироватьДвижения(ЭтотОбъект);
	
	СформироватьДвиженияПоОперациямСЦеннымиБумагами();
	
	ДокументРаспределениеАктивовЕПС = Неопределено;
	
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
		И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка И ЭтотОбъект.Дата < БухгалтерскийУчетЕПС.ДатаФормированияРаспределенияАктивовЕПСвФБУ() Тогда
		
		КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата);
		
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
		
		НастройкиЦенныхБумаг = НастройкиУчета.НастройкиУчетаЦенныхБумаг;
		
		Для Каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
			
			ОбъектРаспределения = Новый Структура;
			ОбъектРаспределения.Вставить("ЦеннаяБумага", СтрокаЦенныеБумаги.ЦеннаяБумага);
			ОбъектРаспределения.Вставить("НастройкиЦенныхБумаг", НастройкиЦенныхБумаг);
			ОбъектРаспределения.Вставить("Дата", ЭтотОбъект.Дата);
			ОбъектРаспределения.Вставить("Ссылка", ЭтотОбъект.Ссылка);
			ОбъектРаспределения.Вставить("СтрокаПартии", СтрокаЦенныеБумаги.СтрокаПартии);
			
			УчетныйАктивЕПС = БухгалтерскийУчетЕПС.РаспределитьАктивЕПС(ЭтотОбъект.СчетДоверительногоУправления, КлиентДоверительногоУправления, ОбъектРаспределения, Отказ);
			
			Если ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда
				
				ДокументРаспределениеАктивовЕПС = Документы.РаспределениеАктивовЕПС.ПолучитьРаспределенияАктивовЕПС(
					ЭтотОбъект.Дата,
					ЭтотОбъект.Организация,
					ЭтотОбъект.СчетДоверительногоУправления,
					ЭтотОбъект.Ссылка,
					ДокументРаспределениеАктивовЕПС,
					ЭтотОбъект.Ссылка,
					ЭтотОбъект.Рынок,
					СтрокаЦенныеБумаги.ЦеннаяБумага,
					УчетныйАктивЕПС,
					СтрокаЦенныеБумаги.Количество,
					ЭтотОбъект.Ответственный,
					Отказ);
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если ДокументРаспределениеАктивовЕПС <> Неопределено Тогда
		
		Если Не ДокументРаспределениеАктивовЕПС.РучнойВвод Тогда
			
			Если ДокументРаспределениеАктивовЕПС.ЦенныеБумаги.Количество() > 0 Тогда
				
				Попытка
					
					Если ДокументРаспределениеАктивовЕПС.ПометкаУдаления Тогда
						ДокументРаспределениеАктивовЕПС.ПометкаУдаления = Ложь;
					КонецЕсли;	
					
					Для Каждого СтрокаЦенныеБумаги Из ДокументРаспределениеАктивовЕПС.ЦенныеБумаги Цикл
						
						ДокументРаспределениеАктивовЕПС.Комментарий = ДокументРаспределениеАктивовЕПС.Комментарий + ?(СтрДлина(ДокументРаспределениеАктивовЕПС.Комментарий) > 0, ", ", "") + Строка(СтрокаЦенныеБумаги.ЦеннаяБумага);
						
					КонецЦикла;
					
					ДокументРаспределениеАктивовЕПС.ДополнительныеСвойства.Вставить("ЭтоПроведениеИзСделки", Истина);
					
					ДокументРаспределениеАктивовЕПС.Записать(РежимЗаписиДокумента.Проведение);	
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка записи ""Распределение активов ЕПС""!",ЭтотОбъект.Ссылка,,,Отказ);
				КонецПопытки;	
				
			Иначе
				
				ДокументРаспределениеАктивовЕПС.УстановитьПометкуУдаления(Истина);
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если Не ЭтотОбъект.ОтложенноеИсполнение
			И ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок
			// биржевые сделки мы загружаем по факту их свершения и проверять
			// отрицательные остатки смысл нет, т.к. движение активов точно произошло,
			// кроме того, это подтверждается в конце дня сверками с брокером
	Тогда
	
		// проверим отрицательные остатки
		Движения.Записать();
	
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			// биржа осуществляет клиринг по расписанию, а не непрерывно, так что в течение дня
			// деньги и/или бумаги могут уходить в минуса. Решили, что деньги котролировать не будем,
			// а вот бумаги всё же стоит
			// РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредств(ЭтотОбъект, Отказ);
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЦенныхБумаг(ЭтотОбъект, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПСФьючерсы(УчетныйРегистр, Отказ)
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	МассивУчетныхАктивов = Новый Массив;
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		АналитикаКомиссии	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
		АналитикаСделки		= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
	Иначе
		АналитикаКомиссии	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
		АналитикаСделки		= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
	КонецЕсли;
	
	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	
	// #381119: Хардкод для Сафмара по фьючерсам т.к. непонятно пока, какую делать настройку
	МассивСчетовСАФМАР = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
		ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"),
		ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
		ЭтотОбъект.Дата);
	
	ЭтоКлиентСАФМАР = (МассивСчетовСАФМАР.Найти(ЭтотОбъект.СчетДоверительногоУправления) <> Неопределено);
	
	// Комиссия
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		ВидДвиженияДенежныхСредствКомиссия = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка;
	ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		ВидДвиженияДенежныхСредствКомиссия = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа;
	КонецЕсли;
		
	Для Каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
		
		// Для фьючей не передаем СчетДоверительногоУправления - ибо не переопределяются
		УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(, Перечисления.РынкиЦенныхБумаг.Фьючерсы, СтрокаЦенныеБумаги.ЦеннаяБумага);
		
		Если МассивУчетныхАктивов.Найти(УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
		КонецЕсли;
		
		СуммаКомиссииВВалюте = СтрокаЦенныеБумаги.ТорговаяКомиссия;
		
		Если СуммаКомиссииВВалюте > 0 Тогда
			СуммаКомиссииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
				СуммаКомиссииВВалюте, ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКомиссииВВалютеУчета, "Торговая комиссия начисление");
			
			Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;
			
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("53803");
			
			Проводка.ДополнительнаяАналитикаДт = АналитикаКомиссии;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты22;
			
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Брокер.ЮрФизЛицо;
			Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			
			Проводка.ВалютаКт = ЭтотОбъект.ВалютаТорговойКомиссии;
			Проводка.ВалютнаяСуммаКт = СуммаКомиссииВВалюте;
			
			Если Не ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии Тогда
				Если Не ЭтоКлиентСАФМАР Тогда // Нормальные клиенты делают 2 проводки через Расчеты22, а Сафмар - 1, напрямую
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКомиссииВВалютеУчета, "Торговая комиссия списание");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.Расчеты22;
					
					Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Брокер.ЮрФизЛицо;
					Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
					
					Проводка.ВалютаДт = ЭтотОбъект.ВалютаТорговойКомиссии;
					Проводка.ВалютнаяСуммаДт = СуммаКомиссииВВалюте;
				Иначе
					Проводка.СубконтоКт.Очистить();
				КонецЕсли;
				
				// Кредит
				Проводка.СчетКт = ПланыСчетов.Единый.РасчетыСБрокерами02;
				
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредствКомиссия;
				
				Проводка.ВалютаКт = ЭтотОбъект.ВалютаТорговойКомиссии;
				Проводка.ВалютнаяСуммаКт = СуммаКомиссииВВалюте;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Глава А
	
	БиржаКонтрагент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ").ЮрФизЛицо;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьПокупки) КАК Стоимость,
		|	СУММА(БухПартииСрочныхКонтрактов.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииСрочныхКонтрактов.ПереоценкаСНачалаГода) КАК ПереоценкаСНачалаГода
		|ПОМЕСТИТЬ ЗакрытияКонтрактов
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
		|ГДЕ
		|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
		|	И БухПартииСрочныхКонтрактов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Цена КАК Цена,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗакрытияКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЗакрытияКонтрактов.Количество КАК Количество,
		|	ЗакрытияКонтрактов.Стоимость КАК Стоимость,
		|	ЗакрытияКонтрактов.Переоценка КАК Переоценка,
		|	ЗакрытияКонтрактов.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ЕСТЬNULL(КотировкиТорговыхПлощадок.SETTLEPRICE, 0) КАК Котировка
		|ИЗ
		|	ЗакрытияКонтрактов КАК ЗакрытияКонтрактов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО ЗакрытияКонтрактов.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|		ПО ЗакрытияКонтрактов.ЦеннаяБумага = КотировкиТорговыхПлощадок.ЦеннаяБумага
		|			И (КотировкиТорговыхПлощадок.Период = &ДатаКотировок)
		|			И (КотировкиТорговыхПлощадок.РежимТоргов = &РежимТоргов)
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Регистратор";
	#КонецОбласти
	Запрос.УстановитьПараметр("ДатаКотировок", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("РежимТоргов", ОбщегоНазначения.ПолучитьИменованныйОбъект("РежимТоргов_ФОРТС"));
	
	Списания = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСписания Из Списания Цикл
		Если СтрокаСписания.Цена = 0 Тогда // это закрытие позиции - берм котировку
			Если СтрокаСписания.Котировка = 0 Тогда // совсем плохо
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует цена фьючерса!", ЭтотОбъект, "Рынок",, Отказ);
				Возврат;
			Иначе
				СтрокаСписания.Цена = СтрокаСписания.Котировка;
			КонецЕсли;
		КонецЕсли;
		
		СебестоимостьФьючерса = СтрокаСписания.Стоимость + СтрокаСписания.Переоценка;
		СтоимостьСписания = СтрокаСписания.Количество * СтрокаСписания.Цена;
		Прибыль = СтоимостьСписания - СебестоимостьФьючерса;
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда // списывали продажи, а для продаж рост бэд, а падение гуд
			Прибыль = -Прибыль;
		КонецЕсли;
		
		Если МассивУчетныхАктивов.Найти(СтрокаСписания.УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(СтрокаСписания.УчетныйАктивЕПС);
		КонецЕсли;
		
		Если Прибыль > 0 Тогда
			// Проводка 1: Прибыль на фьючерс
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Прибыль от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиА;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписания.УчетныйАктивЕПС.АналитикаДоходовОтОпераций;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаКт = АналитикаСделки;
			
			// Проводка 2: Фьючерс на вспомогательный
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Прибыль от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
			// Кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиА;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Проводка 3: Вспомогательный на дебиторку
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Задолженность по вар.марже");
			
			// Дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
			Проводка.СубконтоДт.Контрагенты = БиржаКонтрагент;
			Проводка.ВалютаДт = ВалютаУчета;
			Проводка.ВалютнаяСуммаДт = Прибыль;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
		ИначеЕсли Прибыль < 0 Тогда
			// Проводка 1: Фьючерс на прибыль
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Убыток от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписания.УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаДт = АналитикаСделки;
			
			// Кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиП;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Проводка 2: Вспомогательный на фьючерс
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Убыток от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиП;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
			// Проводка 3: Кредиторку на вспомогательный
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Задолженность по вар.марже");
			
			// Дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
			Проводка.СубконтоКт.Контрагенты = БиржаКонтрагент;
			Проводка.ВалютаКт = ВалютаУчета;
			Проводка.ВалютнаяСуммаКт = -Прибыль;
		КонецЕсли;
		
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
			// Т.к. закрывали партии фьючерсов то закроем 7ой раздел
			СуммаЗакрытия7гоРаздела = Прибыль;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				СуммаЗакрытия7гоРаздела = СуммаЗакрытия7гоРаздела + СтрокаСписания.ПереоценкаСНачалаГода;
			Иначе
				СуммаЗакрытия7гоРаздела = СуммаЗакрытия7гоРаздела - СтрокаСписания.ПереоценкаСНачалаГода;
			КонецЕсли;
			
			Если СуммаЗакрытия7гоРаздела > 0 Тогда
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					СтрокаСписания.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций,
					СтрокаСписания.ЦеннаяБумага,
					СтрокаСписания.УчетныйАктивЕПС.АналитикаДоходовОтОпераций,
					ВалютаУчета,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаСделки,
					-СуммаЗакрытия7гоРаздела); // Приходится передавать наоборот ибо вот так вот сделана процедура
			ИначеЕсли СуммаЗакрытия7гоРаздела < 0 Тогда
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					СтрокаСписания.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций,
					СтрокаСписания.ЦеннаяБумага,
					СтрокаСписания.УчетныйАктивЕПС.АналитикаРасходовОтОпераций,
					ВалютаУчета,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаСделки,
					-СуммаЗакрытия7гоРаздела); // Приходится передавать наоборот ибо вот так вот сделана процедура
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЭтотОбъект.ОтложенноеИсполнение Тогда
		// Если мы этой сделкой только закрываем чужие сделки и не открываем новых то мы сразу же и закроем 7ой раздел
		//	ибо других прибылей/убытков по сделке не предполагается
		Запрос = Новый Запрос;
		Запрос.Текст =
		#Область ТекстЗапроса
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество
			|ПОМЕСТИТЬ ОткрытияКонтрактов
			|ИЗ
			|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
			|ГДЕ
			|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
			|	И БухПартииСрочныхКонтрактов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииСрочныхКонтрактов.ЦеннаяБумага
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СделкаЦенныеБумаги.Количество КАК КоличествоСделка,
			|	СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссия,
			|	ЕСТЬNULL(ОткрытияКонтрактов.Количество, 0) КАК Количество
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОткрытияКонтрактов КАК ОткрытияКонтрактов
			|		ПО (ОткрытияКонтрактов.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага)
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка = &Регистратор";
		#КонецОбласти
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
		
		Создания = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаСоздания Из Создания Цикл
			Если СтрокаСоздания.Количество = 0 Тогда // Мы не создавали новых партий
				// Для фьючей не передаем СчетДоверительногоУправления - ибо не переопределяются
				УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(, Перечисления.РынкиЦенныхБумаг.Фьючерсы, СтрокаСоздания.ЦеннаяБумага);
				
				Если МассивУчетныхАктивов.Найти(УчетныйАктивЕПС) = Неопределено Тогда
					МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
				КонецЕсли;
				
				// По просьбе Светы Мищенко не делаем закрытия по комиссии - ждем конца года ибо методика неопределена
				Продолжить;
				
				// Закроем 7-ой раздел в части начисленной комиссии
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций,
					СтрокаСоздания.ЦеннаяБумага,
					УчетныйАктивЕПС.АналитикаРасходовОтОпераций,
					ЭтотОбъект.ВалютаТорговойКомиссии,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаКомиссии,
					СтрокаСоздания.ТорговаяКомиссия);
			КонецЕсли;
		КонецЦикла;
		
		БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Истина, Истина, Неопределено, Отказ);
	КонецЕсли;
	
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
	
	// Глава Г
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактов.ВидДвижения КАК ВидДвижения,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.ВидСделки КАК ВидСделки,
		|	БухПартииСрочныхКонтрактов.Партия КАК Партия,
		|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьПокупки) КАК Стоимость,
		|	СУММА(БухПартииСрочныхКонтрактов.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьБазовогоАктиваВВалютеУчета) КАК СтоимостьБазовогоАктиваВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
		|ГДЕ
		|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
		|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииСрочныхКонтрактов.ВидДвижения,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС,
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.ВидСделки,
		|	БухПартииСрочныхКонтрактов.Партия";
	#КонецОбласти
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
	
	ДвиженияПартий = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДвиженияПартий Из ДвиженияПартий Цикл
		БазовыйАктив = СтрокаДвиженияПартий.ЦеннаяБумага.БазовыйАктив;
		
		Если ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.ВалютныеПары") Тогда
			ВалютаАктива = БазовыйАктив.Валюта;
		ИначеЕсли ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.Акции") Тогда
			ВалютаАктива = БазовыйАктив.ВалютаНоминала;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Учет по главе Г не проведен! Учет реализован только для валютных пар и акций!", ЭтотОбъект, "Основание");
			Продолжить;
		КонецЕсли;
		
		ОснованиеРасчетов = СтрокаДвиженияПартий.Партия;
		
		Если ТипЗнч(ОснованиеРасчетов) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
			ОснованиеРасчетов = ОснованиеРасчетов.Основание;
		КонецЕсли;
		
		Если СтрокаДвиженияПартий.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			// Перечисления.ВидыСделок.Покупка
			#Область Перечисления_ВидыСделок_Покупка
			Если СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				// Кредиторка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Обязательство по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
				
				// Дебиторка
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Требование по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаАктива;
					Проводка.ВалютнаяСуммаДт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				КонецЕсли;
			#КонецОбласти
			// Перечисления.ВидыСделок.Продажа
			#Область Перечисления_ВидыСделок_Продажа
			ИначеЕсли СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
				// Дебиторка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Требование по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				КонецЕсли;
				
				// Кредиторка
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Обязательство по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаАктива;
					Проводка.ВалютнаяСуммаКт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
		ИначеЕсли СтрокаДвиженияПартий.ВидДвижения = ВидДвиженияНакопления.Расход Тогда // Закрываем требования и обязательства
			// Перечисления.ВидыСделок.Покупка
			#Область Перечисления_ВидыСделок_Покупка
			Если СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				// Закрытие кредиторки стоимость
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Закрытие обязательства по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				КонецЕсли;
				
				// Закрытие кредиторки переоценка
				Если СтрокаДвиженияПартий.Переоценка <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Переоценка, "Закрытие обязательства по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Переоценка;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				КонецЕсли;
				
				// Закрытие дебиторки
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Закрытие требования по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаАктива;
					Проводка.ВалютнаяСуммаКт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
			#КонецОбласти
			// Перечисления.ВидыСделок.Продажа
			#Область Перечисления_ВидыСделок_Продажа
			ИначеЕсли СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
				// Закрытие дебиторки стоимость
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Закрытие требования по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
				
				// Закрытие дебиторки переоценка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Переоценка, "Закрытие требования по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Переоценка;
				КонецЕсли;
				
				// Закрытие кредиторки
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Закрытие обязательства по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаАктива;
					Проводка.ВалютнаяСуммаДт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, Контрагент, КонтрагентЯвляетсяРезидентом, КонтрагентПоКомиссии, СчетДС, СубконтоДС, ВидСубконтоДС, Отказ)
	
	Если НЕ ЭтотОбъект.ОтложенноеИсполнение Тогда
		
		СуммаСделки = ЭтотОбъект.ЦенныеБумаги.Итог("Сумма");
		СуммаКупона = ЭтотОбъект.ЦенныеБумаги.Итог("СуммаКупона");
		СуммаСделкиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаСделки, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		СуммаКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупона, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления);
		
		ПараметрыОплаты = Новый Структура;
		
		ПараметрыОплаты.Вставить("Сделка",							ЭтотОбъект.Ссылка);
		ПараметрыОплаты.Вставить("СуммаТела",						СуммаСделки);
		ПараметрыОплаты.Вставить("СуммаКупона",						СуммаКупона);
		ПараметрыОплаты.Вставить("ВалютаСделки",					ЭтотОбъект.ВалютаСделки);
		ПараметрыОплаты.Вставить("ВалютаОплаты",					ЭтотОбъект.ВалютаСделки);
		ПараметрыОплаты.Вставить("Контрагент",						Контрагент);
		ПараметрыОплаты.Вставить("СчетДС",							СчетДС);
		ПараметрыОплаты.Вставить("СубконтоДС",						СубконтоДС);
		ПараметрыОплаты.Вставить("ВидСубконтоДС",					ВидСубконтоДС);
		ПараметрыОплаты.Вставить("КонтрагентЯвляетсяРезидентом",	КонтрагентЯвляетсяРезидентом);
		ПараметрыОплаты.Вставить("КонтрагентПоКомиссии",			КонтрагентПоКомиссии);
		ПараметрыОплаты.Вставить("НастройкиУчета",					НастройкиУчетаОбщие);
		
		ПараметрыОплаты.Вставить("СуммаСделкиВВалютеУчета",			СуммаСделкиВВалютеУчета);
		ПараметрыОплаты.Вставить("СуммаКупонаВВалютеУчета",			СуммаКупонаВВалютеУчета);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачалаСделкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиОплатыПоСделке(ЭтотОбъект, ПараметрыОплаты, Отказ);
		
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			
			// оплата комиссии
			// тут есть заложенность на то, что при покупке мы не будем делить по виду учетного актива (всегда будем отправлять на 1 вид)
			// я так решил потому, что прецендентов не было
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссия,
			|	БухПартииЦенныхБумаг.Партия КАК Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = БухПартииЦенныхБумаг.ЦеннаяБумага
			|			И (БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
			|			И (БухПартииЦенныхБумаг.Количество <> 0)
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка = &Ссылка
			|	И БухПартииЦенныхБумаг.Регистратор = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ПараметрыОплаты.Вставить("УчетныйАктивЕПС",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС);
				ПараметрыОплаты.Вставить("ЦеннаяБумага",		ВыборкаДетальныеЗаписи.ЦеннаяБумага);
				ПараметрыОплаты.Вставить("ТорговаяКомиссия",	ВыборкаДетальныеЗаписи.ТорговаяКомиссия);
				ПараметрыОплаты.Вставить("Партия",				ВыборкаДетальныеЗаписи.Партия);
				ПараметрыОплаты.Вставить("СтрокаПартии",		ВыборкаДетальныеЗаписи.СтрокаПартии);
				
				БухгалтерскийУчетЕПС.СформироватьПроводкиОплатыТорговойКомиссииСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
				
			КонецЦикла;
			
			БухгалтерскийУчетЕПС.СформироватьПроводкиПокупкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, Контрагент);
			
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			
			БухгалтерскийУчетЕПС.СформироватьПроводкиПродажиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
		КонецЕсли;
		
	Иначе // Т +
		
		СформироватьПроводкиПоГлавеГДляСделкиТПлюс(КонтрагентЯвляетсяРезидентом, Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
	
		ПроведениеПоРегиструЕПСФьючерсы(УчетныйРегистр, Отказ);
		Возврат;
		
	ИначеЕсли ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Доли Тогда
		Возврат;
	КонецЕсли;
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	НастройкиУчетаОбщие = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);
		
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Если ЭтотОбъект.Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
		Контрагент 				= ЭтотОбъект.Брокер.ЮрФизЛицо;
		КонтрагентПоКомиссии	= ЭтотОбъект.Брокер.ЮрФизЛицо;
		СчетДС 					= ПланыСчетов.Единый.РасчетыСБрокерами02;
		
		ВидСубконтоДС	= ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
		СубконтоДС 		= БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
	Иначе
		Контрагент 				= ЭтотОбъект.Контрагент;
		КонтрагентПоКомиссии 	= ЭтотОбъект.Контрагент;
		Если Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк, Дата) Тогда
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета01;
		Иначе
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		
		ВидСубконтоДС 	= ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета;
		СубконтоДС		= ЭтотОбъект.РасчетныйСчет;
	КонецЕсли;
	
	КонтрагентЯвляетсяРезидентом = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Контрагент, ЭтотОбъект.Организация);
	
	СуммаКомиссииВВалюте = ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия");

	Если ЭтотОбъект.ОтложенноеИсполнение и СуммаКомиссииВВалюте > 0 Тогда
		
		ПараметрыКомиссии = Новый Структура;
		ПараметрыКомиссии.Вставить("ЦБ", 					Неопределено);
		ПараметрыКомиссии.Вставить("ВидСделки", 			ВидСделки);
		ПараметрыКомиссии.Вставить("ВалютаКомиссии", 		ЭтотОбъект.ВалютаТорговойКомиссии);
		ПараметрыКомиссии.Вставить("ВидКомиссии", 			Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
		ПараметрыКомиссии.Вставить("КонтрагентПоКомиссии", 	КонтрагентПоКомиссии);
		ПараметрыКомиссии.Вставить("ВключатьРасходыПоПокупкеВСтоимость", 	Ложь);
		ПараметрыКомиссии.Вставить("УчетныйАктив",			Неопределено);
		ПараметрыКомиссии.Вставить("Сделка",				Ссылка);
		ПараметрыКомиссии.Вставить("СчетДС", 				СчетДС);
		ПараметрыКомиссии.Вставить("СубконтоДС", 			СубконтоДС);
		ПараметрыКомиссии.Вставить("ВидСубконтоДС",			ВидСубконтоДС);

		Если Не ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии  Тогда //комиссия
			
			// торговую комиссию Деньги -> Комисия 
			// а на расходы комиссию спишет исполнение
			
			ТаблицаСделок = Новый ТаблицаЗначений;
			ТаблицаСделок.Колонки.Добавить("Основание", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
			СтрокаТаблицыСделок 			= ТаблицаСделок.Добавить();
			СтрокаТаблицыСделок.Основание 	= Ссылка;
			РаспределениеПоВидуАктиваЕПС 	= БухгалтерскийУчетЕПС.ПолучитьРаспределениеПоВидуАктива(ТаблицаСделок);
			
			Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
				
				СуммаКомиссииВВалюте      = СтрокаЦенныеБумаги.ТорговаяКомиссия;
				СуммаКомиссииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссииВВалюте, ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
				
				ПараметрыКомиссии.ЦБ = СтрокаЦенныеБумаги.ЦеннаяБумага;
				
				ПараметрыКомиссии.Вставить("СуммаОперации", СуммаКомиссииВВалютеУчета);
				ПараметрыКомиссии.Вставить("СуммаКомисии", 	СуммаКомиссииВВалюте);
								
				РаспределениеТекущейЦБ = РаспределениеПоВидуАктиваЕПС.НайтиСтроки(Новый  Структура("ЦеннаяБумага",СтрокаЦенныеБумаги.ЦеннаяБумага));
				
				СуммаКомиссииВВалютеКРаспределению 		= ПараметрыКомиссии.СуммаКомисии;
				СуммаКомиссииВВалютеУчетаКРаспределению = ПараметрыКомиссии.СуммаОперации;
				
				КоличествоПоСделке = 0;
				
				Для Каждого СтрокаРаспределенияТекущейЦБ Из РаспределениеТекущейЦБ Цикл
					КоличествоПоСделке = КоличествоПоСделке + СтрокаРаспределенияТекущейЦБ.Количество;
				КонецЦикла;
				
				Для Каждого СтрокаРаспределенияТекущейЦБ Из РаспределениеТекущейЦБ Цикл
					ТекКоличество = СтрокаРаспределенияТекущейЦБ.Количество;
					СуммаКомиссииВВалюте 		= Окр(СуммаКомиссииВВалютеКРаспределению 		* ТекКоличество / КоличествоПоСделке,2);
					СуммаКомиссииВВалютеУчета 	= Окр(СуммаКомиссииВВалютеУчетаКРаспределению 	* ТекКоличество / КоличествоПоСделке,2);
					
					ПараметрыКомиссии.СуммаКомисии 						 = СуммаКомиссииВВалюте;
					ПараметрыКомиссии.СуммаОперации 					 = СуммаКомиссииВВалютеУчета;
					ПараметрыКомиссии.УчетныйАктив 						 = СтрокаРаспределенияТекущейЦБ.УчетныйАктивЕПС;
					ПараметрыКомиссии.ВключатьРасходыПоПокупкеВСтоимость = СтрокаРаспределенияТекущейЦБ.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость;
					
					ПараметрыКомиссии.Вставить("ОплатаВДеньПокупки",	Ложь);
					ПараметрыКомиссии.Вставить("ПроводитьЧерезРасчеты",	Ложь);
					ПараметрыКомиссии.Вставить("ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты",	НастройкиУчетаОбщие.ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты);
					
					Если НастройкиУчетаОбщие.ПроводитьКомиссиюПоСделкамЧерезСчетаРасчетов Тогда
						ПараметрыКомиссии.Вставить("ПроводитьЧерезРасчеты",	Истина);
						
						ПараметрыКомиссии.Вставить("СуммаЧерезРасчеты",	СуммаКомиссииВВалютеУчета);
						ПараметрыКомиссии.Вставить("СуммаЧерезРасчетыВал",	СуммаКомиссииВВалюте);
					КонецЕсли;
					
					Если НЕ НастройкиУчетаОбщие.ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты Тогда
						
						ПараметрыКомиссии.Вставить("ПредварительныеЗатратыПоСделке", 	Истина);
						
						БухгалтерскийУчетЕПС.НачислитьКомиссию(ЭтотОбъект, ПараметрыКомиссии, Отказ);	
					
					КонецЕсли;
					
					ПараметрыКомиссии.Вставить("Закрывать7ойРазделПриПоступленииДенежныхСредств",	Закрывать7ойРазделПриПоступленииДенежныхСредств);
					
					БухгалтерскийУчетЕПС.ОплатитьКомиссиюНаЦБ(ЭтотОбъект,ПараметрыКомиссии, Отказ);
					
					КоличествоПоСделке = КоличествоПоСделке - ТекКоличество;
					СуммаКомиссииВВалютеКРаспределению 		= СуммаКомиссииВВалютеКРаспределению 		- СуммаКомиссииВВалюте;
					СуммаКомиссииВВалютеУчетаКРаспределению = СуммаКомиссииВВалютеУчетаКРаспределению 	- СуммаКомиссииВВалютеУчета;
				КонецЦикла;				
			КонецЦикла;
			
		ИначеЕсли НЕ НастройкиУчетаОбщие.ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты Тогда
			
			СуммаКомиссииВВалютеУчета 	= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссииВВалюте, ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			ПараметрыКомиссии.Вставить("СуммаКомисии", 						СуммаКомиссииВВалюте);
			ПараметрыКомиссии.Вставить("СуммаОперации", 					СуммаКомиссииВВалютеУчета);
			ПараметрыКомиссии.Вставить("ПредварительныеЗатратыПоСделке", 	Истина);
			ПараметрыКомиссии.Вставить("СуммаЧерезРасчеты",					СуммаКомиссииВВалютеУчета);
			ПараметрыКомиссии.Вставить("СуммаЧерезРасчетыВал",				СуммаКомиссииВВалюте);
			
			БухгалтерскийУчетЕПС.НачислитьКомиссию(ЭтотОбъект, ПараметрыКомиссии, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если НастройкиУчетаОбщие.ОтражатьПартииНаЛицевыхСчетах Тогда
		ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, Контрагент, КонтрагентЯвляетсяРезидентом, КонтрагентПоКомиссии, СчетДС, СубконтоДС, ВидСубконтоДС, Отказ);
	Иначе
		Если ЭтотОбъект.ОтложенноеИсполнение Тогда // только глава Г
			// если не день-в-день
			Если НачалоДня(ЭтотОбъект.ДатаОплаты) > НачалоДня(ЭтотОбъект.Дата) И НачалоДня(ЭтотОбъект.ДатаПоставки)	> НачалоДня(ЭтотОбъект.Дата) Тогда
				СформироватьПроводкиПоГлавеГДляСделкиТПлюс(КонтрагентЯвляетсяРезидентом, Отказ);
			КонецЕсли;
		Иначе // полноценные движения по бумагам и деньгам
			БухгалтерскийУчетЕПС.СформироватьПроводкиПокупкиПродажиЦеннойБумаги(ЭтотОбъект, Ссылка, УчетныйРегистр, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиПоГлавеГДляСделкиТПлюс(КонтрагентЯвляетсяРезидентом, Отказ)
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		
		НастройкиУчета = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиУчета(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления);	
			
		ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагКПолучению.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагКПолучению.Рынок КАК Рынок,
			|	БухПартииЦенныхБумагКПолучению.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	СУММА(БухПартииЦенныхБумагКПолучению.Количество) КАК Количество,
			|	СУММА(БухПартииЦенныхБумагКПолучению.Стоимость) КАК Стоимость,
			|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьКупона) КАК СтоимостьКупона,
			|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
			|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
			|	СУММА(БухПартииЦенныхБумагКПолучению.РасходыПриПокупкеВСтоимости) КАК РасходыПриПокупкеВСтоимости
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКПолучению КАК БухПартииЦенныхБумагКПолучению
			|ГДЕ
			|	БухПартииЦенныхБумагКПолучению.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумагКПолучению.ВидУчета = &ВидУчета
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииЦенныхБумагКПолучению.ЦеннаяБумага,
			|	БухПартииЦенныхБумагКПолучению.Рынок,
			|	БухПартииЦенныхБумагКПолучению.УчетныйАктивЕПС";
		
		Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ВалютаНоминала = ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала;
			
			СуммаЦБ = ВыборкаДетальныеЗаписи.Стоимость;
			СуммаЦБВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
			
			СуммаДС = ВыборкаДетальныеЗаписи.Стоимость;
			СуммаДСВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
			
			// для бумаг по АС в РасходыПриПокупкеВСтоимости попадает комиссия 
			// еще она же попадает и в Стоимость и в СтоимостьВВалютеУчета
			// а она на главе Г, как оказалось, никому не нужна
			// Тех.долг: добавить на регистр БухПартииЦенныхБумагКПолучению ресурс РасходыПриПокупкеВСтоимостиВВалютеУчета, в нынешнее время не сильно актуально, но нужно сделать
			//
			// Сейчас на РасходыПриПокупкеВСтоимости лежит рублевая сумма, а валютную приходится считать
			Если ВалютаНоминала = ВалютаУчета Тогда
				РасходыПриПокупкеВСтоимостиВВалютеНоминала = ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости; 
			Иначе	
				РасходыПриПокупкеВСтоимостиВВалютеНоминала = РаботаСВалютами.ПересчетСуммыВВалюте(ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости, ВалютаУчета,ЭтотОбъект.Дата, ВалютаНоминала, ЭтотОбъект.Дата, Отказ);
			КонецЕсли;
			
			СуммаЦБ = СуммаЦБ - РасходыПриПокупкеВСтоимостиВВалютеНоминала;
			СуммаЦБВВалютеУчета = СуммаЦБВВалютеУчета - ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости;
			
			// для задолженности по ДС на главе Г, она тем более не нужна
			СуммаДС = СуммаДС - РасходыПриПокупкеВСтоимостиВВалютеНоминала; 
			СуммаДСВВалютеУчета = СуммаДСВВалютеУчета - ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости;
			
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБВВалютеУчета, "Отражены требования по поставке ЦБ");
			
			// дебет
			Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ01, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ02);
			
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
			
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаДт = СуммаДС;
			Проводка.КоличествоДт = ВыборкаДетальныеЗаписи.Количество;
			
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаДСВВалютеУчета, "Отражены обязательства по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			
			// кредит
			Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
			Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
			
			Проводка.ВалютаКт = ЭтотОбъект.ВалютаСделки;
			Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаДСВВалютеУчета, ВалютаУчета, ЭтотОбъект.Дата, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата);
			
			
			Если ВыборкаДетальныеЗаписи.СтоимостьКупона <> 0 Тогда
			
				СуммаЦБ = ВыборкаДетальныеЗаписи.СтоимостьКупона;
				СуммаЦБВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБВВалютеУчета, "Отражены требования по поставке ЦБ");
				
				// дебет
				Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ01, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ02);
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
				
				ВалютаНоминала = ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала;
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = СуммаЦБ;
				
				Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБВВалютеУчета, "Отражены обязательства по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				// кредит
				Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
				Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
				
				Проводка.ВалютаКт = ЭтотОбъект.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаЦБВВалютеУчета, ВалютаУчета, ЭтотОбъект.Дата, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата);
			
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		
		Для каждого СтрокаДокумента из ЭтотОбъект.ЦенныеБумаги Цикл
			
			ВалютаНоминала = СтрокаДокумента.ЦеннаяБумага.ВалютаНоминала;
			
			СуммаВал = СтрокаДокумента.Сумма;
			СуммаВалЦБ = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, ВалютаНоминала, ЭтотОбъект.Дата, Отказ);
			СуммаВалДС = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, 
				ЭтотОбъект.ВалютаОплаты, ?(ЭтотОбъект.СобственныйКурсОплаты, ЭтотОбъект.КурсОплаты, ЭтотОбъект.Дата), Отказ);
				
			СуммаРубЦБ = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалЦБ, ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
			СуммаРубДС = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалДС, ЭтотОбъект.ВалютаОплаты, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубДС, "Отражены требования по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
			
			Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
			
			Проводка.ВалютаДт = ЭтотОбъект.ВалютаСделки;
			Проводка.ВалютнаяСуммаДт = СуммаВалДС;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубЦБ, "Отражены обязательства по поставке ЦБ");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			
			// кредит
			Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01);
			Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаДокумента.ЦеннаяБумага;
			
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = СуммаВалЦБ;
			Проводка.КоличествоКт = СтрокаДокумента.Количество;
			
			Если СтрокаДокумента.СуммаКупона <> 0 Тогда
			
				СуммаВал = СтрокаДокумента.СуммаКупона;
				СуммаВалЦБ = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, ВалютаНоминала, ЭтотОбъект.Дата, Отказ);
				СуммаВалДС = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, 
					ЭтотОбъект.ВалютаОплаты, ?(ЭтотОбъект.СобственныйКурсОплаты, ЭтотОбъект.КурсОплаты, ЭтотОбъект.Дата), Отказ);
					
				СуммаРубЦБ = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалЦБ, ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
				СуммаРубДС = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалДС, ЭтотОбъект.ВалютаОплаты, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
				
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубДС, "Отражены требования по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
				
				Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
				
				Проводка.ВалютаДт = ЭтотОбъект.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = СуммаВалДС;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
			
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубЦБ, "Отражены обязательства по поставке ЦБ");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				// кредит
				Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01);
				Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаДокумента.ЦеннаяБумага;
				
				Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
				Проводка.ВалютаКт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = СуммаВалЦБ;
			
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерииДоли(УчетныйРегистр, Отказ)
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ЭтотОбъект.ОтложенноеИсполнение Тогда
		Возврат;
	КонецЕсли;
	
	УчетныйАктив					= БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Рынок, Неопределено);
	НастройкиУчетаАктива			= БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, Организация, СчетДоверительногоУправления, УчетныйАктив, УчетныйРегистр);
	ВалютныйУчет					= НастройкиУчетаАктива.СчетУчета.Валютный;
	СчетРасчетаСКонтрагентами		= ПланыСчетов.Основной.РасчетыСКонтрагентами;
	СчетПрочиеРасходы				= ПланыСчетов.Основной.ПрочиеРасходы;
	СчетПрочиеДоходы				= ПланыСчетов.Основной.ПрочиеДоходы;
	ВидСубконтоУчетаЦеннойБумаги	= БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);
	
	СчетУчетаДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВалютаСделки,
		ЭтотОбъект.Брокер);
		
	Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
		
		Для Каждого ТекСтрока Из ЦенныеБумаги Цикл
			
			Если ТекСтрока.Количество > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Покупка доли");
				
				// Дт.
				Проводка.СчетДт = НастройкиУчетаАктива.СчетУчета;
				Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ТекСтрока.ЦеннаяБумага;
				
				Проводка.КоличествоДт = ТекСтрока.Количество;
				
				// Кт.
				Проводка.СчетКт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				
			КонецЕсли;
			
			Если ТекСтрока.Сумма > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата продавцу");
				
				// Дт.
				Проводка.СчетДт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				
				// Кт.
				Проводка.СчетКт = СчетУчетаДС;
				Проводка.СубконтоКт.БанковскиеСчета = РасчетныйСчет;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Граница",						Новый Граница(МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация",					Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("СчетУчетаАктивов",				НастройкиУчетаАктива.СчетУчета);
		Запрос.УстановитьПараметр("СчетУчетаПереоценки",			НастройкиУчетаАктива.СчетУчетаПереоценки);
		Запрос.УстановитьПараметр("ТЧ",								ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, Количество, Сумма"));
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЦенныеБумаги.ЦеннаяБумага КАК Доля,
			|	ЦенныеБумаги.Количество КАК Количество,
			|	ЦенныеБумаги.Сумма КАК Сумма
			|ПОМЕСТИТЬ _ТЧ
			|ИЗ
			|	&ТЧ КАК ЦенныеБумаги
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТЧ.Доля КАК Доля,
			|	СУММА(_ТЧ.Количество) КАК Количество,
			|	СУММА(_ТЧ.Сумма) КАК Сумма
			|ПОМЕСТИТЬ _ЦенныеБумаги
			|ИЗ
			|	_ТЧ КАК _ТЧ
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТЧ.Доля
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто1 КАК Доля,
			|	БухгалтерскийУчетОстатки.КоличествоОстатокДт КАК КоличествоОстаток,
			|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстаток
			|ПОМЕСТИТЬ _ОстаткиАктива
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Граница,
			|			Счет = &СчетУчетаАктивов,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Доли),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_ЦенныеБумаги.Доля КАК Доля
			|					ИЗ
			|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто1 КАК Доля,
			|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
			|ПОМЕСТИТЬ _ОстаткиПереоценки
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Граница,
			|			Счет = &СчетУчетаПереоценки,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Доли),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_ЦенныеБумаги.Доля КАК Доля
			|					ИЗ
			|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.Доля КАК Доля,
			|	_ЦенныеБумаги.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА _ОстаткиАктива.СуммаОстаток
			|				ИНАЧЕ _ОстаткиАктива.СуммаОстаток * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаДоля,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0)
			|				ИНАЧЕ ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаПереоценка,
			|	_ЦенныеБумаги.Сумма КАК Сумма
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиАктива КАК _ОстаткиАктива
			|		ПО _ЦенныеБумаги.Доля = _ОстаткиАктива.Доля
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПереоценки КАК _ОстаткиПереоценки
			|		ПО _ЦенныеБумаги.Доля = _ОстаткиПереоценки.Доля";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			// Себестоимость.
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаДоля, ВалютаСделки, Организация, Дата, Отказ), "Продажа доли");
			
			// Дт.
			Проводка.СчетДт = СчетПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.Доля;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается;
			
			// Кт.
			Проводка.СчетКт = НастройкиУчетаАктива.СчетУчета;
			Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.Доля;
			
			Проводка.КоличествоКт = Выборка.Количество;
			
			Если Выборка.СуммаПереоценка <> 0 Тогда
				
				// Переоценка.
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаПереоценка, ВалютаСделки, Организация, Дата, Отказ), "Продажа доли (переоценка)");
				
				// Дт.
				Проводка.СчетДт = СчетПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.Доля;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается;
				
				// Кт.
				Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
				Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.Доля;
				
			КонецЕсли;
			
			Если Выборка.Сумма > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Начисление дебиторской задолженности");
				
				// Дт.
				Проводка.СчетДт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				
				// Кт.
				Проводка.СчетКт = СчетПрочиеДоходы;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоКт.ЦенныеБумаги			= Выборка.Доля;
				Проводка.СубконтоКт.ОбращаетсяНаОРЦБ		= Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата от покупателя");
				
				// Дт.
				Проводка.СчетДт = СчетУчетаДС;
				Проводка.СубконтоДт.БанковскиеСчета = РасчетныйСчет;
				
				// Кт.
				Проводка.СчетКт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Если ЭтотОбъект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли") Тогда
		ПроведениеПоРегиструБухгалтерииДоли(УчетныйРегистр, Отказ);
		Возврат;
	ИначеЕсли  ЭтотОбъект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы") Тогда	
		ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлы(УчетныйРегистр, Отказ);
		Возврат;
	КонецЕсли;
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	БухгалтерскийУчет.СформироватьПроводкиПокупкиПродажиЦеннойБумагиБУНУ(ЭтотОбъект, УчетныйРегистр, Отказ);
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "НомерСделки, ВремяСделки");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Для сделок с отлагательным условием не контролируем даты. Для него они могут быть пустыми
	Если (ЭтотОбъект.ОтложенноеИсполнение) и (ЭтотОбъект.ПлатежноеУсловиеСделки <> "Delayed") Тогда
		Если ЭтотОбъект.РаздельноеИсполнение Тогда
			ПроверяемыеРеквизиты.Добавить("ДатаОплаты");
			ПроверяемыеРеквизиты.Добавить("ДатаПоставки");
		Иначе
			ПроверяемыеРеквизиты.Добавить("ДатаИсполнения");
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОплатыТорговойКомиссии");
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Количество") <> Неопределено И ЭтотОбъект.ПриобретениеПаев Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Количество"));
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Цена") <> Неопределено И ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Доли Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Цена"));
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	РаботаСДокументами.ЗаполнитьСтрокиПартии(ЭтотОбъект);

	Если ЭтотОбъект.ОтложенноеИсполнение И Не ЭтотОбъект.РаздельноеИсполнение Тогда
		ЭтотОбъект.ДатаОплаты   = ЭтотОбъект.ДатаИсполнения;
		ЭтотОбъект.ДатаПоставки = ЭтотОбъект.ДатаИсполнения;
	КонецЕсли;
		
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		РаботаСДокументами.ПроверитьУникальностьНомераСделки(ЭтотОбъект, Отказ);
		
		РаботаСДокументами.ПроверитьЗаполнениеРасчетногоСчета(ЭтотОбъект, Отказ);
		
		Если Не ЭтотОбъект.ОтложенноеИсполнение Тогда // даты исполнения, оплаты и поставки не д.б. заполнены
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИсполнения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата исполнения может быть заполнена только при отложенном исполнении сделки", ЭтотОбъект, "ДатаИсполнения",, Отказ);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОплаты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата оплаты может быть заполнена только при отложенном раздельном исполнении сделки", ЭтотОбъект, "ДатаОплаты",, Отказ);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаПоставки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата поставки может быть заполнена только при отложенном раздельном исполнении сделки", ЭтотОбъект, "ДатаПоставки",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.РаздельноеИсполнение Тогда // дата исполнения не д.б. заполнена
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИсполнения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата исполнения может быть заполнена только при отложенном, но не раздельном, исполнении сделки", ЭтотОбъект, "ДатаИсполнения",, Отказ);
			КонецЕсли;
		Иначе
			Если ЭтотОбъект.ВалютаОплаты <> ЭтотОбъект.ВалютаСделки Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта оплаты отличается от валюты сделки", ЭтотОбъект, "ВалютаОплаты",, Отказ);	
			КонецЕсли;
		КонецЕсли;
		
		// Если заполнены р/счет контрагента, то должен быть выбран правильный контрагент
		Если ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчетКонтрагента) Тогда
			Если ЭтотОбъект.РасчетныйСчетКонтрагента.ЮрФизЛицо <> ЭтотОбъект.Контрагент Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагент «" + ЭтотОбъект.Контрагент + "» не является владельцем р/счета «" + ЭтотОбъект.РасчетныйСчетКонтрагента + "».", ЭтотОбъект, "Рынок",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ТипЦеннойБумаги = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтотОбъект.Рынок);
		
		Для НомСтр = 0 По ЭтотОбъект.ЦенныеБумаги.Количество() - 1 Цикл
			
			СтрокаЦенныеБумаги = ЭтотОбъект.ЦенныеБумаги[НомСтр];
			
			// проверим, что рынок соответствует типу ценной бумаги
			Если Не ТипЦеннойБумаги.СодержитТип(ТипЗнч(СтрокаЦенныеБумаги.ЦеннаяБумага)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип ценной бумаги в строке № " + (НомСтр + 1) + " не соответствует рынку " + ЭтотОбъект.Рынок + ".",,,, Отказ);
			КонецЕсли;
			
			// для рынка векселей проверим количество
			Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя И СтрокаЦенныеБумаги.Количество <> 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество векселей в строке № " + (НомСтр + 1) + " отлично от 1. Обратитесь к разработчикам.",,,, Отказ);
			КонецЕсли;
			
			// цена и сумма купона могут быть заполнены только для облигаций
			Если ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Облигации Тогда
				
				Если СтрокаЦенныеБумаги.ЦенаКупона <> 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № " + (НомСтр + 1) + " заполнена цена купона при выбранном рынке ц/б «" + ЭтотОбъект.Рынок + "».",,,, Отказ);
				КонецЕсли;
				
				Если СтрокаЦенныеБумаги.СуммаКупона <> 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № " + (НомСтр + 1) + " заполнена сумма купона при выбранном рынке ц/б «" + ЭтотОбъект.Рынок + "».",,,, Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоПогашениеПаев() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Операция 'Погашение паёв' регистрируется документом 'Погашение ценных бумаг'", ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ПриобретениеПаев Тогда
			
			Если ЭтотОбъект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок")
				И НЕ ЭтотОбъект.МестоХранения.ПринадлежитЭлементу(ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок")) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приобретение паев доступно только для внебиржевых сделок.",,,, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.ВидСделки <> ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приобретение паев доступно только при виде сделки ""Покупка"".",,,, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приобретение паев доступно только для рынка ""Паи"".",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// т.к. по документу используется сводная форма в журнале
	РаботаСЖурналамиОпераций.ПередЗаписьюДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью

Процедура ПередУдалением(Отказ)
	
	// заполнение доп. свойств объекта перед удалением, т.к
	// в дальнейшем происходит обращение к доп. св-вам ЭтоНовый и ПредЗначенияРеквизитовШапки
	// при устанвке блокровки ЖурналОперацийБэкОфиса
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	РаботаСЖурналамиОпераций.ПередУдалениемДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

Функция ЭтоПогашениеПаев()
	
	Если ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Паи 
	 ИЛИ ЭтотОбъект.ВидСделки <> Перечисления.ВидыСделок.Продажа Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЦенныеБумаги",	ЭтотОбъект.ЦенныеБумаги.ВыгрузитьКолонку("ЦеннаяБумага"));
	Запрос.УстановитьПараметр("Период",			ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Контрагент",		ЭтотОбъект.Контрагент);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Паи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Паи КАК Паи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО Паи.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|ГДЕ
		|	Паи.Ссылка В(&ЦенныеБумаги)
		|	И РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо = &Контрагент";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

Процедура ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлы(УчетныйРегистр, Отказ)
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	УчетныйАктив					= БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Рынок, Неопределено);
	НастройкиУчетаАктива			= БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, Организация, СчетДоверительногоУправления, УчетныйАктив, УчетныйРегистр);
	ВалютныйУчет					= НастройкиУчетаАктива.СчетУчета.Валютный;
	СчетПрочиеРасходы				= ПланыСчетов.Основной.ПрочиеРасходы;
	СчетПрочиеДоходы				= ПланыСчетов.Основной.ПрочиеДоходы;
	ВидСубконтоУчетаЦеннойБумаги	= БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);
	
	СчетУчетаДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВалютаСделки,
		ЭтотОбъект.Брокер);
		
	СчетУчетаКомиссии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
		УчетныйРегистр,
		"СчетУчета");
		
	СчетУчетаКомиссииБрокера = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии,
		УчетныйРегистр,
		"СчетУчета");
		
	СчетУчетаДСДляКомиссии = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ВалютаТорговойКомиссии,
		Брокер);	
		
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйРегистр,
		Отказ);
		
	АналитикаУслуг = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
		УчетныйРегистр,
		"Аналитика");			
		
	ОплачиватьКомиссию = Не ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии;
	
	ЕстьСубконтоКонтрагентыПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);						
	
	Если ЕстьСубконтоКонтрагентыПоКомиссии Тогда
		Если Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			КонтрагентПоКомиссии = Брокер.ЮрФизЛицо;
		Иначе
			КонтрагентПоКомиссии = Контрагент;
		КонецЕсли
	КонецЕсли;
	
	ЕстьСубконтоСделкиПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено);
	ЕстьСубконтоДоговорБрокерскогоОбслуживанияПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено);
	
	СубконтоДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, Брокер, ЭтотОбъект.Дата);
	
	ОтложенноеИсполнение = ЭтотОбъект.ОтложенноеИсполнение;
	
	Если Не ОтложенноеИсполнение Тогда
		Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
			
			СчетРасчетаСКонтрагентами		= ПланыСчетов.Основной.РасчетыПоПокупкамТБС;
			
			Для Каждого ТекСтрока Из ЦенныеБумаги Цикл
				
				Если ТекСтрока.Количество > 0 Тогда
					
					//58.16.1/ 76.21.2 стоимость покупки
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Покупка ТБС");
					
					// Дт.
					Проводка.СчетДт = НастройкиУчетаАктива.СчетУчета;
					Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ТекСтрока.ЦеннаяБумага;
					
					Проводка.КоличествоДт = ТекСтрока.Количество;
					
					Если НастройкиУчетаАктива.СчетУчета.Валютный Тогда
						Проводка.ВалютнаяСуммаДт = ТекСтрока.Сумма;
						Проводка.ВалютаДт = ВалютаСделки;
					КонецЕсли;
					
					// Кт.
					Проводка.СчетКт = СчетРасчетаСКонтрагентами;
					Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
					Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
					
					Если СчетРасчетаСКонтрагентами.Валютный Тогда
						Проводка.ВалютнаяСуммаКт = ТекСтрока.Сумма;
						Проводка.ВалютаКт = ВалютаСделки;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТекСтрока.Сумма > 0 Тогда
					
					//76.21.2/55.4 оплата по сделке
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата продавцу");
					
					// Дт.
					Проводка.СчетДт = СчетРасчетаСКонтрагентами;
					Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
					Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
					Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
					
					Если СчетРасчетаСКонтрагентами.Валютный Тогда
						Проводка.ВалютнаяСуммаДт = ТекСтрока.Сумма;
						Проводка.ВалютаДт = ВалютаСделки;
					КонецЕсли;
					
					// Кт.
					Проводка.СчетКт = СчетУчетаДС;
					Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
						Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
					КонецЕсли;
					
					Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
						Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
					КонецЕсли;
					
					Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
						Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
					КонецЕсли;
					
					Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
						Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
					КонецЕсли;			
					
					Если СчетУчетаДС.Валютный Тогда
						Проводка.ВалютнаяСуммаКт = ТекСтрока.Сумма;
						Проводка.ВалютаКт = ВалютаСделки;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			СчетРасчетаСКонтрагентами		= ПланыСчетов.Основной.РасчетыПоПродажамТБС;
			СчетЗатратВСтоимости		= ПланыСчетов.Основной.ЗатратыНаПриобретениеТБС;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Граница",						Новый Граница(МоментВремени(), ВидГраницы.Исключая));
			Запрос.УстановитьПараметр("Организация",					Организация);
			Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
			Запрос.УстановитьПараметр("СчетУчетаАктивов",				НастройкиУчетаАктива.СчетУчета);
			Запрос.УстановитьПараметр("СчетУчетаПереоценки",			НастройкиУчетаАктива.СчетУчетаПереоценки);
			Запрос.УстановитьПараметр("СчетЗатратВСтоимости",			СчетЗатратВСтоимости);
			Запрос.УстановитьПараметр("ТЧ",								ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, Количество, Сумма"));
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
				|	ЦенныеБумаги.Количество КАК Количество,
				|	ЦенныеБумаги.Сумма КАК Сумма
				|ПОМЕСТИТЬ _ТЧ
				|ИЗ
				|	&ТЧ КАК ЦенныеБумаги
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ТЧ.ЦеннаяБумага КАК ЦеннаяБумага,
				|	СУММА(_ТЧ.Количество) КАК Количество,
				|	СУММА(_ТЧ.Сумма) КАК Сумма
				|ПОМЕСТИТЬ _ЦенныеБумаги
				|ИЗ
				|	_ТЧ КАК _ТЧ
				|
				|СГРУППИРОВАТЬ ПО
				|	_ТЧ.ЦеннаяБумага
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
				|	БухгалтерскийУчетОстатки.КоличествоОстатокДт КАК КоличествоОстаток,
				|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстаток,
				|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстаток,
				|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
				|ПОМЕСТИТЬ _ОстаткиАктива
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&Граница,
				|			Счет = &СчетУчетаАктивов,
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
				|				И Субконто1 В
				|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|						_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
				|					ИЗ
				|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
				|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
				|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
				|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
				|ПОМЕСТИТЬ _ОстаткиПереоценки
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&Граница,
				|			Счет = &СчетУчетаПереоценки,
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
				|				И Субконто1 В
				|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|						_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
				|					ИЗ
				|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
				|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
				|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
				|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
				|ПОМЕСТИТЬ _ОстаткиЗатраты
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&Граница,
				|			Счет = &СчетЗатратВСтоимости,
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
				|				И Субконто1 В
				|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|						_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
				|					ИЗ
				|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
				|	_ЦенныеБумаги.Количество КАК Количество,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ ВЫБОР
				|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
				|					ТОГДА _ОстаткиАктива.СуммаОстаток
				|				ИНАЧЕ _ОстаткиАктива.СуммаОстаток * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаЦеннаяБумага,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ ВЫБОР
				|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
				|					ТОГДА ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0)
				|				ИНАЧЕ ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаПереоценка,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ ВЫБОР
				|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
				|					ТОГДА ЕСТЬNULL(_ОстаткиЗатраты.СуммаОстаток, 0)
				|				ИНАЧЕ ЕСТЬNULL(_ОстаткиЗатраты.СуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаЗатратыВСтоимости,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ ВЫБОР
				|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
				|					ТОГДА _ОстаткиАктива.ВалютнаяСуммаОстаток
				|				ИНАЧЕ _ОстаткиАктива.ВалютнаяСуммаОстаток * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаВалютнаяЦеннаяБумага,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ ВЫБОР
				|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
				|					ТОГДА ЕСТЬNULL(_ОстаткиПереоценки.ВалютнаяСуммаОстаток, 0)
				|				ИНАЧЕ ЕСТЬNULL(_ОстаткиПереоценки.ВалютнаяСуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаВалютнаяПереоценка,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ ВЫБОР
				|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
				|					ТОГДА ЕСТЬNULL(_ОстаткиЗатраты.ВалютнаяСуммаОстаток, 0)
				|				ИНАЧЕ ЕСТЬNULL(_ОстаткиЗатраты.ВалютнаяСуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаВалютнаяЗатратыВСтоимости,
				|	_ЦенныеБумаги.Сумма КАК Сумма,
				|	_ОстаткиАктива.Валюта КАК ВалютаЦеннаяБумага,
				|	_ОстаткиПереоценки.Валюта КАК ВалютаПереоценка,
				|	_ОстаткиЗатраты.Валюта КАК ВалютаЗатратыВСтоимости
				|ИЗ
				|	_ЦенныеБумаги КАК _ЦенныеБумаги
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиАктива КАК _ОстаткиАктива
				|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ОстаткиАктива.ЦеннаяБумага
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПереоценки КАК _ОстаткиПереоценки
				|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ОстаткиПереоценки.ЦеннаяБумага
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЗатраты КАК _ОстаткиЗатраты
				|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ОстаткиЗатраты.ЦеннаяБумага";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Сумма > 0 Тогда
					
					//76.21.1/91.01 отражена выручка по сделке
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Начисление дебиторской задолженности");
					
					// Дт.
					Проводка.СчетДт = СчетРасчетаСКонтрагентами;
					Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
					Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
					Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
					
					Если СчетРасчетаСКонтрагентами.Валютный Тогда
						Проводка.ВалютнаяСуммаДт = Выборка.Сумма;
						Проводка.ВалютаДт = ВалютаСделки;
					КонецЕсли;
					
					// Кт.
					Проводка.СчетКт = СчетПрочиеДоходы;
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоКт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
					Проводка.СубконтоКт.ОбращаетсяНаОРЦБ		= Ложь;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата от покупателя");
					
					// Дт.
					Проводка.СчетДт = СчетУчетаДС;
					Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
						Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
					КонецЕсли;
					
					Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
						Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
					КонецЕсли;
					
					Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
						Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
					КонецЕсли;
					
					Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
						Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПродажаТБС;
					КонецЕсли;			
					
					Если СчетУчетаДС.Валютный Тогда
						Проводка.ВалютнаяСуммаДт = Выборка.Сумма;
						Проводка.ВалютаДт = ВалютаСделки;
					КонецЕсли;
					
					// Кт.
					Проводка.СчетКт = СчетРасчетаСКонтрагентами;
					Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
					Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
					
					Если СчетРасчетаСКонтрагентами.Валютный Тогда
						Проводка.ВалютнаяСуммаКт = Выборка.Сумма;
						Проводка.ВалютаКт = ВалютаСделки;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Выборка.СуммаЦеннаяБумага <> 0 Или Выборка.СуммаВалютнаяЦеннаяБумага <> 0 Тогда
					// 91.02 /58.16.1 списана себестоимость
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаЦеннаяБумага, ВалютаСделки, Организация, Дата, Отказ), "Продажа ТБС");
					
					// Дт.
					Проводка.СчетДт = СчетПрочиеРасходы;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
					
					// Кт.
					Проводка.СчетКт = НастройкиУчетаАктива.СчетУчета;
					Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.ЦеннаяБумага;
					
					Проводка.КоличествоКт = Выборка.Количество;
					
					Если НастройкиУчетаАктива.СчетУчета.Валютный Тогда
						Проводка.ВалютнаяСуммаКт = Выборка.СуммаВалютнаяЦеннаяБумага;
						Проводка.ВалютаКт = Выборка.ВалютаЦеннаяБумага;
					КонецЕсли;
				КонецЕсли;
				
				Если Выборка.СуммаПереоценка <> 0 Или Выборка.СуммаВалютнаяПереоценка <> 0  Тогда
					
					// 91.02/58.16.2 списана положительная переоценка
					// 91.02/58.16.2 (..) списана отрицательная переоценка
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаПереоценка, ВалютаСделки, Организация, Дата, Отказ), "Продажа ТБС (переоценка)");
					
					// Дт.
					Проводка.СчетДт = СчетПрочиеРасходы;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
					
					// Кт.
					Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
					Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.ЦеннаяБумага;
					
					Если НастройкиУчетаАктива.СчетУчетаПереоценки.Валютный Тогда
						Проводка.ВалютнаяСуммаКт = Выборка.СуммаВалютнаяПереоценка;
						Проводка.ВалютаКт = Выборка.ВалютаПереоценка;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Выборка.СуммаЗатратыВСтоимости <> 0 Или Выборка.СуммаВалютнаяЗатратыВСтоимости <> 0  Тогда
					
					// 91.02/58.16.3 списаны затраты по покупке
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаЗатратыВСтоимости, ВалютаСделки, Организация, Дата, Отказ), "Продажа ТБС (затраты в стоимости)");
					
					// Дт.
					Проводка.СчетДт = СчетПрочиеРасходы;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
					
					// Кт.
					Проводка.СчетКт = СчетЗатратВСтоимости;
					Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.ЦеннаяБумага;
					
					Если СчетЗатратВСтоимости.Валютный Тогда
						Проводка.ВалютнаяСуммаКт = Выборка.СуммаВалютнаяЗатратыВСтоимости;
						Проводка.ВалютаКт = Выборка.ВалютаЗатратыВСтоимости;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// КОМИССИЯ
	ЭтоСделка = Истина;
	Сделка = ЭтотОбъект.Ссылка;
	ВыделятьРасходыПриПродаже = Ложь;
	Если (ВидСделки = Перечисления.ВидыСделок.Продажа) Тогда
		ВыделятьРасходыПриПродаже = НастройкиПоВидуУчета.ВыделятьРасходыПриПродаже;
	КонецЕсли;
	
	Если ЭтоСделка И НастройкиПоВидуУчета.МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Начисления Тогда
		НачислятьКомиссию = Истина;
		
		Если ЭтотОбъект.ОтложенноеИсполнение
			И ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР
			И ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
			НачислятьКомиссию = Ложь;
		КонецЕсли;
		
		Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
			Если ЭтотОбъект.ОтложенноеИсполнение Тогда
				НачислятьКомиссию = Истина;
				ИспользоватьСчет7616 = Истина;
			Иначе
				Если ВидСделки = Перечисления.ВидыСделок.Покупка И НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
					НачислятьКомиссию = Ложь; // на 58ой отправит ниже проведение
				Иначе
					НачислятьКомиссию = Истина;
					ИспользоватьСчет7616 = Ложь;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НачислятьКомиссию Тогда
			
			ИспользоватьСчет7616 = Ложь;
			Если (ВидСделки = Перечисления.ВидыСделок.Покупка) 
				И (НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость)
				И (ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Фьючерсы) Тогда
				ИспользоватьСчет7616 = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		ТаблицаКомиссий = ЭтотОбъект.ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, ТорговаяКомиссия");
		ТаблицаКомиссий.Колонки.Добавить("Валюта");
		ТаблицаКомиссий.Колонки.Добавить("ВидЗадолженности");
		
		ТаблицаКомиссий.ЗаполнитьЗначения(ВалютаТорговойКомиссии, "Валюта");
		ТаблицаКомиссий.ЗаполнитьЗначения(Справочники.ВидыЗадолженности.ПоТорговойКомиссии, "ВидЗадолженности");
		
		ОбъектКомиссииСсылка = ЭтотОбъект.Ссылка;
		
	ИначеЕсли ЭтоСделка И НастройкиПоВидуУчета.МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Кассовый Тогда
		
		Если ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии Тогда
			НачислятьКомиссию = Ложь;
		Иначе
			
			Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
				
				Если ЭтотОбъект.ОтложенноеИсполнение Тогда
					НачислятьКомиссию = Истина;
					
					Если ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
						ИспользоватьСчет7616 = Истина;
					Иначе	
						ИспользоватьСчет7616 = Ложь;
					КонецЕсли;
				Иначе
					Если ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
						НачислятьКомиссию = Ложь; // на 58ой отправит ниже проведение
						ИспользоватьСчет7616 = Ложь;
					Иначе
						НачислятьКомиссию = Истина;
						ИспользоватьСчет7616 = Ложь;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				НачислятьКомиссию = Истина;
				ИспользоватьСчет7616 = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТаблицаКомиссий = ЭтотОбъект.ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, ТорговаяКомиссия");
		ТаблицаКомиссий.Колонки.Добавить("Валюта");
		ТаблицаКомиссий.Колонки.Добавить("ВидЗадолженности");
		
		ТаблицаКомиссий.ЗаполнитьЗначения(ВалютаТорговойКомиссии, "Валюта");
		ТаблицаКомиссий.ЗаполнитьЗначения(Справочники.ВидыЗадолженности.ПоТорговойКомиссии, "ВидЗадолженности");
		
		ОбъектКомиссииСсылка = ЭтотОбъект.Ссылка;
		
	Иначе	
		НачислятьКомиссию = Ложь;
		ИспользоватьСчет7616 = Ложь;
		
		ТаблицаКомиссий = Неопределено;
	КонецЕсли;
	
	Если (НачислятьКомиссию Или ОплачиватьКомиссию) И ТаблицаКомиссий <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СубконтоДоговорыБрокерскогоОбслуживания) Тогда			
			СубконтоДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, Брокер, ЭтотОбъект.Дата);
		КонецЕсли;	
		
		Для Каждого СтрокаТаблицыКомиссий Из ТаблицаКомиссий Цикл
			
			Если СтрокаТаблицыКомиссий.ТорговаяКомиссия = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если НачислятьКомиссию Тогда
				
				ОбращаетсяНаОРЦБ = Ложь;
				
				// ТОРГОВАЯ КОМИССИЯ НА 76.16 ИЛИ РАСХОДЫ
				Если ЗначениеЗаполнено(СтрокаТаблицыКомиссий.Валюта) Тогда
					ТорговаяКомиссияВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
						СтрокаТаблицыКомиссий.ТорговаяКомиссия,
						СтрокаТаблицыКомиссий.Валюта,
						ЭтотОбъект.Организация,
						ЭтотОбъект.Дата,
						Отказ);	
				Иначе
					ТорговаяКомиссияВВалютеУчета = СтрокаТаблицыКомиссий.ТорговаяКомиссия;
				КонецЕсли;	
					
				ДанныеАналитики = Новый Структура("Сделка, ВидЗадолженности", ОбъектКомиссииСсылка, Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], ТорговаяКомиссияВВалютеУчета, "Поступление услуг", ДанныеАналитики);
				
				// дебет
				Если ИспользоватьСчет7616 Тогда
				
					Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоКомиссии;
					
					Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
					Проводка.СубконтоДт.Сделка      = Сделка;
					
				ИначеЕсли ВыделятьРасходыПриПродаже Тогда
					
					БухгалтерскийУчет.ЗаполнитьАналитикуРасходов(
						ЭтотОбъект,
						Проводка.СчетДт,
						Проводка.СубконтоДт,
						ПланыСчетов.Основной.ПрочиеРасходы,
						АналитикаУслуг,
						СтрокаТаблицыКомиссий.ЦеннаяБумага,
						ОбращаетсяНаОРЦБ);
						
				Иначе
					
					УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(
						ЭтотОбъект.Дата,
						ЭтотОбъект.Рынок,
						СтрокаТаблицыКомиссий.ЦеннаяБумага);
					
					НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
						ЭтотОбъект.Дата,
						ЭтотОбъект.Организация,
						ЭтотОбъект.СчетДоверительногоУправления,
						УчетныйАктив,
						УчетныйРегистр);		
								
					Если (ВидСделки = Перечисления.ВидыСделок.Покупка И Не НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость) Или (ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы) Тогда
						АналитикаПроводки = АналитикаУслуг;
					Иначе	
						АналитикаПроводки = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;	
					КонецЕсли;
						
					БухгалтерскийУчет.ЗаполнитьАналитикуРасходов(
						ЭтотОбъект,
						Проводка.СчетДт,
						Проводка.СубконтоДт,
						ПланыСчетов.Основной.ПрочиеРасходы,
						АналитикаПроводки,
						СтрокаТаблицыКомиссий.ЦеннаяБумага,
						ОбращаетсяНаОРЦБ);
						
				КонецЕсли;
				
				// кредит
				Проводка.СчетКт = СчетУчетаКомиссии;
				
				Если ЕстьСубконтоКонтрагентыПоКомиссии Тогда
					Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
				КонецЕсли;
				
				Если ЕстьСубконтоСделкиПоКомиссии Тогда
					Проводка.СубконтоКт.Сделка = ОбъектКомиссииСсылка;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговорБрокерскогоОбслуживанияПоКомиссии Тогда
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ОплачиватьКомиссию Тогда
			
				// торговую комиссию Деньги -> Комисия 
				// а на расходы комиссию спишет исполнение
				
				Если ЗначениеЗаполнено(СтрокаТаблицыКомиссий.Валюта) Тогда
					ТорговаяКомиссияВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
						СтрокаТаблицыКомиссий.ТорговаяКомиссия,
						СтрокаТаблицыКомиссий.Валюта,
						ЭтотОбъект.Организация,
						ЭтотОбъект.Дата,
						Отказ);	
				Иначе
					ТорговаяКомиссияВВалютеУчета = СтрокаТаблицыКомиссий.ТорговаяКомиссия;		
				КонецЕсли;		
					
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], ТорговаяКомиссияВВалютеУчета, "Списание торговой комиссии");
				
				// дебет
				Проводка.СчетДт = СчетУчетаКомиссии;
				
				Если ЕстьСубконтоКонтрагентыПоКомиссии Тогда
					Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
				КонецЕсли;
				
				Если ЕстьСубконтоСделкиПоКомиссии Тогда
					Проводка.СубконтоДт.Сделка = Сделка;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговорБрокерскогоОбслуживанияПоКомиссии Тогда
					Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				КонецЕсли;
				
				// кредит
				Проводка.СчетКт = СчетУчетаДСДляКомиссии;
				
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
					Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
				КонецЕсли;
				
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
					Проводка.СубконтоКт.БрокерскиеКомпании              = Брокер;
				КонецЕсли;
				
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				КонецЕсли;
				
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
					Если ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
						ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупкаТБС;
					ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
						ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажаТБС;
					КонецЕсли;	
					Проводка.СубконтоКт.ВидДвиженияДенежныхСредств              = ВидДвиженияДенежныхСредств;
				КонецЕсли;			
							
				Если СчетУчетаДСДляКомиссии.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = СтрокаТаблицыКомиссий.ТорговаяКомиссия;
					Проводка.ВалютаКт = СтрокаТаблицыКомиссий.Валюта;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры
