
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация    = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ВариантРасчета = 0; // ИИС
	
	Объект.ПериодичностьРасчета	= Перечисления.ПериодичностьРасчетаВознагражденияУправляющего.Ежеквартально;
	Объект.ВидВознаграждения	= Перечисления.ВидыВознагражденийУправляющего.ВознаграждениеУправляющего;
	
	Объект.ДатаРасчета = ПолучитьДатуРасчета(Объект.ВариантРасчета, Объект.ПериодичностьРасчета);
	
	ОбновитьСоставПечатныхФормНаСервере();
	
	ОбновитьПериодДляПечати(ЭтаФорма, Объект);
	
	Элементы.ВознагражденияУправляющегоСтратегия.Видимость = (Объект.ВариантРасчета = 0);
	
	Элементы.СтраницаВознаграждениеУправляющегоПлатаЗаРазмещение.Видимость = (Объект.ВариантРасчета = 0);
	
	РеквизитыНачисления = ПолучитьЗаполняемыеРеквизитыНачисленияПоУмолчанию(Объект.Организация);
	
	Если Не ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		Объект.РасчетныйСчет = РеквизитыНачисления.РасчетныйСчет;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПрочиеДоходыИРасходы) Тогда
		Объект.ПрочиеДоходыИРасходы = РеквизитыНачисления.ПрочиеДоходыИРасходы;
	КонецЕсли;
	
	ЭтаФорма.ЗаполнятьДанныеБухгалтерииОбУдержанномВознаграждении = Истина;
	ЭтаФорма.ВыводитьКартинкиВРасшифровке						  = Истина;
	
	Элементы.ГруппаОтбор.Заголовок = ""; // Очищаю здесь, чтобы в конфигураторе был виден заголовок
	
	ЭтаФорма.Модифицированность = Истина;		
	
	// Настройки в зависимости от полных прав
	
	ЭтаФорма.ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Элементы.Организация.Видимость        = ЭтаФорма.ЭтоПолноправныйПользователь;
	Элементы.ОрганизацияНадпись.Видимость = Не ЭтаФорма.ЭтоПолноправныйПользователь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

	ЭтаФорма.СтруктураДанныхКонтактногоЛица				= Настройки.Получить("СтруктураДанныхКонтактногоЛица");
	ЭтаФорма.СтруктураДанныхКонтактногоЛицаБухгалтера	= Настройки.Получить("СтруктураДанныхКонтактногоЛицаБухгалтера");	
	
	ПроверитьНастройкиПодписантов(ЭтаФорма);
	
	ПривестиОтборыВСоответствиеОрганизации(ЭтаФорма);
	
	Если Не ЭтаФорма.ЭтоПолноправныйПользователь Тогда
		ЭтаФорма.ЗаполнятьДанныеБухгалтерииОбУдержанномВознаграждении = Истина; // по умолчанию для обычных прав
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодДляПечатиПриИзменении(Неопределено);
	
	ПриИзмененииОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРасчетаПриИзменении(Элемент)
	
	ОчиститьДанные(ЭтаФорма);
	
	ПриИзмененииРежимаРасчетаНаСервере();	
	
	ПериодДляПечатиПриИзменении(Неопределено);
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПроверитьНастройкиПодписантов(ЭтаФорма);
	
	ПривестиОтборыВСоответствиеОрганизации(ЭтаФорма);
	
	ПриИзмененииОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
	
	ОчиститьДанные(ЭтаФорма);	
	
	ОбновитьПериодДляПечати(ЭтаФорма, Объект);
	
	ПериодДляПечатиПриИзменении(Неопределено);
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура АгентскийДоговорПриИзменении(Элемент)
	
	ОчиститьДанные(ЭтаФорма);
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьРасчетаПриИзменении(Элемент)
	
	НоваяДатаРасчета = ПолучитьДатуРасчета(Объект.ВариантРасчета, Объект.ПериодичностьРасчета);
	
	Если Объект.ДатаРасчета <> НоваяДатаРасчета Тогда
		
		ОтветНаВопрос = Вопрос(СтрШаблон("Установить расчет на дату %1 ?", Формат(НоваяДатаРасчета, "ДФ=dd.MM.yyyy")), РежимДиалогаВопрос.ДаНет);
			
		Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
			Объект.ДатаРасчета = НоваяДатаРасчета;
		КонецЕсли;
		
	КонецЕсли;
	
	ОчиститьДанные(ЭтаФорма);	
	
	ОбновитьПериодДляПечати(ЭтаФорма, Объект);
	
	ПериодДляПечатиПриИзменении(Неопределено);
	
	ЭтаФорма.Модифицированность = Истина;		
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВознагражденияПриИзменении(Элемент)

	ОчиститьДанные(ЭтаФорма);	
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантНачалоВыбора(ЭтаФорма, Элемент, ЭтаФорма.Подписант, Объект.Организация, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ЭтаФорма.СтруктураДанныхКонтактногоЛица, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	РаботаСОтчетамиКлиент.ПодписантПриИзменении(ЭтаФорма.Подписант, ЭтаФорма.СтруктураДанныхКонтактногоЛица);
	
	ЗаполнитьРеквизитыПодписантаИзСтруктурыДанныхКонтактногоЛица(ЭтаФорма.СтруктураДанныхКонтактногоЛица, , ЭтаФорма.ПодписантДолжность, ЭтаФорма.ПодписантОснованиеПолномочий);
	
	УстановитьЗаголовокНастроекПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантБухгалтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантНачалоВыбора(ЭтаФорма, Элемент, ЭтаФорма.ПодписантБухгалтер, Объект.Организация, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантБухгалтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ЭтаФорма.СтруктураДанныхКонтактногоЛицаБухгалтера, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантБухгалтерПриИзменении(Элемент)
	
	РаботаСОтчетамиКлиент.ПодписантПриИзменении(ЭтаФорма.ПодписантБухгалтер, ЭтаФорма.СтруктураДанныхКонтактногоЛицаБухгалтера);
	
	ЗаполнитьРеквизитыПодписантаИзСтруктурыДанныхКонтактногоЛица(ЭтаФорма.СтруктураДанныхКонтактногоЛицаБухгалтера, , ЭтаФорма.ПодписантБухгалтерДолжность);
	
	УстановитьЗаголовокНастроекПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДляПечатиПриИзменении(Элемент)
	
	ПустойПериод = Новый СтандартныйПериод('00010101', '00010101');
	
	Если ЭтотОбъект.ПериодДляПечати <> ПустойПериод Тогда
		
		ТекстСообщения = "";
	
		Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ЭтотОбъект.ПериодДляПечати,,, ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "ПериодДляПечати");
			Возврат;
		КонецЕсли;

		ИзменитьСостояниеФлажковВознагражденияУправляющего(Истина, "ВознагражденияУправляющегоПлатаЗаРазмещение", ЭтотОбъект.ПериодДляПечати);
	Иначе
		ИзменитьСостояниеФлажковВознагражденияУправляющего(Истина, "ВознагражденияУправляющегоПлатаЗаРазмещение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВознагражденияУправляющегоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВознагражденияУправляющегоСчетДоверительногоУправления"
		Или Поле.Имя = "ВознагражденияУправляющегоНачисление" 
		Или Поле.Имя = "ВознагражденияУправляющегоСуммаВознаграждения"
		Или Поле.Имя = "ВознагражденияУправляющегоСуммаНачисления"
		Или Поле.Имя = "ВознагражденияУправляющегоОписание"
	Тогда
	
		СтандартнаяОбработка = Ложь;	
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если Поле.Имя = "ВознагражденияУправляющегоСуммаВознаграждения" Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.РасшифровкаОшибки) Тогда
				ВвестиСтроку(ТекущиеДанные.РасшифровкаОшибки, "Расшифровка ошибки расчета", , Истина);
			ИначеЕсли Объект.ВариантРасчета = 3 Тогда // Прочие
				Если Вопрос(СтрШаблон("Расшифровать расчет вознаграждения %1?", ТекущиеДанные.СчетДоверительногоУправления), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					СформироватьРасчетВознаграждения(РаботаСКоллекциями.ЗначениеВМассив(ТекущиеДанные.СчетДоверительногоУправления));		
				КонецЕсли;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если Поле.Имя = "ВознагражденияУправляющегоСуммаНачисления" Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.РасшифровкаОшибкиНачисления) Тогда
				ВвестиСтроку(ТекущиеДанные.РасшифровкаОшибкиНачисления, "Расшифровка ошибки расчета", , Истина);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если Поле.Имя = "ВознагражденияУправляющегоНачисление" И ТипЗнч(ТекущиеДанные.Начисление) = Тип("СписокЗначений") Тогда
			ВыбранныйЭлемент = ВыбратьИзСписка(ТекущиеДанные.Начисление, Поле); 
			Если ВыбранныйЭлемент <> Неопределено Тогда
				ОткрытьЗначение(ВыбранныйЭлемент.Значение);	
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если Поле.Имя = "ВознагражденияУправляющегоОписание" Тогда
							
			ДанныеНастроек = ?(Объект.ВариантРасчета = 2,
									ПолучитьНастройкуРасчетаВознагражденияПИФ(ТекущиеДанные.СчетДоверительногоУправления, Объект.ДатаРасчета),
									ПолучитьКлючНастроекРасчетаВознаграждения(Объект.Организация, ТекущиеДанные.СчетДоверительногоУправления, Объект.ВидВознаграждения, Объект.ДатаРасчета));
									
			Если ЗначениеЗаполнено(ДанныеНастроек) Тогда
				ОткрытьФормуМодально(?(Объект.ВариантРасчета = 2,
										"Справочник.НастройкиРасчета.Форма.ФормаЭлемента",
										"РегистрСведений.НастройкиРасчетаВознагражденияУправляющего.ФормаЗаписи"),
										Новый Структура("Ключ", ДанныеНастроек), ЭтаФорма); 
			Иначе
				Предупреждение("Настройки расчета вознаграждения не найдены!");
			КонецЕсли;
			Возврат;
            		
		КонецЕсли;
		
		ЗначениеПоля = Элемент.ТекущиеДанные[Сред(Поле.Имя, СтрДлина(Элемент.Имя) + 1)];
		Если ЗначениеПоля = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ОткрытьЗначение(ЗначениеПоля);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементОтбораПриИзменении(Элемент)
	
	Перем СчетаСоответствующиеОрганизации, СчетаНеСоответствующиеОрганизации;
	
	Если ЭтаФорма.ЭтоПолноправныйПользователь
		И Элемент = Элементы.ОтборСчетДоверительногоУправленияСписок
		И Не ПроверитьСчетаНаСоответствиеОрганизации(Объект.Организация, ЭтаФорма.ОтборСчетДоверительногоУправления, СчетаСоответствующиеОрганизации, СчетаНеСоответствующиеОрганизации)
	Тогда
		
		ПривестиОтборыВСоответствиеОрганизации(ЭтаФорма, СчетаСоответствующиеОрганизации);
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Счета д/у, не соответствующие организации %1, были удалены из отбора: %2", Объект.Организация, СтрСоединить(СчетаНеСоответствующиеОрганизации, ", ")));
	
	КонецЕсли;
	
	ПриИзмененииОтбора();
	
КонецПроцедуры

// Подключенные обработчики

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
	ОрганизацияПриИзменении(Элементы.Организация);	
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловExcelНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыбораКаталога                    = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = ЭтаФорма.КаталогФайловExcel;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок	        = "Выберите каталог с Файлами";
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.КаталогФайловExcel = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловExcelОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПустаяСтрока(ЭтаФорма.КаталогФайловExcel) Тогда				
		ЗапуститьПриложение(ЭтаФорма.КаталогФайловExcel);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	ИзменитьСостояниеФлажковВознагражденияУправляющего(Истина, "ВознагражденияУправляющего");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	ИзменитьСостояниеФлажковВознагражденияУправляющего(Ложь, "ВознагражденияУправляющего");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажкиПлатаЗаРазмещение(Команда)
	
	ИзменитьСостояниеФлажковВознагражденияУправляющего(Истина, "ВознагражденияУправляющегоПлатаЗаРазмещение");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажкиПлатаЗаРазмещение(Команда)
	
	ИзменитьСостояниеФлажковВознагражденияУправляющего(Ложь, "ВознагражденияУправляющегоПлатаЗаРазмещение");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьНаСервереИЗафиксироватьСтатистику();
	
	ПериодДляПечатиПриИзменении(Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНачисления(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		РезультатВопроса = Вопрос("Перед созданием начислений следует заполнить данные. Заполнить?", РежимДиалогаВопрос.ОКОтмена);
		
		Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
			ОбновитьНаСервереИЗафиксироватьСтатистику();	
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ИмяОбъекта			= Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".", , , 2) - 1);
	ИмяФормыПараметров	= ИмяОбъекта + ".Форма.ФормаПараметрыНачисленияЗадолженности";
	
	ПараметрыФормы = Новый Структура("ПараметрыНачисленияЗадолженности", Новый Структура("РасчетныйСчет, ПрочиеДоходыИРасходы, Организация"));
	ЗаполнитьЗначенияСвойств(ПараметрыФормы.ПараметрыНачисленияЗадолженности, Объект);
	
	ПараметрыНачисленияЗадолженности = ОткрытьФормуМодально(ИмяФормыПараметров, ПараметрыФормы, ЭтаФорма);
	
	Если ТипЗнч(ПараметрыНачисленияЗадолженности) = Тип("Структура") Тогда	
		
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыНачисленияЗадолженности); 
		
		СоздатьНачисленияИОбновитьДанныеНаСервере();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияДляБухгалтерии(Команда)
	
	ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияПоИИСДляБухгалтерииНаСервере();
		
	Если ПечатнаяФорма = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПечатнаяФорма.Показать("Печать расчета вознаграждения по ИИС для бухгалтерии");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияДляФормы482(Команда)
	
	ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияПоИИСДляФормы482НаСервере();
		
	Если ПечатнаяФорма = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПечатнаяФорма.Показать("Печать расчета вознаграждения по ИИС для формы 482");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияАгента(Команда)
	
	Если ЭтаФорма.ВознаграждениеАгента.Количество() > 0 Тогда
	
		ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияАгентаНаСервере();
		
		Если ПечатнаяФорма = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПечатнаяФорма.Показать("Печать расчета вознаграждения агента");
	
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияАгентаМКБ(Команда)
	
	Если ЭтаФорма.ВознаграждениеАгента.Количество() > 0 Тогда
	
		ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияАгентаМКБНаСервере();
		
		Если ПечатнаяФорма = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПечатнаяФорма.Показать("Печать расчета вознаграждения агента (МКБ)");
	
	КонецЕсли; 	
	
КонецПроцедуры  

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияУКЗаРазмещение(Команда)
	
	ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияПлатаЗаРазмещениеПоИИСДляФормы482НаСервере();
		
	Если ПечатнаяФорма = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПечатнаяФорма.Показать("Печать расчета вознаграждения (плата за размещение) по ИИС для формы 482");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияЗаПериодДляБухгалтерии(Команда)
	
	ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияПоИИСЗаПериодДляБухгалтерииНаСервере();
		
	Если ПечатнаяФорма = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПечатнаяФорма.Показать("Печать расчета вознаграждения по ИИС за период для бухгалтерии");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияАгентаДВБ(Команда)
	
	Если ЭтаФорма.ВознаграждениеАгента.Количество() > 0 Тогда
	
		ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияАгентаДВБНаСервере();
		
		Если ПечатнаяФорма = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПечатнаяФорма.Показать("Печать расчета вознаграждения агента (ДВБ)");
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияПоПИФ(Команда)
	ПечатнаяФорма = СформироватьФормуРасчетаВознагражденияПоПИФНаСервере();
	Если ПечатнаяФорма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПечатнаяФорма.Показать("Печать расчета вознаграждения по ПИФ");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознаграждения(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Подписант) 
		И Вопрос("Указать подписанта со стороны УК?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
		
	СформироватьРасчетВознаграждения();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьРасчетаВознагражденияТекущейСтроки(Команда)

	ТекущиеДанные = Элементы.ВознагражденияУправляющего.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьРасчетВознаграждения(РаботаСКоллекциями.ЗначениеВМассив(ТекущиеДанные.СчетДоверительногоУправления));		
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтключитьОтбор(Команда)
	
	ЭтаФорма.ОтборСчетДоверительногоУправленияВСписке			= Неопределено;
	ЭтаФорма.ОтборКлиентВСписке									= Неопределено;
	ЭтаФорма.ОтборВидДоговораДоверительногоУправленияВСписке	= Неопределено;
	ЭтаФорма.ОтборСтратегияИндивидуальногоИнвестирования		= Неопределено;
	
	ЭтаФорма.ОтборСчетДоверительногоУправления.Очистить();
	ЭтаФорма.ОтборВидДоговораДоверительногоУправления.Очистить();
	ЭтаФорма.ОтборКлиент.Очистить();
	
	ПриИзмененииОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьПараметрыОтбора(Команда)
	
	Настройки = Новый Структура(
		"ОтборСчетДоверительногоУправления, ОтборВидДоговораДоверительногоУправления, ОтборКлиент, ОтборСтратегияИндивидуальногоИнвестирования,
		|ОтборСчетДоверительногоУправленияВСписке, ОтборКлиентВСписке, ОтборВидДоговораДоверительногоУправленияВСписке");
	
	ЗаполнитьЗначенияСвойств(Настройки, ЭтаФорма);
	
	РаботаСФормамиКлиент.СохранитьНастройкиВХранилищеВариантовИНастроекОтчетов(ЭтаФорма.ИмяФормы, ЭтаФорма.КлючТекущихПараметровОтбора, Настройки, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьПараметрыОтбора(Команда)
	
	ОписаниеНастроек = РаботаСФормамиКлиент.ПолучитьНастройкиИзХранилищаВариантовИНастроекОтчетов(ЭтаФорма.ИмяФормы, ЭтаФорма.КлючТекущихПараметровОтбора, Объект.Организация);
	
	Если ОписаниеНастроек <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеНастроек.Настройки);
		
		ПривестиОтборыВСоответствиеОрганизации(ЭтаФорма);
		
		ПриИзмененииОтбора();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодготовитьФайлыДляЭДО(Команда)
	ПутьКФайлам = ?(Прав(ЭтаФорма.КаталогФайловExcel, 1) = "\", ЭтаФорма.КаталогФайловExcel, ЭтаФорма.КаталогФайловExcel + "\");
	ФайлыКаталога = НайтиФайлы(ПутьКФайлам, "*.xls*", Ложь);
	
	Если ФайлыКаталога.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В указанном каталоге не обнаружены файлы Excel");
		Возврат;
	КонецЕсли;
	
	ExcelApp = РаботаСВнешнимиСистемамиКлиентСервер.ExcelЗапуститьПриложение();
	
	Если ExcelApp = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка запуска приложения Excel");
		Возврат;
	КонецЕсли;
	
	ExcelApp.DisplayAlerts = Ложь;
	
	Для Каждого Файл Из ФайлыКаталога Цикл
		ИсходныйФайл = Файл.ПолноеИмя;
		
		ПутьКНовомуФайлу = СокрЛП(СтрЗаменить(ИсходныйФайл, "с расчетом", ""));
		ПутьКНовомуФайлу = СокрЛП(СтрЗаменить(ПутьКНовомуФайлу, "расчет", ""));
		
		Попытка
			НоваяКнигаExcel = РаботаСВнешнимиСистемамиКлиентСервер.ExcelСоздатьКнигу(ExcelApp, ИсходныйФайл);
			
			// Оставляем только значения ячеек
			Для Счетчик = 1 По 2 Цикл
				ЛистExcel = НоваяКнигаExcel.Worksheets(Счетчик);
				ЛистExcel.Activate();
				xlCellTypeFormulas = -4123;
				
				Попытка
					Диапазон = ЛистExcel.Cells.SpecialCells(xlCellTypeFormulas);
				Исключение
					Продолжить;
				КонецПопытки;
				
				Если Диапазон.Count > 0 Тогда
					Для Каждого Ячейка Из Диапазон.Areas Цикл
						Ячейка.Value = Ячейка.Value;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			// Удаляем последний лист
			Попытка
				НоваяКнигаExcel.Worksheets(3).Delete();
			Исключение
				Продолжить;
			КонецПопытки;
			
			xlOpenXMLWorkbook = 51;
			НоваяКнигаExcel.SaveAs(ПутьКНовомуФайлу, xlOpenXMLWorkbook);
			НоваяКнигаExcel.Close();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	ExcelApp.DisplayAlerts = Истина;
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelЗакрытьПриложение(ExcelApp);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подготовлены файлы для отправки по ЭДО");
КонецПроцедуры

#КонецОбласти

#Область Заполнение_данных

&НаСервере
Процедура ОбновитьНаСервере(ДанныеДляСтатистики, ВызватьИсключениеПриОшибке = Ложь)
	ВремяНачала = ТекущаяДатаСеанса();
	ДанныеДляСтатистики.Вставить("ОбновитьНаСервере", "Старт в: " + Формат(ВремяНачала, "ДЛФ=T") + ".");
	
	ОчиститьДанные(ЭтаФорма);
	
	Если Объект.ВариантРасчета > 3 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет вознаграждения для выбранного варианта не реализован");
		ДанныеДляСтатистики.Ошибки.Добавить("Расчет вознаграждения для выбранного варианта не реализован");
		ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
		Возврат;
	КонецЕсли;
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если Объект.ВариантРасчета = 0 Тогда // ИИС
		#Область ИИС
		
		Отбор = ПолучитьОтбор(ЭтаФорма);
		
		ПакетДанныхПоРасчетуВознаграждения = ОбъектНаСервере.ВыбратьДанныеПоРасчетуВознагражденияУправляющегоПоИИС(Отбор, , ВызватьИсключениеПриОшибке);
		
		Если ПакетДанныхПоРасчетуВознаграждения = Неопределено Тогда
			ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
			ДанныеДляСтатистики.Ошибки.Добавить("ПакетДанныхПоРасчетуВознаграждения = Неопределено");
			Возврат;
		КонецЕсли;
		
		// Сохраним часть данных для последующего использования
		_ДанныеПоРасчетуВознаграждения = Новый Структура;
		_ДанныеПоРасчетуВознаграждения.Вставить("СчетаДоверительногоУправления", 							ПакетДанныхПоРасчетуВознаграждения.СчетаДоверительногоУправления.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("Вознаграждения", 											ПакетДанныхПоРасчетуВознаграждения.Вознаграждения.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("ВознагражденияПлатаЗаРазмещение", 							ПакетДанныхПоРасчетуВознаграждения.ВознагражденияПлатаЗаРазмещение.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("ВводыАктивовЗаРасчетныйПериод", 							ПакетДанныхПоРасчетуВознаграждения.ВводыАктивовЗаРасчетныйПериод.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("ВводыАктивовЗаПредрасчетныйПериод", 						ПакетДанныхПоРасчетуВознаграждения.ВводыАктивовЗаПредрасчетныйПериод.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("ОплатыВознагражденийЗаПредрасчетныйПериод", 				ПакетДанныхПоРасчетуВознаграждения.ОплатыВознагражденийЗаПредрасчетныйПериод.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("ОстаткиАктивовНаНачалоРасчетногоПериода", 					ПакетДанныхПоРасчетуВознаграждения.ОстаткиАктивовНаНачалоРасчетногоПериода.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("НачисленияВознагражденийПлатаЗаРазмещениеДоДатыРасчета",	ПакетДанныхПоРасчетуВознаграждения.НачисленияВознагражденийПлатаЗаРазмещениеДоДатыРасчета.Выгрузить());
		
		ХранилищеДанныхПоРасчетуВознаграждения = Новый ХранилищеЗначения(_ДанныеПоРасчетуВознаграждения);
		
		ЭтаФорма.ДанныеПоРасчетуВознаграждения = ХранилищеДанныхПоРасчетуВознаграждения;
		
		// Отобразим вознаграждения управляющего
		НачисленияВознагражденийЗаРасчетныйПериод = ПакетДанныхПоРасчетуВознаграждения.НачисленияВознагражденийЗаРасчетныйПериод.Выгрузить();
		
		Для Каждого СтрокаВознаграждения Из _ДанныеПоРасчетуВознаграждения.Вознаграждения Цикл
			
			НоваяСтрокаВознагражденияУправляющего = ЭтаФорма.ВознагражденияУправляющего.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВознагражденияУправляющего, СтрокаВознаграждения);
			
			// Период начисления
			
			НоваяСтрокаВознагражденияУправляющего.ПериодНачисления = Новый СтандартныйПериод(СтрокаВознаграждения.НачалоПериодаНачисления, СтрокаВознаграждения.КонецПериодаНачисления);
			
			// Начисление задолженности 
			
			Отбор = Новый Структура("СчетДоверительногоУправления", СтрокаВознаграждения.СчетДоверительногоУправления);
			СтрокиНачисленияВознагражденияУправляющего = НачисленияВознагражденийЗаРасчетныйПериод.НайтиСтроки(Отбор);
			
			Если СтрокиНачисленияВознагражденияУправляющего.Количество() = 1 Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВознагражденияУправляющего, СтрокиНачисленияВознагражденияУправляющего[0], "Начисление, СуммаНачисления");
			ИначеЕсли СтрокиНачисленияВознагражденияУправляющего.Количество() > 1 Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВознагражденияУправляющего, СтрокиНачисленияВознагражденияУправляющего[0], "Начисление, СуммаНачисления");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено более одного начисления вознаграждения управляющего по счету д/у '" + СтрокаВознаграждения.СчетДоверительногоУправления + "'");
			КонецЕсли;
			
		КонецЦикла;
		
		// Вознаграждение управляющего - плата за размещение
		НачисленияВознагражденийПлатазаРазмещениеЗаРасчетныйПериод = ПакетДанныхПоРасчетуВознаграждения.НачисленияВознагражденийПлатаЗаРазмещениеЗаРасчетныйПериод.Выгрузить();
		
		Для Каждого СтрокаВознаграждения Из _ДанныеПоРасчетуВознаграждения.ВознагражденияПлатаЗаРазмещение Цикл
			Отбор = Новый Структура("СчетДоверительногоУправления, ВводДенежныхСредств", СтрокаВознаграждения.СчетДоверительногоУправления, СтрокаВознаграждения.ВводДенежныхСредств);
			СтрокиНачисленияВознагражденияУправляющего = НачисленияВознагражденийПлатазаРазмещениеЗаРасчетныйПериод.НайтиСтроки(Отбор);
			
			Если СтрокиНачисленияВознагражденияУправляющего.Количество() = 0 Тогда
				// Добавим строку для контроля
				НоваяСтрокаВознагражденияУправляющего = ЭтаФорма.ВознагражденияУправляющегоПлатаЗаРазмещение.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВознагражденияУправляющего, СтрокаВознаграждения);
			КонецЕсли;
			
			Для Каждого НайдСтрокаНачисления Из СтрокиНачисленияВознагражденияУправляющего Цикл
				НоваяСтрокаВознагражденияУправляющего = ЭтаФорма.ВознагражденияУправляющегоПлатаЗаРазмещение.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВознагражденияУправляющего, СтрокаВознаграждения);
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВознагражденияУправляющего, НайдСтрокаНачисления, "Начисление, СуммаНачисления");
				
				// Эти данные используются только для печати, поэтому по умолчанию устанавливаем флажки для всех строк
				НоваяСтрокаВознагражденияУправляющего.Флажок = Истина;
			КонецЦикла;
			
		КонецЦикла;
		
		#КонецОбласти
		
	ИначеЕсли Объект.ВариантРасчета = 1 Тогда // вознаграждение агента
		
		#Область Вознаграждение_агента
		
		Если Не ЗначениеЗаполнено(Объект.АгентскийДоговор) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить агентский договор");
			ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
			ДанныеДляСтатистики.Ошибки.Добавить("Необходимо заполнить агентский договор");
			Возврат;
		
		КонецЕсли; 
		
		ПакетДанныхПоРасчетуВознаграждения = ОбъектНаСервере.ВыбратьДанныеПоРасчетуВознагражденияУправляющегоПоИИС( , , ВызватьИсключениеПриОшибке);
		
		Если ПакетДанныхПоРасчетуВознаграждения = Неопределено Тогда
			ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
			ДанныеДляСтатистики.Ошибки.Добавить("ПакетДанныхПоРасчетуВознаграждения = Неопределено");
			Возврат;
		КонецЕсли;
		
		// сохраним часть данных для последующего использования
		_ДанныеПоРасчетуВознаграждения = Новый Структура;
		_ДанныеПоРасчетуВознаграждения.Вставить("Вознаграждения",									ПакетДанныхПоРасчетуВознаграждения.Вознаграждения.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("ВознагражденияПлатаЗаРазмещение", 					ПакетДанныхПоРасчетуВознаграждения.ВознагражденияПлатаЗаРазмещение.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("НачалоПериода", 									ПакетДанныхПоРасчетуВознаграждения.НачалоПериода);
		_ДанныеПоРасчетуВознаграждения.Вставить("НачалоПериодаРасчетаВознагражденияЗаПривлечение", 	ПакетДанныхПоРасчетуВознаграждения.НачалоПериодаРасчетаВознагражденияЗаПривлечение);
		_ДанныеПоРасчетуВознаграждения.Вставить("КонецБазовогоПериода", 							ПакетДанныхПоРасчетуВознаграждения.КонецБазовогоПериода);
		
		ХранилищеДанныхПоРасчетуВознаграждения = Новый ХранилищеЗначения(_ДанныеПоРасчетуВознаграждения);
		
		ЭтаФорма.ДанныеПоРасчетуВознаграждения = ХранилищеДанныхПоРасчетуВознаграждения;
		
		Для Каждого СтрокаВознаграждения Из _ДанныеПоРасчетуВознаграждения.Вознаграждения Цикл
			
			НоваяСтрока = ЭтаФорма.ВознаграждениеАгента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВознаграждения);
			
			// Дополним строку значениями по плате за размещение
			ПараметрыОтбора = Новый Структура("СчетДоверительногоУправления", СтрокаВознаграждения.СчетДоверительногоУправления);
			НайдСтроки = _ДанныеПоРасчетуВознаграждения.ВознагражденияПлатаЗаРазмещение.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтроки.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли;
			НоваяСтрока.СтавкаПлатаЗаРазмещение = НайдСтроки[0].Ставка;
			НоваяСтрока.СуммаВознагражденияПлатаЗаРазмещение = НайдСтроки[0].СуммаВознаграждения;
			
		КонецЦикла;
		
		#КонецОбласти
		
	ИначеЕсли Объект.ВариантРасчета = 2 Тогда // Вознаграждение управляющего для ПИФ
		
		#Область ПИФ
		
		ПакетДанныхПоРасчетуВознаграждения = ОбъектНаСервере.ВыбратьДанныеПоРасчетуВознагражденияУправляющегоПоПИФ();
		
		Если ПакетДанныхПоРасчетуВознаграждения = Неопределено Тогда
			ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
			ДанныеДляСтатистики.Ошибки.Добавить("ПакетДанныхПоРасчетуВознаграждения = Неопределено");
			Возврат;
		КонецЕсли;
		
		// сохраним часть данных для последующего использования
		_ДанныеПоРасчетуВознаграждения = Новый Структура;
		_ДанныеПоРасчетуВознаграждения.Вставить("Вознаграждения",					ПакетДанныхПоРасчетуВознаграждения.Вознаграждения.Выгрузить());
		_ДанныеПоРасчетуВознаграждения.Вставить("НачисленияВознаграждений",			ПакетДанныхПоРасчетуВознаграждения.НачисленияВознагражденийЗаРасчетныйПериод.Выгрузить());
		
		ХранилищеДанныхПоРасчетуВознаграждения = Новый ХранилищеЗначения(_ДанныеПоРасчетуВознаграждения);
		
		ЭтаФорма.ДанныеПоРасчетуВознаграждения = ХранилищеДанныхПоРасчетуВознаграждения;
		
		Для Каждого СтрокаВознаграждения Из _ДанныеПоРасчетуВознаграждения.Вознаграждения Цикл
			
			НоваяСтрока = ЭтаФорма.ВознагражденияУправляющего.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВознаграждения);
			
			// Период начисления
			
			НоваяСтрока.ПериодНачисления = Новый СтандартныйПериод(СтрокаВознаграждения.НачалоПериодаНачисления, СтрокаВознаграждения.КонецПериодаНачисления);
			
			// Дополним строку значениями по плате за размещение
			
			ПараметрыОтбора = Новый Структура("СчетДоверительногоУправления", СтрокаВознаграждения.СчетДоверительногоУправления);
			НайдСтроки = _ДанныеПоРасчетуВознаграждения.НачисленияВознаграждений.НайтиСтроки(ПараметрыОтбора);
			Если НайдСтроки.Количество() = 0 Тогда 
				НоваяСтрока.Флажок = Истина;
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайдСтроки[0], "Начисление, СуммаНачисления");
			
			НоваяСтрока.Флажок = НоваяСтрока.СуммаВознаграждения > 0 И НоваяСтрока.СуммаВознаграждения <> НоваяСтрока.СуммаНачисления;
		КонецЦикла;
		
		#КонецОбласти
		
	ИначеЕсли Объект.ВариантРасчета = 3 Тогда // Вознаграждение управляющего по настройкам расчета
		
		#Область НПФ_ПФР_ЮЛ_ФЛ_и_прочие		
		
		Отбор = ПолучитьОтбор(ЭтаФорма);
		
		ПакетДанныхПоРасчетуВознаграждения = ОбъектНаСервере.ВыбратьДанныеПоРасчетуВознагражденияУправляющего(Отбор, Истина);
		
		Если ПакетДанныхПоРасчетуВознаграждения = Неопределено Тогда
			ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
			ДанныеДляСтатистики.Ошибки.Добавить("ПакетДанныхПоРасчетуВознаграждения = Неопределено");
			Возврат;
		КонецЕсли; 
		
		// Выведем сведения о рассчитанных вознаграждениях на форму
		
		Для Каждого СтрокаВознаграждения Из ПакетДанныхПоРасчетуВознаграждения.Вознаграждения Цикл
			
			НоваяСтрокаВознаграждения = ЭтаФорма.ВознагражденияУправляющего.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВознаграждения, СтрокаВознаграждения);
			
			НоваяСтрокаВознаграждения.ПериодНачисления = Новый СтандартныйПериод(СтрокаВознаграждения.НачалоПериодаНачисления, СтрокаВознаграждения.КонецПериодаНачисления);
			
			НоваяСтрокаВознаграждения.Флажок = Не (
				НоваяСтрокаВознаграждения.ОшибкаРасчета
				Или НоваяСтрокаВознаграждения.ОшибкаРасчетаНачисления
				Или НоваяСтрокаВознаграждения.СуммаВознаграждения <= 0
				Или НоваяСтрокаВознаграждения.СуммаВознаграждения = НоваяСтрокаВознаграждения.СуммаНачисления
			);
			
			Если СтрокаВознаграждения.ШаблонАкта = "Будущее2023" Тогда
				НоваяСтрокаВознаграждения.НуженПодписант = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		// Сохраним данные расшифровки
		
		АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(ПакетДанныхПоРасчетуВознаграждения, Новый СжатиеДанных(9)), ЭтаФорма.УникальныйИдентификатор);
		
		#КонецОбласти
		
	Иначе
		
		ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
		ДанныеДляСтатистики.Ошибки.Добавить("Данная методика расчета вознаграждения пока не реализована");
		
		Если ВызватьИсключениеПриОшибке Тогда
			ВызватьИсключение "Данная методика расчета вознаграждения пока не реализована";
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная методика расчета вознаграждения пока не реализована");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Ложь;
	
	// Расшифровку пока выводим только для ИИС
	Если Объект.ВариантРасчета > 1 Тогда
		ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
		Возврат;
	КонецЕсли;
	
	#Область Расшифровка_расчета_вознаграждения_ИИС
	
	// Отобразим расшифровку расчета вознаграждения
	Макет = ОбъектНаСервере.ПолучитьМакет("РасшифровкаРасчета");
	
	// Шапка отчета
	Область = Макет.ПолучитьОбласть("ШапкаОтчета");
	Область.Параметры.ВариантРасчета     = Элементы.ВариантРасчета.СписокВыбора[Объект.ВариантРасчета];
	Область.Параметры.ДатаРасчета        = Формат(Объект.ДатаРасчета, "ДФ=dd.MM.yyyy");
	Область.Параметры.ПериодФормирования = ТекущаяДата();
	Область.Параметры.Организация        = Объект.Организация;
	
	ЭтаФорма.РасшифровкаРасчетаВознаграждения.Вывести(Область);
	
	// Вывод данных
	ОбластьЗаголовок1 = Макет.ПолучитьОбласть("ЗаголовокСтратегия");
	ОбластьЗаголовок2 = Макет.ПолучитьОбласть("ЗаголовокСчетаДоверительногоУправления");
	ОбластьШапка      = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока     = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	Выборка_Стратегии = ПакетДанныхПоРасчетуВознаграждения.РасшифровкаРасчетаВознаграждений.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка_Стратегии.Следующий() Цикл
		
		ОбластьЗаголовок1.Параметры.Текст = Выборка_Стратегии.Стратегия;
		ЭтаФорма.РасшифровкаРасчетаВознаграждения.Вывести(ОбластьЗаголовок1);
		ЭтаФорма.РасшифровкаРасчетаВознаграждения.НачатьГруппуСтрок();
		
		Выборка_СчетДоверительногоУправления = Выборка_Стратегии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка_СчетДоверительногоУправления.Следующий() Цикл
			
			ОбластьЗаголовок2.Параметры.Текст = Выборка_СчетДоверительногоУправления.СчетДоверительногоУправления;
			ЭтаФорма.РасшифровкаРасчетаВознаграждения.Вывести(ОбластьЗаголовок2);
			ЭтаФорма.РасшифровкаРасчетаВознаграждения.НачатьГруппуСтрок();
			
			ЭтаФорма.РасшифровкаРасчетаВознаграждения.Вывести(ОбластьШапка);
			
			Выборка = Выборка_СчетДоверительногоУправления.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				ЭтаФорма.РасшифровкаРасчетаВознаграждения.Вывести(ОбластьСтрока);
				
			КонецЦикла;
			
			ЭтаФорма.РасшифровкаРасчетаВознаграждения.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ЭтаФорма.РасшифровкаРасчетаВознаграждения.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	// Наводим красоту
	ЭтаФорма.РасшифровкаРасчетаВознаграждения.ОтображатьЗаголовки = Ложь;
	ЭтаФорма.РасшифровкаРасчетаВознаграждения.ОтображатьСетку = Ложь;
	ЭтаФорма.РасшифровкаРасчетаВознаграждения.Защита = Ложь;
	ЭтаФорма.РасшифровкаРасчетаВознаграждения.ТолькоПросмотр = Истина;
	
	#КонецОбласти
	
	ДанныеДляСтатистики.ОбновитьНаСервере = ДанныеДляСтатистики.ОбновитьНаСервере + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьДанные(ЭтаФорма)
	
	ЭтаФорма.ВознагражденияУправляющего.Очистить();
	ЭтаФорма.ВознаграждениеАгента.Очистить();
	ЭтаФорма.ВознагражденияУправляющегоПлатаЗаРазмещение.Очистить();
	
	ЭтаФорма.РасшифровкаРасчетаВознаграждения = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма.АдресДанныхРасшифровки) Тогда
		УдалитьИзВременногоХранилища(ЭтаФорма.АдресДанныхРасшифровки);
		
		ЭтаФорма.АдресДанныхРасшифровки = Неопределено;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма.АдресДанныхБухгалтерииОбУдержанномВознаграждении) Тогда
		УдалитьИзВременногоХранилища(ЭтаФорма.АдресДанныхБухгалтерииОбУдержанномВознаграждении);
		
		ЭтаФорма.АдресДанныхБухгалтерииОбУдержанномВознаграждении = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Печатные_формы_расчета_вознаграждения

&НаСервере
Процедура ОбновитьСоставПечатныхФормНаСервере()
		
	// Проверяем только ИИС и ПИФ
	Если Не (Объект.ВариантРасчета = 0 Или Объект.ВариантРасчета = 2) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРежимИИС = Объект.ВариантРасчета = 0;
		
	Элементы.ВознагражденияУправляющегоКомандаПечатьРасчетаВознагражденияПоПИФ.Видимость 					= Не ЭтоРежимИИС;
	Элементы.ВознагражденияУправляющегоКомандаПечатьРасчетаВознагражденияДляБухгалтерии.Видимость 			= ЭтоРежимИИС;
	Элементы.ВознагражденияУправляющегоКомандаПечатьРасчетаВознагражденияДляФормы482.Видимость 				= ЭтоРежимИИС;
	Элементы.ВознагражденияУправляющегоКомандаПечатьРасчетаВознагражденияЗаПериодДляБухгалтерии.Видимость 	= ЭтоРежимИИС;
		
КонецПроцедуры

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияПоИИСДляБухгалтерииНаСервере()
	
	РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");

	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("РасчетВознагражденияПоИИСДляБухгалтерии", РеквизитФормыОбъект);
	
	ВыбСчетаДоверительногоУправления = Новый Массив;	
	
	Для каждого СтрокаВознагражденияУправляющего Из ВознагражденияУправляющего Цикл
		Если СтрокаВознагражденияУправляющего.Флажок Тогда
			ВыбСчетаДоверительногоУправления.Добавить(СтрокаВознагражденияУправляющего.СчетДоверительногоУправления);
		КонецЕсли;
	КонецЦикла;
	
	ПечатнаяФорма = РеквизитФормыОбъект.СформироватьФормуРасчетаВознагражденияПоИИСДляБухгалтерии(ВыбСчетаДоверительногоУправления, ЭтаФорма.ДанныеПоРасчетуВознаграждения, ЭтотОбъект.Подписант);
		
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
	Возврат ПечатнаяФорма;
		
КонецФункции

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияПоПИФНаСервере()
	
	РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("РасчетВознагражденияПоПИФ", РеквизитФормыОбъект);
	ВыбСчетаДоверительногоУправления = Новый Массив;
	
	Для Каждого СтрокаВознагражденияУправляющего Из ВознагражденияУправляющего Цикл
		Если СтрокаВознагражденияУправляющего.Флажок Тогда
			ВыбСчетаДоверительногоУправления.Добавить(СтрокаВознагражденияУправляющего.СчетДоверительногоУправления);
		КонецЕсли;
	КонецЦикла;
	
	ПечатнаяФорма = РеквизитФормыОбъект.СформироватьФормуРасчетаВознагражденияПоПИФ(
		ВыбСчетаДоверительногоУправления, ЭтаФорма.ДанныеПоРасчетуВознаграждения, ЭтотОбъект.Подписант, ЭтотОбъект.ПодписантДолжность);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	Возврат ПечатнаяФорма;
	
КонецФункции

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияПоИИСЗаПериодДляБухгалтерииНаСервере()
	
	РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");

	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("РасчетВознагражденияПоИИСЗаПериодДляБухгалтерии", РеквизитФормыОбъект);
	
	ВыбСчетаДоверительногоУправления = Новый Массив;	
	
	Для каждого СтрокаВознагражденияУправляющего Из ВознагражденияУправляющего Цикл
		Если СтрокаВознагражденияУправляющего.Флажок Тогда
			ВыбСчетаДоверительногоУправления.Добавить(СтрокаВознагражденияУправляющего.СчетДоверительногоУправления);
		КонецЕсли;
	КонецЦикла;
	
	ПечатнаяФорма = РеквизитФормыОбъект.СформироватьФормуРасчетаВознагражденияПоИИСЗаПериодДляБухгалтерии(ВыбСчетаДоверительногоУправления, ЭтаФорма.ДанныеПоРасчетуВознаграждения, ЭтотОбъект.Подписант);
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
	Возврат ПечатнаяФорма;
	
КонецФункции

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияПоИИСДляФормы482НаСервере()
	
	ВыбСчетаДоверительногоУправления = Новый Массив;	
	
	Для каждого СтрокаВознагражденияУправляющего Из ВознагражденияУправляющего Цикл
		Если СтрокаВознагражденияУправляющего.Флажок Тогда
			ВыбСчетаДоверительногоУправления.Добавить(СтрокаВознагражденияУправляющего.СчетДоверительногоУправления);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоОтмеченных = ВыбСчетаДоверительногоУправления.Количество();
	Если КоличествоОтмеченных = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не отмечен ни один клиент. Печатная форма не сформирована");
		Возврат Неопределено;
		
	ИначеЕсли КоличествоОтмеченных > 1 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать расчета для формы 482 поддерживается только по одному клиенту. Будет использован первый из выбранных");
		
	КонецЕсли;
	
	РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");

	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("РасчетВознагражденияПоИИСДляФормы482", РеквизитФормыОбъект);
	
	ПечатнаяФорма = РеквизитФормыОбъект.СформироватьФормуРасчетаВознагражденияПоИИСДляФормы482(ВыбСчетаДоверительногоУправления[0], ЭтаФорма.ДанныеПоРасчетуВознаграждения);
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
	Возврат ПечатнаяФорма;

КонецФункции

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияАгентаНаСервере()
	
	РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");

	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("РасчетВознагражденияАгента", РеквизитФормыОбъект);
	
	ПечатнаяФорма = РеквизитФормыОбъект.СформироватьФормуРасчетаВознагражденияАгента(ЭтаФорма.ДанныеПоРасчетуВознаграждения, ЭтотОбъект.Подписант, ЭтотОбъект.ПодписантДолжность);
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
	Возврат ПечатнаяФорма;

КонецФункции

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияАгентаМКБНаСервере()
	
	РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");

	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("РасчетВознагражденияАгентаМКБ", РеквизитФормыОбъект);
	
	ПечатнаяФорма = РеквизитФормыОбъект.СформироватьФормуРасчетаВознагражденияАгентаМКБ(ЭтаФорма.ДанныеПоРасчетуВознаграждения, ЭтотОбъект.Подписант, ЭтотОбъект.ПодписантДолжность);
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
	Возврат ПечатнаяФорма;
	
КонецФункции

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияАгентаДВБНаСервере()
	
	РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");

	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("РасчетВознагражденияАгентаДВБ", РеквизитФормыОбъект);

	ПечатнаяФорма = РеквизитФормыОбъект.СформироватьФормуРасчетаВознагражденияАгентаДВБ(ЭтаФорма.ДанныеПоРасчетуВознаграждения, ЭтотОбъект.Подписант, ЭтотОбъект.ПодписантДолжность);
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
	Возврат ПечатнаяФорма;
	
КонецФункции

&НаСервере
Функция СформироватьФормуРасчетаВознагражденияПлатаЗаРазмещениеПоИИСДляФормы482НаСервере()
	
	// Нужно печатать по датам
	ВыбТаблицаДатИСчетовДУ = Новый ТаблицаЗначений;
	ВыбТаблицаДатИСчетовДУ.Колонки.Добавить("Период");
	ВыбТаблицаДатИСчетовДУ.Колонки.Добавить("СчетДоверительногоУправления");
	
	Для каждого СтрокаВознагражденияУправляющего Из ВознагражденияУправляющегоПлатаЗаРазмещение Цикл
		Если СтрокаВознагражденияУправляющего.Флажок Тогда
			НоваяСтрока 								= ВыбТаблицаДатИСчетовДУ.Добавить();
			НоваяСтрока.Период 							= СтрокаВознагражденияУправляющего.Период;
			НоваяСтрока.СчетДоверительногоУправления 	= СтрокаВознагражденияУправляющего.СчетДоверительногоУправления;
		КонецЕсли;
	КонецЦикла;
	
	ВыбТаблицаДатИСчетовДУ.Свернуть("Период, СчетДоверительногоУправления");
	
	Возврат РеквизитФормыВЗначение("Объект").СформироватьФормуРасчетаВознагражденияПлатаЗаРазмещение(ВыбТаблицаДатИСчетовДУ, ЭтаФорма.ДанныеПоРасчетуВознаграждения, , ЭтотОбъект.Подписант);
	
КонецФункции

#КонецОбласти

#Область Расчет_вознаграждения_в_Excel

&НаКлиенте
Функция ПолучитьДанныеПодписантов(Отказ)
	ДанныеПодписантов = Новый Соответствие;
		
	ПодписантЗаполнен = Истина;
	Для Каждого СтрокаВознаграждение из ЭтаФорма.ВознагражденияУправляющего Цикл
		Если СтрокаВознаграждение.Флажок И ЗначениеЗаполнено(СтрокаВознаграждение.Подписант) Тогда
			Если ДанныеПодписантов.Получить(СтрокаВознаграждение.Клиент) = Неопределено Тогда
				ДанныеПодписантов.Вставить(СтрокаВознаграждение.Клиент, СтрокаВознаграждение.СтруктураПодписантОтКлиента);
			КонецЕсли;
		ИначеЕсли СтрокаВознаграждение.Флажок И СтрокаВознаграждение.НуженПодписант И ПодписантЗаполнен И Не ЗначениеЗаполнено(СтрокаВознаграждение.Подписант) Тогда
			ПодписантЗаполнен = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПодписантЗаполнен И Вопрос("Указать подписанта со стороны клиента?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Возврат ДанныеПодписантов;
КонецФункции

&НаКлиенте
Процедура СформироватьРасчетВознаграждения(СчетаДоверительногоУправления = Неопределено)
		
	// Проверка наличия данных для расшифровки
	Если ЭтаФорма.Модифицированность Тогда
		
		РезультатВопроса = Вопрос("Настройки расчеты были изменены. Обновить данные?", РежимДиалогаВопрос.ОКОтмена);
		Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
			ОбновитьНаСервереИЗафиксироватьСтатистику();
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("СформироватьРасчетВознаграждения");
	
	// Получаем счета, по которым запрашивается расшифровка
	Если СчетаДоверительногоУправления = Неопределено Тогда
		
		СчетаДоверительногоУправления = Новый Массив;
		Для Каждого СтрокаВознагражденияУправляющего Из ВознагражденияУправляющего Цикл
			Если СтрокаВознагражденияУправляющего.Флажок Тогда
				СчетаДоверительногоУправления.Добавить(СтрокаВознагражденияУправляющего.СчетДоверительногоУправления);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если СчетаДоверительногоУправления.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ни один клиент!");
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ДанныеПодписантов = ПолучитьДанныеПодписантов(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем данные об удержанном вознаграждении из ИБ бухгалтерии при первой расшифровке
	Если ЭтаФорма.ЗаполнятьДанныеБухгалтерииОбУдержанномВознаграждении
		И Не ЭтоАдресВременногоХранилища(ЭтаФорма.АдресДанныхБухгалтерииОбУдержанномВознаграждении)
	Тогда
		Состояние("Формирование расчета вознаграждения:", , ">> Получение данных об удержанном вознаграждении из ИБ бухгалтерии");
		
		НачалоУплатыВознаграждения		= КонецКвартала(НачалоГода(БазовыйПериод.ДатаНачала)) + 1; // начало первого квартала года расчета
		ОкончаниеУплатыВознаграждения	= КонецКвартала(БазовыйПериод.ДатаОкончания); // Конец текущего квартала (в будущие не смотрим)
		
		ЗаполнитьДанныеБухгалтерииОбУдержанномВознаграждении(
			Объект.Организация, НачалоУплатыВознаграждения, ОкончаниеУплатыВознаграждения, ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики);
	КонецЕсли;
		
	// Получаем данные расшифровки
	Состояние("Формирование расчета вознаграждения:", , ">> Получение данных расшифровки расчета");
	
	РасшифровкаРасчета = ПолучитьДанныеРасшифровки(СчетаДоверительногоУправления, АдресДанныхРасшифровки, ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики);
	Если РасшифровкаРасчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКШаблону = ПолучитьИмяВременногоФайла("xltx");
	РасшифровкаРасчета.ШаблонОтчета.Записать(ПутьКШаблону);
	
	// Формируем отчет
	Состояние("Формирование расчета вознаграждения:", , ">> Формирование формы в Microsoft Excel");
	
	Для Каждого ДанныеРасшифровки Из РасшифровкаРасчета.Вознаграждения Цикл
		
		Состояние("Формирование расчета вознаграждения:", , ">> " + ДанныеРасшифровки.УчредительУправления);
		
		ExcelApp = РаботаСВнешнимиСистемамиКлиентСервер.ExcelЗапуститьПриложение();
		Если ExcelApp = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось запустить приложение Microsoft Excel");
			Прервать;
		КонецЕсли;
		
		Попытка
			СформироватьРасчетВознагражденияExcel(ExcelApp, ПутьКШаблону, ДанныеРасшифровки, РасшифровкаРасчета.ДанныеОбОрганизации, , ДанныеПодписантов);
		Исключение
			ТекстОшибки = СтрШаблон("Ошибка формирования печатной формы расчета вознаграждения '%1'. Система сообщает:" + Символы.ПС + "%2",
				ДанныеРасшифровки.СчетДоверительногоУправления, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelЗакрытьПриложение(ExcelApp);
			ЗарегистрироватьОшибку(ТекстОшибки);
		КонецПопытки;
		
		ОбработкаПрерыванияПользователя();
		
	КонецЦикла;
	
	// Завершающие процедуры
	УдалитьФайлы(ПутьКШаблону);
	Состояние("Формирование расчета вознаграждения:", , ">> Завершено");
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРасшифровки(СчетаДоверительногоУправления, АдресДанныхРасшифровки, ДанныеДляСтатистики)
	
	ДанныеРасшифровки = Неопределено;
	
	ВремяНачала = ТекущаяДатаСеанса();
	ДанныеДляСтатистики.Вставить("ПолучитьДанныеРасшифровки", "Старт в: " + Формат(ВремяНачала, "ДЛФ=T") + ".");
	
	Если ЭтоАдресВременногоХранилища(АдресДанныхРасшифровки) Тогда
		ХранилищеЗначения = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
		Если ТипЗнч(ХранилищеЗначения) = Тип("ХранилищеЗначения") Тогда
			ДанныеРасшифровки = ХранилищеЗначения.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеРасшифровки = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета вознаграждения по данной методике не реализована");
		ДанныеДляСтатистики.ПолучитьДанныеРасшифровки = ДанныеДляСтатистики.ПолучитьДанныеРасшифровки + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
		Возврат Неопределено;
		
	КонецЕсли;
	
	// Фильтр ненужных счетов д/у
	ИндексСтроки = ДанныеРасшифровки.Вознаграждения.Количество() - 1;
	Пока ИндексСтроки >= 0 Цикл
		Если СчетаДоверительногоУправления.Найти(ДанныеРасшифровки.Вознаграждения[ИндексСтроки].СчетДоверительногоУправления) = Неопределено Тогда
			ДанныеРасшифровки.Вознаграждения.Удалить(ИндексСтроки);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1;
	КонецЦикла;

	// #ТехДолг
	// 	отсортируем таблицы расшифровки для вывода (на самом деле, это лучше сделать
	// 	на этапе выполнения запроса, помещающего данные во временные таблицы,
	// 	но встроится туда непросто, поэтому делаем здесь)
	Для каждого ДанныеВознаграждения Из ДанныеРасшифровки.Вознаграждения Цикл
		Для каждого ДанныеРасщифровкиПоБазе Из ДанныеВознаграждения.БазыРасчета Цикл
			Для каждого ЭлементРасшифровкиРасчета Из ДанныеРасщифровкиПоБазе.ТаблицыРасшифровкиРасчета Цикл
				ТаблицаРасшифровкиРасчета = ЭлементРасшифровкиРасчета.Значение;
				Если ТаблицаРасшифровкиРасчета.Колонки.Найти("Период") <> Неопределено Тогда
					ТаблицаРасшифровкиРасчета.Сортировать("Период ВОЗР");
				КонецЕсли;
				ДанныеРасщифровкиПоБазе.ТаблицыРасшифровкиРасчета[ЭлементРасшифровкиРасчета.Ключ] = ТаблицаРасшифровкиРасчета;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Преобразуем для передачи на клиента
	СериализованныеДанные = СериализоватьЗначение(ДанныеРасшифровки);
	
	ДанныеДляСтатистики.ПолучитьДанныеРасшифровки = ДанныеДляСтатистики.ПолучитьДанныеРасшифровки + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
	
	Возврат СериализованныеДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРасходыПоУправлению(СчетДоверительногоУправления, Организация, НачалоПериода, КонецПериода)
	
	// Т.к. используются только при расшифровке, то получаю их здесь
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (&ВидыЗадолженностиПоДоговоруСБанком)
		|			ТОГДА ""Расходы по договору банковского обслуживания""
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (&ВидыЗадолженностиПоДоговоруСоСпецдепозитарием)
		|			ТОГДА ""Расходы по договору спецдепозитарного обслуживания""
		|	КОНЕЦ КАК ВидРасходов,
		|	СУММА(ЗадолженностиПоДенежнымСредствам.СуммаПриход + ЗадолженностиПоДенежнымСредствам.СуммаКупонаПриход) КАК НачисленоВВалютеУчета
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (&ВидыЗадолженностиПоДоговоруСБанком, &ВидыЗадолженностиПоДоговоруСоСпецдепозитарием)) КАК ЗадолженностиПоДенежнымСредствам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (&ВидыЗадолженностиПоДоговоруСБанком)
		|			ТОГДА ""Расходы по договору банковского обслуживания""
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (&ВидыЗадолженностиПоДоговоруСоСпецдепозитарием)
		|			ТОГДА ""Расходы по договору спецдепозитарного обслуживания""
		|	КОНЕЦ");

	ВидыЗадолженностиПоДоговоруСБанком = Новый Массив;
	ВидыЗадолженностиПоДоговоруСБанком.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаБанкКлиентИРКО);
	ВидыЗадолженностиПоДоговоруСБанком.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаОткрытиеИВедениеСчета);
	ВидыЗадолженностиПоДоговоруСБанком.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаЗаПереводДС);
	
	ВидыЗадолженностиПоДоговоруСоСпецдепозитарием = Новый Массив;
	ВидыЗадолженностиПоДоговоруСоСпецдепозитарием.Добавить(Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария);
	ВидыЗадолженностиПоДоговоруСоСпецдепозитарием.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария);
	ВидыЗадолженностиПоДоговоруСоСпецдепозитарием.Добавить(Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария);
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",					СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",									Организация);
	Запрос.УстановитьПараметр("НачалоПериода",									НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",									КонецПериода);
	Запрос.УстановитьПараметр("ВидыЗадолженностиПоДоговоруСБанком",				ВидыЗадолженностиПоДоговоруСБанком);
	Запрос.УстановитьПараметр("ВидыЗадолженностиПоДоговоруСоСпецдепозитарием",	ВидыЗадолженностиПоДоговоруСоСпецдепозитарием);
	
	РасходыПоУправлению = Запрос.Выполнить().Выгрузить();
	
	Возврат СериализоватьЗначение(РасходыПоУправлению);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеБухгалтерииОбУдержанномВознаграждении(Организация, НачалоПериода, КонецПериода, ДанныеДляСтатистики)
	
	ВремяНачала = ТекущаяДатаСеанса();
	ДанныеДляСтатистики.Вставить("ЗаполнитьДанныеБухгалтерииОбУдержанномВознаграждении", "Старт в: " + Формат(ВремяНачала, "ДЛФ=T") + ".");
			
	ТаблицаВознаграждений = РаботаСВнешнимиСистемами.ПолучитьДанныеБухгалтерииОВознагражденииУК("Удержанное", НачалоПериода, КонецПериода, Организация);
	
	Если ТаблицаВознаграждений <> Неопределено Тогда		
	
		ТаблицаВознаграждений.Свернуть("СчетДоверительногоУправления", "Сумма");
			
		ЭтаФорма.АдресДанныхБухгалтерииОбУдержанномВознаграждении = ПоместитьВоВременноеХранилище(ТаблицаВознаграждений, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;
	
	ДанныеДляСтатистики.ЗаполнитьДанныеБухгалтерииОбУдержанномВознаграждении = ДанныеДляСтатистики.ЗаполнитьДанныеБухгалтерииОбУдержанномВознаграждении + " Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУдержанноеВознаграждениеПоДаннымБухгалтерии(АдресДанныхБухгалтерии, СчетДоверительногоУправления, ПриОтсутствииВозвращатьНоль = Ложь)
	
	ТаблицаВознаграждений = Неопределено;	
	
	Если ЭтоАдресВременногоХранилища(АдресДанныхБухгалтерии) Тогда	
		ТаблицаВознаграждений = ПолучитьИзВременногоХранилища(АдресДанныхБухгалтерии);
	КонецЕсли;
	
	Если ТаблицаВознаграждений = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	УдержанноеВознаграждение = ТаблицаВознаграждений.Найти(СчетДоверительногоУправления, "СчетДоверительногоУправления");
	
	Возврат ?(УдержанноеВознаграждение = Неопределено, ?(ПриОтсутствииВозвращатьНоль, 0, Неопределено), УдержанноеВознаграждение.Сумма);
	
КонецФункции

&НаСервере
Функция ВернутьФИОПодписанта(Подписант)
	
	ФИО = Новый Структура;
	
	Если ТипЗнч(Подписант) = Тип("СправочникСсылка.ЮрФизЛица") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество КАК ФИОПолностью,
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицСрезПоследних.Отчество, 1, 1) + ""."" КАК ФИОСокращенно
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", Объект.ДатаРасчета);
		Запрос.УстановитьПараметр("ЮрФизЛицо", Подписант);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ФИО.Вставить("ФИОПолностью", Выборка.ФИОПолностью);
			ФИО.Вставить("ФИОСокращенно", Выборка.ФИОСокращенно);
			
		КонецЕсли;	
	Иначе //строка	
		СтрокаФИО = Подписант;
		
		Если Найти(СтрокаФИО, ".") > 0 Тогда         //только Фамилия И. О. 
			ФИО.Вставить("ФИОПолностью", СтрокаФИО);
			ФИО.Вставить("ФИОСокращенно", СтрокаФИО);
		Иначе	
			МассивФИО = СтрРазделить(СтрокаФИО, " ");
			Если МассивФИО.Количество() = 3 Тогда
				ФИОСокращенно = МассивФИО[0] + " " + Лев(МассивФИО[1],1) + ". " + Лев(МассивФИО[2],1) + ". ";
				
				ФИО.Вставить("ФИОПолностью", СтрокаФИО);
				ФИО.Вставить("ФИОСокращенно", ФИОСокращенно);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаФИО + " не является строкой типа ФИО");
			КонецЕсли;	
		КонецЕсли;
	
	КонецЕсли;	
	
	Возврат ФИО;	
	
КонецФункции	

&НаКлиенте
Процедура СформироватьРасчетВознагражденияExcel(ExcelApp, ПутьКШаблону, ДанныеРасшифровки, ДанныеОбОрганизации, ОткрытьБезСохранения = Истина, ДанныеПодписантов)
	// Инициализация вспомогательных переменных
	#Область Общие_параметры_заполнения
	
	// Подписант учредителя
	ОбщиеПараметрыЗаполнения = Новый Структура;
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО",					"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО_РП",				"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность",					"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность_РП",				"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий",		"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий_РП",	"");
	
	Если ДанныеРасшифровки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Благосостояние") Тогда
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							"А.Е.Леднев");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность",					"Заместитель Генерального директора");
	ИначеЕсли ДанныеРасшифровки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Газфонд") Тогда
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							"В.К. Плотникова");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность",					"Руководитель инвестиционной поддержки");
	ИначеЕсли ДанныеРасшифровки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сургутнефтегаз") Тогда
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							"Назаров А.Е.");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность",					"Генеральный директор");
	ИначеЕсли ДанныеРасшифровки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ХантыМансийский") Тогда
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							"Стулова М.А.");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО",					"Стулова Мария Александровна");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО_РП",				"Стуловой Марии Александровны");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность",					"Президент");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность_РП",				"Президента");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий",		"Устав");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий_РП",	"Устава");
	ИначеЕсли ДанныеРасшифровки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_МГПУФонд") Тогда
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							"Таращук Д.В.");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО",					"Таращук Дмитрий Владимирович");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО_РП",				"Таращука Дмитрия Владимировича");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность",					"Директор");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность_РП",				"Директора");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий",		"Устав");
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий_РП",	"Устава");	
	ИначеЕсли ДанныеРасшифровки.ВидДоговораДоверительногоУправления
		= ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица")
	Тогда
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							ДанныеРасшифровки.КраткоеНаименованиеУчредителяУправления);
	КонецЕсли;
	
	СтруктураПодписант = ДанныеПодписантов.Получить(ДанныеРасшифровки.Клиент);
	Если ЗначениеЗаполнено(СтруктураПодписант) Тогда
		
		ФИО = ВернутьФИОПодписанта(СтруктураПодписант.КонтактноеЛицо);
		
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителя",							ФИО.ФИОСокращенно);
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО",					ФИО.ФИОПолностью);
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяПолноеФИО_РП",				СклоненияСтроки(ФИО.ФИОПолностью, "", "ПД=Родительный")[0]);
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность",					СтруктураПодписант.Должность);
		ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяДолжность_РП",				СклоненияСтроки(СтруктураПодписант.Должность, "", "ПД=Родительный")[0]); 
		Если Не ПустаяСтрока(СтруктураПодписант.ОснованиеПолномочий) Тогда 
			ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий",		СтруктураПодписант.ОснованиеПолномочий);
			ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУчредителяОснованиеПолномочий_РП",	СклоненияСтроки(СтруктураПодписант.ОснованиеПолномочий, "", "ПД=Родительный")[0]);
		КонецЕсли;
	КонецЕсли;
	
	// Подписант УК
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОснованиеПолномочий_РП",					"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУКПолноеФИО",								"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУКПолноеФИО_РП",							"");
	ОбщиеПараметрыЗаполнения.Вставить("ПодписантОтУКДолжность_РП",							"");
	ОбщиеПараметрыЗаполнения.Вставить("АвтоформированиеОснованияПолномочийПодписанта_РП",	Ложь);
	ОбщиеПараметрыЗаполнения.Вставить("АвтоформированиеПолногоФИОПодписантаУК_РП",			Ложь);
	ОбщиеПараметрыЗаполнения.Вставить("АвтоформированиеДолжностиПодписантаУК_РП",			Ложь);
	
	Если СтрНачинаетсяС(НРег(ЭтаФорма.ПодписантОснованиеПолномочий), "доверенность") Тогда
		ОбщиеПараметрыЗаполнения.ПодписантОснованиеПолномочий_РП = "Доверенности" + Сред(ЭтаФорма.ПодписантОснованиеПолномочий, СтрДлина("доверенность") + 1);
	ИначеЕсли СтрНачинаетсяС(НРег(ЭтаФорма.ПодписантОснованиеПолномочий), "доверенности") Тогда
		ОбщиеПараметрыЗаполнения.ПодписантОснованиеПолномочий_РП = ЭтаФорма.ПодписантОснованиеПолномочий;
	ИначеЕсли Не ПустаяСтрока(ЭтаФорма.ПодписантОснованиеПолномочий) Тогда
		ОбщиеПараметрыЗаполнения.ПодписантОснованиеПолномочий_РП					= СклоненияСтроки(ЭтаФорма.ПодписантОснованиеПолномочий, "", "ПД=Родительный")[0];
		ОбщиеПараметрыЗаполнения.АвтоформированиеОснованияПолномочийПодписанта_РП	= (НРег(ЭтаФорма.ПодписантОснованиеПолномочий) <> "устава");
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма.Подписант) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО = ПолноеФИО(ЭтаФорма.Подписант, Объект.ДатаРасчета, Объект.Организация);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО) Тогда
		ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО_РП					= СклоненияСтроки(ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО, "", "ПД=Родительный")[0];
		ОбщиеПараметрыЗаполнения.АвтоформированиеПолногоФИОПодписантаУК_РП	= Не СтрНачинаетсяС(НРег(ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО_РП), "новиковой");	
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЭтаФорма.ПодписантДолжность) Тогда
		ОбщиеПараметрыЗаполнения.ПодписантОтУКДолжность_РП					= СклоненияСтроки(ЭтаФорма.ПодписантДолжность, "", "ПД=Родительный")[0];
		ОбщиеПараметрыЗаполнения.АвтоформированиеДолжностиПодписантаУК_РП	= Не СтрНачинаетсяС(НРег(ОбщиеПараметрыЗаполнения.ПодписантОтУКДолжность_РП), "начальника") И НРег(ОбщиеПараметрыЗаполнения.ПодписантОтУКДолжность_РП) <> "генерального директора";
	КонецЕсли;
	
	// Договор д/у, вид договора, период расчета и пр.
	ОбщиеПараметрыЗаполнения.Вставить("ДатаРасчетаСтрокой",					Формат(Объект.ДатаРасчета, "ДФ=dd.MM.yyyy"));
	ОбщиеПараметрыЗаполнения.Вставить("ДоговорДУ",							ДанныеРасшифровки.НомерДоговора + " от " + Формат(ДанныеРасшифровки.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
	ОбщиеПараметрыЗаполнения.Вставить("НомерДоговораДУ",					ДанныеРасшифровки.НомерДоговора);
	ОбщиеПараметрыЗаполнения.Вставить("ДатаДоговораДУ",						Формат(ДанныеРасшифровки.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
	ОбщиеПараметрыЗаполнения.Вставить("ДатаДоговораДУ_ddMMMMyyyy",			Формат(ДанныеРасшифровки.ДатаЗаключения, "ДФ='«dd» MMMM yyyy'"));
	ОбщиеПараметрыЗаполнения.Вставить("ПредставлениеПериода",				ПредставлениеПериода(ДанныеРасшифровки.НачалоБазовогоПериодаДляОтображения, ДанныеРасшифровки.КонецБазовогоПериодаДляОтображения));
	ОбщиеПараметрыЗаполнения.Вставить("ПредставлениеФинансовогоПериода",	ПредставлениеПериода(ДанныеРасшифровки.НачалоБазовогоПериодаДляОтображения, ДанныеРасшифровки.КонецБазовогоПериодаДляОтображения, "ФП = ИСТИНА"));
	ОбщиеПараметрыЗаполнения.Вставить("НачалоБазовогоПериодаСтрокой",		Формат(ДанныеРасшифровки.НачалоБазовогоПериодаДляОтображения, "ДФ=dd.MM.yyyy"));
	ОбщиеПараметрыЗаполнения.Вставить("КонецБазовогоПериодаСтрокой",		Формат(ДанныеРасшифровки.КонецБазовогоПериодаДляОтображения, "ДФ=dd.MM.yyyy"));
	ОбщиеПараметрыЗаполнения.Вставить("НачалоБазовогоПериода_ddMMMMyyyy",	Формат(ДанныеРасшифровки.НачалоБазовогоПериодаДляОтображения, "ДФ='dd MMMM yyyy'"));
	ОбщиеПараметрыЗаполнения.Вставить("КонецБазовогоПериода_ddMMMMyyyy",	Формат(ДанныеРасшифровки.КонецБазовогоПериодаДляОтображения, "ДФ='dd MMMM yyyy'"));
	
	Если ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями") Тогда
		АббревиатураВидаДоговораДУ = "ПН";
	ИначеЕсли ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами") Тогда
		АббревиатураВидаДоговораДУ = "ПР";
	ИначеЕсли ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов") Тогда
		АббревиатураВидаДоговораДУ = "СС";
	Иначе
		АббревиатураВидаДоговораДУ = "";
	КонецЕсли;
	
	Если ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями") Тогда
		ВидСредствДУ_РП = "пенсионных накоплений";
		ВидСредствДУ_ТП = "пенсионными накоплениями";
	ИначеЕсли ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами") Тогда
		ВидСредствДУ_РП = "пенсионных резервов";
		ВидСредствДУ_ТП = "пенсионными резервами";
	Иначе
		ВидСредствДУ_РП = "";
		ВидСредствДУ_ТП = "________________________";
	КонецЕсли;
	
	ОбщиеПараметрыЗаполнения.Вставить("ВидСредствДУ_РП", ВидСредствДУ_РП);
	ОбщиеПараметрыЗаполнения.Вставить("ВидСредствДУ_ТП", ВидСредствДУ_ТП);
	
	Если СтрНачинаетсяС(ДанныеРасшифровки.ПолноеНаименованиеУчредителяУправления, "Акционерное общество") Тогда
		ПолноеНаименованиеУчредителяУправления_ТП = "Акционерным обществом" + Сред(ДанныеРасшифровки.ПолноеНаименованиеУчредителяУправления, СтрДлина("Акционерное общество") + 1);
		АвтоформированиеПолногоНаименованияУчредителяУправления_ТП = Ложь;
	Иначе
		ПолноеНаименованиеУчредителяУправления_ТП = СклоненияСтроки(ДанныеРасшифровки.ПолноеНаименованиеУчредителяУправления, "", "ПД=Творительный")[0];
		АвтоформированиеПолногоНаименованияУчредителяУправления_ТП = Истина;
	КонецЕсли;
	
	ОбщиеПараметрыЗаполнения.Вставить("ПолноеНаименованиеУчредителяУправления_ТП",					ПолноеНаименованиеУчредителяУправления_ТП); // Полное наименование клиента в творительным падеже
	ОбщиеПараметрыЗаполнения.Вставить("АвтоформированиеПолногоНаименованияУчредителяУправления_ТП",	АвтоформированиеПолногоНаименованияУчредителяУправления_ТП);
	
	ДанныеРасшифровки.Вставить("ОбщиеПараметрыЗаполнения", ОбщиеПараметрыЗаполнения);
	
	// Шаблоны
	ОбщийАкт = СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "Будущее") // Шаблон акта содержит данные по всем базам расчета, либо для каждой базы свой акт
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "ХантыМансийский")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "Сургутнефтегаз");
		
	ДанныеРасшифровки.Вставить("ВыводитьАкт", ЗначениеЗаполнено(ДанныеРасшифровки.ШаблонАкта));
	
	Если ДанныеРасшифровки.ШаблонАкта = "Стандартный" Тогда
		ДанныеРасшифровки.ШаблонАкта = "";
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "Будущее")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "ХантыМансийский")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "ЦКМГПУ")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "Сургутнефтегаз")
	Тогда
		ДанныеРасшифровки.ШаблонАкта = ДанныеРасшифровки.ШаблонАкта + АббревиатураВидаДоговораДУ;
	КонецЕсли;
	
	Если ДанныеРасшифровки.ШаблонРасшифровки = "Стандартный" Тогда
		// Стандартный 2024, с октября (только для РэМ и Траст)
		Если Объект.ДатаРасчета >= Дата(2024, 10, 1)
			И (ДанныеРасшифровки.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
				Или ДанныеРасшифровки.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"))
		Тогда
			ДанныеРасшифровки.ШаблонРасшифровки = "2024";
		// Стандартный 2023
		ИначеЕсли Объект.ДатаРасчета >= Дата(2023, 1, 1) Тогда
			ДанныеРасшифровки.ШаблонРасшифровки = "2023";
		// Стандартный
		Иначе
			ДанныеРасшифровки.ШаблонРасшифровки = "";
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Будущее")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ХантыМансийский")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Национальный")
	Тогда
		ДанныеРасшифровки.ШаблонРасшифровки = ДанныеРасшифровки.ШаблонРасшифровки + АббревиатураВидаДоговораДУ;
	КонецЕсли;
	
	#КонецОбласти
	
	// Если вознаграждение рассчитывается чаще раза в год и удерживается из собственных средств клиента, нужно получать его из базы БУ
	Отказ = Ложь;
	ИспользоватьВознаграждениеИзБухгалтерскойБазы =
		Объект.ПериодичностьРасчета <> ПредопределенноеЗначение("Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежегодно")
		И ОплатаВознагражденияУправляющегоИзСобственныхСредствКлиента(
			Объект.Организация, ДанныеРасшифровки.СчетДоверительногоУправления, ДанныеРасшифровки.КонецБазовогоПериода, Отказ);
		
	Если Отказ Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelЗакрытьПриложение(ExcelApp);
		Возврат;
	КонецЕсли;
	
	РанееУдержанноеВознаграждениеБУ = ?(ИспользоватьВознаграждениеИзБухгалтерскойБазы,
		ПолучитьУдержанноеВознаграждениеПоДаннымБухгалтерии(
			ЭтаФорма.АдресДанныхБухгалтерииОбУдержанномВознаграждении, ДанныеРасшифровки.СчетДоверительногоУправления, Истина),
		Неопределено);
	
	ДанныеРасшифровки.Вставить("ИспользоватьВознаграждениеИзБухгалтерскойБазы",	ИспользоватьВознаграждениеИзБухгалтерскойБазы);
	ДанныеРасшифровки.Вставить("РанееУдержанноеВознаграждениеБУ",				РанееУдержанноеВознаграждениеБУ);
	
	ДанныеРасшифровки.Вставить("РанееУдержанноеВознаграждениеБУИспользованоВРасчете", Ложь);
	
	Расшифровка = Новый Структура("ExcelApp, Шаблон, Результат",
		ExcelApp, Новый Структура, Новый Структура);
	
	// Создание документа MS Excel на основании шаблона
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыПриложения(ExcelApp, Ложь);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыИнтерактивностиПриложения(ExcelApp, Ложь, Ложь, Ложь, Ложь);
	
	КнигаШаблонаExcel	= ExcelApp.Workbooks.Open(ПутьКШаблону);
	НоваяКнигаExcel		= ExcelApp.Workbooks.Add();
	
	Расшифровка.Шаблон.Вставить("Книга", КнигаШаблонаExcel);
	Расшифровка.Шаблон.Вставить("ПараметрыЛистов", Новый Соответствие);
	
	Расшифровка.Результат.Вставить("Книга", НоваяКнигаExcel);
	Расшифровка.Результат.Вставить("ПараметрыЛистов", Новый Соответствие);
	
	Если ДанныеРасшифровки.ВыводитьАкт Тогда
		ШаблонСтраницыАкта = ДобавитьОписаниеСтраницыExcel("Акт", Расшифровка.Шаблон, Ложь);
	КонецЕсли;
	
	// Удаление листов, созданных по умолчанию, а первый лист - титульный,
	//	т.к. все страницы Excel удалить не даёт
	ВсегоЛистов = НоваяКнигаExcel.Sheets.Count;
	Для н = 2 По ВсегоЛистов Цикл
		НоваяКнигаExcel.Sheets(2).Delete();
	КонецЦикла;
	
	#Область Шапка_титульной_страницы
	
	ТитульнаяСтраница = ДобавитьОписаниеСтраницыExcel("Титульная страница", Расшифровка.Результат, Истина, Истина);
	ТитульнаяСтраница.КлючевыеЯчейки.Вставить("ВознаграждениеУплаченное", Новый Массив); // Для заполнения в конце расчета
	
	// Шапка
	ШаблонТитульнойСтраницы = ДобавитьОписаниеСтраницыExcel("Титульная страница", Расшифровка.Шаблон, Ложь);
	
	ШаблонШапки = Неопределено;
	
	// Шапка для организации
	Если Не ПустаяСтрока(ДанныеОбОрганизации.КраткийКод) Тогда
		ШаблонШапки = ДобавитьШаблонОбластиСтраницыExcelПоГодовомуШаблону(
			"Шапка<Год>_" + ДанныеОбОрганизации.КраткийКод, ДанныеРасшифровки.ШаблонРасшифровки, ШаблонТитульнойСтраницы);;
	КонецЕсли;
	
	// Шапка общего вида
	Если ШаблонШапки = Неопределено Тогда
		ШаблонШапки = ДобавитьШаблонОбластиСтраницыExcelПоГодовомуШаблону(
			"Шапка<Год>", ДанныеРасшифровки.ШаблонРасшифровки, ШаблонТитульнойСтраницы);
	КонецЕсли;
	
	Если ШаблонШапки <> Неопределено Тогда

		ШаблонГруппаПоказателей	= ДобавитьШаблонОбластиСтраницыExcel("ГруппаПоказателей" + ДанныеРасшифровки.ШаблонРасшифровки, ШаблонТитульнойСтраницы);
		ШаблонПоказатель		= ДобавитьШаблонОбластиСтраницыExcel("Показатель" + ДанныеРасшифровки.ШаблонРасшифровки, ШаблонТитульнойСтраницы);
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапки, Истина, Истина, , ЭтаФорма.ВыводитьКартинкиВРасшифровке);  	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(ExcelApp);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КраткоеНаименованиеУК",		ДанныеОбОрганизации.КраткоеНаименованиеОрганизации, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПолноеНаименованиеУК",		ДанныеОбОрганизации.НаименованиеОрганизации, Истина);  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаРасчета",					ОбщиеПараметрыЗаполнения.ДатаРасчетаСтрокой);  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "АдресУК",						ДанныеОбОрганизации.АдресОрганизации);  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ИННУК",						"ИНН " + ДанныеОбОрганизации.ИННОрганизации, Истина);  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КППУК",						"КПП " + ДанныеОбОрганизации.КППОрганизации, Истина);  	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НомерСчетаДУ",				ДанныеРасшифровки.КодСчета, Истина);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "УчредительУправления",		ДанныеРасшифровки.УчредительУправления, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДоговорДУ",					ОбщиеПараметрыЗаполнения.ДоговорДУ, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НомерДоговораДУ",				ОбщиеПараметрыЗаполнения.НомерДоговораДУ, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаДоговораДУ",				ОбщиеПараметрыЗаполнения.ДатаДоговораДУ, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаДоговораДУ_ddMMMMyyyy",	ОбщиеПараметрыЗаполнения.ДатаДоговораДУ_ddMMMMyyyy, Истина);
		
		Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Будущее")
			Или ДанныеРасшифровки.ШаблонРасшифровки = "2023"
			Или ДанныеРасшифровки.ШаблонРасшифровки = "2024"
		Тогда
			#Область Будущее_и_Стандартный_2023_и_2024
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВидСредствДУ #ПД=Родительный",			ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПолноеНаименованиеУчредителяУправления",	ДанныеРасшифровки.ПолноеНаименованиеУчредителяУправления, Истина);
			
			#КонецОбласти
		ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "Атомфонд"
			Или ДанныеРасшифровки.ШаблонРасшифровки = "ППА"
		Тогда
			#Область Атомфонд_и_ППА
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВидСредствДУ #ПД=Родительный", ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВидСредствДУ #ПД=Творительный", ОбщиеПараметрыЗаполнения.ВидСредствДУ_ТП, Истина);	
			
			// Заголовок расчета
			ВыводитьТипВознаграждения = (ДанныеРасшифровки.БазыРасчета.Количество() > 1);
			
			Если ВыводитьТипВознаграждения Тогда
				ЗаголовокРасчета = "Расчет вознаграждения";
			ИначеЕсли ДанныеРасшифровки.БазыРасчета[0].ЭтоВознаграждениеЗаУправление Тогда
				ЗаголовокРасчета = "Расчет вознаграждения (плата за управление)";
			Иначе
				ЗаголовокРасчета = "Расчет вознаграждения (плата за успех)";
			КонецЕсли;
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗаголовокРасчета", ЗаголовокРасчета, Истина);
			
			Если ОбщиеПараметрыЗаполнения.АвтоформированиеПолногоНаименованияУчредителяУправления_ТП Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Проверьте корректность полного наименования учредителя управления в творительном падеже: %1", ОбщиеПараметрыЗаполнения.ПолноеНаименованиеУчредителяУправления_ТП));	
			КонецЕсли;
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПолноеНаименованиеУчредителяУправления #ПД=Творительный", ОбщиеПараметрыЗаполнения.ПолноеНаименованиеУчредителяУправления_ТП, Истина);
			
			#КонецОбласти
		ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ХантыМансийский")
			Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ЦКМГПУ") Тогда
			#Область Ханты_Мансийский
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КраткоеНаименованиеУчредителя",		ДанныеРасшифровки.КраткоеНаименованиеУчредителяУправления, Истина);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаДоговораДУ #ДФ='dd MMMM yyyy'",	Формат(ДанныеРасшифровки.ДатаЗаключения, "ДФ='dd MMMM yyyy'"), Истина);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаРасчета #ДФ='dd MMMM yyyy'",		Формат(Объект.ДатаРасчета, "ДФ='dd MMMM yyyy'"), Истина);
			
			#КонецОбласти
		КонецЕсли;
		
		Если ДанныеРасшифровки.ШаблонРасшифровки = "Благосостояние"
			Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Будущее")
		Тогда
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПериодРасчета", 
				"с " + Формат(ДанныеРасшифровки.НачалоБазовогоПериодаДляОтображения, "ДФ='«dd» MMMM yyyy ''года'''")
					+ " по " + Формат(ДанныеРасшифровки.КонецБазовогоПериодаДляОтображения, "ДФ='«dd» MMMM yyyy ''года'''"), Истина);
		ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз") 
			Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ЦКМГПУ") Тогда
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПериодРасчета", 
				"с " + Формат(ДанныеРасшифровки.НачалоБазовогоПериодаДляОтображения, "ДФ='dd MMMM yyyy ''г.'''")
					+ " по " + Формат(ДанныеРасшифровки.КонецБазовогоПериодаДляОтображения, "ДФ='dd MMMM yyyy ''г.'''"), Истина);
		Иначе
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПериодРасчета", ОбщиеПараметрыЗаполнения.ПредставлениеПериода, Истина);
		КонецЕсли;
			
		ОбластьНачалоПериодаРасчета			= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "НачалоПериодаРасчета");
		ОбластьКонецПериодаРасчета			= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КонецПериодаРасчета");
		ОбластьКоличествоДнейПериодаРасчета	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КоличествоДнейПериодаРасчета");
		
		Если ОбластьНачалоПериодаРасчета <> Неопределено Тогда
			ОбластьНачалоПериодаРасчета.Value2 = Формат(ДанныеРасшифровки.НачалоРасчетногоПериода, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если ОбластьКонецПериодаРасчета <> Неопределено Тогда
			ОбластьКонецПериодаРасчета.Value2 = Формат(ДанныеРасшифровки.КонецРасчетногоПериода, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если Не (ОбластьНачалоПериодаРасчета = Неопределено Или ОбластьКонецПериодаРасчета = Неопределено Или ОбластьКоличествоДнейПериодаРасчета = Неопределено) Тогда
			ОбластьКоличествоДнейПериодаРасчета.FormulaLocal = "="
				+ ОбластьКонецПериодаРасчета.Address(Ложь, Ложь) + "-" + ОбластьНачалоПериодаРасчета.Address(Ложь, Ложь) 
				+ ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, "+1", "");
		КонецЕсли;
		
		КонечнаяСтрокаШапкиТитульнойСтраницы = ТитульнаяСтраница.ВсегоСтрок;
		
	КонецЕсли;
	
	#КонецОбласти
	
	// Расчёт
	СтраницаРасчета = ДобавитьОписаниеСтраницыExcel("Расчет", Расшифровка.Результат);
	СтраницаРасчета.КлючевыеЯчейки.Вставить("РасчетВознаграждения", Новый Массив);
	
	ШаблонСтраницыРасчета	= ДобавитьОписаниеСтраницыExcel("Расчет", Расшифровка.Шаблон, Ложь);
	ШаблонГруппаРасчета		= ДобавитьШаблонОбластиСтраницыExcel("ГруппаРасчета", ШаблонСтраницыРасчета);
	
	#Область Общие_параметры_расчёта
	
	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонГруппаРасчета, Истина, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(ExcelApp);
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ГруппаРасчета", "Параметры расчета");
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	ШаблонОбласти = ШаблонСтраницыРасчета.Страница.Range("ОбщиеПараметрыРасчета");
	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонОбласти);
	
	ЯчейкаНачалоПериодаРасчета			= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "НачалоПериодаРасчета");
	ЯчейкаКонецПериодаРасчета			= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КонецПериодаРасчета");
	ЯчейкаКоличествоДнейВГоду			= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КоличествоДнейВГоду");
	ЯчейкаКоличествоДнейПериодаРасчета	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КоличествоДнейПериодаРасчета");
	
	ЯчейкаНачалоПериодаРасчета.Name			= "НачалоПериодаРасчета";
	ЯчейкаКонецПериодаРасчета.Name			= "КонецПериодаРасчета";
	ЯчейкаКоличествоДнейВГоду.Name			= "КоличествоДнейВГоду";
	ЯчейкаКоличествоДнейПериодаРасчета.Name	= "КоличествоДнейПериодаРасчета";
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НачалоПериодаРасчета", Формат(ДанныеРасшифровки.НачалоРасчетногоПериода, "ДФ=dd.MM.yyyy"));  
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КонецПериодаРасчета", Формат(ДанныеРасшифровки.КонецРасчетногоПериода, "ДФ=dd.MM.yyyy"));  
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КоличествоДнейВГоду", ДанныеРасшифровки.ДнейВГоду);  
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КоличествоДнейПериодаРасчета",
		"=" + ЯчейкаКонецПериодаРасчета.Address(Ложь, Ложь) + "-" + ЯчейкаНачалоПериодаРасчета.Address(Ложь, Ложь) + ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, "+1", ""));

	// Дополним их параметрами расчета в валюте 
	
	РасчетВВалютеУчета = (ДанныеРасшифровки.ВалютаРасчета = ДанныеРасшифровки.ВалютаУчета);
	
	Если Не РасчетВВалютеУчета Тогда
		
		#Область Параметры_валюты_расчета
		
		СвойстваВалютыРасчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеРасшифровки.ВалютаРасчета, "Наименование, НаименованиеПолное");
		
		Если ДанныеРасшифровки.ВалютаРасчета = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Доллар_США") Тогда
			ПредставлениеВалютыРасчета = "в долларах";
		ИначеЕсли ДанныеРасшифровки.ВалютаРасчета = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_ЕВРО") Тогда
			ПредставлениеВалютыРасчета = "в евро";
		Иначе
			ПредставлениеВалютыРасчета = СвойстваВалютыРасчета.НаименованиеПолное;	
		КонецЕсли;
		
		ШаблонОбласти = ШаблонСтраницыРасчета.Страница.Range("ПараметрыВалютыРасчета");	
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонОбласти);  	
		
		ЯчейкаВалютаРасчета					= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ВалютаРасчета");
		ЯчейкаПредставлениеВалютыРасчета	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ПредставлениеВалютыРасчета");
		ЯчейкаДатаРасчетаСЧАНаНачалоГода	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ДатаРасчетаСЧАНаНачалоГода");
		
		ЯчейкаВалютаРасчета.Name				= "ВалютаРасчета";
		ЯчейкаПредставлениеВалютыРасчета.Name	= "ПредставлениеВалютыРасчета";
		ЯчейкаДатаРасчетаСЧАНаНачалоГода.Name	= "ДатаРасчетаСЧАНаНачалоГода";
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВалютаРасчета",				СвойстваВалютыРасчета.Наименование);  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПредставлениеВалютыРасчета",	ПредставлениеВалютыРасчета);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаРасчетаСЧАНаНачалоГода",	"");
		
		СтраницаРасчета.КлючевыеЯчейки.Вставить("ДатаРасчетаСЧАНаНачалоГода", ЯчейкаДатаРасчетаСЧАНаНачалоГода); 
		
		#КонецОбласти
		
	КонецЕсли;
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	#КонецОбласти
	
	НомерРасчета	= 0;
	ВсегоБазРасчета	= ДанныеРасшифровки.БазыРасчета.Количество();
	
	#Область Добавление_параметров_по_базам_расчёта
	
	Для Каждого РасшифровкаРасчетаПоБазе Из ДанныеРасшифровки.БазыРасчета Цикл
		#Область Представление_базы_расчета  		
		
		НомерРасчета = НомерРасчета + 1;	
		
		Если СтраницаРасчета.ВсегоСтрок = 0 Тогда // Для первого вывода копируем ширину столбцов
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонГруппаРасчета, Истина, Истина);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(ExcelApp);	
		Иначе
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонГруппаРасчета, Ложь, Ложь);	
		КонецЕсли;
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ГруппаРасчета",
			?(ВсегоБазРасчета > 1, Строка(НомерРасчета) + ". ", "") + "Расчет вознаграждения по базе '" + Строка(РасшифровкаРасчетаПоБазе.БазаРасчета) + "'");	
			
		СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;	
		
		// Представление базы расчета на титульной странице
		
		Если ДанныеРасшифровки.ШаблонРасшифровки = "Атомфонд" Тогда
			
			#Область Атомфонд
			
			ИмяШаблонаЗаголовкаЧастиВознаграждения	  = ?(РасшифровкаРасчетаПоБазе.ЭтоВознаграждениеЗаУправление, "ЗаголовокРасчетаПостояннойЧастиАтомфонд", "ЗаголовокРасчетаПеременнойЧастиАтомфонд");
			ИмяШаблонаШапкиРасчетаЧастиВознаграждения = ?(РасшифровкаРасчетаПоБазе.ЭтоВознаграждениеЗаУправление, "ШапкаРасчетаПостояннойЧастиАтомфонд", "ШапкаРасчетаПеременнойЧастиАтомфонд");
			
			Если ВыводитьТипВознаграждения Тогда
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, ИмяШаблонаЗаголовкаЧастиВознаграждения));
			КонецЕсли;
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, ИмяШаблонаШапкиРасчетаЧастиВознаграждения));
			
			#КонецОбласти
			
		КонецЕсли;
		
		#КонецОбласти
		
		ОбластьАкта						 = Неопределено;
		ПредставлениеСуммыВознаграждения = ПредставленияСуммыДляПечати(РасшифровкаРасчетаПоБазе.СуммаВознаграждения);
		
		// Расшифровка расчёта
		Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ИнвестиционныйДоход")
			Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ИнвестиционныйДоходПоБалансу")
		Тогда
			#Область Инвестиционный_доход
			
			РасчетПоБалансовойСтоимости = (РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ИнвестиционныйДоходПоБалансу"));
			СуффиксПоказателей			= ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок"); 
			
			ОписаниеОбластиИнвестиционногоДохода = ВывестиИнвестиционныйДоходExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости);
			
			// Расчет вознаграждения по ИД
			ШаблонРасчетВознагражденияПоИД = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияПоИД");
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетВознагражденияПоИД, Ложь, Ложь);
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить("Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "Ставка"));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки,
				"ИнвестиционныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь));
				
			Если РасшифровкаРасчетаПоБазе.Свойство("ЭтоРасчетОграниченияДляМинимальногоМаксимальногоЗначения") Тогда
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки,
					"Ставка",
					Формат(
						?(РасшифровкаРасчетаПоБазе.ЭтоРасчетОграниченияДляМинимальногоМаксимальногоЗначения, РасшифровкаРасчетаПоБазе.Ставка_Доп, РасшифровкаРасчетаПоБазе.Ставка),
						"ЧН=0; ЧГ=; ЧФ=Ч%"));					
			Иначе
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки,
					"Ставка",
					Формат(РасшифровкаРасчетаПоБазе.Ставка, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			КонецЕсли;
				
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки,
				"ВознаграждениеУплаченное",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь));
			
			ЯчейкаВознаграждение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D");
			
			// Добавляем отступ для следующих расчетов
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#Область Выводим_расчет_на_титульную_страницу
			
			ПредставлениеВознаграждения = "Вознаграждение управляющего по инвестиционному доходу";
			
			ПустаяТитульная = (ТитульнаяСтраница.ВсегоСтрок = 0);
			
			Если ДанныеРасшифровки.ШаблонРасшифровки = "СбербанкПН" Тогда
				
				#Область Сбербанк_ПН
				
				ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПН_П2", ШаблонТитульнойСтраницы);
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр, ПустаяТитульная, ПустаяТитульная);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПараметра",
					"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				
				ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПН_П3", ШаблонТитульнойСтраницы);
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПараметра", "=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "СбербанкПР" Тогда
				
				#Область Сбербанк_ПР
				
				ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПР_П4", ШаблонТитульнойСтраницы);
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр, ПустаяТитульная, ПустаяТитульная);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПараметра",
					"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				
				ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПР_П5", ШаблонТитульнойСтраницы);
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПараметра", "=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь, , Истина));
				
				ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПР_П6", ШаблонТитульнойСтраницы);
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПараметра", "=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "Газфонд" Тогда
				
				#Область Газфонд
				
				ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаГазфондИнвестиционныйДоход");
				ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, ПустаяТитульная, ПустаяТитульная);	
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КраткоеНаименованиеУК",	ДанныеОбОрганизации.КраткоеНаименованиеОрганизации, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДоговорДУ",				ОбщиеПараметрыЗаполнения.ДоговорДУ, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ФинансовыйПериодРасчета",	ОбщиеПараметрыЗаполнения.ПредставлениеФинансовогоПериода, Истина);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ИнвестиционныйДоход",	"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Ставка",				"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина) + " * 100");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Сумма",				"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "ФизЛицо" Тогда
				
				#Область Физическое_лицо
				
				ПредставлениеВознаграждения = "Плата за успех";
				
				#КонецОбласти
				
			ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Будущее") Тогда
				
				#Область Будущее
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",		"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаВознагражденияПоИД",	"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина) + " * 100");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеПоИД",			"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз") Тогда
				
				#Область Сургутнефтегаз
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",		"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаВознагражденияПоИД",	"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина) + " * 100");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеПоИД",			"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Национальный") Тогда
				
				#Область Национальный
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",		"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаВознагражденияПоИД",	"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина) + " * 100");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеПоИД",			"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело,
					"ДоходностьУправления",	
					Формат(?(РасшифровкаРасчетаПоБазе.ЭтоРасчетОграниченияДляМинимальногоМаксимальногоЗначения,
						РасшифровкаРасчетаПоБазе.ДоходностьУправления_Доп,
						РасшифровкаРасчетаПоБазе.ДоходностьУправления), "ЧДЦ=2; ЧРД=,; ЧГ="),
					Истина);
					
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело,
					"ДоходностьУправленияСУчетомВознагражденияУК",
					Формат(?(РасшифровкаРасчетаПоБазе.ЭтоРасчетОграниченияДляМинимальногоМаксимальногоЗначения,
						РасшифровкаРасчетаПоБазе.ДоходностьУправления_Доп,
						РасшифровкаРасчетаПоБазе.ДоходностьУправления), "ЧДЦ=2; ЧРД=,; ЧГ="),
					Истина);
					
				СтавкаДополнительногоВознаграждения = ?(
					РасшифровкаРасчетаПоБазе.ЭтоРасчетОграниченияДляМинимальногоМаксимальногоЗначения,
					РасшифровкаРасчетаПоБазе.СтавкаДополнительногоВознаграждения_Доп,
					РасшифровкаРасчетаПоБазе.СтавкаДополнительногоВознаграждения);
										
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело,
					"СтавкаДополнительногоВознаграждения",
					Формат(СтавкаДополнительногоВознаграждения, "ЧДЦ=2; ЧРД=,; ЧГ="),
					Истина);
					
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело,
					"ВознаграждениеКОплате",
					Формат(ДанныеРасшифровки.СуммаВознаграждения, "ЧДЦ=2; ЧРД=,; ЧГ="),
					Истина);
					
				Если ДанныеРасшифровки.ШаблонРасшифровки = "НациональныйПН" Тогда
					
					// Пока нули - учет в бух. базе
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьТело,
						"НеобходимыеРасходыУК",
						0,
						Истина);
						
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьТело,
						"ОплаченныеРасходыСД",
						0,
						Истина);	
					
				КонецЕсли;
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "ППА"
				Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ХантыМансийский")
			Тогда
				
				#Область ППА_и_Ханты_Мансийский
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				ВыводитьСимволПроцента = СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ХантыМансийский");
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаВознагражденияПоИД",	"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина) + ?(ВыводитьСимволПроцента, "", " * 100"));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеПоИД",			"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "ЦКМГПУ"
			Тогда
				
				#Область ППА_и_Ханты_Мансийский
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				ВыводитьСимволПроцента = СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ЦКМГПУ");
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаВознагражденияПоИД",	"=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина) + ?(ВыводитьСимволПроцента, "", " * 100"));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеПоИД",			"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "2023"
				Или ДанныеРасшифровки.ШаблонРасшифровки = "2024"
			Тогда
				
				#Область Стандартный_2023_2024
				
				ШаблонОбласти = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(ШаблонТитульнойСтраницы, "ШапкаСтавкаЗаУспех<Год>", ДанныеРасшифровки.ШаблонРасшифровки);
				
				ВысотаОбласти = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВысотаОбласти(ШаблонОбласти);
				
				ОбластьПриемник = ТитульнаяСтраница.Страница.Cells(КонечнаяСтрокаШапкиТитульнойСтраницы + 1, 1);
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(ТитульнаяСтраница, ШаблонОбласти, ОбластьПриемник, , , ВысотаОбласти);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ОписаниеСтавкиЗаУспех", "% от дохода", Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СтавкаЗаУспех", "=" + СтраницаРасчета.КлючевыеЯчейки["Ставка_ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				
				КонечнаяСтрокаШапкиТитульнойСтраницы = КонечнаяСтрокаШапкиТитульнойСтраницы + ВысотаОбласти;
				
				#КонецОбласти
				
			КонецЕсли;
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				ПредставлениеВознаграждения,
				ЯчейкаВознаграждение,
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Ложь
			);
			
			#КонецОбласти
			
			Если ДанныеРасшифровки.ВыводитьАкт Тогда
				
				#Область Формируем_акт_об_оказанных_услугах
				
				ОбластьАкта = ПолучитьОбластьАктаExcel(ExcelApp, Расшифровка, ДанныеРасшифровки, ШаблонСтраницыАкта, ОбщийАкт, "АктИнвестиционныйДоход");
				
				ПредставлениеИД = ПредставленияСуммыДляПечати(РасшифровкаРасчетаПоБазе.ИнвестиционныйДоходСкорректированный);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеПоИД",					ПредставлениеСуммыВознаграждения.Сумма, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеПоИДРублей",			ПредставлениеСуммыВознаграждения.СуммаРублей, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеПоИДПрописьюРублей",	ПредставлениеСуммыВознаграждения.СуммаПрописьюРублей, Истина);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ИнвестиционныйДоходРублей",			ПредставлениеИД.СуммаРублей, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ИнвестиционныйДоходПрописьюРублей",	ПредставлениеИД.СуммаПрописьюРублей, Истина);
				
				Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Будущее2023")
					Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз") Тогда
					ВознаграждениеЗаУправление = 0;  //вроде всегда ноль?
					ПредставлениеВознаграждениеЗаУправление = ПредставленияСуммыДляПечати(ВознаграждениеЗаУправление);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеЗаУправлениеРублей",			ПредставлениеВознаграждениеЗаУправление.СуммаРублей, Истина);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеЗаУправлениеПрописьюРублей",	ПредставлениеВознаграждениеЗаУправление.СуммаПрописьюРублей, Истина);				
				КонецЕсли;
				
				#КонецОбласти
				
			КонецЕсли;
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСуммаВГод") Тогда
			#Область Фиксированная_сумма_в_год
			
			// Заполняем страницу расчета
			
			ШаблонРасчетВознагражденияСуммаВГод = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияСуммаВГод");	
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетВознагражденияСуммаВГод, Ложь, Ложь);  	
			
			ЯчейкаСумма				= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "Сумма");
			ЯчейкаКоличествоДней	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КоличествоДней");
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Сумма",				Формат(РасшифровкаРасчетаПоБазе.СуммаВГод, "ЧДЦ=2; ЧРД=,; ЧГ="));  
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КоличествоДней",		РасшифровкаРасчетаПоБазе.КоличествоДнейПериодаРасчета);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КоличествоДнейВГоду",	ДанныеРасшифровки.ДнейВГоду);
			
			ЯчейкаВознаграждение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D");
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#Область Выводим_расчет_на_титульную_страницу
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего по фиксированной сумме в год",
				ЯчейкаВознаграждение,
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Истина
			);
			
			Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Будущее") Тогда
				
				#Область Будущее
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "КоличествоДнейПериодаРасчета",	"=" + ЯчейкаКоличествоДней.Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаЗаГод",						"=" + ЯчейкаСумма.Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеЗаУправление",		"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "НациональныйПН" Тогда
				
				#Область Национальный
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ПостоянноеВознаграждение", "=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			КонецЕсли;
			
			#КонецОбласти
			
			Если ДанныеРасшифровки.ВыводитьАкт Тогда
				
				#Область Формируем_акт_об_оказанных_услугах
				
				ОбластьАкта = ПолучитьОбластьАктаExcel(ExcelApp, Расшифровка, ДанныеРасшифровки, ШаблонСтраницыАкта, ОбщийАкт, "АктФиксированнаяСуммаВГод");
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеЗаУправление",				  ПредставлениеСуммыВознаграждения.Сумма, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеЗаУправлениеРублей",		  ПредставлениеСуммыВознаграждения.СуммаРублей, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ВознаграждениеЗаУправлениеПрописьюРублей", ПредставлениеСуммыВознаграждения.СуммаПрописьюРублей, Истина);
				
				#КонецОбласти
				
			КонецЕсли;
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСуммаВМесяц") Тогда
			#Область Фиксированная_сумма_в_месяц
			
			// Месяцы управления
			
			ОбластьМесяцыУправления = ВывестиМесяцыУправления(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);
			
			// Заполняем страницу расчета
			
			ШаблонРасчетВознаграждения	= ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияСуммаВМесяц");	
			ОбластьВставки				= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетВознаграждения, Ложь, Ложь);  	
			
			ЯчейкаСумма					= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "Сумма");
			ЯчейкаМесяцевВУправлении	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "МесяцевВУправлении");
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Сумма",				Формат(РасшифровкаРасчетаПоБазе.СуммаВМесяц, "ЧДЦ=2; ЧРД=,; ЧГ="));  
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "МесяцевВУправлении",	
					СтрШаблон("=СУММПРОИЗВ(%1/%2)",
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьМесяцыУправления.НачальнаяСтрока, ОбластьМесяцыУправления.КолонкаДнейВУправлении, ОбластьМесяцыУправления.КонечнаяСтрока, ОбластьМесяцыУправления.КолонкаДнейВУправлении),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьМесяцыУправления.НачальнаяСтрока, ОбластьМесяцыУправления.КолонкаДнейВМесяце, ОбластьМесяцыУправления.КонечнаяСтрока, ОбластьМесяцыУправления.КолонкаДнейВМесяце)));
			
			ЯчейкаВознаграждение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D");
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			// Добавляем показатели на титульную страницу
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего по фиксированной сумме в месяц",
				ЯчейкаВознаграждение,
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Истина
			);
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСуммаВДень") Тогда
			#Область Фиксированная_сумма_в_день
			
			РасчетПоБалансовойСтоимости = (РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСуммаВДень"));
			СуффиксПоказателей			= ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок"); 
			
			// Расчет инвестиционного дохода
			
			Если РасшифровкаРасчетаПоБазе.ТолькоПриНаличииДохода Тогда
				ОписаниеОбластиИнвестиционногоДохода = ВывестиИнвестиционныйДоходExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости);
			КонецЕсли;
			
			// Расчет вознаграждения
			
			НаименованиеОбластиРасчета = "РасчетВознагражденияСуммаВДень" + ?(РасшифровкаРасчетаПоБазе.ТолькоПриНаличииДохода, "ПриНаличииДохода", "");
			
			ШаблонРасчетВознагражденияСуммаВДень = ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыРасчета, НаименованиеОбластиРасчета + ДанныеРасшифровки.ШаблонРасшифровки);
			Если ШаблонРасчетВознагражденияСуммаВДень = Неопределено Тогда
				ШаблонРасчетВознагражденияСуммаВДень = ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыРасчета, НаименованиеОбластиРасчета);
			КонецЕсли;
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетВознагражденияСуммаВДень, Ложь, Ложь);
			
			Если РасшифровкаРасчетаПоБазе.ТолькоПриНаличииДохода Тогда
				ЯчейкаСумма				= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "Сумма");
				ЯчейкаКоличествоДней	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КоличествоДней");
				ЯчейкаСуммаЗаПериод		= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СуммаЗаРасчетныйПериод");
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаЗаРасчетныйПериод",	"=" + ЯчейкаСумма.Address(Ложь, Ложь) + " * " + ЯчейкаКоличествоДней.Address(Ложь, Ложь));  
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ИнвестиционныйДоход",		"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВознаграждениеУплаченное","=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь));  
			КонецЕсли;
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Сумма",			Формат(РасшифровкаРасчетаПоБазе.СуммаВДень, "ЧДЦ=2; ЧРД=,; ЧГ="));  
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "КоличествоДней",	РасшифровкаРасчетаПоБазе.КоличествоДнейПериодаРасчета);  
			
			// Добавляем показатели на титульную страницу
			
			ЯчейкаВознаграждение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D");
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего по фиксированной сумме за каждый день",	
				ЯчейкаВознаграждение,
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Истина
			);
			
			Если ДанныеРасшифровки.ШаблонРасшифровки = "Благосостояние" Тогда
				
				Если Не РасшифровкаРасчетаПоБазе.ТолькоПриНаличииДохода Тогда
					ЯчейкаСуммаЗаПериод = ЯчейкаВознаграждение;
				КонецЕсли;
				
				ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП8");
				ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Сумма",
					Строка(РасшифровкаРасчетаПоБазе.СуммаВДень), Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
					"=" + ЯчейкаСуммаЗаПериод.Address(Ложь, Ложь, , Истина));
				
				ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП9");
				ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
					"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				
			КонецЕсли;
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяРыночнаяСтоимостьИмуществаПринятогоВДоверительноеУправлениеЗаВычетомВыведенного")
			Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяБалансоваяСтоимостьИмуществаПринятогоВДоверительноеУправлениеЗаВычетомВыведенного")
		Тогда
			#Область Средняя_стоимость_имущества
			
			РасчетПоБалансовойСтоимости = (РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяБалансоваяСтоимостьИмуществаПринятогоВДоверительноеУправлениеЗаВычетомВыведенного"));
			РасчетОтСЧАнаКонецПериода	= РасшифровкаРасчетаПоБазе.РасчетОтСЧАнаКонецПериода;
			СуффиксПоказателей			= ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок"); 
			
			// Ввод-вывод активов
			
			Если РасчетВВалютеУчета Тогда
				ОбластьДвиженияАктивов = ВывестиДвиженияАктивовExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей, СуффиксПоказателей, РасчетОтСЧАнаКонецПериода);
			ИначеЕсли РасчетОтСЧАнаКонецПериода Тогда
				ВызватьИсключение СтрШаблон("Расшифровка расчета в валюте по базе '%1' не реализована", РасшифровкаРасчетаПоБазе.БазаРасчета); // #Техдолг
			Иначе
				ОбластьДвиженияАктивов = ВывестиДвиженияАктивовСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей, СуффиксПоказателей);
			КонецЕсли;
			
			// Расчет вознаграждения по средней стоимости имущества
				
			ШаблонРасчетСредняяСтоимостьИмущества = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияСредняяСтоимостьИмущества" + ?(РасчетОтСЧАнаКонецПериода, "ОтСЧАнаКонецПериода", ""));	
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетСредняяСтоимостьИмущества, Ложь, Ложь);  	
			
			Если РасчетОтСЧАнаКонецПериода
				И СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксПоказателей] = Неопределено
			Тогда
					
				ЯчейкаСЧА = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СЧА");
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СЧА", Формат(РасшифровкаРасчетаПоБазе.СЧАНаКонец, "ЧДЦ=2; ЧРД=,; ЧГ="));
				
				СтраницаРасчета.КлючевыеЯчейки.Вставить("СЧАНаКонец" + СуффиксПоказателей, ЯчейкаСЧА);
					
			КонецЕсли;
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить("СредняяСтоимостьИмущества" + СуффиксПоказателей, РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "Сумма"));	
			
			Если РасчетОтСЧАнаКонецПериода Тогда
				ФормулаСреднейСтоимости = СтрШаблон("=(%1*КоличествоДнейПериодаРасчета - ЕСЛИ(СУММ(%2;%3)=0;0;СУММПРОИЗВ(%2;%3)) + ЕСЛИ(СУММ(%4;%5)=0;0;СУММПРОИЗВ(%4;%5))) / КоличествоДнейПериодаРасчета",
					СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксПоказателей].Address(Ложь, Ложь),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВвода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВвода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВывода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВывода));	
			Иначе
				ФормулаСреднейСтоимости = СтрШаблон("=(ЕСЛИ(СУММ(%1;%2)=0;0;СУММПРОИЗВ(%1;%2)) - ЕСЛИ(СУММ(%3;%4)=0;0;СУММПРОИЗВ(%3;%4))) / КоличествоДнейПериодаРасчета",
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВвода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВвода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВывода, ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВывода));	
			КонецЕсли;
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Сумма", ФормулаСреднейСтоимости);  
			
			ЯчейкаСтавка = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "Ставка");
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Ставка", Формат(РасшифровкаРасчетаПоБазе.Ставка, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			
			ЯчейкаВознаграждение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D");
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#Область Выводим_расчет_на_титульную_страницу
			
			Если ДанныеРасшифровки.ШаблонРасшифровки = "ФизЛицо" Тогда
				
				#Область Физическое_лицо
				
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);	
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ГруппаПоказателей", 
					СтрШаблон("%1. Средняя оценочная стоимость активов/имущества", ДанныеРасшифровки.БазыРасчета.Найти(РасшифровкаРасчетаПоБазе) + 1));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя", ?(РасчетВВалютеУчета, "в рублях РФ", "=ПредставлениеВалютыРасчета"));	
				
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Средняя оценочная стоимость активов/имущества за расчетный период");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СредняяСтоимостьИмущества" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));			
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "Атомфонд" Тогда
				
				#Область Атомфонд
				
				// Вводы / выводы
				
				ШаблонШапки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаВводВыводАктивовАтомфонд");
				ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапки, Ложь, Ложь);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВидСредствДУ #ПД=Родительный", ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);
				
				ШаблонСтрокаРасшифровки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "СтрокаВводВыводАктивовАтомфонд");
				ВсегоВводов				= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(СуффиксПоказателей = "Рынок", "", СуффиксПоказателей)].Количество() - ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, 1, 0);
				ВсегоВыводов			= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"].Количество();
				ВсегоДвижений			= Макс(ВсегоВводов, ВсегоВыводов);
				НомерДвижения			= 1;
				
				Пока НомерДвижения <= ВсегоДвижений Цикл
					
					ТекущаяСтрокаДвиженияАктивов = ОбластьДвиженияАктивов.НачальнаяСтрока + ОбластьДвиженияАктивов.ВысотаСтроки * (НомерДвижения - 1);
					ТекущаяСтрокаВводаАктивов	 = ТекущаяСтрокаДвиженияАктивов + ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, ОбластьДвиженияАктивов.ВысотаСтроки, 0);
					
					Если НомерДвижения <= ВсегоВводов Тогда
						ДатаВвода	= "=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаВводаАктивов, ОбластьДвиженияАктивов.КолонкаДатаВвода).Address(Ложь, Ложь, , Истина);
						СуммаВвода	= "=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаВводаАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВвода).Address(Ложь, Ложь, , Истина);
						ДнейДоВвода	= "=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаВводаАктивов, ОбластьДвиженияАктивов.КолонкаДнейДоВвода).Address(Ложь, Ложь, , Истина);
					Иначе
						ДатаВвода	= "";
						СуммаВвода	= "";
						ДнейДоВвода	= "";
					КонецЕсли;
					
					ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонСтрокаРасшифровки, Ложь, Ложь);	
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаВвода", ДатаВвода);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВвода", СуммаВвода);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДнейДоВвода", ДнейДоВвода);
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДатаВывода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВывода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДнейДоВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДнейДоВывода).Address(Ложь, Ложь, , Истина));
					
					НомерДвижения = НомерДвижения + 1;
					
				КонецЦикла;
				
				ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ПодвалВводВыводАктивовАтомфонд");
				ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
				
				Если ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода Тогда
					Если СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксПоказателей] = Неопределено Тогда
						СтраницаРасчета.КлючевыеЯчейки.Вставить("СЧАНаНачалоГода" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода));
					КонецЕсли;
					АдресЯчейкиСЧАНаНачалоГода = СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина);
				Иначе
					АдресЯчейкиСЧАНаНачалоГода = "";	
				КонецЕсли;
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВвода",
					"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина)
						+ ?(ПустаяСтрока(АдресЯчейкиСЧАНаНачалоГода), "", "-" + АдресЯчейкиСЧАНаНачалоГода));
					
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВывода",
					"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				
				// Расчет
				
				ШаблонОбласти = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ТелоРасчетаПостояннойЧастиАтомфонд");
				ОбластьТело	  = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
				
				Если СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксПоказателей] = Неопределено Тогда
					АдресЯчейкиСЧА = "";
				Иначе	
					АдресЯчейкиСЧА = СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина);
				КонецЕсли;
				
				ЯчейкаВознаграждениеЗаУправление = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьТело, "ВознаграждениеЗаУправление");
				ЯчейкаВознаграждениеУплаченное	 = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьТело, "ВознаграждениеУплаченное");
				
				ТитульнаяСтраница.КлючевыеЯчейки["ВознаграждениеУплаченное"].Добавить(ЯчейкаВознаграждениеУплаченное); // Заполним в конце расчета
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВидСредствДУ #ПД=Родительный",	ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);	
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧАНаНачалоГода",				?(ПустаяСтрока(АдресЯчейкиСЧАНаНачалоГода), "", "=" + АдресЯчейкиСЧАНаНачалоГода));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧА",							?(ПустаяСтрока(АдресЯчейкиСЧА), "", "=" + АдресЯчейкиСЧА));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СредняяСтоимостьИмущества",		"=" + СтраницаРасчета.КлючевыеЯчейки["СредняяСтоимостьИмущества" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "КоличествоДнейВГоду",			ДанныеРасшифровки.ДнейВГоду);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "Ставка",							"=" + ЯчейкаСтавка.Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеЗаУправление",		"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеКОплате",			"=" + ЯчейкаВознаграждениеЗаУправление.Address(Ложь, Ложь) + "-" + ЯчейкаВознаграждениеУплаченное.Address(Ложь, Ложь));
				
				#КонецОбласти
				
			ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "2023"
				Или ДанныеРасшифровки.ШаблонРасшифровки = "2024"
			Тогда
				#Область Стандартный_2023
				
				ШаблонОбласти = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(ШаблонТитульнойСтраницы, "ШапкаСтавкаЗаУправление<Год>", ДанныеРасшифровки.ШаблонРасшифровки);
				ВысотаОбласти = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВысотаОбласти(ШаблонОбласти);
				
				ОбластьПриемник = ТитульнаяСтраница.Страница.Cells(КонечнаяСтрокаШапкиТитульнойСтраницы + 1, 1);
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(ТитульнаяСтраница, ШаблонОбласти, ОбластьПриемник, , , ВысотаОбласти);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ОписаниеСтавкиЗаУправление", "% от средней стоимости активов", Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СтавкаЗаУправление", "=" + ЯчейкаСтавка.Address(Ложь, Ложь, , Истина));
				
				КонечнаяСтрокаШапкиТитульнойСтраницы = КонечнаяСтрокаШапкиТитульнойСтраницы + ВысотаОбласти;
				
				// Движения активов
				ВывестиДвиженияАктивовНаТитульнуюСтраницу(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, ОбластьДвиженияАктивов);
				
				// Средняя стоимость активов
				ТитульнаяСтраница.ВсегоСтрок = ТитульнаяСтраница.ВсегоСтрок + 1;
				
				Если ШаблонПоказатель <> Неопределено Тогда
					ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель", "Средняя стоимость активов, рублей");
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",
						"=" + СтраницаРасчета.КлючевыеЯчейки["СредняяСтоимостьИмущества" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				КонецЕсли;
				
				#КонецОбласти
			КонецЕсли;
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего (плата за управление)",
				ЯчейкаВознаграждение,
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Истина
			);
			
			#КонецОбласти
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ОтИнвестиционногоДоходаИБазовогоДоходаПоЗначениюКБД")
			Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ОтИнвестиционногоДоходаИБазовогоДоходаПоЗначениюКБДПоБалансу")
		Тогда
			#Область От_инвестиционного_дохода_и_базового_дохода_по_значению_КБД
			
			РасчетПоБалансовойСтоимости = (РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ОтИнвестиционногоДоходаИБазовогоДоходаПоЗначениюКБДПоБалансу"));
			СуффиксБазовойДоходности	= ?(РасшифровкаРасчетаПоБазе.СреднееЗначениеКБД, "ПоСреднемуЗначениюКБД", "ПоЗначениюКБД");
			СуффиксСтоимостей			= ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок"); 
			СуффиксПоказателей			= СуффиксБазовойДоходности + СуффиксСтоимостей;
			
			// Ввод-вывод активов с расчетом базового дохода по значению КБД
			
			ОбластьДвиженияАктивов = ВывестиДвиженияАктивовСБазовойДоходностьюExcel(
				ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксБазовойДоходности, СуффиксСтоимостей);
			
			// Расчет инвестиционного дохода
				
			ОписаниеОбластиИнвестиционногоДохода = ВывестиИнвестиционныйДоходExcel(
				ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, РасчетПоБалансовойСтоимости,
				РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости, ОбластьДвиженияАктивов);
			
			// Расчет основной части вознаграждения
			
			ШаблонРасчетОтИДиБД = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияОтИДиБДОсновная");
			ОбластьРасчетОтИДиБД = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетОтИДиБД);
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"БазовыйДоход" + СуффиксПоказателей,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетОтИДиБД, "БазовыйДоход"));
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ВознаграждениеОтИДиБД" + СуффиксПоказателей,
				СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетОтИДиБД,
				"БазовыйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоходВводов" + СуффиксПоказателей].Address(Ложь, Ложь)
					+ "-" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоходВыводов" + СуффиксПоказателей].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетОтИДиБД,
				"ИнвестиционныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетОтИДиБД,
				"СтавкаМД",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаМД, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			// Расчет дополнительной части вознаграждения
			
			БазовыйДоход		= ?(РасшифровкаРасчетаПоБазе.БазовыйДоход = NULL, 0, РасшифровкаРасчетаПоБазе.БазовыйДоход);
			ИнвестиционныйДоход	= ?(РасшифровкаРасчетаПоБазе.ИнвестиционныйДоходСкорректированный = NULL, 0, РасшифровкаРасчетаПоБазе.ИнвестиционныйДоходСкорректированный);
			
			ШаблонРасчетОтИДиБДДоп = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияОтИДиБДДополнительная");
			ОбластьРасчетОтИДиБДДоп = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетОтИДиБДДоп);
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ВознаграждениеОтИДиБДДополнительное" + СуффиксПоказателей,
				СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"));
			
			ЯчейкаСтавкаПревышение			 = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетОтИДиБДДоп, "СтавкаПревышение");
			ЯчейкаВознаграждениеЗаПревышение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок - 1, "D");
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетОтИДиБДДоп,
				"БазовыйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоходВводов" + СуффиксПоказателей].Address(Ложь, Ложь)
					+ "-" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоходВыводов" + СуффиксПоказателей].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетОтИДиБДДоп,
				"ИнвестиционныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетОтИДиБДДоп,
				"СтавкаБД",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаБД, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетОтИДиБДДоп,
				"СтавкаПревышение",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаПревышение, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			
			// Выводим расчет дохода на титульную страницу
			
			Если ШаблонПоказатель <> Неопределено Тогда
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(
					ТитульнаяСтраница,
					ШаблонПоказатель.Область,
					Ложь,
					Ложь,
					ШаблонПоказатель.Высота);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки,
					"Показатель",
					"Расчетный доход по ставке базовой доходности");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки,
					"ЗначениеПоказателя",
					"=" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоход" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
			КонецЕсли;
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#Область Выводим_расчет_на_титульную_страницу
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего (основная часть)",
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеОтИДиБД" + СуффиксПоказателей],
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Ложь);
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего (дополнительная часть)",
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеОтИДиБДДополнительное" + СуффиксПоказателей],
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Ложь);
			
			Если ДанныеРасшифровки.ШаблонРасшифровки = "Атомфонд" Тогда
				
				#Область Атомфонд
				
				Если ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода Тогда
					Если СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСтоимостей] = Неопределено Тогда
						СтраницаРасчета.КлючевыеЯчейки.Вставить(
							"СЧАНаНачалоГода" + СуффиксСтоимостей,
							СтраницаРасчета.Страница.Cells(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода));
					КонецЕсли;
					АдресЯчейкиСЧАНаНачалоГода				= СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСтоимостей].Address(Ложь, Ложь, , Истина);
					АдресЯчейкиБазоваяСтавкаНаНачалоПериода	= СтраницаРасчета.Страница.Cells(
						ОбластьДвиженияАктивов.НачальнаяСтрока,
						ОбластьДвиженияАктивов.КолонкаБазоваяСтавкаВвода).Address(Ложь, Ложь, , Истина);
					АдресЯчейкиБазовыйДоходСЧАНаНачалоГода	= СтраницаРасчета.Страница.Cells(
						ОбластьДвиженияАктивов.НачальнаяСтрока,
						ОбластьДвиженияАктивов.КолонкаБазовыйДоходВвода).Address(Ложь, Ложь, , Истина);
				Иначе
					АдресЯчейкиСЧАНаНачалоГода				= "";
					АдресЯчейкиБазоваяСтавкаНаНачалоПериода	= "";
					АдресЯчейкиБазовыйДоходСЧАНаНачалоГода	= "";
				КонецЕсли;
				
				// Вводы
				
				ШаблонШапки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаВводАктивовАтомфонд");
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапки, Ложь, Ложь);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ВидСредствДУ #ПД=Родительный", ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);
				
				ШаблонСтрокаРасшифровки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "СтрокаВводАктивовАтомфонд");
				ВсегоВводов = РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто"
					+ ?(СуффиксСтоимостей = "Рынок", "", СуффиксСтоимостей)].Количество();
				
				Для НомерДвижения = ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, 2, 1) По ВсегоВводов Цикл
					ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонСтрокаРасшифровки, Ложь, Ложь);
					ТекущаяСтрокаДвиженияАктивов = ОбластьДвиженияАктивов.НачальнаяСтрока + ОбластьДвиженияАктивов.ВысотаСтроки * (НомерДвижения - 1);
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ДатаВвода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДатаВвода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "СуммаВвода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВвода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ДнейДоВвода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДнейДоВвода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "БазоваяСтавкаВвода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаБазоваяСтавкаВвода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "БазовыйДоходВвода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаБазовыйДоходВвода).Address(Ложь, Ложь, , Истина)
							+ "*" + Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="));
				КонецЦикла;
				
				ШаблонОбласти = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ПодвалВводАктивовАтомфонд");
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВвода",
					"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксСтоимостей].Address(Ложь, Ложь, , Истина)
						+ ?(ПустаяСтрока(АдресЯчейкиСЧАНаНачалоГода), "", "-" + АдресЯчейкиСЧАНаНачалоГода));
					
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "БазовыйДоходВвода",
					"=(" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоходВводов" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина)
						+ ?(ПустаяСтрока(АдресЯчейкиСЧАНаНачалоГода), "", "-" + АдресЯчейкиБазовыйДоходСЧАНаНачалоГода)
						+ ")*" + Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="));
				
				// Выводы
				
				ШаблонШапки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаВыводАктивовАтомфонд");
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапки, Ложь, Ложь);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ВидСредствДУ #ПД=Родительный", ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);
				
				ШаблонСтрокаРасшифровки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "СтрокаВыводАктивовАтомфонд");
				ВсегоВыводов = РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"].Количество();
				
				Для НомерДвижения = 1 По ВсегоВыводов Цикл
					ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонСтрокаРасшифровки, Ложь, Ложь);
					ТекущаяСтрокаДвиженияАктивов = ОбластьДвиженияАктивов.НачальнаяСтрока + ОбластьДвиженияАктивов.ВысотаСтроки * (НомерДвижения - 1);
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ДатаВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДатаВывода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "СуммаВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВывода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ДнейДоВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДнейДоВывода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "БазоваяСтавкаВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаБазоваяСтавкаВывода).Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "БазовыйДоходВывода",
						"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаБазовыйДоходВывода).Address(Ложь, Ложь, , Истина)
							+ "*" + Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="));
				КонецЦикла;
				
				ШаблонОбласти = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ПодвалВыводАктивовАтомфонд");
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВывода",
					"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксСтоимостей].Address(Ложь, Ложь, , Истина));
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "БазовыйДоходВывода",
					"=" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоходВыводов" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина)
						+ "*" + Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="));
				
				// Расчет
				
				ШаблонОбласти = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ТелоРасчетаПеременнойЧастиАтомфонд");
				ОбластьТело = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
					
				АдресЯчейкиСЧАЗаВычетомВознагражденияЗаУправление = СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСтоимостей].Address(Ложь, Ложь, , Истина);
				
				ФормулаСуммыВознагражденийЗаУправление = ФормулаСуммыРассчитанныхВознагражденийЗаУправление(Расшифровка, ДанныеРасшифровки, Истина, Истина);
				
				Если Не ПустаяСтрока(ФормулаСуммыВознагражденийЗаУправление) Тогда
					АдресЯчейкиСЧАЗаВычетомВознагражденияЗаУправление = АдресЯчейкиСЧАЗаВычетомВознагражденияЗаУправление + "-(" + ФормулаСуммыВознагражденийЗаУправление + ")";
				КонецЕсли;
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "ВидСредствДУ #ПД=Родительный",
					ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "СЧАНаНачалоГода",
					?(ПустаяСтрока(АдресЯчейкиСЧАНаНачалоГода), "", "=" + АдресЯчейкиСЧАНаНачалоГода));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "БазоваяСтавкаНаНачалоПериода",
					?(ПустаяСтрока(АдресЯчейкиБазоваяСтавкаНаНачалоПериода), "", "=" + АдресЯчейкиБазоваяСтавкаНаНачалоПериода));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "СЧАЗаВычетомВознагражденияЗаУправление",
					?(ПустаяСтрока(АдресЯчейкиСЧАЗаВычетомВознагражденияЗаУправление), "", "=" + АдресЯчейкиСЧАЗаВычетомВознагражденияЗаУправление));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "ИнвестиционныйДоход",
					"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "БазовыйДоход",
					"=" + СтраницаРасчета.КлючевыеЯчейки["БазовыйДоход" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "СтавкаПревышение",
					"=" + ЯчейкаСтавкаПревышение.Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьТело, "ВознаграждениеЗаУспех",
					"=" + ЯчейкаВознаграждениеЗаПревышение.Address(Ложь, Ложь, , Истина));
				
				#КонецОбласти
				
			КонецЕсли;
			
			#КонецОбласти
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета
			= ПредопределенноеЗначение("Справочник.БазыРасчета.ОтИнвестиционногоДоходаИСреднедневнойБалансовойСтоимостиИмуществаНаходящегосяВРазмещении")
		Тогда
			#Область От_инвестиционного_дохода_и_среднедневной_стоимости_имущества
			
			РасчетПоБалансовойСтоимости = Истина;
			СуффиксПоказателей			= ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок");
			
			// Ввод-вывод активов
			
			ОбластьДвиженияАктивов = ВывестиДвиженияАктивовExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей, СуффиксПоказателей);
			
			// Стоимость активов, находящихся в управлении, на каждый день
			
			СтраницаСтоимостиАктивовПоДням = Расшифровка.Результат.ПараметрыЛистов["Стоимость активов по дням"];
			
			Если СтраницаСтоимостиАктивовПоДням = Неопределено Тогда
				
				#Область Страница_стоимости_активов_по_дням
				
				СтраницаСтоимостиАктивовПоДням = ДобавитьОписаниеСтраницыExcel("Стоимость активов по дням", Расшифровка.Результат);
				
				ШаблонСтраницыСтоимостиАктивовПоДням = Расшифровка.Шаблон.ПараметрыЛистов["Стоимость активов по дням"];
				Если ШаблонСтраницыСтоимостиАктивовПоДням = Неопределено Тогда
					ШаблонСтраницыСтоимостиАктивовПоДням = ДобавитьОписаниеСтраницыExcel("Стоимость активов по дням", Расшифровка.Шаблон, Ложь);
				КонецЕсли;
				
				ШаблонШапкиСтоимостьАктивовПоДням	= ШаблонСтраницыСтоимостиАктивовПоДням.Страница.Range("ШапкаСтоимостьАктивовПоДням");
				ШаблонСтрокиСтоимостьАктивовПоДням	= ШаблонСтраницыСтоимостиАктивовПоДням.Страница.Range("СтрокаСтоимостьАктивовПоДням");
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаСтоимостиАктивовПоДням, ШаблонШапкиСтоимостьАктивовПоДням, Истина, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(ExcelApp);
				
				БудетСтрок			= Цел((ДанныеРасшифровки.КонецРасчетногоПериода - ДанныеРасшифровки.НачалоРасчетногоПериода) / 86400) + 1;
				БудетКолонок		= 1;
				МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
				
				Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
					МассивДанных[0][НомерСтроки] = ДанныеРасшифровки.НачалоРасчетногоПериода + 86400 * НомерСтроки;
				КонецЦикла;
				
				// Подготоваливаем строки и выводим данные
				
				ПараметрыЛистаСтоимостиАктивовПоДням	= Расшифровка.Результат.ПараметрыЛистов["Стоимость активов по дням"];
				НачальнаяСтрокаЗначений					= ПараметрыЛистаСтоимостиАктивовПоДням.ВсегоСтрок + 1;
				ВысотаСтрокиЗначений					= ШаблонСтрокиСтоимостьАктивовПоДням.Rows.Count;
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(
					СтраницаСтоимостиАктивовПоДням, ШаблонСтрокиСтоимостьАктивовПоДням, Ложь, Ложь, ВысотаСтрокиЗначений);
				
				Если БудетСтрок > 1 Тогда
					ОбластьЭталон = СтраницаСтоимостиАктивовПоДням.Страница.Range(
						Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ="));
					Для н = 2 По БудетСтрок Цикл
						РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(
							ПараметрыЛистаСтоимостиАктивовПоДням, ОбластьЭталон, , , , ВысотаСтрокиЗначений, Ложь);
					КонецЦикла;
				КонецЕсли;
				
				КонечнаяСтрокаЗначений = ПараметрыЛистаСтоимостиАктивовПоДням.ВсегоСтрок;
				
				СтраницаСтоимостиАктивовПоДням.Страница.Range(
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
						НачальнаяСтрокаЗначений, "B", КонечнаяСтрокаЗначений, "B")).Value2 = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
				
				ОбластьЭталон = СтраницаСтоимостиАктивовПоДням.Страница.Cells(НачальнаяСтрокаЗначений, "C");
				ОбластьЭталон.FormulaLocal =
					СтрШаблон("=СУММЕСЛИ(Расчет!%2:%3; ""<="" & %1; Расчет!%4:%5) - СУММЕСЛИ(Расчет!%6:%7; ""<="" & %1; Расчет!%8:%9)",
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаЗначений, "B"),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДатаВвода, Истина, Истина),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДатаВвода, Истина, Истина),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода, Истина, Истина),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода, Истина, Истина),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДатаВывода, Истина, Истина),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДатаВывода, Истина, Истина),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода, Истина, Истина),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода, Истина, Истина));
					
				Если НачальнаяСтрокаЗначений <> КонечнаяСтрокаЗначений Тогда
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
						СтраницаСтоимостиАктивовПоДням.Страница.Range(
							РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "C", КонечнаяСтрокаЗначений, "C")),
						ОбластьЭталон,
						"ТолькоЗначения");
				КонецЕсли;
				
				ПараметрыЛистаСтоимостиАктивовПоДням.КлючевыеЯчейки.Вставить(
					"СтоимостьАктивовПоДням" + СуффиксПоказателей,
					СтраницаСтоимостиАктивовПоДням.Страница.Range(
						РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "C", КонечнаяСтрокаЗначений, "C")));
				
				#КонецОбласти
				
			КонецЕсли;
			
			// Расчет инвестиционного дохода
			
			ОписаниеОбластиИнвестиционногоДохода = ВывестиИнвестиционныйДоходExcel(
				ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости);
			
			// Расчет вознаграждения
			
			ШаблонРасчетОтИДиСреднедневнойСтоимости = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияПоИДиСреднедневнойСтоимости");
			ОбластьРасчетВознаграждения = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетОтИДиСреднедневнойСтоимости);
			
			ЗаголовокВознагражденияЗаУправление	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоТексту(
				ОбластьРасчетВознаграждения, "Основная часть вознаграждения");
			ЗаголовокВознагражденияЗаУспех		= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоТексту(
				ОбластьРасчетВознаграждения, "Дополнительная часть вознаграждения");
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ВознаграждениеОтИДиСреднедневнойСтоимостиАктивовЗаУправление" + СуффиксПоказателей,
				СтраницаРасчета.Страница.Cells(ЗаголовокВознагражденияЗаУправление.Row, "D"));
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ВознаграждениеОтИДиСреднедневнойСтоимостиАктивовЗаУспех" + СуффиксПоказателей,
				СтраницаРасчета.Страница.Cells(ЗаголовокВознагражденияЗаУспех.Row, "D"));
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ВознаграждениеОтИДиСреднедневнойСтоимостиАктивов" + СуффиксПоказателей,
				СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"ИнвестиционныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"ДнейВУправлении",
				"=СЧЕТ(" + ПараметрыЛистаСтоимостиАктивовПоДням.КлючевыеЯчейки["СтоимостьАктивовПоДням" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина) + ")");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"ДнейВГоду",
				ДеньГода(КонецГода(ДанныеРасшифровки.НачалоРасчетногоПериода)));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"СреднедневнаяСтоимостьАктивов",
				"=СРЗНАЧ(" + ПараметрыЛистаСтоимостиАктивовПоДням.КлючевыеЯчейки["СтоимостьАктивовПоДням" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина) + ")");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"СтавкаИД",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаИД, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"НижнийПроцентОтСредней",
				Формат(РасшифровкаРасчетаПоБазе.НижнийПроцентОтСредней, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"ВерхнийПроцентОтСредней",
				Формат(РасшифровкаРасчетаПоБазе.ВерхнийПроцентОтСредней, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"СтавкаРазницаИДиСНП",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаРазницаИДиСНП, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"СтавкаРазницаСВПиСНП",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаРазницаСВПиСНП, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"СтавкаРазницаИДиСВП",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаРазницаИДиСВП, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения,
				"ВознаграждениеУплаченное",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь));
			
			// Добавляем показатели на титульную страницу
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего (плата за управление)",
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеОтИДиСреднедневнойСтоимостиАктивовЗаУправление" + СуффиксПоказателей],
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Истина, Ложь, Истина);
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего (плата за успех)",
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеОтИДиСреднедневнойСтоимостиАктивовЗаУспех" + СуффиксПоказателей],
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Ложь, Ложь, Истина);
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего по ИД и среднедневной стоимости активов",
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеОтИДиСреднедневнойСтоимостиАктивов" + СуффиксПоказателей],
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Неопределено, Истина, Ложь);
			
			// Добавляем отступ для следующих расчетов
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадМинимальнымДоходом")
			Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадМинимальнымДоходомПоБалансу")
			Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадМинимальнымДоходом_СЧАНаКонецПоБалансу")
		Тогда
			#Область Превышение_над_минимальным_доходом
			
			РасчетПоБалансовойСтоимости = (РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадМинимальнымДоходомПоБалансу"));
			
			СЧАНаКонецПоБалансу = РасчетПоБалансовойСтоимости
				Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадМинимальнымДоходом_СЧАНаКонецПоБалансу");
			
			СуффиксПоказателей = ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок");
			
			// Ввод-вывод активов
			ОбластьДвиженияАктивов = ВывестиДвиженияАктивовСМинимальнымИГарантированнымДоходомExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей);
				
			// Расчёт инвестиционного дохода
			ОписаниеОбластиИнвестиционногоДохода = ВывестиИнвестиционныйДоходExcel(
				ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, РасчетПоБалансовойСтоимости,
				СЧАНаКонецПоБалансу, РасчетПоБалансовойСтоимости, ОбластьДвиженияАктивов);
			
			// Расчет вознаграждения
			ШаблонРасчетВознаграждения = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияПревышениеНадМинимальнымДоходом");
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетВознаграждения, Ложь, Ложь);
			
			// Запоминаем ключевые ячейки
			
			ЯчейкаСтавкаГД = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СтавкаГД");
			ЯчейкаСтавкаГД.Name = "СтавкаГД";
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить("СтавкаГД", ЯчейкаСтавкаГД);
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ГарантированныйДоход" + СуффиксПоказателей,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ГарантированныйДоход"));
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ПревышениеИДНадГД" + СуффиксПоказателей,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ПревышениеИДНадГД"));
			
			ЯчейкаСтавкаМД = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СтавкаМД");
			ЯчейкаСтавкаМД.Name = "СтавкаМД";
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить("СтавкаМД", ЯчейкаСтавкаМД);
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"МинимальныйДоход" + СуффиксПоказателей,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "МинимальныйДоход"));
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ПревышениеИДНадМД" + СуффиксПоказателей,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ПревышениеИДНадМД"));
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"СредняяБазоваяСтоимостьАктивов" + СуффиксПоказателей,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СредняяБазоваяСтоимостьАктивов"));
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"СтавкаПревышение",
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СтавкаПревышение"));
			
			// Подставляем значения
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ИнвестиционныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СредняяБазоваяСтоимостьАктивов",
				СтрШаблон("=(ЕСЛИ(СУММ(%1;%2)=0;0;СУММПРОИЗВ(%1;%2))-ЕСЛИ(СУММ(%3;%4)=0;0;СУММПРОИЗВ(%3;%4)))/%5",
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода,
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВвода,
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВвода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода,
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВывода),
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
						ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВывода,
						ОбластьДвиженияАктивов.КонечнаяСтрока, ОбластьДвиженияАктивов.КолонкаДнейДоВывода),
					Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ=")));
					
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "СтавкаГД",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаГД, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ГарантированныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоходВводов" + СуффиксПоказателей].Address(Ложь, Ложь)
					+ "-" + СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоходВыводов" + СуффиксПоказателей].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ПревышениеИДНадГД",
				СтрШаблон(
					"=ЕСЛИ(%1>%2; %1-%2; 0",
					СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь),
					СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоход" + СуффиксПоказателей].Address(Ложь, Ложь)));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "СтавкаМД",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаМД, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "МинимальныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["МинимальныйДоходВводов" + СуффиксПоказателей].Address(Ложь, Ложь)
					+ "-" + СтраницаРасчета.КлючевыеЯчейки["МинимальныйДоходВыводов" + СуффиксПоказателей].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ПревышениеИДНадМД",
				СтрШаблон(
					"=ЕСЛИ(%1>%2; %1-%2; 0",
					СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь),
					СтраницаРасчета.КлючевыеЯчейки["МинимальныйДоход" + СуффиксПоказателей].Address(Ложь, Ложь)));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "СтавкаПревышение",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаПревышение, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ВознаграждениеУплаченное",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь));
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить("ПлатаЗаУспех", СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок - 1, "D"));
			
			ЯчейкаВознаграждение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D");
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#Область Выводим_расчет_на_титульную_страницу
			
			Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз") Тогда
				
				#Область Сургутнефтегаз
				
				ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СредняяБазоваяСтоимостьАктивов",			"=" + СтраницаРасчета.КлючевыеЯчейки["СредняяБазоваяСтоимостьАктивов" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",					"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаГД",								"=" + СтраницаРасчета.КлючевыеЯчейки["СтавкаГД"].Address(Ложь, Ложь, , Истина) + " * 100");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ГарантированныйДоход",					"=" + СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоход" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаМД",								"=" + СтраницаРасчета.КлючевыеЯчейки["СтавкаМД"].Address(Ложь, Ложь, , Истина) + " * 100");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "МинимальныйДоход",						"=" + СтраницаРасчета.КлючевыеЯчейки["МинимальныйДоход" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ПревышениеИДНадГД",						"=" + СтраницаРасчета.КлючевыеЯчейки["ПревышениеИДНадГД" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ПревышениеИДНадМД",						"=" + СтраницаРасчета.КлючевыеЯчейки["ПревышениеИДНадМД" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаПревышение",						"=" + СтраницаРасчета.КлючевыеЯчейки["СтавкаПревышение"].Address(Ложь, Ложь, , Истина) + " * 100");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеОтПревышения",				"=" + ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ПревышениеИДНаГДМинусВознаграждение",
					СтрШаблон("=%1-%2-%3",
						СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь, , Истина),
						СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоход" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина),
						ЯчейкаВознаграждение.Address(Ложь, Ложь, , Истина)));
				
				#КонецОбласти
				
			ИначеЕсли ШаблонПоказатель <> Неопределено Тогда
				
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель.Область, Ложь, Ложь, ШаблонПоказатель.Высота);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Минимальный доход");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["МинимальныйДоход" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				
			КонецЕсли;
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего от превышения ИД над минимальным доходом",	
				ЯчейкаВознаграждение,
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Ложь
			);
			
			#КонецОбласти
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадГарантированнымДоходом")
			Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадГарантированнымДоходомПоБалансу")
		Тогда
			#Область Превышение_над_гарантированным_доходом
			
			РасчетПоБалансовойСтоимости = (РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.ПревышениеНадГарантированнымДоходомПоБалансу"));
			СуффиксПоказателей			= ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок");
			
			// Ввод-вывод активов
			
			Если РасчетВВалютеУчета Тогда
				ОбластьДвиженияАктивов = ВывестиДвиженияАктивовСГарантированнымДоходомExcel(
					ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей);
			Иначе
				ОбластьДвиженияАктивов = ВывестиДвиженияАктивовСГарантированнымДоходомСВалютойРасчетаExcel(
					ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей);
			КонецЕсли;
			
			// Расчет инвестиционного дохода
			ОписаниеОбластиИнвестиционногоДохода = ВывестиИнвестиционныйДоходExcel(
				ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, РасчетПоБалансовойСтоимости,
				РасчетПоБалансовойСтоимости, РасчетПоБалансовойСтоимости, ОбластьДвиженияАктивов);
			
			// Расчет вознаграждения
			ШаблонРасчетВознаграждения = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияПревышениеНадГарантированнымДоходом");
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетВознаграждения, Ложь, Ложь);
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"ГарантированныйДоход" + СуффиксПоказателей,
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ГарантированныйДоход"));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ИнвестиционныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + ОписаниеОбластиИнвестиционногоДохода.Суффикс].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ГарантированныйДоход",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоходВводов" + СуффиксПоказателей].Address(Ложь, Ложь)
					+ "-" + СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоходВыводов" + СуффиксПоказателей].Address(Ложь, Ложь));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "СтавкаПревышение",
				Формат(РасшифровкаРасчетаПоБазе.СтавкаПревышение, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ВознаграждениеУплаченное",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь));
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить("ПлатаЗаУспех", СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок - 1, "D"));
			
			ЯчейкаВознаграждение = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D");
			
			// Выводим расчет дохода на титульную страницу
			Если ШаблонПоказатель <> Неопределено Тогда
				
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель.Область, Ложь, Ложь, ШаблонПоказатель.Высота);	
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Гарантированный доход");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["ГарантированныйДоход" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
				
			КонецЕсли;
			
			// Добавляем показатели на титульную страницу
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего от превышения ИД над гарантированным доходом",
				ЯчейкаВознаграждение,
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Ложь
			);
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#КонецОбласти
		ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяСЧА")
			Или РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.УдельнаяСуммаСЧА")
		Тогда
			#Область Средняя_СЧА
			
			РасчетПоБалансовойСтоимости = Ложь;
			СуффиксПоказателей			= ?(РасчетПоБалансовойСтоимости, "Баланс", "Рынок");
			
			// Расчет средней СЧА
			
			СтраницаСреднейСЧА = Расшифровка.Результат.ПараметрыЛистов["Средняя СЧА"];
			
			Если СтраницаСреднейСЧА = Неопределено Тогда
				
				#Область Страница_расчета_средней_СЧА
				
				СтраницаСреднейСЧА = ДобавитьОписаниеСтраницыExcel("Средняя СЧА", Расшифровка.Результат);
				
				ШаблонСтраницыСреднейСЧА = Расшифровка.Шаблон.ПараметрыЛистов["Средняя СЧА"];
				Если ШаблонСтраницыСреднейСЧА = Неопределено Тогда
					ШаблонСтраницыСреднейСЧА = ДобавитьОписаниеСтраницыExcel("Средняя СЧА", Расшифровка.Шаблон, Ложь);
				КонецЕсли;
				
				Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяСЧА") Тогда
					ИмяШаблонаШапки		= "ШапкаСредняяСЧА";
					ИмяШаблонаСтроки	= "СтрокаСредняяСЧА";
					ИмяШаблонаПодвала	= "ПодвалСредняяСЧА";
				ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.УдельнаяСуммаСЧА") Тогда
					ИмяШаблонаШапки		= "ШапкаУдельнаяСуммаСЧА";
					ИмяШаблонаСтроки	= "СтрокаУдельнаяСуммаСЧА";
					ИмяШаблонаПодвала	= "ПодвалУдельнаяСуммаСЧА";
				КонецЕсли;
				
				ШаблонШапкиСредняяСЧА	= ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыСреднейСЧА, ИмяШаблонаШапки + ДанныеРасшифровки.ШаблонРасшифровки);
				ШаблонСтрокиСредняяСЧА	= ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыСреднейСЧА, ИмяШаблонаСтроки + ДанныеРасшифровки.ШаблонРасшифровки);
				ШаблонПодвалаСредняяСЧА	= ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыСреднейСЧА, ИмяШаблонаПодвала + ДанныеРасшифровки.ШаблонРасшифровки);

				ШаблонШапкиСредняяСЧА	= ?(ШаблонШапкиСредняяСЧА = Неопределено, ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыСреднейСЧА, ИмяШаблонаШапки), ШаблонШапкиСредняяСЧА);
				ШаблонСтрокиСредняяСЧА	= ?(ШаблонСтрокиСредняяСЧА = Неопределено, ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыСреднейСЧА, ИмяШаблонаСтроки), ШаблонСтрокиСредняяСЧА);
				ШаблонПодвалаСредняяСЧА	= ?(ШаблонПодвалаСредняяСЧА = Неопределено, ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыСреднейСЧА, ИмяШаблонаПодвала), ШаблонПодвалаСредняяСЧА);
				
				// Шапка
				
				ОбластьШапка = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаСреднейСЧА, ШаблонШапкиСредняяСЧА, Истина, Истина);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(ExcelApp);	
				
				Если ДанныеРасшифровки.ШаблонРасшифровки = "Газфонд" Тогда
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьШапка, "ДоговорДУ",		ОбщиеПараметрыЗаполнения.ДоговорДУ, Истина);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьШапка, "ПериодРасчета",
						"с " + ОбщиеПараметрыЗаполнения.НачалоБазовогоПериодаСтрокой + " по " + ОбщиеПараметрыЗаполнения.КонецБазовогоПериодаСтрокой, Истина);
				КонецЕсли;
				
				// Строки
				
				ЗначенияСЧА			= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_СЧАЗаБазовыйПериодДляСреднейСЧА"];
				
				БудетСтрок			= ЗначенияСЧА.Количество();
				БудетКолонок		= 3;
				МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
				
				Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
					МассивДанных[0][НомерСтроки] = НомерСтроки + 1;
					МассивДанных[1][НомерСтроки] = ЗначенияСЧА[НомерСтроки]["Дата"];
					МассивДанных[2][НомерСтроки] = ?(ЗначенияСЧА[НомерСтроки]["Сумма"] = NULL, "=НД()", ЗначенияСЧА[НомерСтроки]["Сумма"]);
				КонецЦикла;
				
				// Подготоваливаем строки и выводим данные
				
				НачальнаяСтрокаЗначений	= СтраницаСреднейСЧА.ВсегоСтрок + 1;
				ВысотаСтрокиЗначений	= ШаблонСтрокиСредняяСЧА.Rows.Count; 
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаСреднейСЧА, ШаблонСтрокиСредняяСЧА, Ложь, Ложь, ВысотаСтрокиЗначений);
				
				Если БудетСтрок > 1 Тогда
					ОбластьЭталон = СтраницаСреднейСЧА.Страница.Range(Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ="));
					Для н = 2 По БудетСтрок Цикл
						РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаСреднейСЧА, ОбластьЭталон, , , , ВысотаСтрокиЗначений, Ложь);
					КонецЦикла;
				КонецЕсли;
				
				КонечнаяСтрокаЗначений = СтраницаСреднейСЧА.ВсегоСтрок;
				
				СтраницаСреднейСЧА.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "B", КонечнаяСтрокаЗначений, "D")).FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
				
				Если НачальнаяСтрокаЗначений <> КонечнаяСтрокаЗначений Тогда
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
						СтраницаСреднейСЧА.Страница.Range(Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(КонечнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=")),
						СтраницаСреднейСЧА.Страница.Range(Формат(КонечнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(КонечнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=")),
						"ТолькоФорматы");
				КонецЕсли;
				
				// Подвал
				
				ОбластьПодвал = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаСреднейСЧА, ШаблонПодвалаСредняяСЧА);
				
				ЯчейкаСредняяСЧА = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьПодвал, "СредняяСЧА");
				
				Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяСЧА") Тогда
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьПодвал, "СредняяСЧА", СтрШаблон("=ОКРУГЛ(СРЗНАЧ(%1); 2)", РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "D", КонечнаяСтрокаЗначений, "D")));
					
				ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.УдельнаяСуммаСЧА") Тогда
					
					ЯчейкаСуммарноеСЧА			= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьПодвал, "СуммарноеСЧА");
					ЯчейкаКоличествоДнейВГоду	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьПодвал, "КоличествоДнейВГоду");
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьПодвал, "СуммарноеСЧА",			СтрШаблон("=СУММ(%1)", РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "D", КонечнаяСтрокаЗначений, "D")));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьПодвал, "КоличествоДнейВГоду",	Формат(РасшифровкаРасчетаПоБазе.ДнейВГоду, "ЧН=0; ЧГ="));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьПодвал, "СредняяСЧА",			СтрШаблон("=ОКРУГЛ(%1 / %2; 2)", ЯчейкаСуммарноеСЧА.Address(Ложь, Ложь), ЯчейкаКоличествоДнейВГоду.Address(Ложь, Ложь)));
					
				КонецЕсли;
				
				Если ДанныеРасшифровки.ШаблонРасшифровки = "Газфонд" Тогда
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьПодвал, "ПодписантОтУК", Строка(ЭтаФорма.Подписант));
				КонецЕсли;
				
				СтраницаСреднейСЧА.КлючевыеЯчейки.Вставить("СЧАЗаПериод" + СуффиксПоказателей, СтраницаСреднейСЧА.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "D", КонечнаяСтрокаЗначений, "D")));
				СтраницаСреднейСЧА.КлючевыеЯчейки.Вставить("СредняяСЧА" + СуффиксПоказателей, ЯчейкаСредняяСЧА);
				
				#КонецОбласти	
				
			КонецЕсли;
			
			// Расчет вознаграждения
			
			Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяСЧА") Тогда
				ШаблонРасчетВознаграждения = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияСредняяСЧА");
			ИначеЕсли РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.УдельнаяСуммаСЧА") Тогда
				ШаблонРасчетВознаграждения = ШаблонСтраницыРасчета.Страница.Range("РасчетВознагражденияУдельнаяСуммаСЧА");
			КонецЕсли;
			ОбластьРасчетВознаграждения = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетВознаграждения);
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить("ВознаграждениеОтСреднейСЧА" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"));
			
			ЯчейкаСредняяСЧА	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетВознаграждения, "СредняяСЧА");
			ЯчейкаСтавка		= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетВознаграждения, "Ставка");
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения, "СредняяСЧА",
				"=" + СтраницаСреднейСЧА.КлючевыеЯчейки["СредняяСЧА" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетВознаграждения, "Ставка",
				Формат(РасшифровкаРасчетаПоБазе.Ставка, "ЧН=0; ЧГ=; ЧФ=Ч%"));
			
			Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.СредняяСЧА") Тогда
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьРасчетВознаграждения, "КоличествоДней",
					"=ЧСТРОК(" + СтраницаСреднейСЧА.КлючевыеЯчейки["СЧАЗаПериод" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина) + ")");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьРасчетВознаграждения, "КоличествоДнейВГоду",
					Формат(РасшифровкаРасчетаПоБазе.ДнейВГоду, "ЧН=0; ЧГ="));
			КонецЕсли;
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#Область Выводим_расчет_на_титульную_страницу
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего (плата за управление)",
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеОтСреднейСЧА" + СуффиксПоказателей],
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Истина, Истина, Истина);
			
			Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.УдельнаяСуммаСЧА") Тогда
				
				Если ДанныеРасшифровки.ШаблонРасшифровки = "Газфонд" Тогда
					
					#Область Газфонд
					
					ПустаяТитульная	= (ТитульнаяСтраница.ВсегоСтрок = 0);
					
					ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаГазфондУдельнаяСуммаСЧА");
					ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, ПустаяТитульная, ПустаяТитульная);
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "КраткоеНаименованиеУК",
						ДанныеОбОрганизации.КраткоеНаименованиеОрганизации, Истина);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ДоговорДУ",
						ОбщиеПараметрыЗаполнения.ДоговорДУ, Истина);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ПериодРасчета",
						"с " + ОбщиеПараметрыЗаполнения.НачалоБазовогоПериодаСтрокой + " по " + ОбщиеПараметрыЗаполнения.КонецБазовогоПериодаСтрокой, Истина);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "СредняяСЧА",
						"=" + ЯчейкаСредняяСЧА.Address(Ложь, Ложь, , Истина));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "Ставка",
						"=" + ЯчейкаСтавка.Address(Ложь, Ложь, , Истина) + " * 100");
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "Сумма",
						"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеОтСреднейСЧА" + СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
					
					#КонецОбласти
					
				КонецЕсли;
				
			Иначе
				
				Если ДанныеРасшифровки.ШаблонРасшифровки = "ФизЛицо" Тогда
					
					#Область Физическое_лицо
					
					ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ГруппаПоказателей",
						СтрШаблон("%1. Средняя СЧА за отчетный период", ДанныеРасшифровки.БазыРасчета.Найти(РасшифровкаРасчетаПоБазе) + 1));
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ЗначениеПоказателя",
						?(РасчетВВалютеУчета, "в рублях РФ", "=ПредставлениеВалютыРасчета"));
					
					ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "Показатель",
						"Средняя СЧА за отчетный период");
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьВставки, "ЗначениеПоказателя",
						"=" + ЯчейкаСредняяСЧА.Address(Ложь, Ложь, , Истина));
					
					#КонецОбласти
					
				КонецЕсли;
				
			КонецЕсли;
			
			#КонецОбласти
			
			Если ДанныеРасшифровки.ВыводитьАкт Тогда
				
				#Область Формируем_акт_об_оказанных_услугах
			
				Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.УдельнаяСуммаСЧА") Тогда
					ПрефиксШаблонаАкта = "АктУдельнаяСуммаСЧА";
				Иначе
					ПрефиксШаблонаАкта = "Акт";
				КонецЕсли;
				
				ОбластьАкта = ПолучитьОбластьАктаExcel(ExcelApp, Расшифровка, ДанныеРасшифровки, ШаблонСтраницыАкта, ОбщийАкт, ПрефиксШаблонаАкта);
				
				Если РасшифровкаРасчетаПоБазе.БазаРасчета = ПредопределенноеЗначение("Справочник.БазыРасчета.УдельнаяСуммаСЧА") Тогда
					ПредставлениеСреднейСЧА = ПредставленияСуммыДляПечати(РасшифровкаРасчетаПоБазе.УдельнаяСуммаСЧА);
					
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьАкта, "СредняяСЧАРублей",
						ПредставлениеСреднейСЧА.СуммаРублей, Истина);
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
						ОбластьАкта, "СредняяСЧАПрописьюРублей",
						ПредставлениеСреднейСЧА.СуммаПрописьюРублей, Истина);
				КонецЕсли;
				
				#КонецОбласти
				
			КонецЕсли;
			
			#КонецОбласти
		Иначе
			#Область Нереализованная_расшифровка_расчёта_по_базе
			
			// Известен только результат
			
			ШаблонШапки = ШаблонСтраницыРасчета.Страница.Range("ШапкаРасчетБезРасшифровки");
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапки, Ложь, Ложь);
			
			ШаблонСтроки   = ШаблонСтраницыРасчета.Страница.Range("СтрокаРасчетБезРасшифровки");
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтроки);
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",		   "Представление");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя", РасшифровкаРасчетаПоБазе.Представление);
			
			ШаблонИтога    = ШаблонСтраницыРасчета.Страница.Range("ИтогРасчетБезРасшифровки");
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтога);
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя", РасшифровкаРасчетаПоБазе.СуммаВознаграждения);
			
			// Добавляем показатели на титульную страницу
			
			ДобавитьЯчейкуРасчетаВознаграждения(
				СтраницаРасчета,
				"Вознаграждение управляющего: " + РасшифровкаРасчетаПоБазе.Представление,
				СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"),
				РасшифровкаРасчетаПоБазе.НачисляетсяНарастающимИтогом,
				Неопределено
			);
			
			// Добавляем отступ для следующих расчетов
			
			СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
			
			#КонецОбласти
		КонецЕсли;
		
		#Область Заполнение_даты_расчёта_СЧА_на_начало_года
		
		Если РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета.Свойство("_СЧАНаНачалоГода") Тогда
			
			СЧАНаНачалоГода = РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_СЧАНаНачалоГода"];
			
			Если СЧАНаНачалоГода.Количество() > 0 Тогда
			
				ЯчейкаДатаРасчетаСЧАНаНачалоГода = СтраницаРасчета.КлючевыеЯчейки.Получить("ДатаРасчетаСЧАНаНачалоГода");
				
				Если ЯчейкаДатаРасчетаСЧАНаНачалоГода <> Неопределено Тогда
					
					ЯчейкаДатаРасчетаСЧАНаНачалоГода.Value = СЧАНаНачалоГода[0].Дата;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
		// Заполнение акта данными, не зависящими от базы расчёта
		Если ОбластьАкта <> Неопределено И Не ОбщийАкт Тогда
			УстановитьЗначенияПараметровАкта(ОбластьАкта, ДанныеРасшифровки, ДанныеОбОрганизации, ОбщиеПараметрыЗаполнения, ПредставлениеСуммыВознаграждения);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыПечати(ОбластьАкта.Worksheet, Истина, ОриентацияСтраницы.Портрет);
		КонецЕсли;
	КонецЦикла;
	
	#КонецОбласти
	
	// Итоговый расчёт вознаграждения к оплате
	#Область Расчёт_вознаграждения_к_оплате
	
	ФормулыВознагражденияНачисляемогоЗаПериод			= Новый Массив;
	ФормулыВознагражденияНачисляемогоНарастающимИтогом	= Новый Массив;
	
	Для Каждого ЭлементРасчетаВознаграждения Из СтраницаРасчета.КлючевыеЯчейки["РасчетВознаграждения"] Цикл
		
		Если ЭлементРасчетаВознаграждения.ВключатьВИтоговуюСумму Тогда
			
			ФормулаВознаграждения = СтрШаблон("ЕСЛИ(%1<0;0;%1)", ЭлементРасчетаВознаграждения.Область.Address(Ложь, Ложь));
			
			Если ЭлементРасчетаВознаграждения.НачисляетсяНарастающимИтогом Тогда 
				ФормулыВознагражденияНачисляемогоНарастающимИтогом.Добавить(ФормулаВознаграждения);
			Иначе
				ФормулыВознагражденияНачисляемогоЗаПериод.Добавить(ФормулаВознаграждения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИтоговаяФормулаВознагражденияНачисляемогоЗаПериод =
		?(ФормулыВознагражденияНачисляемогоЗаПериод.Количество() > 0, "=" + СтрСоединить(ФормулыВознагражденияНачисляемогоЗаПериод, " + "), "");
	
	ИтоговаяФормулаВознагражденияНачисляемогоНарастающимИтогом =
		?(ФормулыВознагражденияНачисляемогоНарастающимИтогом.Количество() > 0, "=" + СтрСоединить(ФормулыВознагражденияНачисляемогоНарастающимИтогом, " + "), "");
	
	СуффиксОбласти = ?(ЗначениеЗаполнено(ДанныеРасшифровки.ОграничениеОбщегоРазмераВознаграждения), "СОграничениемОбщегоРазмера", "");
	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонГруппаРасчета);
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ГруппаРасчета", "Расчет вознаграждения к оплате");
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	ШаблонИтоговыйРасчет = ШаблонСтраницыРасчета.Страница.Range(?(РасчетВВалютеУчета, "ИтоговыйРасчет", "ИтоговыйРасчетВалютный") + СуффиксОбласти);
	ОбластьВставки		 = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтоговыйРасчет);

	Если РасчетВВалютеУчета Тогда
		
		ЯчейкаВознагражденияНачисляемогоЗаПериод = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ВознаграждениеНачисляемоеЗаПериод");
		ЯчейкаВознагражденияНачисляемогоЗаПериод.FormulaLocal = ИтоговаяФормулаВознагражденияНачисляемогоЗаПериод;
		
		ЯчейкаВознагражденияНачисляемогоНарастающимИтогом = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(
			ОбластьВставки, "ВознаграждениеНачисляемоеНарастающимИтогом");
		ЯчейкаВознагражденияНачисляемогоНарастающимИтогом.FormulaLocal = ИтоговаяФормулаВознагражденияНачисляемогоНарастающимИтогом;
		
		ЯчейкаСуммарноеВознаграждение = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СуммарноеВознаграждение");
		ЯчейкаСуммарноеВознаграждение.FormulaLocal =
			"=" + ЯчейкаВознагражденияНачисляемогоЗаПериод.Address(Ложь, Ложь) + " + " + ЯчейкаВознагражденияНачисляемогоНарастающимИтогом.Address(Ложь, Ложь);
		
		СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммарноеВознаграждение", ЯчейкаСуммарноеВознаграждение);
	
	Иначе
		
		// Пересчитываем рассчитанное вознаграждение в валюту учета
		
		ЯчейкаВознагражденияНачисляемогоЗаПериодВВалютеРасчета = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(
			ОбластьВставки, "ВознаграждениеНачисляемоеЗаПериодВВалютеРасчета");
		ЯчейкаВознагражденияНачисляемогоЗаПериодВВалютеРасчета.FormulaLocal = ИтоговаяФормулаВознагражденияНачисляемогоЗаПериод;
		
		ЯчейкаВознагражденияНачисляемогоНарастающимИтогомВВалютеРасчета = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(
			ОбластьВставки, "ВознаграждениеНачисляемоеНарастающимИтогомВВалютеРасчета");
		ЯчейкаВознагражденияНачисляемогоНарастающимИтогомВВалютеРасчета.FormulaLocal = ИтоговаяФормулаВознагражденияНачисляемогоНарастающимИтогом;
		
		ЯчейкаСуммарноеВознаграждениеВВалютеРасчета = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(
			ОбластьВставки, "СуммарноеВознаграждениеВВалютеРасчета");
		ЯчейкаСуммарноеВознаграждениеВВалютеРасчета.FormulaLocal =
			"=" + ЯчейкаВознагражденияНачисляемогоЗаПериодВВалютеРасчета.Address(Ложь, Ложь)
				+ " + " + ЯчейкаВознагражденияНачисляемогоНарастающимИтогомВВалютеРасчета.Address(Ложь, Ложь);
		
		СтраницаКурсовВалют = Расшифровка.Результат.ПараметрыЛистов["Курсы валют"];
		Если СтраницаКурсовВалют = Неопределено Тогда
			КурсВалютыРасчета = ДанныеРасшифровки.КурсВалютыРасчета;	
		Иначе
			КурсВалютыРасчета = СтрШаблон(
				"=ЕСЛИ(ВалютаРасчета=""RUB""; 1; ВПР(ВалютаРасчета & КонецПериодаРасчета; %1; 2; ЛОЖЬ))",
				СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина));
		КонецЕсли;
		
		ЯчейкаКурсВалютыРасчета = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "КурсВалютыРасчета");
		ЯчейкаКурсВалютыРасчета.FormulaLocal = КурсВалютыРасчета;
		
		ЯчейкаВознагражденияНачисляемогоЗаПериод = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ВознаграждениеНачисляемоеЗаПериод");
		ЯчейкаВознагражденияНачисляемогоЗаПериод.FormulaLocal = СтрШаблон(
			"=ОКРУГЛ(%1 * %2; 2)",
			ЯчейкаВознагражденияНачисляемогоЗаПериодВВалютеРасчета.Address(Ложь, Ложь),
			ЯчейкаКурсВалютыРасчета.Address(Ложь, Ложь));
		
		ЯчейкаВознагражденияНачисляемогоНарастающимИтогом = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(
			ОбластьВставки, "ВознаграждениеНачисляемоеНарастающимИтогом");
		ЯчейкаВознагражденияНачисляемогоНарастающимИтогом.FormulaLocal = СтрШаблон(
			"=ОКРУГЛ(%1 * %2; 2)",
			ЯчейкаВознагражденияНачисляемогоНарастающимИтогомВВалютеРасчета.Address(Ложь, Ложь),
			ЯчейкаКурсВалютыРасчета.Address(Ложь, Ложь));
		
		ЯчейкаСуммарноеВознаграждение = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "СуммарноеВознаграждение");
		ЯчейкаСуммарноеВознаграждение.FormulaLocal =
			"=" + ЯчейкаВознагражденияНачисляемогоЗаПериод.Address(Ложь, Ложь) + " + " + ЯчейкаВознагражденияНачисляемогоНарастающимИтогом.Address(Ложь, Ложь);
		
		СтраницаРасчета.КлючевыеЯчейки.Вставить("КурсВалютыРасчета",		ЯчейкаКурсВалютыРасчета);
		СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммарноеВознаграждение",	ЯчейкаСуммарноеВознаграждение);
	КонецЕсли;
	
	// Удержанное вознаграждение
	
	ЯчейкаВознаграждениеУплаченное = СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеВВалютеУчета"];
	
	Если ЯчейкаВознаграждениеУплаченное = Неопределено И РасчетВВалютеУчета Тогда
		ЯчейкаВознаграждениеУплаченное = СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"];
		Если ЯчейкаВознаграждениеУплаченное <> Неопределено Тогда
			СтраницаРасчета.КлючевыеЯчейки.Вставить("ВознаграждениеУплаченноеВВалютеУчета", ЯчейкаВознаграждениеУплаченное);
		КонецЕсли;		
	КонецЕсли;
	
	// Удержанное вознаграждение по данным БУ берем из бухгалтерской базы 	
	ЯчейкаВознаграждениеУплаченноеБУ = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ВознаграждениеУплаченноеБУ");
	
	Если ЯчейкаВознаграждениеУплаченное = Неопределено Тогда
		ЯчейкаВознаграждениеУплаченное = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "ВознаграждениеУплаченное");
		ЯчейкаВознаграждениеУплаченное.Value2 = ?(ДанныеРасшифровки.РанееУдержанноеВознаграждениеБУ = Неопределено, ДанныеРасшифровки.ВознаграждениеУплаченноеСНачалаГода, 0);
		СтраницаРасчета.КлючевыеЯчейки.Вставить("ВознаграждениеУплаченноеВВалютеУчета", ЯчейкаВознаграждениеУплаченное);
		
		Если ДанныеРасшифровки.РанееУдержанноеВознаграждениеБУ <> Неопределено Тогда
			ДанныеРасшифровки.Вставить("РанееУдержанноеВознаграждениеБУИспользованоВРасчете", Истина);
		КонецЕсли;
	ИначеЕсли ИспользоватьВознаграждениеИзБухгалтерскойБазы И ЯчейкаВознаграждениеУплаченноеБУ <> Неопределено Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ВознаграждениеУплаченное", "=" + ЯчейкаВознаграждениеУплаченноеБУ.Address(Ложь, Ложь));			
	Иначе	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ВознаграждениеУплаченное", "=" + ЯчейкаВознаграждениеУплаченное.Address(Ложь, Ложь));
	КонецЕсли;
	
	Если ЯчейкаВознаграждениеУплаченноеБУ <> Неопределено Тогда
		// Если уже получено в параметрах расчета, используем его
		// Если оно должно было быть получено, сообщим об ошибке расчета
		Если ИспользоватьВознаграждениеИзБухгалтерскойБазы
			И Не ДанныеРасшифровки.РанееУдержанноеВознаграждениеБУИспользованоВРасчете
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка расчета: в расчете не использовано ранее удержанное вознаграждение по данным собственной бухгалтерии");
			ЯчейкаВознаграждениеУплаченноеБУ.Value2 = 0;
		Иначе
			ЯчейкаВознаграждениеУплаченноеБУ.Value2 = ?(ДанныеРасшифровки.РанееУдержанноеВознаграждениеБУ <> Неопределено,
				ДанныеРасшифровки.РанееУдержанноеВознаграждениеБУ,
				ПолучитьУдержанноеВознаграждениеПоДаннымБухгалтерии(ЭтаФорма.АдресДанныхБухгалтерииОбУдержанномВознаграждении,
					ДанныеРасшифровки.СчетДоверительногоУправления));
			СтраницаРасчета.КлючевыеЯчейки.Вставить("ВознаграждениеУплаченноеБУ", ЯчейкаВознаграждениеУплаченноеБУ);
		КонецЕсли;
	КонецЕсли;
		
	Для Каждого ЯчейкаТитульнойСтраницы Из ТитульнаяСтраница.КлючевыеЯчейки["ВознаграждениеУплаченное"] Цикл
		ЯчейкаТитульнойСтраницы.FormulaLocal = "=" + ?(ИспользоватьВознаграждениеИзБухгалтерскойБазы,
			ЯчейкаВознаграждениеУплаченноеБУ.Address(Ложь, Ложь, , Истина),
			ЯчейкаВознаграждениеУплаченное.Address(Ложь, Ложь, , Истина));
	КонецЦикла;
	
	// Ограничение общего размера вознаграждения с начала действия договора
	
	Если ЗначениеЗаполнено(ДанныеРасшифровки.ОграничениеОбщегоРазмераВознаграждения) Тогда
		
		ЯчейкаВознаграждениеУплаченноеСНачалаДоговора = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(
			ОбластьВставки, "ВознаграждениеУплаченноеСНачалаДоговора");
		Если ЯчейкаВознаграждениеУплаченноеСНачалаДоговора <> Неопределено Тогда
			ЯчейкаВознаграждениеУплаченноеСНачалаДоговора.Value2 = ДанныеРасшифровки.ВознаграждениеУплаченноеСНачалаДоговора;
		КонецЕсли;
		
		ЯчейкаОграничениеОбщегоРазмераВознаграждения = РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(
			ОбластьВставки, "ОграничениеОбщегоРазмераВознаграждения");
		Если ЯчейкаОграничениеОбщегоРазмераВознаграждения <> Неопределено Тогда
			ЯчейкаОграничениеОбщегоРазмераВознаграждения.Value2 = ДанныеРасшифровки.ОграничениеОбщегоРазмераВознаграждения;
		КонецЕсли;
		
	КонецЕсли;
	
	// При использовании ранее удержанного вознаграждения из бухгалтерской базы его нужно вычесть из итоговой суммы
	Если ИспользоватьВознаграждениеИзБухгалтерскойБазы Тогда 
		АдресЯчейкиВознагражденияБУ = ЯчейкаВознаграждениеУплаченноеБУ.Address(Ложь, Ложь);
		СтрокаЯчейкиВознаграждения	= Число(СтрЗаменить(АдресЯчейкиВознагражденияБУ, "D", "")) - 1;
		АдресЯчейкиВознаграждения 	= "D" + Формат(СтрокаЯчейкиВознаграждения, "ЧГ=0");
		
		ТекущаяФормула = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D").FormulaLocal;
		СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D").FormulaLocal = СтрЗаменить(ТекущаяФормула, АдресЯчейкиВознаграждения, АдресЯчейкиВознагражденияБУ); 
	КонецЕсли;
	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ВознаграждениеКОплате", СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"));
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	// Контроль суммы вознаграждения
	
	ВывестиКонтрольСуммыВознагражденияExcel(ДанныеРасшифровки, Расшифровка);
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыПечати(СтраницаРасчета.Страница, Истина, ОриентацияСтраницы.Ландшафт);
	
	#КонецОбласти
	
	#Область Тело_и_подвал_титульной_страницы
	
	// Выводим составляющие расчета вознаграждения
	Если ШаблонГруппаПоказателей <> Неопределено Тогда
		
		Если ДанныеРасшифровки.ШаблонРасшифровки = "ФизЛицо" Тогда
			ГруппаПоказателей	= СтрШаблон("%1. Расчет вознаграждения управляющего", ДанныеРасшифровки.БазыРасчета.Количество() + 1);
			ЗначениеПоказателя	= ?(РасчетВВалютеУчета, "в рублях РФ", "=ПредставлениеВалютыРасчета");
		Иначе
			ГруппаПоказателей	= ?(РасчетВВалютеУчета, "Расчет вознаграждения управляющего", "= ""Расчет вознаграждения управляющего "" & ПредставлениеВалютыРасчета");
			ЗначениеПоказателя	= "";
		КонецЕсли;
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ГруппаПоказателей", ГруппаПоказателей);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя", ЗначениеПоказателя);
		
	КонецЕсли;
	
	Если ШаблонПоказатель <> Неопределено
		// Начиная с 2023 для стандартного шаблона составляющие выводятся в коде расчета по базам
		И ДанныеРасшифровки.ШаблонРасшифровки <> "2023" И ДанныеРасшифровки.ШаблонРасшифровки <> "2024"
	Тогда
		Для Каждого ЭлементРасчетаВознаграждения Из СтраницаРасчета.КлючевыеЯчейки["РасчетВознаграждения"] Цикл
			Если ЭлементРасчетаВознаграждения.ВыводитьНаТитульнойСтранице Тогда
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "Показатель",			ЭлементРасчетаВознаграждения.Показатель);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПоказателя",	"=" + ЭлементРасчетаВознаграждения.Область.Address(Ложь, Ложь, , Истина));
			КонецЕсли;
		КонецЦикла;
		
		Если РасчетВВалютеУчета И ДанныеРасшифровки.ШаблонРасшифровки <> "ФизЛицо" Тогда // Выводится позже в валюте учета при расчете вознаграждения к оплате
			ВывестиВознаграждениеУдержанноеРанееНаТитульнуюСтраницу(
				ТитульнаяСтраница, СтраницаРасчета, ШаблонПоказатель, ЯчейкаВознаграждениеУплаченноеСНачалаДоговора, ЯчейкаОграничениеОбщегоРазмераВознаграждения);
		КонецЕсли;
		
	КонецЕсли;            
	
	Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз") Тогда
		
		#Область Сургутнефтегаз
		
		// Очищаем (заполняем значениями по умолчанию) неиспользованные параметры
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",			"");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаВознагражденияПоИД",		"");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеПоИД",				"");
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "КоличествоДнейПериодаРасчета",	ДанныеРасшифровки.КоличествоДнейПериодаРасчета);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаЗаГод",						"0");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеЗаУправление",		"0");
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "СуммарноеВознаграждение",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммарноеВознаграждение"].Address(Ложь, Ложь, , Истина));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "ВознаграждениеУплаченное", 
			"=" + ?(ИспользоватьВознаграждениеИзБухгалтерскойБазы,
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеБУ"].Address(Ложь, Ложь, , Истина),
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеВВалютеУчета"].Address(Ложь, Ложь, , Истина)));
                			
		#КонецОбласти
		
	КонецЕсли;
	
	// Итого к оплате вознаграждения
	Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Будущее") Тогда
		
		#Область Будущее
		
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "СуммарноеВознаграждение",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммарноеВознаграждение"].Address(Ложь, Ложь, , Истина));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "ВознаграждениеУплаченное", 
			"=" + ?(ИспользоватьВознаграждениеИзБухгалтерскойБазы,
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеБУ"].Address(Ложь, Ложь, , Истина),
				СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеВВалютеУчета"].Address(Ложь, Ложь, , Истина)));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "ВознаграждениеКОплате",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
		
		// Очищаем (заполняем значениями по умолчанию) неиспользованные параметры
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",			"");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтавкаВознагражденияПоИД",		"");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеПоИД",				"");
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "КоличествоДнейПериодаРасчета",	ДанныеРасшифровки.КоличествоДнейПериодаРасчета);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаЗаГод",						"0");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ВознаграждениеЗаУправление",		"0");
		
		#КонецОбласти
		
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "СбербанкПР" Тогда
		
		#Область Сбербанк_ПР
		
		ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПР_П7", ШаблонТитульнойСтраницы);
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
		
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз") Тогда
		
		#Область Сургутнефтегаз
		
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "ВознаграждениеКОплате",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
		
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "2023"
		Или ДанныеРасшифровки.ШаблонРасшифровки = "2024"
	Тогда
		#Область Стандартный_2023_2024
		
		// Шапка
		ФормулаСуммыВознагражденийЗаУправление	= ФормулаСуммыРассчитанныхВознагражденийЗаУправление(Расшифровка, ДанныеРасшифровки, Истина);
		ФормулаСуммыВознагражденийЗаУспех		= ФормулаСуммыРассчитанныхВознагражденийЗаУспех(Расшифровка, ДанныеРасшифровки, Истина);
		
		ВключаяРасшифровку = ЗначениеЗаполнено(ФормулаСуммыВознагражденийЗаУспех) И ЗначениеЗаполнено(ФормулаСуммыВознагражденийЗаУправление);
		ИмяШаблонаШапкиИтоговогоРасчета = ?(ВключаяРасшифровку, "ИтоговыйРасчетСРасшифровкойШапка<Год>", "ИтоговыйРасчетШапка<Год>");
		ШаблонШапкиИтоговогоРасчета = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(
			ШаблонТитульнойСтраницы, ИмяШаблонаШапкиИтоговогоРасчета, ДанныеРасшифровки.ШаблонРасшифровки);
		
		ОбластьШапка = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапкиИтоговогоРасчета);
		
		Если ДанныеРасшифровки.ШаблонРасшифровки = "2023" Тогда
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьШапка, "ВТомЧисле", ?(ВключаяРасшифровку, ", в т.ч.:", ""), Истина);
		КонецЕсли;
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьШапка, "СуммарноеВознаграждение",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммарноеВознаграждение"].Address(Ложь, Ложь, , Истина));
		
		Если ВключаяРасшифровку Тогда
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьШапка, "ВознаграждениеЗаУправление", "=" + ФормулаСуммыВознагражденийЗаУправление);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьШапка, "ВознаграждениеЗаУспех", "=" + ФормулаСуммыВознагражденийЗаУспех);
		КонецЕсли;
		
		// Подвал
		ШаблонПодвалаИтоговогоРасчета = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(
			ШаблонТитульнойСтраницы, "ИтоговыйРасчетПодвал<Год>", ДанныеРасшифровки.ШаблонРасшифровки);
		
		ОбластьПодвал = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПодвалаИтоговогоРасчета);
		                                  
		Если ИспользоватьВознаграждениеИзБухгалтерскойБазы Тогда			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьПодвал, "ВознаграждениеУплаченное",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеБУ"].Address(Ложь, Ложь, , Истина));			
		Иначе			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьПодвал, "ВознаграждениеУплаченное",
				"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеВВалютеУчета"].Address(Ложь, Ложь, , Истина));
		КонецЕсли;		
				
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьПодвал, "ВознаграждениеКОплате",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
		
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "ППА" Тогда
		
		#Область ППА
		
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "КонецПериодаРасчета",
			Формат(ДанныеРасшифровки.КонецРасчетногоПериода, "ДФ='dd MMMM yyyy'"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "ГодПериодаРасчета",
			Формат(ДанныеРасшифровки.КонецРасчетногоПериода, "ДФ=yyyy"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьТело, "ВознаграждениеКОплате",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
		
	ИначеЕсли ШаблонГруппаПоказателей <> Неопределено Тогда
		Если РасчетВВалютеУчета Тогда
			Если ДанныеРасшифровки.ШаблонРасшифровки = "ФизЛицо" Тогда
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ГруппаПоказателей", СтрШаблон("%1. Вознаграждение управляющего к оплате", ДанныеРасшифровки.БазыРасчета.Количество() + 2));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПоказателя", "в рублях РФ");
				
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "Показатель", "Вознаграждение управляющего рассчитанное");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПоказателя", "=" + СтраницаРасчета.КлючевыеЯчейки["СуммарноеВознаграждение"].Address(Ложь, Ложь, , Истина));
				
				ВывестиВознаграждениеУдержанноеРанееНаТитульнуюСтраницу(
					ТитульнаяСтраница, СтраницаРасчета, ШаблонПоказатель, ЯчейкаВознаграждениеУплаченноеСНачалаДоговора, ЯчейкаОграничениеОбщегоРазмераВознаграждения);
				
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "Показатель", "Вознаграждение управляющего к оплате");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПоказателя", "=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
				
				ТитульнаяСтраница.Страница.Range(
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
						ТитульнаяСтраница.ВсегоСтрок, "", ТитульнаяСтраница.ВсегоСтрок, "")).Font.Bold = True; // Очень медленно, но лень что-то придумывать или рисовать отдельный шаблон с жирной строкой
			Иначе
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ГруппаПоказателей", "Вознаграждение управляющего к оплате");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПоказателя", "=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
			КонецЕсли;
		Иначе
			Если ДанныеРасшифровки.ШаблонРасшифровки = "ФизЛицо" Тогда
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ГруппаПоказателей", СтрШаблон("%1. Вознаграждение управляющего к оплате", ДанныеРасшифровки.БазыРасчета.Количество() + 2));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПоказателя", "в рублях РФ");
			Иначе
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ГруппаПоказателей", "Вознаграждение управляющего к оплате в рублях РФ");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьВставки, "ЗначениеПоказателя", "");
			КонецЕсли;
				
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "Показатель", "Курс ЦБ РФ на дату расчета");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ЗначениеПоказателя", "=" + СтраницаРасчета.КлючевыеЯчейки["КурсВалютыРасчета"].Address(Ложь, Ложь, , Истина));
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "Показатель", "Вознаграждение управляющего рассчитанное");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ЗначениеПоказателя", "=" + СтраницаРасчета.КлючевыеЯчейки["СуммарноеВознаграждение"].Address(Ложь, Ложь, , Истина));

			ВывестиВознаграждениеУдержанноеРанееНаТитульнуюСтраницу(
				ТитульнаяСтраница, СтраницаРасчета, ШаблонПоказатель, ЯчейкаВознаграждениеУплаченноеСНачалаДоговора, ЯчейкаОграничениеОбщегоРазмераВознаграждения);
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "Показатель", "Вознаграждение управляющего к оплате");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки, "ЗначениеПоказателя", "=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеКОплате"].Address(Ложь, Ложь, , Истина));
			
			ТитульнаяСтраница.Страница.Range(
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
					ТитульнаяСтраница.ВсегоСтрок, "", ТитульнаяСтраница.ВсегоСтрок, "")).Font.Bold = True; // Очень медленно, но лень что-то придумывать или рисовать отдельный шаблон с жирной строкой
		КонецЕсли;
	КонецЕсли;
	
	// Подвал
	Если ТитульнаяСтраница.ВсегоСтрок = 0 Тогда
		// Если не было выведено ни одной строки, то титульную страницу удаляем
		ТитульнаяСтраница.Страница.Delete();
		Расшифровка.Результат.ПараметрыЛистов.Удалить("Титульная страница");
	Иначе
		ШаблонПодвала = ДобавитьШаблонОбластиСтраницыExcelПоГодовомуШаблону("Подвал<Год>", ДанныеРасшифровки.ШаблонРасшифровки, ШаблонТитульнойСтраницы);
		Если ШаблонПодвала = Неопределено Тогда
			ШаблонПодвала = ДобавитьШаблонОбластиСтраницыExcel("Подвал", ШаблонТитульнойСтраницы);
		КонецЕсли;		
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПодвала, Ложь, Ложь);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "КраткоеНаименованиеУК",			ДанныеОбОрганизации.КраткоеНаименованиеОрганизации, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ПодписантОтУК",					Строка(ЭтаФорма.Подписант), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ПодписантОтУКДолжность",			ЭтаФорма.ПодписантДолжность);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ПодписантБухгалтерОтУК",			Строка(ЭтаФорма.ПодписантБухгалтер));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ПодписантБухгалтерОтУКДолжность",	ЭтаФорма.ПодписантБухгалтерДолжность);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "УчредительУправления",				ДанныеРасшифровки.УчредительУправления);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "КраткоеНаименованиеУчредителя",	ДанныеРасшифровки.КраткоеНаименованиеУчредителяУправления, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ПодписантОтУчредителя",			ОбщиеПараметрыЗаполнения.ПодписантОтУчредителя);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ПодписантОтУчредителяДолжность",	ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяДолжность);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки, "ПодписантБухгалтерОтУчредителя",	"");
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыПечати(ТитульнаяСтраница.Страница, Истина, ОриентацияСтраницы.Портрет);
	КонецЕсли;
	
	#КонецОбласти
	
	// Заполнение общего акта
	#Область Акт_об_оказанных_услугах
	
	Если ДанныеРасшифровки.ВыводитьАкт И ОбщийАкт Тогда
		ПредставлениеСуммыВознаграждения = ПредставленияСуммыДляПечати(ДанныеРасшифровки.СуммаВознаграждения, Истина);
		ОбластьАкта = ПолучитьОбластьАктаExcel(ExcelApp, Расшифровка, ДанныеРасшифровки, ШаблонСтраницыАкта, ОбщийАкт, "Акт");
		УстановитьЗначенияПараметровАкта(ОбластьАкта, ДанныеРасшифровки, ДанныеОбОрганизации, ОбщиеПараметрыЗаполнения, ПредставлениеСуммыВознаграждения);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыПечати(ОбластьАкта.Worksheet, Истина, ОриентацияСтраницы.Портрет);
	КонецЕсли;
	
	#КонецОбласти
	
	// Сброс выделения
	Для Каждого ПараметрыЛиста Из Расшифровка.Результат.ПараметрыЛистов Цикл
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelСброситьВыделение(ПараметрыЛиста.Значение.Страница);
	КонецЦикла;
	
	// При фиксированной сумме в настройках расчёта не нужны листы "Титульная страница" и "Расчет"
	#Область Удаление_всех_страниц_кроме_Акт_для_баз_с_фиксированной_суммой
	
	// Два листа удаляются только, если после этого останется хотя бы ещё один лист
	Если НоваяКнигаExcel.Worksheets.Count >= 3 Тогда
		ТолькоФиксированнаяСумма = Неопределено;
		ФиксированнаяСуммаВГод = ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСуммаВГод");
		ФиксированнаяСуммаВМесяц = ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСуммаВМесяц");
		ФиксированнаяСуммаВДень = ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСуммаВДень");
		Для Каждого РасшифровкаРасчетаПоБазе Из ДанныеРасшифровки.БазыРасчета Цикл
			Если РасшифровкаРасчетаПоБазе.БазаРасчета = ФиксированнаяСуммаВГод
				Или РасшифровкаРасчетаПоБазе.БазаРасчета = ФиксированнаяСуммаВМесяц
				Или РасшифровкаРасчетаПоБазе.БазаРасчета = ФиксированнаяСуммаВДень
			Тогда
				ТолькоФиксированнаяСумма = Истина;
			Иначе
				ТолькоФиксированнаяСумма = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// По аналогии с процедурой "КомандаПодготовитьФайлыДляЭДО", но удаляется два листа вместо одного
		Если ТолькоФиксированнаяСумма <> Неопределено И ТолькоФиксированнаяСумма Тогда
			// Оставляем только значения ячеек
			Для Счетчик = 1 По 2 Цикл
				ЛистExcel = НоваяКнигаExcel.Worksheets(Счетчик);
				ЛистExcel.Activate();
				xlCellTypeFormulas = -4123;
				
				Попытка
					Диапазон = ЛистExcel.Cells.SpecialCells(xlCellTypeFormulas);
				Исключение
					Продолжить;
				КонецПопытки;
				
				Если Диапазон.Count > 0 Тогда
					Для Каждого Ячейка Из Диапазон.Areas Цикл
						Ячейка.Value = Ячейка.Value;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			// Удаление листов "Титульная страница" и "Расчет"
			Попытка
				НоваяКнигаExcel.Worksheets("Титульная страница").Delete();
				НоваяКнигаExcel.Worksheets("Расчет").Delete();
			Исключение
				Сообщить(ОписаниеОшибки());
				Сообщить("Не удалось удалить страницу расчётов по счёту: "
					+ ДанныеРасшифровки.СчетДоверительногоУправления + " на " + ОбщиеПараметрыЗаполнения.ПредставлениеПериода);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	#КонецОбласти
	
	// Закрытие шаблона и подготовка отчёта к просмотру
	КнигаШаблонаExcel.Close(Ложь);
	
	ИмяФайла = СтрШаблон("Расчет вознаграждения '%1' за %2.xlsx", ДанныеРасшифровки.СчетДоверительногоУправления, ОбщиеПараметрыЗаполнения.ПредставлениеПериода);
	
	Если ОткрытьБезСохранения Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыПриложения(ExcelApp, , , ИмяФайла);
	Иначе
		ПутьКФайлу = КаталогВременныхФайлов() + ИмяФайла;
		xlOpenXMLWorkbook = 51; // Книга Open XML (*.xlsx), она же xlWorkbookDefault
		
		НоваяКнигаExcel.SaveAs(ПутьКФайлу, xlOpenXMLWorkbook);
		НоваяКнигаExcel.Close();
		
		ExcelApp.Workbooks.Add(ПутьКФайлу);
		
		УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыИнтерактивностиПриложения(ExcelApp, Истина, Истина, Истина, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьПараметрыПриложения(ExcelApp, Истина, "Развернуто");
КонецПроцедуры

&НаКлиенте
Функция ДобавитьОписаниеСтраницыExcel(ИмяСтраницы, СтруктураРасшифровки, НоваяСтраница = Истина, ВставитьВНачало = Ложь)  
	
	// Создаем или запоминаем страницу	
	
	Если НоваяСтраница Тогда

		// Ищем свободное имя страницы
		
		НомерСтраницы = 0;
		Пока СтруктураРасшифровки.ПараметрыЛистов[ИмяСтраницы + Формат(НомерСтраницы, "ЧФ=' Ч'")] <> Неопределено Цикл
			НомерСтраницы = ?(НомерСтраницы = 0, 2, НомерСтраницы + 1);	 
		КонецЦикла;
		ИмяСтраницы = ИмяСтраницы + Формат(НомерСтраницы, "ЧФ=' Ч'");
		
		// Добавляем страницу
		
		ПерваяСтраница = (СтруктураРасшифровки.ПараметрыЛистов.Количество() = 0);
		
		Если ПерваяСтраница Тогда
			
			СтраницаExcel = СтруктураРасшифровки.Книга.Sheets(1);
			СтраницаExcel.Name = ИмяСтраницы;
			
		Иначе
			
			Если ВставитьВНачало Тогда
				СтраницаExcel = СтруктураРасшифровки.Книга.Sheets.Add(СтруктураРасшифровки.Книга.Sheets(1));
			Иначе
				СтраницаExcel = СтруктураРасшифровки.Книга.Sheets.Add(, СтруктураРасшифровки.Книга.Sheets(СтруктураРасшифровки.Книга.Sheets.Count));
			КонецЕсли;
			
			СтраницаExcel.Name = ИмяСтраницы;
			
		КонецЕсли;
		
	Иначе
		
		СтраницаExcel = СтруктураРасшифровки.Книга.Sheets(ИмяСтраницы);
		
	КонецЕсли;
	
	// Добавляем описание страницы
	
	ОписаниеСтраницы = Новый Структура("Страница, Области, КлючевыеЯчейки, ВсегоСтрок, ВсегоСтолбцов", СтраницаExcel, Новый Соответствие, Новый Соответствие, 0, 0); 	
	
	СтруктураРасшифровки.ПараметрыЛистов.Вставить(ИмяСтраницы, ОписаниеСтраницы);
	
	Возврат ОписаниеСтраницы;	
	
КонецФункции

&НаКлиенте
Функция ДобавитьШаблонОбластиСтраницыExcel(ИмяШаблонаОбласти, ОписаниеСтраницы, РассчитатьВысотуОбластиШаблона = Истина)
	ОбластьШаблона = ПолучитьИменованныйДиапазонExcel(ОписаниеСтраницы, ИмяШаблонаОбласти);
	Если ОбластьШаблона = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеШаблона = Новый Структура("Область, Высота", ОбластьШаблона);
	Если РассчитатьВысотуОбластиШаблона Тогда
		ОписаниеШаблона.Высота = ОбластьШаблона.Rows.Count;
	КонецЕсли;
	
	ОписаниеСтраницы.Области.Вставить(ИмяШаблонаОбласти, ОписаниеШаблона);
	
	Возврат ОписаниеШаблона;
КонецФункции

// Получение области шаблона по годовому шаблону.
//	Если в качестве года был передан шаблон расшифровки с текстом, он будет обработан стандаартным методом.
//
// Параметры:
//	ИмяШаблонаОбласти - Строка - шаблон имени области, обязательно включающий в себя "<Год>"
//	Год - Число, Строка - год для подстановки в шаблон
//	ОписаниеСтраницы - Структура
//	РассчитатьВысотуОбластиШаблона - Булево
//
// Возвращаемое значение:
//	Структура - описание шаблона
&НаКлиенте
Функция ДобавитьШаблонОбластиСтраницыExcelПоГодовомуШаблону(ИмяШаблонаОбласти, Знач Год, ОписаниеСтраницы, РассчитатьВысотуОбластиШаблона = Истина)
	Если СтрНайти(ИмяШаблонаОбласти, "<Год>") = 0 Тогда
		ВызватьИсключение "В имени шаблона области """ + ИмяШаблонаОбласти + """ отсутствует шаблонный параметр <Год>.";
	КонецЕсли;
	
	Год = Строка(Год);
	ЭтоГод = Ложь;
	ОписаниеШаблона = Неопределено;
	// 2024 год
	Если Год = "2024" Тогда
		ЭтоГод = Истина;
		ОписаниеШаблона = ДобавитьШаблонОбластиСтраницыExcel(СтрЗаменить(ИмяШаблонаОбласти, "<Год>", "2024"), ОписаниеСтраницы, РассчитатьВысотуОбластиШаблона);
	КонецЕсли;
	// 2023 год
	Если Год = "2023" Или ЭтоГод И ОписаниеШаблона = Неопределено Тогда
		ЭтоГод = Истина;
		ОписаниеШаблона = ДобавитьШаблонОбластиСтраницыExcel(СтрЗаменить(ИмяШаблонаОбласти, "<Год>", "2023"), ОписаниеСтраницы, РассчитатьВысотуОбластиШаблона);
	КонецЕсли;
	// Для остальных шаблонов (в том числе и не по годам)
	Если ОписаниеШаблона = Неопределено И Не ЭтоГод Тогда
		ОписаниеШаблона = ДобавитьШаблонОбластиСтраницыExcel(СтрЗаменить(ИмяШаблонаОбласти, "<Год>", Год), ОписаниеСтраницы, РассчитатьВысотуОбластиШаблона);
	КонецЕсли;
	
	Возврат ОписаниеШаблона;
КонецФункции

&НаКлиенте
Функция ПолучитьИменованныйДиапазонExcel(ОписаниеЛистаExcel, ИмяДиапазона)
	Если ТипЗнч(ОписаниеЛистаExcel) = Тип("Структура") Тогда
		СтраницаExcel = ОписаниеЛистаExcel.Страница;
	Иначе
		СтраницаExcel = ОписаниеЛистаExcel;
	КонецЕсли;
	
	// Проверить наличие ключа в коллекции VB нельзя...
	Попытка
		ИменованныйДиапазон = СтраницаExcel.Range(ИмяДиапазона);
		Возврат ИменованныйДиапазон;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// Получение именованного диапазона по годовому шаблону.
//	Если в качестве года был передан шаблон расшифровки с текстом, он будет обработан стандаартным методом.
//
// Параметры:
//	ОписаниеЛистаExcel - Структура, COMОбъект
//	ИмяДиапазона - Строка - шаблон имени области, обязательно включающий в себя "<Год>"
//	Год - Число, Строка - год для подстановки в шаблон
//
// Возвращаемое значение:
//	COMОбъект - именованный диапазон
&НаКлиенте
Функция ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(ОписаниеЛистаExcel, ИмяДиапазона, Знач Год)
	Если СтрНайти(ИмяДиапазона, "<Год>") = 0 Тогда
		ВызватьИсключение "В имени именованного диапазона """ + ИмяДиапазона + """ отсутствует шаблонный параметр <Год>.";
	КонецЕсли;
	
	Год = Строка(Год);
	ЭтоГод = Ложь;
	ИменованныйДиапазон = Неопределено;
	// 2024 год
	Если Год = "2024" Тогда
		ЭтоГод = Истина;
		ИменованныйДиапазон = ПолучитьИменованныйДиапазонExcel(ОписаниеЛистаExcel, СтрЗаменить(ИмяДиапазона, "<Год>", "2024"));
	КонецЕсли;
	// 2023 год
	Если Год = "2023" Или ЭтоГод И ИменованныйДиапазон = Неопределено Тогда
		ЭтоГод = Истина;
		ИменованныйДиапазон = ПолучитьИменованныйДиапазонExcel(ОписаниеЛистаExcel, СтрЗаменить(ИмяДиапазона, "<Год>", "2023"));
	КонецЕсли;
	// Для остальных шаблонов (в том числе и не по годам)
	Если ИменованныйДиапазон = Неопределено И Не ЭтоГод Тогда
		ИменованныйДиапазон = ПолучитьИменованныйДиапазонExcel(ОписаниеЛистаExcel, СтрЗаменить(ИмяДиапазона, "<Год>", Год));
	КонецЕсли;
	
	Возврат ИменованныйДиапазон;
КонецФункции

&НаКлиенте
Функция ПолучитьОбластьАктаExcel(ExcelApp, Расшифровка, ДанныеРасшифровки, ШаблонСтраницыАкта, ОбщийАкт, ПрефиксШаблонаАкта)
	
	СтраницаАкта = ?(ОбщийАкт, Расшифровка.Результат.ПараметрыЛистов["Акт"], Неопределено); 
	Если СтраницаАкта = Неопределено Тогда
		СтраницаАкта = ДобавитьОписаниеСтраницыExcel("Акт", Расшифровка.Результат, Истина, Истина);
	КонецЕсли;
				
	ОбластьВставки = ?(ОбщийАкт, СтраницаАкта.Области.Получить("Акт"), Неопределено);
	Если ОбластьВставки = Неопределено Тогда
		
		ШаблонАкта = ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыАкта, ПрефиксШаблонаАкта + ДанныеРасшифровки.ШаблонАкта);
		Если ШаблонАкта = Неопределено Тогда
			ШаблонАкта = ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыАкта, "Акт" + ДанныеРасшифровки.ШаблонАкта);
			Если ШаблонАкта = Неопределено Тогда
				ШаблонАкта = ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыАкта, "Акт");
			КонецЕсли;
		КонецЕсли;
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаАкта, ШаблонАкта, Истина, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(ExcelApp);
		
		Если ОбщийАкт Тогда
			СтраницаАкта.Области.Вставить("Акт", ОбластьВставки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат	ОбластьВставки;
	
КонецФункции

&НаКлиенте
Функция ВывестиИнвестиционныйДоходExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СЧАНаНачалоГодаПоБалансу = Ложь, СЧАНаКонецПоБалансу = Ложь, ДвиженияАктивовПоБалансу = Ложь, ОбластьДвиженияАктивов = Неопределено)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"];
	
	РасчетВВалютеУчета = (ДанныеРасшифровки.ВалютаРасчета = ДанныеРасшифровки.ВалютаУчета);
	
	КорректироватьНаРазницуБалансаИРынка								= (РасшифровкаРасчетаПоБазе.Свойство("КорректироватьНаРазницуБалансаИРынка") И РасшифровкаРасчетаПоБазе.КорректироватьНаРазницуБалансаИРынка);
	УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод					= (РасшифровкаРасчетаПоБазе.Свойство("УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод") И РасшифровкаРасчетаПоБазе.УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод);
	УменьшатьНаСуммуВознагражденияЗаУправление							= (РасшифровкаРасчетаПоБазе.Свойство("УменьшатьНаСуммуВознагражденияЗаУправление") И РасшифровкаРасчетаПоБазе.УменьшатьНаСуммуВознагражденияЗаУправление);
	УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария	= (РасшифровкаРасчетаПоБазе.Свойство("УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария") И РасшифровкаРасчетаПоБазе.УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария);
	СкорректированныйИнвестиционныйДоход								= КорректироватьНаРазницуБалансаИРынка Или УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод Или УменьшатьНаСуммуВознагражденияЗаУправление Или УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария;
	
	КлиентФизЛицо = ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица")
		Или ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет");
		
	Если КлиентФизЛицо Тогда
		#Область Исключение_при_параметрах_не_реализованных_для_расшифровки_расчета_ИД_физлица
		
		ПараметрыИД = Новый Массив;
		
		Если КорректироватьНаРазницуБалансаИРынка Тогда
			ПараметрыИД.Добавить("КорректироватьНаРазницуБалансаИРынка");
		КонецЕсли;
		
		Если УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод Тогда
			ПараметрыИД.Добавить("УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод");
		КонецЕсли;
		
		Если УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария Тогда
			ПараметрыИД.Добавить("УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария");
		КонецЕсли;
		
		Если ПараметрыИД.Количество() > 0 Тогда
			ВызватьИсключение СтрШаблон("Обработка параметров ""%1"" при расчете ИД физ.лиц не реализована. Необходимо обратиться к разработчикам.", СтрСоединить(ПараметрыИД, """, """));
		КонецЕсли;
		
		#КонецОбласти
	КонецЕсли;
	
	// Получаем суффикс инвестиционного дохода
	#Область ОписаниеСуффиксаИнвестиционногоДохода
	// Суффикс состоит из частей. Каждая часть не обязательна, но их порядок сохраняется. Плюс означает возможность дополнения части суффикса.
	//	Суффикс является дополнением к полному названию области - "ИнвестиционныйДоход".
	//	Части суффикса:
	//		1. [ФизЛица] (только для клиентов физ. лиц)
	//		2. [Скорректированный] + [НаВознаграждениеЗаУправление]
	//		3. Только один из следующих суффиксов:
	//			- [Баланс] + [ХантыМансийский]
	//			- [Рынок]
	//			- [_СЧАНаКонецБаланс] + [ХантыМансийский]
	#КонецОбласти
	СуффиксИнвестиционногоДохода = "";
	
	Если КлиентФизЛицо Тогда
		СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "ФизЛица";
	КонецЕсли;
	
	Если СкорректированныйИнвестиционныйДоход Тогда
		СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "Скорректированный";
		
		Если УменьшатьНаСуммуВознагражденияЗаУправление Тогда
			СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "НаВознаграждениеЗаУправление";
		КонецЕсли;
	КонецЕсли;
	
	Если СЧАНаНачалоГодаПоБалансу И СЧАНаКонецПоБалансу И ДвиженияАктивовПоБалансу Тогда // Все по балансу
		СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "Баланс";
		Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ХантыМансийский") Тогда
			СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "ХантыМансийский";
		КонецЕсли;
	ИначеЕсли Не СЧАНаНачалоГодаПоБалансу И Не СЧАНаКонецПоБалансу И Не ДвиженияАктивовПоБалансу Тогда // Все по рынку
		СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "Рынок";
	ИначеЕсли СЧАНаКонецПоБалансу Тогда // Вразнобой (СЧАНаКонецПоБалансу)
		СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "_СЧАНаКонецБаланс";
		Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ХантыМансийский") Тогда
			СуффиксИнвестиционногоДохода = СуффиксИнвестиционногоДохода + "ХантыМансийский";
		КонецЕсли;
	КонецЕсли;
	
	СуффиксСЧАНаНачалоГода	= ?(СЧАНаНачалоГодаПоБалансу, "Баланс", "Рынок");
	СуффиксСЧАНаКонец		= ?(СЧАНаКонецПоБалансу, "Баланс", "Рынок");
	СуффиксДвиженияАктивов	= ?(ДвиженияАктивовПоБалансу, "Баланс", "Рынок");
	
	// Ищем среди ранее выведенных областей
	ОбластьРасчетИнвестДохода = СтраницаРасчета.Области.Получить("ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода);
	Если ОбластьРасчетИнвестДохода <> Неопределено Тогда
		Возврат Новый Структура("Суффикс, Область", СуффиксИнвестиционногоДохода, ОбластьРасчетИнвестДохода);
	КонецЕсли;
	
	Если РасчетВВалютеУчета Тогда
		// Ввод-вывод активов
		Если ОбластьДвиженияАктивов = Неопределено Тогда
			ОбластьДвиженияАктивов = ВывестиДвиженияАктивовExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксДвиженияАктивов, СуффиксСЧАНаНачалоГода);
		КонецЕсли;
		
		Если КорректироватьНаРазницуБалансаИРынка Тогда
			ВывестиДвиженияАктивовExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка,
				?(Не ДвиженияАктивовПоБалансу, "Баланс", "Рынок"), ?(Не СЧАНаНачалоГодаПоБалансу, "Баланс", "Рынок"));
		КонецЕсли;
			
		Если ДанныеРасшифровки.ШаблонРасшифровки = "СбербанкПР" Тогда
			ВывестиРасходыПоУправлению(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);
		КонецЕсли;
	Иначе
		// Ввод-вывод активов
		Если ОбластьДвиженияАктивов = Неопределено Тогда
			ОбластьДвиженияАктивов = ВывестиДвиженияАктивовСВалютойРасчетаExcel(
				ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксДвиженияАктивов, СуффиксСЧАНаНачалоГода);
		КонецЕсли;
		
		Если КорректироватьНаРазницуБалансаИРынка Тогда
			ВывестиДвиженияАктивовСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка,
				?(Не ДвиженияАктивовПоБалансу, "Баланс", "Рынок"), ?(Не СЧАНаНачалоГодаПоБалансу, "Баланс", "Рынок"));
		КонецЕсли;
		
		// Вознаграждение, удержанное ранее
		ВывестиУплаченноеВознаграждениеСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);
		
		// Уплаченный НДФЛ
		Если КлиентФизЛицо Тогда
			ВывестиУплаченныйНДФЛСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);
		КонецЕсли;
	КонецЕсли;
	
	// Расходы по договору со спецдепозитарием
	Если УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария Тогда
		ВывестиРасходыПоДоговоруСоСпецдепозитарием(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);
	КонецЕсли;
	
	// Расчет инвестиционного дохода
	ШаблонРасчетИнвестДохода = ПолучитьИменованныйДиапазонExcel(ШаблонСтраницыРасчета, "ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода);
	Если ШаблонРасчетИнвестДохода = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Область '%1' не найдена. Необходимо обратиться к разработчикам.", "ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода);
	КонецЕсли;
	ОбластьРасчетИнвестДохода = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонРасчетИнвестДохода, Ложь, Ложь);
	
	Если СкорректированныйИнвестиционныйДоход Тогда
		#Область Заполняем_разницу_баланса_и_рынка_вводов_выводов_активов
		
		Если КорректироватьНаРазницуБалансаИРынка Тогда
			// При расчёте корректировки для старых договоров из вводов нужно убрать первую строку, т.к. там СЧА на начало года
			ДвиженияАктивовРынок	= ?(ДвиженияАктивовПоБалансу, СтраницаРасчета.Области["ДвиженияАктивовРынок"], ОбластьДвиженияАктивов);
			ДвиженияАктивовБаланс	= ?(ДвиженияАктивовПоБалансу, ОбластьДвиженияАктивов, СтраницаРасчета.Области["ДвиженияАктивовБаланс"]);
			
			ФормулаРазницыСтоимостиВводовВыводовАктивовПоБалансуИРынку =
				"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводовБаланс"].Address(Ложь, Ложь)
					+ ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, "-" + СтраницаРасчета.Страница.Cells(
						ДвиженияАктивовБаланс.НачальнаяСтрока, ДвиженияАктивовБаланс.КолонкаСуммаВвода).Address(Ложь, Ложь), "")
					+ "-" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводовРынок"].Address(Ложь, Ложь)
					+ ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, "+" + СтраницаРасчета.Страница.Cells(
						ДвиженияАктивовРынок.НачальнаяСтрока, ДвиженияАктивовРынок.КолонкаСуммаВвода).Address(Ложь, Ложь), "")
					+ "-" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводовБаланс"].Address(Ложь, Ложь)
					+ "+" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводовРынок"].Address(Ложь, Ложь);
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"РазницаСтоимостиВводовВыводовАктивовПоБалансуИРынку",
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетИнвестДохода, "РазницаСтоимостиВводовВыводовАктивовПоБалансуИРынку"));
			СтраницаРасчета.КлючевыеЯчейки["РазницаСтоимостиВводовВыводовАктивовПоБалансуИРынку"].FormulaLocal = ФормулаРазницыСтоимостиВводовВыводовАктивовПоБалансуИРынку;
		Иначе
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетИнвестДохода,
				"РазницаСтоимостиВводовВыводовАктивовПоБалансуИРынку",
				"<Не учитывается>");
		КонецЕсли;
		
		#КонецОбласти
		
		#Область Заполняем_сумму_убытка_за_предыдущий_отчетный_период
		
		Если УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод Тогда
			ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод =
				?(РасшифровкаРасчетаПоБазе.СуммаУбыткаЗаПредыдущийГод = NULL, "=НД()", РасшифровкаРасчетаПоБазе.СуммаУбыткаЗаПредыдущийГод);
			
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"СуммаУбыткаЗаПредыдущийОтчетныйПериод",
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетИнвестДохода, "СуммаУбыткаЗаПредыдущийОтчетныйПериод"));
			СтраницаРасчета.КлючевыеЯчейки["СуммаУбыткаЗаПредыдущийОтчетныйПериод"].FormulaLocal = ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод;
		Иначе
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетИнвестДохода,
				"СуммаУбыткаЗаПредыдущийОтчетныйПериод",
				"<Не учитывается>");
		КонецЕсли;
		
		#КонецОбласти
		
		#Область Заполняем_сумму_вознаграждения_за_управление
		
		Если УменьшатьНаСуммуВознагражденияЗаУправление Тогда
			Если СтраницаРасчета.КлючевыеЯчейки["СуммаВознагражденияЗаУправление"] = Неопределено Тогда
				ФормулаСуммыВознагражденийЗаУправление = ФормулаСуммыРассчитанныхВознагражденийЗаУправление(Расшифровка, ДанныеРасшифровки);
				
				Если ПустаяСтрока(ФормулаСуммыВознагражденийЗаУправление) Тогда
					ФормулаСуммыВознаграждений = "НД()";
				КонецЕсли;
				
				СтраницаРасчета.КлючевыеЯчейки.Вставить(
					"СуммаВознагражденияЗаУправление",
					РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетИнвестДохода, "ВознаграждениеЗаУправление"));
				СтраницаРасчета.КлючевыеЯчейки["СуммаВознагражденияЗаУправление"].FormulaLocal = "=" + ФормулаСуммыВознагражденийЗаУправление;
			Иначе
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
					ОбластьРасчетИнвестДохода,
					"ВознаграждениеЗаУправление",
					"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВознагражденияЗаУправление"].Address(Ложь, Ложь));
			КонецЕсли;
		Иначе
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьРасчетИнвестДохода, "ВознаграждениеЗаУправление", "<Не учитывается>");
		КонецЕсли;
		
		#КонецОбласти
		
		#Область Заполняем_сумму_расходов_по_договору_со_спецдепозитарием
		
		Если УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария Тогда
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетИнвестДохода,
				"РасходыПоДоговоруСоСпецдепозитарием",
				"=" + СтраницаРасчета.КлючевыеЯчейки["РасходыПоДоговоруСоСпецдепозитариемВВалютеРасчета"].Address(Ложь, Ложь));
		Иначе
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетИнвестДохода,
				"РасходыПоДоговоруСоСпецдепозитарием",
				"<Не учитывается>");
		КонецЕсли;
		
		#КонецОбласти
		
		ЯчейкаИДДоКорректировки	= СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, ?(КлиентФизЛицо, "H", "G"));
		ЯчейкаИД				= СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, ?(КлиентФизЛицо, "J", "L"));
		
		СтраницаРасчета.КлючевыеЯчейки.Вставить("ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода + "_ДоКорректировки", ЯчейкаИДДоКорректировки);
		СтраницаРасчета.КлючевыеЯчейки.Вставить("ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода, ЯчейкаИД);
		
	Иначе
		// Поиск ячейки с формулой инвестиционного дохода
		КодНачальногоСимвола = КодСимвола("G");
		КодКонечногоСимвола = КодСимвола("Z");
		КодТекущегоСимвола = КодНачальногоСимвола;
		Пока КодТекущегоСимвола <= КодКонечногоСимвола Цикл
			ТекстЗаголовкаТаблицы = СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок - 1, Символ(КодТекущегоСимвола)).Text;
			Если СтрНачинаетсяС(ТекстЗаголовкаТаблицы, "Расходы ФОНДА") Тогда
				СтраницаРасчета.КлючевыеЯчейки.Вставить("РасходыФонда",
					СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, Символ(КодТекущегоСимвола)));
			ИначеЕсли СтрНачинаетсяС(ТекстЗаголовкаТаблицы, "Инвестиционный доход") Тогда
				Прервать;
			КонецЕсли;
			КодТекущегоСимвола = КодТекущегоСимвола + 1;
		КонецЦикла;
		Если КодТекущегоСимвола > КодКонечногоСимвола Тогда
			ВызватьИсключение "Не найдена ячейка с формулой инвестиционного дохода в шаблоне Excel.";
		КонецЕсли;
		СтраницаРасчета.КлючевыеЯчейки.Вставить("ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода,
			СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, Символ(КодТекущегоСимвола)));
	КонецЕсли;
	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("СЧАНаКонец" + СуффиксСЧАНаКонец, РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетИнвестДохода, "СЧА"));
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
		ОбластьРасчетИнвестДохода, "СЧА",
		Формат(РасшифровкаРасчетаПоБазе.СЧАНаКонец, "ЧДЦ=2; ЧРД=,; ЧГ="));
	
	Если СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода] = Неопределено Тогда
		СтраницаРасчета.КлючевыеЯчейки.Вставить(
			"СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода,
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетИнвестДохода, "СЧАНаНачалоГода"));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьРасчетИнвестДохода,
			"СЧАНаНачалоГода",
			?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, Формат(РасшифровкаРасчетаПоБазе.СЧАНаНачалоГода, "ЧДЦ=2; ЧРД=,; ЧГ="), ""));
	Иначе
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьРасчетИнвестДохода,
			"СЧАНаНачалоГода",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь));
	КонецЕсли;
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
		ОбластьРасчетИнвестДохода,
		"СуммаВводов",
		"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь));
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
		ОбластьРасчетИнвестДохода,
		"СуммаВыводов",
		"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь));
	
	Если СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"] = Неопределено Тогда
		СтраницаРасчета.КлючевыеЯчейки.Вставить(
			"ВознаграждениеУплаченное",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетИнвестДохода, "ВознаграждениеУплаченное"));
		// Вознаграждение по данным бухгалтерии не участвует в расчете, в этом случае обнуляем параметр
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьРасчетИнвестДохода,
			"ВознаграждениеУплаченное",
			Формат(?(ДанныеРасшифровки.ИспользоватьВознаграждениеИзБухгалтерскойБазы, 0, ДанныеРасшифровки.ВознаграждениеУплаченноеСНачалаГода), "ЧДЦ=2; ЧРД=,; ЧГ="));
		Если ДанныеРасшифровки.РанееУдержанноеВознаграждениеБУ <> Неопределено Тогда
			ДанныеРасшифровки.Вставить("РанееУдержанноеВознаграждениеБУИспользованоВРасчете", Истина);
		КонецЕсли;
	Иначе
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьРасчетИнвестДохода,
			"ВознаграждениеУплаченное",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь));
	КонецЕсли;
	
	Если КлиентФизЛицо Тогда
		Если СтраницаРасчета.КлючевыеЯчейки["УплаченныйНДФЛ"] = Неопределено Тогда
			СтраницаРасчета.КлючевыеЯчейки.Вставить(
				"УплаченныйНДФЛ",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьРасчетИнвестДохода, "НДФЛУплаченный"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетИнвестДохода,
				"НДФЛУплаченный",
				Формат(РасшифровкаРасчетаПоБазе.НДФЛУплаченныйСНачалаГода, "ЧДЦ=2; ЧРД=,; ЧГ="));
		Иначе
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьРасчетИнвестДохода,
				"НДФЛУплаченный",
				"=" + СтраницаРасчета.КлючевыеЯчейки["УплаченныйНДФЛ"].Address(Ложь, Ложь));
		КонецЕсли;
	КонецЕсли;
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	// Выводим расчет дохода на титульную страницу
	
	ТитульнаяСтраница		= Расшифровка.Результат.ПараметрыЛистов["Титульная страница"];
	ШаблонТитульнойСтраницы	= Расшифровка.Шаблон.ПараметрыЛистов["Титульная страница"];
	
	Если ДанныеРасшифровки.ШаблонРасшифровки = "Благосостояние" Тогда
		
		#Область Благосостояние
		
		ШаблонСтрокаРасшифровки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "СтрокаРасшифровкиПараметраБлагосостояние");
		
		// СЧА на начало
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП1");
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки,
			"ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
		
		// Вводы
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП2");
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
			ОбластьВставки,
			"ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина)
				+ "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
			
		НомерПараметра = 0;
		
		НачальнаяСтрокаДвиженияАктивов = ОбластьДвиженияАктивов.НачальнаяСтрока;
		Если ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода Тогда
			НачальнаяСтрокаДвиженияАктивов = НачальнаяСтрокаДвиженияАктивов + 1;
		КонецЕсли;
		
		Пока НачальнаяСтрокаДвиженияАктивов <= ОбластьДвиженияАктивов.КонечнаяСтрока Цикл
			
			НомерПараметра = НомерПараметра + 1;
			
			ЯчейкаДатаВвода = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДатаВвода);
			Если ПустаяСтрока(ЯчейкаДатаВвода.Value2) Тогда
				Прервать;
			КонецЕсли;
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонСтрокаРасшифровки, Ложь, Ложь);
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки,
				"НомерПараметра",
				"S" + Формат(НомерПараметра, "ЧГ="));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки,
				"Параметр",
				"=" + ЯчейкаДатаВвода.Address(Ложь, Ложь, , Истина));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(
				ОбластьВставки,
				"ЗначениеПараметра",
				"=" + СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВвода).Address(Ложь, Ложь, , Истина));
			
			НачальнаяСтрокаДвиженияАктивов = НачальнаяСтрокаДвиженияАктивов + 1;
		КонецЦикла;
		
		// Выводы
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП3");
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина));
		
		ШаблонОбласти = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "СтрокаРасшифровкиПараметраБлагосостояние");
		
		НомерПараметра					= 0;
		НачальнаяСтрокаДвиженияАктивов	= ОбластьДвиженияАктивов.НачальнаяСтрока;
		
		Пока НачальнаяСтрокаДвиженияАктивов <= ОбластьДвиженияАктивов.КонечнаяСтрока Цикл
			
			НомерПараметра = НомерПараметра + 1;
			
			ЯчейкаДатаВывода = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДатаВывода);
			Если ПустаяСтрока(ЯчейкаДатаВывода.Value2) Тогда
				Прервать;
			КонецЕсли;
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НомерПараметра",
					"S" + Формат(НомерПараметра, "ЧГ="));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Параметр",
					"=" + ЯчейкаДатаВывода.Address(Ложь, Ложь, , Истина));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
					"=" + СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВывода).Address(Ложь, Ложь, , Истина));

			НачальнаяСтрокаДвиженияАктивов = НачальнаяСтрокаДвиженияАктивов + 1;
			
		КонецЦикла;
		
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП4");
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра", "0");
		
		// Вводы за минусом выводов
		
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП5");
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина));
			
		// СЧА на конец
			
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП6");
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина));
		
		// Доход
		
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаБлагосостояниеП7");
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
		
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "СбербанкПН" Тогда
		
		#Область Сбербанк_ПН

		ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПН_П1", ШаблонТитульнойСтраницы);
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра", "=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));			
		
		#КонецОбласти
		
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "СбербанкПР" Тогда
		
		#Область Сбербанк_ПР
		
		ПолеИнвестиционныйДоходДоКорректировки = ?(СкорректированныйИнвестиционныйДоход, "ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода + "_ДоКорректировки", "ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода);

		// ИД до корректировки + расходы по управлению
		
		ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПР_П1", ШаблонТитульнойСтраницы);
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки[ПолеИнвестиционныйДоходДоКорректировки].Address(Ложь, Ложь, , Истина)
			+ "+" + СтраницаРасчета.КлючевыеЯчейки["РасходыПоУправлениюНачисленоВВалютеУчета"].Address(Ложь, Ложь, , Истина));
		
		// ИД до корректировки - ранее уплаченное вознаграждение 
		
		ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПР_П2", ШаблонТитульнойСтраницы);
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки[ПолеИнвестиционныйДоходДоКорректировки].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь, , Истина));
			
		// ИД после корректировки - ранее уплаченное вознаграждение	
			
		ШаблонПараметр = ДобавитьШаблонОбластиСтраницыExcel("ПараметрСбербанкПР_П3", ШаблонТитульнойСтраницы);
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПараметр);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПараметра",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь, , Истина));

		#КонецОбласти
		
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "ФизЛицо" Тогда
		
		#Область Физическое_лицо
		
		ШаблонГруппаПоказателей	= ШаблонТитульнойСтраницы.Области["ГруппаПоказателей" + ДанныеРасшифровки.ШаблонРасшифровки];
		ШаблонПоказатель		= ШаблонТитульнойСтраницы.Области["Показатель" + ДанныеРасшифровки.ШаблонРасшифровки];
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ГруппаПоказателей",
			СтрШаблон("%1. Расчет дохода учредителя управления на отчетную дату", ДанныеРасшифровки.БазыРасчета.Найти(РасшифровкаРасчетаПоБазе) + 1));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя", ?(РасчетВВалютеУчета, "в рублях РФ", "=ПредставлениеВалютыРасчета"));
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Оценочная стоимость имущества на начало отчетного периода");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Оценочная стоимость имущества, переданного в управление");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина) + "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Оценочная стоимость имущества, выведенного из управления");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина));
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Удержанный НДФЛ");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["УплаченныйНДФЛ"].Address(Ложь, Ложь, , Истина));

		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Оценочная стоимость имущества");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина));
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Инвестиционный доход");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
		
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Сургутнефтегаз") Тогда
		
		#Область Сургутнефтегаз
		
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧАНаНачалоГода",	"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧА",				"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
		
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "Национальный") Тогда
		
		#Область Национальный
		
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		#КонецОбласти
		
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "2023"
		Или ДанныеРасшифровки.ШаблонРасшифровки = "2024"
	Тогда
		#Область Стандартный_2023_2024
		
		ВывестиДвиженияАктивовНаТитульнуюСтраницу(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, ОбластьДвиженияАктивов);
		
		// Инвестиционный доход
		ШаблонОбласти = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(ШаблонТитульнойСтраницы, "ИнвестиционныйДоход<Год>", ДанныеРасшифровки.ШаблонРасшифровки);
		
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
		
		Если СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец] = Неопределено Тогда
			АдресЯчейкиСЧА = "";
		Иначе
			АдресЯчейкиСЧА = СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина);
		КонецЕсли;
		
		Если ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода Тогда
			Если СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода] = Неопределено Тогда
				СтраницаРасчета.КлючевыеЯчейки.Вставить("СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода, СтраницаРасчета.Страница.Cells(ОбластьДвиженияАктивов.НачальнаяСтрока, ОбластьДвиженияАктивов.КолонкаСуммаВвода));
			КонецЕсли;
			АдресЯчейкиСЧАНаНачалоГода = СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина);
		Иначе
			АдресЯчейкиСЧАНаНачалоГода = "";
		КонецЕсли;
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СЧА", ?(ПустаяСтрока(АдресЯчейкиСЧА), "", "=" + АдресЯчейкиСЧА));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СЧАНаНачалоГода", ?(ПустаяСтрока(АдресЯчейкиСЧАНаНачалоГода), "", "=" + АдресЯчейкиСЧАНаНачалоГода));
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВводов",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
			
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВыводов",			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВознаграждениеУплаченное","=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь, , Истина));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ИнвестиционныйДоход",		"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
	ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "ППА" Тогда
		#Область ППА
		
		ВывестиДвиженияАктивовНаТитульнуюСтраницу(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, ОбластьДвиженияАктивов);
		
		// Инвестиционный доход
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		Если СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец] = Неопределено Тогда
			ФормулаСуммыСЧА = "";
		Иначе
			ФормулаСуммыСЧА = "=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина);
		КонецЕсли;
		
		ФормулаСуммыВводовЗаМинусомВыводов =
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина);
			
		Если СкорректированныйИнвестиционныйДоход Тогда
			ФормулаСуммыИнвестиционногоДохода = "=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода + "_ДоКорректировки"].Address(Ложь, Ложь, , Истина);
		Иначе
			ФормулаСуммыИнвестиционногоДохода = "=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина);
		КонецЕсли;
		
		Если УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод Тогда
			ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод = "=" + СтраницаРасчета.КлючевыеЯчейки["СуммаУбыткаЗаПредыдущийОтчетныйПериод"].Address(Ложь, Ложь, , Истина);
		Иначе
			ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод = "";
		КонецЕсли;
			
		ВидыЗадолженностиНеобходимыхРасходовСпецдепозитария = Новый Массив;
		ВидыЗадолженностиНеобходимыхРасходовСпецдепозитария.Добавить(ПредопределенноеЗначение("Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария"));
		
		ВидыЗадолженностиУслугСпецдепозитария = Новый Массив;
		ВидыЗадолженностиУслугСпецдепозитария.Добавить(ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария"));
		ВидыЗадолженностиУслугСпецдепозитария.Добавить(ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария"));
		
		Если УменьшатьНаСуммуНеобходимыхРасходовИСтоимостьУслугСпецдепозитария Тогда
			ФормулаСтоимостиУслугСпецдепозитария			= ФормулаСуммРасходовПоДоговоруСоСпецдепозитарием(Расшифровка, ВидыЗадолженностиНеобходимыхРасходовСпецдепозитария, Истина);
			ФормулаСуммыНеобходимыхРасходыСпецдепозитария	= ФормулаСуммРасходовПоДоговоруСоСпецдепозитарием(Расшифровка, ВидыЗадолженностиУслугСпецдепозитария, Истина);
		Иначе
			ФормулаСтоимостиУслугСпецдепозитария			= "";
			ФормулаСуммыНеобходимыхРасходыСпецдепозитария	= "";
		КонецЕсли;
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧА",									ФормулаСуммыСЧА);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаВводовЗаМинусомВыводов",			ФормулаСуммыВводовЗаМинусомВыводов);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоходДоКорректировки",		ФормулаСуммыИнвестиционногоДохода);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаУбыткаЗаПредыдущийОтчетныйПериод",	ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СтоимостьУслугСпецдепозитария",			?(ПустаяСтрока(ФормулаСтоимостиУслугСпецдепозитария), "", "=" + ФормулаСтоимостиУслугСпецдепозитария));
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "НеобходимыеРасходыСпецдепозитария",		?(ПустаяСтрока(ФормулаСуммыНеобходимыхРасходыСпецдепозитария), "", "=" + ФормулаСуммыНеобходимыхРасходыСпецдепозитария));		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",					"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));
		
		#КонецОбласти
				
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ХантыМансийский") Тогда
				
		#Область Ханты_Мансийский
		
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		ФормулаСуммыВводовБезСЧА =
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина);
			
		Если УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод Тогда
			ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод = "=" + СтраницаРасчета.КлючевыеЯчейки["СуммаУбыткаЗаПредыдущийОтчетныйПериод"].Address(Ложь, Ложь, , Истина);
		Иначе
			ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод = "";
		КонецЕсли;
		
		// Инвестиционный доход
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));
		// Сумма убытка за предыдущий отчётный период
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаУбыткаЗаПредыдущийОтчетныйПериод",
			ФормулаСуммыУбыткаЗаПредыдущийОтчетныйПериод);
		// Начало базового периода
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "НачалоБазовогоПериода",
			Формат(ДанныеРасшифровки.НачалоБазовогоПериодаДляОтображения, "ДФ=dd.MM.yyyy"), Истина);
		// СЧА на начало года
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧАНаНачалоГода",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
		// СЧА
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧА",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина));
		// Сумма выводов
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаВыводов",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина));
		// Сумма вводов
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаВводов", ФормулаСуммыВводовБезСЧА);
		// Расходы фонда
		Если СтраницаРасчета.КлючевыеЯчейки["РасходыФонда"] <> Неопределено Тогда
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "РасходыФонда",
				"=" + СтраницаРасчета.КлючевыеЯчейки["РасходыФонда"].Address(Ложь, Ложь, , Истина));
		КонецЕсли;
		#КонецОбласти
		
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонРасшифровки, "ЦКМГПУ") Тогда
				
		#Область ЦКМГПУ
		
		ОбластьТело = ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка);
		
		ФормулаСуммыВводовБезСЧА =
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина)
			+ "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина);
			
		// Инвестиционный доход
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "ИнвестиционныйДоход",
			"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));
		// СЧА на начало года
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧАНаНачалоГода",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));
		// СЧА
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СЧА",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина));
		// Сумма выводов
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаВыводов",
			"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина));
		// Сумма вводов
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "СуммаВводов", ФормулаСуммыВводовБезСЧА);
		
		КоличествоДнейПериодаРасчета = 
			(НачалоДня(ДанныеРасшифровки.КонецРасчетногоПериода) - НачалоДня(ДанныеРасшифровки.НачалоРасчетногоПериода)) / (60 * 60 * 24) 
			+ ?(ДанныеРасшифровки.ДоговорЗаключенДоТекущегоГода, 1, 0);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьТело, "КоличествоДнейПериодаРасчета", КоличествоДнейПериодаРасчета);
		
		#КонецОбласти
		
	Иначе
		
		#Область По_умолчанию
		
		ПрефиксСЧАНаНачалоГода	= ?(СЧАНаНачалоГодаПоБалансу, "Балансовая стоимость имущества", "Рыночная стоимость имущества");
		ПрефиксСЧАНаКонец		= ?(СЧАНаКонецПоБалансу, "Балансовая стоимость имущества", "Рыночная стоимость имущества");
		ПрефиксДвиженияАктивов	= ?(ДвиженияАктивовПоБалансу, "Балансовая стоимость имущества", "Рыночная стоимость имущества");
		
		ШаблонГруппаПоказателей	= ШаблонТитульнойСтраницы.Области["ГруппаПоказателей"];
		ШаблонПоказатель		= ШаблонТитульнойСтраницы.Области["Показатель"];
		
		Если ШаблонГруппаПоказателей <> Неопределено Тогда
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонГруппаПоказателей, Ложь, Ложь);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ГруппаПоказателей",
				?(РасчетВВалютеУчета, "Расчет дохода учредителя управления", "= ""Расчет дохода учредителя управления "" & ПредставлениеВалютыРасчета"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя", "");
		КонецЕсли;
		
		Если ШаблонПоказатель <> Неопределено Тогда
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			ПрефиксСЧАНаНачалоГода + " на " + Формат(НачалоГода(ДанныеРасшифровки.НачалоРасчетногоПериода), "ДФ='dd.MM.yyyy ''г.'''"));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));			
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			ПрефиксДвиженияАктивов + ", принятого в управление");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина) + "-" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода].Address(Ложь, Ложь, , Истина));			
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			ПрефиксДвиженияАктивов + ", выведенного из управления");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + СуффиксДвиженияАктивов].Address(Ложь, Ложь, , Истина));			
					
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			ПрефиксСЧАНаКонец + " на расчетную дату");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонец" + СуффиксСЧАНаКонец].Address(Ложь, Ложь, , Истина));			
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Вознаграждение управляющего, удержанное ранее");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь, , Истина));			
			
			Если КорректироватьНаРазницуБалансаИРынка Тогда
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Разница м/у балансовой и рыночной стоимостью принятых / выведенных активов");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["РазницаСтоимостиВводовВыводовАктивовПоБалансуИРынку"].Address(Ложь, Ложь, , Истина));			
			КонецЕсли;
			
			Если УменьшатьНаСуммуУбыткаЗаПредыдущийОтчетныйПериод Тогда
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Сумма убытка за предыдущий отчетный период");
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаУбыткаЗаПредыдущийОтчетныйПериод"].Address(Ложь, Ложь, , Истина));			
			КонецЕсли;
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель, Ложь, Ложь);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Инвестиционный доход");
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода].Address(Ложь, Ложь, , Истина));
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	СтраницаРасчета.Области.Вставить("ИнвестиционныйДоход" + СуффиксИнвестиционногоДохода, ОбластьРасчетИнвестДохода);
	
	Возврат Новый Структура("Суффикс, Область", СуффиксИнвестиционногоДохода, ОбластьРасчетИнвестДохода);
КонецФункции

&НаКлиенте
Функция ВывестиДвиженияАктивовExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей, СуффиксСЧАНаНачалоГода, РасчетДнейДоДвиженияОтНачалаПериода = Ложь)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"].Страница;
	
	// Ищем среди ранее выведенных областей
	
	НаименованиеОбласти = "ДвиженияАктивов" + СуффиксПоказателей + ?(РасчетДнейДоДвиженияОтНачалаПериода, "_РасчетДнейДоДвиженияОтНачалаПериода", "");
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Области.Получить(НаименованиеОбласти);
	Если ОбластьДвиженияАктивов <> Неопределено Тогда
		Возврат ОбластьДвиженияАктивов;
	КонецЕсли;
		
	ШаблонШапкиВводВыводАктивов		= ШаблонСтраницыРасчета.Range("ШапкаВводВыводАктивов");	
	ШаблонСтрокиВводВыводАктивов	= ШаблонСтраницыРасчета.Range("СтрокаВводВыводАктивов");	
	ШаблонИтогВводВыводАктивов		= ШаблонСтраницыРасчета.Range("ИтогВводВыводАктивов");	

	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапкиВводВыводАктивов, Ложь, Ложь);  	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "БалансРынок", ?(СуффиксПоказателей = "Рынок", "(по рын. стоимости)", "(по бал. стоимости)"), Истина);  
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ОтНачалаПериодаИлиДоОкончания", ?(РасчетДнейДоДвиженияОтНачалаПериода, "от начала периода", "до окончания"), Истина);  
	
	// Объединяем данные

	ВводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(СуффиксПоказателей = "Рынок", "", СуффиксПоказателей)];
	ВыводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"];

	ВводыАктивовВсего	= ВводыАктивов.Количество();
	ВыводыАктивовВсего	= ВыводыАктивов.Количество();
	БудетСтрок			= Макс(ВводыАктивовВсего, ВыводыАктивовВсего);
	БудетКолонок		= 6;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
	ЕстьСЧАНаНачалоГода	= Ложь;

	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		Если НомерСтроки < ВводыАктивовВсего Тогда
			МассивДанных[0][НомерСтроки] = ВводыАктивов[НомерСтроки]["Период"];
			МассивДанных[1][НомерСтроки] = ?(ВводыАктивов[НомерСтроки]["СуммаВВалютеРасчета"] = NULL, "=НД()", ВводыАктивов[НомерСтроки]["СуммаВВалютеРасчета"]);
			Если ВводыАктивов[НомерСтроки]["СЧАНаНачалоГода"] Тогда 
				ЕстьСЧАНаНачалоГода = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НомерСтроки < ВыводыАктивовВсего Тогда
			МассивДанных[3][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Период"];
			МассивДанных[4][НомерСтроки] = ВыводыАктивов[НомерСтроки]["СуммаВВалютеРасчета" + СуффиксПоказателей];
		КонецЕсли;
	КонецЦикла;

	// Подготоваливаем строки и выводим данные

	НачальнаяСтрокаДвиженияАктивов				 = СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтрокиДвиженияАктивов					 = ШаблонСтрокиВводВыводАктивов.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтрокиВводВыводАктивов, Ложь, Ложь, ВысотаСтрокиДвиженияАктивов);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтрокиДвиженияАктивов, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрокаДвиженияАктивов = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДвиженияАктивов = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B", КонечнаяСтрокаДвиженияАктивов, "G"));
	ОбластьДвиженияАктивов.FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДвиженияАктивов.Rows.Group();

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогВводВыводАктивов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, 2).Value2		= Формат(КонецДня(ДанныеРасшифровки.КонецРасчетногоПериода) + 1, "ДФ=dd.MM.yyyy"); // НачалоСледующегоПериода
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, 3).FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, 3, КонечнаяСтрокаДвиженияАктивов, 3) + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, 6).FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, 6, КонечнаяСтрокаДвиженияАктивов, 6) + ")";	

	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, 3));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, 6));	

	Если ЕстьСЧАНаНачалоГода Тогда
		СтраницаРасчета.КлючевыеЯчейки.Вставить("СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода, СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, 3));
	КонецЕсли;

	// Заполняем формулы

	Если РасчетДнейДоДвиженияОтНачалаПериода Тогда
		ФормулаДнейДоВвода	= СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%1-НачалоПериодаРасчета)", РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, 2));
		ФормулаДнейДоВывода	= СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%1-НачалоПериодаРасчета)", РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, 5));
	Иначе
		ФормулаДнейДоВвода	= СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)", РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, 2), РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, 2, Истина, Истина));
		ФормулаДнейДоВывода	= СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)", РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, 5), РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, 2, Истина, Истина));
	КонецЕсли;
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, 4);
	ОбластьЭталон.FormulaLocal = ФормулаДнейДоВвода;
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, 4, КонечнаяСтрокаДвиженияАктивов, 4)), ОбластьЭталон);	
	КонецЕсли;	
		
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, 7);
	ОбластьЭталон.FormulaLocal = ФормулаДнейДоВывода;
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, 7, КонечнаяСтрокаДвиженияАктивов, 7)), ОбластьЭталон);
	КонецЕсли;	

	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;			

	ОбластьДвиженияАктивов = Новый Структура;
	ОбластьДвиженияАктивов.Вставить("СуффиксПоказателей",				СуффиксПоказателей);
	ОбластьДвиженияАктивов.Вставить("СуффиксСЧАНаНачалоГода",			СуффиксСЧАНаНачалоГода);
	ОбластьДвиженияАктивов.Вставить("НачальнаяСтрока",					НачальнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КонечнаяСтрока",					КонечнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("ВысотаСтроки",						ВысотаСтрокиДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВвода",					"B");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВвода",				"C");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВвода",				"D");
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВывода",				"E");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВывода",				"F");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВывода",				"G");	

	СтраницаРасчета.Области.Вставить(НаименованиеОбласти, ОбластьДвиженияАктивов);

	Возврат ОбластьДвиженияАктивов; 	
		
КонецФункции

&НаКлиенте
Функция ВывестиДвиженияАктивовСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей, СуффиксСЧАНаНачалоГода)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"];
	
	// Ищем среди ранее выведенных областей
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Области.Получить("ДвиженияАктивов" + СуффиксПоказателей);
	Если ОбластьДвиженияАктивов <> Неопределено Тогда
		Возврат ОбластьДвиженияАктивов;
	КонецЕсли;
	
	// Курсы валют
	
	СтраницаКурсовВалют = ВывестиКурсыВалютExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);	
	
	// Область шапки
	
	ШаблонШапкиВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ШапкаВводВыводАктивовВалютный");	
	ШаблонСтрокиВводВыводАктивов	= ШаблонСтраницыРасчета.Страница.Range("СтрокаВводВыводАктивовВалютный");	
	ШаблонИтогВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ИтогВводВыводАктивовВалютный");	

	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапкиВводВыводАктивов, Ложь, Ложь);  	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "БалансРынок", ?(СуффиксПоказателей = "Рынок", "(по рын. стоимости)", "(по бал. стоимости)"), Истина);  
	
	// Подготавливаем данные

	ВводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(СуффиксПоказателей = "Рынок", "", СуффиксПоказателей)];
	ВыводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"];

	ВводыАктивовВсего		= ВводыАктивов.Количество();
	ВыводыАктивовВсего		= ВыводыАктивов.Количество();
	БудетСтрок				= Макс(ВводыАктивовВсего, ВыводыАктивовВсего);
	БудетКолонок			= 10;
	МассивДанных			= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
	ЕстьСЧАНаНачалоГода		= Ложь;
	
	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		Если НомерСтроки < ВводыАктивовВсего Тогда
			МассивДанных[0][НомерСтроки] = ВводыАктивов[НомерСтроки]["Период"];
			МассивДанных[1][НомерСтроки] = ВводыАктивов[НомерСтроки]["Сумма"];
			МассивДанных[2][НомерСтроки] = Строка(ВводыАктивов[НомерСтроки]["Валюта"]);
			Если ВводыАктивов[НомерСтроки]["СЧАНаНачалоГода"] Тогда 
				ЕстьСЧАНаНачалоГода = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НомерСтроки < ВыводыАктивовВсего Тогда
			МассивДанных[5][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Период"];
			МассивДанных[6][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Сумма" + СуффиксПоказателей];
			МассивДанных[7][НомерСтроки] = Строка(ВыводыАктивов[НомерСтроки]["Валюта"]);
		КонецЕсли;
	КонецЦикла;

	// Подготоваливаем строки и выводим данные

	НачальнаяСтрокаДвиженияАктивов	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтрокиДвиженияАктивов		= ШаблонСтрокиВводВыводАктивов.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтрокиВводВыводАктивов, Ложь, Ложь, ВысотаСтрокиДвиженияАктивов);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтрокиДвиженияАктивов, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрокаДвиженияАктивов = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДвиженияАктивов = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B", КонечнаяСтрокаДвиженияАктивов, "K"));
	ОбластьДвиженияАктивов.Value2 = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДвиженияАктивов.Rows.Group();
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогВводВыводАктивов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "B").Value2			= Формат(КонецДня(ДанныеРасшифровки.КонецРасчетногоПериода) + 1, "ДФ=dd.MM.yyyy"); // НачалоСледующегоПериода
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E", КонечнаяСтрокаДвиженияАктивов, "E") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "J").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "J", КонечнаяСтрокаДвиженияАктивов, "J") + ")";

	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "J"));

	// Сумма ввода в валюте расчета	
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "E");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);""""; %2 * ЕСЛИ(%3=ВалютаРасчета;1; ЕСЛИ(%3=""RUB"";1;ВПР(%3 & %1;%4;2;ЛОЖЬ)) / ЕСЛИ(ВалютаРасчета=""RUB"";1;ВПР(ВалютаРасчета & %1;%4;2;ЛОЖЬ))))", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
		СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E", КонечнаяСтрокаДвиженияАктивов, "E")),
			ОбластьЭталон);	
	КонецЕсли;		
	
	Если ЕстьСЧАНаНачалоГода Тогда
		
		Если СуффиксСЧАНаНачалоГода = "Рынок" Тогда // Дата расчета СЧА по рыночной стоимости отличается от даты ввода
			ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);НД(); %2 * ЕСЛИ(%3=ВалютаРасчета;1; ЕСЛИ(%3=""RUB"";1;ВПР(%3 & %1;%4;2;ЛОЖЬ)) / ЕСЛИ(ВалютаРасчета=""RUB"";1;ВПР(ВалютаРасчета & %1;%4;2;ЛОЖЬ))))", 
				"ДатаРасчетаСЧАНаНачалоГода",
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
				СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина));
		КонецЕсли;
		
		СтраницаРасчета.КлючевыеЯчейки.Вставить("СЧАНаНачалоГода" + СуффиксСЧАНаНачалоГода, ОбластьЭталон);	
		
	КонецЕсли;
	
	// Дней от ввода до расчета
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "F");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F", КонечнаяСтрокаДвиженияАктивов, "F")),
			ОбластьЭталон);	
	КонецЕсли;
	
	// Сумма вывода в валюте расчета
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "J");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);""""; %2 * ЕСЛИ(%3=ВалютаРасчета;1; ЕСЛИ(%3=""RUB"";1;ВПР(%3 & %1;%4;2;ЛОЖЬ)) / ЕСЛИ(ВалютаРасчета=""RUB"";1;ВПР(ВалютаРасчета & %1;%4;2;ЛОЖЬ))))", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I"),
		СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "J", КонечнаяСтрокаДвиженияАктивов, "J")),
			ОбластьЭталон);	
	КонецЕсли;	
	
	// Дней от вывода до расчета
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "K");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "K", КонечнаяСтрокаДвиженияАктивов, "K")),
			ОбластьЭталон);
	КонецЕсли;	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;			

	ОбластьДвиженияАктивов = Новый Структура;
	ОбластьДвиженияАктивов.Вставить("СуффиксПоказателей",		СуффиксПоказателей);
	ОбластьДвиженияАктивов.Вставить("СуффиксСЧАНаНачалоГода",	СуффиксСЧАНаНачалоГода);
	ОбластьДвиженияАктивов.Вставить("НачальнаяСтрока",			НачальнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КонечнаяСтрока",			КонечнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("ВысотаСтроки",				ВысотаСтрокиДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВвода",			"B");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВвода",		"E");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВвода",		"F");
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВывода",		"G");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВывода",		"J");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВывода",		"K");
	
	СтраницаРасчета.Области.Вставить("ДвиженияАктивов" + СуффиксПоказателей, ОбластьДвиженияАктивов);
	
	Возврат ОбластьДвиженияАктивов; 	
		
КонецФункции

&НаКлиенте
Функция ВывестиДвиженияАктивовСБазовойДоходностьюExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксБазовойДоходности, СуффиксСтоимостей)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"];
	
	// Ищем среди ранее выведенных областей
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Области.Получить("ДвиженияАктивовСБазовойДоходностью" + СуффиксБазовойДоходности + СуффиксСтоимостей);
	Если ОбластьДвиженияАктивов <> Неопределено Тогда
		Возврат ОбластьДвиженияАктивов;
	КонецЕсли;
	
	// Кривая КБД
	
	СтраницаКривой = Расшифровка.Результат.ПараметрыЛистов["G-кривая"];
	
	Если СтраницаКривой = Неопределено Тогда
		
		#Область Страница_кривой_бескупонной_доходности
		
		СтраницаКривой = ДобавитьОписаниеСтраницыExcel("G-кривая", Расшифровка.Результат);
		
		ШаблонСтраницыКривой = Расшифровка.Шаблон.ПараметрыЛистов["G-кривая"]; 
		Если ШаблонСтраницыКривой = Неопределено Тогда
			ШаблонСтраницыКривой = ДобавитьОписаниеСтраницыExcel("G-кривая", Расшифровка.Шаблон, Ложь);
		КонецЕсли;
		
		ШаблонШапкиКривой	= ШаблонСтраницыКривой.Страница.Range("ШапкаКривая");	
		ШаблонСтрокиКривой	= ШаблонСтраницыКривой.Страница.Range("СтрокаКривая");	

		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаКривой, ШаблонШапкиКривой, Истина, Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(Расшифровка.ExcelApp);	
		
		ЗначенияКривой = РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ЗначенияКБД"];

		БудетСтрок			= ЗначенияКривой.Количество();
		БудетКолонок		= 2;
		МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));

		Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
			МассивДанных[0][НомерСтроки] = ЗначенияКривой[НомерСтроки]["Период"];
			МассивДанных[1][НомерСтроки] = ЗначенияКривой[НомерСтроки]["Значение"];
		КонецЦикла;

		// Подготоваливаем строки и выводим данные

		НачальнаяСтрокаЗначений	= СтраницаКривой.ВсегоСтрок + 1;
		ВысотаСтрокиЗначений	= ШаблонСтрокиКривой.Rows.Count; 

		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаКривой, ШаблонСтрокиКривой, Ложь, Ложь, ВысотаСтрокиЗначений);  	

		Если БудетСтрок > 1 Тогда
			ОбластьЭталон = СтраницаКривой.Страница.Range(Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ="));
			Для н = 2 По БудетСтрок Цикл
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаКривой, ОбластьЭталон, , , , ВысотаСтрокиЗначений, Ложь);		
			КонецЦикла;
		КонецЕсли;

		КонечнаяСтрокаЗначений = СтраницаКривой.ВсегоСтрок;			

		СтраницаКривой.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "B", КонечнаяСтрокаЗначений, "C")).Value2 = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
		
		#КонецОбласти
		
	КонецЕсли;	
	
	ШаблонШапкиВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ШапкаВводВыводАктивовСДоходностью");	
	ШаблонСтрокиВводВыводАктивов	= ШаблонСтраницыРасчета.Страница.Range("СтрокаВводВыводАктивовСДоходностью");	
	ШаблонИтогВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ИтогВводВыводАктивовСДоходностью");	

	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапкиВводВыводАктивов, Ложь, Ложь);  	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "БалансРынок", ?(СуффиксСтоимостей = "Рынок", "(по рын. стоимости)", "(по бал. стоимости)"), Истина);  

	// Объединяем данные

	ВводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(СуффиксСтоимостей = "Рынок", "", СуффиксСтоимостей)];
	ВыводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"];

	ВводыАктивовВсего	= ВводыАктивов.Количество();
	ВыводыАктивовВсего	= ВыводыАктивов.Количество();
	БудетСтрок			= Макс(ВводыАктивовВсего, ВыводыАктивовВсего);
	БудетКолонок		= 10;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));

	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		Если НомерСтроки < ВводыАктивовВсего Тогда
			МассивДанных[0][НомерСтроки] = ВводыАктивов[НомерСтроки]["Период"];
			МассивДанных[1][НомерСтроки] = ВводыАктивов[НомерСтроки]["СуммаВВалютеРасчета"];
		КонецЕсли;
		
		Если НомерСтроки < ВыводыАктивовВсего Тогда
			МассивДанных[5][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Период"];
			МассивДанных[6][НомерСтроки] = ВыводыАктивов[НомерСтроки]["СуммаВВалютеРасчета" + СуффиксСтоимостей];
		КонецЕсли;
	КонецЦикла;

	// Подготоваливаем строки и выводим данные

	НачальнаяСтрокаДвиженияАктивов	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтрокиДвиженияАктивов		= ШаблонСтрокиВводВыводАктивов.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтрокиВводВыводАктивов, Ложь, Ложь, ВысотаСтрокиДвиженияАктивов);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтрокиДвиженияАктивов, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрокаДвиженияАктивов = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДвиженияАктивов = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B", КонечнаяСтрокаДвиженияАктивов, "K"));
	ОбластьДвиженияАктивов.Value2 = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДвиженияАктивов.Rows.Group();
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогВводВыводАктивов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "B").Value2			= Формат(КонецДня(ДанныеРасшифровки.КонецРасчетногоПериода) + 1, "ДФ=dd.MM.yyyy"); // НачалоСледующегоПериода
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C", КонечнаяСтрокаДвиженияАктивов, "C") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "F").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F", КонечнаяСтрокаДвиженияАктивов, "F") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "H").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H", КонечнаяСтрокаДвиженияАктивов, "H") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "K").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "K", КонечнаяСтрокаДвиженияАктивов, "K") + ")";

	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВводов" + СуффиксСтоимостей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("БазовыйДоходВводов" + СуффиксБазовойДоходности + СуффиксСтоимостей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "F"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВыводов" + СуффиксСтоимостей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "H"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("БазовыйДоходВыводов" + СуффиксБазовойДоходности + СуффиксСтоимостей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "K"));	

	// Заполняем формулы

	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "D");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D", КонечнаяСтрокаДвиженияАктивов, "D")),
			ОбластьЭталон);	
	КонецЕсли;
	
	Если СуффиксБазовойДоходности = "ПоСреднемуЗначениюКБД" Тогда
		ФормулаБазовойДоходности = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; СРЗНАЧЕСЛИМН(%2; %3; "">="" & ИНДЕКС(%3;ПОИСКПОЗ(%1;%3;1);1); %3; ""<="" & ДАТА(ГОД(%1);12;31)) + %4)",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
			"'G-кривая'!$C:$C",
			"'G-кривая'!$B:$B",
			Формат(РасшифровкаРасчетаПоБазе.СтавкаОтличиеОтКБД, "ЧН="));
	Иначе
		ФормулаБазовойДоходности = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; ИНДЕКС(%2;ПОИСКПОЗ(%1;%3;1);1)+%4)",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
			"'G-кривая'!$C:$C",
			"'G-кривая'!$B:$B",
			Формат(РасшифровкаРасчетаПоБазе.СтавкаОтличиеОтКБД, "ЧН="));
	КонецЕсли;
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "E");
	ОбластьЭталон.FormulaLocal = ФормулаБазовойДоходности;
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E", КонечнаяСтрокаДвиженияАктивов, "E")),
			ОбластьЭталон);	
	КонецЕсли;		
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "F");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2*%3*%4%%/%5)", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F", КонечнаяСтрокаДвиженияАктивов, "F")),
			ОбластьЭталон);	
	КонецЕсли;	
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "I");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I", КонечнаяСтрокаДвиженияАктивов, "I")),
			ОбластьЭталон);
	КонецЕсли;	

	Если СуффиксБазовойДоходности = "ПоСреднемуЗначениюКБД" Тогда
		ФормулаБазовойДоходности = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; СРЗНАЧЕСЛИМН(%2; %3; "">="" & ИНДЕКС(%3;ПОИСКПОЗ(%1;%3;1);1); %3; ""<="" & ДАТА(ГОД(%1);12;31)) + %4)",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
			"'G-кривая'!$C:$C",
			"'G-кривая'!$B:$B",
			Формат(РасшифровкаРасчетаПоБазе.СтавкаОтличиеОтКБД, "ЧН="));
	Иначе
		ФормулаБазовойДоходности = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; ИНДЕКС(%2;ПОИСКПОЗ(%1;%3;1);1)+%4)",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
			"'G-кривая'!$C:$C",
			"'G-кривая'!$B:$B",
			Формат(РасшифровкаРасчетаПоБазе.СтавкаОтличиеОтКБД, "ЧН="));
	КонецЕсли;
		
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "J");
	ОбластьЭталон.FormulaLocal = ФормулаБазовойДоходности;  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "J", КонечнаяСтрокаДвиженияАктивов, "J")),
			ОбластьЭталон);	
	КонецЕсли;	
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "K");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2*%3*%4%%/%5)", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "J"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "K", КонечнаяСтрокаДвиженияАктивов, "K")),
			ОбластьЭталон);	
	КонецЕсли;	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;			

	ОбластьДвиженияАктивов = Новый Структура;
	ОбластьДвиженияАктивов.Вставить("СуффиксПоказателей",			СуффиксСтоимостей);
	ОбластьДвиженияАктивов.Вставить("НачальнаяСтрока",				НачальнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КонечнаяСтрока",				КонечнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("ВысотаСтроки",					ВысотаСтрокиДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВвода",				"B");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВвода",			"C");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВвода",			"D");
	ОбластьДвиженияАктивов.Вставить("КолонкаБазоваяСтавкаВвода",	"E");
	ОбластьДвиженияАктивов.Вставить("КолонкаБазовыйДоходВвода",		"F");
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВывода",			"G");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВывода",			"H");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВывода",			"I");
	ОбластьДвиженияАктивов.Вставить("КолонкаБазоваяСтавкаВывода",	"J");
	ОбластьДвиженияАктивов.Вставить("КолонкаБазовыйДоходВывода",	"K");
	
	СтраницаРасчета.Области.Вставить("ДвиженияАктивовСБазовойДоходностью" + СуффиксБазовойДоходности + СуффиксСтоимостей, ОбластьДвиженияАктивов);
	
	Возврат ОбластьДвиженияАктивов; 	
		
КонецФункции

&НаКлиенте
Функция ВывестиДвиженияАктивовСМинимальнымИГарантированнымДоходомExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"];
	
	// Ищем среди ранее выведенных областей
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Области.Получить("ДвиженияАктивовСМинимальнымДоходом" + СуффиксПоказателей);
	Если ОбластьДвиженияАктивов <> Неопределено Тогда
		Возврат ОбластьДвиженияАктивов; 
	КонецЕсли;
	
	ШаблонШапкиВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ШапкаВводВыводАктивовСМинимальнымДоходом");	
	ШаблонСтрокиВводВыводАктивов	= ШаблонСтраницыРасчета.Страница.Range("СтрокаВводВыводАктивовСМинимальнымДоходом");	
	ШаблонИтогВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ИтогВводВыводАктивовСМинимальнымДоходом");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапкиВводВыводАктивов, Ложь, Ложь);  	

	// Объединяем данные

	ВводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(СуффиксПоказателей = "Рынок", "", СуффиксПоказателей)];
	ВыводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"];

	ВводыАктивовВсего	= ВводыАктивов.Количество();
	ВыводыАктивовВсего	= ВыводыАктивов.Количество();
	БудетСтрок			= Макс(ВводыАктивовВсего, ВыводыАктивовВсего);
	БудетКолонок		= 10;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));

	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		Если НомерСтроки < ВводыАктивовВсего Тогда
			МассивДанных[0][НомерСтроки] = ВводыАктивов[НомерСтроки]["Период"];
			МассивДанных[1][НомерСтроки] = ВводыАктивов[НомерСтроки]["СуммаВВалютеРасчета"];
		КонецЕсли;
		
		Если НомерСтроки < ВыводыАктивовВсего Тогда
			МассивДанных[5][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Период"];
			МассивДанных[6][НомерСтроки] = ВыводыАктивов[НомерСтроки]["СуммаВВалютеРасчета" + СуффиксПоказателей];
		КонецЕсли;
	КонецЦикла;

	// Подготоваливаем строки и выводим данные

	НачальнаяСтрокаДвиженияАктивов	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтрокиДвиженияАктивов		= ШаблонСтрокиВводВыводАктивов.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтрокиВводВыводАктивов, Ложь, Ложь, ВысотаСтрокиДвиженияАктивов);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтрокиДвиженияАктивов, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрокаДвиженияАктивов = СтраницаРасчета.ВсегоСтрок;			
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B", КонечнаяСтрокаДвиженияАктивов, "K"));
	ОбластьДвиженияАктивов.Value2 = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДвиженияАктивов.Rows.Group();

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогВводВыводАктивов, Ложь, Ложь); 

	ИсключатьДеньПриемаПередачиАктивовИзУправления = РасшифровкаРасчетаПоБазе.Свойство("ИсключатьДеньПриемаПередачиАктивовИзУправления") И РасшифровкаРасчетаПоБазе.ИсключатьДеньПриемаПередачиАктивовИзУправления;
	
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "B").Value2			= Формат(КонецДня(ДанныеРасшифровки.КонецРасчетногоПериода) + ?(ИсключатьДеньПриемаПередачиАктивовИзУправления, 0, 1), "ДФ=dd.MM.yyyy"); // НачалоСледующегоПериода
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C", КонечнаяСтрокаДвиженияАктивов, "C") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E", КонечнаяСтрокаДвиженияАктивов, "E") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "F").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F", КонечнаяСтрокаДвиженияАктивов, "F") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "H").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H", КонечнаяСтрокаДвиженияАктивов, "H") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "J").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "J", КонечнаяСтрокаДвиженияАктивов, "J") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "K").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "K", КонечнаяСтрокаДвиженияАктивов, "K") + ")";

	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ГарантированныйДоходВводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("МинимальныйДоходВводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "F"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "H"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ГарантированныйДоходВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "J"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("МинимальныйДоходВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "K"));	

	// Заполняем формулы

	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "D");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "E");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		"СтавкаГД");
		
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "F");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		"СтавкаМД");
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D", КонечнаяСтрокаДвиженияАктивов, "F")),
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D", НачальнаяСтрокаДвиженияАктивов, "F")));	
	КонецЕсли;	
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "I");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  

	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "J");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		"СтавкаГД");
		
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "K");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		"СтавкаМД");
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I", КонечнаяСтрокаДвиженияАктивов, "K")),
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I", НачальнаяСтрокаДвиженияАктивов, "K")));	
	КонецЕсли;	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;			

	ОбластьДвиженияАктивов = Новый Структура;
	ОбластьДвиженияАктивов.Вставить("СуффиксПоказателей",	СуффиксПоказателей);
	ОбластьДвиженияАктивов.Вставить("НачальнаяСтрока",		НачальнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КонечнаяСтрока",		КонечнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВвода",		"B");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВвода",	"C");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВвода",	"D");
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВывода",	"G");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВывода",	"H");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВывода",	"I");	
	
	СтраницаРасчета.Области.Вставить("ДвиженияАктивовСМинимальнымДоходом" + СуффиксПоказателей, ОбластьДвиженияАктивов); 	
	
	Возврат ОбластьДвиженияАктивов; 	
		
КонецФункции

&НаКлиенте
Функция ВывестиДвиженияАктивовСГарантированнымДоходомExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"];
	
	// Ищем среди ранее выведенных областей
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Области.Получить("ДвиженияАктивовСГарантированнымДоходом" + СуффиксПоказателей);
	Если ОбластьДвиженияАктивов <> Неопределено Тогда
		Возврат ОбластьДвиженияАктивов; 
	КонецЕсли;
	
	ШаблонШапкиВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ШапкаВводВыводАктивовСГарантированнымДоходом");	
	ШаблонСтрокиВводВыводАктивов	= ШаблонСтраницыРасчета.Страница.Range("СтрокаВводВыводАктивовСГарантированнымДоходом");	
	ШаблонИтогВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ИтогВводВыводАктивовСГарантированнымДоходом");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапкиВводВыводАктивов, Ложь, Ложь);  	

	// Объединяем данные

	ВводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(СуффиксПоказателей = "Рынок", "", СуффиксПоказателей)];
	ВыводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"];

	ВводыАктивовВсего	= ВводыАктивов.Количество();
	ВыводыАктивовВсего	= ВыводыАктивов.Количество();
	БудетСтрок			= Макс(ВводыАктивовВсего, ВыводыАктивовВсего);
	БудетКолонок		= 8;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));

	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		Если НомерСтроки < ВводыАктивовВсего Тогда
			МассивДанных[0][НомерСтроки] = ВводыАктивов[НомерСтроки]["Период"];
			МассивДанных[1][НомерСтроки] = ВводыАктивов[НомерСтроки]["СуммаВВалютеРасчета"];
		КонецЕсли;
		
		Если НомерСтроки < ВыводыАктивовВсего Тогда
			МассивДанных[4][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Период"];
			МассивДанных[5][НомерСтроки] = ВыводыАктивов[НомерСтроки]["СуммаВВалютеРасчета" + СуффиксПоказателей];
		КонецЕсли;
	КонецЦикла;

	// Подготоваливаем строки и выводим данные

	НачальнаяСтрокаДвиженияАктивов	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтрокиДвиженияАктивов		= ШаблонСтрокиВводВыводАктивов.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтрокиВводВыводАктивов, Ложь, Ложь, ВысотаСтрокиДвиженияАктивов);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтрокиДвиженияАктивов, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрокаДвиженияАктивов = СтраницаРасчета.ВсегоСтрок;			
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B", КонечнаяСтрокаДвиженияАктивов, "I"));
	ОбластьДвиженияАктивов.Value2 = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДвиженияАктивов.Rows.Group();

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогВводВыводАктивов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "B").Value2			= Формат(КонецДня(ДанныеРасшифровки.КонецРасчетногоПериода) + 1, "ДФ=dd.MM.yyyy"); // НачалоСледующегоПериода
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C", КонечнаяСтрокаДвиженияАктивов, "C") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E", КонечнаяСтрокаДвиженияАктивов, "E") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "G").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G", КонечнаяСтрокаДвиженияАктивов, "G") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "I").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I", КонечнаяСтрокаДвиженияАктивов, "I") + ")";

	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ГарантированныйДоходВводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "H"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ГарантированныйДоходВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "I"));	

	// Заполняем формулы

	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "D");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "E");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5%%)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		Формат(РасшифровкаРасчетаПоБазе.СтавкаГД, "ЧРД=,; ЧН=; ЧГ="));
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D", КонечнаяСтрокаДвиженияАктивов, "E")),
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D", НачальнаяСтрокаДвиженияАктивов, "E")));	
	КонецЕсли;	
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "H");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  

	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "I");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5%%)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		Формат(РасшифровкаРасчетаПоБазе.СтавкаГД, "ЧРД=,; ЧН=; ЧГ="));
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H", КонечнаяСтрокаДвиженияАктивов, "I")),
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H", НачальнаяСтрокаДвиженияАктивов, "I")));	
	КонецЕсли;	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;			

	ОбластьДвиженияАктивов = Новый Структура;
	ОбластьДвиженияАктивов.Вставить("СуффиксПоказателей",	СуффиксПоказателей);
	ОбластьДвиженияАктивов.Вставить("НачальнаяСтрока",		НачальнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КонечнаяСтрока",		КонечнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВвода",		"B");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВвода",	"C");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВвода",	"D");
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВывода",	"F");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВывода",	"G");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВывода",	"H");	
	
	СтраницаРасчета.Области.Вставить("ДвиженияАктивовСГарантированнымДоходом" + СуффиксПоказателей, ОбластьДвиженияАктивов); 	
	
	Возврат ОбластьДвиженияАктивов; 	
		
КонецФункции

&НаКлиенте
Функция ВывестиДвиженияАктивовСГарантированнымДоходомСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, СуффиксПоказателей)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"];
	
	// Ищем среди ранее выведенных областей
	
	ОбластьДвиженияАктивов = СтраницаРасчета.Области.Получить("ДвиженияАктивовСГарантированнымДоходом" + СуффиксПоказателей);
	Если ОбластьДвиженияАктивов <> Неопределено Тогда
		Возврат ОбластьДвиженияАктивов;
	КонецЕсли;
	
	// Курсы валют
	
	СтраницаКурсовВалют = ВывестиКурсыВалютExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);	
	
	// Область шапки
	
	ШаблонШапкиВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ШапкаВводВыводАктивовСГарантированнымДоходомВалютный");	
	ШаблонСтрокиВводВыводАктивов	= ШаблонСтраницыРасчета.Страница.Range("СтрокаВводВыводАктивовСГарантированнымДоходомВалютный");	
	ШаблонИтогВводВыводАктивов		= ШаблонСтраницыРасчета.Страница.Range("ИтогВводВыводАктивовСГарантированнымДоходомВалютный");	

	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапкиВводВыводАктивов, Ложь, Ложь);  	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "БалансРынок", ?(СуффиксПоказателей = "Рынок", "(по рын. стоимости)", "(по бал. стоимости)"), Истина);  
	
	// Подготавливаем данные

	ВводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(СуффиксПоказателей = "Рынок", "", СуффиксПоказателей)];
	ВыводыАктивов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"];

	ВводыАктивовВсего		= ВводыАктивов.Количество();
	ВыводыАктивовВсего		= ВыводыАктивов.Количество();
	БудетСтрок				= Макс(ВводыАктивовВсего, ВыводыАктивовВсего);
	БудетКолонок			= 12;
	МассивДанных			= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
	ЕстьСЧАНаНачалоГода		= Ложь;
	
	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		Если НомерСтроки < ВводыАктивовВсего Тогда
			МассивДанных[0][НомерСтроки] = ВводыАктивов[НомерСтроки]["Период"];
			МассивДанных[1][НомерСтроки] = ВводыАктивов[НомерСтроки]["Сумма"];
			МассивДанных[2][НомерСтроки] = Строка(ВводыАктивов[НомерСтроки]["Валюта"]);
			Если ВводыАктивов[НомерСтроки]["СЧАНаНачалоГода"] Тогда 
				ЕстьСЧАНаНачалоГода = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НомерСтроки < ВыводыАктивовВсего Тогда
			МассивДанных[6][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Период"];
			МассивДанных[7][НомерСтроки] = ВыводыАктивов[НомерСтроки]["Сумма" + СуффиксПоказателей];
			МассивДанных[8][НомерСтроки] = Строка(ВыводыАктивов[НомерСтроки]["Валюта"]);
		КонецЕсли;
	КонецЦикла;

	// Подготоваливаем строки и выводим данные

	НачальнаяСтрокаДвиженияАктивов	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтрокиДвиженияАктивов		= ШаблонСтрокиВводВыводАктивов.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтрокиВводВыводАктивов, Ложь, Ложь, ВысотаСтрокиДвиженияАктивов);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаДвиженияАктивов, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтрокиДвиженияАктивов, Ложь);
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрокаДвиженияАктивов = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДвиженияАктивов = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B", КонечнаяСтрокаДвиженияАктивов, "M"));
	ОбластьДвиженияАктивов.Value2 = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДвиженияАктивов.Rows.Group();
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогВводВыводАктивов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "B").Value2			= Формат(КонецДня(ДанныеРасшифровки.КонецРасчетногоПериода) + 1, "ДФ=dd.MM.yyyy"); // НачалоСледующегоПериода
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E", КонечнаяСтрокаДвиженияАктивов, "E") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "G").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G", КонечнаяСтрокаДвиженияАктивов, "G") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "K").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "K", КонечнаяСтрокаДвиженияАктивов, "K") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "M").FormulaLocal	= "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "M", КонечнаяСтрокаДвиженияАктивов, "M") + ")";

	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВводов" + СуффиксПоказателей,					СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ГарантированныйДоходВводов" + СуффиксПоказателей,	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "G"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("СуммаВыводов" + СуффиксПоказателей,				СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "K"));
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ГарантированныйДоходВыводов" + СуффиксПоказателей, СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "M"));	

	// Сумма ввода в валюте расчета	
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "E");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);""""; %2 * ЕСЛИ(%3=ВалютаРасчета;1; ЕСЛИ(%3=""RUB"";1;ВПР(%3 & %1;%4;2;ЛОЖЬ)) / ЕСЛИ(ВалютаРасчета=""RUB"";1;ВПР(ВалютаРасчета & %1;%4;2;ЛОЖЬ))))", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
		СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E", КонечнаяСтрокаДвиженияАктивов, "E")),
			ОбластьЭталон);	
	КонецЕсли;	
		
	Если ЕстьСЧАНаНачалоГода Тогда
		
		Если СуффиксПоказателей = "Рынок" Тогда // Дата расчета СЧА по рыночной стоимости отличается от даты ввода
			ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);НД(); %2 * ЕСЛИ(%3=ВалютаРасчета;1; ЕСЛИ(%3=""RUB"";1;ВПР(%3 & %1;%4;2;ЛОЖЬ)) / ЕСЛИ(ВалютаРасчета=""RUB"";1;ВПР(ВалютаРасчета & %1;%4;2;ЛОЖЬ))))", 
				"ДатаРасчетаСЧАНаНачалоГода",
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "C"),
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "D"),
				СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина));
		КонецЕсли;
		
		СтраницаРасчета.КлючевыеЯчейки.Вставить("СЧАНаНачалоГода" + СуффиксПоказателей, ОбластьЭталон);	
		
	КонецЕсли;
	
	// Дней от ввода до расчета
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "F");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F", КонечнаяСтрокаДвиженияАктивов, "F")),
			ОбластьЭталон);	
	КонецЕсли;
	
	// Гарантированный доход вводов
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "G");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5%%)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "B"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "E"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "F"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		Формат(РасшифровкаРасчетаПоБазе.СтавкаГД, "ЧРД=,; ЧН=; ЧГ="));
	
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "G", КонечнаяСтрокаДвиженияАктивов, "G")),
			ОбластьЭталон);	
	КонецЕсли;
	
	// Сумма вывода в валюте расчета
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "K");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);""""; %2 * ЕСЛИ(%3=ВалютаРасчета;1; ЕСЛИ(%3=""RUB"";1;ВПР(%3 & %1;%4;2;ЛОЖЬ)) / ЕСЛИ(ВалютаРасчета=""RUB"";1;ВПР(ВалютаРасчета & %1;%4;2;ЛОЖЬ))))", 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "I"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "J"),
		СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "K", КонечнаяСтрокаДвиженияАктивов, "K")),
			ОбластьЭталон);	
	КонецЕсли;	
	
	// Дней от вывода до расчета
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "L");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1);"""";%2-%1)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок, "B", Истина, Истина));  
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "L", КонечнаяСтрокаДвиженияАктивов, "L")),
			ОбластьЭталон);
	КонецЕсли;	
	
	// Гарантированный доход выводов
	
	ОбластьЭталон = СтраницаРасчета.Страница.Cells(НачальнаяСтрокаДвиженияАктивов, "M");
	ОбластьЭталон.FormulaLocal = СтрШаблон("=ЕСЛИ(ЕПУСТО(%1); """"; %2 * %3 / %4 * %5%%)",
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "H"),  
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "K"),
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(НачальнаяСтрокаДвиженияАктивов, "L"),
		Формат(ДанныеРасшифровки.ДнейВГоду, "ЧРД=,; ЧН=; ЧГ="),
		Формат(РасшифровкаРасчетаПоБазе.СтавкаГД, "ЧРД=,; ЧН=; ЧГ="));
		
	Если НачальнаяСтрокаДвиженияАктивов <> КонечнаяСтрокаДвиженияАктивов Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаДвиженияАктивов, "M", КонечнаяСтрокаДвиженияАктивов, "M")),
			ОбластьЭталон);	
	КонецЕсли;	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;			

	ОбластьДвиженияАктивов = Новый Структура;
	ОбластьДвиженияАктивов.Вставить("СуффиксПоказателей",	СуффиксПоказателей);
	ОбластьДвиженияАктивов.Вставить("НачальнаяСтрока",		НачальнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КонечнаяСтрока",		КонечнаяСтрокаДвиженияАктивов);
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВвода",		"B");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВвода",	"E");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВвода",	"F");
	ОбластьДвиженияАктивов.Вставить("КолонкаДатаВывода",	"H");
	ОбластьДвиженияАктивов.Вставить("КолонкаСуммаВывода",	"K");
	ОбластьДвиженияАктивов.Вставить("КолонкаДнейДоВывода",	"L");
	
	СтраницаРасчета.Области.Вставить("ДвиженияАктивовСГарантированнымДоходом" + СуффиксПоказателей, ОбластьДвиженияАктивов);
	
	Возврат ОбластьДвиженияАктивов; 	
	
КонецФункции

&НаКлиенте
Функция ВывестиКурсыВалютExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка)
	
	// Ищем среди ранее выведенных областей
	
	СтраницаКурсовВалют = Расшифровка.Результат.ПараметрыЛистов["Курсы валют"];
	
	Если СтраницаКурсовВалют <> Неопределено Тогда
		Возврат СтраницаКурсовВалют;
	КонецЕсли;
		
	// Формируем страницу
	
	СтраницаКурсовВалют = ДобавитьОписаниеСтраницыExcel("Курсы валют", Расшифровка.Результат);
		
	ШаблонСтраницы = Расшифровка.Шаблон.ПараметрыЛистов["Курсы валют"]; 
	Если ШаблонСтраницы = Неопределено Тогда
		ШаблонСтраницы = ДобавитьОписаниеСтраницыExcel("Курсы валют", Расшифровка.Шаблон, Ложь);
	КонецЕсли;
	
	ШаблонШапки		= ШаблонСтраницы.Страница.Range("ШапкаКурсыВалют");	
	ШаблонСтроки	= ШаблонСтраницы.Страница.Range("СтрокаКурсыВалют");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаКурсовВалют, ШаблонШапки, Истина, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelОчиститьБуферОбмена(Расшифровка.ExcelApp);	
	
	ЗначенияКурсов = РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_КурсыВалют"];

	БудетСтрок			= ЗначенияКурсов.Количество();
	БудетКолонок		= 4;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));

	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		МассивДанных[0][НомерСтроки] = Строка(ЗначенияКурсов[НомерСтроки]["Валюта"]);
		МассивДанных[1][НомерСтроки] = ЗначенияКурсов[НомерСтроки]["Дата"];
		МассивДанных[2][НомерСтроки] = СтрШаблон("= %1 & %2",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаКурсовВалют.ВсегоСтрок + НомерСтроки + 1, "B"),
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаКурсовВалют.ВсегоСтрок + НомерСтроки + 1, "C"));
		МассивДанных[3][НомерСтроки] = ЗначенияКурсов[НомерСтроки]["Курс"];
	КонецЦикла;

	// Подготоваливаем строки и выводим данные

	НачальнаяСтрокаЗначений	= СтраницаКурсовВалют.ВсегоСтрок + 1;
	ВысотаСтрокиЗначений	= ШаблонСтроки.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаКурсовВалют, ШаблонСтроки, Ложь, Ложь, ВысотаСтрокиЗначений);  	
	
	// Так как нужно вывести множество однотипных строк, то будем их выводить в геометрической прогрессии
	
	Если БудетСтрок > 1 Тогда
		
		н = 2;
		КоличествоСтрокВЭталоне = 0;
		
		Пока н <= БудетСтрок Цикл
			
			КоличествоСтрокВЭталоне = Макс(1, КоличествоСтрокВЭталоне * 2);
			Если н + КоличествоСтрокВЭталоне - 1 > БудетСтрок Тогда
				КоличествоСтрокВЭталоне = БудетСтрок - н + 1;
			КонецЕсли;
			
			ОбластьЭталон = СтраницаКурсовВалют.Страница.Range(Формат(НачальнаяСтрокаЗначений, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрокаЗначений + КоличествоСтрокВЭталоне - 1, "ЧРД=,; ЧН=; ЧГ="));
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаКурсовВалют, ОбластьЭталон, , , , ВысотаСтрокиЗначений * КоличествоСтрокВЭталоне, Ложь);		
			
			н = н + КоличествоСтрокВЭталоне;			
			
		КонецЦикла;
		
	КонецЕсли;

	КонечнаяСтрокаЗначений = СтраницаКурсовВалют.ВсегоСтрок;
	
	СтраницаКурсовВалют.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "B", КонечнаяСтрокаЗначений, "E")).FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
		
	СтраницаКурсовВалют.КлючевыеЯчейки.Вставить("КурсыВалют", СтраницаКурсовВалют.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаЗначений, "D", КонечнаяСтрокаЗначений, "E")));
	
	Возврат СтраницаКурсовВалют;	
	
КонецФункции

&НаКлиенте
Функция ВывестиУплаченноеВознаграждениеСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"].Страница;
	
	// Ищем среди ранее выведенных областей
	
	ОбластьУдержанноеВознаграждение = СтраницаРасчета.Области.Получить("ВознаграждениеУплаченное");
	Если ОбластьУдержанноеВознаграждение <> Неопределено Тогда
		Возврат ОбластьУдержанноеВознаграждение;
	КонецЕсли;
	
	// Курсы валют
	
	СтраницаКурсовВалют = ВывестиКурсыВалютExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);	
	
	// Область шапки
	
	ШаблонШапки		= ШаблонСтраницыРасчета.Range("ШапкаВознаграждениеУдержанное");	
	ШаблонСтроки	= ШаблонСтраницыРасчета.Range("СтрокаВознаграждениеУдержанное");	
	ШаблонИтогов	= ШаблонСтраницыРасчета.Range("ИтогВознаграждениеУдержанное");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапки);  	
	
	// Подготоваливаем данные

	ТаблицаДанных		= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВознаграждениеУплаченноеСНачалаГодаРазвернуто"];
	БудетСтрок			= ТаблицаДанных.Количество();
	БудетКолонок		= 3;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));

	АдресОбластиКурсовВалют = СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина);
	
	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		МассивДанных[0][НомерСтроки] = ТаблицаДанных[НомерСтроки]["ДатаНачисления"];
		МассивДанных[1][НомерСтроки] = ТаблицаДанных[НомерСтроки]["СуммаВВалютеУчета"];
		МассивДанных[2][НомерСтроки] = СтрШаблон("= %1 / ЕСЛИ(ВалютаРасчета=""RUB""; 1; ВПР(ВалютаРасчета & %2; %3; 2; ЛОЖЬ))",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок + НомерСтроки + 1, "C"),
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок + НомерСтроки + 1, "B"),
			АдресОбластиКурсовВалют);
	КонецЦикла;	
	
	// Подготоваливаем строки и выводим данные

	НачальнаяСтрока	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтроки	= ШаблонСтроки.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтроки, Ложь, Ложь, ВысотаСтроки);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрока, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрока, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтроки, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрока = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДанных = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "B", КонечнаяСтрока, "D"));
	ОбластьДанных.FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДанных.Rows.Group();

	// Область итогов
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C").FormulaLocal = "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "C", КонечнаяСтрока, "C") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D").FormulaLocal = "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "D", КонечнаяСтрока, "D") + ")";	

	СтраницаРасчета.КлючевыеЯчейки.Вставить("ВознаграждениеУплаченноеВВалютеУчета", СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("ВознаграждениеУплаченное",				СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"));	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	// Формируем описание области
	
	ОбластьУдержанноеВознаграждение = Новый Структура;
	ОбластьУдержанноеВознаграждение.Вставить("КолонкаСуммаВВалютеУчета",	"C");
	ОбластьУдержанноеВознаграждение.Вставить("КолонкаСумма",				"D");
	
	СтраницаРасчета.Области.Вставить("ВознаграждениеУплаченное", ОбластьУдержанноеВознаграждение); 	
	
	Возврат ОбластьУдержанноеВознаграждение; 	
	
КонецФункции

&НаКлиенте
Функция ВывестиУплаченныйНДФЛСВалютойРасчетаExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"].Страница;
	
	// Ищем среди ранее выведенных областей
	
	ОбластьУплаченныйНДФЛ = СтраницаРасчета.Области.Получить("УплаченныйНДФЛ");
	Если ОбластьУплаченныйНДФЛ <> Неопределено Тогда
		Возврат ОбластьУплаченныйНДФЛ;
	КонецЕсли;
	
	// Курсы валют
	
	СтраницаКурсовВалют = ВывестиКурсыВалютExcel(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка);	
	
	// Область шапки
	
	ШаблонШапки		= ШаблонСтраницыРасчета.Range("ШапкаНДФЛУплаченный");	
	ШаблонСтроки	= ШаблонСтраницыРасчета.Range("СтрокаНДФЛУплаченный");	
	ШаблонИтогов	= ШаблонСтраницыРасчета.Range("ИтогНДФЛУплаченный");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапки);  	
	
	// Подготоваливаем данные

	ТаблицаДанных		= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_НДФЛУплаченныйСНачалаГодаРазвернуто"];
	БудетСтрок			= ТаблицаДанных.Количество();
	БудетКолонок		= 3;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));

	АдресОбластиКурсовВалют = СтраницаКурсовВалют.КлючевыеЯчейки["КурсыВалют"].Address(Истина, Истина, , Истина);
	
	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		МассивДанных[0][НомерСтроки] = ТаблицаДанных[НомерСтроки]["ДатаОплаты"];
		МассивДанных[1][НомерСтроки] = ТаблицаДанных[НомерСтроки]["СуммаВВалютеУчета"];
		МассивДанных[2][НомерСтроки] = СтрШаблон("= %1 / ЕСЛИ(ВалютаРасчета=""RUB""; 1; ВПР(ВалютаРасчета & %2; %3; 2; ЛОЖЬ))",
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок + НомерСтроки + 1, "C"),
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресЯчейкиСтрокой(СтраницаРасчета.ВсегоСтрок + НомерСтроки + 1, "B"),
			АдресОбластиКурсовВалют);
	КонецЦикла;	
	
	// Подготоваливаем строки и выводим данные

	НачальнаяСтрока	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтроки	= ШаблонСтроки.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтроки, Ложь, Ложь, ВысотаСтроки);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрока, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрока, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтроки, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрока = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДанных = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "B", КонечнаяСтрока, "D"));
	ОбластьДанных.FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДанных.Rows.Group();

	// Область итогов
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C").FormulaLocal = "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "C", КонечнаяСтрока, "C") + ")";
	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D").FormulaLocal = "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "D", КонечнаяСтрока, "D") + ")";	

	СтраницаРасчета.КлючевыеЯчейки.Вставить("УплаченныйНДФЛВВалютеУчета", СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "C"));	
	СтраницаРасчета.КлючевыеЯчейки.Вставить("УплаченныйНДФЛ",			  СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "D"));	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	// Формируем описание области
	
	ОбластьУплаченныйНДФЛ = Новый Структура;
	ОбластьУплаченныйНДФЛ.Вставить("КолонкаСуммаВВалютеУчета",	"C");
	ОбластьУплаченныйНДФЛ.Вставить("КолонкаСумма",				"D");
	
	СтраницаРасчета.Области.Вставить("УплаченныйНДФЛ", ОбластьУплаченныйНДФЛ); 	
	
	Возврат ОбластьУплаченныйНДФЛ; 	
	
КонецФункции

&НаКлиенте
Функция ВывестиРасходыПоУправлению(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"].Страница;
	
	// Ищем среди ранее выведенных областей
	
	ОбластьРасходыПоУправлению = СтраницаРасчета.Области.Получить("РасходыПоУправлению");
	Если ОбластьРасходыПоУправлению <> Неопределено Тогда
		Возврат ОбластьРасходыПоУправлению;
	КонецЕсли;
	
	// Область шапки
	
	ШаблонШапки		= ШаблонСтраницыРасчета.Range("ШапкаРасходыПоУправлению");	
	ШаблонСтроки	= ШаблонСтраницыРасчета.Range("СтрокаРасходыПоУправлению");	
	ШаблонИтогов	= ШаблонСтраницыРасчета.Range("ИтогРасходыПоУправлению");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапки);  	
	
	// Подготоваливаем данные

	ТаблицаДанных		= ПолучитьРасходыПоУправлению(ДанныеРасшифровки.СчетДоверительногоУправления, ДанныеРасшифровки.Организация, ДанныеРасшифровки.НачалоРасчетногоПериода, ДанныеРасшифровки.КонецРасчетногоПериода);
	БудетСтрок			= ТаблицаДанных.Количество();
	БудетКолонок		= 4;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
	
	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		МассивДанных[0][НомерСтроки] = ТаблицаДанных[НомерСтроки]["ВидРасходов"];
		МассивДанных[3][НомерСтроки] = ТаблицаДанных[НомерСтроки]["НачисленоВВалютеУчета"];
	КонецЦикла;	
	
	// Подготоваливаем строки и выводим данные

	НачальнаяСтрока	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтроки	= ШаблонСтроки.Rows.Count; 

	Для н = 1 По БудетСтрок Цикл
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтроки, Ложь, Ложь, ВысотаСтроки); // вывожу через ExcelВывестиОбласть, т.к. через ExcelВставитьОбласть теряется объединение ячеек	
	КонецЦикла;

	КонечнаяСтрока = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДанных = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "B", КонечнаяСтрока, "E"));
	ОбластьДанных.FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДанных.Rows.Group();

	// Область итогов
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E").FormulaLocal = "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "E", КонечнаяСтрока, "E") + ")";

	СтраницаРасчета.КлючевыеЯчейки.Вставить("РасходыПоУправлениюНачисленоВВалютеУчета", СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E"));	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	// Формируем описание области
	
	ОбластьРасходыПоУправлению = Новый Структура;
	ОбластьРасходыПоУправлению.Вставить("КолонкаНачисленоВВалютеУчета",	"E");
	
	СтраницаРасчета.Области.Вставить("РасходыПоУправлению", ОбластьРасходыПоУправлению); 	
	
	Возврат ОбластьРасходыПоУправлению; 	
	
КонецФункции

&НаКлиенте
Функция ВывестиРасходыПоДоговоруСоСпецдепозитарием(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"].Страница;
	ИмяОбласти				= "РасходыПоДоговоруСоСпецдепозитарием";
	
	// Ищем среди ранее выведенных областей
	
	ВыведеннаяОбласть = СтраницаРасчета.Области.Получить(ИмяОбласти);
	Если ВыведеннаяОбласть <> Неопределено Тогда
		Возврат ВыведеннаяОбласть;
	КонецЕсли;
	
	// Область шапки
	
	ШаблонШапки		= ШаблонСтраницыРасчета.Range("ШапкаРасходыПоУправлениюЗаголовок");	
	ШаблонСтроки	= ШаблонСтраницыРасчета.Range("СтрокаРасходыПоУправлению");	
	ШаблонИтогов	= ШаблонСтраницыРасчета.Range("ИтогРасходыПоУправлению");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапки);  	
	
	// Подготоваливаем данные

	ТаблицаДанных		= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_НеобходимыеРасходыИСтоимостьУслугСпецдепозитарияСНачалаГодаРазвернуто"];
	БудетСтрок			= ТаблицаДанных.Количество();
	БудетКолонок		= 4;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
	
	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		МассивДанных[0][НомерСтроки] = Строка(ТаблицаДанных[НомерСтроки]["ВидЗадолженности"]);
		МассивДанных[3][НомерСтроки] = ?(ТаблицаДанных[НомерСтроки]["СуммаВВалютеРасчета"] = NULL, "=НД()", ТаблицаДанных[НомерСтроки]["СуммаВВалютеРасчета"]);
	КонецЦикла;	
	
	// Подготоваливаем строки и выводим данные

	РасходыПоДоговоруСоСпецдепозитарием = Новый Соответствие;
	
	НачальнаяСтрока	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтроки	= ШаблонСтроки.Rows.Count; 

	Для н = 1 По БудетСтрок Цикл
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтроки, Ложь, Ложь, ВысотаСтроки); // вывожу через ExcelВывестиОбласть, т.к. через ExcelВставитьОбласть теряется объединение ячеек	
		РасходыПоДоговоруСоСпецдепозитарием.Вставить(ТаблицаДанных[н-1]["ВидЗадолженности"], СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E"));	
	КонецЦикла;

	СтраницаРасчета.КлючевыеЯчейки.Вставить("РасходыПоДоговоруСоСпецдепозитарием", РасходыПоДоговоруСоСпецдепозитарием);
	
	КонечнаяСтрока = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДанных = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "B", КонечнаяСтрока, "E"));
	ОбластьДанных.FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДанных.Rows.Group();

	// Область итогов
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогов, Ложь, Ложь); 

	СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E").FormulaLocal = "=СУММ(" + РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "E", КонечнаяСтрока, "E") + ")";

	СтраницаРасчета.КлючевыеЯчейки.Вставить("РасходыПоДоговоруСоСпецдепозитариемВВалютеРасчета", СтраницаРасчета.Страница.Cells(СтраницаРасчета.ВсегоСтрок, "E"));	
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
	
	// Формируем описание области
	
	ВыведеннаяОбласть = Новый Структура;
	ВыведеннаяОбласть.Вставить("КолонкаСуммаВВалютеРасчета", "E");
	
	СтраницаРасчета.Области.Вставить(ИмяОбласти, ВыведеннаяОбласть); 	
	
	Возврат ВыведеннаяОбласть; 	
	
КонецФункции

&НаКлиенте
Функция ВывестиМесяцыУправления(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"].Страница;
	
	// Ищем среди ранее выведенных областей
	
	ОбластьМесяцыУправления = СтраницаРасчета.Области.Получить("МесяцыУправления");
	Если ОбластьМесяцыУправления <> Неопределено Тогда
		Возврат ОбластьМесяцыУправления;
	КонецЕсли;
	
	// Область шапки
	
	ШаблонШапки		= ШаблонСтраницыРасчета.Range("ШапкаМесяцыУправления");	
	ШаблонСтроки	= ШаблонСтраницыРасчета.Range("СтрокаМесяцыУправления");	
	ШаблонИтогов	= ШаблонСтраницыРасчета.Range("ИтогМесяцыУправления");	

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонШапки);  	
	
	// Подготоваливаем данные

	ТаблицаДанных		= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_МесяцыУправления"];
	БудетСтрок			= ТаблицаДанных.Количество();
	БудетКолонок		= 3;
	МассивДанных		= Новый Массив(БудетКолонок, Макс(БудетСтрок, 1));
	
	Для НомерСтроки = 0 По БудетСтрок - 1 Цикл 
		МассивДанных[0][НомерСтроки] = ТаблицаДанных[НомерСтроки]["Месяц"];
		МассивДанных[1][НомерСтроки] = ТаблицаДанных[НомерСтроки]["НачалоУправления"];
		МассивДанных[2][НомерСтроки] = ТаблицаДанных[НомерСтроки]["ОкончаниеУправления"];
	КонецЦикла;	
	
	// Подготоваливаем строки и выводим данные

	НачальнаяСтрока	= СтраницаРасчета.ВсегоСтрок + 1;
	ВысотаСтроки	= ШаблонСтроки.Rows.Count; 

	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонСтроки, Ложь, Ложь, ВысотаСтроки);  	

	Если БудетСтрок > 1 Тогда
		ОбластьЭталон = СтраницаРасчета.Страница.Range(Формат(НачальнаяСтрока, "ЧРД=,; ЧН=; ЧГ=") + ":" + Формат(НачальнаяСтрока, "ЧРД=,; ЧН=; ЧГ="));
		Для н = 2 По БудетСтрок Цикл
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВставитьОбласть(СтраницаРасчета, ОбластьЭталон, , , , ВысотаСтроки, Ложь);		
		КонецЦикла;
	КонецЕсли;

	КонечнаяСтрока = СтраницаРасчета.ВсегоСтрок;			

	ОбластьДанных = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "B", КонечнаяСтрока, "D"));
	ОбластьДанных.FormulaLocal = Новый COMSafeArray(МассивДанных, "VT_VARIANT");
	ОбластьДанных.Rows.Group();
	
	// Заполняем формулы

	Если НачальнаяСтрока <> КонечнаяСтрока Тогда
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelВыполнитьАвтозаполнениеОбласти(
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрока, "E", КонечнаяСтрока, "F")),
			СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(КонечнаяСтрока, "E", КонечнаяСтрока, "F")));	
	КонецЕсли;	
	
	// Область итогов
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонИтогов, Ложь, Ложь); 
	
	СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 1;
	
	// Формируем описание области
	
	ОбластьМесяцыУправления = Новый Структура;
	ОбластьМесяцыУправления.Вставить("НачальнаяСтрока",			НачальнаяСтрока);
	ОбластьМесяцыУправления.Вставить("КонечнаяСтрока",			КонечнаяСтрока);
	ОбластьМесяцыУправления.Вставить("КолонкаДнейВУправлении",	"E");
	ОбластьМесяцыУправления.Вставить("КолонкаДнейВМесяце",		"F");
	
	СтраницаРасчета.Области.Вставить("МесяцыУправления", ОбластьМесяцыУправления); 	
	
	Возврат ОбластьМесяцыУправления; 	
	
КонецФункции

&НаКлиенте
Процедура ВывестиКонтрольСуммыВознагражденияExcel(ДанныеРасшифровки, Расшифровка)
	
	СтраницаРасчета			= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонСтраницыРасчета	= Расшифровка.Шаблон.ПараметрыЛистов["Расчет"].Страница;

	Если ДанныеРасшифровки.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов") Тогда
		
		ШаблонТаблицы	= ШаблонСтраницыРасчета.Range("КонтрольСуммыВознаграждения");	
		ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(СтраницаРасчета, ШаблонТаблицы, Ложь, Ложь);  	
		
		ЯчейкаНорматив			= РаботаСВнешнимиСистемамиКлиентСервер.ExcelНайтиОбластьПоПараметру(ОбластьВставки, "Норматив");
		ЯчейкаСЧАНаКонецРынок	= СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонецРынок"];	
		ЯчейкаСЧАНаКонецБаланс	= СтраницаРасчета.КлючевыеЯчейки["СЧАНаКонецБаланс"];	
		ЯчейкаСЧАНаКонец		= ?(ЯчейкаСЧАНаКонецРынок = Неопределено, ЯчейкаСЧАНаКонецБаланс, ЯчейкаСЧАНаКонецРынок);
		
		// Сообщаем, если не удалось определить СЧА (не выведена или не ясно по балансу она или по рынку)
		
		Если ЯчейкаСЧАНаКонец = Неопределено Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В расшифровке расчета отсутствуют данные о СЧА на конец периода. Контроль суммы вознаграждения '%1' не выполнен.", ДанныеРасшифровки.СчетДоверительногоУправления));
		ИначеЕсли ЯчейкаСЧАНаКонецРынок <> Неопределено И ЯчейкаСЧАНаКонецБаланс <> Неопределено Тогда	
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Контроль суммы вознаграждения '%1' выполнен по рыночной СЧА.", ДанныеРасшифровки.СчетДоверительногоУправления));
		КонецЕсли;
		
		ЗначениеНорматива	= ?(ЯчейкаСЧАНаКонец = Неопределено, "=НД()", "=" + ЯчейкаСЧАНаКонец.Address(Ложь, Ложь) + " * 1%");
		ЗначениеПревышения	= СтрШаблон("=ЕСЛИ(%1>%2;%1-%2;0)", СтраницаРасчета.КлючевыеЯчейки["СуммарноеВознаграждение"].Address(Ложь, Ложь), ЯчейкаНорматив.Address(Ложь, Ложь));		
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ОписаниеНорматива",			"1% от СЧА на конец периода");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Норматив",					ЗначениеНорматива);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ОписаниеПревышенияНорматива", "Превышение вознаграждения над 1% от СЧА");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ПревышениеНорматива",			ЗначениеПревышения);
		
		СтраницаРасчета.ВсегоСтрок = СтраницаРасчета.ВсегоСтрок + 2;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВознаграждениеУдержанноеРанееНаТитульнуюСтраницу(ТитульнаяСтраница, СтраницаРасчета, ШаблонПоказатель, ЯчейкаВознаграждениеУплаченноеСНачалаДоговора, ЯчейкаОграничениеОбщегоРазмераВознаграждения)
	
	ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Вознаграждение управляющего, удержанное ранее");
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченноеВВалютеУчета"].Address(Ложь, Ложь, , Истина));
	
	Если ЯчейкаВознаграждениеУплаченноеСНачалаДоговора <> Неопределено Тогда 
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Вознаграждение управляющего, удержанное с начала действия договора");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + ЯчейкаВознаграждениеУплаченноеСНачалаДоговора.Address(Ложь, Ложь, , Истина));
	КонецЕсли;
	
	Если ЯчейкаОграничениеОбщегоРазмераВознаграждения <> Неопределено Тогда 
		ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонПоказатель);	
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "Показатель",			"Ограничение общего размера вознаграждения с начала действия договора");
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЗначениеПоказателя",	"=" + ЯчейкаОграничениеОбщегоРазмераВознаграждения.Address(Ложь, Ложь, , Истина));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ВывестиТелоТитульнойСтраницыExcel(ДанныеРасшифровки, Расшифровка)
	
	ТитульнаяСтраница		= Расшифровка.Результат.ПараметрыЛистов["Титульная страница"];
	ШаблонТитульнойСтраницы	= Расшифровка.Шаблон.ПараметрыЛистов["Титульная страница"];
	
	ОбластьТело = ТитульнаяСтраница.Области.Получить("Тело");
	
	Если ОбластьТело = Неопределено Тогда
		
		ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "Тело" + ДанныеРасшифровки.ШаблонРасшифровки);
		ОбластьТело		= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти);
		
		ТитульнаяСтраница.Области.Вставить("Тело", ОбластьТело);
		
	КонецЕсли;	
	
	Возврат ОбластьТело;
	
КонецФункции

&НаКлиенте
Функция ВывестиДвиженияАктивовНаТитульнуюСтраницу(ДанныеРасшифровки, РасшифровкаРасчетаПоБазе, Расшифровка, ОбластьДвиженияАктивов)
	
	ТитульнаяСтраница			= Расшифровка.Результат.ПараметрыЛистов["Титульная страница"];
	СтраницаРасчета				= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ШаблонТитульнойСтраницы		= Расшифровка.Шаблон.ПараметрыЛистов["Титульная страница"];
	ОбщиеПараметрыЗаполнения	= ДанныеРасшифровки.ОбщиеПараметрыЗаполнения;
	
	ОбластьРезультат = ТитульнаяСтраница.Области.Получить("ДвиженияАктивов" + ДанныеРасшифровки.ШаблонРасшифровки);
	
	Если ОбластьРезультат = Неопределено Тогда
		
		НачальнаяСтрокаОбласти = ТитульнаяСтраница.ВсегоСтрок;
		
		Если ДанныеРасшифровки.ШаблонРасшифровки = "2023"
			Или ДанныеРасшифровки.ШаблонРасшифровки = "2024"
		Тогда
			#Область Стандартный_2023_2024
			
			ШаблонШапки = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(
				ШаблонТитульнойСтраницы, "ШапкаВводВыводАктивов<Год>", ДанныеРасшифровки.ШаблонРасшифровки);
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапки, Ложь, Ложь);
			
			ШаблонСтрокаРасшифровки = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(
				ШаблонТитульнойСтраницы, "СтрокаВводВыводАктивов<Год>", ДанныеРасшифровки.ШаблонРасшифровки);
			
			ВсегоВводов = РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета[
				"_ВводыАктивовСНачалаГодаРазвернуто" + ?(ОбластьДвиженияАктивов.СуффиксПоказателей = "Рынок", "", ОбластьДвиженияАктивов.СуффиксПоказателей)].Количество();
			ВсегоВыводов	= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"].Количество();
			ВсегоДвижений	= Макс(ВсегоВводов, ВсегоВыводов);
			НомерДвижения	= 1;
			
			Пока НомерДвижения <= ВсегоДвижений Цикл
				
				ТекущаяСтрокаДвиженияАктивов = ОбластьДвиженияАктивов.НачальнаяСтрока + ОбластьДвиженияАктивов.ВысотаСтроки * (НомерДвижения - 1);
				
				Если НомерДвижения <= ВсегоВводов Тогда
					ДатаВвода	= "=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДатаВвода).Address(Ложь, Ложь, , Истина);
					СуммаВвода	= "=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВвода).Address(Ложь, Ложь, , Истина);
					ДнейДоВвода	= "=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДнейДоВвода).Address(Ложь, Ложь, , Истина);
				Иначе
					ДатаВвода	= "";
					СуммаВвода	= "";
					ДнейДоВвода	= "";
				КонецЕсли;
				
				ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонСтрокаРасшифровки, Ложь, Ложь);	
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаВвода", ДатаВвода);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВвода", СуммаВвода);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДнейДоВвода", ДнейДоВвода);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаВывода",
					"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДатаВывода).Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВывода",
					"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВывода).Address(Ложь, Ложь, , Истина));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДнейДоВывода",
					"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаДнейДоВывода).Address(Ложь, Ложь, , Истина));
				
				НомерДвижения = НомерДвижения + 1;
				
			КонецЦикла;
			
			ШаблонОбласти = ПолучитьИменованныйДиапазонExcelПоГодовомуШаблону(ШаблонТитульнойСтраницы, "ПодвалВводВыводАктивов<Год>", ДанныеРасшифровки.ШаблонРасшифровки);
			
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВвода",
				"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + ОбластьДвиженияАктивов.СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВывода",
				"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + ОбластьДвиженияАктивов.СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
			
			#КонецОбласти
		ИначеЕсли ДанныеРасшифровки.ШаблонРасшифровки = "ППА" Тогда
			#Область ППА
			
			// Вводы
			ШаблонШапки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаВводАктивов" + ДанныеРасшифровки.ШаблонРасшифровки);
			ОбластьВставки = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапки, Ложь, Ложь);
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВидСредствДУ #ПД=Родительный", ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);
			
			ШаблонСтрокаРасшифровки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "СтрокаВводАктивов" + ДанныеРасшифровки.ШаблонРасшифровки);
			ВводыАктивов			= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВводыАктивовСНачалаГодаРазвернуто" + ?(ОбластьДвиженияАктивов.СуффиксПоказателей = "Рынок", "", ОбластьДвиженияАктивов.СуффиксПоказателей)];
			ВсегоВводов				= ВводыАктивов.Количество();
			
			Для НомерДвижения = 1 По ВсегоВводов Цикл
				
				ОбластьВставки				 = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонСтрокаРасшифровки, Ложь, Ложь);	
				ТекущаяСтрокаДвиженияАктивов = ОбластьДвиженияАктивов.НачальнаяСтрока + ОбластьДвиженияАктивов.ВысотаСтроки * (НомерДвижения - 1);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НомерСтроки", НомерДвижения);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаВвода",	Формат(ВводыАктивов[НомерДвижения-1]["ДатаПлатежногоДокумента"], "ДФ=dd.MM.yyyy"));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НомерВвода",	ВводыАктивов[НомерДвижения-1]["НомерПлатежногоДокумента"]);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВвода",
					"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВвода).Address(Ложь, Ложь, , Истина));
				
			КонецЦикла;
			
			ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ПодвалВводАктивов" + ДанныеРасшифровки.ШаблонРасшифровки);
			ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВвода",
				"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВводов" + ОбластьДвиженияАктивов.СуффиксПоказателей].Address(Ложь, Ложь, , Истина));
			
			// Выводы
			
			ШаблонШапки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ШапкаВыводАктивов" + ДанныеРасшифровки.ШаблонРасшифровки);
			ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонШапки, Ложь, Ложь);	
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ВидСредствДУ #ПД=Родительный", ОбщиеПараметрыЗаполнения.ВидСредствДУ_РП, Истина);	
			
			ШаблонСтрокаРасшифровки = ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "СтрокаВыводАктивов" + ДанныеРасшифровки.ШаблонРасшифровки);
			ВыводыАктивов			= РасшифровкаРасчетаПоБазе.ТаблицыРасшифровкиРасчета["_ВыводыАктивовСНачалаГодаРазвернуто"];
			ВсегоВыводов			= ВыводыАктивов.Количество();
			НачальнаяСтрокаВыводов	= ТитульнаяСтраница.ВсегоСтрок + 1;
			
			Для НомерДвижения = 1 По ВсегоВыводов Цикл
				
				ОбластьВставки				 = РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонСтрокаРасшифровки, Ложь, Ложь);
				ТекущаяСтрокаДвиженияАктивов = ОбластьДвиженияАктивов.НачальнаяСтрока + ОбластьДвиженияАктивов.ВысотаСтроки * (НомерДвижения - 1);
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НомерСтроки",	НомерДвижения);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ДатаВывода",	Формат(ВыводыАктивов[НомерДвижения-1]["ДатаПлатежногоДокумента"], "ДФ=dd.MM.yyyy"));
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "НомерВывода",	ВыводыАктивов[НомерДвижения-1]["НомерПлатежногоДокумента"]);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "ЦелиВывода",	ВыводыАктивов[НомерДвижения-1]["НазначениеПлатежа"]);
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВывода",
					"=" + СтраницаРасчета.Страница.Cells(ТекущаяСтрокаДвиженияАктивов, ОбластьДвиженияАктивов.КолонкаСуммаВывода).Address(Ложь, Ложь, , Истина));

			КонецЦикла;
			
			// Подберем высоту строк области, чтобы все цели вывода поместились
			
			Если ВсегоВыводов > 0 Тогда
				
				ОбластьВыводов = ТитульнаяСтраница.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(НачальнаяСтрокаВыводов, "", ТитульнаяСтраница.ВсегоСтрок, ""));
				
				РаботаСВнешнимиСистемамиКлиентСервер.ExcelАвтоподборВысотыСтрокОбласти(ОбластьВыводов);
					
			КонецЕсли;
			
			ШаблонОбласти	= ПолучитьИменованныйДиапазонExcel(ШаблонТитульнойСтраницы, "ПодвалВыводАктивов" + ДанныеРасшифровки.ШаблонРасшифровки);
			ОбластьВставки	= РаботаСВнешнимиСистемамиКлиентСервер.ExcelВывестиОбласть(ТитульнаяСтраница, ШаблонОбласти, Ложь, Ложь);
			
			РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьВставки, "СуммаВывода",
				"=" + СтраницаРасчета.КлючевыеЯчейки["СуммаВыводов" + ОбластьДвиженияАктивов.СуффиксПоказателей].Address(Ложь, Ложь, , Истина));

			#КонецОбласти
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		ОбластьРезультат = СтраницаРасчета.Страница.Range(РаботаСВнешнимиСистемамиКлиентСервер.ExcelАдресОбластиСтрокой(
			НачальнаяСтрокаОбласти, "", ТитульнаяСтраница.ВсегоСтрок, ""));
		
		ТитульнаяСтраница.Области.Вставить("ДвиженияАктивов" + ДанныеРасшифровки.ШаблонРасшифровки, ОбластьРезультат);
		
	КонецЕсли;	
	
	Возврат ОбластьРезультат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЯчейкуРасчетаВознаграждения(Страница, Показатель, Область, НачисляетсяНарастающимИтогом, ВознаграждениеЗаУправление, ВключатьВИтоговуюСумму = Истина, ВыводитьНаТитульнойСтранице = Истина)
	
	Страница.КлючевыеЯчейки["РасчетВознаграждения"].Добавить(
		Новый Структура("Показатель, Область, НачисляетсяНарастающимИтогом, ВознаграждениеЗаУправление, ВключатьВИтоговуюСумму, ВыводитьНаТитульнойСтранице",
			Показатель, Область, НачисляетсяНарастающимИтогом, ВознаграждениеЗаУправление, ВключатьВИтоговуюСумму, ВыводитьНаТитульнойСтранице));
	
КонецПроцедуры

&НаКлиенте
Функция ПредставленияСуммыДляПечати(Сумма, ОтображатьНулевуюСуммуКакОшибку = Ложь)
	
	ПредставленияСуммы = Новый Структура("Сумма, СуммаРублей, СуммаПрописьюРублей, СуммаПрописьюБезКопеек", "###", "###", "###", "###");	
	
	Если Сумма = NULL Или Сумма = 0 И ОтображатьНулевуюСуммуКакОшибку Тогда
		Возврат ПредставленияСуммы;
	КонецЕсли;
	
	ПредставленияСуммы.Сумма					= Формат(Сумма, "ЧДЦ=2");
	ПредставленияСуммы.СуммаПрописьюРублей		= ЧислоПрописью(Сумма, "Л=ru_RU; ДП=Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
	ПредставленияСуммы.СуммаПрописьюБезКопеек	= ЧислоПрописью(Цел(Сумма), "Л=ru_RU; НП=Ложь", ",,,,,,,,0");
	ПредставленияСуммы.СуммаРублей				= СтрЗаменить(ПредставленияСуммы.СуммаПрописьюРублей, ПредставленияСуммы.СуммаПрописьюБезКопеек, Формат(Цел(Сумма), "ЧН="));
	
	Возврат ПредставленияСуммы;

КонецФункции

&НаКлиенте
Процедура УстановитьЗначенияПараметровАкта(ОбластьАкта, ДанныеРасшифровки, ДанныеОбОрганизации, ОбщиеПараметрыЗаполнения, ПредставлениеСуммыВознаграждения)  
	
	ПараметрыАкта = ПараметрыОбластиExcel(ОбластьАкта);
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "КраткоеНаименованиеУК",			ДанныеОбОрганизации.КраткоеНаименованиеОрганизации, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "УчредительУправления",			ДанныеРасшифровки.УчредительУправления, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "КраткоеНаименованиеУчредителя",	ДанныеРасшифровки.КраткоеНаименованиеУчредителяУправления, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ДоговорДУ",						ОбщиеПараметрыЗаполнения.ДоговорДУ, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "НомерДоговораДУ",				ОбщиеПараметрыЗаполнения.НомерДоговораДУ, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ДатаДоговораДУ",					ОбщиеПараметрыЗаполнения.ДатаДоговораДУ, Истина);
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ДатаРасчета",								Формат(Объект.ДатаРасчета, "ДФ='«dd» MMMM yyyy ''г.'''"));  
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПериодРасчета",								"с " + ОбщиеПараметрыЗаполнения.НачалоБазовогоПериодаСтрокой + " по " + ОбщиеПараметрыЗаполнения.КонецБазовогоПериодаСтрокой, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ГодПериодаРасчета",							Формат(ДанныеРасшифровки.КонецРасчетногоПериода, "ДФ=yyyy"), Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ФинансовыйПериодРасчета",					ОбщиеПараметрыЗаполнения.ПредставлениеФинансовогоПериода, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "НачалоБазовогоПериода #ДФ='dd MMMM yyyy'",	ОбщиеПараметрыЗаполнения.НачалоБазовогоПериода_ddMMMMyyyy, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "КонецБазовогоПериода #ДФ='dd MMMM yyyy'",	ОбщиеПараметрыЗаполнения.КонецБазовогоПериода_ddMMMMyyyy, Истина);
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУК",					Строка(ЭтаФорма.Подписант), Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУКДолжность",			ЭтаФорма.ПодписантДолжность, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителя",			ОбщиеПараметрыЗаполнения.ПодписантОтУчредителя, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяДолжность",	ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяДолжность, Истина);
	
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "Сумма",							ПредставлениеСуммыВознаграждения.Сумма, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "СуммаРублей",					ПредставлениеСуммыВознаграждения.СуммаРублей, Истина);
	РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "СуммаПрописьюРублей",			ПредставлениеСуммыВознаграждения.СуммаПрописьюРублей, Истина);
	
	Если СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "ХантыМансийский")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "ЦКМГПУ")
		Или СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "Сургутнефтегаз") Тогда

		ПодписантОтУКПолноеФИО						= ПодменитьПустуюСтроку(ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО, Строка(ЭтаФорма.Подписант));
		ПодписантОтУКПолноеФИО_РП					= ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО_РП;
		ПодписантОтУКДолжность_РП					= ОбщиеПараметрыЗаполнения.ПодписантОтУКДолжность_РП;
		ПодписантОтУКОснованиеПолномочий_РП			= ОбщиеПараметрыЗаполнения.ПодписантОснованиеПолномочий_РП;
		ПодписантОтУчредителяПолноеФИО				= ПодменитьПустуюСтроку(ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяПолноеФИО, ОбщиеПараметрыЗаполнения.ПодписантОтУчредителя);
		ПодписантОтУчредителяПолноеФИО_РП			= ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяПолноеФИО_РП;
		ПодписантОтУчредителяДолжность_РП			= ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяДолжность_РП;
		ПодписантОтУчредителяОснованиеПолномочий_РП	= ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяОснованиеПолномочий_РП;
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантБухгалтерОтУК",									  ПодменитьПустуюСтроку(Строка(ЭтаФорма.ПодписантБухгалтер),		"________________"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантБухгалтерОтУКДолжность",						  ПодменитьПустуюСтроку(ЭтаФорма.ПодписантБухгалтерДолжность,		"Главный бухгалтер"), Истина);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУКПолноеФИО",									  ПодменитьПустуюСтроку(ПодписантОтУКПолноеФИО,						"______________________________________"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУКПолноеФИО #ПД=Родительный",					  ПодменитьПустуюСтроку(ПодписантОтУКПолноеФИО_РП,					"______________________________________"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУКДолжность #ПД=Родительный",					  ПодменитьПустуюСтроку(ПодписантОтУКДолжность_РП,					"______________________________________"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУКОснованиеПолномочий #ПД=Родительный",		  ПодменитьПустуюСтроку(ПодписантОтУКОснованиеПолномочий_РП,		"______________________________________"), Истина);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяПолноеФИО",					  		  ПодменитьПустуюСтроку(ПодписантОтУчредителяПолноеФИО,				"______________________________________"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяПолноеФИО #ПД=Родительный",			  ПодменитьПустуюСтроку(ПодписантОтУчредителяПолноеФИО_РП,			"______________________________________"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяДолжность #ПД=Родительный",			  ПодменитьПустуюСтроку(ПодписантОтУчредителяДолжность_РП,			"______________________________________"), Истина);
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяОснованиеПолномочий #ПД=Родительный", ПодменитьПустуюСтроку(ПодписантОтУчредителяОснованиеПолномочий_РП,"______________________________________"), Истина);
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПолноеНаименованиеУчредителяУправления",					  ДанныеРасшифровки.ПолноеНаименованиеУчредителяУправления, Истина);
		
		Если ОбщиеПараметрыЗаполнения.АвтоформированиеОснованияПолномочийПодписанта_РП И ПараметрыАкта["ПодписантОтУКОснованиеПолномочий #ПД=Родительный"] <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Проверьте корректность основания полномочий подписанта УК в родительном падеже: %1", ОбщиеПараметрыЗаполнения.ПодписантОснованиеПолномочий_РП));
		КонецЕсли;
		
		Если ОбщиеПараметрыЗаполнения.АвтоформированиеПолногоФИОПодписантаУК_РП И ПараметрыАкта["ПодписантОтУКПолноеФИО #ПД=Родительный"] <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Проверьте корректность полного ФИО подписанта УК в родительном падеже: %1", ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО_РП));
		КонецЕсли;
		
		Если ОбщиеПараметрыЗаполнения.АвтоформированиеДолжностиПодписантаУК_РП И ПараметрыАкта["ПодписантОтУКДолжность #ПД=Родительный"] <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Проверьте корректность должности подписанта УК в родительном падеже: %1", ОбщиеПараметрыЗаполнения.ПодписантОтУКДолжность_РП));
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(ДанныеРасшифровки.ШаблонАкта, "Будущее2023") Тогда	  
		
		ПодписантОтУКДолжность_РП					= ОбщиеПараметрыЗаполнения.ПодписантОтУКДолжность_РП;
		ПодписантОтУКПолноеФИО_РП					= ОбщиеПараметрыЗаполнения.ПодписантОтУКПолноеФИО_РП;   
		ПодписантОснованиеПолномочий_РП				= ОбщиеПараметрыЗаполнения.ПодписантОснованиеПолномочий_РП;
		ПодписантОтУчредителяПолноеФИО_РП			= ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяПолноеФИО_РП;  
		ПодписантОтУчредителяОснованиеПолномочий_РП	= ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяОснованиеПолномочий_РП;
		ПодписантОтУчредителяДолжность_РП			= ОбщиеПараметрыЗаполнения.ПодписантОтУчредителяДолжность_РП;

		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУКДолжность_РП", 								ПодменитьПустуюСтроку(ПодписантОтУКДолжность_РП, 					"______________________________________"), Истина); 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУКПолноеФИО_РП", 								ПодменитьПустуюСтроку(ПодписантОтУКПолноеФИО_РП, 					"______________________________________"), Истина); 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОснованиеПолномочий_РП", 						ПодменитьПустуюСтроку(ПодписантОснованиеПолномочий_РП, 				"______________________________________"), Истина); 
		
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяПолноеФИО_РП", 						ПодменитьПустуюСтроку(ПодписантОтУчредителяПолноеФИО_РП, 			"______________________________________"), Истина); 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяОснованиеПолномочий_РП",			ПодменитьПустуюСтроку(ПодписантОтУчредителяОснованиеПолномочий_РП, 	"______________________________________"), Истина); 
		РаботаСВнешнимиСистемамиКлиентСервер.ExcelУстановитьЗначениеПараметраОбласти(ОбластьАкта, "ПодписантОтУчредителяДолжность_РП", 						ПодменитьПустуюСтроку(ПодписантОтУчредителяДолжность_РП, 			"______________________________________"), Истина); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ФормулаСуммыРассчитанныхВознагражденийЗаУспех(Расшифровка, ДанныеРасшифровки, ВнешниеСсылки = Ложь, ЗаВычетомРанееУплаченногоПриНачисленииНарастающимИтогом = Ложь)
	
	Возврат ФормулаСуммыРассчитанныхВознаграждений(Расшифровка, ДанныеРасшифровки, Ложь, ВнешниеСсылки, ЗаВычетомРанееУплаченногоПриНачисленииНарастающимИтогом);
	
КонецФункции

&НаКлиенте
Функция ФормулаСуммыРассчитанныхВознагражденийЗаУправление(Расшифровка, ДанныеРасшифровки, ВнешниеСсылки = Ложь, ЗаВычетомРанееУплаченногоПриНачисленииНарастающимИтогом = Ложь)
	
	Возврат ФормулаСуммыРассчитанныхВознаграждений(Расшифровка, ДанныеРасшифровки, Истина, ВнешниеСсылки, ЗаВычетомРанееУплаченногоПриНачисленииНарастающимИтогом);
	
КонецФункции

&НаКлиенте
Функция ФормулаСуммыРассчитанныхВознаграждений(Расшифровка, ДанныеРасшифровки, ЗаУправление, ВнешниеСсылки = Ложь, ЗаВычетомРанееУплаченногоПриНачисленииНарастающимИтогом = Ложь)
	
	ФормулаСуммы						= "";
	СтраницаРасчета						= Расшифровка.Результат.ПараметрыЛистов["Расчет"];
	ЕстьНачисляемоеНарастающимИтогом	= Ложь;
	
	// Добавляем суммы
	
	АдресаЯчеек = Новый Массив;

	Для Каждого ЭлементРасчетаВознаграждения Из СтраницаРасчета.КлючевыеЯчейки["РасчетВознаграждения"] Цикл
		
		Если (ЭлементРасчетаВознаграждения.ВознаграждениеЗаУправление = Истина) = ЗаУправление Тогда
			
			АдресаЯчеек.Добавить(ЭлементРасчетаВознаграждения.Область.Address(Ложь, Ложь, , ВнешниеСсылки));
			
			Если ЭлементРасчетаВознаграждения.НачисляетсяНарастающимИтогом Тогда
				ЕстьНачисляемоеНарастающимИтогом = Истина
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ФормулаСуммы = СтрСоединить(АдресаЯчеек, "+");
	
	// Вычитаем ранее уплаченное вознаграждение
	
	Если ЗаВычетомРанееУплаченногоПриНачисленииНарастающимИтогом И ЕстьНачисляемоеНарастающимИтогом Тогда
		
		Если СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"] = Неопределено Тогда
			ВознаграждениеУплаченное = Формат(ДанныеРасшифровки.ВознаграждениеУплаченноеСНачалаГода, "ЧДЦ=2; ЧРД=,; ЧГ=");	
		Иначе
			ВознаграждениеУплаченное = СтраницаРасчета.КлючевыеЯчейки["ВознаграждениеУплаченное"].Address(Ложь, Ложь, , ВнешниеСсылки);	
		КонецЕсли;		
		
		ФормулаСуммы = ФормулаСуммы + "-" + ВознаграждениеУплаченное;
		
	КонецЕсли;
	
	Возврат ФормулаСуммы;
	
КонецФункции

&НаКлиенте
Функция ФормулаСуммРасходовПоДоговоруСоСпецдепозитарием(Расшифровка, ВидыЗадолженности, ВнешниеСсылки = Ложь)
	
	СтраницаРасчета						= Расшифровка.Результат.ПараметрыЛистов["Расчет"];	
	РасходыПоДоговоруСоСпецдепозитарием	= СтраницаРасчета.КлючевыеЯчейки["РасходыПоДоговоруСоСпецдепозитарием"];
	АдресаЯчеек							= Новый Массив;

	Для Каждого ВидЗадолженности Из ВидыЗадолженности Цикл
		
		ЯчейкаСуммы = РасходыПоДоговоруСоСпецдепозитарием[ВидЗадолженности];
		
		Если ЯчейкаСуммы <> Неопределено Тогда
			АдресаЯчеек.Добавить(ЯчейкаСуммы.Address(Ложь, Ложь, , ВнешниеСсылки));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(АдресаЯчеек, "+");
	
КонецФункции

&НаСервереБезКонтекста
Функция СклоненияСтроки(СклоняемаяСтрока, ОписаниеСтроки, ФорматнаяСтрока)
	
	Возврат ПолучитьСклоненияСтроки(СклоняемаяСтрока, ОписаниеСтроки, ФорматнаяСтрока);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолноеФИО(ФизЛицо, Период, Организация)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыСотрудниковОрганизации.Фамилия + "" "" + РеквизитыСотрудниковОрганизации.Имя + ВЫБОР
		|		КОГДА РеквизитыСотрудниковОрганизации.Отчество = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" "" + РеквизитыСотрудниковОрганизации.Отчество
		|	КОНЕЦ КАК ПолноеФИО
		|ИЗ
		|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ФизЛицо) КАК РеквизитыСотрудниковОрганизации");
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("Период",	 Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ПолноеФИО, Неопределено);
	
КонецФункции

&НаКлиенте
Функция ПараметрыОбластиExcel(Область)
	
	// Идея такая:
	// 1. Получаем все параметры и вызываем функцию ExcelУстановитьЗначениеПараметраОбласти только для имеющих параметров.
	//    Профит небольшой, а при малом количестве параметров даже наоборот проигрыш по времени, т.к. функция сама по себе весьма быстра.
	//    Но вот, например, проверку и уведомление о корректности значений можно будет делать только при наличии конкретного параметра.
	// 2. Можно получить параметр и его формат. Это позволит прямо в шаблоне указывать стандартный формат (например, для дат),
	//    а при обработке в 1С применять этот формат к значению параметра.
	
	xlLastCell		= 11;
	ВсеЯчейки		= Область.Range(Область.Cells(1, 1), Область.SpecialCells(xlLastCell)).Value2.Выгрузить(); // На самом деле это диапазон с начала области до конца листа
	ВсеПараметры	= Новый Соответствие;
	
	Для Каждого МассивКолонок Из ВсеЯчейки Цикл
		
		Для Каждого Ячейка Из МассивКолонок Цикл
			
			ПозицияСкобки = СтрНайти(Ячейка, "[");
			
			Пока ПозицияСкобки > 0 Цикл
				
				ПозицияСледующейСкобки		= СтрНайти(Ячейка, "[", , ПозицияСкобки + 1);
				ПозицияЗакрывающейСкобки	= СтрНайти(Ячейка, "]", , ПозицияСкобки + 1);
				
				Если ПозицияЗакрывающейСкобки > 0 Тогда
					
					Если ПозицияЗакрывающейСкобки < ПозицияСледующейСкобки Или ПозицияСледующейСкобки = 0 Тогда
						
						Параметр = СокрЛП(Сред(Ячейка, ПозицияСкобки + 1, ПозицияЗакрывающейСкобки - ПозицияСкобки - 1));
						
						Если Не ПустаяСтрока(Параметр) Тогда						
							ВсеПараметры.Вставить(Параметр, "");
						КонецЕсли;
						
					Иначе
						
						Сообщить("Некорректно заданы параметры: " + Ячейка);
						Прервать;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ПозицияСкобки = ПозицияСледующейСкобки;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ВсеПараметры;
	
КонецФункции

&НаКлиенте
Функция ПодменитьПустуюСтроку(ПроверямаяСтрока, СтрокаЗамены)
	
	Возврат ?(ПустаяСтрока(ПроверямаяСтрока), СтрокаЗамены, ПроверямаяСтрока);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОшибку(ТекстОшибки)
			
	ЗаписьЖурналаРегистрации("Расчет вознаграждения УК. Формирование печатной формы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Обработки.РасчетВознагражденияУправляющего, , ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область Начисление_задолженности_по_вознаграждению

&НаСервере
Процедура СоздатьНачисленияНаСервере(ДанныеДляСтатистики)
	
	ВремяНачала = ТекущаяДатаСеанса();
	ДанныеДляСтатистики.Вставить("СоздатьНачисленияНаСервере", "Старт в: " + Формат(ВремяНачала, "ДЛФ=T") + "."); 
	
	// Сначала проверим даты запрета редактирования
	МассивСчетовДУ = Новый Массив;
	СтрокиДляОбработки = ВознагражденияУправляющего.НайтиСтроки(Новый Структура("Флажок", Истина));
	Для Каждого СтрокаДляОбработки из СтрокиДляОбработки Цикл
		МассивСчетовДУ.Добавить(СтрокаДляОбработки.СчетДоверительногоУправления);
	КонецЦикла;
	
	Если МассивСчетовДУ.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не отмечены строки для формирования начислений задолженности");
		Возврат;
	КонецЕсли;
	
	ДанныеДляСтатистики.СоздатьНачисленияНаСервере = ДанныеДляСтатистики.СоздатьНачисленияНаСервере + " Отбор по счету ДУ: " + РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивСчетовДУ, ",");
	
	Если ЕстьЗапретРедактированияДанных(МассивСчетовДУ, Объект.Организация, Объект.ДатаРасчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начисления задолженности не сформированы");
		ДанныеДляСтатистики.СоздатьНачисленияНаСервере = ДанныеДляСтатистики.СоздатьНачисленияНаСервере + Символы.ПС + "Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаВознагражденияУправляющего Из ВознагражденияУправляющего Цикл
		
		Если Не СтрокаВознагражденияУправляющего.Флажок Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаВознагражденияУправляющего.ОшибкаРасчета Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При расчете вознаграждения '" + Строка(СтрокаВознагражденияУправляющего.СчетДоверительногоУправления) + "' произошла ошибка. Начисление задолженности выполнено не будет");	
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВознагражденияУправляющего.Начисление) Тогда
			
			Начисление = СтрокаВознагражденияУправляющего.Начисление.ПолучитьОбъект();
			Начисление.Основания.Очистить();
			
		Иначе
			
			Начисление = Документы.НачислениеЗадолженности.СоздатьДокумент();
			Начисление.Дата                         = РаботаСДокументами.ПолучитьВремяДокумента(Объект.ДатаРасчета, Начисление.Ссылка);
			Начисление.Организация                  = Объект.Организация;
			Начисление.СчетДоверительногоУправления = СтрокаВознагражденияУправляющего.СчетДоверительногоУправления;
			Начисление.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего;
			Начисление.Контрагент                   = Объект.Организация.ЮрФизЛицо;
			Начисление.РасчетныйСчет				= РасчетныйСчетИзИсполнителейПоДенежнымСредствам(Объект.Организация, СтрокаВознагражденияУправляющего.СчетДоверительногоУправления, Объект.ДатаРасчета);
			Начисление.РасчетныйСчетКонтрагента     = Объект.РасчетныйСчет;
			Начисление.МестоХранения                = Справочники.МестаХранения.ВнебиржевойРынок;
			Начисление.Валюта                       = Объект.Организация.ВалютаУчета;
			Начисление.ВидВходящегоДокумента        = Перечисления.ВидыВходящихДокументов.Акт;
			Начисление.НомерВходящегоДокумента      = "б\н";
			Начисление.ДатаВходящегоДокумента       = Объект.ДатаРасчета;
			Начисление.Ответственный                = РаботаСПользователями.ТекущийПользователь();
			Начисление.ДатаПолученияДокумента		= Начисление.Дата;
			
			Если Объект.ВариантРасчета = 2 Тогда
				Начисление.Вознаграждение = Истина;
			КонецЕсли;
			
			Начисление.НачалоПериодаНачисления		= СтрокаВознагражденияУправляющего.ПериодНачисления.ДатаНачала;
			Начисление.ОкончаниеПериодаНачисления	= СтрокаВознагражденияУправляющего.ПериодНачисления.ДатаОкончания;
			
			Начисление.ПрочиеДоходыИРасходы                  = Объект.ПрочиеДоходыИРасходы;
			Начисление.ГруппаФинансовогоУчетаДоходовРасходов = БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаПоПрочимДоходамРасходам(
				Объект.ДатаРасчета, Объект.Организация, СтрокаВознагражденияУправляющего.СчетДоверительногоУправления, Начисление.ВидЗадолженности, Начисление.ПрочиеДоходыИРасходы);
			
		КонецЕсли;
		
		ПерваяСтрокаОснования = Начисление.Основания.Добавить();
		ПерваяСтрокаОснования.Сумма = СтрокаВознагражденияУправляющего.СуммаВознаграждения;
		ПерваяСтрокаОснования.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		
		Если Не Начисление.ПроверитьЗаполнение() Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка 
			Начисление.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	ДанныеДляСтатистики.СоздатьНачисленияНаСервере = ДанныеДляСтатистики.СоздатьНачисленияНаСервере + Символы.ПС + "Время выполнения метода: " + РассчитатьВремя(ВремяНачала);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчетныйСчетИзИсполнителейПоДенежнымСредствам(Организация, СчетДоверительногоУправления, Дата) 
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет			
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
			|ГДЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
			|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &Дата
			|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");
		
	Запрос.УстановитьПараметр("Дата",							Дата);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.РасчетныйСчет, Справочники.БанковскиеСчета.ПустаяСсылка());
	
КонецФункции		

&НаСервереБезКонтекста
Функция ЕстьЗапретРедактированияДанных(МассивСчетовДУ, Организация, ДатаПроверки)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДУ,
	|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Организация = &Организация
	|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления В(&МассивСчетовДУ)
	|	И ДатыЗапретаРедактирования.ГруппаЗапрета = &ГруппаЗапрета
	|	И ДатыЗапретаРедактирования.ДатаЗапретаРедактирования >= &Период";
	
	Запрос.УстановитьПараметр("Период",			ДатаПроверки);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("МассивСчетовДУ",	МассивСчетовДУ);
	Запрос.УстановитьПараметр("ГруппаЗапрета",	Перечисления.ГруппыЗапретаРедактирования.БэкОфис);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отказ = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета ДУ " + СокрЛП(Выборка.СчетДУ) + " запрещено редактирование данных. Дата запрета редактирования " + Формат(Выборка.ДатаЗапретаРедактирования, "ДФ=dd.MM.yyyy"), Выборка.СчетДУ,,, Отказ);
			
	КонецЦикла;	
	
	Возврат Отказ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗаполняемыеРеквизитыНачисленияПоУмолчанию(Организация)
	
	РеквизитыНачисления = Новый Структура("РасчетныйСчет, ПрочиеДоходыИРасходы");
	
	// ПрочиеДоходыИРасходы
	РеквизитыНачисления.ПрочиеДоходыИРасходы =
			Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по вознаграждению управляющего");
			
	// РасчетныйСчет
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Организация = &Организация
		|	И БанковскиеСчета.ЮрФизЛицо = ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ЮрФизЛицо
		|	И БанковскиеСчета.НомерСчета = &НомерСчета";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НомерСчета",  "40701810600001454785");
			
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РеквизитыНачисления.РасчетныйСчет = Выборка.Ссылка;
	Иначе
		РеквизитыНачисления.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
	Возврат РеквизитыНачисления;
	
КонецФункции

&НаСервере
Процедура СоздатьНачисленияИОбновитьДанныеНаСервере()
		
	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("СоздатьНачисленияИОбновитьДанныеНаСервере");
		
	СоздатьНачисленияНаСервере(ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики);
	
	ОбновитьНаСервере(ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики);
		
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
		
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ИзменитьСостояниеФлажковВознагражденияУправляющего(НовоеСостояние, ИмяРеквизитаФормы, Период = Неопределено)
	
	Для каждого СтрокаВознагражденияУправляющего Из ЭтаФорма[ИмяРеквизитаФормы] Цикл
		Если Период = Неопределено Тогда
			СтрокаВознагражденияУправляющего.Флажок = НовоеСостояние;
		ИначеЕсли СтрокаВознагражденияУправляющего.Период >= Период.ДатаНачала И СтрокаВознагражденияУправляющего.Период <= Период.ДатаОкончания Тогда
			СтрокаВознагражденияУправляющего.Флажок = НовоеСостояние;
		Иначе
			СтрокаВознагражденияУправляющего.Флажок = Не НовоеСостояние;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)
	// ВариантРасчета:
	//	0 - ИИС
	//	1 - Вознаграждения агента
	//	2 - ПИФ
	//	3 - НПФ, НПФ СС, ДУ юр./физ. лиц и прочие
	Объект		= ЭтаФорма.Объект;
	Элементы	= ЭтаФорма.Элементы;
	
	Элементы.СтраницаВознаграждениеУправляющего.Видимость							= (Объект.ВариантРасчета = 0 Или Объект.ВариантРасчета = 2 Или Объект.ВариантРасчета = 3);
	Элементы.СтраницаВознаграждениеАгента.Видимость 								= (Объект.ВариантРасчета = 1);
	Элементы.СтраницаВознаграждениеУправляющегоПлатаЗаРазмещение.Видимость			= (Объект.ВариантРасчета = 0);
	Элементы.СтраницаРасшифровкаРасчета.Видимость									= Не (Объект.ВариантРасчета = 2 Или Объект.ВариантРасчета = 3);
	
	Элементы.АгентскийДоговор.Видимость 											= (Объект.ВариантРасчета = 1);
	Элементы.ВидВознаграждения.Видимость 											= (Объект.ВариантРасчета = 3);
	Элементы.ПериодичностьРасчета.Видимость											= (Объект.ВариантРасчета = 3);
	Элементы.БазовыйПериод.Видимость												= (Объект.ВариантРасчета = 0 Или Объект.ВариантРасчета = 3);
	
	Элементы.ВознагражденияУправляющегоСтратегия.Видимость							= Не (Объект.ВариантРасчета = 2 Или Объект.ВариантРасчета = 3);
	Элементы.ВознагражденияУправляющегоОписание.Видимость							= (Объект.ВариантРасчета = 2 Или Объект.ВариантРасчета = 3);
	Элементы.ВознагражденияУправляющегоСтавка.Видимость								= Не (Объект.ВариантРасчета = 2 Или Объект.ВариантРасчета = 3);
	
	Элементы.ВознагражденияУправляющегоГруппаПечать.Видимость						= Не (Объект.ВариантРасчета = 3);
	Элементы.ВознагражденияУправляющегоКомандаПечатьРасчетаВознаграждения.Видимость	= (Объект.ВариантРасчета = 3);
	Элементы.КонтекстноеМенюКомандаПечатьРасчетаВознаграждения.Видимость			= (Объект.ВариантРасчета = 3);
	Элементы.ВознагражденияУправляющегоГруппаПодписант.Видимость					= (Объект.ВариантРасчета = 3);
	
	Элементы.ГруппаОтбор.Видимость													= (Объект.ВариантРасчета = 0 Или Объект.ВариантРасчета = 3);
	
	Элементы.ОтборСчетДоверительногоУправления.Видимость							= Не ЭтаФорма.ОтборСчетДоверительногоУправленияВСписке;
	Элементы.ОтборСчетДоверительногоУправленияСписок.Видимость						= ЭтаФорма.ОтборСчетДоверительногоУправленияВСписке;
	
	Элементы.ГруппаОтборКлиенты.Видимость											= (Объект.ВариантРасчета = 3);
	Элементы.ОтборКлиент.Видимость													= Элементы.ГруппаОтборКлиенты.Видимость И Не ЭтаФорма.ОтборКлиентВСписке;
	Элементы.ОтборКлиентСписок.Видимость											= Элементы.ГруппаОтборКлиенты.Видимость И ЭтаФорма.ОтборКлиентВСписке;
	
	Элементы.ГруппаОтборВидыДоговоровДУ.Видимость									= (Объект.ВариантРасчета = 3);
	Элементы.ОтборВидДоговораДоверительногоУправления.Видимость						= Элементы.ГруппаОтборВидыДоговоровДУ.Видимость И Не ЭтаФорма.ОтборВидДоговораДоверительногоУправленияВСписке;
	Элементы.ОтборВидДоговораДоверительногоУправленияСписок.Видимость				= Элементы.ГруппаОтборВидыДоговоровДУ.Видимость И ЭтаФорма.ОтборВидДоговораДоверительногоУправленияВСписке;
	
	Элементы.ОтборСтратегияИндивидуальногоИнвестирования.Видимость					= (Объект.ВариантРасчета = 0);
	
	Элементы.ГруппаКаталогФайловExcel.Видимость										= (Объект.ВариантРасчета = 3);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРежимаРасчетаНаСервере()
	
	Объект.ДатаРасчета = ПолучитьДатуРасчета(Объект.ВариантРасчета, Объект.ПериодичностьРасчета);
	
	ОбновитьСоставПечатныхФормНаСервере();
	
	ОбновитьПериодДляПечати(ЭтаФорма, Объект);
		
	ОбновитьПредставлениеОтбора(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуРасчета(ВариантРасчета, ПериодичностьРасчета)

	НоваяДатаРасчета = Неопределено;
	
	Если ВариантРасчета = 0 Тогда
		НоваяДатаРасчета = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2);
	ИначеЕсли ВариантРасчета = 2 Тогда
		НоваяДатаРасчета = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоМесяца(ТекущаяДата()), -1);
	ИначеЕсли ВариантРасчета = 3 Тогда
		
		// 1. для всех периодичностей, кроме годовой: устанавливать последний день предыдущего периода;
		// 2. для годовой периодичности:
		//	 - при расчетах до конца января устанавливать последний день предыдущего периода;
		//   - при расчетах после января устанавливать текущую дату.
		
		Если ПериодичностьРасчета = Перечисления.ПериодичностьРасчетаВознагражденияУправляющего.Ежемесячно Тогда
			НоваяДатаРасчета = НачалоМесяца(ТекущаяДата()) - 1;
		ИначеЕсли ПериодичностьРасчета = Перечисления.ПериодичностьРасчетаВознагражденияУправляющего.Ежеквартально Тогда
			НоваяДатаРасчета = НачалоКвартала(ТекущаяДата()) - 1;
		ИначеЕсли ПериодичностьРасчета = Перечисления.ПериодичностьРасчетаВознагражденияУправляющего.Ежегодно Тогда
			НоваяДатаРасчета = ?(Месяц(ТекущаяДата()) = 1, НачалоГода(ТекущаяДата()) - 1, ТекущаяДата());
		Иначе
			НоваяДатаРасчета = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()) - 1, -1);
		КонецЕсли;
		
	Иначе
		НоваяДатаРасчета = КонецМесяца(Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоМесяца(НачалоДня(ТекущаяДата())), -2));
	КонецЕсли;
	
	Возврат НоваяДатаРасчета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПериодДляПечати(ЭтаФорма, Объект)

	// Это требуется только для ИИС
	Если Объект.ВариантРасчета = 0 Тогда
		ЭтаФорма.ПериодДляПечати.ДатаНачала 	= Объект.ДатаРасчета;
		ЭтаФорма.ПериодДляПечати.ДатаОкончания 	= Объект.ДатаРасчета;
	КонецЕсли;
	
	Если Объект.ВариантРасчета = 0 Или Объект.ВариантРасчета = 3 Тогда
		Если Объект.ПериодичностьРасчета = ПредопределенноеЗначение("Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежемесячно") Тогда
			ЭтаФорма.БазовыйПериод = Новый СтандартныйПериод(НачалоМесяца(Объект.ДатаРасчета), КонецМесяца(Объект.ДатаРасчета)); 	
		ИначеЕсли Объект.ПериодичностьРасчета = ПредопределенноеЗначение("Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежеквартально") Тогда
			ЭтаФорма.БазовыйПериод = Новый СтандартныйПериод(НачалоКвартала(Объект.ДатаРасчета), КонецКвартала(Объект.ДатаРасчета)); 	
		ИначеЕсли Объект.ПериодичностьРасчета = ПредопределенноеЗначение("Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежегодно") Тогда
			ЭтаФорма.БазовыйПериод = Новый СтандартныйПериод(НачалоГода(Объект.ДатаРасчета), КонецГода(Объект.ДатаРасчета)); 	
		Иначе
			ЭтаФорма.БазовыйПериод = Неопределено;	
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОтбора()
	
	ПроверитьОтборВСписке(ЭтаФорма.ОтборСчетДоверительногоУправления, ЭтаФорма.ОтборСчетДоверительногоУправленияВСписке);
	ПроверитьОтборВСписке(ЭтаФорма.ОтборКлиент, ЭтаФорма.ОтборКлиентВСписке);
	ПроверитьОтборВСписке(ЭтаФорма.ОтборВидДоговораДоверительногоУправления, ЭтаФорма.ОтборВидДоговораДоверительногоУправленияВСписке);	
	
	ОбновитьПредставлениеОтбора(ЭтаФорма);	
	
	ОчиститьДанные(ЭтаФорма);	
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

// Для списочных отборов в режиме единичного выбора всегда должна быть одна строка	
&НаКлиенте
Процедура ПроверитьОтборВСписке(ОтборВСписке, РежимЗаполненияВСписке)
	
	Если Не РежимЗаполненияВСписке Тогда
		
		КоличествоЭлементов = ОтборВСписке.Количество();
		
		Если КоличествоЭлементов = 0 Тогда
			ОтборВСписке.Добавить(); // добавим первую строку
		ИначеЕсли КоличествоЭлементов > 1 Тогда
			Для Индекс = 1-КоличествоЭлементов По -1 Цикл
				ОтборВСписке.Удалить(-Индекс); // удалим все элементы, кроме первого
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОтбор(ЭтаФорма)
	
	Отбор = Новый Структура;
	
	Если Не СписокПустой(ЭтаФорма.ОтборСчетДоверительногоУправления) Тогда
		Отбор.Вставить("СчетДоверительногоУправления", ЭтаФорма.ОтборСчетДоверительногоУправления);	
	КонецЕсли;
	
	Если Не СписокПустой(ЭтаФорма.ОтборКлиент) И ЭтаФорма.Объект.ВариантРасчета = 3 Тогда
		Отбор.Вставить("Клиент", ЭтаФорма.ОтборКлиент);	
	КонецЕсли;
	
	Если Не СписокПустой(ЭтаФорма.ОтборВидДоговораДоверительногоУправления) И ЭтаФорма.Объект.ВариантРасчета = 3 Тогда
		Отбор.Вставить("ВидДоговораДоверительногоУправления", ЭтаФорма.ОтборВидДоговораДоверительногоУправления);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.ОтборСтратегияИндивидуальногоИнвестирования) И ЭтаФорма.Объект.ВариантРасчета = 0 Тогда
		Отбор.Вставить("СтратегияИндивидуальногоИнвестирования", ЭтаФорма.ОтборСтратегияИндивидуальногоИнвестирования);	
	КонецЕсли;
	
	Возврат Отбор;	
	
КонецФункции

// Список пустой, если в нем нет ни одного заполненного элемента
&НаКлиентеНаСервереБезКонтекста
Функция СписокПустой(Список)
	
	Пустой = Истина;
	
	Для каждого Элемент Из Список Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			Пустой = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Пустой;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеОтбора(ЭтаФорма)
	
	Отбор = ПолучитьОтбор(ЭтаФорма);
	
	Если Отбор.Количество() = 0 Тогда
		
		ЭтаФорма.ПредставлениеОтбора = "Без отбора";
		
	Иначе
		
		ПредставлениеОтбора = Новый Массив;
		
		Для Каждого ЭлементОтбора Из Отбор Цикл
			
			Если ЭлементОтбора.Ключ = "СчетДоверительногоУправления" Тогда
				ПредставлениеЭлемента = "Счет в/у";
			ИначеЕсли ЭлементОтбора.Ключ = "Клиент" Тогда
				ПредставлениеЭлемента = "Клиент";	
			ИначеЕсли ЭлементОтбора.Ключ = "ВидДоговораДоверительногоУправления" Тогда
				ПредставлениеЭлемента = "Вид договора д/у";	
			ИначеЕсли ЭлементОтбора.Ключ = "СтратегияИндивидуальногоИнвестирования" Тогда
				ПредставлениеЭлемента = "Стратегия";
			Иначе
				ПредставлениеЭлемента = ЭлементОтбора.Ключ;	
			КонецЕсли;		
			
			Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
				ПредставлениеЗначения = СтрСоединить(ЭлементОтбора.Значение.ВыгрузитьЗначения(), ", ");
			Иначе
				ПредставлениеЗначения = ЭлементОтбора.Значение;
			КонецЕсли;
			
			ПредставлениеОтбора.Добавить(ПредставлениеЭлемента + ": " + ПредставлениеЗначения);	
			
		КонецЦикла;
		
		ЭтаФорма.ПредставлениеОтбора = СтрСоединить(ПредставлениеОтбора, "; ");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокНастроекПечатнойФормы(ЭтаФорма)

	// Подписант	
	
	Если ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		ЗаголовокНастроекПечатнойФормы = "Подписант: " + Строка(ЭтаФорма.Подписант);
		
		Если ЗначениеЗаполнено(ЭтаФорма.ПодписантДолжность) Тогда
			ЗаголовокНастроекПечатнойФормы = ЗаголовокНастроекПечатнойФормы + ", " + ЭтаФорма.ПодписантДолжность;
		КонецЕсли;
	Иначе
		ЗаголовокНастроекПечатнойФормы = "Настройки подписанта";
	КонецЕсли;

	ЭтаФорма.Элементы.ГруппаПодписант.Заголовок = ЗаголовокНастроекПечатнойФормы;
	
	// Бухгалтер	
	
	Если ЗначениеЗаполнено(ЭтаФорма.ПодписантБухгалтер) Тогда
		ЗаголовокНастроекПечатнойФормы = "Бухгалтер: " + Строка(ЭтаФорма.ПодписантБухгалтер);
		
		Если ЗначениеЗаполнено(ЭтаФорма.ПодписантБухгалтерДолжность) Тогда
			ЗаголовокНастроекПечатнойФормы = ЗаголовокНастроекПечатнойФормы + ", " + ЭтаФорма.ПодписантБухгалтерДолжность;
		КонецЕсли;
	Иначе
		ЗаголовокНастроекПечатнойФормы = "Настройки подписанта бухгалтера";
	КонецЕсли;	

	ЭтаФорма.Элементы.ГруппаПодписантБухгалтер.Заголовок = ЗаголовокНастроекПечатнойФормы;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПривестиОтборыВСоответствиеОрганизации(ЭтаФорма, СчетаСоответствующиеОрганизации = Неопределено)
	
	Если СчетаСоответствующиеОрганизации = Неопределено Тогда
		ПроверитьСчетаНаСоответствиеОрганизации(ЭтаФорма.Объект.Организация, ЭтаФорма.ОтборСчетДоверительногоУправления, СчетаСоответствующиеОрганизации);	
	КонецЕсли;	
		
	ЭтаФорма.ОтборСчетДоверительногоУправления.ЗагрузитьЗначения(СчетаСоответствующиеОрганизации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСчетаНаСоответствиеОрганизации(Организация, СчетаДоверительногоУправления, СчетаСоответствующиеОрганизации = Неопределено, СчетаНеСоответствующиеОрганизации = Неопределено)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.Организация = &Организация КАК Соответствует
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка В(&Ссылка)");
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Ссылка",			СчетаДоверительногоУправления);
	
	ПроверенныеСчета					= Запрос.Выполнить().Выгрузить();
	СчетаСоответствующиеОрганизации		= ПроверенныеСчета.Скопировать(Новый Структура("Соответствует", Истина), "Ссылка").ВыгрузитьКолонку(0);
	СчетаНеСоответствующиеОрганизации	= ПроверенныеСчета.Скопировать(Новый Структура("Соответствует", Ложь), "Ссылка").ВыгрузитьКолонку(0);
	
	Возврат (СчетаНеСоответствующиеОрганизации.Количество() = 0);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКлючНастроекРасчетаВознаграждения(Организация, СчетДоверительногоУправления, ВидВознаграждения, ДатаРасчета)

	ОтборЗаписей = Новый Структура("Организация, СчетДоверительногоУправления, ВидВознаграждения", Организация, СчетДоверительногоУправления, ВидВознаграждения);
	
	СрезПоследних = РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего.СрезПоследних(ДатаРасчета, ОтборЗаписей);
	Если СрезПоследних.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОтборЗаписей.Вставить("Период", СрезПоследних[0].Период);
	
	Возврат РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего.СоздатьКлючЗаписи(ОтборЗаписей);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкуРасчетаВознагражденияПИФ(СчетДоверительногоУправления, ДатаРасчета)
	ОтборЗаписей = Новый Структура("ПаевойИнвестиционныйФонд", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаРасчета));
	
	СрезПоследних = РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(ДатаРасчета, ОтборЗаписей);
	Если СрезПоследних.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат СрезПоследних[0].НастройкаРасчетаРезервовЗаВознаграждениеУправляющего;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьНастройкиПодписантов(ЭтаФорма)

	РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(ЭтаФорма.Подписант, ЭтаФорма.СтруктураДанныхКонтактногоЛица, ЭтаФорма.Объект.Организация);
	РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(ЭтаФорма.ПодписантБухгалтер, ЭтаФорма.СтруктураДанныхКонтактногоЛицаБухгалтера, ЭтаФорма.Объект.Организация);

	ЗаполнитьРеквизитыПодписантаИзСтруктурыДанныхКонтактногоЛица(ЭтаФорма.СтруктураДанныхКонтактногоЛица, , ЭтаФорма.ПодписантДолжность, ЭтаФорма.ПодписантОснованиеПолномочий);
	ЗаполнитьРеквизитыПодписантаИзСтруктурыДанныхКонтактногоЛица(ЭтаФорма.СтруктураДанныхКонтактногоЛицаБухгалтера, , ЭтаФорма.ПодписантБухгалтерДолжность);

	УстановитьЗаголовокНастроекПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыПодписантаИзСтруктурыДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица, Подписант = Неопределено, Должность = Неопределено, ОснованиеПолномочий = Неопределено)
	
	Если Подписант <> Неопределено Тогда
		Подписант = ?(СтруктураДанныхКонтактногоЛица = Неопределено, Неопределено, СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
	КонецЕсли;
	
	Если Должность <> Неопределено Тогда
		Должность = ?(СтруктураДанныхКонтактногоЛица = Неопределено, Неопределено, СтруктураДанныхКонтактногоЛица.Должность);
	КонецЕсли;
	
	Если ОснованиеПолномочий <> Неопределено Тогда
		ОснованиеПолномочий = ?(СтруктураДанныхКонтактногоЛица = Неопределено, Неопределено, СокрЛП(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервереИЗафиксироватьСтатистику()
	
	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессиюНаСервере("ОбновитьНаСервере");
	
	ОбновитьНаСервере(ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики);
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессиюНаСервере(ИмяКоманды, Знач РеквизитФормыОбъект = Неопределено)
	
	Если РеквизитФормыОбъект = Неопределено Тогда
		РеквизитФормыОбъект = РеквизитФормыВЗначение("Объект");	
	КонецЕсли;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(РеквизитФормыОбъект);
	
	Механизм = РеквизитФормыОбъект.Метаданные().ПолноеИмя() + "." + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессииСбораСтатистики = Новый Структура("Механизм, Сессия, ДанныеДляСтатистики", Механизм, Сессия, Новый Структура("Ошибки", Новый Массив));
		
	Возврат ПараметрыСессииСбораСтатистики;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики)

	ТекстОшибки = Неопределено;
	
	Если ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики.Ошибки.Количество() > 0 Тогда
		ТекстОшибки = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики.Ошибки, ",");
	КонецЕсли;
	ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики.Удалить("Ошибки");
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики.Механизм, ПараметрыСессииСбораСтатистики.Сессия,, ПараметрыСессииСбораСтатистики.ДанныеДляСтатистики, ТекстОшибки);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьВремя(ВремяНачала)
	 
	ВремяСек = ТекущаяДатаСеанса() - ВремяНачала; 
	ВремяМин = Цел((ВремяСек) / 60);
	
	Возврат Строка(ВремяСек) + " сек."  + ?(ВремяМин > 0, " (" + Строка(ВремяМин) + " м. " + Строка(ВремяСек - ВремяМин * 60) + " с.)","");
	
КонецФункции

&НаСервереБезКонтекста
Функция ОплатаВознагражденияУправляющегоИзСобственныхСредствКлиента(Организация, СчетДоверительногоУправления, Дата, Отказ)
	
	Возврат РегистрыСведений.УсловияДоговоровДоверительногоУправления.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Организация, СчетДоверительногоУправления, Дата, Отказ);
	
КонецФункции

#КонецОбласти

#Область Сериализация

&НаСервереБезКонтекста
Функция СериализоватьЗначение(ЗначениеИсточник) Экспорт
	
	ИсходныйТип = ТипЗнч(ЗначениеИсточник);	
	
	Если ИсходныйТип = Тип("Массив") Тогда
		Результат = СериализоватьМассив(ЗначениеИсточник);
	ИначеЕсли ИсходныйТип = Тип("ТаблицаЗначений") Тогда
		Результат = СериализоватьТаблицуЗначений(ЗначениеИсточник);
	ИначеЕсли ИсходныйТип = Тип("Структура") Тогда
		Результат = СериализоватьСтруктуру(ЗначениеИсточник);
	Иначе
		Результат = ЗначениеИсточник;
	КонецЕсли;
	
    Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция СериализоватьТаблицуЗначений(ТаблицаИсточник) Экспорт

	// Формируем описание структуры

	МассивКолонок				= Новый Массив;
	МассивИсключаемыхКолонок	= Новый Массив;
			
	Для Каждого Колонка Из ТаблицаИсточник.Колонки Цикл
		Если Колонка.ТипЗначения.СодержитТип(Тип("Массив"))
			Или Колонка.ТипЗначения.СодержитТип(Тип("ТаблицаЗначений"))
			Или Колонка.ТипЗначения.СодержитТип(Тип("Структура"))
		Тогда
			МассивИсключаемыхКолонок.Добавить(Колонка.Имя);			
		Иначе
			МассивКолонок.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураСтрокой = СтрСоединить(МассивКолонок, ", ");
	
	// Заполняем данными	
	
    Результат = Новый Массив;
	
	Для Каждого ИсходнаяСтрока Из ТаблицаИсточник Цикл
        НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
		
		Для Каждого ИсключаемаяКолонка Из МассивИсключаемыхКолонок Цикл
			ИсходноеЗначение	= ИсходнаяСтрока[ИсключаемаяКолонка];
			ИсходныйТип			= ТипЗнч(ИсходноеЗначение);
			
			Если ИсходныйТип = Тип("Массив") Тогда
				НоваяСтрока.Вставить(ИсключаемаяКолонка, СериализоватьМассив(ИсходноеЗначение)); 		
			ИначеЕсли ИсходныйТип = Тип("ТаблицаЗначений") Тогда
				НоваяСтрока.Вставить(ИсключаемаяКолонка, СериализоватьТаблицуЗначений(ИсходноеЗначение)); 		
			ИначеЕсли ИсходныйТип = Тип("Структура") Тогда
				НоваяСтрока.Вставить(ИсключаемаяКолонка, СериализоватьСтруктуру(ИсходноеЗначение));
			КонецЕсли;
		КонецЦикла;
		
		Результат.Добавить(НоваяСтрока);
	КонецЦикла;
	
    Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция СериализоватьМассив(МассивИсточник) Экспорт
		
	Результат = Новый Массив;
	
	Для Каждого ИсходноеЗначение Из МассивИсточник Цикл
		ИсходныйТип = ТипЗнч(ИсходноеЗначение);
			
		Если ИсходныйТип = Тип("Массив") Тогда
			Результат.Добавить(СериализоватьМассив(ИсходноеЗначение));
		ИначеЕсли ИсходныйТип = Тип("ТаблицаЗначений") Тогда
			Результат.Добавить(СериализоватьТаблицуЗначений(ИсходноеЗначение));
		ИначеЕсли ИсходныйТип = Тип("Структура") Тогда
			Результат.Добавить(СериализоватьСтруктуру(ИсходноеЗначение));
		Иначе
			Результат.Добавить(ИсходноеЗначение);
		КонецЕсли;
	КонецЦикла;
	
    Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция СериализоватьСтруктуру(СтруктураИсточник) Экспорт
		
	Результат = Новый Структура;
	
	Для Каждого ИсходноеПоле Из СтруктураИсточник Цикл
		ИсходныйТип = ТипЗнч(ИсходноеПоле.Значение);
			
		Если ИсходныйТип = Тип("Массив") Тогда
			Результат.Вставить(ИсходноеПоле.Ключ, СериализоватьМассив(ИсходноеПоле.Значение));
		ИначеЕсли ИсходныйТип = Тип("ТаблицаЗначений") Тогда
			Результат.Вставить(ИсходноеПоле.Ключ, СериализоватьТаблицуЗначений(ИсходноеПоле.Значение));
		ИначеЕсли ИсходныйТип = Тип("Структура") Тогда
			Результат.Вставить(ИсходноеПоле.Ключ, СериализоватьСтруктуру(ИсходноеПоле.Значение));
		Иначе
			Результат.Вставить(ИсходноеПоле.Ключ, ИсходноеПоле.Значение);
		КонецЕсли;
	КонецЦикла;
	
    Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ВознагражденияУправляющегоПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ВознагражденияУправляющего.ТекущиеДанные.НуженПодписант Тогда 
		
		Клиент = Элементы.ВознагражденияУправляющего.ТекущиеДанные.Клиент; 
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, Объект, КонтактноеЛицо", Объект.Организация, Клиент, ЭтаФорма.Элементы.ВознагражденияУправляющего.ТекущиеДанные.Подписант));					
		ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);   
	Иначе   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В расшифровке расчета по " + Элементы.ВознагражденияУправляющего.ТекущиеДанные.Клиент +  " Акт не предусмотрен или шаблон акта не равен Будущее2023. Подписант не нужен.")
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВознагражденияУправляющегоПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);  
	
	Клиент = Элементы.ВознагражденияУправляющего.ТекущиеДанные.Клиент;        
	
	Для Каждого СтрокаВознаграждение из ЭтотОбъект.ВознагражденияУправляющего Цикл 
		Если СтрокаВознаграждение.Клиент = Клиент 
			И СтрокаВознаграждение.НуженПодписант Тогда        
			
			СтрокаВознаграждение.Подписант = ДанныеКонтактногоЛица.КонтактноеЛицо;
			СтрокаВознаграждение.СтруктураПодписантОтКлиента = ДанныеКонтактногоЛица;
			
		КонецЕсли;
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти
