
Процедура ИмпортироватьРасчетныеЦеныПоНовымЦеннымБумагам(ЦеннаяБумага, Источник = Неопределено) Экспорт
	
	ДатаОкончанияПериода = ТекущаяДатаСеанса();
	
	ОбработкаИмпортРасчетныхЦен = Обработки.ИмпортРасчетныхЦен.Создать();
				
	ОбработкаИмпортРасчетныхЦен.Период.ДатаНачала = Справочники.Календари.ДобавитьКДатеРабочиеДни(
		Константы.ОсновнойКалендарьКотировок.Получить(),
		ДатаОкончанияПериода,
		-92);
	ОбработкаИмпортРасчетныхЦен.Период.ДатаОкончания = ДатаОкончанияПериода;
	ОбработкаИмпортРасчетныхЦен.ЦеннаяБумага = ЦеннаяБумага;
	ОбработкаИмпортРасчетныхЦен.ИмпортироватьТолькоОтсутствующиеКотировки = Ложь;
	
	Если ЗначениеЗаполнено(Источник) Тогда
		ОбработкаИмпортРасчетныхЦен.ДополнительныеСвойства.Вставить("Источник", Источник);
	КонецЕсли;

	ОбработкаИмпортРасчетныхЦен.ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРД();
	ОбработкаИмпортРасчетныхЦен.ЗагрузитьРасчетныеЦеныПоНовойМетодикеНРД();
	
КонецПроцедуры //ИмпортироватьРасчетныеЦеныПоНовымЦеннымБумагам