
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если Тип(ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент) = Тип("ТаблицаФормы")
		И ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.Имя = "Сотрудники" И ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		ТекущийСотрудник = ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущиеДанные.Сотрудник;
	Иначе
		ТекущийСотрудник = Неопределено;
	КонецЕсли;
	
	СписокВариантовПечатнойФормы = ПолучитьСписокВариантовПечатнойФормы(ПараметрКоманды);
	
	Если СписокВариантовПечатнойФормы.Количество() > 1 Тогда
		ВыбранныйЭлемент = СписокВариантовПечатнойФормы.ВыбратьЭлемент("Вариант печати", СписокВариантовПечатнойФормы.НайтиПоЗначению(ТекущийСотрудник));
	Иначе
		ВыбранныйЭлемент = СписокВариантовПечатнойФормы[0];
	КонецЕсли;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТабличныйДокумент = СформироватьЛистУчетаОбучения(ПараметрКоманды, ВыбранныйЭлемент.Значение);
		Если ТабличныйДокумент <> Неопределено Тогда
			ТабличныйДокумент.Показать(ТабличныйДокумент.ИспользуемоеИмяФайла);	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьЛистУчетаОбучения(ОбучениеСотрудников, Сотрудник)
	
	Возврат Документы.ОбучениеСотрудников.СформироватьЛистУчетаОбучения(ОбучениеСотрудников, Сотрудник);
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВариантовПечатнойФормы(ОбучениеСотрудников)
	
	СписокВариантовПечатнойФормы = Новый СписокЗначений;
	СписокВариантовПечатнойФормы.Добавить("ВсеСотрудники", "Все сотрудники");
	
	Если ОбучениеСотрудников.ВидПеречня = Справочники.ВидыПеречнейОбъектов.Инсайдеры Тогда 
		Для Каждого СтрокаСотрудники Из ОбучениеСотрудников.Сотрудники Цикл
			СписокВариантовПечатнойФормы.Добавить(СтрокаСотрудники.Сотрудник);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокВариантовПечатнойФормы;
	
КонецФункции