
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.ДатаЭкспорта) Тогда
		Объект.ДатаЭкспорта = ТекущаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Брокер) Тогда
		Объект.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");
	КонецЕсли;
	
	ЗагрузитьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортироватьДанныеНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.ЭкспортироватьДанные(ЭтотОбъект.АдресФайлаЭкспорта);
	ОбъектНаСервере.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьДанныеНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.УстранитьРасхождения();
	ОбъектНаСервере.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОбОшибкахИзSQLНаСервере()
	
	ТолькоДанныеОТранзакциях = Истина;
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ТаблицаДанныхИзКвика = ОбъектНаСервере.ПолучитьДанныеИзКвика(ТолькоДанныеОТранзакциях);
	
	Если ТаблицаДанныхИзКвика = Неопределено Тогда
		ЭтаФорма.СообщенияОбОшибкахИзSQL.ДобавитьСтроку("Нет данных об ошибках.");
		ОбъектНаСервере.ОповеститьОбОшибках();
		Возврат;
	КонецЕсли;
		
	Для Каждого Сообщение Из ТаблицаДанныхИзКвика Цикл
		ЭтаФорма.СообщенияОбОшибкахИзSQL.ДобавитьСтроку("[" + Формат(Сообщение.TransDateTime, "ДЛФ=В") + "]. Транзакция [" + Сообщение.TransNum + "]. Статус [" + Сообщение.Status + "|" + Сообщение.StatusText + "]. Текст [" + Сообщение.ResultMsg + "].");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ЭтаФорма.ТаблицаПоручений.Очистить();
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ТаблицаДанныхИзКвика = ОбъектНаСервере.ПолучитьДанныеИзКвика();

	Если ТаблицаДанныхИзКвика = Неопределено Тогда
		ОбъектНаСервере.ОповеститьОбОшибках();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбъектНаСервере.ПоместитьДанныеПорученийВоВременнуюТаблицу(Запрос);
		
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхИзКвика.ПоручениеСсылка КАК ПоручениеСсылка,
		|	ТаблицаДанныхИзКвика.СтатусПоручения КАК СтатусПорученияКвик,
		|	ТаблицаДанныхИзКвика.ВремяОшибки КАК ВремяОшибки,
		|	ТаблицаДанныхИзКвика.СтатусОшибки КАК СтатусОшибки,
		|	ТаблицаДанныхИзКвика.СтатусОшибкиТекст КАК СтатусОшибкиТекст,
		|	ТаблицаДанныхИзКвика.СообщениеОбОшибке КАК СообщениеОбОшибке,
		|	ТаблицаДанныхИзКвика.ОшибкаПриЭкспорте КАК ОшибкаПриЭкспорте
		|ПОМЕСТИТЬ _ТаблицаДанныхИзКвика
		|ИЗ
		|	&ТаблицаДанныхИзКвика КАК ТаблицаДанныхИзКвика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ТаблицаПоручений.Ссылка, _ТаблицаДанныхИзКвика.ПоручениеСсылка) КАК ПоручениеСсылка,
		|	_ТаблицаПоручений.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _ТаблицаДанныхИзКвика.СтатусПорученияКвик ЕСТЬ NULL
		|				ИЛИ _ТаблицаДанныхИзКвика.СтатусПорученияКвик = """"
		|			ТОГДА ""Отсутствует в квике""
		|		ИНАЧЕ _ТаблицаДанныхИзКвика.СтатусПорученияКвик
		|	КОНЕЦ КАК СтатусПорученияКвик,
		|	ВЫБОР
		|		КОГДА НЕ _ТаблицаПоручений.Проведен
		|			ТОГДА ""Записан""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ТаблицаПоручений.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.Исполнено)
		|					ТОГДА ВЫБОР
		|							КОГДА НЕ _ТаблицаПоручений.ПереводСсылка ЕСТЬ NULL
		|								ТОГДА ВЫБОР
		|										КОГДА _ТаблицаПоручений.ПереводПроведен
		|											ТОГДА ""Исполнено. Создан перевод (Проведен)""
		|										ИНАЧЕ ""Исполнено. Создан перевод (Записан)""
		|									КОНЕЦ
		|							ИНАЧЕ _ТаблицаПоручений.Статус
		|						КОНЕЦ
		|				ИНАЧЕ _ТаблицаПоручений.Статус
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатусПоручения1С
		|ИЗ
		|	_ТаблицаПоручений КАК _ТаблицаПоручений
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ТаблицаДанныхИзКвика КАК _ТаблицаДанныхИзКвика
		|		ПО _ТаблицаПоручений.Ссылка = _ТаблицаДанныхИзКвика.ПоручениеСсылка";
#КонецОбласти 

	Запрос.УстановитьПараметр("ТаблицаДанныхИзКвика", ТаблицаДанныхИзКвика); 
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДанных.Количество() > 0 Тогда
		ЭтаФорма.ТаблицаПоручений.Загрузить(ТаблицаДанных);
	КонецЕсли;
	
	Если ТаблицаДанных.Количество() < ТаблицаДанныхИзКвика.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В QUIKе количество поручений [" + ТаблицаДанныхИзКвика.Количество() + "] превышает количество поручений в 1С [" + ТаблицаДанных.Количество() + "]");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	
	Если Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		ПредставлениеНастроек = "Настройки_РЭМ";
	ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		ПредставлениеНастроек = "Настройки_ТРАСТ";
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить настройки экспорта для организации [" + Объект.Организация + "].");
		Возврат;
	КонецЕсли;
	
	Если Объект.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
		ПредставлениеНастроек = ПредставлениеНастроек + "_" + "БК";	
	ИначеЕсли Объект.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ") Тогда
		ПредставлениеНастроек = ПредставлениеНастроек + "_" + "ГПБ";	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить настройки экспорта для брокера [" + Объект.Брокер + "].",, "Объект.Брокер");
		Возврат;
	КонецЕсли;
	
	Для Каждого НастройкаФормы Из ХранилищеНастроекДанныхФорм.ПолучитьСписок(ЭтаФорма.ИмяФормы) Цикл
		
		Если НастройкаФормы.Представление = ПредставлениеНастроек Тогда
			
			СохраненныеНастройки = РаботаСХранилищем.ХранилищеНастроекДанныхФормЗагрузить(ЭтаФорма.ИмяФормы, НастройкаФормы.Значение);	
			
			Если СохраненныеНастройки <> Неопределено Тогда
				
				Для Каждого ТекНастройка Из СохраненныеНастройки Цикл
					
					Если СтрНайти(ТекНастройка.Ключ, "Объект.") > 0 Тогда
						
						ЭтаФорма.Объект[СтрЗаменить(ТекНастройка.Ключ, "Объект.", "")] = ТекНастройка.Значение;
						
					ИначеЕсли ЗначениеЗаполнено(ТекНастройка.Ключ) Тогда
						
						ЭтаФорма[ТекНастройка.Ключ] = ТекНастройка.Значение;
						
					КонецЕсли;
									
				КонецЦикла;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить настройки экспорта для брокера [" + Объект.Брокер + "].",, "Объект.Брокер");
				Возврат;	
			КонецЕсли;
						
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьДанныеИзФайловЭкспорта(Команда);
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаЭкспорта) Или Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаОтветов) Или Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаЛогов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках экспорта укажите путь к файлам для взаимодействия с системой QUIK"); 
		Возврат;
	КонецЕсли;
	
	Если Прав(ЭтотОбъект.АдресФайлаЭкспорта, 4) <> ".tri" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле ""Файл экспорта"" необходимо указать путь к файлу формата [.tri]");
		Возврат;
	КонецЕсли;
	
	Если Прав(ЭтотОбъект.АдресФайлаОтветов, 4) <> ".tro" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле ""Файл ответов"" необходимо указать путь к файлу формата [.tro]");
		Возврат;
	КонецЕсли;
	
	Если Прав(ЭтотОбъект.АдресФайлаЛогов, 4) <> ".trr" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле ""Файл логов"" необходимо указать путь к файлу формата [.trr]");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ДанныеФайлаЭкспорта.Очистить();
	ЭтаФорма.ДанныеФайлаЛогов.Очистить();
	ЭтаФорма.ДанныеФайлаОтветовКвика.Очистить();
	
	ИмяФайла = ЭтотОбъект.АдресФайлаЭкспорта;
	ЧтениеФайла = Новый ЧтениеТекста();
	Попытка
		ЧтениеФайла.Открыть(ИмяФайла, КодировкаТекста.ANSI);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл [" + ИмяФайла + "]!");
		Возврат;
	КонецПопытки;
	ЭтаФорма.ДанныеФайлаЭкспорта.УстановитьТекст(ЧтениеФайла.Прочитать());
	ЧтениеФайла.Закрыть();
	
	ИмяФайла = ЭтотОбъект.АдресФайлаЛогов;
	Попытка
		ЧтениеФайла.Открыть(ИмяФайла, КодировкаТекста.ANSI);
	Исключение
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл [" + ИмяФайла + "]!");
		Возврат;
	КонецПопытки;
	ТекстФайлаЛогов = ЧтениеФайла.Прочитать();
	Если ПустаяСтрока(ТекстФайлаЛогов) Тогда
		ЧтениеФайла.Закрыть();
	Иначе
		Для Строка = 1 По СтрЧислоСтрок(ТекстФайлаЛогов) Цикл
			ТекстСтроки = СтрПолучитьСтроку(ТекстФайлаЛогов, Строка);
			Если СтрНайти(ТекстСтроки, "Ошибка") > 0 Тогда
				
				ЭтаФорма.ДанныеФайлаЛогов.ДобавитьСтроку(ТекстСтроки);
				
			КонецЕсли;			
		КонецЦикла;
		ЧтениеФайла.Закрыть();
	КонецЕсли;
	
	ИмяФайла = ЭтотОбъект.АдресФайлаОтветов;
	Попытка
		ЧтениеФайла.Открыть(ИмяФайла, КодировкаТекста.ANSI);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл [" + ИмяФайла + "]!");
		Возврат;
	КонецПопытки;
	ЭтаФорма.ДанныеФайлаОтветовКвика.УстановитьТекст(ЧтениеФайла.Прочитать());
	ЧтениеФайла.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
		
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ОбновитьНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортироватьДанные(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ИмпортироватьДанныеНаСервере();
		ОбновитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭкспортироватьДанные(Команда)
		
	Если Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаЭкспорта) Или Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаОтветов) Или Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаЛогов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках экспорта укажите путь к файлам для взаимодействия с системой QUIK."); 
		Возврат;
	КонецЕсли;
	
	Если Прав(ЭтотОбъект.АдресФайлаЭкспорта, 4) <> ".tri" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле ""Файл экспорта"" необходимо указать путь к файлу формата [.tri].");
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ТаблицаПоручений.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для экспорта.");
		Возврат;
	КонецЕсли;
		
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ЭкспортироватьДанныеНаСервере();
		ОбновитьНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьДанныеОбОшибкахИзSQL(Команда)
	
	ЭтотОбъект.СообщенияОбОшибкахИзSQL.Очистить();
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ПолучитьДанныеОбОшибкахИзSQLНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанныеИзФайловЭкспорта(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаЭкспорта) Или Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаОтветов) Или Не ЗначениеЗаполнено(ЭтотОбъект.АдресФайлаЛогов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках экспорта укажите путь к файлам для взаимодействия с системой QUIK"); 
		Возврат;
	КонецЕсли;
	
	Если Прав(ЭтотОбъект.АдресФайлаЭкспорта, 4) <> ".tri" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле ""Файл экспорта"" необходимо указать путь к файлу формата [.tri]");
		Возврат;
	КонецЕсли;
	
	Если Прав(ЭтотОбъект.АдресФайлаОтветов, 4) <> ".tro" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле ""Файл ответов"" необходимо указать путь к файлу формата [.tro]");
		Возврат;
	КонецЕсли;
	
	Если Прав(ЭтотОбъект.АдресФайлаЛогов, 4) <> ".trr" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле ""Файл логов"" необходимо указать путь к файлу формата [.trr]");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ДанныеФайлаЭкспорта.Очистить();
	ЭтаФорма.ДанныеФайлаЛогов.Очистить();
	ЭтаФорма.ДанныеФайлаОтветовКвика.Очистить();
	
	ТекстовыйДокументДляЭкспорта = Новый ТекстовыйДокумент;
	ТекстовыйДокументДляЭкспорта.Записать(ЭтотОбъект.АдресФайлаЭкспорта);
	ТекстовыйДокументДляЭкспорта.Записать(ЭтотОбъект.АдресФайлаОтветов);
	ТекстовыйДокументДляЭкспорта.Записать(ЭтотОбъект.АдресФайлаЛогов);

КонецПроцедуры

&НаКлиенте
Процедура ДатаЭкспортаПриИзменении(Элемент)
	
	Если Объект.ДатаЭкспорта <> НачалоДня(ТекущаяДата()) Тогда
		ЭтаФорма.Элементы.ТаблицаПорученийЭкспортироватьДанные.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ТаблицаПорученийЭкспортироватьДанные.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	ЭтаФорма.ТаблицаПоручений.Очистить();
	ЗагрузитьНастройки();
	
КонецПроцедуры

