
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриЧтенииСозданииНаСервере();
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИнвестиционныеПрофили.Отбор, "СубъектУчета",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИнвестиционныеПрофили.Отбор, "Организация",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Организация, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИнвестиционныеПрофили.Отбор, "СубъектУчета",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИнвестиционныеПрофили.Отбор, "Организация",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Организация, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	КонецПроцедуры
	
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;

	Элементы.ВидДоговораДоверительногоУправления.Видимость = Объект.Стандартная;
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартнаяПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры
