
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если ЭтаФорма.Параметры.Свойство(РеквизитФормы.Имя) Тогда
			ЭтаФорма[РеквизитФормы.Имя] = ЭтаФорма.Параметры[РеквизитФормы.Имя];
		КонецЕсли;
	КонецЦикла;
	
	Элементы.НомерСделкиСЦентральнымКонтрагентом.Видимость = ЭтаФорма.СделкаСЦентральнымКонтрагентом;
	
	Элементы.Дисконт.Видимость = ЭтоМеждилерскоеРЕПО(ЭтаФорма.РежимБиржевыхТоргов);
	Элементы.Дисконт.ТолькоПросмотр = ЭтаФорма.Параметры.ТолькоПросмотр;
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура СделкаСЦентральнымКонтрагентомПриИзменении(Элемент)
	
	Если Не ЭтаФорма.СделкаСЦентральнымКонтрагентом Тогда
		ЭтаФорма.НомерСделкиСЦентральнымКонтрагентом = Неопределено;
	КонецЕсли;
	
	Элементы.НомерСделкиСЦентральнымКонтрагентом.Видимость = ЭтаФорма.СделкаСЦентральнымКонтрагентом;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимБиржевыхТорговПриИзменении(Элемент)
	
	ЭтоМеждилерскоеРЕПО = ЭтоМеждилерскоеРЕПО(ЭтаФорма.РежимБиржевыхТоргов);
	Элементы.Дисконт.Видимость = ЭтоМеждилерскоеРЕПО;
	Если Не ЭтоМеждилерскоеРЕПО Тогда
		ЭтаФорма.Дисконт = 0;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура ЗаполнитьФормуДокумента(Команда)
	
	ЭтаФорма.Закрыть(ПолучитьНовыеЗнчРеквизитовФормы());
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Функция ПолучитьНовыеЗнчРеквизитовФормы()
	
	НовыеЗнчРеквизитовФормы = Новый Структура;
	
	Для каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		НовыеЗнчРеквизитовФормы.Вставить(РеквизитФормы.Имя, ЭтаФорма[РеквизитФормы.Имя])
	КонецЦикла;
	
	Возврат НовыеЗнчРеквизитовФормы;
	
КонецФункции // ПолучитьНовыеЗнчРеквизитовФормы

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоМеждилерскоеРЕПО(РежимБиржевыхТоргов)

	ЭтоМеждилерскоеРЕПО = Ложь;
	Если ЗначениеЗаполнено(РежимБиржевыхТоргов) Тогда
		ЭтоМеждилерскоеРЕПО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РежимБиржевыхТоргов, "РЕПО_М");
	КонецЕсли;
	
	Возврат ЭтоМеждилерскоеРЕПО;
	
КонецФункции 

#КонецОбласти 

