
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("СтрокаПоиска") Тогда
		СтрокаПоиска = ЭтаФорма.Параметры.СтрокаПоиска;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ИмяСправочника") Тогда
		ИмяСправочника = ЭтаФорма.Параметры.ИмяСправочника;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ВидДеятельностиНФО") Тогда
		ВидДеятельностиНФО = ЭтаФорма.Параметры.ВидДеятельностиНФО;
		Если ЗначениеЗаполнено(ВидДеятельностиНФО) Тогда
			ИндексЗначенияПеречисления = Перечисления["ВидыДеятельностиНФО"].Индекс(ВидДеятельностиНФО);
			ИмяМакета = Метаданные.Перечисления["ВидыДеятельностиНФО"].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		Иначе 
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;	
	
	Макет = Справочники[ИмяСправочника].ПолучитьМакет(ИмяМакета);
	Классификатор.Вывести(Макет);
	Классификатор.ФиксацияСверху = 4;
	
	ОбластьКодЧисловойЛево          = Макет.Области.Символы.Лево;
	ОбластьКодЧисловойПраво         = Макет.Области.Символы.Право;
	
	ОбластьНомерСчетаЛево          = Макет.Области.НомерСчета.Лево;
	ОбластьНомерСчетаПраво         = Макет.Области.НомерСчета.Право;
	
	ОбластьНаименованиеЛево  = Макет.Области.Наименование.Лево;
	ОбластьНаименованиеПраво = Макет.Области.Наименование.Право;
	
	Если Макет.Области.Найти("Вид") <> Неопределено Тогда
		ОбластьВидЛево  = Макет.Области.Вид.Лево;
		ОбластьВидПраво = Макет.Области.Вид.Право;
	КонецЕсли;
	
	Если Макет.Области.Найти("Статьи") <> Неопределено Тогда
		ОбластьСтатьиВерх  	= Макет.Области.Статьи.Верх;
		ОбластьСтатьиНиз 	= Макет.Области.Статьи.Низ;
	Иначе
		Элементы.ЗагрузитьВсеСтатьи.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаПоиска) Тогда
		НайденнаяОбласть = Классификатор.НайтиТекст(СтрокаПоиска,, Классификатор.Области.Символы,,,, Истина);
		Элементы.Классификатор.ТекущаяОбласть = НайденнаяОбласть;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	ИскатьСтрокуВТаблице(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Область = Элементы.Классификатор.ТекущаяОбласть;
	ВыполнитьВыбор(Область);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Область = Элементы.Классификатор.ТекущаяОбласть;
	ВыполнитьВыбор(Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ИскатьНазад(Команда)
	
	ИскатьСтрокуВТаблице(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИскатьВперед(Команда)
	
	ИскатьСтрокуВТаблице(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсеСтатьи(Команда)

	Текст = НСтр("ru = 'Загрузить все статьи?'");
		
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВопросЗагрузитьВсеСтатьиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИскатьСтрокуВТаблице(ИскатьВперед)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не задана строка поиска'"));
		ТекущийЭлемент = Элементы.СтрокаПоиска;
		Возврат;
	КонецЕсли;
	
	НайденнаяОбласть = Классификатор.НайтиТекст(СтрокаПоиска, Элементы.Классификатор.ТекущаяОбласть, , , , ИскатьВперед, Истина);
	Если НайденнаяОбласть = Неопределено Тогда
		НайденнаяОбласть = Классификатор.НайтиТекст(СтрокаПоиска, , , , , , Истина);
		Если НайденнаяОбласть = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Строка не найдена'"));
			ТекущийЭлемент = Элементы.СтрокаПоиска;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.Классификатор;
	
	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить(НайденнаяОбласть);
	Элементы.Классификатор.УстановитьВыделенныеОбласти(МассивОбластей);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоискСуществующегоВидДохода(Знач ПараметрыФормы,ИмяСправочника)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыДоходов.Ссылка
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК ВидыДоходов
	|ГДЕ
	|	ВидыДоходов.ВидДеятельностиНФО = &ВидДеятельностиНФО
	|	И ВидыДоходов.Код = &Код
	|	И НЕ ВидыДоходов.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Код", ПараметрыФормы.ЗначенияЗаполнения.Код);
	Запрос.УстановитьПараметр("ВидДеятельностиНФО", ПараметрыФормы.ЗначенияЗаполнения.ВидДеятельностиНФО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоискСуществующегоВидДоходаГруппа(Знач ПараметрыФормы, Родитель, ИмяСправочника)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыДоходов.Ссылка
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК ВидыДоходов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Родитель = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВидыДоходов.Родитель = &Родитель
	|		КОНЕЦ
	|	И ВидыДоходов.Код = &Код
	|	И ВидыДоходов.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Код", ПараметрыФормы.ЗначенияЗаполнения.Код);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьВыбор(ТекущаяОбласть)
	
	КодЧисловой         	= СтрПолучитьСтроку(Классификатор.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловойЛево,
		ТекущаяОбласть.Низ, ОбластьКодЧисловойПраво).Текст,1);
	
	Если ПустаяСтрока(КодЧисловой) Тогда
		Возврат;
	КонецЕсли;	
	
	НомерСчетаБухгалтерскогоУчета = СтрПолучитьСтроку(Классификатор.Область(ТекущаяОбласть.Верх, ОбластьНомерСчетаЛево,
		ТекущаяОбласть.Низ, ОбластьНомерСчетаПраво).Текст,1);
	
	Наименование 			= СтрПолучитьСтроку(Классификатор.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеЛево,
		ТекущаяОбласть.Низ, ОбластьНаименованиеПраво).Текст,1);
		
	ОбластьПодразделКратко  = СтрПолучитьСтроку(Классификатор.Область(ТекущаяОбласть.Верх, ОбластьПодразделКраткоЛево,
		ТекущаяОбласть.Низ, ОбластьПодразделКраткоПраво).Текст,1);
		
	ОбластьПодразделПодробно = СтрПолучитьСтроку(Классификатор.Область(ТекущаяОбласть.Верх, ОбластьПодразделПодробноЛево,
		ТекущаяОбласть.Низ, ОбластьПодразделПодробноПраво).Текст,1);
	
	ОбластьВид = СтрПолучитьСтроку(Классификатор.Область(ТекущаяОбласть.Верх, ОбластьВидЛево,
		ТекущаяОбласть.Низ, ОбластьВидПраво).Текст,1);
		
	// Заполним реквизиты наименования.
	НаименованиеДляЗаполнения = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),СокрЛП(ОбластьПодразделКратко),СокрЛП(КодЧисловой));
	
	ПодразделДляОписания = ?(ПустаяСтрока(ОбластьПодразделПодробно),ОбластьПодразделКратко,ОбластьПодразделПодробно);
	
	Описание = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1: %2'"),ПодразделДляОписания,СокрЛП(Наименование));
		
	Если ЗначениеЗаполнено(ОбластьВид) Тогда
		ВидГруппы = ПредопределенноеЗначение("Перечисление.ВидыГруппФинансовогоУчетаДоходовРасходов." + ОбластьВид);
	Иначе
		ВидГруппы = Неопределено;	
	КонецЕсли;
	
	
	ЗначенияЗаполнения = Новый Структура("Код, Наименование, Описание, ВидДеятельностиНФО, ВидГруппы, НомерСчетаБухгалтерскогоУчета",
		КодЧисловой, НаименованиеДляЗаполнения, Описание, ВидДеятельностиНФО, ВидГруппы, НомерСчетаБухгалтерскогоУчета);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ВидДохода = ПоискСуществующегоВидДохода(ПараметрыФормы,ИмяСправочника);
	
	Если ВидДохода <> Неопределено Тогда
		ПараметрыФормы.Вставить("Ключ", ВидДохода);
	КонецЕсли;
	
	ОткрытьФорму("Справочник." + ИмяСправочника + ".Форма.ФормаЭлемента",
			ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗагрузитьВсеСтатьиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗагрузитьВсеСтатьиСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВсеСтатьиСервер()
	
	ОбластьСтатьи = Классификатор.ПолучитьОбласть("Статьи");
	ВысотаОбласти = ОбластьСтатьи.ВысотаТаблицы;
	
	ТекущаяГруппа = Неопределено;
	
	СтруктураИерархии = Новый Структура("Часть,Раздел,Группа");
	НаименованиеГруппы = "";
	
	Для НомерСтроки = 2 По ВысотаОбласти Цикл
		
		КодЧисловой         	= СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, ОбластьКодЧисловойЛево,
		НомерСтроки, ОбластьКодЧисловойПраво).Текст,1);
		
		НомерСчетаБухгалтерскогоУчета = СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, ОбластьНомерСчетаЛево,
		НомерСтроки, ОбластьНомерСчетаПраво).Текст,1);
		
		Наименование 			= СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, ОбластьНаименованиеЛево,
		НомерСтроки, ОбластьНаименованиеПраво).Текст,1);
		
		ОбластьВид = СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, ОбластьВидЛево,
		НомерСтроки, ОбластьВидПраво).Текст,1);
		
		// Заполним реквизиты наименования.
		Если ЗначениеЗаполнено(КодЧисловой) Тогда 
			ДлинаКода = СтрДлина(КодЧисловой);
			
			Если ДлинаКода = 5 Тогда
				НаименованиеДляЗаполнения = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),СокрЛП(НаименованиеГруппы),СокрЛП(КодЧисловой));
				Описание = НаименованиеГруппы + ": " + Наименование;
			Иначе
				ГдеТочка = СтрНайти(Наименование, ".");
				НаименованиеДляЗаполнения = СокрЛП(Прав(Наименование, СтрДлина(Наименование)-ГдеТочка));
				Описание = "";
			КонецЕсли;
			Если ДлинаКода = 3 Тогда
				НаименованиеГруппы = НаименованиеДляЗаполнения;
			КонецЕсли;
			//НаименованиеДляЗаполнения = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),СокрЛП(ОбластьПодразделКратко),СокрЛП(КодЧисловой));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружен числовой код в строке "+(НомерСтроки-1));
		КонецЕсли;
		
		// Определение уровня группы
		
		Если Сред(Наименование,1,5) = "Часть" Тогда
			Уровень = "Часть";
		ИначеЕсли Сред(Наименование,1,6) = "Раздел" Тогда
			Уровень = "Раздел";
		ИначеЕсли ДлинаКода = 3 Тогда
			Уровень = "Группа";
		Иначе
			Уровень = "";
		КонецЕсли;
			
		
		Если ЗначениеЗаполнено(ОбластьВид) Тогда
			ВидГруппы = Перечисления.ВидыГруппФинансовогоУчетаДоходовРасходов[ОбластьВид];
		Иначе
			ВидГруппы = Неопределено;	
		КонецЕсли;
		
		ЗначенияЗаполнения = Новый Структура("Код, Наименование, Описание, ВидДеятельностиНФО, ВидГруппы, НомерСчетаБухгалтерскогоУчета",
		КодЧисловой, НаименованиеДляЗаполнения, Описание, ВидДеятельностиНФО, ВидГруппы, НомерСчетаБухгалтерскогоУчета);
		ПараметрыСоздания = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		СоздатьЭлемент(ПараметрыСоздания, СтруктураИерархии, Уровень)
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлемент(ПараметрыСоздания, СтруктураИерархии, Уровень)
	
	ЗначенияЗаполнения = ПараметрыСоздания.ЗначенияЗаполнения;
	ДлинаКода = СтрДлина(ЗначенияЗаполнения.Код);
	
	Если ДлинаКода < 5 Тогда
		
		// родитель используется для элементов
		Если Уровень = "Раздел" Тогда
			Родитель = СтруктураИерархии.Часть;
		ИначеЕсли Уровень = "Группа" Тогда
			Родитель = СтруктураИерархии.Раздел;
		Иначе
			Родитель = Неопределено;
		КонецЕсли;
		
		ВидДохода = ПоискСуществующегоВидДоходаГруппа(ПараметрыСоздания, Родитель, ИмяСправочника);
		
		Если ВидДохода = Неопределено Тогда
			
			ВидДохода = Справочники[ИмяСправочника].СоздатьГруппу();
			ВидДохода.Код = ЗначенияЗаполнения.Код;
			ВидДохода.Наименование = ЗначенияЗаполнения.Наименование;
			Если ЗначениеЗаполнено(Родитель) Тогда
				ВидДохода.Родитель = Родитель;
			КонецЕсли;
			
			ВидДохода.Записать();
			
		ИначеЕсли ВидДохода.Наименование <> ЗначенияЗаполнения.Наименование Тогда
			ВидДохода = ВидДохода.ПолучитьОбъект();
			ВидДохода.Наименование = ЗначенияЗаполнения.Наименование;
			ВидДохода.Записать();
		КонецЕсли;
		
		СтруктураИерархии[Уровень] = ВидДохода.Ссылка;
		
	Иначе
		
		ВидДохода = ПоискСуществующегоВидДохода(ПараметрыСоздания, ИмяСправочника);
		
		Если ВидДохода = Неопределено Тогда
			ВидДохода = Справочники[ИмяСправочника].СоздатьЭлемент();
		Иначе
			ВидДохода = ВидДохода.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ВидДохода, ЗначенияЗаполнения);
		Если ЗначениеЗаполнено(СтруктураИерархии.Группа) Тогда
			ВидДохода.Родитель = СтруктураИерархии.Группа;
		КонецЕсли;
		
		ВидДохода.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОписанияНаСервере()
	
	ОбластьСтатьи = Классификатор.ПолучитьОбласть("Статьи");
	ВысотаОбласти = ОбластьСтатьи.ВысотаТаблицы;
	
	НаименованиеГруппы = "";
	
	ДлинаНаименования = Метаданные.Справочники.ГруппыФинансовогоУчетаДоходовРасходов.ДлинаНаименования;
	
	Для НомерСтроки = 2 По ВысотаОбласти Цикл
		
		КодЧисловой = СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, 3, НомерСтроки, 3).Текст,1);
		НомерСчетаБухгалтерскогоУчета = СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, 4, НомерСтроки, 4).Текст,1);
		Наименование = СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, 2, НомерСтроки, 2).Текст,1);
		ОбластьВид = СтрПолучитьСтроку(ОбластьСтатьи.Область(НомерСтроки, 5, НомерСтроки, 5).Текст,1);
		
		Если НЕ ЗначениеЗаполнено(КодЧисловой) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьВид) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(КодЧисловой, 1) <> "3" И Лев(КодЧисловой, 1) <> "4" Тогда // только ценные бумаги
		    Продолжить;
		КонецЕсли;
		
		Если СтрДлина(КодЧисловой) = 3 Тогда
			НаименованиеГруппы = Наименование;
			НаименованиеГруппы = Сред(НаименованиеГруппы, СтрНайти(НаименованиеГруппы, ".") + 2);
		КонецЕсли;
		
		Если СтрДлина(КодЧисловой) <> 5 Тогда
		    Продолжить;
		КонецЕсли;
		
		НаименованиеДляЗаполнения = Лев(РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),СокрЛП(НаименованиеГруппы),СокрЛП(КодЧисловой)), ДлинаНаименования);
		Описание = НаименованиеГруппы + ": " + Наименование;
		
		ВидГруппы = Перечисления.ВидыГруппФинансовогоУчетаДоходовРасходов[ОбластьВид];
		
		ЗначенияЗаполнения = Новый Структура("Код, Наименование, Описание, ВидДеятельностиНФО, ВидГруппы, НомерСчетаБухгалтерскогоУчета",
			КодЧисловой, 
			НаименованиеДляЗаполнения, 
			Описание, 
			Перечисления.ВидыДеятельностиНФО.НегосударственныеПенсионныеФонды, 
			ВидГруппы, 
			НомерСчетаБухгалтерскогоУчета);
			
		ПараметрыСоздания = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		
		ВидДохода = ПоискСуществующегоВидДохода(ПараметрыСоздания, ИмяСправочника);
		
		Если ВидДохода = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден ГФУ по символу: " + КодЧисловой);
			Продолжить;
		КонецЕсли;
		
		Если ВидДохода.Наименование = НаименованиеДляЗаполнения
			И ВидДохода.ВидГруппы = ВидГруппы
			И ВидДохода.НомерСчетаБухгалтерскогоУчета = НомерСчетаБухгалтерскогоУчета Тогда
			
			ВидДохода = ВидДохода.ПолучитьОбъект();
			ВидДохода.Описание = Описание;
			ВидДохода.Записать();
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписания(Команда)
	
	Если ВидДеятельностиНФО <> ПредопределенноеЗначение("Перечисление.ВидыДеятельностиНФО.ПрофессиональныеУчастникиРынкаЦенныхБумаг") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обновлять описания можно только из Приложения 3 (профучастники)");
		Возврат;	
	
	КонецЕсли;
	
	Если Вопрос("Обновить описания всех статей?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	
		ОбновитьОписанияНаСервере();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


