
&НаСервереБезКонтекста
Функция ПолучитьОсновногоПодписанта()
	
	Возврат Справочники.ЮрФизЛица.НайтиПоНаименованию("Зайцева Е. А.");
	
КонецФункции // ПолучитьОсновногоПодписанта

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Подписант = ПолучитьОсновногоПодписанта();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОК");
	Попытка
		ВыполнитьКомандаОК(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаОК(ПараметрыСессии)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("НомерПоследнегоРаспоряжения", ЭтаФорма.НомерПоследнегоРаспоряжения);
	ПараметрыЗакрытия.Вставить("Подписант", ЭтаФорма.Подписант);
	
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
 
 ОбъектОбработки = РеквизитФормыВЗначение("Объект");
 
 ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
 
 Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
 Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
  Механизм,
  ПараметрыВыполненияДляСбораСтатистики.Хранилище,
  ПараметрыВыполненияДляСбораСтатистики.Описание);
  
 ПараметрыСессии = Новый Структура;
 ПараметрыСессии.Вставить("Механизм",     Механизм);
 ПараметрыСессии.Вставить("Сессия",        Сессия);
 ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
 ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
  
 Возврат ПараметрыСессии;
 
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
 
 РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
  ПараметрыСессии.Механизм,
  ПараметрыСессии.Сессия,,
  ПараметрыСессии.ДопПараметры,
  ПараметрыСессии.ТекстОшибки);
 
КонецПроцедуры

#КонецОбласти
