
#Область ОКУД0420401

Функция ОКУД0420401_РассчитатьКатегориюПрофУчастникаНаОснованииКвартальныхПоказателей(Параметры, Отказ) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаРасчета",			Параметры.ДатаРасчета);
	Запрос.УстановитьПараметр("Организация",			Параметры.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации",	Параметры.Организация.ЮрФизЛицо);
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ОКУД0420401_ПолучитьТаблицуКвартальныхПоказателей(), "_ВидыПоказателей", Запрос); 
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -13), КВАРТАЛ), ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ _КонцыКварталов
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -10), КВАРТАЛ), ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -7), КВАРТАЛ), ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -4), КВАРТАЛ), ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КонцыКварталов.Дата КАК Дата,
		|	МАКСИМУМ(ЕСТЬNULL(СтатусыЛицензий.Статус, """") = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)) КАК Действует
		|ПОМЕСТИТЬ _ДействиеЛицензий
		|ИЗ
		|	_КонцыКварталов КАК _КонцыКварталов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_КонцыКварталов.Дата КАК Дата,
		|			СтатусыЛицензий.Лицензия КАК Лицензия,
		|			МАКСИМУМ(СтатусыЛицензий.Период) КАК ДатаСтатусаЛицензии
		|		ИЗ
		|			_КонцыКварталов КАК _КонцыКварталов
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий КАК СтатусыЛицензий
		|				ПО (СтатусыЛицензий.Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами))
		|					И (СтатусыЛицензий.Лицензия.ЮрФизЛицо = &ЮрФизЛицоОрганизации)
		|					И _КонцыКварталов.Дата >= СтатусыЛицензий.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_КонцыКварталов.Дата,
		|			СтатусыЛицензий.Лицензия) КАК ВложенныйЗапрос
		|		ПО _КонцыКварталов.Дата = ВложенныйЗапрос.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий КАК СтатусыЛицензий
		|		ПО (ВложенныйЗапрос.Лицензия = СтатусыЛицензий.Лицензия)
		|			И (ВложенныйЗапрос.ДатаСтатусаЛицензии = СтатусыЛицензий.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	_КонцыКварталов.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Малый) КАК Категория,
		|	1 КАК Значение
		|ПОМЕСТИТЬ _КатегорииПрофУчастников
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Средний),
		|	2
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Крупный),
		|	3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДействиеЛицензий.Дата КАК Дата,
		|	_ДействиеЛицензий.Действует КАК ЛицензияДействует,
		|	_ВидыПоказателей.НомерСтроки КАК НомерСтроки,
		|	_ВидыПоказателей.ВидПоказателя КАК ВидПоказателя,
		|	_ВидыПоказателей.ДатаНачала КАК ВидПоказателяДатаНачала,
		|	_ВидыПоказателей.ДатаОкончания КАК ВидПоказателяДатаОкончания,
		|	ФинансовыеПоказатели.Значение КАК ЗначениеПоказателя,
		|	_КатегорииПрофУчастников.Категория КАК Категория,
		|	_КатегорииПрофУчастников.Значение КАК ЗначениеКатегории
		|ПОМЕСТИТЬ _Расшифровка
		|ИЗ
		|	_ДействиеЛицензий КАК _ДействиеЛицензий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыПоказателей КАК _ВидыПоказателей
		|		ПО (_ВидыПоказателей.ДатаНачала <= _ДействиеЛицензий.Дата)
		|			И (_ВидыПоказателей.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ _ВидыПоказателей.ДатаОкончания >= _ДействиеЛицензий.Дата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО _ДействиеЛицензий.Дата = ФинансовыеПоказатели.Период
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|			И (_ВидыПоказателей.ВидПоказателя = ФинансовыеПоказатели.ВидПоказателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииПрофУчастников КАК _КатегорииПрофУчастников
		|		ПО (ВЫБОР
		|				КОГДА ФинансовыеПоказатели.Значение > _ВидыПоказателей.ВерхняяГраница
		|					ТОГДА 3
		|				КОГДА ФинансовыеПоказатели.Значение > _ВидыПоказателей.НижнняГраница
		|					ТОГДА 2
		|				ИНАЧЕ 1
		|			КОНЕЦ = _КатегорииПрофУчастников.Значение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.ЛицензияДействует КАК ЛицензияДействует,
		|	_КатегорииПрофУчастников.Категория КАК КатегорияПроцУчастника
		|ПОМЕСТИТЬ _КвартальныеПоказатели
		|ИЗ
		|	(ВЫБРАТЬ
		|		_Расшифровка.Дата КАК Дата,
		|		_Расшифровка.ЛицензияДействует КАК ЛицензияДействует,
		|		МАКСИМУМ(_Расшифровка.ЗначениеКатегории) КАК ЗначениеКатегории
		|	ИЗ
		|		_Расшифровка КАК _Расшифровка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_Расшифровка.Дата,
		|		_Расшифровка.ЛицензияДействует) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииПрофУчастников КАК _КатегорииПрофУчастников
		|		ПО ВложенныйЗапрос.ЗначениеКатегории = _КатегорииПрофУчастников.Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КвартальныеПоказатели.КатегорияПроцУчастника КАК КатегорияПроцУчастника,
		|	1 КАК НомерАбзаца481П
		|ПОМЕСТИТЬ _Результат
		|ИЗ
		|	_КвартальныеПоказатели КАК _КвартальныеПоказатели
		|ГДЕ
		|	_КвартальныеПоказатели.ЛицензияДействует
		|
		|СГРУППИРОВАТЬ ПО
		|	_КвартальныеПоказатели.КатегорияПроцУчастника
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) >= 3
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_КвартальныеПоказатели.КатегорияПроцУчастника,
		|	2
		|ИЗ
		|	_КвартальныеПоказатели КАК _КвартальныеПоказатели
		|ГДЕ
		|	_КвартальныеПоказатели.ЛицензияДействует
		|	И КВАРТАЛ(_КвартальныеПоказатели.Дата) В (2, 3)
		|
		|СГРУППИРОВАТЬ ПО
		|	_КвартальныеПоказатели.КатегорияПроцУчастника
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) = 2
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_КвартальныеПоказатели.КатегорияПроцУчастника,
		|	3
		|ИЗ
		|	_КвартальныеПоказатели КАК _КвартальныеПоказатели
		|ГДЕ
		|	_КвартальныеПоказатели.ЛицензияДействует
		|	И КВАРТАЛ(_КвартальныеПоказатели.Дата) В (1, 2, 3)
		|
		|СГРУППИРОВАТЬ ПО
		|	_КвартальныеПоказатели.КатегорияПроцУчастника
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) = 2
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_КвартальныеПоказатели.КатегорияПроцУчастника,
		|	4
		|ИЗ
		|	_КвартальныеПоказатели КАК _КвартальныеПоказатели
		|ГДЕ
		|	_КвартальныеПоказатели.ЛицензияДействует
		|	И КВАРТАЛ(_КвартальныеПоказатели.Дата) = 3
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Малый),
		|	5
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации
		|ПОМЕСТИТЬ _РеквизитыОрганизации
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ДатаРасчета,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицоОрганизации
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
	
#КонецОбласти	

	Запрос.Выполнить();

	Расшифровка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Расшифровка").ПолучитьДанные().Выгрузить();
	Расшифровка.Сортировать("Дата Убыв, НомерСтроки");
	
	Для Каждого СтрокаКвартальныхПоказателей Из Расшифровка Цикл
		Если СтрокаКвартальныхПоказателей.ЛицензияДействует И СтрокаКвартальныхПоказателей.ЗначениеПоказателя = Null Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Не зарегистрирован показатель %1 на %2",
					СтрокаКвартальныхПоказателей.ВидПоказателя,
					Формат(СтрокаКвартальныхПоказателей.Дата, "ДФ=dd.MM.yyyy")),,,, Отказ);
		КонецЕсли;
	КонецЦикла;	
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидыПоказателей = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ВидыПоказателей").ПолучитьДанные().Выгрузить();
	ВидыПоказателей.Сортировать("НомерСтроки");
	
	Для Каждого СтрокаВидыПоказателей Из ВидыПоказателей Цикл
		Если Расшифровка.НайтиСтроки(Новый Структура("ВидПоказателя, ВидПоказателяДатаНачала, ВидПоказателяДатаОкончания", СтрокаВидыПоказателей.ВидПоказателя, СтрокаВидыПоказателей.ДатаНачала, СтрокаВидыПоказателей.ДатаОкончания)).Количество() = 0 Тогда
			ВидыПоказателей.Удалить(СтрокаВидыПоказателей);
		КонецЕсли;
	КонецЦикла;
	
	РезультатРасчета = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат").ПолучитьДанные().Выгрузить();
	РезультатРасчета.Сортировать("НомерАбзаца481П");
	
#Область Абзацы481П
	СопоставленияКвартальныхДиапазонов = Новый Соответствие;
	СопоставленияКвартальныхДиапазонов.Вставить(1, "Лицензиатом определен один квартальный диапазон не менее чем в трех из четырех кварталов, предшествующих четвертому кварталу текущего календарного года, указанный диапазон значений показателей является для него годовым диапазоном;");
	СопоставленияКвартальныхДиапазонов.Вставить(2, "Лицензиатом определен один квартальный диапазон в двух кварталах, предшествующих четвертому кварталу текущего календарного года, указанный диапазон значений показателей является для него годовым диапазоном;");
	СопоставленияКвартальныхДиапазонов.Вставить(3, "Лицензиатом определен один квартальный диапазон в двух из трех кварталов, предшествующих четвертому кварталу текущего календарного года, указанный диапазон значений показателей является для него годовым диапазоном;");
	СопоставленияКвартальныхДиапазонов.Вставить(4, "Лицензиатом определен один квартальный диапазон в квартале, предшествующем дате определения значений показателей, указанный диапазон значений показателей является для него годовым диапазоном;");
	СопоставленияКвартальныхДиапазонов.Вставить(5, "Лицензиатом не был определен ни один квартальный диапазон;");
#КонецОбласти	

#Область Описание5009У
	Описание5009У = Новый Соответствие;
	Описание5009У.Вставить(Перечисления.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Крупный, "Лицензиат определил хотя бы по одному из показателей, установленных в графе 2 приложения к Положению Банка России от 27 июля 2015 года N 481-П ""О лицензионных требованиях и условиях осуществления профессиональной деятельности на рынке ценных бумаг, ограничениях на совмещение отдельных видов профессиональной деятельности на рынке ценных бумаг, а также о порядке и сроках представления в Банк России отчетов о прекращении обязательств, связанных с осуществлением профессиональной деятельности на рынке ценных бумаг, в случае аннулирования лицензии профессионального участника рынка ценных бумаг"", зарегистрированному Министерством юстиции Российской Федерации 25 августа 2015 года N 38673, 29 июля 2016 года N 43030, 20 октября 2017 года N 48630, 22 января 2019 года N 53485, 26 января 2021 года N 62231 (далее соответственно - показатели деятельности, Положение Банка России N 481-П), в качестве годового диапазона значений показателей деятельности для каждого из осуществляемых профессиональным участником лицензируемых видов профессиональной деятельности на рынке ценных бумаг (далее - годовой диапазон) квартальный диапазон, указанный в графе 5 приложения к Положению Банка России N 481-П.");
	Описание5009У.Вставить(Перечисления.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Средний, "Лицензиат определил хотя бы по одному из показателей деятельности в качестве годового диапазона квартальный диапазон, указанный в графе 4 приложения к Положению Банка России N 481-П, и не определившие ни по одному из показателей деятельности в качестве годового диапазона квартальный диапазон, указанный в графе 5 приложения к Положению Банка России N 481-П.");
	Описание5009У.Вставить(Перечисления.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Малый, "Лицензиат не определил ни по одному из показателей деятельности в качестве годового диапазона квартальный диапазон, указанный в графах 4 и 5 приложения к Положению Банка России N 481-П.");
#КонецОбласти
	
	РеквизитыОрганизации = Новый Структура("НаименованиеОрганизации");
	Таблица_РеквизитыОрганизации = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РеквизитыОрганизации").ПолучитьДанные().Выгрузить();
	Если Таблица_РеквизитыОрганизации.Количество() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыОрганизации, Таблица_РеквизитыОрганизации[0]);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует анкета юр. лица ораганизации");
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидПоказателя", 			Справочники.ВидыФинансовыхПоказателей.КатегорияПрофессиональногоУчастникаРынкаЦенныхБумаг);
	Результат.Вставить("Значение",					РезультатРасчета[0].КатегорияПроцУчастника);
	Результат.Вставить("Описание481П",				СопоставленияКвартальныхДиапазонов.Получить(РезультатРасчета[0].НомерАбзаца481П));
	Результат.Вставить("Описание5709У",				Описание5009У.Получить(РезультатРасчета[0].КатегорияПроцУчастника));
	Результат.Вставить("ПредыдущийГод",				Формат(ДобавитьМесяц(Параметры.ДатаРасчета, -12), "ДФ=yyyy"));
	Результат.Вставить("ВидыПоказателей",			ВидыПоказателей);
	Результат.Вставить("Расшифровка",				Расшифровка);
	Результат.Вставить("РеквизитыОрганизации",		РеквизитыОрганизации);

	Возврат Результат;

КонецФункции

Функция ОКУД0420401_ПолучитьКатегориюПрофУчастника(Параметры, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала",	 Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказателиДеятельности.КатегорияПрофУчастника КАК КатегорияПрофУчастника
		|ИЗ
		|	РегистрСведений.ПоказателиДеятельности КАК ПоказателиДеятельности
		|ГДЕ
		|	ПоказателиДеятельности.Период = НАЧАЛОПЕРИОДА(&ДатаНачала, ГОД)
		|	И ПоказателиДеятельности.Активность
		|	И ПоказателиДеятельности.Организация = &Организация";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КатегорияПрофУчастника;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Категория профессионального учатника (показатель деятельности) не зарегистрирована на %1 год", Формат(Параметры.Период.ДатаНачала, "ДФ=yyyy")),,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

Функция ОКУД0420401_ПолучитьТаблицуКвартальныхПоказателей() Экспорт
	
	ТаблицаКвартальныхПоказателей = Новый ТаблицаЗначений;
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("НомерСтроки",			Новый ОписаниеТипов("Число"));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("ВидПоказателя", 		Новый ОписаниеТипов("СправочникСсылка.ВидыФинансовыхПоказателей"));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("Функция",				Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("НижнняГраница",			Новый ОписаниеТипов("Число"));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("ВерхняяГраница",		Новый ОписаниеТипов("Число"));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("ПредставлениеМалый",	Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("ПредставлениеСредний",	Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("ПредставлениеКрупный",	Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("ДатаНачала",			Новый ОписаниеТипов("Дата"));
	ТаблицаКвартальныхПоказателей.Колонки.Добавить("ДатаОкончания",			Новый ОписаниеТипов("Дата"));
	
	//Объем сделок купли-продажи ценных бумаг, заключенных в течение квартала при осуществлении деятельности по управлению ценными бумагами
	КвартальныйПоказатель = ТаблицаКвартальныхПоказателей.Добавить();
	КвартальныйПоказатель.НомерСтроки			= 4;
	КвартальныйПоказатель.ВидПоказателя 		= Справочники.ВидыФинансовыхПоказателей.ОбъемСделокКуплиПродажиЦБЗаключенныхВТечениеКварталаПриОсуществленииДеятельностиПоУправлениюЦБ;
	КвартальныйПоказатель.Функция				= "ОКУД0420417_ПолучитьОбъемСделок(ПараметрыРасчета)";
	КвартальныйПоказатель.НижнняГраница 		= 2000000000;
	КвартальныйПоказатель.ВерхняяГраница 		= 20000000000;
	КвартальныйПоказатель.ПредставлениеМалый 	= "не более 2 000 млн руб.";
	КвартальныйПоказатель.ПредставлениеСредний	= "более 2 000, но не более 20 000 млн руб.";
	КвартальныйПоказатель.ПредставлениеКрупный	= "более 20 000 млн руб.";
	КвартальныйПоказатель.ДатаОкончания			= Дата(2020, 12, 16);
	
	//Стоимость инвестиционных портфелей клиентов по доверительному управлению по состоянию на последний календарный день квартала до 1.04.2023 отчёт ОКУД0420418 заменён на ОКУД0420431
	КвартальныйПоказатель = ТаблицаКвартальныхПоказателей.Добавить();
	КвартальныйПоказатель.НомерСтроки			= 4;
	КвартальныйПоказатель.ВидПоказателя 		= Справочники.ВидыФинансовыхПоказателей.СтоимостьИнвестиционныхПортфелейКлиентовПоДоверительномуУправлениюПоСостояниюНаПоследнийКалендарныйДеньКвартала;
	КвартальныйПоказатель.Функция				= "ОКУД0420418_ПолучитьСтоимостьПортфелей(ПараметрыРасчета, Запрос)";
	КвартальныйПоказатель.НижнняГраница 		= 10000000000;
	КвартальныйПоказатель.ВерхняяГраница 		= 100000000000;
	КвартальныйПоказатель.ПредставлениеМалый 	= "менее 10 млрд руб.";
	КвартальныйПоказатель.ПредставлениеСредний	= "более 10, но не более 100 млрд руб.";
	КвартальныйПоказатель.ПредставлениеКрупный	= "более 100 млрд руб.";
	КвартальныйПоказатель.ДатаНачала			= Дата(2020, 12, 16);
	КвартальныйПоказатель.ДатаОкончания			= Дата(2023, 4, 1);
	
	//Стоимость инвестиционных портфелей клиентов по доверительному управлению по состоянию на последний календарный день квартала 
	КвартальныйПоказатель = ТаблицаКвартальныхПоказателей.Добавить();
	КвартальныйПоказатель.НомерСтроки			= 4;
	КвартальныйПоказатель.ВидПоказателя 		= Справочники.ВидыФинансовыхПоказателей.СтоимостьИнвестиционныхПортфелейКлиентовПоДоверительномуУправлениюПоСостояниюНаПоследнийКалендарныйДеньКвартала;
	КвартальныйПоказатель.Функция				= "ОКУД0420431_ПолучитьСтоимостьПортфелей(ПараметрыРасчета, Запрос)";
	КвартальныйПоказатель.НижнняГраница 		= 10000000000;
	КвартальныйПоказатель.ВерхняяГраница 		= 100000000000;
	КвартальныйПоказатель.ПредставлениеМалый 	= "менее 10 млрд руб.";
	КвартальныйПоказатель.ПредставлениеСредний	= "более 10, но не более 100 млрд руб.";
	КвартальныйПоказатель.ПредставлениеКрупный	= "более 100 млрд руб.";
	КвартальныйПоказатель.ДатаНачала			= Дата(2023, 4, 1);
	
	//Количество клиентов по договорам доверительного управления по состоянию на последний календарный день квартала до 16.12.2020
	КвартальныйПоказатель = ТаблицаКвартальныхПоказателей.Добавить();
	КвартальныйПоказатель.НомерСтроки			= 5;
	КвартальныйПоказатель.ВидПоказателя			= Справочники.ВидыФинансовыхПоказателей.КоличествоКлиентовПоДоговорамДоверительногоУправленияПоСостояниюНаПоследнийКалендарныйДеньКвартала;
	КвартальныйПоказатель.Функция				= "ОКУД0420418_ПолучитьКоличествоКлиентов(ПараметрыРасчета, Запрос)";
	КвартальныйПоказатель.НижнняГраница 		= 200;
	КвартальныйПоказатель.ВерхняяГраница 		= 2000;
	КвартальныйПоказатель.ПредставлениеМалый 	= "не более 200 лиц";
	КвартальныйПоказатель.ПредставлениеСредний	= "более 200, но не более 2000 лиц";
	КвартальныйПоказатель.ПредставлениеКрупный	= "более 2000 лиц";
	КвартальныйПоказатель.ДатаОкончания			= Дата(2020, 12, 16);
	
	//Количество клиентов по договорам доверительного управления по состоянию на последний календарный день квартала после 16.12.2020 - изменились диапазоны  до 1.04.2023 отчёт ОКУД0420418 заменён на ОКУД0420431
	КвартальныйПоказатель = ТаблицаКвартальныхПоказателей.Добавить();
	КвартальныйПоказатель.НомерСтроки			= 5;
	КвартальныйПоказатель.ВидПоказателя			= Справочники.ВидыФинансовыхПоказателей.КоличествоКлиентовПоДоговорамДоверительногоУправленияПоСостояниюНаПоследнийКалендарныйДеньКвартала;
	КвартальныйПоказатель.Функция				= "ОКУД0420418_ПолучитьКоличествоКлиентов(ПараметрыРасчета, Запрос)";
	КвартальныйПоказатель.НижнняГраница 		= 2000;
	КвартальныйПоказатель.ВерхняяГраница 		= 20000;
	КвартальныйПоказатель.ПредставлениеМалый 	= "не более 2000 лиц";
	КвартальныйПоказатель.ПредставлениеСредний	= "более 2000, но не более 20 000 лиц";
	КвартальныйПоказатель.ПредставлениеКрупный	= "более 20 000 лиц";
	КвартальныйПоказатель.ДатаНачала			= Дата(2020, 12, 16);
	КвартальныйПоказатель.ДатаОкончания			= Дата(2023, 4, 1);
	
	//Количество клиентов по договорам доверительного управления по состоянию на последний календарный день квартала после 1.04.2023 
	КвартальныйПоказатель = ТаблицаКвартальныхПоказателей.Добавить();
	КвартальныйПоказатель.НомерСтроки			= 5;
	КвартальныйПоказатель.ВидПоказателя			= Справочники.ВидыФинансовыхПоказателей.КоличествоКлиентовПоДоговорамДоверительногоУправленияПоСостояниюНаПоследнийКалендарныйДеньКвартала;
	КвартальныйПоказатель.Функция				= "ОКУД0420431_ПолучитьКоличествоКлиентов(ПараметрыРасчета, Запрос)";
	КвартальныйПоказатель.НижнняГраница 		= 2000;
	КвартальныйПоказатель.ВерхняяГраница 		= 20000;
	КвартальныйПоказатель.ПредставлениеМалый 	= "не более 2000 лиц";
	КвартальныйПоказатель.ПредставлениеСредний	= "более 2000, но не более 20 000 лиц";
	КвартальныйПоказатель.ПредставлениеКрупный	= "более 20 000 лиц";
	КвартальныйПоказатель.ДатаНачала			= Дата(2023, 4, 1);
	
	Возврат ТаблицаКвартальныхПоказателей;
	
КонецФункции

Функция КонтрольКвартальныхПоказателей(ПараметрыРасчета, Запрос, Отказ) Экспорт
	
	//ПараметрыРасчета - используются в конструкции Вычислить(Выборка.Функция)
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ОКУД0420401_ПолучитьТаблицуКвартальныхПоказателей(), "_ВидыПоказателей", Запрос); 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВидыПоказателей.ВидПоказателя КАК ВидПоказателя,
		|	_ВидыПоказателей.Функция КАК Функция,
		|	ФинансовыеПоказатели.Значение КАК Значение,
		|	НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ) КАК Период,
		|	ФинансовыеПоказатели.Регистратор КАК Регистратор
		|ИЗ
		|	_ВидыПоказателей КАК _ВидыПоказателей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО _ВидыПоказателей.ВидПоказателя = ФинансовыеПоказатели.ВидПоказателя
		|			И (ФинансовыеПоказатели.Активность)
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|ГДЕ
		|	_ВидыПоказателей.ДатаНачала <= &ДатаОкончания
		|	И (_ВидыПоказателей.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ _ВидыПоказателей.ДатаОкончания >= &ДатаОкончания)";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Значение = NULL Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Не зарегистрирован показатель '%1' на %2.",
					Выборка.ВидПоказателя,
					Формат(Выборка.Период, "ДФ=dd.MM.yyyy")),,,, Отказ);
		Иначе	
			РасчетноеЗначение = Вычислить(Выборка.Функция);
			Если РасчетноеЗначение <> Выборка.Значение Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("Расчётное значение показателя %1 (%2)  не соответствует зарегистрированному (%3) на %4.",
						Выборка.ВидПоказателя,
						РасчетноеЗначение,
						Выборка.Значение,
						Формат(Выборка.Период, "ДФ=dd.MM.yyyy")), Выборка.Регистратор,,, Отказ);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ОКУД0420417

Процедура ОКУД0420417_ЗаполнитьПараметрыЗапроса(Параметры, Запрос, Отказ, ТолькоВнебиржевойРынок = Истина) Экспорт
	
	Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(
		Запрос.МенеджерВременныхТаблиц,
		Параметры.Период,
		Новый Структура("Организация, ВидДеятельности", Параметры.Организация, Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами),
		"СчетаДУДействующиеВПериоде"); 
		
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СделкиСДатамиЗакрытияИсключения.ДатаНачала КАК ДатаНачала,
		|	_СделкиСДатамиЗакрытияИсключения.Сделка КАК Сделка,
		|	_СделкиСДатамиЗакрытияИсключения.ЧастьСделки КАК ЧастьСделки,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьЧастьСделки КАК ЗаменитьЧастьСделки,
		|	_СделкиСДатамиЗакрытияИсключения.ВидИнформационногоСообщения КАК ВидИнформационногоСообщения,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьВидИнформационногоСообщения КАК ЗаменитьВидИнформационногоСообщения,
		|	_СделкиСДатамиЗакрытияИсключения.КодСтроныНеИсполнившейОбязательства КАК КодСтроныНеИсполнившейОбязательства,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьКодСтроныНеИсполнившейОбязательства КАК ЗаменитьКодСтроныНеИсполнившейОбязательства,
		|	_СделкиСДатамиЗакрытияИсключения.ЗадолженностьПоДС КАК ЗадолженностьПоДС,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьЗадолженностьПоДС КАК ЗаменитьЗадолженностьПоДС,
		|	_СделкиСДатамиЗакрытияИсключения.ДатаПоследнейОплаты КАК ДатаПоследнейОплаты,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьДатаПоследнейОплаты КАК ЗаменитьДатаПоследнейОплаты,
		|	_СделкиСДатамиЗакрытияИсключения.ЗадолженностьПоЦБ КАК ЗадолженностьПоЦБ,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьЗадолженностьПоЦБ КАК ЗаменитьЗадолженностьПоЦБ,
		|	_СделкиСДатамиЗакрытияИсключения.ДатаПоследнейПоставки КАК ДатаПоследнейПоставки,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьДатаПоследнейПоставки КАК ЗаменитьДатаПоследнейПоставки,
		|	_СделкиСДатамиЗакрытияИсключения.ЦенаФинИнстрПервЧасть КАК ЦенаФинИнстрПервЧасть,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьЦенаФинИнстрПервЧасть КАК ЗаменитьЦенаФинИнстрПервЧасть,
		|	_СделкиСДатамиЗакрытияИсключения.СуммаСделкиПервЧасть КАК СуммаСделкиПервЧасть,
		|	_СделкиСДатамиЗакрытияИсключения.ЗаменитьСуммаСделкиПервЧасть КАК ЗаменитьСуммаСделкиПервЧасть
		|ПОМЕСТИТЬ _СделкиСДатамиЗакрытияИсключения
		|ИЗ
		|	&СделкиСДатамиЗакрытияИсключения КАК _СделкиСДатамиЗакрытияИсключения
		|ГДЕ
		|	_СделкиСДатамиЗакрытияИсключения.ДатаНачала = &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСрезПоследних.Сделка КАК Сделка,
		|	УсловияСделокСрезПоследних.Период КАК ДатаУсловий,
		|	УсловияСделокСрезПоследних.Сделка.Дата КАК ДатаСделки,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ПлановаяДатаПоставки,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ПлановаяДатаОплаты,
		|	УсловияСделокСрезПоследних.Отменено КАК Отменено,
		|	1 КАК ЧастьСделки
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	РегистрСведений.УсловияСделок.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И (&ТолькоВнебиржевойРынок = ЛОЖЬ
		|					ИЛИ Сделка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК УсловияСделокСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаДУДействующиеВПериоде КАК СчетаДУДействующиеВПериоде
		|		ПО УсловияСделокСрезПоследних.СчетДоверительногоУправления = СчетаДУДействующиеВПериоде.Ссылка
		|			И (ВЫБОР
		|				КОГДА УсловияСделокСрезПоследних.Сделка.Дата >= &ДатаНачала
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокСрезПоследних.Сделка.Дата, ДЕНЬ)
		|				КОГДА УсловияСделокСрезПоследних.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокСрезПоследних.Период, ДЕНЬ)
		|				ИНАЧЕ &ДатаНачала
		|			КОНЕЦ = СчетаДУДействующиеВПериоде.Дата)
		|ГДЕ
		|	((УсловияСделокСрезПоследних.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|				ИЛИ УсловияСделокСрезПоследних.ДатаПоставки >= &ДатаНачала
		|				ИЛИ УсловияСделокСрезПоследних.ДатаОплаты >= &ДатаНачала)
		|				И (НЕ УсловияСделокСрезПоследних.Отменено
		|					ИЛИ УсловияСделокСрезПоследних.Сделка.Дата < &ДатаНачала
		|						И УсловияСделокСрезПоследних.Период >= &ДатаНачала
		|					ИЛИ &ВерсияТаксономии >= ""4_2"")
		|				И НЕ УсловияСделокСрезПоследних.Сделка.ВыкупЭмитентом
		|				И (&ВыгружатьСделкиПередаваемыеВРепозитарий = ИСТИНА
		|					ИЛИ НЕ УсловияСделокСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)))
		|			ИЛИ УсловияСделокСрезПоследних.Сделка В
		|				(ВЫБРАТЬ
		|					_СделкиСДатамиЗакрытияИсключения.Сделка
		|				ИЗ
		|					_СделкиСДатамиЗакрытияИсключения КАК _СделкиСДатамиЗакрытияИсключения))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО,
		|	УсловияСделокРЕПОПервойЧасти.Период,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.Дата,
		|	УсловияСделокРЕПОПервойЧасти.ДатаПоставки,
		|	УсловияСделокРЕПОПервойЧасти.ДатаОплаты,
		|	УсловияСделокРЕПОПервойЧасти.Отменено,
		|	1
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И ЧастьСделкиРЕПО = 2
		|				И (&ТолькоВнебиржевойРынок = ЛОЖЬ
		|					ИЛИ СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК УсловияСделокРЕПОВторойЧасти
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 1
		|					И (&ТолькоВнебиржевойРынок = ЛОЖЬ
		|						ИЛИ СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК УсловияСделокРЕПОПервойЧасти
		|		ПО УсловияСделокРЕПОВторойЧасти.СделкаРЕПО = УсловияСделокРЕПОПервойЧасти.СделкаРЕПО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаДУДействующиеВПериоде КАК СчетаДУДействующиеВПериоде
		|		ПО (УсловияСделокРЕПОПервойЧасти.СчетДоверительногоУправления = СчетаДУДействующиеВПериоде.Ссылка)
		|			И (ВЫБОР
		|				КОГДА УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.Дата >= &ДатаНачала
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.Дата, ДЕНЬ)
		|				КОГДА УсловияСделокРЕПОПервойЧасти.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокРЕПОПервойЧасти.Период, ДЕНЬ)
		|				ИНАЧЕ &ДатаНачала
		|			КОНЕЦ = СчетаДУДействующиеВПериоде.Дата)
		|ГДЕ
		|	((НЕ УсловияСделокРЕПОПервойЧасти.Отменено
		|				ИЛИ УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.Дата < &ДатаНачала
		|					И УсловияСделокРЕПОПервойЧасти.Период >= &ДатаНачала
		|				ИЛИ &ВерсияТаксономии >= ""4_2"")
		|				И (УсловияСделокРЕПОПервойЧасти.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ИЛИ УсловияСделокРЕПОПервойЧасти.ДатаПоставки >= &ДатаНачала
		|					ИЛИ УсловияСделокРЕПОПервойЧасти.ДатаОплаты >= &ДатаНачала)
		|				И &ВыгружатьСделкиПередаваемыеВРепозитарий = ИСТИНА
		|			ИЛИ УсловияСделокРЕПОПервойЧасти.СделкаРЕПО В
		|				(ВЫБРАТЬ
		|					_СделкиСДатамиЗакрытияИсключения.Сделка
		|				ИЗ
		|					_СделкиСДатамиЗакрытияИсключения КАК _СделкиСДатамиЗакрытияИсключения))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УсловияСделокРЕПОВторойЧасти.СделкаРЕПО,
		|	УсловияСделокРЕПОВторойЧасти.Период,
		|	УсловияСделокРЕПОВторойЧасти.СделкаРЕПО.Дата,
		|	УсловияСделокРЕПОВторойЧасти.ДатаПоставки,
		|	УсловияСделокРЕПОВторойЧасти.ДатаОплаты,
		|	УсловияСделокРЕПОВторойЧасти.Отменено,
		|	2
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И ЧастьСделкиРЕПО = 2
		|				И (&ТолькоВнебиржевойРынок = ЛОЖЬ
		|					ИЛИ СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК УсловияСделокРЕПОВторойЧасти
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 1
		|					И (&ТолькоВнебиржевойРынок = ЛОЖЬ
		|						ИЛИ СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК УсловияСделокРЕПОПервойЧасти
		|		ПО УсловияСделокРЕПОВторойЧасти.СделкаРЕПО = УсловияСделокРЕПОПервойЧасти.СделкаРЕПО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаДУДействующиеВПериоде КАК СчетаДУДействующиеВПериоде
		|		ПО УсловияСделокРЕПОВторойЧасти.СчетДоверительногоУправления = СчетаДУДействующиеВПериоде.Ссылка
		|			И (ВЫБОР
		|				КОГДА УсловияСделокРЕПОВторойЧасти.СделкаРЕПО.Дата >= &ДатаНачала
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокРЕПОВторойЧасти.СделкаРЕПО.Дата, ДЕНЬ)
		|				КОГДА УсловияСделокРЕПОВторойЧасти.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокРЕПОВторойЧасти.Период, ДЕНЬ)
		|				ИНАЧЕ &ДатаНачала
		|			КОНЕЦ = СчетаДУДействующиеВПериоде.Дата)
		|ГДЕ
		|	((НЕ УсловияСделокРЕПОВторойЧасти.Отменено
		|				ИЛИ УсловияСделокРЕПОВторойЧасти.СделкаРЕПО.Дата < &ДатаНачала
		|					И УсловияСделокРЕПОВторойЧасти.Период >= &ДатаНачала
		|				ИЛИ &ВерсияТаксономии >= ""4_2"")
		|				И (УсловияСделокРЕПОВторойЧасти.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ИЛИ УсловияСделокРЕПОВторойЧасти.ДатаПоставки >= &ДатаНачала
		|					ИЛИ УсловияСделокРЕПОВторойЧасти.ДатаОплаты >= &ДатаНачала)
		|				И &ВыгружатьСделкиПередаваемыеВРепозитарий = ИСТИНА
		|			ИЛИ УсловияСделокРЕПОВторойЧасти.СделкаРЕПО В
		|				(ВЫБРАТЬ
		|					_СделкиСДатамиЗакрытияИсключения.Сделка
		|				ИЗ
		|					_СделкиСДатамиЗакрытияИсключения КАК _СделкиСДатамиЗакрытияИсключения))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УсловияСделокСВалютойСрезПоследних.СделкаСВалютой,
		|	УсловияСделокСВалютойСрезПоследних.Период,
		|	УсловияСделокСВалютойСрезПоследних.СделкаСВалютой.Дата,
		|	УсловияСделокСВалютойСрезПоследних.ДатаИсполнения,
		|	УсловияСделокСВалютойСрезПоследних.ДатаИсполнения,
		|	УсловияСделокСВалютойСрезПоследних.Отменено,
		|	1
		|ИЗ
		|	РегистрСведений.УсловияСделокСВалютой.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И СделкаСВалютой.ТипСделки = ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.ФорвардПоставочный)) КАК УсловияСделокСВалютойСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаДУДействующиеВПериоде КАК СчетаДУДействующиеВПериоде
		|		ПО УсловияСделокСВалютойСрезПоследних.СчетДоверительногоУправления = СчетаДУДействующиеВПериоде.Ссылка
		|			И (ВЫБОР
		|				КОГДА УсловияСделокСВалютойСрезПоследних.СделкаСВалютой.Дата >= &ДатаНачала
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокСВалютойСрезПоследних.СделкаСВалютой.Дата, ДЕНЬ)
		|				КОГДА УсловияСделокСВалютойСрезПоследних.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ТОГДА НАЧАЛОПЕРИОДА(УсловияСделокСВалютойСрезПоследних.Период, ДЕНЬ)
		|				ИНАЧЕ &ДатаНачала
		|			КОНЕЦ = СчетаДУДействующиеВПериоде.Дата)
		|ГДЕ
		|	((НЕ УсловияСделокСВалютойСрезПоследних.Отменено
		|				ИЛИ УсловияСделокСВалютойСрезПоследних.СделкаСВалютой.Дата < &ДатаНачала
		|					И УсловияСделокСВалютойСрезПоследних.Период >= &ДатаНачала
		|				ИЛИ &ВерсияТаксономии >= ""4_2"")
		|				И (УсловияСделокСВалютойСрезПоследних.СделкаСВалютой.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ИЛИ УсловияСделокСВалютойСрезПоследних.ДатаИсполнения >= &ДатаНачала)
		|				И &ВыгружатьСделкиПередаваемыеВРепозитарий = ИСТИНА
		|			ИЛИ УсловияСделокСВалютойСрезПоследних.СделкаСВалютой В
		|				(ВЫБРАТЬ
		|					_СделкиСДатамиЗакрытияИсключения.Сделка
		|				ИЗ
		|					_СделкиСДатамиЗакрытияИсключения КАК _СделкиСДатамиЗакрытияИсключения))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.Сделка КАК Сделка,
		|	_Сделки.ЧастьСделки КАК ЧастьСделки,
		|	_Сделки.Отменено КАК Отменено,
		|	_Сделки.ДатаУсловий КАК ДатаУсловий,
		|	_Сделки.ДатаСделки КАК ДатаСделки,
		|	_Сделки.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ * (ЗадолженностиПоДенежнымСредствам.Сумма + ЗадолженностиПоДенежнымСредствам.СуммаКупона), 0)) КАК ЗадолженностьПоДС,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоДенежнымСредствам.Период
		|		КОНЕЦ) КАК ДатаПоследнейОплаты,
		|	_Сделки.ПлановаяДатаПоставки КАК ПлановаяДатаПоставки,
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА ЗадолженностиПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ * ЗадолженностиПоЦеннымБумагам.Количество, 0)) КАК ЗадолженностьПоЦБ,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоЦеннымБумагам.Период
		|		КОНЕЦ) КАК ДатаПоследнейПоставки
		|ПОМЕСТИТЬ _СделкиСИсполнением
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО (ЗадолженностиПоДенежнымСредствам.Организация = &Организация)
		|			И (_Сделки.ЧастьСделки = 1
		|					И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|				ИЛИ _Сделки.ЧастьСделки = 2
		|					И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|			И (ЗадолженностиПоДенежнымСредствам.Основание = _Сделки.Сделка)
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) <= &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
		|		ПО (ЗадолженностиПоЦеннымБумагам.Организация = &Организация)
		|			И (_Сделки.ЧастьСделки = 1
		|					И ЗадолженностиПоЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|				ИЛИ _Сделки.ЧастьСделки = 2
		|					И ЗадолженностиПоЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|			И (ЗадолженностиПоЦеннымБумагам.Основание = _Сделки.Сделка)
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоЦеннымБумагам.Период, ДЕНЬ) <= &ДатаОкончания)
		|ГДЕ
		|	НЕ _Сделки.Сделка ССЫЛКА Документ.СделкаСВалютой
		|
		|СГРУППИРОВАТЬ ПО
		|	_Сделки.Сделка,
		|	_Сделки.ЧастьСделки,
		|	_Сделки.ДатаУсловий,
		|	_Сделки.ДатаСделки,
		|	_Сделки.ПлановаяДатаПоставки,
		|	_Сделки.ПлановаяДатаОплаты,
		|	_Сделки.Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Сделки.Сделка,
		|	_Сделки.ЧастьСделки,
		|	_Сделки.Отменено,
		|	_Сделки.ДатаУсловий,
		|	_Сделки.ДатаСделки,
		|	_Сделки.ПлановаяДатаОплаты,
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствам.Валюта = _Сделки.Сделка.Контрвалюта
		|						И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					ТОГДА -1
		|				КОГДА ЗадолженностиПоДенежнымСредствам.Валюта = _Сделки.Сделка.Контрвалюта
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ * ЗадолженностиПоДенежнымСредствам.Сумма, 0)),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствам.Валюта = _Сделки.Сделка.Контрвалюта
		|					И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоДенежнымСредствам.Период
		|		КОНЕЦ),
		|	_Сделки.ПлановаяДатаПоставки,
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствам.Валюта = _Сделки.Сделка.Валюта
		|						И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					ТОГДА -1
		|				КОГДА ЗадолженностиПоДенежнымСредствам.Валюта = _Сделки.Сделка.Валюта
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ * ЗадолженностиПоДенежнымСредствам.Сумма, 0)),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствам.Валюта = _Сделки.Сделка.Валюта
		|					И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоДенежнымСредствам.Период
		|		КОНЕЦ)
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО (ЗадолженностиПоДенежнымСредствам.Организация = &Организация)
		|			И (ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|					ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.СделкаСВалютой).Основание
		|				КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоФорвардуПоставки)
		|					ТОГДА ЗадолженностиПоДенежнымСредствам.Основание
		|			КОНЕЦ = _Сделки.Сделка)
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) <= _Сделки.ПлановаяДатаОплаты)
		|ГДЕ
		|	_Сделки.Сделка ССЫЛКА Документ.СделкаСВалютой
		|
		|СГРУППИРОВАТЬ ПО
		|	_Сделки.Сделка,
		|	_Сделки.ЧастьСделки,
		|	_Сделки.Отменено,
		|	_Сделки.ДатаУсловий,
		|	_Сделки.ДатаСделки,
		|	_Сделки.ПлановаяДатаОплаты,
		|	_Сделки.ПлановаяДатаПоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СделкиСИсполнением.Сделка КАК Сделка,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьЧастьСделки = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.ЧастьСделки
		|		ИНАЧЕ _СделкиСИсполнением.ЧастьСделки
		|	КОНЕЦ КАК ЧастьСделки,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьВидИнформационногоСообщения = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.ВидИнформационногоСообщения
		|		КОГДА _СделкиСИсполнением.Отменено
		|			ТОГДА ""CANCEL""
		|		КОГДА _СделкиСИсполнением.ЗадолженностьПоДС = 0
		|				И _СделкиСИсполнением.ЗадолженностьПоЦБ = 0
		|				И _СделкиСИсполнением.ДатаПоследнейОплаты < _СделкиСИсполнением.ПлановаяДатаОплаты
		|				И _СделкиСИсполнением.ДатаПоследнейПоставки < _СделкиСИсполнением.ПлановаяДатаПоставки
		|				И _СделкиСИсполнением.ДатаСделки < &ДатаНачала
		|			ТОГДА ""EXECUTION""
		|		КОГДА _СделкиСИсполнением.ПлановаяДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|					И _СделкиСИсполнением.ПлановаяДатаОплаты < &ДатаОкончания
		|					И _СделкиСИсполнением.ЗадолженностьПоДС > 0
		|				ИЛИ _СделкиСИсполнением.ПлановаяДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|					И _СделкиСИсполнением.ПлановаяДатаПоставки < &ДатаОкончания
		|					И _СделкиСИсполнением.ЗадолженностьПоЦБ > 0
		|			ТОГДА ""FAILURE""
		|		КОГДА _СделкиСИсполнением.ДатаСделки < &ДатаНачала
		|			ТОГДА ""CHANGE""
		|		ИНАЧЕ ""NEW""
		|	КОНЕЦ КАК ВидИнформационногоСообщения,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьКодСтроныНеИсполнившейОбязательства = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.КодСтроныНеИсполнившейОбязательства
		|		КОГДА _СделкиСИсполнением.ПлановаяДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|				И _СделкиСИсполнением.ПлановаяДатаОплаты < &ДатаОкончания
		|				И _СделкиСИсполнением.ЗадолженностьПоДС > 0
		|				И _СделкиСИсполнением.ПлановаяДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|				И _СделкиСИсполнением.ПлановаяДатаПоставки < &ДатаОкончания
		|				И _СделкиСИсполнением.ЗадолженностьПоЦБ > 0
		|			ТОГДА ""3""
		|		КОГДА _СделкиСИсполнением.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И _СделкиСИсполнением.ПлановаяДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|					И _СделкиСИсполнением.ПлановаяДатаОплаты < &ДатаОкончания
		|					И _СделкиСИсполнением.ЗадолженностьПоДС > 0
		|				ИЛИ _СделкиСИсполнением.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И _СделкиСИсполнением.ПлановаяДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|					И _СделкиСИсполнением.ПлановаяДатаПоставки < &ДатаОкончания
		|					И _СделкиСИсполнением.ЗадолженностьПоЦБ > 0
		|			ТОГДА ""1""
		|		КОГДА _СделкиСИсполнением.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И _СделкиСИсполнением.ПлановаяДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|					И _СделкиСИсполнением.ПлановаяДатаОплаты < &ДатаОкончания
		|					И _СделкиСИсполнением.ЗадолженностьПоДС > 0
		|				ИЛИ _СделкиСИсполнением.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И _СделкиСИсполнением.ПлановаяДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|					И _СделкиСИсполнением.ПлановаяДатаПоставки < &ДатаОкончания
		|					И _СделкиСИсполнением.ЗадолженностьПоЦБ > 0
		|			ТОГДА ""2""
		|		ИНАЧЕ &ПустоеЗначение
		|	КОНЕЦ КАК КодСтроныНеИсполнившейОбязательства,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьЗадолженностьПоДС = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.ЗадолженностьПоДС
		|		ИНАЧЕ _СделкиСИсполнением.ЗадолженностьПоДС
		|	КОНЕЦ КАК ЗадолженностьПоДС,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьДатаПоследнейОплаты = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.ДатаПоследнейОплаты
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(_СделкиСИсполнением.ДатаПоследнейОплаты, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПоследнейОплаты,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьЗадолженностьПоЦБ = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.ЗадолженностьПоЦБ
		|		ИНАЧЕ _СделкиСИсполнением.ЗадолженностьПоЦБ
		|	КОНЕЦ КАК ЗадолженностьПоЦБ,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьДатаПоследнейПоставки = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.ДатаПоследнейПоставки
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(_СделкиСИсполнением.ДатаПоследнейПоставки, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПоследнейПоставки
		|ПОМЕСТИТЬ _СделкиСДатамиЗакрытия
		|ИЗ
		|	_СделкиСИсполнением КАК _СделкиСИсполнением
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиСДатамиЗакрытияИсключения КАК _СделкиСДатамиЗакрытияИсключения
		|		ПО _СделкиСИсполнением.Сделка = _СделкиСДатамиЗакрытияИсключения.Сделка
		|ГДЕ
		|	(_СделкиСИсполнением.Отменено
		|			ИЛИ _СделкиСИсполнением.ДатаСделки МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ _СделкиСИсполнением.ДатаУсловий МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ _СделкиСИсполнением.ЗадолженностьПоДС = 0
		|				И _СделкиСИсполнением.ЗадолженностьПоЦБ = 0
		|				И (_СделкиСИсполнением.ДатаПоследнейОплаты МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|				И (_СделкиСИсполнением.ДатаПоследнейПоставки МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|				И _СделкиСИсполнением.ДатаПоследнейОплаты < _СделкиСИсполнением.ПлановаяДатаОплаты
		|				И _СделкиСИсполнением.ДатаПоследнейПоставки < _СделкиСИсполнением.ПлановаяДатаПоставки
		|				И _СделкиСИсполнением.ДатаСделки < &ДатаНачала
		|			ИЛИ _СделкиСИсполнением.ПлановаяДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|				И _СделкиСИсполнением.ПлановаяДатаОплаты < &ДатаОкончания
		|				И _СделкиСИсполнением.ЗадолженностьПоДС > 0
		|			ИЛИ _СделкиСИсполнением.ПлановаяДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|				И _СделкиСИсполнением.ПлановаяДатаПоставки < &ДатаОкончания
		|				И _СделкиСИсполнением.ЗадолженностьПоЦБ > 0
		|			ИЛИ _СделкиСДатамиЗакрытияИсключения.Сделка ЕСТЬ НЕ NULL )
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СделкиСДатамиЗакрытия.Сделка КАК Сделка,
		|	_СделкиСДатамиЗакрытия.ВидИнформационногоСообщения КАК ВидИнформационногоСообщения,
		|	_СделкиСДатамиЗакрытия.КодСтроныНеИсполнившейОбязательства КАК КодСтроныНеИсполнившейОбязательства
		|ПОМЕСТИТЬ _ВидыИнформационныхСообщений
		|ИЗ
		|	_СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВидыИнформационныхСообщений.Сделка КАК Сделка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВидыИнформационныхСообщений.ВидИнформационногоСообщения) КАК КоличествоВидИнформационныхСообщений
		|ПОМЕСТИТЬ _РазныеВидыИнформационныхСообщений
		|ИЗ
		|	_ВидыИнформационныхСообщений КАК _ВидыИнформационныхСообщений
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВидыИнформационныхСообщений.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВложенныйЗапрос.НаименованиеКлиента КАК Наименование,
		|	ВложенныйЗапрос.КодСтраны КАК КодСтраны,
		|	ВложенныйЗапрос.ТипИдентификатора КАК ТипИдентификатора,
		|	ВложенныйЗапрос.Идентификатор КАК Идентификатор,
		|	ВложенныйЗапрос.ЭтоЮрЛицо КАК ЭтоЮрЛицо,
		|	ВложенныйЗапрос.РезидентРФ КАК РезидентРФ
		|ПОМЕСТИТЬ ВТ_РеквизитыЮрФизЛицАнкетные
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|		РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКлиента,
		|		ВЫБОР
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ
		|				ТОГДА ""5""
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КИО <> """"
		|				ТОГДА ""6""
		|			ИНАЧЕ ""7""
		|		КОНЕЦ КАК ТипИдентификатора,
		|		ВЫБОР
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ
		|				ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КИО <> """"
		|				ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КИО
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН <> """"
		|				ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН
		|		КОНЕЦ КАК Идентификатор,
		|		ВЫБОР
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.МеждународнаяФинансоваяОрганизация)
		|				ТОГДА ""998""
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации.Код
		|			КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ
		|				ТОГДА ""643""
		|			ИНАЧЕ &ПустоеЗначение
		|		КОНЕЦ КАК КодСтраны,
		|		ИСТИНА КАК ЭтоЮрЛицо,
		|		РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ КАК РезидентРФ
		|	ИЗ
		|		РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.РУсский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо,
		|		""ФЛ"",
		|		""9"",
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности + РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности + ""/"" + ЕСТЬNULL(КодыВоВнешнихСистемахСрезПоследних.Код, """"),
		|		ВЫБОР
		|			КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство.Код
		|			КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ
		|				ТОГДА ""643""
		|			ИНАЧЕ &ПустоеЗначение
		|		КОНЕЦ,
		|		ЛОЖЬ,
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ
		|	ИЗ
		|		РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.РУсский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|					&ДатаОкончания,
		|					ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
		|						И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.УказаниеЦБ3533У)) КАК КодыВоВнешнихСистемахСрезПоследних
		|			ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = КодыВоВнешнихСистемахСрезПоследних.Объект) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВложенныйЗапрос.НаименованиеКлиента КАК Наименование,
		|	ВложенныйЗапрос.КодСтраны КАК КодСтраны,
		|	ВложенныйЗапрос.ТипИдентификатора КАК ТипИдентификатора,
		|	ВложенныйЗапрос.Идентификатор КАК Идентификатор,
		|	ВложенныйЗапрос.ЭтоЮрЛицо КАК ЭтоЮрЛицо,
		|	ВложенныйЗапрос.РезидентРФ КАК РезидентРФ
		|ПОМЕСТИТЬ ВТ_РеквизитыЮрЛиц
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|		РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКлиента,
		|		ВЫБОР
		|			КОГДА РеквизитыЮридическихЛицСрезПоследних.РезидентРФ
		|				ТОГДА ""5""
		|			ИНАЧЕ ""7""
		|		КОНЕЦ КАК ТипИдентификатора,
		|		ВЫБОР
		|			КОГДА РеквизитыЮридическихЛицСрезПоследних.РезидентРФ
		|				ТОГДА РеквизитыЮридическихЛицСрезПоследних.ИНН
		|			КОГДА ЕСТЬNULL(ДокументыЮридическихЛицСрезПоследних.Номер, """") <> """"
		|				ТОГДА ДокументыЮридическихЛицСрезПоследних.Номер
		|		КОНЕЦ КАК Идентификатор,
		|		ВЫБОР
		|			КОГДА РеквизитыЮридическихЛицСрезПоследних.МеждународнаяКомпания
		|				ТОГДА ""996""
		|			КОГДА РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.МеждународнаяФинансоваяОрганизация)
		|				ТОГДА ""998""
		|			КОГДА РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ТОГДА РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации.Код
		|			КОГДА РеквизитыЮридическихЛицСрезПоследних.РезидентРФ
		|				ТОГДА ""643""
		|			ИНАЧЕ &ПустоеЗначение
		|		КОНЕЦ КАК КодСтраны,
		|		ИСТИНА КАК ЭтоЮрЛицо,
		|		РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК РезидентРФ
		|	ИЗ
		|		РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.РУсский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
		|					&ДатаОкончания,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОРегистрации)) КАК ДокументыЮридическихЛицСрезПоследних
		|			ПО РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо = ДокументыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|				И (ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &ДатаОкончания)) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_РеквизитыЮрФизЛицАнкетные.Наименование КАК НаименованиеКлиента,
		|	ВТ_РеквизитыЮрФизЛицАнкетные.КодСтраны КАК КодСтраны,
		|	ВТ_РеквизитыЮрФизЛицАнкетные.ТипИдентификатора КАК ТипИдентификатора,
		|	ВТ_РеквизитыЮрФизЛицАнкетные.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВТ_РеквизитыКлиентовДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЮрФизЛицАнкетные КАК ВТ_РеквизитыЮрФизЛицАнкетные
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ВТ_РеквизитыЮрФизЛицАнкетные.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДепозитарныеКомпании.Ссылка КАК Депозитарий,
		|	ВТ_РеквизитыЮрЛиц.Наименование КАК НаименованиеДепозитария,
		|	ВТ_РеквизитыЮрЛиц.КодСтраны КАК КодСтраныРегистрацииДепозитария,
		|	ВТ_РеквизитыЮрЛиц.Идентификатор КАК ИдентификаторДепозитария
		|ПОМЕСТИТЬ ВТ_РеквизитыДепозитариев
		|ИЗ
		|	Справочник.ДепозитарныеКомпании КАК ДепозитарныеКомпании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеквизитыЮрЛиц КАК ВТ_РеквизитыЮрЛиц
		|		ПО ДепозитарныеКомпании.ЮрФизЛицо = ВТ_РеквизитыЮрЛиц.ЮрФизЛицо
		|			И (ВТ_РеквизитыЮрЛиц.ЭтоЮрЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Эмитенты.Ссылка КАК Эмитент,
		|	ВТ_РеквизитыЮрЛиц.Наименование КАК НаименованиеЭмитента,
		|	ВТ_РеквизитыЮрЛиц.КодСтраны КАК КодСтраныРегистрацииЭмитента,
		|	ВТ_РеквизитыЮрЛиц.РезидентРФ КАК РезидентРФ
		|ПОМЕСТИТЬ ВТ_РеквизитыЭмитентов
		|ИЗ
		|	Справочник.Эмитенты КАК Эмитенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеквизитыЮрЛиц КАК ВТ_РеквизитыЮрЛиц
		|		ПО Эмитенты.ЮрФизЛицо = ВТ_РеквизитыЮрЛиц.ЮрФизЛицо
		|			И (ВТ_РеквизитыЮрЛиц.ЭтоЮрЛицо)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УправляющиеКомпании.Ссылка,
		|	ВТ_РеквизитыЮрЛиц.Наименование,
		|	ВТ_РеквизитыЮрЛиц.КодСтраны,
		|	ВТ_РеквизитыЮрЛиц.РезидентРФ
		|ИЗ
		|	Справочник.УправляющиеКомпании КАК УправляющиеКомпании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеквизитыЮрЛиц КАК ВТ_РеквизитыЮрЛиц
		|		ПО УправляющиеКомпании.ЮрФизЛицо = ВТ_РеквизитыЮрЛиц.ЮрФизЛицо
		|			И (ВТ_РеквизитыЮрЛиц.ЭтоЮрЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN
		|ПОМЕСТИТЬ ВТ_ISIN_ЦенныхБумаг
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереченьЦенныхБумагПредназначенныхДляКвалифицированныхИнвесторовСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПереченьЦенныхБумагПредназначенныхДляКвалифицированныхИнвесторовСрезПоследних.Рынок КАК Рынок,
		|	ПереченьЦенныхБумагПредназначенныхДляКвалифицированныхИнвесторовСрезПоследних.Предназначена КАК Предназначена
		|ПОМЕСТИТЬ ВТ_ЦенныеБумагиДляКвалИнвесторов
		|ИЗ
		|	РегистрСведений.ПереченьЦенныхБумагПредназначенныхДляКвалифицированныхИнвесторов.СрезПоследних(&ДатаОкончания, ) КАК ПереченьЦенныхБумагПредназначенныхДляКвалифицированныхИнвесторовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""CANCEL"" КАК ВидИнформационногоСообщенияВСделке,
		|	""NEW"" КАК ВидИнформационногоСообщения
		|ПОМЕСТИТЬ _ЗадвоениеОтмененныхСделок
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""CANCEL"",
		|	""CANCEL""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСрезПоследних.Сделка КАК Сделка,
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.НомерСтроки КАК НомерСтрокиСделки,
		|	0 КАК Кол1_НомерСтроки,
		|	&ПустаяСтрока КАК Кол2_НомерСделки,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|			ТОГДА ""OWN""
		|		ИНАЧЕ ""AM""
		|	КОНЕЦ КАК Кол3_ТипСделки,
		|	УсловияСделокСрезПоследних.Сделка.Дата КАК Кол4_ДатаСделки,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.Сделка.ПриобретениеПаев
		|				ИЛИ УсловияСделокСрезПоследних.Сделка.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.МировоеСоглашение)
		|			ТОГДА ""OTHER""
		|		ИНАЧЕ ""BS""
		|	КОНЕЦ КАК Кол5_КодДоговора,
		|	&ПустоеЗначение КАК Кол6_ВидФинИнстр,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ КАК Кол7_КодНаправлСделки,
		|	ЕСТЬNULL(_ЗадвоениеОтмененныхСделок.ВидИнформационногоСообщения, _СделкиСДатамиЗакрытия.ВидИнформационногоСообщения) КАК Кол8_ВидИнфСообщ,
		|	_СделкиСДатамиЗакрытия.КодСтроныНеИсполнившейОбязательства КАК Кол12_СторонаНеиспОбяз,
		|	УсловияСделокСрезПоследних.Сделка.ПлатежноеУсловиеСделки КАК Кол9_ПлатежныеУсловия,
		|	&ПустоеЗначение КАК Кол10_ИННЦентрКонтраг,
		|	&ПустоеЗначение КАК Кол11_ИнфСистема,
		|	ВТ_РеквизитыКлиентовДУ.НаименованиеКлиента КАК Кол13_НаименКлиента,
		|	ВТ_РеквизитыКлиентовДУ.ТипИдентификатора КАК Кол14_ТипИдентифКлиента,
		|	ВЫБОР
		|		КОГДА ВТ_РеквизитыКлиентовДУ.ТипИдентификатора = ""9""
		|				И &ВерсияТаксономии >= ""4_2""
		|			ТОГДА УсловияСделокСрезПоследних.СчетДоверительногоУправления.КодСчета
		|		ИНАЧЕ ВТ_РеквизитыКлиентовДУ.Идентификатор
		|	КОНЕЦ КАК Кол15_ИдентифКлиента,
		|	ВТ_РеквизитыКлиентовДУ.КодСтраны КАК Кол16_КодСтраныКлиента,
		|	ВТ_РеквизитыДепозитариев.НаименованиеДепозитария КАК Кол17_НаименДепозитария,
		|	ВТ_РеквизитыДепозитариев.КодСтраныРегистрацииДепозитария КАК Кол18_КодСтраныДепозитария,
		|	ВТ_РеквизитыДепозитариев.ИдентификаторДепозитария КАК Кол19_ИдентифДепозитария,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА УсловияСделокСрезПоследних.ДепозитарныйСчет.Родитель.НомерСчета
		|		ИНАЧЕ УсловияСделокСрезПоследних.ДепозитарныйСчет.НомерСчета
		|	КОНЕЦ КАК Кол20_НомерДепозитСчета,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				ИЛИ УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				ИЛИ УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|							И УсловияСделокСрезПоследних.ЦеннаяБумага.СтранаРазмещения = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|						ТОГДА &ПустоеЗначение
		|					ИНАЧЕ ""Небанковская кредитная организация акционерное общество """"Национальный расчетный депозитарий""""""
		|				КОНЕЦ
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|			ТОГДА &ПустоеЗначение
		|		ИНАЧЕ ""Небанковская кредитная организация акционерное общество """"Национальный расчетный депозитарий""""""
		|	КОНЕЦ КАК Кол21_МестоХранения,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрЛиц.Наименование, &ПустоеЗначение)
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.Наименование, &ПустоеЗначение)
		|	КОНЕЦ КАК Кол22_НаименКонтрагента,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрЛиц.ТипИдентификатора, &ПустоеЗначение)
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.ТипИдентификатора, &ПустоеЗначение)
		|	КОНЕЦ КАК Кол23_ТипИдентифКонтрагента,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрЛиц.Идентификатор, &ПустоеЗначение)
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.Идентификатор, &ПустоеЗначение)
		|	КОНЕЦ КАК Кол24_ИдентифКонтрагента,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрЛиц.КодСтраны, &ПустоеЗначение)
		|		КОГДА УсловияСделокСрезПоследних.Сделка.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.КодСтраны, &ПустоеЗначение)
		|	КОНЕЦ КАК Кол25_КодСтраныКонтрагента,
		|	ВТ_РеквизитыДепозитариевКонтрагентов.НаименованиеДепозитария КАК Кол26_НаимДепозитКонтрагента,
		|	ВТ_РеквизитыДепозитариевКонтрагентов.КодСтраныРегистрацииДепозитария КАК Кол27_КодСтраныДепозитКонтрагента,
		|	ВТ_РеквизитыДепозитариевКонтрагентов.ИдентификаторДепозитария КАК Кол28_ИдентифДепКонтрагента,
		|	УсловияСделокСрезПоследних.Сделка.ДепозитарныйСчетКонтрагента.НомерСчета КАК Кол29_НомерДепозитСчетаКонтраг,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ПОДСТРОКА(РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда, 1, 150) + "" "" + ВТ_РеквизитыЭмитентов.НаименованиеЭмитента
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВТ_РеквизитыЭмитентов.НаименованиеЭмитента + "" ("" + ВТ_РеквизитыЭмитентовБазовыхАктивов.НаименованиеЭмитента + "")""
		|		ИНАЧЕ ВТ_РеквизитыЭмитентов.НаименованиеЭмитента
		|	КОНЕЦ КАК Кол30_НаименЭмитентаПервЧасть,
		|	ПОДСТРОКА(УсловияСделокСрезПоследних.ЦеннаяБумага.УчетныйАктивЦБРФ.КодЦБРФ, 16, 4) КАК Кол31_ВидФинИнстрПервЧасть,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ISIN_ЦенныхБумаг.ISIN ЕСТЬ NULL
		|			ТОГДА ВТ_ISIN_ЦенныхБумаг.ISIN
		|		ИНАЧЕ ЕСТЬNULL(УсловияСделокСрезПоследних.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, &ПустоеЗначение)
		|	КОНЕЦ КАК Кол32_КодISINПервЧасть,
		|	ВТ_РеквизитыЭмитентов.КодСтраныРегистрацииЭмитента КАК Кол33_КодСтраныЭмитПервЧасть,
		|	УсловияСделокСрезПоследних.Количество КАК Кол34_КоличествоПервЧасть,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ""E1""
		|		ИНАЧЕ &ПустоеЗначение
		|	КОНЕЦ КАК Кол35_ТипБазАктива,
		|	ЕСТЬNULL(ВТ_ISIN_БазовыхАктивов.ISIN, &ПустоеЗначение) КАК Кол36_БазАктивПервЧасть,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				ИЛИ УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				ИЛИ УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|							И УсловияСделокСрезПоследних.ЦеннаяБумага.СтранаРазмещения = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|						ТОГДА ""ВНТ""
		|					ИНАЧЕ ""ВНШ""
		|				КОНЕЦ
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|			ТОГДА ""ВНТ""
		|		ИНАЧЕ ""ВНШ""
		|	КОНЕЦ КАК Кол37_ТипФинИнстДляЦБПервЧасть,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦенныеБумагиДляКвалИнвесторов.Предназначена, ЛОЖЬ)
		|			ТОГДА ""КИ""
		|		ИНАЧЕ ""НИ""
		|	КОНЕЦ КАК Кол38_ТипФинИнстДляИнвестПервЧасть,
		|	УсловияСделокСрезПоследних.Сделка.ВалютаСделки.Код КАК Кол39_ВалютаСделкиПервЧасть,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьЦенаФинИнстрПервЧасть = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.ЦенаФинИнстрПервЧасть
		|		ИНАЧЕ УсловияСделокСрезПоследних.Цена
		|	КОНЕЦ КАК Кол40_ЦенаФинИнстрПервЧасть,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытияИсключения.ЗаменитьСуммаСделкиПервЧасть = ИСТИНА
		|			ТОГДА _СделкиСДатамиЗакрытияИсключения.СуммаСделкиПервЧасть
		|		ИНАЧЕ УсловияСделокСрезПоследних.Сумма + УсловияСделокСрезПоследних.СуммаКупона
		|	КОНЕЦ КАК Кол41_СуммаСделкиПервЧасть,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА УсловияСделокСрезПоследних.СуммаКупона
		|		ИНАЧЕ &ПустоеЗначение
		|	КОНЕЦ КАК Кол42_СуммаДоходаПервЧасть,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия.ЗадолженностьПоЦБ = 0
		|				И НЕ УсловияСделокСрезПоследних.Отменено
		|			ТОГДА _СделкиСДатамиЗакрытия.ДатаПоследнейПоставки
		|		ИНАЧЕ УсловияСделокСрезПоследних.ДатаПоставки
		|	КОНЕЦ КАК Кол43_ПланДатаПеререгПравПервЧасть,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия.ЗадолженностьПоДС = 0
		|				И НЕ УсловияСделокСрезПоследних.Отменено
		|			ТОГДА _СделкиСДатамиЗакрытия.ДатаПоследнейОплаты
		|		ИНАЧЕ УсловияСделокСрезПоследних.ДатаОплаты
		|	КОНЕЦ КАК Кол44_ПланДатаОплатыПервЧасть,
		|	&ПустоеЗначение КАК Кол45_СтавкаПервЧасть,
		|	&ПустоеЗначение КАК Кол46_НаименЭмитентаВторЧасть,
		|	&ПустоеЗначение КАК Кол47_ВидФинИнстрВторЧасть,
		|	&ПустоеЗначение КАК Кол48_КодISINВторЧасть,
		|	&ПустоеЗначение КАК Кол49_КодСтраныЭмитВторЧасть,
		|	&ПустоеЗначение КАК Кол50_КоличествоВторЧасть,
		|	&ПустоеЗначение КАК Кол51_ТипБазАктиваВторЧасть,
		|	&ПустоеЗначение КАК Кол52_БазАктивВторЧасть,
		|	&ПустоеЗначение КАК Кол53_ТипФинИнстрДляЦБВторЧасть,
		|	&ПустоеЗначение КАК Кол54_ТипФинИнстрДляИнвестВторЧасть,
		|	&ПустоеЗначение КАК Кол55_ВалютаСделкиВторЧасть,
		|	&ПустоеЗначение КАК Кол56_ЦенаФинИнстрВторЧасть,
		|	&ПустоеЗначение КАК Кол57_СуммаСделкиВторЧасть,
		|	&ПустоеЗначение КАК Кол58_СуммаДоходаВторЧасть,
		|	&ПустоеЗначение КАК Кол59_ПланДатаПеререгПравВторЧасть,
		|	&ПустоеЗначение КАК Кол60_ПланДатаОплатыВторЧасть,
		|	&ПустоеЗначение КАК Кол61_ИнфПовторПредоставл,
		|	УсловияСделокСрезПоследних.Отменено КАК Отменено,
		|	УсловияСделокСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокСрезПоследних.Сделка.ВалютаСделки КАК ВалютаСделки,
		|	(УсловияСделокСрезПоследних.Сумма + УсловияСделокСрезПоследних.СуммаКупона) * КурсыВалютыСделки.Курс / КурсыВалютыСделки.Кратность КАК СуммаСделкиВВалютеУчета,
		|	КурсыВалютыСделки.Курс / КурсыВалютыСделки.Кратность КАК КурсВалютыСделки,
		|	УсловияСделокСрезПоследних.Сделка.МестоХранения КАК МестоХранения
		|ПОМЕСТИТЬ _ТаблицаОтчета
		|ИЗ
		|	РегистрСведений.УсловияСделок.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Сделка В
		|					(ВЫБРАТЬ
		|						_СделкиСДатамиЗакрытия.Сделка
		|					ИЗ
		|						_СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия)) КАК УсловияСделокСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия
		|		ПО (_СделкиСДатамиЗакрытия.Сделка = УсловияСделокСрезПоследних.Сделка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиСДатамиЗакрытияИсключения КАК _СделкиСДатамиЗакрытияИсключения
		|		ПО (_СделкиСДатамиЗакрытия.Сделка = _СделкиСДатамиЗакрытияИсключения.Сделка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадвоениеОтмененныхСделок КАК _ЗадвоениеОтмененныхСделок
		|		ПО (_ЗадвоениеОтмененныхСделок.ВидИнформационногоСообщенияВСделке = _СделкиСДатамиЗакрытия.ВидИнформационногоСообщения)
		|			И (УсловияСделокСрезПоследних.Сделка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (&ВерсияТаксономии >= ""4_2"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыКлиентовДУ КАК ВТ_РеквизитыКлиентовДУ
		|		ПО УсловияСделокСрезПоследних.СчетДоверительногоУправления = ВТ_РеквизитыКлиентовДУ.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(УсловияСделокСрезПоследних.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыДепозитариев КАК ВТ_РеквизитыДепозитариев
		|		ПО УсловияСделокСрезПоследних.ДепозитарныйСчет.Депозитарий = ВТ_РеквизитыДепозитариев.Депозитарий
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЭмитентов КАК ВТ_РеквизитыЭмитентов
		|		ПО (ВЫБОР
		|				КОГДА УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|				ИНАЧЕ УсловияСделокСрезПоследних.ЦеннаяБумага.Эмитент
		|			КОНЕЦ = ВТ_РеквизитыЭмитентов.Эмитент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ISIN_ЦенныхБумаг КАК ВТ_ISIN_ЦенныхБумаг
		|		ПО УсловияСделокСрезПоследних.ЦеннаяБумага = ВТ_ISIN_ЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ISIN_ЦенныхБумаг КАК ВТ_ISIN_БазовыхАктивов
		|		ПО (УсловияСделокСрезПоследних.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки)
		|			И УсловияСделокСрезПоследних.ЦеннаяБумага.БазоваяЦБ = ВТ_ISIN_БазовыхАктивов.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенныеБумагиДляКвалИнвесторов КАК ВТ_ЦенныеБумагиДляКвалИнвесторов
		|		ПО УсловияСделокСрезПоследних.Рынок = ВТ_ЦенныеБумагиДляКвалИнвесторов.Рынок
		|			И УсловияСделокСрезПоследних.ЦеннаяБумага = ВТ_ЦенныеБумагиДляКвалИнвесторов.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО УсловияСделокСрезПоследних.Сделка = СделкаЦенныеБумаги.Ссылка
		|			И УсловияСделокСрезПоследних.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЮрФизЛицАнкетные КАК ВТ_РеквизитыЮрФизЛицАнкетные
		|		ПО УсловияСделокСрезПоследних.Сделка.Контрагент = ВТ_РеквизитыЮрФизЛицАнкетные.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЮрЛиц КАК ВТ_РеквизитыЮрЛиц
		|		ПО УсловияСделокСрезПоследних.Сделка.Контрагент = ВТ_РеквизитыЮрЛиц.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЭмитентов КАК ВТ_РеквизитыЭмитентовБазовыхАктивов
		|		ПО УсловияСделокСрезПоследних.ЦеннаяБумага.БазоваяЦБ.Эмитент = ВТ_РеквизитыЭмитентовБазовыхАктивов.Эмитент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыДепозитариев КАК ВТ_РеквизитыДепозитариевКонтрагентов
		|		ПО УсловияСделокСрезПоследних.Сделка.ДепозитарныйСчетКонтрагента.Депозитарий = ВТ_РеквизитыДепозитариевКонтрагентов.Депозитарий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютыСделки
		|		ПО (КурсыВалютыСделки.Период = НАЧАЛОПЕРИОДА(УсловияСделокСрезПоследних.Сделка.Дата, ДЕНЬ))
		|			И (КурсыВалютыСделки.Валюта = УсловияСделокСрезПоследних.Сделка.ВалютаСделки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО,
		|	УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.НомерСтроки,
		|	0,
		|	&ПустаяСтрока,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|			ТОГДА ""OWN""
		|		ИНАЧЕ ""AM""
		|	КОНЕЦ,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.Дата,
		|	""REPO"",
		|	&ПустоеЗначение,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ,
		|	ЕСТЬNULL(_ЗадвоениеОтмененныхСделок.ВидИнформационногоСообщения, _ВидыИнформационныхСообщений.ВидИнформационногоСообщения),
		|	_ВидыИнформационныхСообщений.КодСтроныНеИсполнившейОбязательства,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.ПлатежноеУсловиеСделки,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	ВТ_РеквизитыКлиентовДУ.НаименованиеКлиента,
		|	ВТ_РеквизитыКлиентовДУ.ТипИдентификатора,
		|	ВЫБОР
		|		КОГДА ВТ_РеквизитыКлиентовДУ.ТипИдентификатора = ""9""
		|				И &ВерсияТаксономии >= ""4_2""
		|			ТОГДА УсловияСделокРЕПОПервойЧасти.СчетДоверительногоУправления.КодСчета
		|		ИНАЧЕ ВТ_РеквизитыКлиентовДУ.Идентификатор
		|	КОНЕЦ,
		|	ВТ_РеквизитыКлиентовДУ.КодСтраны,
		|	ВТ_РеквизитыДепозитариев.НаименованиеДепозитария,
		|	ВТ_РеквизитыДепозитариев.КодСтраныРегистрацииДепозитария,
		|	ВТ_РеквизитыДепозитариев.ИдентификаторДепозитария,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА УсловияСделокРЕПОПервойЧасти.ДепозитарныйСчет.Родитель.НомерСчета
		|		ИНАЧЕ УсловияСделокРЕПОПервойЧасти.ДепозитарныйСчет.НомерСчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				ИЛИ УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				ИЛИ УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|							И УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.СтранаРазмещения = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|						ТОГДА &ПустоеЗначение
		|					ИНАЧЕ ""Небанковская кредитная организация акционерное общество """"Национальный расчетный депозитарий""""""
		|				КОНЕЦ
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|			ТОГДА &ПустоеЗначение
		|		ИНАЧЕ ""Небанковская кредитная организация акционерное общество """"Национальный расчетный депозитарий""""""
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.Наименование, &ПустоеЗначение),
		|	ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.ТипИдентификатора, &ПустоеЗначение),
		|	ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.Идентификатор, &ПустоеЗначение),
		|	ЕСТЬNULL(ВТ_РеквизитыЮрФизЛицАнкетные.КодСтраны, &ПустоеЗначение),
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ПОДСТРОКА(РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда, 1, 150) + "" "" + ВТ_РеквизитыЭмитентовПервойЧасти.НаименованиеЭмитента
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВТ_РеквизитыЭмитентовПервойЧасти.НаименованиеЭмитента + "" ("" + ВТ_РеквизитыЭмитентовБазовыхАктивовПервойЧасти.НаименованиеЭмитента + "")""
		|		ИНАЧЕ ВТ_РеквизитыЭмитентовПервойЧасти.НаименованиеЭмитента
		|	КОНЕЦ,
		|	ПОДСТРОКА(УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.УчетныйАктивЦБРФ.КодЦБРФ, 16, 4),
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ISIN_ЦенныхБумаг.ISIN ЕСТЬ NULL
		|			ТОГДА ВТ_ISIN_ЦенныхБумаг.ISIN
		|		ИНАЧЕ ЕСТЬNULL(УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, &ПустоеЗначение)
		|	КОНЕЦ,
		|	ВТ_РеквизитыЭмитентовПервойЧасти.КодСтраныРегистрацииЭмитента,
		|	УсловияСделокРЕПОПервойЧасти.Количество,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ""E1""
		|		ИНАЧЕ &ПустоеЗначение
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_ISIN_БазовыхАктивов.ISIN, &ПустоеЗначение),
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				ИЛИ УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				ИЛИ УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|							И УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.СтранаРазмещения = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|						ТОГДА ""ВНТ""
		|					ИНАЧЕ ""ВНШ""
		|				КОНЕЦ
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|			ТОГДА ""ВНТ""
		|		ИНАЧЕ ""ВНШ""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦенныеБумагиДляКвалИнвесторов.Предназначена, ЛОЖЬ)
		|			ТОГДА ""КИ""
		|		ИНАЧЕ ""НИ""
		|	КОНЕЦ,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.ВалютаСделки.Код,
		|	УсловияСделокРЕПОПервойЧасти.Цена,
		|	УсловияСделокРЕПОПервойЧасти.Сумма + УсловияСделокРЕПОПервойЧасти.СуммаКупона,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА УсловияСделокРЕПОПервойЧасти.СуммаКупона
		|		ИНАЧЕ &ПустоеЗначение
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия.ЗадолженностьПоЦБ = 0
		|				И НЕ УсловияСделокРЕПОПервойЧасти.Отменено
		|			ТОГДА _СделкиСДатамиЗакрытия.ДатаПоследнейПоставки
		|		ИНАЧЕ УсловияСделокРЕПОПервойЧасти.ДатаПоставки
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия.ЗадолженностьПоДС = 0
		|				И НЕ УсловияСделокРЕПОПервойЧасти.Отменено
		|			ТОГДА _СделкиСДатамиЗакрытия.ДатаПоследнейОплаты
		|		ИНАЧЕ УсловияСделокРЕПОПервойЧасти.ДатаОплаты
		|	КОНЕЦ,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.СтавкаРЕПО,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ПОДСТРОКА(РеквизитыПИФСрезПоследнихВторойЧасти.ПолноеНаименованиеФонда, 1, 150) + "" "" + ВТ_РеквизитыЭмитентовВторойЧасти.НаименованиеЭмитента
		|		КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВТ_РеквизитыЭмитентовВторойЧасти.НаименованиеЭмитента + "" ("" + ВТ_РеквизитыЭмитентовБазовыхАктивовВторойЧасти.НаименованиеЭмитента + "")""
		|		ИНАЧЕ ВТ_РеквизитыЭмитентовВторойЧасти.НаименованиеЭмитента
		|	КОНЕЦ,
		|	ПОДСТРОКА(УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага.УчетныйАктивЦБРФ.КодЦБРФ, 16, 4),
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ISIN_ЦенныхБумаг2.ISIN ЕСТЬ NULL
		|			ТОГДА ВТ_ISIN_ЦенныхБумаг2.ISIN
		|		ИНАЧЕ ЕСТЬNULL(УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, &ПустоеЗначение)
		|	КОНЕЦ,
		|	ВТ_РеквизитыЭмитентовВторойЧасти.КодСтраныРегистрацииЭмитента,
		|	УсловияСделокРЕПОВторойЧасти.Количество,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ""E1""
		|		ИНАЧЕ &ПустоеЗначение
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_ISIN_БазовыхАктивов2.ISIN, &ПустоеЗначение),
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				ИЛИ УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				ИЛИ УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|							И УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага.СтранаРазмещения = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|						ТОГДА ""ВНТ""
		|					ИНАЧЕ ""ВНШ""
		|				КОНЕЦ
		|		КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|			ТОГДА ""ВНТ""
		|		ИНАЧЕ ""ВНШ""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦенныеБумагиДляКвалИнвесторов2.Предназначена, ЛОЖЬ)
		|			ТОГДА ""КИ""
		|		ИНАЧЕ ""НИ""
		|	КОНЕЦ,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.ВалютаСделки.Код,
		|	УсловияСделокРЕПОВторойЧасти.Цена,
		|	УсловияСделокРЕПОВторойЧасти.Сумма + УсловияСделокРЕПОВторойЧасти.СуммаКупона,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА УсловияСделокРЕПОВторойЧасти.СуммаКупона
		|		ИНАЧЕ &ПустоеЗначение
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия_Часть2.ЗадолженностьПоЦБ = 0
		|				И НЕ УсловияСделокРЕПОВторойЧасти.Отменено
		|			ТОГДА _СделкиСДатамиЗакрытия_Часть2.ДатаПоследнейПоставки
		|		ИНАЧЕ УсловияСделокРЕПОВторойЧасти.ДатаПоставки
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия_Часть2.ЗадолженностьПоДС = 0
		|				И НЕ УсловияСделокРЕПОВторойЧасти.Отменено
		|			ТОГДА _СделкиСДатамиЗакрытия_Часть2.ДатаПоследнейОплаты
		|		ИНАЧЕ УсловияСделокРЕПОВторойЧасти.ДатаОплаты
		|	КОНЕЦ,
		|	&ПустоеЗначение,
		|	УсловияСделокРЕПОПервойЧасти.Отменено,
		|	УсловияСделокРЕПОПервойЧасти.СчетДоверительногоУправления,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.ВалютаСделки,
		|	(УсловияСделокРЕПОПервойЧасти.Сумма + УсловияСделокРЕПОПервойЧасти.СуммаКупона) * КурсыВалютыСделки.Курс / КурсыВалютыСделки.Кратность,
		|	КурсыВалютыСделки.Курс / КурсыВалютыСделки.Кратность,
		|	УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.МестоХранения
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И СделкаРЕПО В
		|					(ВЫБРАТЬ
		|						_СделкиСДатамиЗакрытия.Сделка
		|					ИЗ
		|						_СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия)
		|				И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОВторойЧасти
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И СделкаРЕПО В
		|						(ВЫБРАТЬ
		|							_СделкиСДатамиЗакрытия.Сделка
		|						ИЗ
		|							_СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия)
		|					И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОПервойЧасти
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних
		|			ПО (ВЫРАЗИТЬ(УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|		ПО (УсловияСделокРЕПОПервойЧасти.СделкаРЕПО = УсловияСделокРЕПОВторойЧасти.СделкаРЕПО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия
		|		ПО (УсловияСделокРЕПОПервойЧасти.СделкаРЕПО = _СделкиСДатамиЗакрытия.Сделка)
		|			И (_СделкиСДатамиЗакрытия.ЧастьСделки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия_Часть2
		|		ПО (УсловияСделокРЕПОПервойЧасти.СделкаРЕПО = _СделкиСДатамиЗакрытия_Часть2.Сделка)
		|			И (_СделкиСДатамиЗакрытия_Часть2.ЧастьСделки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыКлиентовДУ КАК ВТ_РеквизитыКлиентовДУ
		|		ПО (УсловияСделокРЕПОПервойЧасти.СчетДоверительногоУправления = ВТ_РеквизитыКлиентовДУ.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыДепозитариев КАК ВТ_РеквизитыДепозитариев
		|		ПО (УсловияСделокРЕПОПервойЧасти.ДепозитарныйСчет.Депозитарий = ВТ_РеквизитыДепозитариев.Депозитарий)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЭмитентов КАК ВТ_РеквизитыЭмитентовПервойЧасти
		|		ПО (ВЫБОР
		|				КОГДА УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|				ИНАЧЕ УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.Эмитент
		|			КОНЕЦ = ВТ_РеквизитыЭмитентовПервойЧасти.Эмитент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ISIN_ЦенныхБумаг КАК ВТ_ISIN_ЦенныхБумаг
		|		ПО (УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага = ВТ_ISIN_ЦенныхБумаг.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ISIN_ЦенныхБумаг КАК ВТ_ISIN_БазовыхАктивов
		|		ПО (УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки)
		|			И (УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.БазоваяЦБ = ВТ_ISIN_БазовыхАктивов.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенныеБумагиДляКвалИнвесторов КАК ВТ_ЦенныеБумагиДляКвалИнвесторов
		|		ПО (УсловияСделокРЕПОПервойЧасти.Рынок = ВТ_ЦенныеБумагиДляКвалИнвесторов.Рынок)
		|			И (УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага = ВТ_ЦенныеБумагиДляКвалИнвесторов.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЭмитентов КАК ВТ_РеквизитыЭмитентовВторойЧасти
		|		ПО (ВЫБОР
		|				КОГДА УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|				ИНАЧЕ УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага.Эмитент
		|			КОНЕЦ = ВТ_РеквизитыЭмитентовВторойЧасти.Эмитент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследнихВторойЧасти
		|		ПО (ВЫРАЗИТЬ(УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследнихВторойЧасти.ПаевойИнвестиционныйФонд)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ISIN_ЦенныхБумаг КАК ВТ_ISIN_ЦенныхБумаг2
		|		ПО УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага = ВТ_ISIN_ЦенныхБумаг2.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенныеБумагиДляКвалИнвесторов КАК ВТ_ЦенныеБумагиДляКвалИнвесторов2
		|		ПО УсловияСделокРЕПОВторойЧасти.Рынок = ВТ_ЦенныеБумагиДляКвалИнвесторов2.Рынок
		|			И УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага = ВТ_ЦенныеБумагиДляКвалИнвесторов2.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ISIN_ЦенныхБумаг КАК ВТ_ISIN_БазовыхАктивов2
		|		ПО (УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки)
		|			И УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага.БазоваяЦБ = ВТ_ISIN_БазовыхАктивов2.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|		ПО (УсловияСделокРЕПОПервойЧасти.СделкаРЕПО = СделкаРЕПОЦенныеБумаги.Ссылка)
		|			И (УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага = СделкаРЕПОЦенныеБумаги.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЮрФизЛицАнкетные КАК ВТ_РеквизитыЮрФизЛицАнкетные
		|		ПО УсловияСделокРЕПОВторойЧасти.СделкаРЕПО.Контрагент = ВТ_РеквизитыЮрФизЛицАнкетные.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЭмитентов КАК ВТ_РеквизитыЭмитентовБазовыхАктивовПервойЧасти
		|		ПО (УсловияСделокРЕПОПервойЧасти.ЦеннаяБумага.БазоваяЦБ.Эмитент = ВТ_РеквизитыЭмитентовБазовыхАктивовПервойЧасти.Эмитент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыЭмитентов КАК ВТ_РеквизитыЭмитентовБазовыхАктивовВторойЧасти
		|		ПО УсловияСделокРЕПОВторойЧасти.ЦеннаяБумага.БазоваяЦБ.Эмитент = ВТ_РеквизитыЭмитентовБазовыхАктивовВторойЧасти.Эмитент
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыИнформационныхСообщений КАК _ВидыИнформационныхСообщений
		|		ПО УсловияСделокРЕПОВторойЧасти.СделкаРЕПО = _ВидыИнформационныхСообщений.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадвоениеОтмененныхСделок КАК _ЗадвоениеОтмененныхСделок
		|		ПО (_ЗадвоениеОтмененныхСделок.ВидИнформационногоСообщенияВСделке = _ВидыИнформационныхСообщений.ВидИнформационногоСообщения)
		|			И (_ВидыИнформационныхСообщений.Сделка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (&ВерсияТаксономии >= ""4_2"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютыСделки
		|		ПО (КурсыВалютыСделки.Период = НАЧАЛОПЕРИОДА(УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.Дата, ДЕНЬ))
		|			И (КурсыВалютыСделки.Валюта = УсловияСделокРЕПОПервойЧасти.СделкаРЕПО.ВалютаСделки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаСВалютой.Ссылка,
		|	&ПустоеЗначение,
		|	1,
		|	0,
		|	&ПустаяСтрока,
		|	ВЫБОР
		|		КОГДА СделкаСВалютой.СчетДоверительногоУправления.ВидСчетаДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|			ТОГДА ""OWN""
		|		ИНАЧЕ ""AM""
		|	КОНЕЦ,
		|	СделкаСВалютой.Дата,
		|	""FORWARD"",
		|	""1"",
		|	ВЫБОР
		|		КОГДА СделкаСВалютой.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ,
		|	_СделкиСДатамиЗакрытия.ВидИнформационногоСообщения,
		|	_СделкиСДатамиЗакрытия.КодСтроныНеИсполнившейОбязательства,
		|	""P"",
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	ВТ_РеквизитыКлиентовДУ.НаименованиеКлиента,
		|	ВЫБОР
		|		КОГДА ВТ_РеквизитыКлиентовДУ.ТипИдентификатора = ""9""
		|				И &ВерсияТаксономии >= ""4_2""
		|			ТОГДА СделкаСВалютой.СчетДоверительногоУправления.КодСчета
		|		ИНАЧЕ ВТ_РеквизитыКлиентовДУ.Идентификатор
		|	КОНЕЦ,
		|	ВТ_РеквизитыКлиентовДУ.Идентификатор,
		|	ВТ_РеквизитыКлиентовДУ.КодСтраны,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	""OTHER"",
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	СделкаСВалютой.Сумма,
		|	""V1"",
		|	СделкаСВалютой.Валюта.Код,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	СделкаСВалютой.Контрвалюта.Код,
		|	СделкаСВалютой.Курс,
		|	СделкаСВалютой.СуммаКонтрвалюты,
		|	&ПустоеЗначение,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия.ЗадолженностьПоЦБ = 0
		|			ТОГДА _СделкиСДатамиЗакрытия.ДатаПоследнейПоставки
		|		ИНАЧЕ СделкаСВалютой.ДатаИсполнения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _СделкиСДатамиЗакрытия.ЗадолженностьПоДС = 0
		|			ТОГДА _СделкиСДатамиЗакрытия.ДатаПоследнейОплаты
		|		ИНАЧЕ СделкаСВалютой.ДатаИсполнения
		|	КОНЕЦ,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	&ПустоеЗначение,
		|	ЛОЖЬ,
		|	СделкаСВалютой.СчетДоверительногоУправления,
		|	СделкаСВалютой.Контрвалюта,
		|	СделкаСВалютой.СуммаКонтрвалюты * КурсыВалютыСделки.Курс / КурсыВалютыСделки.Кратность,
		|	КурсыВалютыСделки.Курс / КурсыВалютыСделки.Кратность,
		|	СделкаСВалютой.МестоХранения
		|ИЗ
		|	Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СделкиСДатамиЗакрытия КАК _СделкиСДатамиЗакрытия
		|		ПО (_СделкиСДатамиЗакрытия.Сделка = СделкаСВалютой.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыКлиентовДУ КАК ВТ_РеквизитыКлиентовДУ
		|		ПО СделкаСВалютой.СчетДоверительногоУправления = ВТ_РеквизитыКлиентовДУ.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютыСделки
		|		ПО (КурсыВалютыСделки.Период = НАЧАЛОПЕРИОДА(СделкаСВалютой.Дата, ДЕНЬ))
		|			И (КурсыВалютыСделки.Валюта = СделкаСВалютой.Контрвалюта)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаОтчета.Сделка КАК Сделка,
		|	_ТаблицаОтчета.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаОтчета.НомерСтрокиСделки КАК НомерСтрокиСделки,
		|	_ТаблицаОтчета.Кол1_НомерСтроки КАК Кол1_НомерСтроки,
		|	_ТаблицаОтчета.Кол2_НомерСделки КАК Кол2_НомерСделки,
		|	_ТаблицаОтчета.Кол3_ТипСделки КАК Кол3_ТипСделки,
		|	_ТаблицаОтчета.Кол4_ДатаСделки КАК Кол4_ДатаСделки,
		|	_ТаблицаОтчета.Кол5_КодДоговора КАК Кол5_КодДоговора,
		|	_ТаблицаОтчета.Кол6_ВидФинИнстр КАК Кол6_ВидФинИнстр,
		|	_ТаблицаОтчета.Кол7_КодНаправлСделки КАК Кол7_КодНаправлСделки,
		|	_ТаблицаОтчета.Кол8_ВидИнфСообщ КАК Кол8_ВидИнфСообщ,
		|	_ТаблицаОтчета.Кол9_ПлатежныеУсловия КАК Кол9_ПлатежныеУсловия,
		|	_ТаблицаОтчета.Кол10_ИННЦентрКонтраг КАК Кол10_ИННЦентрКонтраг,
		|	_ТаблицаОтчета.Кол11_ИнфСистема КАК Кол11_ИнфСистема,
		|	_ТаблицаОтчета.Кол12_СторонаНеиспОбяз КАК Кол12_СторонаНеиспОбяз,
		|	_ТаблицаОтчета.Кол13_НаименКлиента КАК Кол13_НаименКлиента,
		|	_ТаблицаОтчета.Кол14_ТипИдентифКлиента КАК Кол14_ТипИдентифКлиента,
		|	_ТаблицаОтчета.Кол15_ИдентифКлиента КАК Кол15_ИдентифКлиента,
		|	_ТаблицаОтчета.Кол16_КодСтраныКлиента КАК Кол16_КодСтраныКлиента,
		|	_ТаблицаОтчета.Кол17_НаименДепозитария КАК Кол17_НаименДепозитария,
		|	_ТаблицаОтчета.Кол18_КодСтраныДепозитария КАК Кол18_КодСтраныДепозитария,
		|	_ТаблицаОтчета.Кол19_ИдентифДепозитария КАК Кол19_ИдентифДепозитария,
		|	_ТаблицаОтчета.Кол20_НомерДепозитСчета КАК Кол20_НомерДепозитСчета,
		|	_ТаблицаОтчета.Кол21_МестоХранения КАК Кол21_МестоХранения,
		|	_ТаблицаОтчета.Кол22_НаименКонтрагента КАК Кол22_НаименКонтрагента,
		|	_ТаблицаОтчета.Кол23_ТипИдентифКонтрагента КАК Кол23_ТипИдентифКонтрагента,
		|	_ТаблицаОтчета.Кол24_ИдентифКонтрагента КАК Кол24_ИдентифКонтрагента,
		|	_ТаблицаОтчета.Кол25_КодСтраныКонтрагента КАК Кол25_КодСтраныКонтрагента,
		|	_ТаблицаОтчета.Кол26_НаимДепозитКонтрагента КАК Кол26_НаимДепозитКонтрагента,
		|	_ТаблицаОтчета.Кол27_КодСтраныДепозитКонтрагента КАК Кол27_КодСтраныДепозитКонтрагента,
		|	_ТаблицаОтчета.Кол28_ИдентифДепКонтрагента КАК Кол28_ИдентифДепКонтрагента,
		|	_ТаблицаОтчета.Кол29_НомерДепозитСчетаКонтраг КАК Кол29_НомерДепозитСчетаКонтраг,
		|	_ТаблицаОтчета.Кол30_НаименЭмитентаПервЧасть КАК Кол30_НаименЭмитентаПервЧасть,
		|	_ТаблицаОтчета.Кол31_ВидФинИнстрПервЧасть КАК Кол31_ВидФинИнстрПервЧасть,
		|	_ТаблицаОтчета.Кол32_КодISINПервЧасть КАК Кол32_КодISINПервЧасть,
		|	_ТаблицаОтчета.Кол33_КодСтраныЭмитПервЧасть КАК Кол33_КодСтраныЭмитПервЧасть,
		|	_ТаблицаОтчета.Кол34_КоличествоПервЧасть КАК Кол34_КоличествоПервЧасть,
		|	_ТаблицаОтчета.Кол35_ТипБазАктива КАК Кол35_ТипБазАктива,
		|	_ТаблицаОтчета.Кол36_БазАктивПервЧасть КАК Кол36_БазАктивПервЧасть,
		|	_ТаблицаОтчета.Кол37_ТипФинИнстДляЦБПервЧасть КАК Кол37_ТипФинИнстДляЦБПервЧасть,
		|	_ТаблицаОтчета.Кол38_ТипФинИнстДляИнвестПервЧасть КАК Кол38_ТипФинИнстДляИнвестПервЧасть,
		|	_ТаблицаОтчета.Кол39_ВалютаСделкиПервЧасть КАК Кол39_ВалютаСделкиПервЧасть,
		|	_ТаблицаОтчета.Кол40_ЦенаФинИнстрПервЧасть КАК Кол40_ЦенаФинИнстрПервЧасть,
		|	_ТаблицаОтчета.Кол41_СуммаСделкиПервЧасть КАК Кол41_СуммаСделкиПервЧасть,
		|	_ТаблицаОтчета.Кол42_СуммаДоходаПервЧасть КАК Кол42_СуммаДоходаПервЧасть,
		|	_ТаблицаОтчета.Кол43_ПланДатаПеререгПравПервЧасть КАК Кол43_ПланДатаПеререгПравПервЧасть,
		|	_ТаблицаОтчета.Кол44_ПланДатаОплатыПервЧасть КАК Кол44_ПланДатаОплатыПервЧасть,
		|	_ТаблицаОтчета.Кол45_СтавкаПервЧасть КАК Кол45_СтавкаПервЧасть,
		|	_ТаблицаОтчета.Кол46_НаименЭмитентаВторЧасть КАК Кол46_НаименЭмитентаВторЧасть,
		|	_ТаблицаОтчета.Кол47_ВидФинИнстрВторЧасть КАК Кол47_ВидФинИнстрВторЧасть,
		|	_ТаблицаОтчета.Кол48_КодISINВторЧасть КАК Кол48_КодISINВторЧасть,
		|	_ТаблицаОтчета.Кол49_КодСтраныЭмитВторЧасть КАК Кол49_КодСтраныЭмитВторЧасть,
		|	_ТаблицаОтчета.Кол50_КоличествоВторЧасть КАК Кол50_КоличествоВторЧасть,
		|	_ТаблицаОтчета.Кол51_ТипБазАктиваВторЧасть КАК Кол51_ТипБазАктиваВторЧасть,
		|	_ТаблицаОтчета.Кол52_БазАктивВторЧасть КАК Кол52_БазАктивВторЧасть,
		|	_ТаблицаОтчета.Кол53_ТипФинИнстрДляЦБВторЧасть КАК Кол53_ТипФинИнстрДляЦБВторЧасть,
		|	_ТаблицаОтчета.Кол54_ТипФинИнстрДляИнвестВторЧасть КАК Кол54_ТипФинИнстрДляИнвестВторЧасть,
		|	_ТаблицаОтчета.Кол55_ВалютаСделкиВторЧасть КАК Кол55_ВалютаСделкиВторЧасть,
		|	_ТаблицаОтчета.Кол56_ЦенаФинИнстрВторЧасть КАК Кол56_ЦенаФинИнстрВторЧасть,
		|	_ТаблицаОтчета.Кол57_СуммаСделкиВторЧасть КАК Кол57_СуммаСделкиВторЧасть,
		|	_ТаблицаОтчета.Кол58_СуммаДоходаВторЧасть КАК Кол58_СуммаДоходаВторЧасть,
		|	_ТаблицаОтчета.Кол59_ПланДатаПеререгПравВторЧасть КАК Кол59_ПланДатаПеререгПравВторЧасть,
		|	_ТаблицаОтчета.Кол60_ПланДатаОплатыВторЧасть КАК Кол60_ПланДатаОплатыВторЧасть,
		|	_ТаблицаОтчета.Кол61_ИнфПовторПредоставл КАК Кол61_ИнфПовторПредоставл
		|ИЗ
		|	_ТаблицаОтчета КАК _ТаблицаОтчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ТаблицаОтчета.Кол4_ДатаСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаОтчета.Сделка КАК Сделка,
		|	_ТаблицаОтчета.Сделка КАК ID_vnebirg_sdelkiTaxis,
		|	_ТаблицаОтчета.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаОтчета.НомерСтрокиСделки КАК НомерСтрокиСделки,
		|	_ТаблицаОтчета.Кол1_НомерСтроки КАК ID_strokiTaxis,
		|	_ТаблицаОтчета.Кол2_НомерСделки КАК VnebirzhSdelka,
		|	_ТаблицаОтчета.Кол2_НомерСделки КАК ID_NomeraInformSoobshheniyaOSdelkeTaxis,
		|	_ТаблицаОтчета.Кол3_ТипСделки КАК TipVnebirzhSdelkiEnumerator,
		|	_ТаблицаОтчета.Кол4_ДатаСделки КАК Data_zaklyucheniya_sdelki_Rekv_Vnebirzh_Sdelki,
		|	_ТаблицаОтчета.Кол5_КодДоговора КАК Vid_Dogovora_vnebirzhevoj_sdelkiEnumerator,
		|	_ТаблицаОтчета.Кол6_ВидФинИнстр КАК Vid_PFIEnumerator,
		|	_ТаблицаОтчета.Кол7_КодНаправлСделки КАК Kod_naprav_sdelkiEnumerator,
		|	_ТаблицаОтчета.Кол8_ВидИнфСообщ КАК Vid_Inf_SoobshhEnumerator,
		|	_ТаблицаОтчета.Кол9_ПлатежныеУсловия КАК PlatezhUsloviyaSdelkiEnumerator,
		|	_ТаблицаОтчета.Кол10_ИННЦентрКонтраг КАК INN_czentralnogo_kontragenta_Rekv_Vnebirzh_Sdelki,
		|	_ТаблицаОтчета.Кол11_ИнфСистема КАК Inform_analiticheskaya_sistema_Rekv_Vnebirzh_Sdelki,
		|	ВЫБОР
		|		КОГДА _ТаблицаОтчета.Кол12_СторонаНеиспОбяз = ""1""
		|			ТОГДА ""OtchitOrganizacziyaMember""
		|		КОГДА _ТаблицаОтчета.Кол12_СторонаНеиспОбяз = ""2""
		|			ТОГДА ""KontragentPoSdelkeMember""
		|		КОГДА _ТаблицаОтчета.Кол12_СторонаНеиспОбяз = ""3""
		|			ТОГДА ""ObeStoronyMember""
		|		ИНАЧЕ _ТаблицаОтчета.Кол12_СторонаНеиспОбяз
		|	КОНЕЦ КАК Kod_storon_NeIspoln_ObyazatPOVnebirzhSdelkeEnumerator,
		|	_ТаблицаОтчета.Кол13_НаименКлиента КАК Naim_klienta_po_vnebirzhevoj_sdelke_Rek_kl_vneb_sd,
		|	_ТаблицаОтчета.Кол14_ТипИдентифКлиента КАК Tip_identif_klienta_VnebirzhSdelkaEnumerator,
		|	_ТаблицаОтчета.Кол15_ИдентифКлиента КАК Identifikator_klienta_po_vneb_sdelke_Rek_kl_vneb_sd,
		|	_ТаблицаОтчета.Кол16_КодСтраныКлиента КАК Kod_strany_registr_klienta_po_vnebirzh_sdelkeEnumerator,
		|	_ТаблицаОтчета.Кол17_НаименДепозитария КАК Naim_depoz_klienta_po_vnebirzhevoj_sdelke_Rek_kl_vneb_sd,
		|	_ТаблицаОтчета.Кол18_КодСтраныДепозитария КАК Kod_strany_depozitariya_po_vnebirzh_sdelkeEnumerator,
		|	_ТаблицаОтчета.Кол19_ИдентифДепозитария КАК Identifikator_depozitariya_Rek_kl_vneb_sd,
		|	_ТаблицаОтчета.Кол20_НомерДепозитСчета КАК Nomer_depozitarnogo_scheta_Rek_kl_vneb_sd,
		|	_ТаблицаОтчета.Кол21_МестоХранения КАК Mesto_xraneniya_CZB,
		|	_ТаблицаОтчета.Кол22_НаименКонтрагента КАК Naim_kontragenta_po_vnebirzh_sdelke_Rek_kontr_po_vneb_sd,
		|	_ТаблицаОтчета.Кол23_ТипИдентифКонтрагента КАК Tip_identif_kontr_VnebirzhSdelkaEnumerator,
		|	_ТаблицаОтчета.Кол24_ИдентифКонтрагента КАК Identr_kontr_po_vneb_sdelke_Rek_kontr_po_vneb_sd,
		|	_ТаблицаОтчета.Кол25_КодСтраныКонтрагента КАК Kod_strany_registr_kontrag_vnebirzh_sdelkeEnumerator,
		|	_ТаблицаОтчета.Кол26_НаимДепозитКонтрагента КАК Naim_depoz_kontr_po_vneb_sdelke_Rek_kontr_po_vneb_sd,
		|	_ТаблицаОтчета.Кол27_КодСтраныДепозитКонтрагента КАК Kod_strany_depozitariya_kontrag_vnebirzh_sdelkeEnumerator,
		|	_ТаблицаОтчета.Кол28_ИдентифДепКонтрагента КАК Ident_depozitariya_kontragenta_Rek_kontr_po_vneb_sd,
		|	_ТаблицаОтчета.Кол29_НомерДепозитСчетаКонтраг КАК Nomer_depozit_scheta_kontragenta_po_vnebirzhevoj_sdelke,
		|	_ТаблицаОтчета.Кол30_НаименЭмитентаПервЧасть КАК Naim_em_Rek_em_Inf_perv_chast_sdelki,
		|	_ТаблицаОтчета.Кол31_ВидФинИнстрПервЧасть КАК TipCZenBum_Vid_Fin_Instr_1chsdEnumerator,
		|	_ТаблицаОтчета.Кол32_КодISINПервЧасть КАК ISIN_Rek_em,
		|	_ТаблицаОтчета.Кол33_КодСтраныЭмитПервЧасть КАК Kod_strany_emitenta_Inf_perv_chast_sdelkiEnumerator,
		|	_ТаблицаОтчета.Кол34_КоличествоПервЧасть КАК Kolvo_fin_instr_Rek_em,
		|	_ТаблицаОтчета.Кол35_ТипБазАктива КАК Tip_bazovogo_aktivaEnumerator,
		|	_ТаблицаОтчета.Кол36_БазАктивПервЧасть КАК Bazovyj_aktiv,
		|	_ТаблицаОтчета.Кол37_ТипФинИнстДляЦБПервЧасть КАК Tip_FI_vo_VnebSdelke_vnutr_vnesh_CZENBUME1chsdEnumerator,
		|	_ТаблицаОтчета.Кол38_ТипФинИнстДляИнвестПервЧасть КАК Tip_FI_vo_VnebSdelke_Kvalif_Nekvalif_Inv_1chsdEnumerator,
		|	_ТаблицаОтчета.Кол39_ВалютаСделкиПервЧасть КАК Kod_valyuty_vnebirzh_sdelk_Inf_1chast_sdelkEnumerator,
		|	_ТаблицаОтчета.Кол40_ЦенаФинИнстрПервЧасть КАК CZena_fin_instrumenta_Rek_em,
		|	_ТаблицаОтчета.Кол41_СуммаСделкиПервЧасть КАК Summa_sdelki_v_ediniczax_valyuty_czeny_sdelki_Rek_em,
		|	_ТаблицаОтчета.Кол42_СуммаДоходаПервЧасть КАК Summa_nakoplennogo_kuponnogo_doxoda_v_val_Rek_em,
		|	_ТаблицаОтчета.Кол43_ПланДатаПеререгПравПервЧасть КАК Data_pereregistraczii_prav_na_finansovyj_instrument_Rek_em,
		|	_ТаблицаОтчета.Кол44_ПланДатаОплатыПервЧасть КАК Data_oplaty_fin_instrumenta_Rek_em,
		|	_ТаблицаОтчета.Кол45_СтавкаПервЧасть КАК Proczentnaya_stavka_po_sdelke_Rek_em,
		|	_ТаблицаОтчета.Кол46_НаименЭмитентаВторЧасть КАК Naim_emitenta_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол47_ВидФинИнстрВторЧасть КАК Tip_CZen_Bum_Vid_Fin_Instr_2chsdEnumerator,
		|	_ТаблицаОтчета.Кол48_КодISINВторЧасть КАК ISIN_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол49_КодСтраныЭмитВторЧасть КАК Kod_stran__emit_Inf_o_vtor_chast_sdelkEnumerator,
		|	_ТаблицаОтчета.Кол50_КоличествоВторЧасть КАК Kolvo_fin_instr_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол51_ТипБазАктиваВторЧасть КАК Tip_bazovogo_aktiva_2chsdEnumerator,
		|	_ТаблицаОтчета.Кол52_БазАктивВторЧасть КАК Bazovyj_aktiv2,
		|	_ТаблицаОтчета.Кол53_ТипФинИнстрДляЦБВторЧасть КАК Tip_FI_vo_VnebSdelke_vnutr_vnesh_CZEN_BUM_2chsdEnumerator,
		|	_ТаблицаОтчета.Кол54_ТипФинИнстрДляИнвестВторЧасть КАК Tip_FI_vo_VnebSdelke_Kvalif_Nekvalif_Inv_2chsdEnumerator,
		|	_ТаблицаОтчета.Кол55_ВалютаСделкиВторЧасть КАК Kod_valyuty_vnebirzh_sdelk_Inf_2chast_sdelkEnumerator,
		|	_ТаблицаОтчета.Кол56_ЦенаФинИнстрВторЧасть КАК CZena_fin_instrumenta_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол57_СуммаСделкиВторЧасть КАК Summa_sdelki_v_val_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол58_СуммаДоходаВторЧасть КАК Summa_nakop_kup_dox_v_val_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол59_ПланДатаПеререгПравВторЧасть КАК Data_perereg_prav_na_fin_instr_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол60_ПланДатаОплатыВторЧасть КАК Data_oplaty_fin_instrumenta_Inf_o_vtor_chast_sdelki,
		|	_ТаблицаОтчета.Кол61_ИнфПовторПредоставл КАК Inform_povtor_predost_sved_oSdelkeEnumerator,
		|	ЕСТЬNULL(ПодтверждениеОперацийБэкОфисаСрезПоследних.Подтверждена, ЛОЖЬ) КАК Podtverjdenie_operaciiEnumerator
		|ИЗ
		|	_ТаблицаОтчета КАК _ТаблицаОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(&ТекущаяДата, Организация = &Организация) КАК ПодтверждениеОперацийБэкОфисаСрезПоследних
		|		ПО _ТаблицаОтчета.Сделка = ПодтверждениеОперацийБэкОфисаСрезПоследних.Операция
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ТаблицаОтчета.Кол4_ДатаСделки";


	
#КонецОбласти		
	
	Запрос.УстановитьПараметр("ДатаНачала"		,		Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	,		Параметры.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ТекущаяДата"		,		ТекущаяДата());
	Запрос.УстановитьПараметр("Организация"		,		Параметры.Организация);
	Запрос.УстановитьПараметр("ПустоеЗначение"	,		"Неприменимо");
	Запрос.УстановитьПараметр("ПустаяСтрока"	, 		"                                                                                                                                                                                                 ");
	Запрос.УстановитьПараметр("ВерсияТаксономии",		Параметры.ВерсияТаксономии);
	Запрос.УстановитьПараметр("ТолькоВнебиржевойРынок", ТолькоВнебиржевойРынок);
	
	Запрос.УстановитьПараметр("СделкиСДатамиЗакрытияИсключения", ОКУД0420417_СделкиСДатамиЗакрытияИсключения(Параметры));
	
	Запрос.УстановитьПараметр("ВыгружатьСделкиПередаваемыеВРепозитарий", РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьЗначениеНастройкиОтчета("_ОтчетностьЦБ", "ВыгружатьСделкиПередаваемыеВРепозитарий", Параметры.Организация, Параметры.Период.ДатаОкончания));
	Если Запрос.Параметры.ВыгружатьСделкиПередаваемыеВРепозитарий = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для отчёта не задано значение настройки: ВыгружатьСделкиПередаваемыеВРепозитарий",,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ОКУД0420417_СделкиСДатамиЗакрытияИсключения(Параметры)
	
	СделкиСДатамиЗакрытияИсключения = Новый ТаблицаЗначений;
	
	ТипыСделок = Новый Массив;
	ТипыСделок.Добавить(Тип("ДокументСсылка.Сделка"));
	ТипыСделок.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
	ТипыСделок.Добавить(Тип("ДокументСсылка.СделкаСВалютой"));
	
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ДатаНачала",									Новый ОписаниеТипов("Дата"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("Сделка",										Новый ОписаниеТипов(ТипыСделок));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЧастьСделки",									Новый ОписаниеТипов("Число"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьЧастьСделки",							Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ВидИнформационногоСообщения",					Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьВидИнформационногоСообщения",			Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("КодСтроныНеИсполнившейОбязательства",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1, ДопустимаяДлина.Переменная)));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьКодСтроныНеИсполнившейОбязательства",	Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗадолженностьПоДС",							Новый ОписаниеТипов("Число"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьЗадолженностьПоДС",					Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ДатаПоследнейОплаты",							Новый ОписаниеТипов("Дата"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьДатаПоследнейОплаты",					Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗадолженностьПоЦБ",							Новый ОписаниеТипов("Число"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьЗадолженностьПоЦБ",					Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ДатаПоследнейПоставки",						Новый ОписаниеТипов("Дата"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьДатаПоследнейПоставки",				Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЦенаФинИнстрПервЧасть",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьЦенаФинИнстрПервЧасть",				Новый ОписаниеТипов("Булево"));
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("СуммаСделкиПервЧасть",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	СделкиСДатамиЗакрытияИсключения.Колонки.Добавить("ЗаменитьСуммаСделкиПервЧасть",				Новый ОписаниеТипов("Булево"));
	
	Если Параметры.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		//СМАО Тикет на продажу RAM-200421/1603-7 от 20.04.2021 14:30:00
		//Заполнеяем только те реквизиты, которые хотим подменить, остальное вычисляется в запросе.
		НоваяСтрока = СделкиСДатамиЗакрытияИсключения.Добавить();
		НоваяСтрока.ДатаНачала									= Дата(2021,11,1);
		НоваяСтрока.Сделка										= Документы.Сделка.ПолучитьСсылку(Новый УникальныйИдентификатор("f9bae655-a439-11eb-80de-005056aec4a3"));
		НоваяСтрока.ВидИнформационногоСообщения					= "FAILURE";
		НоваяСтрока.ЗаменитьВидИнформационногоСообщения			= Истина;
		НоваяСтрока.КодСтроныНеИсполнившейОбязательства 		= "2";
		НоваяСтрока.ЗаменитьКодСтроныНеИсполнившейОбязательства = Истина;
		
		НоваяСтрока = СделкиСДатамиЗакрытияИсключения.Добавить();
		НоваяСтрока.ДатаНачала									= Дата(2022,2,1);
		НоваяСтрока.Сделка										= Документы.Сделка.ПолучитьСсылку(Новый УникальныйИдентификатор("f9bae655-a439-11eb-80de-005056aec4a3"));
		НоваяСтрока.ЦенаФинИнстрПервЧасть						= 1000;
		НоваяСтрока.ЗаменитьЦенаФинИнстрПервЧасть				= Истина;
		НоваяСтрока.СуммаСделкиПервЧасть 						= 43167668.97;
		НоваяСтрока.ЗаменитьСуммаСделкиПервЧасть 				= Истина;
		
	КонецЕсли;	
	
	Возврат СделкиСДатамиЗакрытияИсключения;
	
КонецФункции

Функция ОКУД0420417_ПолучитьОбъемСделок(Параметры, Запрос = Неопределено, ТаблицаСделок = Неопределено) Экспорт
	
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Параметры.Вставить("ВерсияТаксономии",	"4_2");
		Параметры.Вставить("ВариантОтчета",		"ОКУД0420417");
		
		ОКУД0420417_ЗаполнитьПараметрыЗапроса(Параметры, Запрос, Ложь, Ложь);		
		Запрос.Выполнить();
	КонецЕсли;

	Колонки = Новый Массив;
	Колонки.Добавить("Сделка");
	Колонки.Добавить("Кол4_ДатаСделки");
	Колонки.Добавить("Кол41_СуммаСделкиПервЧасть");
	Колонки.Добавить("СуммаСделкиВВалютеУчета");
	Колонки.Добавить("ВалютаСделки");
	Колонки.Добавить("КурсВалютыСделки");
	Колонки.Добавить("СчетДоверительногоУправления");
	Колонки.Добавить("МестоХранения");
	Колонки.Добавить("Кол3_ТипСделки");
	Колонки.Добавить("Кол5_КодДоговора");
	Колонки.Добавить("Кол8_ВидИнфСообщ");
	
	ТаблицаОтчета = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ТаблицаОтчета").ПолучитьДанные().Выгрузить().Скопировать(, СтрСоединить(Колонки, ","));
	
	ТаблицаОтчета.Колонки.Найти("Кол4_ДатаСделки").Имя				= "ДатаСделки";
	ТаблицаОтчета.Колонки.Найти("Кол41_СуммаСделкиПервЧасть").Имя	= "СуммаСделки";
	ТаблицаОтчета.Колонки.Найти("Кол3_ТипСделки").Имя				= "ТипСделки";
	ТаблицаОтчета.Колонки.Найти("Кол5_КодДоговора").Имя				= "КодДоговора";
	ТаблицаОтчета.Колонки.Найти("Кол8_ВидИнфСообщ").Имя				= "ВидИнфСообщ";
	
	ТаблицаСделок = ТаблицаОтчета.Скопировать(Новый Структура("ТипСделки,КодДоговора,ВидИнфСообщ", "AM", "BS","NEW"));
	ТаблицаСделок.Сортировать("МестоХранения,ДатаСделки,СчетДоверительногоУправления,Сделка", Новый СравнениеЗначений);	
	
	ОбъемСделок = ТаблицаСделок.Итог("СуммаСделкиВВалютеУчета");
	
	Возврат ОбъемСделок;
	
КонецФункции

#КонецОбласти

#Область ОКУД0420418

Процедура ОКУД0420418_ВыполнитьЗапросы(Параметры, Запрос) Экспорт
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуКодыКлиентовПоОКАТО(Параметры, Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("ИсключаемыеГоловныеОрганизации"	, ПолучитьИсключаемыеГоловныеОрганизации());
	Запрос.УстановитьПараметр("ДатаНачала"						, Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"					, Параметры.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация"						, Параметры.Организация);

#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.КодПоОКАТО КАК ОКАТО,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРН,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименование,
		|	&ДатаОкончания КАК ОтчетнаяДата
		|ПОМЕСТИТЬ _РеквизитыУК
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|				&ДатаОкончания,
		|				ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)
		|					И НЕ РодительскоеЮридическоеЛицо В (&ИсключаемыеГоловныеОрганизации)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Организации.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Организации.ЮрФизЛицо) = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КвалифицированныеИнвесторыСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	КвалифицированныеИнвесторыСрезПоследних.Является КАК Является
		|ПОМЕСТИТЬ _КвалифицированныеИнвесторы
		|ИЗ
		|	РегистрСведений.КвалифицированныеИнвесторы.СрезПоследних(&ДатаОкончания, ) КАК КвалифицированныеИнвесторыСрезПоследних
		|ГДЕ
		|	КвалифицированныеИнвесторыСрезПоследних.Организация В (&Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	И КвалифицированныеИнвесторыСрезПоследних.Является
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	ВложенныйЗапрос.Активный КАК Активный
		|ПОМЕСТИТЬ _АктивныеКлиенты
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ИСТИНА КАК Активный
		|	ИЗ
		|		Документ.Сделка КАК Сделка
		|	ГДЕ
		|		Сделка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И Сделка.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СделкаРЕПО.СчетДоверительногоУправления,
		|		ИСТИНА
		|	ИЗ
		|		Документ.СделкаРЕПО КАК СделкаРЕПО
		|	ГДЕ
		|		СделкаРЕПО.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И СделкаРЕПО.Проведен
		|		И СделкаРЕПО.ЧастьСделкиРЕПО <> 2
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СделкаСВалютой.СчетДоверительногоУправления,
		|		ИСТИНА
		|	ИЗ
		|		Документ.СделкаСВалютой КАК СделкаСВалютой
		|	ГДЕ
		|		СделкаСВалютой.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И СделкаСВалютой.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РазмещениеКредитногоИнструмента.СчетДоверительногоУправления,
		|		ИСТИНА
		|	ИЗ
		|		Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
		|	ГДЕ
		|		РазмещениеКредитногоИнструмента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И РазмещениеКредитногоИнструмента.Проведен) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|			И (ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует)
		|ГДЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления.Организация = &Организация
		|	И (ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|			ИЛИ ВложенныйЗапрос.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентПо173ФЗ КАК РезидентРФ,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.МеждународнаяФинансоваяОрганизация)
		|			ТОГДА ""998""
		|		ИНАЧЕ
		|			РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации.Код
		|	КОНЕЦ КАК КодСтраныРегистрации,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации КАК СтранаРегистрации,
		|	ЛОЖЬ КАК КлиентУмер
		|ПОМЕСТИТЬ _РеквизитыЮрФизЛиц
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентПо173ФЗ,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство.Код,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаСмерти <> ДАТАВРЕМЯ(1, 1, 1)
		|		И РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаСмерти < &ДатаОкончания
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
		|		ИЛИ КлиентыДоверительногоУправленияСрезПоследних.Клиент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо) КАК ЮрЛицо,
		|	_РеквизитыЮрФизЛиц.РезидентРФ КАК РезидентРФ,
		|	ВЫРАЗИТЬ(КодыКлиентовПоОКАТО.ОКАТО КАК СТРОКА(4)) КАК ОКАТО,
		|	_РеквизитыЮрФизЛиц.КодСтраныРегистрации КАК КодСтраныРегистрации,
		|	_РеквизитыЮрФизЛиц.СтранаРегистрации КАК СтранаРегистрации,
		|	ЕСТЬNULL(_КвалифицированныеИнвесторы.Является, ЛОЖЬ) КАК КвалИнвестор,
		|	ЕСТЬNULL(_АктивныеКлиенты.Активный, ЛОЖЬ) КАК Активный,
		|	ФинансовыеПоказатели.Значение КАК СЧА,
		|	НЕ ЕСТЬNULL(_РеквизитыЮрФизЛиц.КлиентУмер, ЛОЖЬ) КАК УчитыватьВКоличестеКлиентов,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия КАК Стратегия,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Наименование КАК НаименованиеСтратегии,
		|	ВЫБОР
		|		КОГДА ИнвестиционныеПрофилиСрезПоследних.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.ИнтервалДат)
		|			ТОГДА РАЗНОСТЬДАТ(ИнвестиционныеПрофилиСрезПоследних.НачалоПериодаГоризонта, ИнвестиционныеПрофилиСрезПоследних.ОкончаниеПериодаГоризонта, ДЕНЬ)
		|		КОГДА ИнвестиционныеПрофилиСрезПоследних.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора)
		|			ТОГДА РАЗНОСТЬДАТ(СчетаДоверительногоУправления.ДатаЗаключения, ДОБАВИТЬКДАТЕ(СчетаДоверительногоУправления.ДатаЗаключения, ГОД, ИнвестиционныеПрофилиСрезПоследних.ОтносительныйСрокГоризонта), ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(ИнвестиционныеПрофилиСрезПоследних.Период, ДОБАВИТЬКДАТЕ(ИнвестиционныеПрофилиСрезПоследних.Период, ГОД, ИнвестиционныеПрофилиСрезПоследних.ОтносительныйСрокГоризонта), ДЕНЬ)
		|	КОНЕЦ КАК ИнвестиционныйГоризонт,
		|	ИнвестиционныеПрофилиСрезПоследних.Цель.ОжидаемаяДоходностьВПроцентах КАК ОжидаемаяДоходность,
		|	ИнвестиционныеПрофилиСрезПоследних.Цель.ДопустимыйРискВПроцентах КАК УровеньРиска
		|ПОМЕСТИТЬ _ДанныеОтчета
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|			И (ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КвалифицированныеИнвесторы КАК _КвалифицированныеИнвесторы
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КвалифицированныеИнвесторы.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыЮрФизЛиц КАК _РеквизитыЮрФизЛиц
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = _РеквизитыЮрФизЛиц.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО СчетаДоверительногоУправления.Ссылка = ФинансовыеПоказатели.СубъектАналитики
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (КОНЕЦПЕРИОДА(ФинансовыеПоказатели.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ КодыКлиентовПоОКАТО КАК КодыКлиентовПоОКАТО
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = КодыКлиентовПоОКАТО.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АктивныеКлиенты КАК _АктивныеКлиенты
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = _АктивныеКлиенты.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|			И (СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Стандартная)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеПрофили.СрезПоследних(&ДатаОкончания, ) КАК ИнвестиционныеПрофилиСрезПоследних
		|		ПО (СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия = ИнвестиционныеПрофилиСрезПоследних.СубъектУчета)
		|ГДЕ
		|	НЕ СчетаДоверительногоУправления.ПометкаУдаления
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|	И (ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|	И (СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаОкончания
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ЕСТЬNULL(_РеквизитыЮрФизЛиц.КлиентУмер, ЛОЖЬ)
		|				И ФинансовыеПоказатели.Значение ЕСТЬ НЕ NULL )
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.ЮрЛицо
		|			ТОГДА ""YULMember""
		|		ИНАЧЕ ""FLMember""
		|	КОНЕЦ КАК FL_YULAxis,
		|	0 КАК ID_strokiTaxis,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА _ДанныеОтчета.УчитыватьВКоличестеКлиентов
		|				ТОГДА _ДанныеОтчета.Клиент
		|		КОНЕЦ) КАК KolichestvoKlientov,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА _ДанныеОтчета.ДатаЗаключения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|				ТОГДА _ДанныеОтчета.Клиент
		|		КОНЕЦ) КАК KolichestvoKlientovZaOtchetnyjPeriod,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.РезидентРФ
		|				И _ДанныеОтчета.ОКАТО <> """"
		|			ТОГДА ""OKATO"" + _ДанныеОтчета.ОКАТО
		|		КОГДА НЕ _ДанныеОтчета.РезидентРФ
		|			ТОГДА ""Strana_"" + _ДанныеОтчета.КодСтраныРегистрации
		|	КОНЕЦ КАК Kod_OKATO_KodOKSMAxis,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.КвалИнвестор
		|			ТОГДА ""KvalificzirovannyjInvestorMember""
		|		ИНАЧЕ ""NekvalificzirovannyjInvestor_Member""
		|	КОНЕЦ КАК Kvalificzirovannost_investoraAxis,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.РезидентРФ
		|			ТОГДА ""RezidentyMember""
		|		ИНАЧЕ ""NerezidentyMember""
		|	КОНЕЦ КАК Rezident_Nerezident_Axis,
		|	СУММА(_ДанныеОтчета.СЧА) КАК SummaInvestPortf,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.Активный
		|			ТОГДА ""AktivnyjMember""
		|		ИНАЧЕ ""NeaktivnyjMember""
		|	КОНЕЦ КАК Tip_i_status_klienta2Axis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis
		|ПОМЕСТИТЬ SR_0420418_R2_1
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеОтчета.ЮрЛицо,
		|	_ДанныеОтчета.РезидентРФ,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.РезидентРФ
		|				И _ДанныеОтчета.ОКАТО <> """"
		|			ТОГДА ""OKATO"" + _ДанныеОтчета.ОКАТО
		|		КОГДА НЕ _ДанныеОтчета.РезидентРФ
		|			ТОГДА ""Strana_"" + _ДанныеОтчета.КодСтраныРегистрации
		|	КОНЕЦ,
		|	_ДанныеОтчета.КвалИнвестор,
		|	_ДанныеОтчета.Активный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеОтчета.ОжидаемаяДоходность КАК Doxodnost_Proc_godovyx_Inf_ob_inv_strateg,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.ЮрЛицо
		|			ТОГДА ""YULMember""
		|		ИНАЧЕ ""FLMember""
		|	КОНЕЦ КАК FL_YULAxis,
		|	_ДанныеОтчета.Стратегия КАК ID_strategTaxis,
		|	МАКСИМУМ(_ДанныеОтчета.ИнвестиционныйГоризонт) КАК Investiczionnyj_gorizont_Inf_ob_inv_strateg,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА _ДанныеОтчета.УчитыватьВКоличестеКлиентов
		|				ТОГДА _ДанныеОтчета.Клиент
		|		КОНЕЦ) КАК KolichestvoKlientov,
		|	_ДанныеОтчета.НаименованиеСтратегии КАК Naim_strategii_Inf_ob_inv_strateg,
		|	_ДанныеОтчета.УровеньРиска КАК Risk_Proc_godovyx_Inf_ob_inv_strateg,
		|	СУММА(_ДанныеОтчета.СЧА) КАК SummaInvestPortf_StandStrateg,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis
		|ПОМЕСТИТЬ SR_0420418_R2_2
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|ГДЕ
		|	_ДанныеОтчета.Стратегия ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеОтчета.ОжидаемаяДоходность,
		|	_ДанныеОтчета.ЮрЛицо,
		|	_ДанныеОтчета.Стратегия,
		|	_ДанныеОтчета.НаименованиеСтратегии,
		|	_ДанныеОтчета.УровеньРиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеОтчета.Клиент КАК Клиент,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.УчитыватьВКоличестеКлиентов
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоКлиентов,
		|	_ДанныеОтчета.ЮрЛицо КАК ЮрЛицо,
		|	_ДанныеОтчета.РезидентРФ КАК РезидентРФ,
		|	_ДанныеОтчета.Активный КАК Активный,
		|	_ДанныеОтчета.КвалИнвестор КАК КвалИнвестор,
		|	_ДанныеОтчета.ОКАТО КАК ОКАТО,
		|	_ДанныеОтчета.СтранаРегистрации КАК СтранаРегистрации,
		|	СУММА(_ДанныеОтчета.СЧА) КАК СЧА
		|ПОМЕСТИТЬ _Расшифровка
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеОтчета.Клиент,
		|	_ДанныеОтчета.УчитыватьВКоличестеКлиентов,
		|	_ДанныеОтчета.ЮрЛицо,
		|	_ДанныеОтчета.РезидентРФ,
		|	_ДанныеОтчета.Активный,
		|	_ДанныеОтчета.КвалИнвестор,
		|	_ДанныеОтчета.ОКАТО,
		|	_ДанныеОтчета.СтранаРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеОтчета.Стратегия КАК Стратегия,
		|	_ДанныеОтчета.НаименованиеСтратегии КАК НаименованиеСтратегии,
		|	_ДанныеОтчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДанныеОтчета.УчитыватьВКоличестеКлиентов КАК УчитыватьВКоличестеКлиентов,
		|	_ДанныеОтчета.СЧА КАК СЧА,
		|	ВложенныйЗапрос.СЧА КАК СЧАСтратегии
		|ПОМЕСТИТЬ РасшифровкаСтратегии
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДанныеОтчета.Стратегия КАК Стратегия,
		|			СУММА(_ДанныеОтчета.СЧА) КАК СЧА
		|		ИЗ
		|			_ДанныеОтчета КАК _ДанныеОтчета
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДанныеОтчета.Стратегия) КАК ВложенныйЗапрос
		|		ПО _ДанныеОтчета.Стратегия = ВложенныйЗапрос.Стратегия
		|ГДЕ
		|	_ДанныеОтчета.Стратегия ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Стратегии.Стратегия КАК Стратегия,
		|	Стратегии.МинимальныйИнвестиционныйГоризонт КАК МинимальныйИнвестиционныйГоризонт,
		|	Стратегии.МаксимальныйИнвестиционныйГоризонт КАК МаксимальныйИнвестиционныйГоризонт,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	Последнее29Февраля.Дата КАК Последнее29Февраля
		|ПОМЕСТИТЬ _ПояснительнаяЗаписка
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДанныеОтчета.Стратегия КАК Стратегия,
		|		МИНИМУМ(_ДанныеОтчета.ИнвестиционныйГоризонт) КАК МинимальныйИнвестиционныйГоризонт,
		|		МАКСИМУМ(_ДанныеОтчета.ИнвестиционныйГоризонт) КАК МаксимальныйИнвестиционныйГоризонт,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ДанныеОтчета.ИнвестиционныйГоризонт) КАК РазличныеИнвестиционныеГоризонты
		|	ИЗ
		|		_ДанныеОтчета КАК _ДанныеОтчета
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДанныеОтчета.Стратегия
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ДанныеОтчета.ИнвестиционныйГоризонт) > 1) КАК Стратегии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (Организации.Ссылка = &Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО (Организации.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо),
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ДанныеКалендаря.Дата) КАК Дата
		|	ИЗ
		|		РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|	ГДЕ
		|		ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|		И ДЕНЬ(ДанныеКалендаря.Дата) = 29
		|		И МЕСЯЦ(ДанныеКалендаря.Дата) = 2
		|		И ДанныеКалендаря.Дата < &ДатаОкончания) КАК Последнее29Февраля
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеОтчета.ЮрЛицо КАК ЮрЛицо,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА _ДанныеОтчета.УчитыватьВКоличестеКлиентов
		|				ТОГДА _ДанныеОтчета.Клиент
		|		КОНЕЦ) КАК КоличествоКлиентов,
		|	_ДанныеОтчета.Активный КАК Активный,
		|	_ДанныеОтчета.КвалИнвестор КАК КвалИнвестор,
		|	_ДанныеОтчета.РезидентРФ КАК РезидентРФ,
		|	СУММА(_ДанныеОтчета.СЧА) КАК Сумма
		|ПОМЕСТИТЬ _ПечатнаяФорма21
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеОтчета.ЮрЛицо,
		|	_ДанныеОтчета.РезидентРФ,
		|	_ДанныеОтчета.КвалИнвестор,
		|	_ДанныеОтчета.Активный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеОтчета.НаименованиеСтратегии КАК НаименованиеСтратегии,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА _ДанныеОтчета.УчитыватьВКоличестеКлиентов
		|				ТОГДА _ДанныеОтчета.Клиент
		|		КОНЕЦ) КАК КоличествоКлиентовФЛ,
		|	СУММА(_ДанныеОтчета.СЧА) КАК СтоимостьПортфелейФЛ,
		|	""#"" КАК КоличествоКлиентовЮЛ,
		|	""#"" КАК СтоимостьПортфелейЮЛ,
		|	МАКСИМУМ(_ДанныеОтчета.ИнвестиционныйГоризонт) КАК ИнвестиционныйГоризонт,
		|	_ДанныеОтчета.ОжидаемаяДоходность КАК ОжидаемаяДоходность,
		|	_ДанныеОтчета.УровеньРиска КАК УровеньРиска
		|ПОМЕСТИТЬ _ПечатнаяФорма22
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|ГДЕ
		|	_ДанныеОтчета.Стратегия ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеОтчета.НаименованиеСтратегии,
		|	_ДанныеОтчета.ОжидаемаяДоходность,
		|	_ДанныеОтчета.УровеньРиска";
#КонецОбласти
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ОКУД0420418_ПолучитьКоличествоКлиентов(Параметры, Запрос) Экспорт
	
	ОКУД0420418_ВыполнитьЗапросы(Параметры, Запрос);
	Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("SR_0420418_R2_1").ПолучитьДанные().Выгрузить().Итог("KolichestvoKlientov");
	
КонецФункции

Функция ОКУД0420418_ПолучитьСтоимостьПортфелей(Параметры, Запрос) Экспорт
	
	ОКУД0420418_ВыполнитьЗапросы(Параметры, Запрос);
	Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("SR_0420418_R2_1").ПолучитьДанные().Выгрузить().Итог("SummaInvestPortf");
	
КонецФункции

#КонецОбласти

#Область ОКУД0420431
Функция ВерсияТаксономииОтчетаПоДате(ИмяПакета, ДатаОтчета, Организация) Экспорт
	
	ОтчетностьЦБ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетностьЦБ");

	ОтчетностьЦБ.Организация = Организация;
	ОтчетностьЦБ.Период		 = ДатаОтчета;
	
	ТочкиВхода = ОтчетностьЦБ.ПолучитьТочкиВхода();
	
	ПараметрыПоиска = Новый Структура("ИмяПакета, Спецдеп", ИмяПакета, Ложь);
	НайденныеСтроки = ТочкиВхода.НайтиСтроки(ПараметрыПоиска);
	
	ВерсияТаксономии = "";
	
	Для Каждого СтрокаТочкиВхода Из НайденныеСтроки Цикл
		Если СтрокаТочкиВхода.Период <= ДатаОтчета Тогда
			Если ЗначениеЗаполнено(СтрокаТочкиВхода.ВерсияТаксономии) Тогда
				ВерсияТаксономии = СтрокаТочкиВхода.ВерсияТаксономии;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВерсияТаксономии;

КонецФункции

Процедура ОКУД0420431_ЗаполнитьПараметрДляПоказаВыводаАктивовПоСчетуДУ(Запрос)
	
	СчетаДУДляПоказаИзъятия = Новый ТаблицаЗначений;
	СчетаДУДляПоказаИзъятия.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	СчетаДУДляПоказаИзъятия.Колонки.Добавить("ДоходностьПоСтратегии",        Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 2)));
	
	Если Запрос.Параметры.ДатаОкончания = Дата(2025, 6, 30, 23, 59, 59) Тогда
		
		НоваяСтрока = СчетаДУДляПоказаИзъятия.Добавить();
		НоваяСтрока.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СМАО");
		НоваяСтрока.ДоходностьПоСтратегии        = 19.02;
		
	КонецЕсли;	
	Запрос.УстановитьПараметр("СДУДляИзъятия", СчетаДУДляПоказаИзъятия);
	
КонецПроцедуры

Процедура ОКУД0420431_ВыполнитьЗапросы(Параметры, Запрос, Отказ) Экспорт
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(
		Запрос.МенеджерВременныхТаблиц,
		Новый СтандартныйПериод(Параметры.Период.ДатаНачала - 86400, Параметры.Период.ДатаОкончания + 86400), //захватим день до и день после, чтобы понимать были ли они клиентами вне отчётного периода
		Новый Структура("Организация, ВидДеятельности", Параметры.Организация, Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами),
		"_СчетаДоверительногоУправления_С_Датами");

	РаботаСОтчетами.ПоместитьДатыПолученияДокументовОСмертиВМенеджерВременныхТаблиц(Запрос, Параметры.Период.ДатаОкончания, Параметры.Организация, , "_ДатыПолученияДокументовОСмерти");
		
	ЗаполнитьТаблицуКодыКлиентовПоОКАТО(Параметры, Запрос.МенеджерВременныхТаблиц);

	Запрос.УстановитьПараметр("ДатаНачала",				Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",			Параметры.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ГраницаОкончания",		Новый Граница(Параметры.Период.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",			Параметры.Организация);
	Запрос.УстановитьПараметр("НКО_НКЦ",				ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));		
	Запрос.УстановитьПараметр("ЭтоРПИ",					Параметры.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));		
	
	Запрос.УстановитьПараметр("УчитываласьДатаОкончанияИнтервалаПриРасчетеГоризонта", Параметры.Период.ДатаОкончания >= Дата(2024, 6, 30));
	
	
	Если НЕ Запрос.Параметры.Свойство("ЕстьРаздел_SR_0420459") Тогда
		Запрос.УстановитьПараметр("ЕстьРаздел_SR_0420459", Ложь);
	КонецЕсли;
	
	Если НЕ Запрос.Параметры.Свойство("РазмерыСчетовКлиентов") Тогда
		
		РазмерыСчетовКлиентов = Новый ТаблицаЗначений;
		РазмерыСчетовКлиентов.Колонки.Добавить("Идентификатор",	 Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
		РазмерыСчетовКлиентов.Колонки.Добавить("Наименование",	 Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
		РазмерыСчетовКлиентов.Колонки.Добавить("НижняяГраница",	 Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 2)));
		РазмерыСчетовКлиентов.Колонки.Добавить("ВерхняяГраница", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 2)));
		
		Запрос.УстановитьПараметр("РазмерыСчетовКлиентов", РазмерыСчетовКлиентов);
		
	КонецЕсли;	
		
	РынкиЦенныхБумагОтработанныеВОтчете = Новый Массив;
	РынкиЦенныхБумагОтработанныеВОтчете.Добавить(Перечисления.РынкиЦенныхБумаг.Акции);
	РынкиЦенныхБумагОтработанныеВОтчете.Добавить(Перечисления.РынкиЦенныхБумаг.Облигации);
	РынкиЦенныхБумагОтработанныеВОтчете.Добавить(Перечисления.РынкиЦенныхБумаг.Векселя);
	РынкиЦенныхБумагОтработанныеВОтчете.Добавить(Перечисления.РынкиЦенныхБумаг.Паи);
	
	РынкиЦенныхБумагПФИ = Новый Массив;
	РынкиЦенныхБумагПФИ.Добавить(Перечисления.РынкиЦенныхБумаг.Опционы);
	РынкиЦенныхБумагПФИ.Добавить(Перечисления.РынкиЦенныхБумаг.Фьючерсы);
	
	Запрос.УстановитьПараметр("РынкиЦенныхБумагОтработанныеВОтчете", РынкиЦенныхБумагОтработанныеВОтчете);
	Запрос.УстановитьПараметр("РынкиЦенныхБумагПФИ", РынкиЦенныхБумагПФИ);
	
	Если Не Запрос.Параметры.Свойство("ВерсияТаксономии") Тогда
		
		ВерсияТаксономии = ВерсияТаксономииОтчетаПоДате("ОКУД0420431", Запрос.Параметры.ДатаОкончания, Параметры.Организация); 
		
		Запрос.УстановитьПараметр("ВерсияТаксономии", ВерсияТаксономии); 
		
	КонецЕсли;	

	ОКУД0420431_ЗаполнитьПараметрДляПоказаВыводаАктивовПоСчетуДУ(Запрос);
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СДУДляИзъятия.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СДУДляИзъятия.ДоходностьПоСтратегии КАК ДоходностьПоСтратегии
		|ПОМЕСТИТЬ _СДУПоказатьИзъятиеСЧАПредварительная
		|ИЗ
		|	&СДУДляИзъятия КАК СДУДляИзъятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_СДУПоказатьИзъятиеСЧАПредварительная.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СДУПоказатьИзъятиеСЧАПредварительная.ДоходностьПоСтратегии КАК ДоходностьПоСтратегии
		|ПОМЕСТИТЬ _СДУПоказатьИзъятиеСЧА
		|ИЗ
		|	_СДУПоказатьИзъятиеСЧАПредварительная КАК _СДУПоказатьИзъятиеСЧАПредварительная
		|ГДЕ
		|	_СДУПоказатьИзъятиеСЧАПредварительная.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления_С_Датами.Ссылка
		|			ИЗ
		|				_СчетаДоверительногоУправления_С_Датами КАК _СчетаДоверительногоУправления_С_Датами)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЛицензииДоговоровДоверительногоУправления.Период КАК Период,
		|	ЛицензииДоговоровДоверительногоУправления.Лицензия КАК Лицензия
		|ПОМЕСТИТЬ _ДатыОкончанияЛицензииДУ
		|ИЗ
		|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|ГДЕ
		|	НЕ ЛицензииДоговоровДоверительногоУправления.Действует
		|	И ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|	И ЛицензииДоговоровДоверительногоУправления.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления_С_Датами.Ссылка
		|			ИЗ
		|				_СчетаДоверительногоУправления_С_Датами КАК _СчетаДоверительногоУправления_С_Датами)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыОкончанияЛицензии.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(ФинансовыеПоказателиСЧА.Период) КАК Период
		|ПОМЕСТИТЬ _ДатыСЧАДляИзъятия
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыОкончанияЛицензииДУ КАК _ДатыОкончанияЛицензии
		|		ПО ФинансовыеПоказателиСЧА.СубъектАналитики = _ДатыОкончанияЛицензии.СчетДоверительногоУправления
		|			И (ФинансовыеПоказателиСЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И ФинансовыеПоказателиСЧА.Период < _ДатыОкончанияЛицензии.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыОкончанияЛицензии.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказатьИзъятия.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ПоказатьИзъятия.ИзъятиеЦБ) КАК ИзъятиеЦБ,
		|	СУММА(ПоказатьИзъятия.ИзъятиеДС) КАК ИзъятиеДС,
		|	СУММА(ПоказатьИзъятия.ИзъятиеПрочие) КАК ИзъятиеПрочие
		|ПОМЕСТИТЬ _СДУДляИзъятияАктивов
		|ИЗ
		|	(ВЫБРАТЬ
		|		СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК ИзъятиеЦБ,
		|		0 КАК ИзъятиеДС,
		|		0 КАК ИзъятиеПрочие
		|	ИЗ
		|		РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыСЧАДляИзъятия КАК _ДатыСЧАДляИзъятия
		|			ПО (_ДатыСЧАДляИзъятия.Период = СтоимостьПереоценки.Период)
		|				И (_ДатыСЧАДляИзъятия.СчетДоверительногоУправления = СтоимостьПереоценки.СчетДоверительногоУправления)
		|	ГДЕ
		|		СтоимостьПереоценки.Активность
		|		И СтоимостьПереоценки.Организация = СтоимостьПереоценки.Организация
		|		И СтоимостьПереоценки.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|		И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|		И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|		И СтоимостьПереоценки.Рынок В(&РынкиЦенныхБумагОтработанныеВОтчете)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СтоимостьПереоценки.СчетДоверительногоУправления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления,
		|		0,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БрокерскиеКомпании КАК БрокерскиеКомпании
		|			ПО СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = БрокерскиеКомпании.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыСЧАДляИзъятия КАК _ДатыСЧАДляИзъятия
		|			ПО (_ДатыСЧАДляИзъятия.Период = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период)
		|				И (_ДатыСЧАДляИзъятия.СчетДоверительногоУправления = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления)
		|	ГДЕ
		|		СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность
		|		И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|		И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|		И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|					И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Справочник.БрокерскиеКомпании
		|						ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))))) КАК ПоказатьИзъятия
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказатьИзъятия.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	СчетаДоверительногоУправления.Наименование КАК Наименование,
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	СчетаДоверительногоУправления.Стратегия КАК Стратегия,
		|	СчетаДоверительногоУправления.КоличествоЛицензий КАК КоличествоЛицензий,
		|	&Организация КАК Организация,
		|	ФинансовыеПоказателиСЧА.Значение КАК СЧА,
		|	ФинансовыеПоказателиСЧА.Период КАК ДатаСЧА,
		|	ФинансовыеПоказателиСЧА.Регистратор КАК Документ_РСА
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_СчетаДоверительногоУправления_С_Датами.Ссылка КАК Ссылка,
		|		_СчетаДоверительногоУправления_С_Датами.Ссылка.НомерДоговора КАК НомерДоговора,
		|		_СчетаДоверительногоУправления_С_Датами.Ссылка.ДатаЗаключения КАК ДатаЗаключения,
		|		_СчетаДоверительногоУправления_С_Датами.Ссылка.ДатаРасторжения КАК ДатаРасторжения,
		|		_СчетаДоверительногоУправления_С_Датами.Ссылка.Наименование КАК Наименование,
		|		_СчетаДоверительногоУправления_С_Датами.Ссылка.КодСчета КАК КодСчета,
		|		_СчетаДоверительногоУправления_С_Датами.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|		КлиентыДУ.Клиент КАК Клиент,
		|		Стратегии.Стратегия КАК Стратегия,
		|		_СчетаДоверительногоУправления_С_Датами.КоличествоЛицензий КАК КоличествоЛицензий
		|	ИЗ
		|		_СчетаДоверительногоУправления_С_Датами КАК _СчетаДоверительногоУправления_С_Датами
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДУ
		|			ПО _СчетаДоверительногоУправления_С_Датами.Ссылка = КлиентыДУ.СчетДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК Стратегии
		|			ПО _СчетаДоверительногоУправления_С_Датами.Ссылка = Стратегии.СчетДоверительногоУправления
		|	ГДЕ
		|		_СчетаДоверительногоУправления_С_Датами.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|		И _СчетаДоверительногоУправления_С_Датами.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФормированияСЧА.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК НастройкиФормированияСЧАСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = НастройкиФормированияСЧАСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиСЧА
		|		ПО СчетаДоверительногоУправления.Ссылка = ФинансовыеПоказателиСЧА.СубъектАналитики
		|			И (ФинансовыеПоказателиСЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ФинансовыеПоказателиСЧА.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления_С_Датами.Клиент КАК Клиент,
		|	МИНИМУМ(_СчетаДоверительногоУправления_С_Датами.Дата) < &ДатаНачала КАК НаНачало,
		|	МАКСИМУМ(_СчетаДоверительногоУправления_С_Датами.Дата) > &ДатаОкончания КАК НаКонец
		|ПОМЕСТИТЬ _КлиентДоИПослеОтчетногоПериода
		|ИЗ
		|	_СчетаДоверительногоУправления_С_Датами КАК _СчетаДоверительногоУправления_С_Датами
		|ГДЕ
		|	_СчетаДоверительногоУправления_С_Датами.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления_С_Датами.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КвалифицированныеИнвесторыСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	МАКСИМУМ(КвалифицированныеИнвесторыСрезПоследних.Является) КАК Является
		|ПОМЕСТИТЬ _КвалифицированныеИнвесторы
		|ИЗ
		|	РегистрСведений.КвалифицированныеИнвесторы.СрезПоследних(&ДатаОкончания, ) КАК КвалифицированныеИнвесторыСрезПоследних
		|ГДЕ
		|	КвалифицированныеИнвесторыСрезПоследних.Организация В (&Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	И КвалифицированныеИнвесторыСрезПоследних.Является
		|
		|СГРУППИРОВАТЬ ПО
		|	КвалифицированныеИнвесторыСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентПо173ФЗ КАК РезидентРФ,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.МеждународнаяФинансоваяОрганизация)
		|			ТОГДА ""998""
		|		КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.МеждународнаяКомпания
		|				И &ВерсияТаксономии >= ""7_1""
		|			ТОГДА ВЫБОР
		|					КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.СпособСозданияМеждународнойКомпании = ЗНАЧЕНИЕ(Перечисление.СпособыСозданияМеждународнойКомпании.Редомициляция)
		|						ТОГДА ""996""
		|					ИНАЧЕ ""995""
		|				КОНЕЦ
		|		ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации.Код
		|	КОНЕЦ КАК КодСтраныРегистрации,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации КАК СтранаРегистрации,
		|	ЛОЖЬ КАК КлиентУмер,
		|	NULL КАК ДатаПолученияДокументовОСмерти
		|ПОМЕСТИТЬ _РеквизитыКлиентов
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентПо173ФЗ,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство.Код,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаСмерти <> ДАТАВРЕМЯ(1, 1, 1)
		|		И РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаСмерти < &ДатаОкончания,
		|	_ДатыПолученияДокументовОСмерти.Дата
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПолученияДокументовОСмерти КАК _ДатыПолученияДокументовОСмерти
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = _ДатыПолученияДокументовОСмерти.ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	МАКСИМУМ(Сделка.Ссылка ЕСТЬ НЕ NULL 
		|			ИЛИ СделкаРЕПО.Ссылка ЕСТЬ НЕ NULL 
		|			ИЛИ СделкаСВалютой.Ссылка ЕСТЬ НЕ NULL 
		|			ИЛИ СделкаСПФИ.Ссылка ЕСТЬ НЕ NULL 
		|			ИЛИ РазмещениеКредитногоИнструмента.Ссылка ЕСТЬ НЕ NULL ) КАК Активный
		|ПОМЕСТИТЬ _АктивныеКлиенты
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _СчетаДоверительногоУправления.Ссылка = Сделка.СчетДоверительногоУправления
		|			И (Сделка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (Сделка.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО _СчетаДоверительногоУправления.Ссылка = СделкаРЕПО.СчетДоверительногоУправления
		|			И (Сделка.Ссылка ЕСТЬ NULL)
		|			И (СделкаРЕПО.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (СделкаРЕПО.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО _СчетаДоверительногоУправления.Ссылка = СделкаСВалютой.СчетДоверительногоУправления
		|			И (Сделка.Ссылка ЕСТЬ NULL)
		|			И (СделкаРЕПО.Ссылка ЕСТЬ NULL)
		|			И (СделкаСВалютой.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (СделкаСВалютой.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
		|		ПО _СчетаДоверительногоУправления.Ссылка = РазмещениеКредитногоИнструмента.СчетДоверительногоУправления
		|			И (Сделка.Ссылка ЕСТЬ NULL)
		|			И (СделкаРЕПО.Ссылка ЕСТЬ NULL)
		|			И (СделкаСВалютой.Ссылка ЕСТЬ NULL)
		|			И (РазмещениеКредитногоИнструмента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (РазмещениеКредитногоИнструмента.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСПФИ КАК СделкаСПФИ
		|		ПО _СчетаДоверительногоУправления.Ссылка = СделкаСПФИ.СчетДоверительногоУправления
		|			И (Сделка.Ссылка ЕСТЬ NULL)
		|			И (СделкаРЕПО.Ссылка ЕСТЬ NULL)
		|			И (СделкаСВалютой.Ссылка ЕСТЬ NULL)
		|			И (РазмещениеКредитногоИнструмента.Ссылка ЕСТЬ NULL)
		|			И (СделкаСПФИ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (СделкаСПФИ.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыДоговоровДоверительногоУправления.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица)
		|			ТОГДА ""Физическое лицо""
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ТОГДА ""Иное юридическое лицо""
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
		|			ТОГДА ""СК""
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ""НПФ""
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица)
		|			ТОГДА ""FizicheskoeliczoMEMBER""
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ТОГДА ""InoeYuLMember""
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|				ИЛИ ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
		|			ТОГДА ""SKMember""
		|		КОГДА ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ""NPFMember""
		|	КОНЕЦ КАК Идентификатор,
		|	ВидыДоговоровДоверительногоУправления.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет) КАК ЭтоИИС
		|ПОМЕСТИТЬ _КонтрагентыПоДоговору
		|ИЗ
		|	Перечисление.ВидыДоговоровДоверительногоУправления КАК ВидыДоговоровДоверительногоУправления
		|ГДЕ
		|	ВидыДоговоровДоверительногоУправления.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РазмерыСчетовКлиентов.Идентификатор КАК Идентификатор,
		|	РазмерыСчетовКлиентов.Наименование КАК Наименование,
		|	РазмерыСчетовКлиентов.НижняяГраница КАК НижняяГраница,
		|	РазмерыСчетовКлиентов.ВерхняяГраница КАК ВерхняяГраница
		|ПОМЕСТИТЬ _РазмерыСчетовКлиентов
		|ИЗ
		|	&РазмерыСчетовКлиентов КАК РазмерыСчетовКлиентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер.ЮрФизЛицо КАК БрокерКонтрагент,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания
		|ПОМЕСТИТЬ _ДоговорыСБрокерами
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК Период,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор КАК Регистратор,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива КАК ВидАктива,
		|	ВЫБОР ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Расход,
		|	ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|					ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоступлениеДС,
		|	ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоступлениеЦБ,
		|	ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоступлениеПрочие,
		|	ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|				И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|					ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИзъятиеДС,
		|	ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИзъятиеЦБ,
		|	ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
		|			ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИзъятиеПрочие
		|ПОМЕСТИТЬ _ВводыВыводыПодробно
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыСЧАДляИзъятия КАК _ДатыСЧАДляИзъятия
		|		ПО ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления = _ДатыСЧАДляИзъятия.СчетДоверительногоУправления
		|ГДЕ
		|	ВЫБОР
		|			КОГДА _ДатыСЧАДляИзъятия.Период ЕСТЬ НЕ NULL 
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.Период <= _ДатыСЧАДляИзъятия.Период
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВводыВыводыПодробно.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(_ВводыВыводыПодробно.ПоступлениеДС) КАК ПоступлениеДС,
		|	СУММА(_ВводыВыводыПодробно.ПоступлениеЦБ) КАК ПоступлениеЦБ,
		|	СУММА(_ВводыВыводыПодробно.ПоступлениеПрочие) КАК ПоступлениеПрочие,
		|	СУММА(_ВводыВыводыПодробно.ИзъятиеДС) КАК ИзъятиеДС,
		|	СУММА(_ВводыВыводыПодробно.ИзъятиеЦБ) КАК ИзъятиеЦБ,
		|	СУММА(_ВводыВыводыПодробно.ИзъятиеПрочие) КАК ИзъятиеПрочие
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВводыВыводыПодробно.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ВводыВыводыПодробно.ПоступлениеДС КАК ПоступлениеДС,
		|		_ВводыВыводыПодробно.ПоступлениеЦБ КАК ПоступлениеЦБ,
		|		_ВводыВыводыПодробно.ПоступлениеПрочие КАК ПоступлениеПрочие,
		|		_ВводыВыводыПодробно.ИзъятиеДС КАК ИзъятиеДС,
		|		_ВводыВыводыПодробно.ИзъятиеЦБ КАК ИзъятиеЦБ,
		|		_ВводыВыводыПодробно.ИзъятиеПрочие КАК ИзъятиеПрочие
		|	ИЗ
		|		_ВводыВыводыПодробно КАК _ВводыВыводыПодробно
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СДУДляИзъятияАктивов.СчетДоверительногоУправления,
		|		0,
		|		0,
		|		0,
		|		СДУДляИзъятияАктивов.ИзъятиеДС,
		|		СДУДляИзъятияАктивов.ИзъятиеЦБ,
		|		СДУДляИзъятияАктивов.ИзъятиеПрочие
		|	ИЗ
		|		_СДУДляИзъятияАктивов КАК СДУДляИзъятияАктивов) КАК _ВводыВыводыПодробно
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВводыВыводыПодробно.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(БрокерскиеКомпании.ЮрФизЛицо, БанковскиеСчета.Банк.ЮрФизЛицо) КАК БанкБрокер,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК СокращенноеНаименование,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта.Код КАК ВалютаКод,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БрокерскиеКомпании.Ссылка ЕСТЬ НЕ NULL 
		|			ТОГДА ""Деньги у брокера""
		|		ИНАЧЕ ""Деньги на р/счете""
		|	КОНЕЦ КАК ВидАктиваРасшифровки,
		|	""[СокращенноеНаименование]"" КАК ШаблонРасшифровки
		|ПОМЕСТИТЬ _ДенежныеСредства
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|					И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Справочник.БрокерскиеКомпании)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = БанковскиеСчета.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БрокерскиеКомпании КАК БрокерскиеКомпании
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = БрокерскиеКомпании.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ЕСТЬNULL(БрокерскиеКомпании.ЮрФизЛицо, БанковскиеСчета.Банк.ЮрФизЛицо) = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	НЕ _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо КАК Банк,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК СокращенноеНаименование,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта.Код КАК ВалютаКод,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаВВалютеУчета,
		|	""Депозитный вклад"" КАК ВидАктиваРасшифровки,
		|	""[СокращенноеНаименование]"" КАК ШаблонРасшифровки
		|ПОМЕСТИТЬ _Депозиты
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = ДепозитныеВклады.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	НЕ _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТИПЗНАЧЕНИЯ(СтоимостьПереоценки.ЦеннаяБумага) КАК ТипЦеннойБумаги,
		|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
		|	"""" КАК Валюта,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК СуммаВВалютеУчета,
		|	""Ценные бумаги"" КАК ВидАктиваРасшифровки,
		|	""[ТипЦеннойБумаги], [ЦеннаяБумага], кол-во: [Количество]"" КАК ШаблонРасшифровки
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ПО (СтоимостьПереоценки.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьПереоценки.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьПереоценки.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьПереоценки.СчетДоверительногоУправления
		|			И (СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки))
		|			И (СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|			И (СтоимостьПереоценки.Рынок В (&РынкиЦенныхБумагОтработанныеВОтчете))
		|ГДЕ
		|	НЕ _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СделкаСПФИ.Ссылка КАК СделкаСПФИ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаСПФИ.СтавкаИсходящихПлатежей) = ТИП(Справочник.БазовыеСтавкиОблигаций)
		|			ТОГДА ""S_Sprodazhamember""
		|		ИНАЧЕ ""PokupkaMember""
		|	КОНЕЦ КАК НаправлениеСделки
		|ПОМЕСТИТЬ _СделкиСПФИ
		|ИЗ
		|	Документ.СделкаСПФИ КАК СделкаСПФИ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО (_СчетаДоверительногоУправления.Ссылка = СделкаСПФИ.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделкеСПФИ КАК ИсполнениеОбязательствПоСделкеСПФИ
		|		ПО (ИсполнениеОбязательствПоСделкеСПФИ.Основание = СделкаСПФИ.Ссылка)
		|			И (ИсполнениеОбязательствПоСделкеСПФИ.ЗавершениеСделки)
		|			И (ИсполнениеОбязательствПоСделкеСПФИ.Проведен)
		|			И (НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделкеСПФИ.Дата, ДЕНЬ) <= &ДатаНачала)
		|ГДЕ
		|	СделкаСПФИ.Проведен
		|	И СделкаСПФИ.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(СделкаСПФИ.Дата, ДЕНЬ) <= &ДатаОкончания
		|	И ИсполнениеОбязательствПоСделкеСПФИ.Ссылка ЕСТЬ NULL
		|	И НЕ _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	Контрагенты.Ссылка КАК Контрагент,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК СокращенноеНаименование,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта.Код КАК ВалютаКод,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаВВалютеУчета,
		|	СделкаРЕПО.Ссылка КАК СделкаРЕПО,
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ""прямое""
		|		ИНАЧЕ ""обратное""
		|	КОНЕЦ КАК ВидСделкиРЕПО,
		|	ВЫБОР СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|			ТОГДА ""ДЗ по сделкам РЕПО""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|			ТОГДА ""КЗ по сделкам РЕПО""
		|	КОНЕЦ КАК ВидАктиваРасшифровки,
		|	""Контрагент: [Контрагент], Сделка РЕПО: [СделкаРЕПО]"" КАК ШаблонРасшифровки,
		|	ВЫБОР
		|		КОГДА &ВерсияТаксономии >= ""6_1""
		|			ТОГДА СделкаРЕПОЦенныеБумаги.ЦеннаяБумага
		|	КОНЕЦ КАК СубъектАналитики,
		|	СделкаРЕПОЦенныеБумаги.Количество КАК Количество
		|ПОМЕСТИТЬ _ЗадолженностьСделкиРЕПО
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)))
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|			ПО СделкаРЕПО.Ссылка = СделкаРЕПОЦенныеБумаги.Ссылка
		|				И (СделкаРЕПОЦенныеБумаги.НомерСтроки = 1)
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание = СделкаРЕПО.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК Контрагенты
		|		ПО (ВЫБОР
		|				КОГДА НЕ СделкаРЕПО.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|					ТОГДА СделкаРЕПО.Контрагент
		|				КОГДА &ЭтоРПИ = ЛОЖЬ
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом
		|					ТОГДА &НКО_НКЦ
		|				КОГДА СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|						ИЛИ НЕ СделкаРЕПО.СделкаСЦентральнымКонтрагентом
		|					ТОГДА СделкаРЕПО.Брокер.ЮрФизЛицо
		|				ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
		|			КОНЕЦ = Контрагенты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (Контрагенты.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	НЕ _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	Контрагенты.Ссылка КАК Контрагент,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК СокращенноеНаименование,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта.Код КАК ВалютаКод,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаВВалютеУчета,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Сделка,
		|	ВЫБОР СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|			ТОГДА ""ДЗ по сделкам""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|			ТОГДА ""КЗ по сделкам""
		|	КОНЕЦ КАК ВидАктиваРасшифровки,
		|	""Контрагент: [Контрагент], Сделка: [Сделка]"" КАК ШаблонРасшифровки,
		|	ВЫБОР
		|		КОГДА &ВерсияТаксономии >= ""6_1""
		|			ТОГДА ВЫБОР
		|					КОГДА СделкаЦенныеБумаги.Ссылка ЕСТЬ НЕ NULL 
		|						ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага
		|					КОГДА СделкаСВалютой.Ссылка ЕСТЬ НЕ NULL 
		|						ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта
		|				КОНЕЦ
		|	КОНЕЦ КАК СубъектАналитики,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка ЕСТЬ НЕ NULL 
		|			ТОГДА СделкаЦенныеБумаги.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Количество
		|ПОМЕСТИТЬ _ЗадолженностьСделки
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)))
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ПО Сделка.Ссылка = СделкаЦенныеБумаги.Ссылка
		|				И (СделкаЦенныеБумаги.НомерСтроки = 1)
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание = Сделка.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание = СделкаСВалютой.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК Контрагенты
		|		ПО (ВЫБОР
		|				КОГДА НЕ Сделка.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|					ТОГДА Сделка.Контрагент
		|				КОГДА НЕ Сделка.РежимБиржевыхТоргов.РежимПереговорныхСделок
		|					ТОГДА &НКО_НКЦ
		|				ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
		|			КОНЕЦ = Контрагенты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (Контрагенты.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	НЕ _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	Контрагенты.Ссылка КАК Контрагент,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК СокращенноеНаименование,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта.Код КАК ВалютаКод,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаВВалютеУчета,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
		|	ВЫБОР СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|			ТОГДА ""ДЗ прочая""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|			ТОГДА ""КЗ прочая""
		|	КОНЕЦ КАК ВидАктиваРасшифровки,
		|	""Контрагент: [Контрагент], Вид задолженности: [ВидЗадолженности]"" КАК ШаблонРасшифровки,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Регистратор КАК ДокументРСА
		|ПОМЕСТИТЬ _ЗадолженностьПрочая
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)))
		|			И (НЕ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)))
		|			И (НЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Справочник.БрокерскиеКомпании)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК СделкаМНО
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = СделкаМНО.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСМО КАК СделкаСМО
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = СделкаСМО.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание = Сделка.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание = СделкаРЕПО.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДоговорыСБрокерами КАК _ДоговорыСБрокерами
		|		ПО _СчетаДоверительногоУправления.Ссылка = _ДоговорыСБрокерами.СчетДоверительногоУправления
		|			И (ВЫБОР
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание ССЫЛКА Документ.Сделка
		|					ТОГДА Сделка.Брокер
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание ССЫЛКА Документ.СделкаРЕПО
		|					ТОГДА СделкаРЕПО.Брокер
		|			КОНЕЦ = _ДоговорыСБрокерами.Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК Контрагенты
		|		ПО (ВЫБОР
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|					ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|					ТОГДА _ДоговорыСБрокерами.БрокерКонтрагент
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Документ.МНО
		|					ТОГДА СделкаМНО.РасчетныйСчет.Банк.ЮрФизЛицо
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Документ.СделкаСМО
		|					ТОГДА СделкаСМО.РасчетныйСчет.Банк.ЮрФизЛицо
		|			КОНЕЦ = Контрагенты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (Контрагенты.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	НЕ _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|			ТОГДА 0
		|		ИНАЧЕ _СчетаДоверительногоУправления.СЧА
		|	КОНЕЦ КАК СЧА,
		|	СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.ДенежныеСредства, 0)) КАК ДенежныеСредства,
		|	СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.Депозиты, 0)) КАК Депозиты,
		|	СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.ЦенныеБумаги, 0)) КАК ЦенныеБумаги,
		|	СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.СделкиРЕПО, 0)) КАК СделкиРЕПО,
		|	СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.Сделки, 0)) КАК Сделки,
		|	СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.Прочее, 0)) КАК Прочее,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|			ТОГДА 0
		|		ИНАЧЕ _СчетаДоверительногоУправления.СЧА - СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.ДенежныеСредства, 0)) - СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.Депозиты, 0)) - СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.ЦенныеБумаги, 0)) - СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.СделкиРЕПО, 0)) - СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.Сделки, 0)) - СУММА(ЕСТЬNULL(ИтогиПоВидамАктивов.Прочее, 0))
		|	КОНЕЦ КАК Расхождения,
		|	_СчетаДоверительногоУправления.Документ_РСА КАК Документ_РСА
		|ПОМЕСТИТЬ _ИтогиПоВидамАктивов
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДенежныеСредства.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ДенежныеСредства.СуммаВВалютеУчета КАК ДенежныеСредства,
		|			0 КАК Депозиты,
		|			0 КАК ЦенныеБумаги,
		|			0 КАК СделкиРЕПО,
		|			0 КАК Сделки,
		|			0 КАК Прочее
		|		ИЗ
		|			_ДенежныеСредства КАК _ДенежныеСредства
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_Депозиты.СчетДоверительногоУправления,
		|			0,
		|			_Депозиты.СуммаВВалютеУчета,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			_Депозиты КАК _Депозиты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ЦенныеБумаги.СчетДоверительногоУправления,
		|			0,
		|			0,
		|			_ЦенныеБумаги.СуммаВВалютеУчета,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			_ЦенныеБумаги КАК _ЦенныеБумаги
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ЗадолженностьСделкиРЕПО.СчетДоверительногоУправления,
		|			0,
		|			0,
		|			0,
		|			_ЗадолженностьСделкиРЕПО.СуммаВВалютеУчета,
		|			0,
		|			0
		|		ИЗ
		|			_ЗадолженностьСделкиРЕПО КАК _ЗадолженностьСделкиРЕПО
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ЗадолженностьСделки.СчетДоверительногоУправления,
		|			0,
		|			0,
		|			0,
		|			0,
		|			_ЗадолженностьСделки.СуммаВВалютеУчета,
		|			0
		|		ИЗ
		|			_ЗадолженностьСделки КАК _ЗадолженностьСделки
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ЗадолженностьПрочая.СчетДоверительногоУправления,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			_ЗадолженностьПрочая.СуммаВВалютеУчета
		|		ИЗ
		|			_ЗадолженностьПрочая КАК _ЗадолженностьПрочая) КАК ИтогиПоВидамАктивов
		|		ПО _СчетаДоверительногоУправления.Ссылка = ИтогиПоВидамАктивов.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления.Ссылка,
		|	_СчетаДоверительногоУправления.СЧА,
		|	_СчетаДоверительногоУправления.Документ_РСА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	_СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	_СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	_РеквизитыКлиентов.ДатаПолученияДокументовОСмерти КАК ДатаПолученияДокументовОСмерти,
		|	_СчетаДоверительногоУправления.Стратегия КАК Стратегия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СчетаДоверительногоУправления.Стратегия.Стандартная, ЛОЖЬ)
		|			ТОГДА _СчетаДоверительногоУправления.Стратегия
		|		ИНАЧЕ _СчетаДоверительногоУправления.Ссылка
		|	КОНЕЦ КАК ИдентификаторСтратегии,
		|	_СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	ЕСТЬNULL(_КвалифицированныеИнвесторы.Является, ЛОЖЬ) КАК КвалИнвестор,
		|	ВЫБОР
		|		КОГДА _РеквизитыКлиентов.РезидентРФ
		|				И ЕСТЬNULL(КодыКлиентовПоОКАТО.ОКАТО, """") <> """"
		|			ТОГДА ""OKATO"" + КодыКлиентовПоОКАТО.ОКАТО
		|		КОГДА НЕ _РеквизитыКлиентов.РезидентРФ
		|			ТОГДА ""Strana_"" + _РеквизитыКлиентов.КодСтраныРегистрации
		|	КОНЕЦ КАК ОКАТО_КодСтраны,
		|	КодыКлиентовПоОКАТО.ОКАТО КАК ОКАТО,
		|	_РеквизитыКлиентов.КодСтраныРегистрации КАК КодСтраныРегистрации,
		|	_РеквизитыКлиентов.СтранаРегистрации КАК СтранаРегистрации,
		|	_КонтрагентыПоДоговору.Идентификатор КАК КонтрагентПоДоговору,
		|	_КонтрагентыПоДоговору.Наименование КАК КонтрагентПоДоговоруНаименование,
		|	НЕ _РеквизитыКлиентов.КлиентУмер
		|		И _АктивныеКлиенты.Активный КАК АктивныйКлиент,
		|	КлиентыДУ.Клиент.ВидЮрФизЛица КАК ТипКлиента,
		|	ВЫБОР
		|		КОГДА &ВерсияТаксономии < ""7_1""
		|			ТОГДА _РеквизитыКлиентов.РезидентРФ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК РезидентРФ,
		|	ЕСТЬNULL(_СчетаДоверительногоУправления.Стратегия.Стандартная, ЛОЖЬ) КАК СтандартнаяСтратегия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СчетаДоверительногоУправления.Стратегия.Стандартная, ЛОЖЬ)
		|			ТОГДА _СчетаДоверительногоУправления.Стратегия.Наименование
		|		ИНАЧЕ ""индивидуальная стратегия""
		|	КОНЕЦ КАК НаименованиеСтратегии,
		|	ВЫБОР
		|		КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.ИнтервалДат)
		|			ТОГДА РАЗНОСТЬДАТ(ИнвестПрофили.НачалоПериодаГоризонта, ИнвестПрофили.ОкончаниеПериодаГоризонта, ДЕНЬ) + ВЫБОР
		|					КОГДА &УчитываласьДатаОкончанияИнтервалаПриРасчетеГоризонта
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора)
		|				И ЕСТЬNULL(_СчетаДоверительногоУправления.Стратегия.Стандартная, ЛОЖЬ)
		|			ТОГДА РАЗНОСТЬДАТ(&ДатаОкончания, ДОБАВИТЬКДАТЕ(&ДатаОкончания, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта), ДЕНЬ)
		|		КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора)
		|			ТОГДА РАЗНОСТЬДАТ(_СчетаДоверительногоУправления.ДатаЗаключения, ДОБАВИТЬКДАТЕ(_СчетаДоверительногоУправления.ДатаЗаключения, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта), ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(ИнвестПрофили.Период, ДОБАВИТЬКДАТЕ(ИнвестПрофили.Период, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта), ДЕНЬ)
		|	КОНЕЦ КАК ИнвестиционныйГоризонт,
		|	ВЫБОР
		|		КОГДА &ВерсияТаксономии >= ""7_1""
		|			ТОГДА ВЫБОР
		|					КОГДА ИнвестПрофили.ВариантГоризонта ЕСТЬ NULL
		|						ТОГДА ""не_определен""
		|					КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.ИнтервалДат)
		|						ТОГДА РАЗНОСТЬДАТ(ИнвестПрофили.НачалоПериодаГоризонта, ИнвестПрофили.ОкончаниеПериодаГоризонта, ДЕНЬ) + ВЫБОР
		|								КОГДА &УчитываласьДатаОкончанияИнтервалаПриРасчетеГоризонта
		|									ТОГДА 1
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора)
		|							И ЕСТЬNULL(_СчетаДоверительногоУправления.Стратегия.Стандартная, ЛОЖЬ)
		|						ТОГДА РАЗНОСТЬДАТ(&ДатаОкончания, ДОБАВИТЬКДАТЕ(&ДатаОкончания, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта), ДЕНЬ)
		|					КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора)
		|						ТОГДА РАЗНОСТЬДАТ(_СчетаДоверительногоУправления.ДатаЗаключения, ДОБАВИТЬКДАТЕ(_СчетаДоверительногоУправления.ДатаЗаключения, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта), ДЕНЬ)
		|					ИНАЧЕ РАЗНОСТЬДАТ(ИнвестПрофили.Период, ДОБАВИТЬКДАТЕ(ИнвестПрофили.Период, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта), ДЕНЬ)
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫБОР
		|		КОГДА &ВерсияТаксономии >= ""7_1""
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ИнвестПрофили.Регистратор КАК Документ.РегистрацияИнвестиционногоПрофиля).ИнвестиционнаяЦель.ДопустимыйРискВПроцентах, ""не_определен"")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	ВЫБОР
		|		КОГДА &ВерсияТаксономии >= ""7_1""
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ИнвестПрофили.Регистратор КАК Документ.РегистрацияИнвестиционногоПрофиля).ИнвестиционнаяЦель.ОжидаемаяДоходностьВПроцентах, ""не_определена"")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	ИнвестПрофили.Регистратор КАК ИнвестПрофиль,
		|	_РеквизитыКлиентов.КлиентУмер КАК КлиентУмер,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|					И _СчетаДоверительногоУправления.ДатаРасторжения < &ДатаОкончания
		|				ИЛИ _РеквизитыКлиентов.КлиентУмер
		|				ИЛИ _СчетаДоверительногоУправления.Ссылка В
		|					(ВЫБРАТЬ
		|						СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоличествоДоговоров,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.ДатаЗаключения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЗаключенныхЗаПериод,
		|	_СчетаДоверительногоУправления.ДатаЗаключения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И НЕ _КлиентДоИПослеОтчетногоПериода.НаНачало КАК НовыйКлиент,
		|	ВЫБОР
		|		КОГДА _РеквизитыКлиентов.КлиентУмер
		|				И (_РеквизитыКлиентов.ДатаПолученияДокументовОСмерти МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			ТОГДА 1
		|		КОГДА _РеквизитыКлиентов.КлиентУмер
		|			ТОГДА 0
		|		КОГДА _СчетаДоверительногоУправления.ДатаРасторжения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|				ИЛИ _СчетаДоверительногоУправления.Ссылка В
		|					(ВЫБРАТЬ
		|						СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРасторгнутыхЗаПериод,
		|	ВЫБОР
		|		КОГДА _РеквизитыКлиентов.КлиентУмер
		|				И (_РеквизитыКлиентов.ДатаПолученияДокументовОСмерти МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			ТОГДА ИСТИНА
		|		КОГДА _РеквизитыКлиентов.КлиентУмер
		|			ТОГДА ЛОЖЬ
		|		КОГДА _СчетаДоверительногоУправления.ДатаРасторжения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|				ИЛИ _СчетаДоверительногоУправления.Ссылка В
		|					(ВЫБРАТЬ
		|						СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|			ТОГДА НЕ _КлиентДоИПослеОтчетногоПериода.НаКонец
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РасторгнутыВсеДоговора,
		|	_КонтрагентыПоДоговору.ЭтоИИС КАК ЭтоИИС,
		|	ЕСТЬNULL(_СДУПоказатьИзъятиеСЧАДоходность.ДоходностьПоСтратегии, ФинансовыеПоказателиДоходностьСтратегии.Значение) КАК ДоходностьПоСтратегии,
		|	_СчетаДоверительногоУправления.ДатаСЧА КАК ДатаСЧА,
		|	_СчетаДоверительногоУправления.Документ_РСА КАК Документ_РСА,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|			ТОГДА 0
		|		ИНАЧЕ _СчетаДоверительногоУправления.СЧА
		|	КОНЕЦ КАК СЧА,
		|	_ИтогиПоВидамАктивов.ДенежныеСредства КАК ДенежныеСредства_СуммаВВалютеУчета,
		|	_ИтогиПоВидамАктивов.Депозиты КАК Депозиты_СуммаВВалютеУчета,
		|	_ИтогиПоВидамАктивов.ЦенныеБумаги КАК ЦенныеБумаги_СуммаВВалютеУчета,
		|	_ИтогиПоВидамАктивов.СделкиРЕПО КАК СделкиРЕПО_СуммаВВалютеУчета,
		|	_ИтогиПоВидамАктивов.Сделки КАК Сделки_СуммаВВалютеУчета,
		|	_ИтогиПоВидамАктивов.Прочее КАК Прочее_СуммаВВалютеУчета,
		|	_ИтогиПоВидамАктивов.Расхождения КАК Расхождения_СуммаВВалютеУчета,
		|	ЕСТЬNULL(_ВводыВыводы.ПоступлениеДС, 0) КАК ПоступлениеДС,
		|	ЕСТЬNULL(_ВводыВыводы.ПоступлениеЦБ, 0) КАК ПоступлениеЦБ,
		|	ЕСТЬNULL(_ВводыВыводы.ПоступлениеПрочие, 0) КАК ПоступлениеПрочие,
		|	ЕСТЬNULL(_ВводыВыводы.ИзъятиеДС, 0) КАК ИзъятиеДС,
		|	ЕСТЬNULL(_ВводыВыводы.ИзъятиеЦБ, 0) КАК ИзъятиеЦБ,
		|	ЕСТЬNULL(_ВводыВыводы.ИзъятиеПрочие, 0) КАК ИзъятиеПрочие,
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СчетаДоверительногоУправления.Стратегия.Стандартная, ЛОЖЬ)
		|			ТОГДА ПОДСТРОКА(""0_"" + _СчетаДоверительногоУправления.Стратегия.Наименование, 1, 50)
		|		ИНАЧЕ ПОДСТРОКА(""1_"" + _СчетаДоверительногоУправления.КодСчета, 1, 50)
		|	КОНЕЦ КАК ПолеСортировки
		|ПОМЕСТИТЬ _Стратегии
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДУ
		|		ПО _СчетаДоверительногоУправления.Ссылка = КлиентыДУ.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КвалифицированныеИнвесторы КАК _КвалифицированныеИнвесторы
		|		ПО (КлиентыДУ.Клиент = _КвалифицированныеИнвесторы.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ КодыКлиентовПоОКАТО КАК КодыКлиентовПоОКАТО
		|		ПО (КлиентыДУ.Клиент = КодыКлиентовПоОКАТО.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыКлиентов КАК _РеквизитыКлиентов
		|		ПО (КлиентыДУ.Клиент = _РеквизитыКлиентов.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АктивныеКлиенты КАК _АктивныеКлиенты
		|		ПО (КлиентыДУ.Клиент = _АктивныеКлиенты.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеПрофили.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК ИнвестПрофили
		|		ПО (ВЫБОР
		|				КОГДА ЕСТЬNULL(_СчетаДоверительногоУправления.Стратегия.Стандартная, ЛОЖЬ)
		|					ТОГДА _СчетаДоверительногоУправления.Стратегия = ИнвестПрофили.СубъектУчета
		|				ИНАЧЕ _СчетаДоверительногоУправления.Ссылка = ИнвестПрофили.СубъектУчета
		|						И ВЫБОР
		|							КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.ИнтервалДат)
		|								ТОГДА ИнвестПрофили.ОкончаниеПериодаГоризонта
		|							КОГДА ИнвестПрофили.ВариантГоризонта = ЗНАЧЕНИЕ(Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора)
		|								ТОГДА ДОБАВИТЬКДАТЕ(_СчетаДоверительногоУправления.ДатаЗаключения, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта)
		|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ИнвестПрофили.Период, ГОД, ИнвестПрофили.ОтносительныйСрокГоризонта)
		|						КОНЕЦ >= ВЫБОР
		|							КОГДА _РеквизитыКлиентов.ДатаПолученияДокументовОСмерти МЕЖДУ &ДатаНачала И &ДатаОкончания
		|								ТОГДА _РеквизитыКлиентов.ДатаПолученияДокументовОСмерти
		|							КОГДА _СчетаДоверительногоУправления.ДатаРасторжения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|								ТОГДА _СчетаДоверительногоУправления.ДатаРасторжения
		|							ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|						КОНЕЦ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КонтрагентыПоДоговору КАК _КонтрагентыПоДоговору
		|		ПО _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = _КонтрагентыПоДоговору.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиДоходностьСтратегии
		|		ПО (ВЫБОР
		|				КОГДА _СчетаДоверительногоУправления.Стратегия.Стандартная
		|					ТОГДА _СчетаДоверительногоУправления.Стратегия
		|				ИНАЧЕ _СчетаДоверительногоУправления.Ссылка
		|			КОНЕЦ = ФинансовыеПоказателиДоходностьСтратегии.СубъектАналитики)
		|			И (ФинансовыеПоказателиДоходностьСтратегии.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода))
		|			И (ФинансовыеПоказателиДоходностьСтратегии.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СДУПоказатьИзъятиеСЧА КАК _СДУПоказатьИзъятиеСЧАДоходность
		|		ПО _СчетаДоверительногоУправления.Ссылка = _СДУПоказатьИзъятиеСЧАДоходность.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО _СчетаДоверительногоУправления.Ссылка = _ВводыВыводы.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИтогиПоВидамАктивов КАК _ИтогиПоВидамАктивов
		|		ПО _СчетаДоверительногоУправления.Ссылка = _ИтогиПоВидамАктивов.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КлиентДоИПослеОтчетногоПериода КАК _КлиентДоИПослеОтчетногоПериода
		|		ПО _СчетаДоверительногоУправления.Клиент = _КлиентДоИПослеОтчетногоПериода.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Клиенты.Клиент КАК Клиент,
		|	Клиенты.КлиентУмер КАК КлиентУмер,
		|	Клиенты.ОКАТО_КодСтраны КАК ОКАТО_КодСтраны,
		|	Клиенты.ОКАТО КАК ОКАТО,
		|	Клиенты.СтранаРегистрации КАК СтранаРегистрации,
		|	Клиенты.КвалИнвестор КАК КвалИнвестор,
		|	Клиенты.РезидентРФ КАК РезидентРФ,
		|	Клиенты.АктивныйКлиент КАК АктивныйКлиент,
		|	Клиенты.ТипКлиента КАК ТипКлиента,
		|	Клиенты.КоличествоКлиентов КАК КоличествоКлиентов,
		|	Клиенты.КоличествоКлиентовИИС КАК КоличествоКлиентовИИС,
		|	Клиенты.КоличествоКлиентовРасторгли КАК КоличествоКлиентовРасторгли,
		|	Клиенты.КоличествоКлиентовЗаключили КАК КоличествоКлиентовЗаключили,
		|	Клиенты.ОбъемПортфеля КАК ОбъемПортфеля,
		|	Клиенты.ОбъемПортфеляИИС КАК ОбъемПортфеляИИС,
		|	_РазмерыСчетовКлиентов.Идентификатор КАК РазмерСчетаКлиента,
		|	_РазмерыСчетовКлиентов.Наименование КАК РазмерСчетаКлиентаНаименование
		|ПОМЕСТИТЬ _Клиенты
		|ИЗ
		|	(ВЫБРАТЬ
		|		_Стратегии.Клиент КАК Клиент,
		|		_Стратегии.КлиентУмер КАК КлиентУмер,
		|		_Стратегии.ОКАТО_КодСтраны КАК ОКАТО_КодСтраны,
		|		_Стратегии.ОКАТО КАК ОКАТО,
		|		_Стратегии.СтранаРегистрации КАК СтранаРегистрации,
		|		_Стратегии.КвалИнвестор КАК КвалИнвестор,
		|		_Стратегии.РезидентРФ КАК РезидентРФ,
		|		_Стратегии.АктивныйКлиент КАК АктивныйКлиент,
		|		_Стратегии.ТипКлиента КАК ТипКлиента,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА _Стратегии.КоличествоДоговоров > 0
		|					ТОГДА _Стратегии.Клиент
		|			КОНЕЦ) КАК КоличествоКлиентов,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА _Стратегии.КоличествоДоговоров > 0
		|						И _Стратегии.ЭтоИИС
		|					ТОГДА _Стратегии.Клиент
		|			КОНЕЦ) КАК КоличествоКлиентовИИС,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА _Стратегии.РасторгнутыВсеДоговора
		|					ТОГДА _Стратегии.Клиент
		|			КОНЕЦ) КАК КоличествоКлиентовРасторгли,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА _Стратегии.НовыйКлиент
		|					ТОГДА _Стратегии.Клиент
		|			КОНЕЦ) КАК КоличествоКлиентовЗаключили,
		|		СУММА(_Стратегии.СЧА) КАК ОбъемПортфеля,
		|		СУММА(ВЫБОР
		|				КОГДА _Стратегии.ЭтоИИС
		|					ТОГДА _Стратегии.СЧА
		|			КОНЕЦ) КАК ОбъемПортфеляИИС
		|	ИЗ
		|		_Стратегии КАК _Стратегии
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_Стратегии.Клиент,
		|		_Стратегии.КлиентУмер,
		|		_Стратегии.ОКАТО_КодСтраны,
		|		_Стратегии.ОКАТО,
		|		_Стратегии.СтранаРегистрации,
		|		_Стратегии.КвалИнвестор,
		|		_Стратегии.РезидентРФ,
		|		_Стратегии.АктивныйКлиент,
		|		_Стратегии.ТипКлиента) КАК Клиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РазмерыСчетовКлиентов КАК _РазмерыСчетовКлиентов
		|		ПО (ВЫБОР
		|				КОГДА _РазмерыСчетовКлиентов.НижняяГраница <= _РазмерыСчетовКлиентов.ВерхняяГраница
		|					ТОГДА ЕСТЬNULL(Клиенты.ОбъемПортфеля, 0) >= _РазмерыСчетовКлиентов.НижняяГраница
		|							И ЕСТЬNULL(Клиенты.ОбъемПортфеля, 0) <= _РазмерыСчетовКлиентов.ВерхняяГраница
		|				КОГДА _РазмерыСчетовКлиентов.НижняяГраница = 0
		|					ТОГДА ЕСТЬNULL(Клиенты.ОбъемПортфеля, 0) <= _РазмерыСчетовКлиентов.ВерхняяГраница
		|				КОГДА _РазмерыСчетовКлиентов.ВерхняяГраница = 0
		|					ТОГДА ЕСТЬNULL(Клиенты.ОбъемПортфеля, 0) >= _РазмерыСчетовКлиентов.НижняяГраница
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА _Стратегии.КоличествоДоговоров > 0
		|				ТОГДА _Стратегии.Клиент
		|		КОНЕЦ) КАК KolichestvoKlientov,
		|	_Стратегии.ДоходностьПоСтратегии КАК DoxInStr,
		|	_Стратегии.НаименованиеСтратегии КАК Naim_strategii_Inf_ob_inv_strateg,
		|	_Стратегии.СтандартнаяСтратегия КАК TipStrategEnumerator,
		|	_Стратегии.ИнвестиционныйГоризонт КАК VremGor,
		|	СУММА(_Стратегии.СЧА) КАК AktStoim,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки
		|ПОМЕСТИТЬ SR_0420431_Q_R1_P1
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ДоходностьПоСтратегии,
		|	_Стратегии.НаименованиеСтратегии,
		|	_Стратегии.СтандартнаяСтратегия,
		|	_Стратегии.ИнвестиционныйГоризонт,
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.ПолеСортировки
		|
		|ИМЕЮЩИЕ
		|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА _Стратегии.КоличествоДоговоров > 0
		|					ТОГДА _Стратегии.Клиент
		|			КОНЕЦ) > 0
		|		ИЛИ СУММА(_Стратегии.ИзъятиеДС + _Стратегии.ИзъятиеЦБ + _Стратегии.ИзъятиеПрочие) <> 0
		|		ИЛИ СУММА(_Стратегии.ПоступлениеДС + _Стратегии.ПоступлениеЦБ + _Стратегии.ПоступлениеПрочие) <> 0
		|		ИЛИ СУММА(_Стратегии.СЧА) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""DenezhnyeSredstvaMember"" КАК Tip_imushhestvaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	СУММА(_Стратегии.ИзъятиеДС) КАК Izyat,
		|	СУММА(_Стратегии.ПоступлениеДС) КАК Postupl,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R1_P2
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|
		|ИМЕЮЩИЕ
		|	(СУММА(_Стратегии.ИзъятиеДС) <> 0
		|		ИЛИ СУММА(_Стратегии.ПоступлениеДС) <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	ЛОЖЬ,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	""CZennyeBumagiMember"",
		|	""Doverit_yprMember"",
		|	СУММА(_Стратегии.ИзъятиеЦБ),
		|	СУММА(_Стратегии.ПоступлениеЦБ),
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт,
		|	""""
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|
		|ИМЕЮЩИЕ
		|	(СУММА(_Стратегии.ИзъятиеЦБ) <> 0
		|		ИЛИ СУММА(_Стратегии.ПоступлениеЦБ) <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	ЛОЖЬ,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	""ProcheeMember"",
		|	""Doverit_yprMember"",
		|	СУММА(_Стратегии.ИзъятиеПрочие),
		|	СУММА(_Стратегии.ПоступлениеПрочие),
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт,
		|	""""
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|
		|ИМЕЮЩИЕ
		|	(СУММА(_Стратегии.ИзъятиеПрочие) <> 0
		|		ИЛИ СУММА(_Стратегии.ПоступлениеПрочие) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	СУММА(_Стратегии.КоличествоЗаключенныхЗаПериод) КАК KolDogZakl,
		|	СУММА(_Стратегии.КоличествоРасторгнутыхЗаПериод) КАК KolDogPrekr,
		|	СУММА(_Стратегии.КоличествоДоговоров) КАК KolDogOtch,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R1_P2_3
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.РазмерСчетаКлиента КАК RazmSchAxis,
		|	_Клиенты.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Клиенты.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_Клиенты.РезидентРФ КАК Rezident_nerezidentAxis,
		|	_Клиенты.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Клиенты.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	СУММА(_Клиенты.КоличествоКлиентов) КАК KolichestvoKlientov,
		|	СУММА(_Клиенты.КоличествоКлиентовИИС) КАК KolichestvoKlientovIIS,
		|	СУММА(_Клиенты.КоличествоКлиентовРасторгли) КАК KolichestvoKlientovRastDog,
		|	СУММА(_Клиенты.КоличествоКлиентовЗаключили) КАК KolichestvoKlientovZaklDog,
		|	СУММА(_Клиенты.ОбъемПортфеля) КАК SovObPortfGr,
		|	СУММА(_Клиенты.ОбъемПортфеляИИС) КАК SovObPortfGrIIS
		|ПОМЕСТИТЬ SR_0420431_Q_R1_P3
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|
		|СГРУППИРОВАТЬ ПО
		|	_Клиенты.РазмерСчетаКлиента,
		|	_Клиенты.ОКАТО_КодСтраны,
		|	_Клиенты.КвалИнвестор,
		|	_Клиенты.РезидентРФ,
		|	_Клиенты.АктивныйКлиент,
		|	_Клиенты.ТипКлиента
		|
		|ИМЕЮЩИЕ
		|	(СУММА(_Клиенты.КоличествоКлиентов) <> 0
		|		ИЛИ СУММА(_Клиенты.КоличествоКлиентовИИС) <> 0
		|		ИЛИ СУММА(_Клиенты.КоличествоКлиентовРасторгли) <> 0
		|		ИЛИ СУММА(_Клиенты.КоличествоКлиентовЗаключили) <> 0
		|		ИЛИ СУММА(_Клиенты.ОбъемПортфеля) <> 0
		|		ИЛИ СУММА(_Клиенты.ОбъемПортфеляИИС) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_ДенежныеСредства.БанкБрокер КАК IDBrokeraKOTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_ДенежныеСредства.ВалютаКод КАК Kod_ValyutyAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	_ДенежныеСредства.СокращенноеНаименование КАК SokrNaim,
		|	СУММА(_ДенежныеСредства.СуммаВВалютеУчета) КАК StoimOcz,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""DenezhnyeSredstvaMember"" КАК Tip_imushhestvaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	""NachalnyjMember"" КАК Uroven_riskaAxis,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R2
		|ИЗ
		|	_ДенежныеСредства КАК _ДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО _ДенежныеСредства.СчетДоверительногоУправления = _Стратегии.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ИдентификаторСтратегии,
		|	_ДенежныеСредства.БанкБрокер,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_ДенежныеСредства.ВалютаКод,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_ДенежныеСредства.СокращенноеНаименование,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Депозиты.ВалютаКод КАК Kod_ValyutyAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	СУММА(_Депозиты.СуммаВВалютеУчета) КАК StoimOcz,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""DenezhnyeSredstvaMember"" КАК Tip_imushhestvaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	""NachalnyjMember"" КАК Uroven_riskaAxis,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R3
		|ИЗ
		|	_Депозиты КАК _Депозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО _Депозиты.СчетДоверительногоУправления = _Стратегии.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Депозиты.ВалютаКод,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ID_CzennojBumagiTaxis,
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	СУММА(_ЦенныеБумаги.Количество) КАК Kolczb,
		|	СУММА(_ЦенныеБумаги.СуммаВВалютеУчета) КАК StoimOcz,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""CZennyeBumagiMember"" КАК Tip_imushhestvaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	""NachalnyjMember"" КАК Uroven_riskaAxis,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R_4
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО (_Стратегии.СчетДоверительногоУправления = _ЦенныеБумаги.СчетДоверительногоУправления)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага,
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	_СделкиСПФИ.НаправлениеСделки КАК NaprSdelAxis,
		|	""SvopMember"" КАК PoTipamPfiAxis,
		|	_СделкиСПФИ.СделкаСПФИ КАК Rek_PFITaxis,
		|	_СделкиСПФИ.СделкаСПФИ КАК Naim_PFI,
		|	1 КАК Kolvo_PFI_Xar_reestr_vnutr_ucheta_sdelok_s_PFI,
		|	0 КАК Stoimost,
		|	0 КАК StoimostBazisnogoAktiva,
		|	""NachalnyjMember"" КАК Uroven_riskaAxis,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis,
		|	""OrgTorgiMember"" КАК MestoZaklPFIAxis,
		|	0 КАК NachStoimostPFI
		|ПОМЕСТИТЬ SR_0420431_Q_R_6
		|ИЗ
		|	_СделкиСПФИ КАК _СделкиСПФИ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО (_Стратегии.СчетДоверительногоУправления = _СделкиСПФИ.СчетДоверительногоУправления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьСделкиРЕПО.Контрагент КАК ID_KontragentaTaxis,
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_ЗадолженностьСделкиРЕПО.СокращенноеНаименование КАК Naim_kontr,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	СУММА(ВЫБОР _ЗадолженностьСделкиРЕПО.ВидАктива
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				ТОГДА _ЗадолженностьСделкиРЕПО.СуммаВВалютеУчета
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|				ТОГДА -_ЗадолженностьСделкиРЕПО.СуммаВВалютеУчета
		|		КОНЕЦ) КАК StoimOcz,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	_ЗадолженностьСделкиРЕПО.ВидСделкиРЕПО КАК TipRepoAxis,
		|	""SdelkiRepoMember"" КАК TipTrebObAxis,
		|	_ЗадолженностьСделкиРЕПО.ВидАктива КАК TrebObAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	""NachalnyjMember"" КАК Uroven_riskaAxis,
		|	_ЗадолженностьСделкиРЕПО.СубъектАналитики КАК IDTrebObyazTaxis,
		|	СУММА(_ЗадолженностьСделкиРЕПО.Количество) КАК Kolichestvo,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R_7
		|ИЗ
		|	_ЗадолженностьСделкиРЕПО КАК _ЗадолженностьСделкиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО _ЗадолженностьСделкиРЕПО.СчетДоверительногоУправления = _Стратегии.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьСделкиРЕПО.Контрагент,
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_ЗадолженностьСделкиРЕПО.СокращенноеНаименование,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_ЗадолженностьСделкиРЕПО.ВидСделкиРЕПО,
		|	_ЗадолженностьСделкиРЕПО.ВидАктива,
		|	_ЗадолженностьСделкиРЕПО.СубъектАналитики,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьСделки.Контрагент,
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_ЗадолженностьСделки.СокращенноеНаименование,
		|	_Стратегии.ЭтоИИС,
		|	ЛОЖЬ,
		|	_Стратегии.РезидентРФ,
		|	СУММА(ВЫБОР _ЗадолженностьСделки.ВидАктива
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				ТОГДА _ЗадолженностьСделки.СуммаВВалютеУчета
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|				ТОГДА -_ЗадолженностьСделки.СуммаВВалютеУчета
		|		КОНЕЦ),
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	""Ne_PrimenimoMember"",
		|	""SdelCzBzaisklRepoMember"",
		|	_ЗадолженностьСделки.ВидАктива,
		|	""Doverit_yprMember"",
		|	""NachalnyjMember"",
		|	_ЗадолженностьСделки.СубъектАналитики,
		|	СУММА(_ЗадолженностьСделки.Количество),
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт,
		|	""""
		|ИЗ
		|	_ЗадолженностьСделки КАК _ЗадолженностьСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО _ЗадолженностьСделки.СчетДоверительногоУправления = _Стратегии.СчетДоверительногоУправления
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_ЗадолженностьСделки.Сделка) = ТИП(Документ.Сделка)
		|	И &ВерсияТаксономии >= ""6_1""
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьСделки.Контрагент,
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_ЗадолженностьСделки.СокращенноеНаименование,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_ЗадолженностьСделки.ВидАктива,
		|	_ЗадолженностьСделки.СубъектАналитики,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьСделки.Контрагент КАК ID_KontragentaTaxis,
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_ЗадолженностьСделки.СокращенноеНаименование КАК Naim_kontr,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	СУММА(ВЫБОР _ЗадолженностьСделки.ВидАктива
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				ТОГДА _ЗадолженностьСделки.СуммаВВалютеУчета
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|				ТОГДА -_ЗадолженностьСделки.СуммаВВалютеУчета
		|		КОНЕЦ) КАК StoimOcz,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	ВЫБОР
		|		КОГДА &ВерсияТаксономии >= ""6_1""
		|			ТОГДА ""SdelkiInostrValyutMember""
		|		ИНАЧЕ ""SdelCzBzaisklRepoMember""
		|	КОНЕЦ КАК TipTrebObAxis,
		|	_ЗадолженностьСделки.ВидАктива КАК TrebObAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	""NachalnyjMember"" КАК Uroven_riskaAxis,
		|	_ЗадолженностьСделки.СубъектАналитики КАК IDTrebObyazTaxis,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R_7_3
		|ИЗ
		|	_ЗадолженностьСделки КАК _ЗадолженностьСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО _ЗадолженностьСделки.СчетДоверительногоУправления = _Стратегии.СчетДоверительногоУправления
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(_ЗадолженностьСделки.Сделка) = ТИП(Документ.СделкаСВалютой)
		|				И &ВерсияТаксономии >= ""6_1""
		|			ИЛИ &ВерсияТаксономии < ""6_1"")
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьСделки.Контрагент,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_ЗадолженностьСделки.СокращенноеНаименование,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_ЗадолженностьСделки.ВидАктива,
		|	_Стратегии.ИдентификаторСтратегии,
		|	_ЗадолженностьСделки.СубъектАналитики,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПрочая.Контрагент КАК ID_KontragentaTaxis,
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КонтрагентПоДоговору КАК KADogAxis,
		|	_Стратегии.ОКАТО_КодСтраны КАК Kod_OKATO_KodOKSMAxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_ЗадолженностьПрочая.СокращенноеНаименование КАК Naim_kontr,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	_Стратегии.РезидентРФ КАК Rezident_nerezidentAxis,
		|	СУММА(ВЫБОР _ЗадолженностьПрочая.ВидАктива
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				ТОГДА _ЗадолженностьПрочая.СуммаВВалютеУчета
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|				ТОГДА -_ЗадолженностьПрочая.СуммаВВалютеУчета
		|		КОНЕЦ) КАК StoimOcz,
		|	_Стратегии.АктивныйКлиент КАК Tip_i_status_klienta2Axis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""ProcheeMember"" КАК TipTrebObAxis,
		|	_ЗадолженностьПрочая.ВидАктива КАК TrebObAxis,
		|	ЛОЖЬ КАК PravIspDSAxis,
		|	""NachalnyjMember"" КАК Uroven_riskaAxis,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах КАК НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах КАК НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт КАК НеВыгружать_ИнвестиционныйГоризонт,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК InvestProfileTaxis
		|ПОМЕСТИТЬ SR_0420431_Q_R_7_5
		|ИЗ
		|	_ЗадолженностьПрочая КАК _ЗадолженностьПрочая
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Стратегии КАК _Стратегии
		|		ПО _ЗадолженностьПрочая.СчетДоверительногоУправления = _Стратегии.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПрочая.Контрагент,
		|	_Стратегии.КонтрагентПоДоговору,
		|	_Стратегии.ОКАТО_КодСтраны,
		|	_Стратегии.КвалИнвестор,
		|	_ЗадолженностьПрочая.СокращенноеНаименование,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.РезидентРФ,
		|	_Стратегии.АктивныйКлиент,
		|	_Стратегии.ТипКлиента,
		|	_ЗадолженностьПрочая.ВидАктива,
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.ПолеСортировки,
		|	_Стратегии.НеВыгружать_ДопустимыйРискВПроцентах,
		|	_Стратегии.НеВыгружать_ОжидаемаяДоходностьВПроцентах,
		|	_Стратегии.НеВыгружать_ИнвестиционныйГоризонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ИдентификаторСтратегии КАК ID_strategTaxis,
		|	_Стратегии.КвалИнвестор КАК Kvalificzirovannost_investoraAxis,
		|	_Стратегии.ЭтоИИС КАК PriznakIISAxis,
		|	_Стратегии.ТипКлиента КАК Tip_i_status_klientaAxis,
		|	""Doverit_yprMember"" КАК Vid_DeyatelnostiAxis,
		|	СУММА(_Стратегии.ИзъятиеДС + _Стратегии.ИзъятиеЦБ + _Стратегии.ИзъятиеПрочие) КАК Izyat,
		|	СУММА(_Стратегии.ПоступлениеДС + _Стратегии.ПоступлениеЦБ + _Стратегии.ПоступлениеПрочие) КАК Postupl,
		|	СУММА(_Стратегии.СЧА) КАК StoimOcz,
		|	_Стратегии.ПолеСортировки КАК ПолеСортировки
		|ПОМЕСТИТЬ SR_0420431_Q_R10
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|
		|СГРУППИРОВАТЬ ПО
		|	_Стратегии.ИдентификаторСтратегии,
		|	_Стратегии.КвалИнвестор,
		|	_Стратегии.ЭтоИИС,
		|	_Стратегии.ТипКлиента,
		|	_Стратегии.ПолеСортировки
		|
		|ИМЕЮЩИЕ
		|	(СУММА(_Стратегии.ИзъятиеДС + _Стратегии.ИзъятиеЦБ + _Стратегии.ИзъятиеПрочие) <> 0
		|		ИЛИ СУММА(_Стратегии.ПоступлениеДС + _Стратегии.ПоступлениеЦБ + _Стратегии.ПоступлениеПрочие) <> 0
		|		ИЛИ СУММА(_Стратегии.СЧА) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ИтогиПоВидамАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ИтогиПоВидамАктивов.СЧА КАК СЧА,
		|	_ИтогиПоВидамАктивов.ДенежныеСредства КАК ДенежныеСредства,
		|	_ИтогиПоВидамАктивов.Депозиты КАК Депозиты,
		|	_ИтогиПоВидамАктивов.ЦенныеБумаги КАК ЦенныеБумаги,
		|	_ИтогиПоВидамАктивов.СделкиРЕПО КАК СделкиРЕПО,
		|	_ИтогиПоВидамАктивов.Сделки КАК Сделки,
		|	_ИтогиПоВидамАктивов.Прочее КАК Прочее,
		|	_ИтогиПоВидамАктивов.Расхождения КАК Расхождения,
		|	_ИтогиПоВидамАктивов.Документ_РСА КАК Документ_РСА
		|ПОМЕСТИТЬ _КонтрольРасхожденийМеждуСЧАИВидамиАктивов
		|ИЗ
		|	_ИтогиПоВидамАктивов КАК _ИтогиПоВидамАктивов
		|ГДЕ
		|	_ИтогиПоВидамАктивов.Расхождения <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТИПЗНАЧЕНИЯ(СтоимостьПереоценки.ЦеннаяБумага) КАК ТипЦеннойБумаги
		|ПОМЕСТИТЬ _КонтрольТиповЦенныхБумаг
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ПО (СтоимостьПереоценки.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьПереоценки.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьПереоценки.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьПереоценки.СчетДоверительногоУправления
		|			И (СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки))
		|			И (СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|			И (НЕ СтоимостьПереоценки.Рынок В (&РынкиЦенныхБумагОтработанныеВОтчете))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики
		|ПОМЕСТИТЬ _КонтрольПрочихВидовАктивов
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|			И _СчетаДоверительногоУправления.ДатаСЧА = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период
		|			И _СчетаДоверительногоУправления.Организация = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И (НЕ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)))
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоНаОстатке
		|ПОМЕСТИТЬ _КонтрольПФИ
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ГраницаОкончания,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)
		|				И Рынок В (&РынкиЦенныхБумагПФИ)) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Не удалось определить контрагента по сделке РЕПО [Сделка]"" КАК ШаблонСообщения,
		|	_ЗадолженностьСделкиРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьСделкиРЕПО.СделкаРЕПО КАК Сделка,
		|	NULL КАК ВидАктива,
		|	NULL КАК ВидЗадолженности,
		|	_ЗадолженностьСделкиРЕПО.СделкаРЕПО КАК Ссылка
		|ПОМЕСТИТЬ _КонтрольНаличияКонтрагентаПоЗадолженности
		|ИЗ
		|	_ЗадолженностьСделкиРЕПО КАК _ЗадолженностьСделкиРЕПО
		|ГДЕ
		|	_ЗадолженностьСделкиРЕПО.Контрагент ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Не удалось определить контрагента по сделке [Сделка]"",
		|	_ЗадолженностьСделки.СчетДоверительногоУправления,
		|	_ЗадолженностьСделки.Сделка,
		|	NULL,
		|	NULL,
		|	_ЗадолженностьСделки.Сделка
		|ИЗ
		|	_ЗадолженностьСделки КАК _ЗадолженностьСделки
		|ГДЕ
		|	_ЗадолженностьСделки.Контрагент ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Не удалось определить контрагента по '[ВидАктива]' по виду задолженности '[ВидЗадолженности]' для договора [СчетДоверительногоУправления]"",
		|	_ЗадолженностьПрочая.СчетДоверительногоУправления,
		|	NULL,
		|	_ЗадолженностьПрочая.ВидАктива,
		|	_ЗадолженностьПрочая.ВидЗадолженности,
		|	_ЗадолженностьПрочая.ДокументРСА
		|ИЗ
		|	_ЗадолженностьПрочая КАК _ЗадолженностьПрочая
		|ГДЕ
		|	_ЗадолженностьПрочая.Контрагент ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	""SR_0420431_Q_R_4.ID_CzennojBumagiTaxis"" КАК ИмяРеквизита
		|ПОМЕСТИТЬ _РеестрЦенныхБумаг
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|ГДЕ
		|	&ЕстьРаздел_SR_0420459 = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _КонтрольНаличияСЧА
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|ГДЕ
		|	_Стратегии.КоличествоДоговоров > 0
		|	И _Стратегии.СЧА ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _Стратегии.ИдентификаторСтратегии ССЫЛКА Справочник.СтратегииИндивидуальногоИнвестирования
		|			ТОГДА ""Для стратегии '[ИдентификаторСтратегии]' не зарегистрирован инвест. профиль""
		|		ИНАЧЕ ""Для договора '[ИдентификаторСтратегии]' не зарегистрирован инвест. профиль. В дополнительных сведениях Счёта ВУ можно установить параметр 'Не контролировать наличие инвест профиля до даты'""
		|	КОНЕЦ КАК ШаблонСообщения,
		|	_Стратегии.ИдентификаторСтратегии КАК ИдентификаторСтратегии
		|ПОМЕСТИТЬ _КонтрольНаличияИнвестПрофиля
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НеКонтролироватьНаличиеИнвестПрофиляДоДаты
		|		ПО (НеКонтролироватьНаличиеИнвестПрофиляДоДаты.Свойство.Ключ = ""НеКонтролироватьНаличиеИнвестПрофиляДоДаты"")
		|			И (НеКонтролироватьНаличиеИнвестПрофиляДоДаты.Объект = _Стратегии.ИдентификаторСтратегии)
		|ГДЕ
		|	_Стратегии.ИнвестПрофиль ЕСТЬ NULL
		|	И (НеКонтролироватьНаличиеИнвестПрофиляДоДаты.Значение ЕСТЬ NULL
		|			ИЛИ НеКонтролироватьНаличиеИнвестПрофиляДоДаты.Значение = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ НеКонтролироватьНаличиеИнвестПрофиляДоДаты.Значение < ВЫБОР
		|				КОГДА _Стратегии.ДатаПолученияДокументовОСмерти МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ТОГДА _Стратегии.ДатаПолученияДокументовОСмерти
		|				КОГДА _Стратегии.ДатаРасторжения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					ТОГДА _Стратегии.ДатаРасторжения
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""По стратегии [ИдентификаторСтратегии] не заполнено поле 'Доходность стратегии'"" КАК ШаблонСообщения,
		|	SR_0420431_Q_R1_P1.ID_strategTaxis КАК ИдентификаторСтратегии
		|ПОМЕСТИТЬ _КонтрольДоходностиСтандартнойСтратегии
		|ИЗ
		|	SR_0420431_Q_R1_P1 КАК SR_0420431_Q_R1_P1
		|ГДЕ
		|	SR_0420431_Q_R1_P1.KolichestvoKlientov > 0
		|	И SR_0420431_Q_R1_P1.DoxInStr ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДатыОкончанияЛицензииДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыОкончанияЛицензииДУ.Лицензия КАК Лицензия,
		|	""По договору '[СчетДоверительногоУправления]' обнаружено окончание лицензии '[Лицензия]' в периоде отчета. Обратитесь к разработчикам."" КАК ШаблонСообщения
		|ПОМЕСТИТЬ _КонтрольДатыОкончанияЛицензии
		|ИЗ
		|	_ДатыОкончанияЛицензииДУ КАК _ДатыОкончанияЛицензииДУ
		|ГДЕ
		|	НЕ _ДатыОкончанияЛицензииДУ.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					СДУПоказатьИзъятиеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					_СДУПоказатьИзъятиеСЧА КАК СДУПоказатьИзъятиеСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Стратегии.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
		|	_Стратегии.ПоступлениеДС КАК ПоступлениеДС,
		|	_Стратегии.ПоступлениеЦБ КАК ПоступлениеЦБ,
		|	_Стратегии.ПоступлениеПрочие КАК ПоступлениеПрочие,
		|	_Стратегии.ИзъятиеДС КАК ИзъятиеДС,
		|	_Стратегии.ИзъятиеЦБ КАК ИзъятиеЦБ,
		|	_Стратегии.ИзъятиеПрочие КАК ИзъятиеПрочие
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|ГДЕ
		|	(_Стратегии.ПоступлениеПрочие <> 0
		|			ИЛИ _Стратегии.ИзъятиеПрочие <> 0)";
	
	#КонецОбласти	

	Запрос.Выполнить();
	
КонецПроцедуры

Функция ОКУД0420431_ПолучитьКоличествоКлиентов(Параметры, Запрос) Экспорт
	
	ОКУД0420431_ВыполнитьЗапросы(Параметры, Запрос, Ложь);
	Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("SR_0420431_Q_R1_P3").ПолучитьДанные().Выгрузить().Итог("KolichestvoKlientov");
	
КонецФункции

Функция ОКУД0420431_ПолучитьСтоимостьПортфелей(Параметры, Запрос) Экспорт
	
	ОКУД0420431_ВыполнитьЗапросы(Параметры, Запрос, Ложь);
	Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("SR_0420431_Q_R1_P3").ПолучитьДанные().Выгрузить().Итог("SovObPortfGr");
	
КонецФункции

#КонецОбласти

#Область ОКУД0420516

Процедура ПоместитьВЗапросРеквизитыАудитора(Запрос, Отказ) Экспорт
	
	//NB! При изменении реквизитов доработать оповещение ВыполнитьЗапросКДаннымДляПроверкиРеквизитовАудитора
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Договоры.Ссылка КАК Договор,
		|	РеквизитыАудитора.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
		|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ОГРН,
		|	РеквизитыАудитора.ИНН КАК ИНН,
		|	РеквизитыСРО.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеСРО,
		|	ГосударственныйРеестрСРО.НомерВРеестре КАК НомерСРО,
		|	РеестрАудиторов.НомерВРеестре КАК НомерАудитораВРеестреСРО
		|ПОМЕСТИТЬ _РеквизитыАудитора
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = Договоры.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыАудитора
		|		ПО Договоры.Контрагент = РеквизитыАудитора.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВхожденияВРеестры.СрезПоследних(&ДатаОкончания, ВидРеестра = ЗНАЧЕНИЕ(Справочник.ВидыРеестров.СРОАудиторов)) КАК РеестрАудиторов
		|		ПО (РеестрАудиторов.ЮрФизЛицо = Договоры.Контрагент)
		|			И (НЕ РеестрАудиторов.ИсключенИзРеестра)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВхожденияВРеестры.СрезПоследних(&ДатаОкончания, ВидРеестра = ЗНАЧЕНИЕ(Справочник.ВидыРеестров.ГосударственныйРеестрСаморегулируемыхОрганизацийАудиторов)) КАК ГосударственныйРеестрСРО
		|		ПО (ГосударственныйРеестрСРО.ЮрФизЛицо = РеестрАудиторов.ДержательРеестра)
		|			И (НЕ ГосударственныйРеестрСРО.ИсключенИзРеестра)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСРО
		|		ПО (РеестрАудиторов.ДержательРеестра = РеквизитыСРО.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)) КАК ДокументыЮридическихЛицСрезПоследних
		|		ПО Договоры.Контрагент = ДокументыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			И (ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &ДатаОкончания)
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОказанияАудиторскихУслуг)
		|	И Договоры.Организация = &Организация
		|	И Договоры.ДатаЗаключения <= &ДатаОкончания
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ДатаНачала)
		|	И НЕ Договоры.ПометкаУдаления";
	
	Запрос.Выполнить();
	
КонецПроцедуры
	
Процедура ДобавитьДанныеДляПроверкиРеквизитовАудитора(Источник) Экспорт
	
	Если Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("ПроверкаРеквизитовАудитора") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеДанные = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(ТекущаяДата(), -1)); //на сдачу отчёта 15 дней, покажем договора закрытые за последний месяц, на всякий случай
	Запрос.УстановитьПараметр("ДатаОкончания",		ТекущаяДата());
	
	Запрос.УстановитьПараметр("ОтборПоЮрФизЛицуИспользование",	Ложь);
	Запрос.УстановитьПараметр("ОтборПоЮрФизЛицуЗначение",		Новый Массив);
	
	Запрос.УстановитьПараметр("ЕстьОрганизация",				 Источник.Метаданные().Измерения.Найти("Организация") <> Неопределено);
	Запрос.УстановитьПараметр("ОтборПоОрганизацииЗначение",		 Новый Массив);
	Запрос.УстановитьПараметр("ОтборПоОрганизацииИспользование", Ложь);
	
#Область АудиторыИСРО
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Договоры.Организация КАК Организация,
		|	Договоры.Контрагент КАК Аудитор,
		|	РеестрАудиторов.ДержательРеестра КАК СРО
		|ПОМЕСТИТЬ _АудиторыИСРО
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаОкончания, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = Договоры.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВхожденияВРеестры.СрезПоследних(&ДатаОкончания, ВидРеестра = ЗНАЧЕНИЕ(Справочник.ВидыРеестров.СРОАудиторов)) КАК РеестрАудиторов
		|		ПО (РеестрАудиторов.ЮрФизЛицо = Договоры.Контрагент)
		|			И (НЕ РеестрАудиторов.ИсключенИзРеестра)
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОказанияАудиторскихУслуг)
		|	И (&ЕстьОрганизация = ЛОЖЬ
		|			ИЛИ &ОтборПоОрганизацииИспользование = ЛОЖЬ
		|			ИЛИ Договоры.Организация В (&ОтборПоОрганизацииЗначение))
		|	И Договоры.ДатаЗаключения <= &ДатаОкончания
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ДатаНачала)
		|	И НЕ Договоры.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_АудиторыИСРО.Организация КАК Организация,
		|	ЮрФизЛица.Ссылка КАК ЮрФизЛицо,
		|	ИСТИНА КАК ЭтоАудитор,
		|	ЗНАЧЕНИЕ(Справочник.ВидыРеестров.СРОАудиторов) КАК ВидРеестра,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации) КАК ВидДокумента,
		|	ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.Языки.Русский) КАК Язык,
		|	ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес) КАК ВидКонтактнойИнформации
		|ПОМЕСТИТЬ _Отборы
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _АудиторыИСРО КАК _АудиторыИСРО
		|		ПО ЮрФизЛица.Ссылка = _АудиторыИСРО.Аудитор
		|ГДЕ
		|	(&ОтборПоЮрФизЛицуИспользование = ЛОЖЬ
		|			ИЛИ ЮрФизЛица.Ссылка В (&ОтборПоЮрФизЛицуЗначение))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_АудиторыИСРО.Организация,
		|	ЮрФизЛица.Ссылка,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.ВидыРеестров.ГосударственныйРеестрСаморегулируемыхОрганизацийАудиторов),
		|	НЕОПРЕДЕЛЕНО,
		|	ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний),
		|	ЗНАЧЕНИЕ(Справочник.Языки.Русский),
		|	ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _АудиторыИСРО КАК _АудиторыИСРО
		|		ПО ЮрФизЛица.Ссылка = _АудиторыИСРО.СРО
		|ГДЕ
		|	(&ОтборПоЮрФизЛицуИспользование = ЛОЖЬ
		|			ИЛИ ЮрФизЛица.Ссылка В (&ОтборПоЮрФизЛицуЗначение))";

	Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		Если ЭлементОтбора.Имя = "ЮрФизЛицо" Тогда
			Запрос.УстановитьПараметр("ОтборПоЮрФизЛицуИспользование",	ЭлементОтбора.Использование);
			Запрос.УстановитьПараметр("ОтборПоЮрФизЛицуЗначение",		ЭлементОтбора.Значение);
		КонецЕсли;
		
		Если ЭлементОтбора.Имя = "Организация" Тогда
			Запрос.УстановитьПараметр("ОтборПоОрганизацииИспользование",	ЭлементОтбора.Использование);
			Запрос.УстановитьПараметр("ОтборПоОрганизацииЗначение",			ЭлементОтбора.Значение);
		КонецЕсли;
		
		Если ЭлементОтбора.Имя = "Регистратор" Тогда
			Запрос.УстановитьПараметр("ОтборПоОрганизацииИспользование",	ЭлементОтбора.Использование);
			Запрос.УстановитьПараметр("ОтборПоОрганизацииЗначение",			ЭлементОтбора.Значение.Организация);
		КонецЕсли;
		
	КонецЦикла;
	
#КонецОбласти	

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыполнитьЗапросКДаннымДляПроверкиРеквизитовАудитора(Источник, Запрос);
		
		ДополнительныеДанные.Вставить("Отборы",			Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_Отборы").ПолучитьДанные().Выгрузить());
		ДополнительныеДанные.Вставить("ДанныеДоЗаписи", Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_ДанныеРегистра").ПолучитьДанные().Выгрузить());
		
		Источник.ЗаписьИсторииДанных.ДобавитьДополнительныеДанные("ПроверкаРеквизитовАудитора", ДополнительныеДанные, "ПроверкаРеквизитовАудитора"); 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРезультатПроверкиРеквизитовАудитора(Источник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Источник.ЗаписьИсторииДанных.ДополнительныеДанные.ПроверкаРеквизитовАудитора.Отборы, "_Отборы", Запрос);
	
	ВыполнитьЗапросКДаннымДляПроверкиРеквизитовАудитора(Источник, Запрос);
	
	ДанныеРегистра = Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_ДанныеРегистра").ПолучитьДанные().Выгрузить();
	
	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из ДанныеРегистра.Колонки Цикл
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ДанныеРегистра.Колонки.Вставить(0, "ВидИзменения");
	ДанныеРегистра.ЗаполнитьЗначения(1, "ВидИзменения");
	
	Для Каждого СтрокаДанныхРегистраДоЗаписи Из Источник.ЗаписьИсторииДанных.ДополнительныеДанные.ПроверкаРеквизитовАудитора.ДанныеДоЗаписи Цикл
		СтрокаДанныхРегистра = ДанныеРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанныхРегистра, СтрокаДанныхРегистраДоЗаписи); 
		СтрокаДанныхРегистра.ВидИзменения = -1;
	КонецЦикла;
	
	ДанныеРегистра.Свернуть(СтрСоединить(МассивКолонок, ","), "ВидИзменения");
	
	МассивСтрокДляУдаления = Новый Массив;
	МассивОрганизаций = Новый Массив;
	
	Для Каждого СтрокаДанныхРегистра Из ДанныеРегистра Цикл
		Если СтрокаДанныхРегистра.ВидИзменения = 0 Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаДанныхРегистра);
		Иначе
			СтрокаДанныхРегистра.ВидИзменения = ?(СтрокаДанныхРегистра.ВидИзменения = 1, "Добавлена запись", "Удалена запись");
			Если МассивОрганизаций.Найти(СтрокаДанныхРегистра.Организация) = Неопределено Тогда
				МассивОрганизаций.Добавить(СтрокаДанныхРегистра.Организация);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого СтрокаДанныхРегистра Из МассивСтрокДляУдаления Цикл
		ДанныеРегистра.Удалить(СтрокаДанныхРегистра);
	КонецЦикла;	
	
	РезультатПроверки = Новый Массив;
	
	Если ДанныеРегистра.Количество() > 0 Тогда
		
		Для Каждого Организация Из МассивОрганизаций Цикл
			РезультатПроверкиПоОрганизации = Новый Структура;
			РезультатПроверкиПоОрганизации.Вставить("Организация",	Организация);
			РезультатПроверкиПоОрганизации.Вставить("ТелоПисьма",	ПолучитьОтчетПроверкиРеквизитовАудитора(Источник, ДанныеРегистра.Скопировать(РезультатПроверкиПоОрганизации)));
			РезультатПроверкиПоОрганизации.Вставить("Тема",			СтрШаблон("Изменились реквизиты аудитора (или СРО аудитора) по действующим договорам %1", Организация));
			
			РезультатПроверки.Добавить(РезультатПроверкиПоОрганизации);
		КонецЦикла;
		
	КонецЕсли;
	
	Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Удалить("ПроверкаРеквизитовАудитора");

	Возврат РезультатПроверки;
	
КонецФункции

Функция ПолучитьОтчетПроверкиРеквизитовАудитора(Источник, ДанныеРегистра)
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(, , , Новый ТабличныйДокумент); 
	
	СтруктураТаблицы = Новый Структура("ВидИзменения, Период", "Вид изменения", "Период");
	
	Для Каждого Измерение Из Источник.Метаданные().Измерения Цикл
		Если ДанныеРегистра.Колонки.Найти(Измерение.Имя) <> Неопределено Тогда
			СтруктураТаблицы.Вставить(Измерение.Имя, Измерение.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Ресурс Из Источник.Метаданные().Ресурсы Цикл
		Если ДанныеРегистра.Колонки.Найти(Ресурс.Имя) <> Неопределено Тогда
			СтруктураТаблицы.Вставить(Ресурс.Имя, Ресурс.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из Источник.Метаданные().Реквизиты Цикл
		Если ДанныеРегистра.Колонки.Найти(Реквизит.Имя) <> Неопределено Тогда
			СтруктураТаблицы.Вставить(Реквизит.Имя, Реквизит.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, ДанныеРегистра, СтруктураТаблицы, "Изменились данные регистра " + Источник.Метаданные().Синоним,, Истина); 
	РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
	
	ПараметрыВывода.ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
	
	ТелоПисьма = Новый ТекстовыйДокумент;
	ТелоПисьма.Прочитать(ИмяВременногоФайла);
	
	ТекстПисьма = ТелоПисьма.ПолучитьТекст();
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ТекстПисьма;
	
КонецФункции

Процедура ВыполнитьЗапросКДаннымДляПроверкиРеквизитовАудитора(Источник, Запрос)
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ВхожденияВРеестры") Тогда 
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВхожденияВРеестры.Период КАК Период,
			|	_Отборы.Организация КАК Организация,
			|	ВхожденияВРеестры.ЮрФизЛицо КАК ЮрФизЛицо,
			|	ВхожденияВРеестры.ВидРеестра КАК ВидРеестра,
			|	ВхожденияВРеестры.ИсключенИзРеестра КАК ИсключенИзРеестра,
			|	ВхожденияВРеестры.ДержательРеестра КАК ДержательРеестра,
			|	ВхожденияВРеестры.НомерВРеестре КАК НомерВРеестре
			|ПОМЕСТИТЬ _ДанныеРегистра
			|ИЗ
			|	РегистрСведений.ВхожденияВРеестры КАК ВхожденияВРеестры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Отборы КАК _Отборы
			|		ПО ВхожденияВРеестры.ЮрФизЛицо = _Отборы.ЮрФизЛицо
			|			И ВхожденияВРеестры.ВидРеестра = _Отборы.ВидРеестра";
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДокументыЮридическихЛиц") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументыЮридическихЛиц.Период КАК Период,
			|	_Отборы.Организация КАК Организация,
			|	ДокументыЮридическихЛиц.Подразделение КАК Подразделение,
			|	ДокументыЮридическихЛиц.Язык КАК Язык,
			|	ДокументыЮридическихЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
			|	ДокументыЮридическихЛиц.Вид КАК Вид,
			|	ДокументыЮридическихЛиц.ДействуетПо КАК ДействуетПо,
			|	ДокументыЮридическихЛиц.Номер КАК Номер
			|ПОМЕСТИТЬ _ДанныеРегистра
			|ИЗ
			|	РегистрСведений.ДокументыЮридическихЛиц КАК ДокументыЮридическихЛиц
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Отборы КАК _Отборы
			|		ПО ДокументыЮридическихЛиц.ЮрФизЛицо = _Отборы.ЮрФизЛицо
			|			И ДокументыЮридическихЛиц.Вид = _Отборы.ВидДокумента
			|			И _Отборы.ЭтоАудитор = ИСТИНА";
		
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛиц") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛиц.Период КАК Период,
			|	_Отборы.Организация КАК Организация,
			|	РеквизитыЮридическихЛиц.Подразделение КАК Подразделение,
			|	РеквизитыЮридическихЛиц.Язык КАК Язык,
			|	РеквизитыЮридическихЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
			|	РеквизитыЮридическихЛиц.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
			|	РеквизитыЮридическихЛиц.ИНН КАК ИНН
			|ПОМЕСТИТЬ _ДанныеРегистра
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Отборы КАК _Отборы
			|		ПО РеквизитыЮридическихЛиц.ЮрФизЛицо = _Отборы.ЮрФизЛицо
			|			И РеквизитыЮридическихЛиц.Подразделение = _Отборы.Подразделение
			|			И РеквизитыЮридическихЛиц.Язык = _Отборы.Язык";
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛицАнкетные") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛицАнкетные.Период КАК Период,
			|	РеквизитыЮридическихЛицАнкетные.Организация КАК Организация,
			|	РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо КАК ЮрФизЛицо,
			|	РеквизитыЮридическихЛицАнкетные.Язык КАК Язык,
			|	РеквизитыЮридическихЛицАнкетные.ЮридическийАдрес КАК ЮридическийАдрес
			|ПОМЕСТИТЬ _ДанныеРегистра
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Отборы КАК _Отборы
			|		ПО РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо = _Отборы.ЮрФизЛицо
			|			И РеквизитыЮридическихЛицАнкетные.Организация = _Отборы.Организация
			|			И _Отборы.ЭтоАудитор = ИСТИНА";
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область СООУРКИ028

// Возвращает текст основного запроса для формы СООУРКИ028
//
//	Параметры:
//		- ДатаОкончания - дата конца периода отчета
//
Функция ПолучитьТекстЗапроса_СООУРКИ028(ДатаОкончания) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СтоимостьСобственныхСредствИзБухгалтерии КАК ВеличинаСобственныхСредств
		|ПОМЕСТИТЬ ВТ_ВеличинаСобственныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ ВТ_СчетаДоверительногоУправления
		|ИЗ
		|	_Клиенты КАК СчетаДоверительногоУправления";
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;
	
	ТекстЗапросаДатСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьТекстЗапросаПоДатамРегламентныхДействий(
			Новый Структура("ВидДействия, ДополнитьРабочимиДнями, СвойПериодДляКаждогоСчетаДУ, УдалитьВсеВременныеТаблицы, ИмяТаблицыСчетовДУ, ИмяТаблицыДатДействияЗаПериод", 
				"СЧА", Ложь, Ложь, Истина, "ВТ_СчетаДоверительногоУправления", "ВТ_ДатыСЧА"));
			
	ТекстЗапросаДатСЧА = СтрЗаменить(ТекстЗапросаДатСЧА,"&ДатаПо", "КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)");
	ТекстЗапросаДатСЧА = СтрЗаменить(ТекстЗапросаДатСЧА,"&ДатаС", "НАЧАЛОПЕРИОДА(&ПоследнийРабочийДень, ДЕНЬ)");
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаДатСЧА +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаДоверительногоУправления.СчетДоверительногоУправления) КАК КоличествоПИФАИФ,
		|	СУММА(ФинансовыеПоказатели.Значение) КАК СтоимостьЧистыхАктивовИФ
		|ПОМЕСТИТЬ ВТ_СтоимостьЧистыхАктивовИФ
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, ) КАК КлиентыДУПИФ
		|		ПО СчетаДоверительногоУправления.СчетДоверительногоУправления = КлиентыДУПИФ.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ДатыСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			МАКСИМУМ(ВТ_ДатыСЧА.Дата) КАК Дата
		|		ИЗ
		|			ВТ_ДатыСЧА КАК ВТ_ДатыСЧА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ДатыСЧА.СчетДоверительногоУправления) КАК ВТ_ДатыСЧА
		|		ПО СчетаДоверительногоУправления.СчетДоверительногоУправления = ВТ_ДатыСЧА.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ВТ_ДатыСЧА.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ВТ_ДатыСЧА.Дата = ФинансовыеПоказатели.Период)
		|ГДЕ
		|	(СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов))";
	
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;
	
	Если ДатаОкончания >= Дата(2021,1,1) Тогда //Приказ Минфина России от 01.12.2020 N 293н #368918 
		
		ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаДоверительногоУправления.СчетДоверительногоУправления) КАК КоличествоДоговоровДУ1,
			|	СУММА(ФинансовыеПоказатели.Значение) КАК СтоимостьПенсионныхРезервовНПФ
			|ПОМЕСТИТЬ ВТ_СтоимостьПенсионныхРезервовНПФ
			|ИЗ
			|	ВТ_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ВТ_ДатыСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			МАКСИМУМ(ВТ_ДатыСЧА.Дата) КАК Дата
			|		ИЗ
			|			ВТ_ДатыСЧА КАК ВТ_ДатыСЧА
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ВТ_ДатыСЧА.СчетДоверительногоУправления) КАК ВТ_ДатыСЧА
			|		ПО СчетаДоверительногоУправления.СчетДоверительногоУправления = ВТ_ДатыСЧА.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|		ПО (ВТ_ДатыСЧА.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики)
			|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
			|			И (ВТ_ДатыСЧА.Дата = ФинансовыеПоказатели.Период)
			|ГДЕ
			|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)";
			
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаДоверительногоУправления.СчетДоверительногоУправления) КАК КоличествоДоговоровДУ1,
			|	СУММА(ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Сумма, 0)) КАК СтоимостьПенсионныхРезервовНПФ
			|ПОМЕСТИТЬ ВТ_СтоимостьПенсионныхРезервовНПФ
			|ИЗ
			|	ВТ_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _РСАНаКонецБаланс КАК ЕдиныйБухгалтерскийУчетОстатки
			|		ПО (ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления = СчетаДоверительногоУправления.СчетДоверительногоУправления)
			|ГДЕ
			|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаДоверительногоУправления.СчетДоверительногоУправления) КАК КоличествоДоговоровДУ2,
		|	СУММА(ФинансовыеПоказатели.Значение) КАК СтоимостьЧистыхАктивовПоДоговорамСНПФ
		|ПОМЕСТИТЬ ВТ_СтоимостьЧистыхАктивовПоДоговорамСНПФ
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ДатыСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			МАКСИМУМ(ВТ_ДатыСЧА.Дата) КАК Дата
		|		ИЗ
		|			ВТ_ДатыСЧА КАК ВТ_ДатыСЧА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ДатыСЧА.СчетДоверительногоУправления) КАК ВТ_ДатыСЧА
		|		ПО СчетаДоверительногоУправления.СчетДоверительногоУправления = ВТ_ДатыСЧА.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ВТ_ДатыСЧА.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ВТ_ДатыСЧА.Дата = ФинансовыеПоказатели.Период)
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ФинансовыеПоказатели.Значение) КАК СтоимостьЧистыхАктивовПоДоговорамСПФР
		|ПОМЕСТИТЬ ВТ_СтоимостьЧистыхАктивовПоДоговорамСПФР
		|ИЗ
		|	ВТ_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ДатыСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			МАКСИМУМ(ВТ_ДатыСЧА.Дата) КАК Дата
		|		ИЗ
		|			ВТ_ДатыСЧА КАК ВТ_ДатыСЧА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ДатыСЧА.СчетДоверительногоУправления) КАК ВТ_ДатыСЧА
		|		ПО СчетаДоверительногоУправления.СчетДоверительногоУправления = ВТ_ДатыСЧА.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ВТ_ДатыСЧА.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ВТ_ДатыСЧА.Дата = ФинансовыеПоказатели.Период)
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДатаОкончания КАК ДатаПредставления,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК УправляющаяКомпания,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННУправляющейКомпании,
		|	ВЫРАЗИТЬ(ВТ_ВеличинаСобственныхСредств.ВеличинаСобственныхСредств / &Коэффициент КАК ЧИСЛО(19, 2)) КАК ВеличинаСобственныхСредств,
		|	ВТ_СтоимостьЧистыхАктивовИФ.КоличествоПИФАИФ КАК КоличествоПИФАИФ,
		|	ВТ_СтоимостьПенсионныхРезервовНПФ.КоличествоДоговоровДУ1 КАК КоличествоДоговоровДУ1,
		|	ВТ_СтоимостьЧистыхАктивовПоДоговорамСНПФ.КоличествоДоговоровДУ2 КАК КоличествоДоговоровДУ2,
		|	ВЫРАЗИТЬ(ВТ_СтоимостьЧистыхАктивовИФ.СтоимостьЧистыхАктивовИФ / &Коэффициент КАК ЧИСЛО(19, 2)) КАК СтоимостьЧистыхАктивовИФ,
		|	ВЫРАЗИТЬ(ВТ_СтоимостьПенсионныхРезервовНПФ.СтоимостьПенсионныхРезервовНПФ / &Коэффициент КАК ЧИСЛО(19, 2)) КАК СтоимостьПенсионныхРезервовНПФ,
		|	ВЫРАЗИТЬ(ВТ_СтоимостьЧистыхАктивовПоДоговорамСНПФ.СтоимостьЧистыхАктивовПоДоговорамСНПФ / &Коэффициент КАК ЧИСЛО(19, 2)) КАК СтоимостьЧистыхАктивовПоДоговорамСНПФ,
		|	ВЫРАЗИТЬ(ВТ_СтоимостьЧистыхАктивовПоДоговорамСПФР.СтоимостьЧистыхАктивовПоДоговорамСПФР / &Коэффициент КАК ЧИСЛО(19, 2)) КАК СтоимостьЧистыхАктивовПоДоговорамСПФР
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|				&ДатаОкончания,
		|				ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)
		|					И НЕ РодительскоеЮридическоеЛицо В (&ИсключаемыеГоловныеОрганизации)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Организации.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Организации.ЮрФизЛицо) = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо),
		|	ВТ_ВеличинаСобственныхСредств КАК ВТ_ВеличинаСобственныхСредств,
		|	ВТ_СтоимостьЧистыхАктивовИФ КАК ВТ_СтоимостьЧистыхАктивовИФ,
		|	ВТ_СтоимостьПенсионныхРезервовНПФ КАК ВТ_СтоимостьПенсионныхРезервовНПФ,
		|	ВТ_СтоимостьЧистыхАктивовПоДоговорамСНПФ КАК ВТ_СтоимостьЧистыхАктивовПоДоговорамСНПФ,
		|	ВТ_СтоимостьЧистыхАктивовПоДоговорамСПФР КАК ВТ_СтоимостьЧистыхАктивовПоДоговорамСПФР
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
	Возврат ТекстЗапроса;
	
КонецФункции
	
#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

Функция ЗаполнитьТаблицуКодыКлиентовПоОКАТО(Параметры, МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаОкончания", Параметры.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация"	 , Параметры.Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	"""" КАК КодОКАТО,
		|	РеквизитыФизическихЛицСрезПоследних.АдресРегистрацииФИАС КАК АдресРегистрацииФИАС
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыФизическихЛицСрезПоследних.РезидентПо173ФЗ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо,
		|	РеквизитыЮридическихЛицСрезПоследних.КодПоОКАТО,
		|	""""
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ";
	
	КодыКлиентовПоОКАТО = Запрос.Выполнить().Выгрузить();
	КодыКлиентовПоОКАТО.Колонки.Добавить("КодСубъекта", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(2)));
	
	Для Каждого СтрокаТаблицы Из КодыКлиентовПоОКАТО Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.АдресРегистрацииФИАС) Тогда
			ИндексНачала = СтрНайти(СтрокаТаблицы.АдресРегистрацииФИАС, "<КодСубъектаРФ>");
			Если ИндексНачала > 0 Тогда
				СтрокаТаблицы.КодСубъекта = Сред(СтрокаТаблицы.АдресРегистрацииФИАС, ИндексНачала + 15, 2);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(КодыКлиентовПоОКАТО, "_КодыКлиентовПоОКАТО", Запрос,, "ЮрФизЛицо, КодОКАТО, КодСубъекта");
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ПолучитьТаблицуИзОбщегоМакета("СоответствиеКодовСубъектовИКодовОКАТО"), "_СоотвествиеКодов", Запрос,, "КодСубъекта, КодОКАТО");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыКлиентовПоОКАТО.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА КодыСубъектов.КодОКАТО ЕСТЬ НЕ NULL 
		|				И ПОДСТРОКА(КодыСубъектов.КодОКАТО, 3, 1) = """"
		|			ТОГДА КодыСубъектов.КодОКАТО + ""00""
		|		КОГДА КодыСубъектов.КодОКАТО ЕСТЬ НЕ NULL 
		|			ТОГДА КодыСубъектов.КодОКАТО
		|		КОГДА КодыОКАТО4.КодОКАТО ЕСТЬ НЕ NULL 
		|			ТОГДА КодыОКАТО4.КодОКАТО
		|		КОГДА КодыОКАТО2.КодОКАТО ЕСТЬ НЕ NULL 
		|			ТОГДА КодыОКАТО2.КодОКАТО + ""00""
		|	КОНЕЦ КАК ОКАТО
		|ПОМЕСТИТЬ КодыКлиентовПоОКАТО
		|ИЗ
		|	_КодыКлиентовПоОКАТО КАК _КодыКлиентовПоОКАТО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СоотвествиеКодов КАК КодыСубъектов
		|		ПО _КодыКлиентовПоОКАТО.КодСубъекта = КодыСубъектов.КодСубъекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СоотвествиеКодов КАК КодыОКАТО4
		|		ПО (ПОДСТРОКА(_КодыКлиентовПоОКАТО.КодОКАТО, 1, 4) = КодыОКАТО4.КодОКАТО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СоотвествиеКодов КАК КодыОКАТО2
		|		ПО (ПОДСТРОКА(_КодыКлиентовПоОКАТО.КодОКАТО, 1, 2) = КодыОКАТО2.КодОКАТО)";
	
	Запрос.Выполнить();

КонецФункции

//Возвращает массив некорректных головных организаций, например бывший Траст
Функция ПолучитьИсключаемыеГоловныеОрганизации() Экспорт
	
	ИсключаемыеГоловныеОрганизации = Новый Массив;
	ИсключаемыеГоловныеОрганизации.Добавить(Справочники.ЮрФизЛица.ПустаяСсылка());
	ИсключаемыеГоловныеОрганизации.Добавить(Справочники.ЮрФизЛица.ПолучитьСсылку(Новый УникальныйИдентификатор("e140844a-3de4-11e6-bee9-000c2958e1dd")));

	Возврат ИсключаемыеГоловныеОрганизации;
	
КонецФункции

Функция ПолучитьТаблицуИзОбщегоМакета(ИмяМакета, ПараметрыПоиска = Неопределено, Сортировка = Неопределено)
	
	Таблица = Новый ТаблицаЗначений;
	Макет	= ПолучитьОбщийМакет(ИмяМакета);
	Отказ	= Ложь;
	
	КолонкиМакета = Новый Соответствие;
	Для НомерКолонки = 1 По Макет.ШиринаТаблицы Цикл
		ПараметрыКолонки = СтрРазделить(СокрЛП(Макет.Область(1, НомерКолонки, 1, НомерКолонки).Текст), "()", Ложь);
		
		КолонкиМакета.Вставить(ПараметрыКолонки[0], НомерКолонки);
		Если ПараметрыКолонки.Количество() = 1 Тогда
			Таблица.Колонки.Добавить(ПараметрыКолонки[0], Новый ОписаниеТипов("Строка"));
		ИначеЕсли ПараметрыКолонки.Количество() = 2 Тогда
			Таблица.Колонки.Добавить(ПараметрыКолонки[0], Новый ОписаниеТипов(ПараметрыКолонки[1]));
		ИначеЕсли ПараметрыКолонки.Количество() = 3 И ПараметрыКолонки[1] = "Строка" Тогда
			Таблица.Колонки.Добавить(ПараметрыКолонки[0], Новый ОписаниеТипов(ПараметрыКолонки[1], Новый КвалификаторыСтроки(ПараметрыКолонки[2])));	
		КонецЕсли;
		
	КонецЦикла;
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		НоваяСтрока = Таблица.Добавить();
		Для Каждого КолонкаМакета Из КолонкиМакета Цикл
			Значение = СокрЛП(Макет.Область(НомерСтроки, КолонкаМакета.Значение, НомерСтроки, КолонкаМакета.Значение).Текст);
			
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(НоваяСтрока[КолонкаМакета.Ключ])) Тогда
				Если ЗначениеЗаполнено(Значение) Тогда
					Попытка 
						УникальныйИдентификатор = Новый УникальныйИдентификатор(Значение);
						НоваяСтрока[КолонкаМакета.Ключ]	= ОбщегоНазначения.МенеджерОбъектаПоСсылке(НоваяСтрока[КолонкаМакета.Ключ]).ПолучитьСсылку(УникальныйИдентификатор);
					Исключение
						НоваяСтрока[КолонкаМакета.Ключ] = ОбщегоНазначения.ПолучитьИменованныйОбъект(Значение);
					КонецПопытки;
				КонецЕсли;
			ИначеЕсли ТипЗнч(НоваяСтрока[КолонкаМакета.Ключ]) = Тип("Тип") Тогда
				НоваяСтрока[КолонкаМакета.Ключ]	= Тип(Значение);
			Иначе
				НоваяСтрока[КолонкаМакета.Ключ]	= Значение;
			КонецЕсли;
				
			Если ТипЗнч(НоваяСтрока[КолонкаМакета.Ключ]) = Тип("Строка") И НоваяСтрока[КолонкаМакета.Ключ] <> Значение Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Неверно указана ширина колонки %1 в макете %2, не поместилось значение %3, обратитесь к программисту.", КолонкаМакета.Ключ, ИмяМакета, Значение),,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Если ТипЗнч(ПараметрыПоиска) = Тип("Структура") Тогда
		Результат = Таблица.Скопировать(ПараметрыПоиска);
	Иначе
		Результат = Таблица;
	КонецЕсли;
	
	Если Сортировка <> Неопределено Тогда
		Результат.Сортировать(Сортировка);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
