
Функция ПолучитьГруппуЗапретаРедактирования(ПолноеИмяОбъектаМД, ТолькоПоВидуУчета = Неопределено) Экспорт
	
	// В ПРОЦЕССЕ РАЗРАБОТКИ. НЕ УДАЛЯТЬ
	
	//Если      ПолноеИмяОбъектаМД = "РегистрНакопления.БухПартииЦенныхБумаг" Тогда
	//	ТолькоПоВидуУчета = Неопределено;
	//	Возврат Перечисления.ГруппыЗапретаРедактирования.ПартииЦенныхБумаг;
	//	
	//ИначеЕсли СтрНачинаетсяС(ПолноеИмяОбъектаМД, "РегистрНакопления.") Тогда
	//	ТолькоПоВидуУчета = Неопределено;
	//	Возврат Перечисления.ГруппыЗапретаРедактирования.ОперацииБэкОфиса;
	//	
	//ИначеЕсли ПолноеИмяОбъектаМД = "Документ.ПереоценкаЦенныхБумаг" Тогда
	//	ТолькоПоВидуУчета = Неопределено;
	//	Возврат Перечисления.ГруппыЗапретаРедактирования.ПартииЦенныхБумаг;
	//	
	//ИначеЕсли ПолноеИмяОбъектаМД = "Документ.РаспределениеАктивовЕПС"
	//		Или ПолноеИмяОбъектаМД = "Документ.РегистрацияСтоимостиЦенныхБумаг"
	//		Или ПолноеИмяОбъектаМД = "Документ.ПоручениеНаПереоценку"
	//Тогда
	//	ТолькоПоВидуУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	//	Возврат Перечисления.ГруппыЗапретаРедактирования.ПартииЦенныхБумаг;
	//	
	//ИначеЕсли СтрНачинаетсяС(ПолноеИмяОбъектаМД, "РегистрБухгалтерии.") Тогда
	//	ТолькоПоВидуУчета = Перечисления.ВидыУчета[Сред(ПолноеИмяОбъектаМД, 20)];
	//	Возврат Перечисления.ГруппыЗапретаРедактирования.ОперацииБухгалтерии;
	//	
	//ИначеЕсли СтрНачинаетсяС(ПолноеИмяОбъектаМД, "Документ.") Тогда
	//	ТолькоПоВидуУчета = Неопределено;
	//	Если Метаданные.Документы(ПолноеИмяОбъектаМД).Реквизиты.Найти("ВидУчета") <> Неопределено Тогда
	//		Возврат Перечисления.ГруппыЗапретаРедактирования.ОперацииБухгалтерии;
	//	Иначе
	//		Возврат Перечисления.ГруппыЗапретаРедактирования.ОперацииБэкОфиса;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//ВызватьИсключение "Не удалось определить группу запрета редактирования для объекта '" + ПолноеИмяОбъектаМД + "'";
	
КонецФункции // ПолучитьГруппуЗапретаРедактирования
