
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр = "Таблицы EXCEL (*.xls)|*.xls";

	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьДанныеИзФайлаExcel(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ИмпортироватьДанныеИзФайлаExcel");
	Попытка
		ВыполнитьИмпортДанныхИзФайлаExcel(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортДанныхИзФайлаExcel(ПараметрыСессии)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Предупреждение("Не все обязательные атрибуты заполнены",,"Внимание!")	;
		ПараметрыСессии.ТекстОшибки = "Не все обязательные атрибуты заполнены";
		Возврат;
	КонецЕсли;

	Если ЭтаФорма.Объект.ИмпортируемыеДанные.Количество() > 0
		И Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		ПараметрыСессии.ТекстОшибки = "Отменено пользователем";
		Возврат;
	КонецЕсли;

	ЭтаФорма.Объект.ИмпортируемыеДанные.Очистить();
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Объект.ПутьКФайлу);
		Excel.Sheets(1).Select();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ПараметрыСессии.ТекстОшибки = "Ошибка открытия файла Excel";
		Возврат;
	КонецПопытки;

	НомСтр = 5;
	
	Пока НомСтр < 10000 Цикл
		// Номер счета указан всегда, в отличие от наименования банка
		Если Не ЗначениеЗаполнено(Excel.Cells(НомСтр, 4).Value) Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = ЭтаФорма.Объект.ИмпортируемыеДанные.Добавить();
		НоваяСтрока.БанкИзФайла = Excel.Cells(НомСтр, 1).Value;
		НоваяСтрока.БИКБанка = Excel.Cells(НомСтр, 2).Value;
		НоваяСтрока.РасчетныйСчет = Excel.Cells(НомСтр, 4).Value;
		НоваяСтрока.Валюта = Excel.Cells(НомСтр, 3).Value;
		НоваяСтрока.СальдоНачальное = Excel.Cells(НомСтр, 5).Value;		
		НоваяСтрока.СальдоКонечное = Excel.Cells(НомСтр, 6).Value;
		НомСтр = НомСтр + 1;
		
	КонецЦикла;

	Excel.ActiveWorkbook.Close();

	НайтиОстаткиНаРасчетныхСчетах();
	
КонецПроцедуры //ИмпортироватьДанныеИзФайлаExcel

&НаСервере
Процедура НайтиОстаткиНаРасчетныхСчетах()
	
	
	// Загрузка полного списка р/сч для портфеля СК
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк КАК Банк,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.Код КАК БИК,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.НомерСчета КАК НомерСчета,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.Наименование КАК БанкНаименование,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток,
		|	ЕСТЬNULL(ОстаткиДенежныхСредствОстатки.МестоХранения, ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)) КАК МестоХранения
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстатки
		|		ПО ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = ОстаткиДенежныхСредствОстатки.РасчетныйСчет
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Для Каждого СтрокаИмпортируемыхДанных Из Объект.ИмпортируемыеДанные Цикл
		
		Если ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("БИК, НомерСчета", 
					СтрокаИмпортируемыхДанных.БИКБанка, СтрокаИмпортируемыхДанных.РасчетныйСчет)) Тогда
					
			СтрокаИмпортируемыхДанных.БанкВСистеме = ВыборкаДетальныеЗаписи.Банк;
			СтрокаИмпортируемыхДанных.СчетВСистеме = ВыборкаДетальныеЗаписи.РасчетныйСчет;  			
			СтрокаИмпортируемыхДанных.ВалютаВСистеме = ВыборкаДетальныеЗаписи.Валюта;			
			СтрокаИмпортируемыхДанных.ВходящийОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;	
			СтрокаИмпортируемыхДанных.МестоХранения = ВыборкаДетальныеЗаписи.МестоХранения;


   		КонецЕсли;

		ВыборкаДетальныеЗаписи.Сбросить();
	КонецЦикла;
	
	// БИКи очень часто не совпадают, последний шанс найти совпадения непосредственно по номеру счета
	Для Каждого СтрокаИмпортируемыхДанных Из Объект.ИмпортируемыеДанные Цикл
		
		Если СтрокаИмпортируемыхДанных.СчетВСистеме = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
			Если ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("НомерСчета", 
						СтрокаИмпортируемыхДанных.РасчетныйСчет)) Тогда
						
				СтрокаИмпортируемыхДанных.СчетВСистеме = ВыборкаДетальныеЗаписи.РасчетныйСчет;  			
				СтрокаИмпортируемыхДанных.ВалютаВСистеме = ВыборкаДетальныеЗаписи.Валюта;	
				СтрокаИмпортируемыхДанных.ВходящийОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;	
				СтрокаИмпортируемыхДанных.МестоХранения = ВыборкаДетальныеЗаписи.МестоХранения;


	   		КонецЕсли;
   		КонецЕсли;

		ВыборкаДетальныеЗаписи.Сбросить();
	КонецЦикла;
	
	Для Каждого СтрокаИмпортируемыхДанных Из Объект.ИмпортируемыеДанные Цикл
		
		Если НЕ СтрокаИмпортируемыхДанных.СчетВСистеме = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
			
			СтрокаИмпортируемыхДанных.ИсходящийОстаток = СтрокаИмпортируемыхДанных.СальдоКонечное;
			СтрокаИмпортируемыхДанных.Сумма = СтрокаИмпортируемыхДанных.ИсходящийОстаток - СтрокаИмпортируемыхДанных.ВходящийОстаток;
			
		КонецЕсли;
		
	КонецЦикла;

	ЭтаФорма.Объект.ОсновнойРегистратор = ПолучитьОсновнойРегистратор(Объект.Период, Объект.СчетДоверительногоУправления);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОстаткиВРегистрыСистемы(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ЗаписатьОстаткиВРегистрыСистемы");
	Попытка
		ВыполнитьЗаписьОстатковВРегистрыСистемы(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьОстатковВРегистрыСистемы(ПараметрыСессии)
	СохранитьСуммыНаСервере();
	
	Предупреждение("Данные успешно сохранены в системе",,"Импорт данных")	;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Объект.Период      = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДатуЗапретаРедактирования()
		
	Если НЕ ПроверитьДатыЗапретаРедактированияНаСервере() Тогда 		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя импортировать остатки - редактирование запрещено (см. дату запрета редактирования)");
		ЭтаФорма.Элементы.ОбновитьРегистры.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ОбновитьРегистры.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьДатыЗапретаРедактированияНаСервере()
	
	ГруппыЗапретаРедактирования = Новый Массив();
	ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.Партии);	
	ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.БэкОфис);
	ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.Проводки);            
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования) КАК ДатаЗапретаРедактирования
		|ИЗ
		|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|ГДЕ
		|	ДатыЗапретаРедактирования.Организация = &Организация
		|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ДатыЗапретаРедактирования.ГруппаЗапрета В(&ГруппаЗапрета)
		|	И ДатыЗапретаРедактирования.ВидУчета = &ВидУчета
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования) >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)";

	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       Объект.Период);
	Запрос.УстановитьПараметр("ГруппаЗапрета",                ГруппыЗапретаРедактирования);
	Запрос.УстановитьПараметр("ВидУчета",                	  Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);   
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь; 
	Иначе
		Возврат Истина;
	КонецЕсли;   
	
КонецФункции  

#Область Скопировано_из_обработки_Ввод_ДС

&НаСервереБезКонтекста
Функция ПолучитьКлючОсновногоРегистратор(Период, СчетДоверительногоУправления)
	
	Возврат Формат(Период, "ДФ=ггггММдд") + "/" + СчетДоверительногоУправления.КодСчета;
	
КонецФункции // ПолучитьКлючОсновногоРегистратор

&НаСервереБезКонтекста
Функция ПолучитьОсновнойРегистратор(Период, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КодыВоВнешнихСистемах.Объект
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах КАК КодыВоВнешнихСистемах
		|ГДЕ
		|	КодыВоВнешнихСистемах.Период = ДАТАВРЕМЯ(1980, 1, 1)
		|	И КодыВоВнешнихСистемах.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Фенси)
		|	И КодыВоВнешнихСистемах.ГруппаОбъектов = &ГруппаОбъектов
		|	И КодыВоВнешнихСистемах.Код = &Код";
		
	Запрос.УстановитьПараметр("ГруппаОбъектов", Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Ручные вводы денежных средств", Истина, Ложь));
	Запрос.УстановитьПараметр("Код",            ПолучитьКлючОсновногоРегистратор(Период, СчетДоверительногоУправления));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект;
	КонецЕсли;
	
	Возврат Документы.КорректировкаРегистров.ПустаяСсылка();
	
КонецФункции // ПолучитьОсновнойРегистратор

&НаСервере
Процедура СохранитьСуммыНаСервере()
	
	НачатьТранзакцию();
	
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.ОсновнойРегистратор) Тогда
		
		Регистратор = ЭтаФорма.Объект.ОсновнойРегистратор;
		
	Иначе	
		
		Регистратор = Документы.КорректировкаРегистров.СоздатьДокумент();
		Регистратор.Дата                         = ЭтаФорма.Объект.Период + 10 * 60 * 60 + 2; // помещаем по время 10:00:02
		Регистратор.Организация                  = ЭтаФорма.Объект.Организация;
		Регистратор.СчетДоверительногоУправления = ЭтаФорма.Объект.СчетДоверительногоУправления;
		Регистратор.Ответственный                = РаботаСПользователями.ТекущийПользователь();
		Регистратор.Комментарий                  = "Ввод денежных средств";
		
		Регистратор.ТаблицаРегистров.Добавить();
		Регистратор.ТаблицаРегистров.Добавить();
		Регистратор.ТаблицаРегистров.Добавить();
		
		Регистратор.ТаблицаРегистров.ЗагрузитьКолонку(
			РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("ОстаткиДенежныхСредств, ОстаткиПрочихАктивов, ДенежныеСредстваВКредитныхИнструментах", ",", Истина, Истина),
			"Имя");
		
		Регистратор.Записать();
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЗаписьКодыВоВнешнихСистемах = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьМенеджерЗаписи();
		ЗаписьКодыВоВнешнихСистемах.Период         = Дата(1980, 1, 1); 
		ЗаписьКодыВоВнешнихСистемах.ВнешняяСистема = Справочники.ВнешниеСистемы.Фенси;
		ЗаписьКодыВоВнешнихСистемах.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Ручные вводы денежных средств", Истина, Ложь);
		ЗаписьКодыВоВнешнихСистемах.Код            = ПолучитьКлючОсновногоРегистратор(ЭтаФорма.Объект.Период, ЭтаФорма.Объект.СчетДоверительногоУправления);
		ЗаписьКодыВоВнешнихСистемах.Объект         = Регистратор.Ссылка;
		ЗаписьКодыВоВнешнихСистемах.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Регистратор = Регистратор.Ссылка;
		
	КонецЕсли;
	
	НаборОстаткиДенежныхСредств = РегистрыНакопления.ОстаткиДенежныхСредств.СоздатьНаборЗаписей();
	НаборОстаткиДенежныхСредств.Отбор.Регистратор.Установить(Регистратор);
	НаборОстаткиДенежныхСредств.Прочитать();
	НаборОстаткиДенежныхСредств.Очистить();
	
	Для Каждого СтрокаИмпортируемыхДанных Из Объект.ИмпортируемыеДанные Цикл
		
		Если НЕ СтрокаИмпортируемыхДанных.СчетВСистеме = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
			
			Если СтрокаИмпортируемыхДанных.Сумма<>0 Тогда
			
				Запись = НаборОстаткиДенежныхСредств.Добавить();
				Запись.РасчетныйСчет = СтрокаИмпортируемыхДанных.СчетВСистеме;
				
				Если СтрокаИмпортируемыхДанных.Сумма < 0 Тогда
					Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВыводДенежныхСредств;
					Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы;
				Иначе
					Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств;
					Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы;
				КонецЕсли;
				
				Запись.Период                       = Регистратор.Дата;
				Запись.Организация                  = Регистратор.Организация;
				Запись.СчетДоверительногоУправления = Регистратор.СчетДоверительногоУправления;
				Запись.МестоХранения = СтрокаИмпортируемыхДанных.МестоХранения; 
				Запись.Сумма       = ?(СтрокаИмпортируемыхДанных.Сумма < 0, -СтрокаИмпортируемыхДанных.Сумма, СтрокаИмпортируемыхДанных.Сумма);
				Запись.ВидДвижения = ?(СтрокаИмпортируемыхДанных.Сумма < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
				Запись.Валюта = СтрокаИмпортируемыхДанных.ВалютаВСистеме;
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
	НаборОстаткиДенежныхСредств.Записать(); 	
	ЗафиксироватьТранзакцию();
	

	 	
КонецПроцедуры // СохранитьСуммыНаСервере

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПроверитьДатуЗапретаРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	ПроверитьДатуЗапретаРедактирования();
КонецПроцедуры 

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти