
Процедура ПередЗаписью(Отказ, Замещение)
	
	КонтрольДатыЗакрытияБанковскихСчетов(Отказ);
	КонтрольДатыЗакрытияДепозитарныхСчетов(Отказ);
	
	Справочники.Договоры.КонтрольПериодаУсловийДопСоглашения(ЭтотОбъект, Отказ);
	
	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "Договор");
	
КонецПроцедуры

Процедура КонтрольДатыЗакрытияБанковскихСчетов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.Договор КАК Справочник.Договоры) КАК Договор,
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.ДатаРасторжения КАК ДАТА) КАК ДатаРасторжения
		|ПОМЕСТИТЬ _УсловияДоговоровОбщие
		|ИЗ
		|	&УсловияДоговоровОбщие КАК УсловияДоговоровОбщие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеСчета.Представление КАК Представление
		|ИЗ
		|	_УсловияДоговоровОбщие КАК _УсловияДоговоровОбщие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО (БанковскиеСчета.Договор = _УсловияДоговоровОбщие.Договор)
		|			И (БанковскиеСчета.ПометкаУдаления = ЛОЖЬ)
		|			И (БанковскиеСчета.ДатаЗакрытия > _УсловияДоговоровОбщие.ДатаРасторжения
		|				ИЛИ БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	_УсловияДоговоровОбщие.Договор.ВидДоговора В(&ВидыДоговоров)
		|	И _УсловияДоговоровОбщие.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ВЫБОР
		|			КОГДА _УсловияДоговоровОбщие.Договор.Организация = &РЭМ
		|				ТОГДА НЕ _УсловияДоговоровОбщие.Договор.НомерДоговора В (&ИсключаемыеДоговорыРЭМ)
		|			КОГДА _УсловияДоговоровОбщие.Договор.Организация = &Траст
		|				ТОГДА НЕ _УсловияДоговоровОбщие.Договор.НомерДоговора В (&ИсключаемыеДоговорыТраст)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоДепозита);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.КомплексногоОбслуживания);
	
	Запрос.УстановитьПараметр("ВидыДоговоров",			ВидыДоговоров);
	Запрос.УстановитьПараметр("УсловияДоговоровОбщие",	ЭтотОбъект.Выгрузить(, "Договор, ДатаРасторжения"));
	
	Запрос.УстановитьПараметр("РЭМ",	ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	Запрос.УстановитьПараметр("Траст",	ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	
	ИсключаемыеДоговорыРЭМ		= СтрРазделить("М99-4785/2019,М46-4785/2015,Д12-4785/2013,М100-4785/2019,М101-4785/2019,М66-4785/2016,"
											+ "Д45-4785/2016,М61-4785/2016,Д41-4785/2016,М65-4785/2016,Д44-4785/2016,М23-4785/2015,"
											+ "Д11-4785/2013,М30-4785/2015,Д20-4785/2013,М113-4785/2020,Д65-4785/2020,М59-4785/2016,"
											+ "Д38-4785/2016,М58-4785/2016,Д39-4785/2016,М89-4785/2018,Д63-4785/2019,М32-4785/2015,"
											+ "Д11-0028/2012,М8-4785/2015,Д14-4785/2013,М22-4785/2015,Д3-4785/2013,Д46-4785/2016,"
											+ "М13-4785/2015,Д1-4785/2013,М15-4785/2015,Д19-4785/2013,М17-4785/2015,Д62-4785/2018,"
											+ "М126-4785/2021,М21-4785/2015,Д42-4785/2016,М104-4785/2019,М116-4785/2020,М95-4785/2018,"
											+ "М7-4785/2015,М115-4785/2020,М6-4785/2015,М120-4785/2021,М2-4785/2014,М121-4785/2021,"
											+ "М128-4785/2022,М130-4785/2022,М127-4785/2021,М5-4785/2015" , ",");
	
	ИсключаемыеДоговорыТраст	= СтрРазделить("М63-26128/2021,М61-26128/2021,М74-26128/2021,М35-26128/2019,М6-26128/2018,Д22-26128/2020,"
											+ "М31-26128/2019,М40-26128/2019,М65-26128/2021,М73-26128/2021,М18-26128/2018,М20-21054/2017,"
											+ "М14-21054/2017,Д16-26128/2020,М21-21054/2017,Д18-26128/2020,М22-21054/2017,М41-26128/2019,"
											+ "М75-26128/2021,М20-26128/2018,Д12-26128/2019,М39-26128/2019,М38-26128/2019,М47-26128/2019,"
											+ "Д19-26128/2020,М3-21054/2015,Д11-21054/2017,М48-26128/2019,Д15-26128/2020,М37-26128/2019,"
											+ "М8-21054/2015,Д6-21054/2015,М42-26128/2019,М78-26128/2021,М44-26128/2019,М1-21054/2013", ",");
	
	Запрос.УстановитьПараметр("ИсключаемыеДоговорыРЭМ",		ИсключаемыеДоговорыРЭМ);
	Запрос.УстановитьПараметр("ИсключаемыеДоговорыТраст",	ИсключаемыеДоговорыТраст);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия счета «" + Выборка.Представление + "» позже даты расторжения договора", Выборка.Ссылка, , , Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура КонтрольДатыЗакрытияДепозитарныхСчетов(Отказ)

	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ОтветственногоХранения);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ВеденияРеестра);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.Договор КАК Справочник.Договоры) КАК Договор,
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.ДатаРасторжения КАК ДАТА) КАК ДатаРасторжения
		|ПОМЕСТИТЬ _УсловияДоговоровОбщие
		|ИЗ
		|	&УсловияДоговоровОбщие КАК УсловияДоговоровОбщие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""счета"" КАК ВидЭлемента,
		|	ДепозитарныеСчета.Ссылка КАК Ссылка,
		|	ДепозитарныеСчета.Наименование КАК Представление
		|ИЗ
		|	_УсловияДоговоровОбщие КАК _УсловияДоговоровОбщие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
		|		ПО (ДепозитарныеСчета.Договор = _УсловияДоговоровОбщие.Договор)
		|			И (ДепозитарныеСчета.ПометкаУдаления = ЛОЖЬ)
		|			И (ДепозитарныеСчета.ДатаЗакрытия > _УсловияДоговоровОбщие.ДатаРасторжения
		|				ИЛИ ДепозитарныеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	_УсловияДоговоровОбщие.Договор.ВидДоговора В(&ВидыДоговоров)
		|	И _УсловияДоговоровОбщие.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""исполнителей"",
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления)
		|ИЗ
		|	_УсловияДоговоровОбщие КАК _УсловияДоговоровОбщие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|		ПО (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор = _УсловияДоговоровОбщие.Договор)
		|			И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия > _УсловияДоговоровОбщие.ДатаРасторжения
		|				ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	_УсловияДоговоровОбщие.Договор.ВидДоговора В(&ВидыДоговоров)
		|	И _УсловияДоговоровОбщие.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)";

	Запрос.УстановитьПараметр("ВидыДоговоров",          ВидыДоговоров);
	Запрос.УстановитьПараметр("УсловияДоговоровОбщие",  ЭтотОбъект.Выгрузить(, "Договор, ДатаРасторжения"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Дата закрытия " + Выборка.ВидЭлемента + " """ + Выборка.Представление + """ позже даты расторжения договора",
			Выборка.Ссылка, , , Отказ);
	КонецЦикла;

КонецПроцедуры