
&НаКлиенте
Процедура КомандаДобавитьАналоги(Команда)

	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭтаФорма.Параметры.Отбор);
	
	ОткрытьФорму("Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчетОбАналогах(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ЭтаФорма.Параметры.Отбор);
	
	ОткрытьФорму("Обработка.ПечатьСпискаАналогичныхЦенныхБумаг.Форма.Форма", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
