Функция ПолучитьТаблицуСоответствияФинансовыхПоказателейПИФ() Экспорт 

	ТаблицаСоответствия = Новый ТаблицаЗначений;
	ТаблицаСоответствия.Колонки.Добавить("ВидИнтервала", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ТаблицаСоответствия.Колонки.Добавить("КоличествоИнтервалов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)));
	ТаблицаСоответствия.Колонки.Добавить("ПоказательДоходности", Новый ОписаниеТипов("СправочникСсылка.ВидыФинансовыхПоказателей"));
	ТаблицаСоответствия.Колонки.Добавить("ПоказательОтклоненияОтИндикатора", Новый ОписаниеТипов("СправочникСсылка.ВидыФинансовыхПоказателей")); 
	
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "Месяцы", 1, ДоходностьПИФЗа1Месяц, ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатораЗа1Месяц);
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "Месяцы", 3, ДоходностьПИФЗа3Месяца, ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатораЗа3Месяца);
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "Месяцы", 6, ДоходностьПИФЗа6Месяцев, ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатораЗа6Месяцев);
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "Месяцы", 12, ДоходностьПИФЗа1Год, ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатораЗа1Год);
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "Месяцы", 36, ДоходностьПИФЗа3Года, ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатораЗа3Года);
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "Месяцы", 60, ДоходностьПИФЗа5Лет, ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатораЗа5Лет);
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "РабочиеДни", 20, , ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатора20);
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "РабочиеДни", 250, , ОтклонениеПриростаСтоимостиПаяОтПриростаИндикатора250); 
	ДобавитьСтрокуСоответствия(ТаблицаСоответствия, "ДатаОкончанияФормированияПИФ", 1, ДоходностьПИФСДатыФормирования, Неопределено);
	
	Возврат ТаблицаСоответствия;

КонецФункции 

Процедура ДобавитьСтрокуСоответствия(ТаблицаСоответствия, ВидИнтервала, КоличествоИнтервалов, ПоказательДоходности, ПоказательОтклоненияОтИндикатора)

	НоваяСтрока = ТаблицаСоответствия.Добавить();
	НоваяСтрока.ВидИнтервала = ВидИнтервала;
	НоваяСтрока.КоличествоИнтервалов = КоличествоИнтервалов;
	НоваяСтрока.ПоказательДоходности = ПоказательДоходности;
	НоваяСтрока.ПоказательОтклоненияОтИндикатора = ПоказательОтклоненияОтИндикатора;

КонецПроцедуры

