
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Вид учета должен быть заполнен, если методика по "старой" схеме или расчет по партиям
		
		Если Не ЗначениеЗаполнено(Запись.ВидУчетаДляОстатковПартий)
			И Запись.ЦельРасчета.ТолькоДляФиксацииСтоимостиОценки
		Тогда
		
			Если Запись.ВестиРасчетПоПартиям
				ИЛИ ЗначениеЗаполнено(Запись.ВариантРасчетаОценочнойСтоимости)
					И Не Справочники.ВариантыРасчетаОценочнойСтоимости.ИспользованаМетодикаРасчетаПоНовойСхеме(Запись.ЦельРасчета, Запись.ВариантРасчетаОценочнойСтоимости)
			Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен вид учета!", , , "Запись.ВидУчетаДляОстатковПартий", Отказ);
			КонецЕсли;
		
		КонецЕсли;
		
		// Цель расчета должна соответствовать виду учета
		
		Если Не ЦельРасчетаСоответствуетВидуУчета(Запись.ЦельРасчета, Запись.ВидУчетаДляОстатковПартий) Тогда		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для цели расчета " + СокрЛП(Запись.ЦельРасчета) + " должен быть установлен только одноименный вид учета!",,,, Отказ);
		КонецЕсли;	
		
	КонецЦикла;

	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);

КонецПроцедуры

Функция ЦельРасчетаСоответствуетВидуУчета(ЦельРасчета, ВидУчетаДляОстатковПартий)
	
	Если ЦельРасчета = Справочники.ЦелиРасчета.БухгалтерскийУчет Тогда
		Возврат ВидУчетаДляОстатковПартий = Перечисления.ВидыУчета.БухгалтерскийУчет;
	ИначеЕсли ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов Тогда
		Возврат ВидУчетаДляОстатковПартий = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	ИначеЕсли ЦельРасчета = Справочники.ЦелиРасчета.НалоговыйУчет Тогда
		Возврат ВидУчетаДляОстатковПартий = Перечисления.ВидыУчета.НалоговыйУчет;
	КонецЕсли;

	Возврат Истина; // Другие комбинации не проверяем

КонецФункции
