
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
	ПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Если ПолноправныйПользователь Тогда
		НовыйЭлемент = Элементы.Добавить("Организация", Тип("ПолеФормы"), Элементы.Группа1);
		НовыйЭлемент.Вид					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаОчистки			= Истина;
		НовыйЭлемент.КнопкаОткрытия			= Ложь;
		НовыйЭлемент.КнопкаСоздания			= Ложь;
		НовыйЭлемент.ПоложениеЗаголовка		= ПоложениеЗаголовкаЭлементаФормы.Лево;
	Иначе
		НовыйЭлемент = Элементы.Добавить("Организация", Тип("ПолеФормы"), Элементы.Группа1);
		НовыйЭлемент.Вид				= ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Гиперссылка		= Истина;
		НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	НовыйЭлемент.ПутьКДанным = "Отчет.Организация";
	
	Отчет.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	
КонецПроцедуры
