
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЮрФизЛицо.ВидЮрФизЛица <> Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("НДФЛ облагаются только физические лица", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьНДФЛ() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДолиПайщиковВИнвестиционномФондеОбороты.СтоимостьРасход КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Обороты(
	|			&НачалоГода,
	|			&КонецПериода,
	|			,
	|			Пайщик = &ЮрФизЛицо
	|				И Организация = &Организация) КАК ДолиПайщиковВИнвестиционномФондеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход КАК Выручка
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&НачалоГода,
	|			&КонецПериода,
	|			,
	|			ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПередПайщиками)
	|				И Организация = &Организация
	|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
	|				И Контрагент = &ЮрФизЛицо
	|				И Аванс = ЛОЖЬ) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход КАК НачисленНДФЛ
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&НачалоГода,
	|			&КонецПериода,
	|			,
	|			ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
	|				И Организация = &Организация
	|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
	|				И Контрагент = &ЮрФизЛицо
	|				И Аванс = ЛОЖЬ) КАК ЗадолженностиПоДенежнымСредствамОбороты");
	
	Запрос.УстановитьПараметр("НачалоГода",   НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецПериода", Дата - 1);
	
	Запрос.УстановитьПараметр("Организация",  Организация);    
	Запрос.УстановитьПараметр("ЮрФизЛицо",    ЮрФизЛицо);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	СтавкаНДФЛ = ПолучитьСтавкуНДФЛ();
	
	Прибыль = Результаты[1].Выгрузить().Итог("Выручка") - Результаты[0].Выгрузить().Итог("Себестоимость");
	
	РассчетныйНДФЛ = Окр(СтавкаНДФЛ / 100 * Прибыль, 0);
	РассчетныйНДФЛ = РассчетныйНДФЛ - Результаты[2].Выгрузить().Итог("НачисленНДФЛ");
	
	Возврат ?(РассчетныйНДФЛ > 0, РассчетныйНДФЛ, 0);
	                          
КонецФункции

Функция ПолучитьСтавкуНДФЛ()
	
	Возврат 13;
	
КонецФункции

Процедура Печать(ДокументРезультат) Экспорт
	
	ДокументРезультат.Очистить();
	ДокументРезультат.АвтоМасштаб = Истина;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	
	ПредставлениеДаты = Формат(Дата, "ДФ='dd.MM.yyyy ''г.'''");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК ФИО,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство КАК Гражданство,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийУдостоверениеЛичности,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности
	|ИЗ
	|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ЮрФизЛицо = &ЮрФизЛицо
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних");
	
	Запрос.УстановитьПараметр("Период",      Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо",   ЮрФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = ПредставлениеДаты;
	
	Если Выборка.Следующий() Тогда
		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		
		ОбластьШапка.Параметры.УдостоверениеЛичности = 
			Строка(Выборка.ВидУдостоверенияЛичности)
			+ ", " + Выборка.СерияУдостоверенияЛичности
			+ ", " + Выборка.НомерУдостоверенияЛичности
			+ ", " + Выборка.ОрганВыдавшийУдостоверениеЛичности
			+ ", выдан " + Формат(Выборка.ДатаВыдачиУдостоверенияЛичности, "ДФ=dd.MM.yyyy")
			+ ", " + Выборка.КодОрганаВыдавшегоУдостоверениеЛичности
		
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	                    
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ПогашениеПаев.Дата, ДЕНЬ) КАК Период,
	|	ПогашениеПаев.Заявка КАК Заявка,
	|	ПогашениеПаев.Ссылка КАК Погашение,
	|	ПогашениеПаев.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	ПогашениеПаев.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ПогашениеПаев.Количество КАК Количество,
	|	ВыводДенежныхСредств.Сумма КАК Выручка,
	|	ВыводДенежныхСредств.СуммаНДФЛ КАК НачисленныйНДФЛ,
	|	ВыводДенежныхСредств.Дата КАК ДатаВывода
	|ПОМЕСТИТЬ _Погашения
	|ИЗ
	|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ПогашениеПаев
	|		ПО (ВыводДенежныхСредств.Основание = ПогашениеПаев.Заявка
	|				ИЛИ ВыводДенежныхСредств.Основание = ПогашениеПаев.Ссылка)
	|ГДЕ
	|	ВыводДенежныхСредств.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И ВыводДенежныхСредств.Организация = &Организация
	|	И ВыводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
	|	И ВыводДенежныхСредств.Контрагент = &ЮрФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПогашениеПаев.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК ПолноеНаименованиеПИФ,
	|	НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) КАК Период,
	|	ВЫБОР
	|		КОГДА _Погашения.Период ЕСТЬ NULL
	|			ТОГДА ЗадолженностиПоДенежнымСредствам.Период
	|		ИНАЧЕ _Погашения.ДатаВывода
	|	КОНЕЦ КАК ПериодСортировки,
	|	ПогашениеПаев.Ссылка КАК Погашение,
	|	ФинансовыеПоказатели.Период КАК ДатаСЧА,
	|	ПогашениеПаев.Количество КАК Количество,
	|	ФинансовыеПоказатели.Значение КАК СтоимостьПая,
	|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Стоимость
	|ИЗ
	|	Документ.ПогашениеПаев КАК ПогашениеПаев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
	|		ПО (ЗадолженностиПоДенежнымСредствам.Регистратор = ПогашениеПаев.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
	|		ПО ПогашениеПаев.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
	|		ПО ПогашениеПаев.Организация = ФинансовыеПоказатели.Организация
	|			И ПогашениеПаев.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
	|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
	|			И (ФинансовыеПоказатели.Период В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					Т.Период КАК Период
	|				ИЗ
	|					РегистрСведений.ФинансовыеПоказатели КАК Т
	|				ГДЕ
	|					Т.Организация = ПогашениеПаев.Организация
	|					И Т.СубъектАналитики = ПогашениеПаев.СчетДоверительногоУправления
	|					И Т.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая)
	|					И Т.Период < НАЧАЛОПЕРИОДА(ПогашениеПаев.Дата, ДЕНЬ)
	|				УПОРЯДОЧИТЬ ПО
	|					Период УБЫВ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Погашения КАК _Погашения
	|		ПО ПогашениеПаев.Ссылка = _Погашения.Погашение
	|ГДЕ
	|	ПогашениеПаев.Дата МЕЖДУ &НачалоГода И &КонецПериода
	|	И ПогашениеПаев.Организация = &Организация
	|	И ПогашениеПаев.Владелец = &ЮрФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодСортировки УБЫВ,
	|	Период УБЫВ,
	|	ПаевойИнвестиционныйФонд
	|ИТОГИ
	|	МАКСИМУМ(ПолноеНаименованиеПИФ),
	|	МАКСИМУМ(Период),
	|	МАКСИМУМ(ПериодСортировки),
	|	СУММА(Стоимость)
	|ПО
	|	ПаевойИнвестиционныйФонд
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДолиПайщиковВИнвестиционномФондеОбороты.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	ДолиПайщиковВИнвестиционномФондеОбороты.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(ДолиПайщиковВИнвестиционномФондеОбороты.Партия.Дата, ДЕНЬ) КАК ПериодЗачисления,
	|	ДолиПайщиковВИнвестиционномФондеОбороты.КоличествоРасход КАК Количество,
	|	ВЫБОР
	|		КОГДА ДолиПайщиковВИнвестиционномФондеОбороты.КоличествоРасход = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДолиПайщиковВИнвестиционномФондеОбороты.СтоимостьРасход / ДолиПайщиковВИнвестиционномФондеОбороты.КоличествоРасход КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК СтоимостьПая,
	|	ДолиПайщиковВИнвестиционномФондеОбороты.СтоимостьРасход КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Обороты(
	|			&НачалоГода,
	|			&КонецПериода,
	|			День,
	|			Пайщик = &ЮрФизЛицо
	|				И Организация = &Организация) КАК ДолиПайщиковВИнвестиционномФондеОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПаевойИнвестиционныйФонд,
	|	Период
	|ИТОГИ
	|	СУММА(Стоимость)
	|ПО
	|	ПаевойИнвестиционныйФонд
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Погашения.Период КАК Период,
	|	_Погашения.Погашение КАК Погашение,
	|	_Погашения.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК ПолноеНаименованиеПИФ,
	|	_Погашения.Количество КАК Количество,
	|	_Погашения.Выручка - _Погашения.НачисленныйНДФЛ КАК ВыручкаКПеречислению,
	|	_Погашения.НачисленныйНДФЛ КАК НДФЛКПеречислению,
	|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
	|	ФинансовыеПоказатели.Значение КАК СтоимостьПая,
	|	ФинансовыеПоказатели.Период КАК ДатаСЧА
	|ИЗ
	|	_Погашения КАК _Погашения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
	|		ПО _Погашения.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
	|			И (ФинансовыеПоказатели.Организация = &Организация)
	|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
	|			И (ФинансовыеПоказатели.Период В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					Т.Период КАК Период
	|				ИЗ
	|					РегистрСведений.ФинансовыеПоказатели КАК Т
	|				ГДЕ
	|					Т.Организация = &Организация
	|					И Т.СубъектАналитики = _Погашения.СчетДоверительногоУправления
	|					И Т.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая)
	|					И Т.Период < _Погашения.Период
	|				УПОРЯДОЧИТЬ ПО
	|					Период УБЫВ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
	|		ПО _Погашения.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			_Погашения.Погашение КАК Погашение,
	|			СУММА(ЕСТЬNULL(ДолиПайщиковВИнвестиционномФонде.Стоимость, 0)) КАК Себестоимость
	|		ИЗ
	|			_Погашения КАК _Погашения
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДолиПайщиковВИнвестиционномФонде КАК ДолиПайщиковВИнвестиционномФонде
	|				ПО _Погашения.Погашение = ДолиПайщиковВИнвестиционномФонде.Регистратор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			_Погашения.Погашение) КАК ВложенныйЗапрос
	|		ПО _Погашения.Погашение = ВложенныйЗапрос.Погашение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПаевойИнвестиционныйФонд,
	|	Период УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ПолноеНаименованиеПИФ),
	|	СУММА(ВыручкаКПеречислению),
	|	СУММА(НДФЛКПеречислению)
	|ПО
	|	ПаевойИнвестиционныйФонд
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.Период КАК Период,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК ПаевойИнвестиционныйФонд,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&НачалоГода,
	|			&КонецПериода,
	|			День,
	|			ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
	|				И Контрагент = &ЮрФизЛицо
	|				И Аванс = ЛОЖЬ) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, ) КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ПО ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПаевойИнвестиционныйФонд,
	|	Период УБЫВ
	|ИТОГИ
	|	СУММА(Стоимость)
	|ПО
	|	ПаевойИнвестиционныйФонд
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	_Погашения.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	ВЫРАЗИТЬ(РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК СТРОКА(255)) КАК ПИФ,
	|	_Погашения.Заявка.БИК КАК БИК,
	|	_Погашения.Заявка.НаименованиеБанка КАК НаименованиеБанка,
	|	_Погашения.Заявка.КоррСчет КАК КоррСчет,
	|	_Погашения.Заявка.НомерСчета КАК НомерСчета,
	|	_Погашения.Заявка.ЛицевойСчет КАК ЛицевойСчет,
	|	_Погашения.Заявка.ПолучательПлатежа КАК ПолучательПлатежа,
	|	_Погашения.Заявка.ИННПолучателя КАК ИННПолучателя
	|ИЗ
	|	_Погашения КАК _Погашения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
	|		ПО _Погашения.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
	|УПОРЯДОЧИТЬ ПО
	|	ПаевойИнвестиционныйФонд
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИФНСОрганизацийСрезПоследних.ИФНС КАК ИФНС,
	|	ИФНСОрганизацийСрезПоследних.БанковскийСчет КАК БанковскийСчет
	|ПОМЕСТИТЬ _ИФНС
	|ИЗ
	|	РегистрСведений.ИФНСОрганизаций.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И НЕ ПоКрупнейшимНалогоплательщикам) КАК ИФНСОрганизацийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННИФНС,
	|	РеквизитыЮридическихЛицСрезПоследних.КПП КАК КППИФНС,
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ИФНС,
	|	_ИФНС.БанковскийСчет.Банк.Наименование КАК Банк,
	|	_ИФНС.БанковскийСчет.Банк.Код КАК БИК,
	|	_ИФНС.БанковскийСчет.НомерСчета КАК РасчетныйСчет
	|ИЗ
	|	_ИФНС КАК _ИФНС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&КонецПериода,
	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И ЮрФизЛицо В
	|						(ВЫБРАТЬ
	|							_ИФНС.ИФНС КАК ИФНС
	|						ИЗ
	|							_ИФНС КАК _ИФНС)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО _ИФНС.ИФНС = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо");
	
	Запрос.УстановитьПараметр("НачалоГода",    НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецПериода",  Дата - 1);
	
	Запрос.УстановитьПараметр("НачалоДня", Дата);
	Запрос.УстановитьПараметр("КонецДня",  КонецДня(Дата));
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо",     ЮрФизЛицо);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДеревоВыручка       = Результаты[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоСебестоимость = Результаты[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоПогашений     = Результаты[3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоУдержаний     = Результаты[4].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ТаблицаРеквизитов = Результаты[5].Выгрузить();
	
	ДанныеДляУплатыНалога = Результаты[7].Выгрузить();
	
	ОбластьЗаголовокПИФ = Макет.ПолучитьОбласть("ЗаголовокПИФ");
	ОбластьПогашение    = Макет.ПолучитьОбласть("Погашение");
	
	ОбластьШапкаДоход   = Макет.ПолучитьОбласть("ШапкаДоход");
	ОбластьСтрокаДоход  = Макет.ПолучитьОбласть("СтрокаДоход");
	ОбластьИтогДоход    = Макет.ПолучитьОбласть("ИтогДоход");
	
	ОбластьШапкаРасход  = Макет.ПолучитьОбласть("ШапкаРасход");
	ОбластьСтрокаРасход = Макет.ПолучитьОбласть("СтрокаРасход");
	ОбластьИтогРасход   = Макет.ПолучитьОбласть("ИтогРасход");
	
	ОбластьШапкаУдержан  = Макет.ПолучитьОбласть("ШапкаУдержан");
	ОбластьСтрокаУдержан = Макет.ПолучитьОбласть("СтрокаУдержан");
	ОбластьИтогУдержан   = Макет.ПолучитьОбласть("ИтогУдержан");


	ОбластьПодвалПрибыль = Макет.ПолучитьОбласть("ПодвалПрибыль");

	ПрибыльУбытокВсего   = 0;
	ВыручкаКПеречислению = 0;
	НДФЛКПеречислению    = 0;
	ДоходВсего  = 0;
	РасходВсего = 0;
	Для каждого СтрокаПИФВыручка из ДеревоВыручка.Строки Цикл
		
		ОбластьЗаголовокПИФ.Параметры.ПИФ = СтрокаПИФВыручка.ПолноеНаименованиеПИФ;
		
		ДокументРезультат.Вывести(ОбластьЗаголовокПИФ);
		
		СтрокаПИФПогашения = ДеревоПогашений.Строки.Найти(СтрокаПИФВыручка.ПаевойИнвестиционныйФонд, "ПаевойИнвестиционныйФонд", Ложь);
		Если СтрокаПИФПогашения <> Неопределено Тогда
			
			Для каждого СтрокаПогашение из СтрокаПИФПогашения.Строки Цикл
				
				ОбластьПогашение.Параметры.Дата    = Формат(СтрокаПогашение.Период, "ДФ='dd.MM.yyyy ''г.'''");
				ОбластьПогашение.Параметры.ДатаСЧА = Формат(СтрокаПогашение.ДатаСЧА, "ДФ='dd.MM.yyyy ''г.'''");
				
				ОбластьПогашение.Параметры.СтоимостьПая = Формат(СтрокаПогашение.СтоимостьПая, "ЧДЦ=2");
				ОбластьПогашение.Параметры.Количество   = Формат(СтрокаПогашение.Количество,   "ЧДЦ=5");
				ОбластьПогашение.Параметры.КоличествоСтрокой = ЧислоПрописью(СтрокаПогашение.Количество, "ДП=Истина", "целая,целых,целых,ж,стотысячная,стотысячных,стотысячных,ж,5");
				
				ОбластьПогашение.Параметры.Выручка       = Формат(СтрокаПогашение.ВыручкаКПеречислению + СтрокаПогашение.НДФЛКПеречислению, "ЧДЦ=2");
				ОбластьПогашение.Параметры.Себестоимость = Формат(СтрокаПогашение.Себестоимость, "ЧДЦ=2");
				ОбластьПогашение.Параметры.Погашение     = СтрокаПогашение.Погашение;
				
				ДокументРезультат.Вывести(ОбластьПогашение);
				
				ВыручкаКПеречислению = ВыручкаКПеречислению + СтрокаПогашение.ВыручкаКПеречислению;
				НДФЛКПеречислению    = НДФЛКПеречислению + СтрокаПогашение.НДФЛКПеречислению;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьШапкаДоход);
		
		Для каждого СтрокаВыручка из СтрокаПИФВыручка.Строки Цикл
			ОбластьСтрокаДоход.Параметры.Заполнить(СтрокаВыручка);
			ДокументРезультат.Вывести(ОбластьСтрокаДоход);
		КонецЦикла;
		
		ОбластьИтогДоход.Параметры.Заполнить(СтрокаПИФВыручка);
		ДокументРезультат.Вывести(ОбластьИтогДоход);		
		
		СтрокаПИФСебестоимость = ДеревоСебестоимость.Строки.Найти(СтрокаПИФВыручка.ПаевойИнвестиционныйФонд, "ПаевойИнвестиционныйФонд", Ложь);
		Если СтрокаПИФСебестоимость <> Неопределено Тогда
			
			ДокументРезультат.Вывести(ОбластьШапкаРасход);
			
			Для каждого СтрокаСебестоимость из СтрокаПИФСебестоимость.Строки Цикл
				ОбластьСтрокаРасход.Параметры.Заполнить(СтрокаСебестоимость);
				ДокументРезультат.Вывести(ОбластьСтрокаРасход);
			КонецЦикла;
		
			ОбластьИтогРасход.Параметры.Заполнить(СтрокаПИФСебестоимость);
			ДокументРезультат.Вывести(ОбластьИтогРасход);		
			
		КонецЕсли;
		
		ПрибыльУбыток = СтрокаПИФВыручка.Стоимость - ?(СтрокаПИФСебестоимость = Неопределено, 0, СтрокаПИФСебестоимость.Стоимость);
		ОбластьПодвалПрибыль.Параметры.ПрибыльУбыток = Формат(ПрибыльУбыток, "ЧДЦ=2");
		ДокументРезультат.Вывести(ОбластьПодвалПрибыль);
		
		ДоходВсего  = ДоходВсего  + СтрокаПИФВыручка.Стоимость;
		РасходВсего = РасходВсего + ?(СтрокаПИФСебестоимость = Неопределено, 0, СтрокаПИФСебестоимость.Стоимость);
		ПрибыльУбытокВсего = ПрибыльУбытокВсего + ПрибыльУбыток;
		
		СтрокаПИФУдержан = ДеревоУдержаний.Строки.Найти(СтрокаПИФВыручка.ПаевойИнвестиционныйФонд, "ПаевойИнвестиционныйФонд", Ложь);
		Если СтрокаПИФУдержан <> Неопределено Тогда
			
			ДокументРезультат.Вывести(ОбластьШапкаУдержан);
			
			Для каждого СтрокаУдержан из СтрокаПИФУдержан.Строки Цикл
				ОбластьСтрокаУдержан.Параметры.Заполнить(СтрокаУдержан);
				ДокументРезультат.Вывести(ОбластьСтрокаУдержан);
			КонецЦикла;
		
			ОбластьИтогУдержан.Параметры.Заполнить(СтрокаПИФУдержан);
			ДокументРезультат.Вывести(ОбластьИтогУдержан);		
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьФинансовыйРезультат = Макет.ПолучитьОбласть("ФинансовыйРезультат");
	ОбластьФинансовыйРезультат.Параметры.Дата = ПредставлениеДаты;
	ОбластьФинансовыйРезультат.Параметры.ДоходВсего  = ДоходВсего;
	ОбластьФинансовыйРезультат.Параметры.РасходВсего = РасходВсего;
	ОбластьФинансовыйРезультат.Параметры.ПрибыльУбыток = ПрибыльУбытокВсего;
	
	НДФЛИсчисленный = ?(ПрибыльУбытокВсего < 0, 0, Окр(ПолучитьСтавкуНДФЛ() / 100 * ПрибыльУбытокВсего, 0));
	НДФЛУдержанный  = ДеревоУдержаний.Строки.Итог("Стоимость", Ложь);
	
	ОбластьФинансовыйРезультат.Параметры.ИсчисленныйНДФЛ = НДФЛИсчисленный;
	ОбластьФинансовыйРезультат.Параметры.УдержанныйНДФЛ  = НДФЛУдержанный;
	ОбластьФинансовыйРезультат.Параметры.НДФЛКПеречислению    = НДФЛКПеречислению;
	ОбластьФинансовыйРезультат.Параметры.ВыручкаКПеречислению = ВыручкаКПеречислению;
	
	ДокументРезультат.Вывести(ОбластьФинансовыйРезультат);	
	
	Если ДеревоПогашений.Строки.Количество() Тогда
		
		ОбластьШапкаПеревод = Макет.ПолучитьОбласть("ШапкаПеревод");
		ОбластьСтрокаПеревод = Макет.ПолучитьОбласть("СтрокаПеревод");
		ОбластьПодвалПеревод = Макет.ПолучитьОбласть("ПодвалПеревод");
		
		ДокументРезультат.Вывести(ОбластьШапкаПеревод);	
		
		Для каждого СтрокаПогашение из ДеревоПогашений.Строки Цикл
			
			ОбластьСтрокаПеревод.Параметры.ПИФ = СтрокаПогашение.ПолноеНаименованиеПИФ;
			ОбластьСтрокаПеревод.Параметры.Заполнить(СтрокаПогашение);
			ДокументРезультат.Вывести(ОбластьСтрокаПеревод);	
			
		КонецЦикла;
		
		ОбластьПодвалПеревод.Параметры.ВыручкаКПеречислению = ВыручкаКПеречислению;
		ОбластьПодвалПеревод.Параметры.НДФЛКПеречислению    = НДФЛКПеречислению;
		
		ДокументРезультат.Вывести(ОбластьПодвалПеревод);	
		
	КонецЕсли;
	
	Если ТаблицаРеквизитов.Количество() Тогда
		
		ОбластьЗаголовокБанковскиеРеквизитыФизЛица = Макет.ПолучитьОбласть("ЗаголовокБанковскиеРеквизитыФизЛица");
		ДокументРезультат.Вывести(ОбластьЗаголовокБанковскиеРеквизитыФизЛица);
		
		ОбластьБанковскиеРеквизитыФизЛица = Макет.ПолучитьОбласть("БанковскиеРеквизитыФизЛица");
		
		Для каждого СтрокаРеквизитовФизЛица из ТаблицаРеквизитов Цикл
			ОбластьБанковскиеРеквизитыФизЛица.Параметры.Заполнить(СтрокаРеквизитовФизЛица);	
			ДокументРезультат.Вывести(ОбластьБанковскиеРеквизитыФизЛица);
		КонецЦикла;
		
	КонецЕсли;
	
	Если НДФЛКПеречислению <> 0 Тогда
		
		ОбластьБанковскиеРеквизитыУплатыНалога = Макет.ПолучитьОбласть("БанковскиеРеквизитыУплатыНалога");
		
		Если ДанныеДляУплатыНалога.Количество() > 0 Тогда
			ОбластьБанковскиеРеквизитыУплатыНалога.Параметры.Заполнить(ДанныеДляУплатыНалога[0]);
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьБанковскиеРеквизитыУплатыНалога);
		
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Дата = ПредставлениеДаты;	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
КонецПроцедуры
