
&НаКлиенте
Процедура Пересчитать(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги", ИзмененныйРеквизит = Неопределено, ВалютаСделки = Неопределено, РассчитатьРыночныеПоля = Ложь, СуффиксПолейРыночныхСумм = "Рынок") Экспорт
	
	Если Форма.КорзинаЦенныхБумаг Тогда
		Контейнер = Форма.Элементы[ИмяКорзиныЦенныхБумаг].ТекущиеДанные;
		Префикс   = "";
		Постфикс  = "";
	Иначе
		Контейнер = Форма;
		Префикс   = ИмяКорзиныЦенныхБумаг;
		Постфикс  = "1";
	КонецЕсли;
	
	ДанныеОбъекта = Форма.Объект;
	
	РынокЦенныхБумаг = ?(ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, "Рынок"), Контейнер.Рынок, ДанныеОбъекта.Рынок); 
	
	ЭтоРынокВекселей	= (РынокЦенныхБумаг = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя"));
	ЭтоРынокОблигаций 	= (РынокЦенныхБумаг = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	ЭтоРынокДолей	 	= (РынокЦенныхБумаг = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли"));
	
	Если ЭтоРынокДолей Тогда 
		Возврат; // по долям есть количество и сумма, пересчеты не нужны
	КонецЕсли;
	
	ПолеЦены					= Префикс + "Цена" + Постфикс;
	ПолеЦеныКупона				= Префикс + "ЦенаКупона" + Постфикс;
	ПолеЦеныПроцент				= Префикс + "ЦенаПроцент" + Постфикс;	
	ПолеНоминала				= Префикс + "Номинал" + Постфикс;	
	ПолеВалютаНоминала			= Префикс + "ВалютаНоминала" + Постфикс;
	ПолеВалютаКотировки			= Префикс + "ВалютаКотировки" + Постфикс;
	ПолеВалютаКотировкиКупона	= Префикс + "ВалютаКотировкиКупона" + Постфикс;
	ПолеКоличество				= Префикс + "Количество" + Постфикс;
	ПолеСумма					= Префикс + "Сумма" + Постфикс;
	ПолеСуммаКупона				= Префикс + "СуммаКупона" + Постфикс;
	
	ЕстьПолеЦены		= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеЦены);
	ЕстьПолеЦеныКупона	= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеЦеныКупона);
	
	// Если заданы валюты котировок - берем их,
	// если нет - считаем, что котировки в валюте номинала.
	// Если валюта номинала неизвестна, то берем валюту документа				
	
	ПолеКотировки		= ?(ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, Префикс + "ЦенаКотировки" + Постфикс), Префикс + "ЦенаКотировки" + Постфикс, Префикс + "Котировка" + Постфикс);
	ПолеКотировкиКупона	= ?(ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, Префикс + "ЦенаКотировкиКупона" + Постфикс), Префикс + "ЦенаКотировкиКупона" + Постфикс, Префикс + "КупонКотировка" + Постфикс);
	ПолеВалютаДокумента	= "Валюта";
	
	ЕстьВалютаДокумента			= ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеОбъекта, ПолеВалютаДокумента);
	ЕстьВалютаКотировки			= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеВалютаКотировки) И ЗначениеЗаполнено(Контейнер[ПолеВалютаКотировки]);
	ЕстьВалютаКотировкиКупона	= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеВалютаКотировкиКупона) И ЗначениеЗаполнено(Контейнер[ПолеВалютаКотировкиКупона]);
	
	ВалютаНоминала			= ?(ЗначениеЗаполнено(Контейнер[ПолеВалютаНоминала]) ИЛИ Не ЕстьВалютаДокумента, Контейнер[ПолеВалютаНоминала], ДанныеОбъекта[ПолеВалютаДокумента]);
	ВалютаКотировки			= ?(ЕстьВалютаКотировки, Контейнер[ПолеВалютаКотировки], ВалютаНоминала);
	ВалютаКотировкиКупона	= ?(ЕстьВалютаКотировкиКупона, Контейнер[ПолеВалютаКотировкиКупона], ВалютаНоминала);
	
	// Пересчет полей
	
	Если ИзмененныйРеквизит = "ЦенаПроцент" Тогда
		
		#Область Пересчет_цены
		
		Если ВалютаСделки <> ВалютаНоминала Тогда
			Возврат; // пересчет цен из % в валюту имеет смысл только тогда, когда валюта сделки совпадает с валютой номинала ц/б
		КонецЕсли;
		
		НоваяЦена = Контейнер[ПолеЦеныПроцент] * Контейнер[ПолеНоминала] / 100;
				
		Если НоваяЦена > 0 Тогда
			
			Если Контейнер[ПолеЦены] <> 0 И Контейнер[ПолеЦены] <> НоваяЦена Тогда
				
				// Если цена в валюте была задана, уточним, а стоит ли её изменить
				
				Если Не ЭтоРынокВекселей // для векселей цена только в процентах
					И Вопрос("Изменить цену на " + НоваяЦена + " и пересчитать суммы сделки?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
				Тогда
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
			Контейнер[ПолеЦены] = НоваяЦена;
			
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ИзмененныйРеквизит = "Цена" Тогда
		
		#Область Пересчет_цены_в_процентах
		
		// если цена в % не задана, то рассчитаем её
		
		Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеОбъекта, ПолеЦеныПроцент) Тогда
		
			Если НЕ (ЭтоРынокОблигаций Или ЭтоРынокВекселей) Тогда
				Контейнер[ПолеЦеныПроцент] = 0;
			ИначеЕсли (Контейнер[ПолеЦеныПроцент] = 0 И Контейнер[ПолеНоминала] > 0) Тогда
				Контейнер[ПолеЦеныПроцент] = Контейнер[ПолеЦены] / Контейнер[ПолеНоминала] * 100;
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ИзмененныйРеквизит = "ЦенаКотировки" ИЛИ ИзмененныйРеквизит = "ВалютаКотировки" Тогда
		
		#Область Пересчет_цены			
		
		Если ЕстьПолеЦены Тогда
			
			Контейнер[ПолеЦены] = РаботаСВалютами.ПересчетСуммыВВалюте(Контейнер[ПолеКотировки], ВалютаКотировки, ДанныеОбъекта.Дата, ВалютаНоминала, ДанныеОбъекта.Дата);		
			
			Пересчитать(Форма, ИмяКорзиныЦенныхБумаг, "Цена", ВалютаСделки, РассчитатьРыночныеПоля, СуффиксПолейРыночныхСумм);
		
			Возврат;
			
		КонецЕсли;
			
		#КонецОбласти
		
	ИначеЕсли ИзмененныйРеквизит = "ЦенаКотировкиКупона" ИЛИ ИзмененныйРеквизит = "ВалютаКотировкиКупона" Тогда
		
		#Область Пересчет_цены_купона			
			
		Если ЕстьПолеЦеныКупона Тогда
			
			Контейнер[ПолеЦеныКупона] = РаботаСВалютами.ПересчетСуммыВВалюте(Контейнер[ПолеКотировкиКупона], ВалютаКотировкиКупона, ДанныеОбъекта.Дата, ВалютаНоминала, ДанныеОбъекта.Дата);		
			
			Пересчитать(Форма, ИмяКорзиныЦенныхБумаг, "ЦенаКупона", ВалютаСделки, РассчитатьРыночныеПоля, СуффиксПолейРыночныхСумм);
	
			Возврат;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	// Суммы имеет смысл пересчитывать, только если есть поле количество
	
	Если (ИзмененныйРеквизит <> Неопределено)
		И ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеКоличество)
	Тогда
		
		#Область Пересчет_сумм
		
		ИзмененаЦена		= (ИзмененныйРеквизит = "Цена" ИЛИ ИзмененныйРеквизит = "ЦенаПроцент" ИЛИ ИзмененныйРеквизит = "ЦенаКотировки" ИЛИ ИзмененныйРеквизит = "ВалютаКотировки");
		НадоРассчитатьСумму	= ЕстьПолеЦены И (ИзмененаЦена ИЛИ ИзмененныйРеквизит = "Количество" И ЗначениеЗаполнено(Контейнер[ПолеЦены]));
		
		Если НадоРассчитатьСумму Тогда
			Контейнер[ПолеСумма] = Контейнер[ПолеЦены] * Контейнер[ПолеКоличество];
		КонецЕсли;
		
		ИзмененаЦенаКупона		  = (ИзмененныйРеквизит = "ЦенаКупона" ИЛИ ИзмененныйРеквизит = "ЦенаКотировкиКупона" ИЛИ ИзмененныйРеквизит = "ВалютаКотировкиКупона");
		НадоРассчитатьСуммуКупона = ЕстьПолеЦеныКупона И (ИзмененаЦенаКупона ИЛИ ИзмененныйРеквизит = "Количество" И ЗначениеЗаполнено(Контейнер[ПолеЦеныКупона]));
		
		Если НадоРассчитатьСуммуКупона Тогда
			Контейнер[ПолеСуммаКупона] = Контейнер[ПолеЦеныКупона] * Контейнер[ПолеКоличество];
		КонецЕсли;
			
		ПолеКурсВалютыНоминала		= Префикс + "КурсВалютыНоминала" + Постфикс;
		ЕстьПолеКурсаВалютыНоминала	= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеКурсВалютыНоминала);
		ИзмененКурсВалютыНоминала	= (ИзмененныйРеквизит = "КурсВалютыНоминала");
		
		Если РассчитатьРыночныеПоля Тогда
			
			#Область Пересчет_рыночных_сумм
			
			// При заполненном поле котировка рыночная сумма бумаги (купона) считается от нее
			// Если котировка не задана, рыночная сумма вносится руками
			
			ПолеСуммаРынок						= Префикс + "Сумма"		  + СуффиксПолейРыночныхСумм + Постфикс;
			ПолеСуммаРынокВВалютеУчета			= Префикс + "Сумма"		  + СуффиксПолейРыночныхСумм + "ВВалютеУчета" + Постфикс;
			ПолеСуммаКупонаРынок				= Префикс + "СуммаКупона" + СуффиксПолейРыночныхСумм + Постфикс;
			ПолеСуммаКупонаРынокВВалютеУчета	= Префикс + "СуммаКупона" + СуффиксПолейРыночныхСумм + "ВВалютеУчета" + Постфикс;
			ПолеСуммаВсегоРынок					= Префикс + "СуммаВсего"  + СуффиксПолейРыночныхСумм + Постфикс;
			ПолеСуммаВсегоРынокВВалютеУчета		= Префикс + "СуммаВсего"  + СуффиксПолейРыночныхСумм + "ВВалютеУчета" + Постфикс;
			
			// Если есть цены в валюте номинала, то считаем суммы по ним в валюте номинала
			// Если их нет, то считаем суммы по котировкам в их валюте
			
			Если ЕстьПолеЦены Тогда
				ПолеКотировки	= ПолеЦены;
				ВалютаКотировки	= ВалютаНоминала;
			КонецЕсли;
			
			Если ЕстьПолеЦеныКупона Тогда
				ПолеКотировкиКупона	  = ПолеЦеныКупона;
				ВалютаКотировкиКупона = ВалютаНоминала;
			КонецЕсли;
			
			ЕстьПолеСуммаРынок						= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеСуммаРынок);
			ЕстьПолеСуммаКупонаРынок		 		= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеСуммаКупонаРынок);
			ЕстьПолеСуммаРынокВВалютеУчета			= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеСуммаРынокВВалютеУчета);
			ЕстьПолеСуммаКупонаРынокВВалютеУчета	= ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеСуммаКупонаРынокВВалютеУчета);
			
			НадоРассчитатьСуммуРынок				= (ИзмененаЦена ИЛИ ИзмененныйРеквизит = "Количество" И ЗначениеЗаполнено(Контейнер[ПолеКотировки]));
			НадоРассчитатьСуммуКупонаРынок			= (ИзмененаЦенаКупона ИЛИ ИзмененныйРеквизит = "Количество" И ЗначениеЗаполнено(Контейнер[ПолеКотировкиКупона]));
			НадоРассчитатьСуммуВсегоРынок			= Ложь;
			
			// Суффикс полей рыночных сумм может и не быть указан,
			// в этом случае рыночные суммы будут посчитаны раньше
			
			Если НадоРассчитатьСуммуРынок И Не (НадоРассчитатьСумму И ПолеСуммаРынок = ПолеСумма) Тогда
				Контейнер[ПолеСуммаРынок] = Контейнер[ПолеКотировки] * Контейнер[ПолеКоличество];
				НадоРассчитатьСуммуВсегоРынок = Истина;
			КонецЕсли;
			
			Если НадоРассчитатьСуммуКупонаРынок И Не (НадоРассчитатьСуммуКупона И ПолеСуммаКупонаРынок = ПолеСуммаКупона) Тогда
				Контейнер[ПолеСуммаКупонаРынок] = Контейнер[ПолеКотировкиКупона] * Контейнер[ПолеКоличество];
				НадоРассчитатьСуммуВсегоРынок = Истина;
			КонецЕсли;
			
			Если НадоРассчитатьСуммуВсегоРынок 
				И ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеСуммаВсегоРынок)
			Тогда 
				Контейнер[ПолеСуммаВсегоРынок] = ?(ВалютаКотировки = ВалютаКотировкиКупона,
					Контейнер[ПолеСуммаРынок] + Контейнер[ПолеСуммаКупонаРынок],
					Неопределено); // Складывать суммы в разных валютах нельзя
			КонецЕсли;

			// Пересчет сумм в валюте учета
			
			ИзмененаСумма		= (ИзмененныйРеквизит = ПолеСуммаРынок ИЛИ ИзмененКурсВалютыНоминала И Не ЗначениеЗаполнено(Контейнер[ПолеКотировки]));
			ИзмененаСуммаКупона	= (ИзмененныйРеквизит = ПолеСуммаКупонаРынок ИЛИ ИзмененКурсВалютыНоминала И Не ЗначениеЗаполнено(Контейнер[ПолеКотировкиКупона]));
			
			ПересчитатьСуммуВВалютеУчета =
				Не (ИзмененаСумма ИЛИ ИзмененаСуммаКупона)
				ИЛИ ЕстьПолеСуммаРынокВВалютеУчета И Не ЗначениеЗаполнено(Контейнер[ПолеСуммаРынокВВалютеУчета])
				ИЛИ ЕстьПолеСуммаКупонаРынокВВалютеУчета И Не ЗначениеЗаполнено(Контейнер[ПолеСуммаКупонаРынокВВалютеУчета])
				ИЛИ (ЕстьПолеСуммаРынокВВалютеУчета ИЛИ ЕстьПолеСуммаКупонаРынокВВалютеУчета)
					И (Вопрос("Пересчитать сумму в валюте учёта?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да);
			
			НадоРассчитатьСуммуРынокВВалютеУчета = ЕстьПолеСуммаРынокВВалютеУчета
				И ПересчитатьСуммуВВалютеУчета И (НадоРассчитатьСуммуРынок ИЛИ ИзмененаСумма ИЛИ ИзмененКурсВалютыНоминала);
				
			НадоРассчитатьСуммуКупонаРынокВВалютеУчета = ЕстьПолеСуммаКупонаРынокВВалютеУчета
				И ПересчитатьСуммуВВалютеУчета И (НадоРассчитатьСуммуКупонаРынок ИЛИ ИзмененаСуммаКупона ИЛИ ИзмененКурсВалютыНоминала);

			Если НадоРассчитатьСуммуРынокВВалютеУчета ИЛИ НадоРассчитатьСуммуКупонаРынокВВалютеУчета Тогда
				
				ПоляВВалютеУчета			= ?(ИзмененаСумма, "Сумма", "Цена") + ", " + ?(ИзмененаСуммаКупона, "СуммаКупона", "ЦенаКупона");
				ПолеВВалютеКотировки		= ?(ИзмененаСумма, ПолеСуммаРынок, ПолеКотировки);
				ПолеВВалютеКотировкиКупона	= ?(ИзмененаСуммаКупона, ПолеСуммаКупонаРынок, ПолеКотировкиКупона);
				
				ПредопределенныйКурсВалютыКотировки =
					?(ЕстьПолеКурсаВалютыНоминала И ВалютаКотировки = ВалютаНоминала И ЗначениеЗаполнено(Контейнер[ПолеКурсВалютыНоминала]),
						Контейнер[ПолеКурсВалютыНоминала],
						Неопределено);
				
				Если ВалютаКотировки = ВалютаКотировкиКупона Тогда
					
					ДанныеВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
					    Новый Структура(ПоляВВалютеУчета, Контейнер[ПолеВВалютеКотировки], Контейнер[ПолеВВалютеКотировкиКупона]),
						ВалютаКотировки,
						ДанныеОбъекта.Организация,
						ДанныеОбъекта.Дата,
						ПредопределенныйКурсВалютыКотировки
					);
					
				Иначе
					
					ПредопределенныйКурсВалютыКотировкиКупона =
						?(ЕстьПолеКурсаВалютыНоминала И ВалютаКотировкиКупона = ВалютаНоминала И ЗначениеЗаполнено(Контейнер[ПолеКурсВалютыНоминала]),
							Контейнер[ПолеКурсВалютыНоминала],
							Неопределено);
					
					// в РаботаСВалютами.ПолучитьСуммуВВалютеУчета нельзя передать курс валюты, поэтому пока так (#Техдолг)
					
					ДанныеВВалютеУчета = Новый Структура(ПоляВВалютеУчета, 
						РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
							Новый Структура("Значение", Контейнер[ПолеВВалютеКотировки]),
							ВалютаКотировки,
							ДанныеОбъекта.Организация,
							ДанныеОбъекта.Дата,
							ПредопределенныйКурсВалютыКотировки).Значение,
						РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
							Новый Структура("Значение", Контейнер[ПолеВВалютеКотировкиКупона]),
							ВалютаКотировкиКупона,
							ДанныеОбъекта.Организация,
							ДанныеОбъекта.Дата,
							ПредопределенныйКурсВалютыКотировкиКупона).Значение
					);
					
				КонецЕсли;
				
				Если НадоРассчитатьСуммуРынокВВалютеУчета Тогда
					Контейнер[ПолеСуммаРынокВВалютеУчета] = ?(ИзмененаСумма, ДанныеВВалютеУчета.Сумма, ДанныеВВалютеУчета.Цена * Контейнер[ПолеКоличество]);
				КонецЕсли;
				
				Если НадоРассчитатьСуммуКупонаРынокВВалютеУчета Тогда
					Контейнер[ПолеСуммаКупонаРынокВВалютеУчета] = ?(ИзмененаСуммаКупона, ДанныеВВалютеУчета.СуммаКупона, ДанныеВВалютеУчета.ЦенаКупона * Контейнер[ПолеКоличество]);
				КонецЕсли;

			КонецЕсли;
			
			Если (НадоРассчитатьСуммуРынокВВалютеУчета
					ИЛИ НадоРассчитатьСуммуКупонаРынокВВалютеУчета
					ИЛИ ИзмененныйРеквизит = "СуммаВВалютеУчета"
					ИЛИ ИзмененныйРеквизит = "СуммаКупонаВВалютеУчета")
				И ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеСуммаВсегоРынокВВалютеУчета)
			Тогда
				Контейнер[ПолеСуммаВсегоРынокВВалютеУчета] = Контейнер[ПолеСуммаРынокВВалютеУчета] + Контейнер[ПолеСуммаКупонаРынокВВалютеУчета];
			КонецЕсли;

			#КонецОбласти
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	// Если есть поле суммы всего, то пересчитаем и его
	
	ПолеСуммаВсего = Префикс + "СуммаВсего" + Постфикс;

	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Контейнер, ПолеСуммаВсего) Тогда
		Контейнер[ПолеСуммаВсего] = Контейнер[ПолеСумма] + Контейнер[ПолеСуммаКупона];
	КонецЕсли;
	
КонецПроцедуры // Пересчитать

Процедура ПеренестиРеквизитыИзФормыВТаблицу(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт

	Перем ИменаРеквизитовКорзины, ИменаРеквизитовФормы;
	
	РеквизитыКорзины   = ПолучитьРеквизитыКорзиныЦенныхБумаг(Форма, ИмяКорзиныЦенныхБумаг, ИменаРеквизитовКорзины, ИменаРеквизитовФормы);
	КорзинаЦенныхБумаг = Форма.Объект[ИмяКорзиныЦенныхБумаг];
	
	Если КорзинаЦенныхБумаг.Количество() = 0 Тогда
		КорзинаЦенныхБумаг.Добавить();
	КонецЕсли;
	
	// т.к. состав реквизитов корзины в табличной части и на форме документа может различаться, чтобы не
	// париться с проверкой наличия реквизитов, воспользуемся мех-м заполнения через структуру
	ЗнчРеквизитовФормы = Новый Структура(ИменаРеквизитовФормы);
	ЗаполнитьЗначенияСвойств(ЗнчРеквизитовФормы, Форма);
	
	ЗнчРеквизитовКорзины = Новый Структура(ИменаРеквизитовКорзины);
	
	Для каждого РеквизитКорзины Из РеквизитыКорзины Цикл
		ЗнчРеквизитовКорзины[РеквизитКорзины] = ЗнчРеквизитовФормы[ИмяКорзиныЦенныхБумаг + РеквизитКорзины + "1"];
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(КорзинаЦенныхБумаг[0], ЗнчРеквизитовКорзины);
	
КонецПроцедуры // ПеренестиРеквизитыИзФормыВТаблицу

Процедура ПеренестиРеквизитыИзТаблицыВФорму(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт

	Перем ИменаРеквизитовКорзины, ИменаРеквизитовФормы;
	
	РеквизитыКорзины   = ПолучитьРеквизитыКорзиныЦенныхБумаг(Форма, ИмяКорзиныЦенныхБумаг, ИменаРеквизитовКорзины, ИменаРеквизитовФормы);
	КорзинаЦенныхБумаг = Форма.Объект[ИмяКорзиныЦенныхБумаг];
	
	Если КорзинаЦенныхБумаг.Количество() = 0 Тогда
		ОчиститьРеквизиты(Форма, Форма.Объект, ИмяКорзиныЦенныхБумаг);
		Возврат;
	КонецЕсли;
	
	ЗнчРеквизитовКорзины = Новый Структура(ИменаРеквизитовКорзины);
	ЗаполнитьЗначенияСвойств(ЗнчРеквизитовКорзины, КорзинаЦенныхБумаг[0]);
	
	ЗнчРеквизитовФормы = Новый Структура(ИменаРеквизитовФормы);
	
	Для каждого РеквизитКорзины Из РеквизитыКорзины Цикл
		ЗнчРеквизитовФормы[ИмяКорзиныЦенныхБумаг + РеквизитКорзины + "1"] = ЗнчРеквизитовКорзины[РеквизитКорзины];
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Форма, ЗнчРеквизитовФормы);
	
	// обновим описание номинала ц/б и сумму всего
	ЗаполнитьОписаниеНоминалаЦеннойБумаги(Форма, Форма.Объект.Дата, ИмяКорзиныЦенныхБумаг);
	
	Форма[ИмяКорзиныЦенныхБумаг + "СуммаВсего1"] = Форма[ИмяКорзиныЦенныхБумаг + "Сумма1"] + Форма[ИмяКорзиныЦенныхБумаг + "СуммаКупона1"];
	
КонецПроцедуры // ПеренестиРеквизитыИзТаблицыВФорму

Процедура ОчиститьРеквизиты(Форма, ДанныеОбъекта, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт
	
	Если Форма.КорзинаЦенныхБумаг Тогда
		
		ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Очистить();
		
	Иначе
		
		ПустыеРеквизитыФормы = Новый Структура();
		
		РеквизитыКорзины = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.РеквизитыКорзиныЦенныхБумаг, ",", Истина);
		Для каждого РеквизитКорзины Из РеквизитыКорзины Цикл
			ПустыеРеквизитыФормы.Вставить(ИмяКорзиныЦенныхБумаг + СокрЛП(РеквизитКорзины) + "1");
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(Форма, ПустыеРеквизитыФормы);
		
		Если Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя") Тогда
			Форма[ИмяКорзиныЦенныхБумаг + "Количество1"] = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОчиститьРеквизиты

Процедура ОбновитьРеквизитыПриИзмененииРежима(Форма, ДанныеОбъекта, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт
	
	Форма.Элементы.ФормаКомандаКорзинаЦенныхБумаг.Пометка = Форма.КорзинаЦенныхБумаг;
	
	Если Форма.КорзинаЦенныхБумаг Тогда
		ПеренестиРеквизитыИзФормыВТаблицу(Форма, ИмяКорзиныЦенныхБумаг);
	Иначе
		ПеренестиРеквизитыИзТаблицыВФорму(Форма, ИмяКорзиныЦенныхБумаг);
	КонецЕсли;
	
	Если Не Форма.КорзинаЦенныхБумаг И Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя") И Форма[ИмяКорзиныЦенныхБумаг + "Количество1"] <> 1 Тогда
		Форма[ИмяКорзиныЦенныхБумаг + "Количество1"] = 1;
	КонецЕсли;

КонецПроцедуры // ОбновитьРеквизитыПриИзмененииРежима

Функция ПолучитьРеквизитыКорзиныЦенныхБумаг(Форма, ИмяКорзиныЦенныхБумаг, ИменаРеквизитовКорзины, ИменаРеквизитовФормы)

	ИменаРеквизитовКорзины = Форма.РеквизитыКорзиныЦенныхБумаг;
	
	РеквизитыКорзины = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаРеквизитовКорзины, ",", Истина);
	
	ИменаРеквизитовФормы = Новый Массив();
	Для Инд = 0 По РеквизитыКорзины.ВГраница() Цикл
		РеквизитыКорзины[Инд] = СокрЛП(РеквизитыКорзины[Инд]);
		ИменаРеквизитовФормы.Добавить(ИмяКорзиныЦенныхБумаг + РеквизитыКорзины[Инд] + "1");
	КонецЦикла;
	
	ИменаРеквизитовФормы = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ИменаРеквизитовФормы, ",");
	
	Возврат РеквизитыКорзины;
	
КонецФункции // ПолучитьРеквизитыКорзиныЦенныхБумаг

////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ОТОБРАЖЕНИЕМ КОРЗИНЫ ЦЕННЫХ БУМАГ

&НаСервере
Процедура ЗаполнитьСоставКорзиныЦенныхБумаг(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги")
	
	Для каждого РеквизитКорзины Из Форма.ПолучитьРеквизиты("Объект." + ИмяКорзиныЦенныхБумаг) Цикл
		Форма.РеквизитыКорзиныЦенныхБумаг = Форма.РеквизитыКорзиныЦенныхБумаг
			+ ?(ПустаяСтрока(Форма.РеквизитыКорзиныЦенныхБумаг), "", ",") + РеквизитКорзины.Имя;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСоставКорзиныЦенныхБумаг

Процедура НазначитьТипыЦенныхБумаг(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт
	
	Рынок    = Форма.Объект.Рынок;
	Элементы = Форма.Элементы;
	
	Элементы[ИмяКорзиныЦенныхБумаг + "ЦеннаяБумага1"].ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Рынок);
	Элементы[ИмяКорзиныЦенныхБумаг + "ЦеннаяБумага"].ОграничениеТипа  = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Рынок);

КонецПроцедуры // НазначитьТипыЦенныхБумаг

Процедура НастроитьОтображение(Форма, ПриСозданииЧтенииНаСервере = Ложь) Экспорт

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если ПриСозданииЧтенииНаСервере Тогда
		
		#Если Сервер Тогда
		
		Если ПустаяСтрока(Форма.РеквизитыКорзиныЦенныхБумаг) Тогда
			ЗаполнитьСоставКорзиныЦенныхБумаг(Форма);
		КонецЕсли;
		
		Форма.ТекущийРынок       = Объект.Рынок;
		Форма.КорзинаЦенныхБумаг = (Объект.ЦенныеБумаги.Количество() > 1);
		
		Если Не Форма.КорзинаЦенныхБумаг Тогда
			ПеренестиРеквизитыИзТаблицыВФорму(Форма);
		КонецЕсли;
		
		Форма.ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
		
		#КонецЕсли
		
	КонецЕсли;
		
	// Установить флажок "Корзина ценных бумаг" нельзя, если выбрано более одной строки.Ввод, вывод и поручение - механизм корзины пока отключен.
	Элементы.ФормаКомандаКорзинаЦенныхБумаг.Доступность = (Форма.Объект.ЦенныеБумаги.Количество() < 2);
	
	// видимость реквизитов, зависимых от корзины ценных бумаг
	Элементы.СтраницаЦенныеБумагиБезКорзины.Видимость = Не Форма.КорзинаЦенныхБумаг;
	Элементы.СтраницаЦенныеБумагиКорзина.Видимость    = Форма.КорзинаЦенныхБумаг;
	
	НастроитьВидимостьДоступностьПолейВЗависимостиОтРынка(Форма);
	
	НазначитьТипыЦенныхБумаг(Форма);
	
	// в ряде документов ДепозитарныйСчет в табличной части, а в ряде - в шапке
	ЭлементЦенныеБумагиДепозитарныйСчет1	= Элементы.Найти("ЦенныеБумагиДепозитарныйСчет1");
	ЭлементЦенныеБумагиДепозитарныйСчет		= Элементы.Найти("ЦенныеБумагиДепозитарныйСчет");
	ЭлементЦенныеБумагиЦена					= Элементы.Найти("ЦенныеБумагиЦена");
	ЭлементЦенныеБумагиЦена1				= Элементы.Найти("ЦенныеБумагиЦена1");
	
	ЭтоРынокДеривативов = (Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы") 
							Или Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Опционы")
							Или Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы"));
							
	ЭтоРынокДолей		= Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли");
	
	Если ЭлементЦенныеБумагиДепозитарныйСчет1 <> Неопределено Тогда
		Элементы.ЦенныеБумагиДепозитарныйСчет1.Видимость = Не Форма.КорзинаЦенныхБумаг И НЕ ЭтоРынокДеривативов И НЕ ЭтоРынокДолей;
	КонецЕсли;
	
	Если ЭлементЦенныеБумагиЦена <> Неопределено Тогда
		Элементы.ЦенныеБумагиЦена.Видимость = Форма.КорзинаЦенныхБумаг И НЕ ЭтоРынокДолей;
	КонецЕсли;
	
	Если ЭлементЦенныеБумагиЦена1 <> Неопределено Тогда
		Элементы.ЦенныеБумагиЦена1.Видимость = Не Форма.КорзинаЦенныхБумаг И НЕ ЭтоРынокДолей;
	КонецЕсли;
	
	Если Форма.КорзинаЦенныхБумаг Тогда
		ЗаполнитьИтоговуюСтроку(Элементы.ИтоговаяСтрокаЦенныеБумаги, Объект.Рынок, Объект.ЦенныеБумаги);
	Иначе
		ОбновитьРеквизитыПриИзмененииРежима(Форма, Объект);
		ЗаполнитьОписаниеНоминалаЦеннойБумаги(Форма, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры // НастроитьОтображение

Процедура ИзменитьРежим(Форма) Экспорт

	Форма.КорзинаЦенныхБумаг = Не Форма.КорзинаЦенныхБумаг;
	
	ОбновитьРеквизитыПриИзмененииРежима(Форма, Форма.Объект);
	
	Если Форма.КорзинаЦенныхБумаг Тогда
		ЗаполнитьИтоговуюСтроку(Форма.Элементы.ИтоговаяСтрокаЦенныеБумаги, Форма.Объект.Рынок, Форма.Объект.ЦенныеБумаги);
	КонецЕсли;

	НастроитьОтображение(Форма);
	
КонецПроцедуры // ИзменитьРежим

Процедура ПриИзменении(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги", НоваяСтрока = Ложь) Экспорт
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;

	// для векселей кол-во не отображается и всегда = 1
	Если НоваяСтрока И Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя") Тогда
		Элементы.ЦенныеБумаги.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
	// видимость и доступность всегда определяем по таблице "ЦенныеБумаги"
	Элементы.ФормаКомандаКорзинаЦенныхБумаг.Доступность = (Объект.ЦенныеБумаги.Количество() < 2);
	
	// а вот с именем корзины могут быть варианты, например, в РЕПО
	ЗаполнитьИтоговуюСтроку(Элементы["ИтоговаяСтрока" + ИмяКорзиныЦенныхБумаг], Объект.Рынок, Объект[ИмяКорзиныЦенныхБумаг]);
	
КонецПроцедуры // ПослеОкончанияРедактирования

Процедура ПриИзмененииДаты(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт
	
	РеквизитыИсполнителя = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Форма.Объект, "Дата, Организация, СчетДоверительногоУправления");
	РеквизитыИсполнителя.Вставить("ДепозитарныйСчет");
	
	Если Форма.КорзинаЦенныхБумаг Тогда
		
		КэшПроверенныхСчетов = Новый Массив();
		КэшДействующихИсполнителей = Новый Массив();
		
		Для Каждого СтрокаКорзиныЦенныхБумаг Из Форма.Объект[ИмяКорзиныЦенныхБумаг] Цикл
			
			Если КэшПроверенныхСчетов.Найти(СтрокаКорзиныЦенныхБумаг.ДепозитарныйСчет) = Неопределено Тогда
				
				РеквизитыИсполнителя.ДепозитарныйСчет = СтрокаКорзиныЦенныхБумаг.ДепозитарныйСчет;
				
				Если РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоЦеннымБумагам", РеквизитыИсполнителя) Тогда
					КэшДействующихИсполнителей.Добавить(СтрокаКорзиныЦенныхБумаг.ДепозитарныйСчет);
				Иначе
					СтрокаКорзиныЦенныхБумаг.ДепозитарныйСчет = Неопределено;
				КонецЕсли;
				
				КэшПроверенныхСчетов.Добавить(СтрокаКорзиныЦенныхБумаг.ДепозитарныйСчет);
					
			ИначеЕсли КэшДействующихИсполнителей.Найти(СтрокаКорзиныЦенныхБумаг.ДепозитарныйСчет) = Неопределено Тогда 
				СтрокаКорзиныЦенныхБумаг.ДепозитарныйСчет = Неопределено;	
			КонецЕсли;
						
		КонецЦикла;
				
	Иначе
		
		РеквизитыИсполнителя.ДепозитарныйСчет = Форма[ИмяКорзиныЦенныхБумаг + "ДепозитарныйСчет1"];
		
		Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоЦеннымБумагам", РеквизитыИсполнителя) Тогда
			Форма[ИмяКорзиныЦенныхБумаг + "ДепозитарныйСчет1"] = Неопределено;
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииДаты

////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ОТОБРАЖЕНИЕМ КОРЗИНЫ ЦЕННЫХ БУМАГ

Процедура НастроитьВидимостьДоступностьПолейВЗависимостиОтРынка(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт

	ЭтоРынокОблигаций	= (Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	ЭтоРынокВекселей	= (Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя"));
	ЭтоРынокДеривативов	= (Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы") 
							Или Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Опционы")
							Или Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы"));
							
	ЭтоРынокДолей		= Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли");
	
	Элементы = Форма.Элементы;
		
	Если Форма.КорзинаЦенныхБумаг Тогда
		
		// количество
		Элементы[ИмяКорзиныЦенныхБумаг + "Количество"].Видимость = Не ЭтоРынокВекселей;
		
		// цены в % и купона
		Если Элементы.Найти(ИмяКорзиныЦенныхБумаг + "Цена") <> Неопределено Тогда
			Элементы[ИмяКорзиныЦенныхБумаг + "Цена"].Видимость        = Не ЭтоРынокВекселей;
			Элементы[ИмяКорзиныЦенныхБумаг + "ЦенаПроцент"].Видимость = ЭтоРынокОблигаций Или ЭтоРынокВекселей;
			Элементы[ИмяКорзиныЦенныхБумаг + "ЦенаКупона"].Видимость  = ЭтоРынокОблигаций;
		КонецЕсли;
		
		// суммы купона и всего
		Если Элементы.Найти(ИмяКорзиныЦенныхБумаг + "СуммаКупона") <> Неопределено Тогда
			Элементы[ИмяКорзиныЦенныхБумаг + "СуммаКупона"].Видимость = ЭтоРынокОблигаций;
			Элементы[ИмяКорзиныЦенныхБумаг + "СуммаВсего"].Видимость  = ЭтоРынокОблигаций;
		КонецЕсли;
		
		Если Элементы.Найти(ИмяКорзиныЦенныхБумаг + "ДепозитарныйСчет") <> Неопределено Тогда
			Элементы[ИмяКорзиныЦенныхБумаг + "ДепозитарныйСчет"].Видимость = НЕ ЭтоРынокДеривативов И НЕ ЭтоРынокДолей;
		КонецЕсли;	
		
	Иначе
		
		// количество
		Если Элементы.Найти(ИмяКорзиныЦенныхБумаг + "Количество1") <> Неопределено Тогда // в РЕПО для двух табличных частей количество общее
			Элементы[ИмяКорзиныЦенныхБумаг + "Количество1"].Видимость = Не ЭтоРынокВекселей;
		КонецЕсли;
		
		// цены
		Если Элементы.Найти(ИмяКорзиныЦенныхБумаг + "Цена1") <> Неопределено Тогда
			Элементы[ИмяКорзиныЦенныхБумаг + "Цена1"].Видимость        = Не ЭтоРынокВекселей;
			Элементы[ИмяКорзиныЦенныхБумаг + "ЦенаПроцент1"].Видимость = ЭтоРынокОблигаций Или ЭтоРынокВекселей;
			Элементы[ИмяКорзиныЦенныхБумаг + "ЦенаКупона1"].Видимость  = ЭтоРынокОблигаций;
		КонецЕсли;
		
		// суммы купона и всего
		Если Элементы.Найти(ИмяКорзиныЦенныхБумаг + "СуммаКупона1") <> Неопределено Тогда
			Элементы[ИмяКорзиныЦенныхБумаг + "СуммаКупона1"].Видимость = ЭтоРынокОблигаций;
			Элементы[ИмяКорзиныЦенныхБумаг + "СуммаВсего1"].Видимость  = ЭтоРынокОблигаций;
		КонецЕсли;
		
		Если Элементы.Найти(ИмяКорзиныЦенныхБумаг + "ДепозитарныйСчет1") <> Неопределено Тогда
			Элементы[ИмяКорзиныЦенныхБумаг + "ДепозитарныйСчет1"].Видимость = НЕ ЭтоРынокДеривативов И НЕ ЭтоРынокДолей;
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимостьДоступностьПолейВЗависимостиОтРынка

Процедура ПриИзмененииРынка(Форма, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт
	
	Если Форма.Объект.Рынок = Форма.ТекущийРынок Тогда // ничего менять не нужно
		Возврат;
	КонецЕсли;

	#Если Клиент Тогда
		
	// на текущий момент выбор рынка закладных возможен только в сделке
	Если Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Закладные")
		И ТипЗнч(Форма.Объект.Ссылка) <> Тип("ДокументСсылка.Сделка")
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На текущий момент допускается только покупка закладных");
		Форма.Объект.Рынок = Форма.ТекущийРынок;
		Возврат;
	КонецЕсли;
	
	ЭтоРынокДеривативов = (Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы") 
							Или Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Опционы")
							Или Форма.Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы"));
	
	Если ТипЗнч(Форма.Объект.Ссылка) <> Тип("ДокументСсылка.Сделка")
		И ТипЗнч(Форма.Объект.Ссылка) <> Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
		И ЭтоРынокДеривативов Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рынок фьючерсов доступен только для документа ""Сделка""!");
		Форма.Объект.Рынок = Форма.ТекущийРынок;
		Возврат;
	КонецЕсли;
		
	Если Форма.ТекущийРынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ПустаяСсылка") Тогда // подтверждения не требуются
		
		// если выбрана корзина ценных бумаг и добавлены строки корзины,
		// то после подтверждения очистим корзину
		ТребПодтверждение = Не Форма.КорзинаЦенныхБумаг Или (Форма.КорзинаЦенныхБумаг И Форма.Объект[ИмяКорзиныЦенныхБумаг].Количество() > 0);
		
		Если ТребПодтверждение Тогда
			Если Вопрос("Ценные бумаги и связанные с ними реквизиты будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда // возвращаем всё в зад
				Форма.Объект.Рынок = Форма.ТекущийРынок;
				Возврат;
			Иначе
				ОчиститьРеквизиты(Форма, Форма.Объект, ИмяКорзиныЦенныхБумаг);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоРынокДеривативов Тогда
		Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.Сделка") Тогда	
			Форма.Объект.ОтложенноеИсполнение = Ложь;
			Форма.Объект.РаздельноеИсполнение = Ложь;
			Форма.ВариантОплатыТорговойКомиссииСДатой = 0;
			Форма.ВариантыОплатыТорговойКомиссииБезДаты = 2;
			Форма.ВнебиржеваяСделка = Ложь;
		КонецЕсли;
	
		Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.Сделка") ИЛИ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда	
			Форма.СделкаЧерезБрокера = 1;
			Форма.Объект.РасчетныйСчет = Неопределено;
			Форма.Объект.МестоХранения = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FORTS");
		КонецЕсли;
	КонецЕсли;
	
	#Иначе
	
	ОчиститьРеквизиты(Форма, Форма.Объект, ИмяКорзиныЦенныхБумаг);
	
	#КонецЕсли
	
	Форма.ТекущийРынок = Форма.Объект.Рынок;
	
	Если Форма.КорзинаЦенныхБумаг И Форма.ТекущийРынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя") Тогда
		Форма[ИмяКорзиныЦенныхБумаг + "Количество1"] = 1;
	КонецЕсли;
	
	НазначитьТипыЦенныхБумаг(Форма, ИмяКорзиныЦенныхБумаг);
	
	НастроитьВидимостьДоступностьПолейВЗависимостиОтРынка(Форма, ИмяКорзиныЦенныхБумаг);
	
КонецПроцедуры // ПриИзмененииРынка

////////////////////////////////////////////////////////////////////////////////
// НОМИНАЛЫ И КОТИРОВКИ

&НаСервере
Процедура ЗаполнитьРыночнуюСтоимостьЦенныхБумаг(ДанныеОбъекта, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги", Знач АдресТаблицыСтоимостей = Неопределено, ИдентификаторСтроки = Неопределено, Знач ЦельРасчета = Неопределено, Отказ = Ложь, РасшифровкаРасчета = Неопределено) Экспорт
	
	ДокументЗаписан				= Не ДанныеОбъекта.Ссылка.Пустая();
	ОценкаПриВводеЦенныхБумаг	= (ТипЗнч(ДанныеОбъекта.Ссылка) = Тип("ДокументСсылка.ВводЦенныхБумаг"));
	ОценкаПриВыводеЦенныхБумаг	= (ТипЗнч(ДанныеОбъекта.Ссылка) = Тип("ДокументСсылка.ВыводЦенныхБумаг"));
	ОценкаДляСделки				= (ТипЗнч(ДанныеОбъекта.Ссылка) = Тип("ДокументСсылка.Сделка") ИЛИ ТипЗнч(ДанныеОбъекта.Ссылка) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке"));
	
	Если ИдентификаторСтроки = Неопределено Тогда
		ОтборСтрок			= Неопределено;
		СтрокиЦенныхБумаг	= ДанныеОбъекта[ИмяКорзиныЦенныхБумаг];
	ИначеЕсли ТипЗнч(ИдентификаторСтроки) = Тип("Массив") Тогда
		ОтборСтрок = Новый Массив;
		Для каждого Идентификатор Из ИдентификаторСтроки Цикл
			ОтборСтрок.Добавить(ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].НайтиПоИдентификатору(Идентификатор));
		КонецЦикла; 
		СтрокиЦенныхБумаг = ОтборСтрок;
	Иначе
		ЗаполняемаяСтрока	= ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].НайтиПоИдентификатору(ИдентификаторСтроки);
		ОтборСтрок			= РаботаСКоллекциями.ЗначениеВМассив(ЗаполняемаяСтрока);
		СтрокиЦенныхБумаг	= РаботаСКоллекциями.ЗначениеВМассив(ЗаполняемаяСтрока);
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		
		РасшифровкаПараметров = Новый Структура;
		
		СтрокиЦенныхБумаг = ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Выгрузить(ОтборСтрок); // при расшифровке расчета данные объекта не меняем
		
		// при вызове из формы сделки/исполнения не хватает ряда колонок,
		// которые есть, если вызывать из ввода/вывода бумаг
		
		Если ТипЗнч(ДанныеОбъекта) = Тип("ДанныеФормыСтруктура") И ОценкаДляСделки Тогда
		
			СтрокиЦенныхБумаг.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
			СтрокиЦенныхБумаг.Колонки.Добавить("СуммаВсегоРынок",				Новый ОписаниеТипов("Число"));
			СтрокиЦенныхБумаг.Колонки.Добавить("СуммаВсегоРынокВВалютеУчета",	Новый ОписаниеТипов("Число"));
			СтрокиЦенныхБумаг.Колонки.Добавить("СуммаРынок",					Новый ОписаниеТипов("Число"));
			СтрокиЦенныхБумаг.Колонки.Добавить("СуммаКупонаРынок",				Новый ОписаниеТипов("Число"));
			СтрокиЦенныхБумаг.Колонки.Добавить("СуммаРынокВВалютеУчета",		Новый ОписаниеТипов("Число"));
			СтрокиЦенныхБумаг.Колонки.Добавить("СуммаКупонаРынокВВалютеУчета",	Новый ОписаниеТипов("Число"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	#Область Определение_доступных_данных_об_оцениваемых_бумагах
	
	ЕстьПолеУчетныйАктивЕПС	= Не ОценкаДляСделки;
	ЕстьПоляПартий			= ОценкаПриВыводеЦенныхБумаг;
	
	ВыгружаемыеПоля = "ЦеннаяБумага, Количество" + ?(ЕстьПолеУчетныйАктивЕПС, ", УчетныйАктивЕПС", "") + ?(ЕстьПоляПартий, ", Партия, СтрокаПартии", "");
	
	ОцениваемыеБумаги = ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Выгрузить(ОтборСтрок, ВыгружаемыеПоля);
	
	Если Не ЕстьПолеУчетныйАктивЕПС Тогда
		ОцениваемыеБумаги.Колонки.Добавить("УчетныйАктивЕПС", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
	КонецЕсли;
	
	Если Не ЕстьПоляПартий Тогда
		ОцениваемыеБумаги.Колонки.Добавить("Партия",		Метаданные.ОпределяемыеТипы.Партия.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("СтрокаПартии",	Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
	КонецЕсли;
	
	ОцениваемыеБумаги.Индексы.Добавить("ЦеннаяБумага, Партия, СтрокаПартии");
	
	#КонецОбласти
	
	// Удалим строки с незаполненной ценной бумагой
	
	НезаполненныеЦенныеБумаги = Новый Массив;
	
	РаботаСКоллекциями.ДополнитьМассив(НезаполненныеЦенныеБумаги, ОцениваемыеБумаги.НайтиСтроки(Новый Структура("ЦеннаяБумага", РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ДанныеОбъекта.Рынок).ПривестиЗначение())));
	РаботаСКоллекциями.ДополнитьМассив(НезаполненныеЦенныеБумаги, ОцениваемыеБумаги.НайтиСтроки(Новый Структура("ЦеннаяБумага", Неопределено)));
	
	Для Каждого УдаляемаяСтрока Из НезаполненныеЦенныеБумаги Цикл
		ОцениваемыеБумаги.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Если ОцениваемыеБумаги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним параметры расчета
	
	ДатаОценки = ?(ЗначениеЗаполнено(ДанныеОбъекта.Дата), ДанныеОбъекта.Дата, КонецДня(ТекущаяДата()));  		
	
	Если ЦельРасчета = Неопределено Тогда
		ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация",					ДанныеОбъекта.Организация);
	ПараметрыРасчета.Вставить("Дата",							КонецДня(ДатаОценки));
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	ДанныеОбъекта.СчетДоверительногоУправления);
	ПараметрыРасчета.Вставить("ЦельРасчета",					ЦельРасчета);
	ПараметрыРасчета.Вставить("ВалютаУчета",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.Организация, "ВалютаУчета"));

	НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыРасчета.Дата, ПараметрыРасчета.Организация, ПараметрыРасчета.СчетДоверительногоУправления, ПараметрыРасчета.ЦельРасчета);
	ПараметрыРасчета.Вставить("ВидУчета",							НастройкиОценки.ВидУчетаДляОстатковПартий); 	
	ПараметрыРасчета.Вставить("ВариантРасчетаОценочнойСтоимости",	НастройкиОценки.ВариантРасчетаОценочнойСтоимости); 	
	
	Если Не ЗначениеЗаполнено(ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + ПараметрыРасчета.ЦельРасчета + "'", , , , Отказ);
		Возврат;
	ИначеЕсли Не ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом Тогда
		АдресТаблицыСтоимостей = Неопределено;
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаПараметров.Вставить("ДокументЗаписан",				ДокументЗаписан);
		РасшифровкаПараметров.Вставить("ОценкаПриВводеЦенныхБумаг",		ОценкаПриВводеЦенныхБумаг);
		РасшифровкаПараметров.Вставить("ОценкаПриВыводеЦенныхБумаг",	ОценкаПриВыводеЦенныхБумаг);
		РасшифровкаПараметров.Вставить("РасчетПоПисьмуЦБ0185316",		НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316);
	КонецЕсли;	
	
	// Иногда требуется использовать стоимость на предыдущую оценку
	
	ПолучитьСтоимостьНаПредыдущуюОценку = Ложь;
	
	Если (ОценкаПриВводеЦенныхБумаг ИЛИ ОценкаПриВыводеЦенныхБумаг) И ПараметрыРасчета.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		
		#Область Определение_необходимости_получения_стоимости_на_предыдущую_оценку
		
	    СчетДУДляУчета = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ДанныеОбъекта.СчетДоверительногоУправления);
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаОценки, ДанныеОбъекта.Организация, СчетДУДляУчета);

		Если НастройкиУчета.НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода Тогда
			
			ПолучитьСтоимостьНаПредыдущуюОценку = Истина;
			
			ДатаПредыдущейОценки = ?(ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении,
				Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(ДанныеОбъекта.СчетДоверительногоУправления, ДатаОценки),
				НачалоДня(НачалоДня(ДатаОценки) - 1));
				
			ПараметрыРасчета.Дата = КонецДня(ДатаПредыдущейОценки);	
				
		КонецЕсли;	
		
		#КонецОбласти
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаПараметров.Вставить("ПолучитьСтоимостьНаПредыдущуюОценку",	ПолучитьСтоимостьНаПредыдущуюОценку);
		РасшифровкаПараметров.Вставить("ДатаОценкиСправедливойСтоимости",		ПараметрыРасчета.Дата);
	КонецЕсли;	
	
	// Бумаги, оцениваемые по амортизированной стоимости, считаются особым образом,
	// поэтому требуется определить, есть ли такие среди оцениваемых
	
	ЕстьОцениваемыеПоАмортизированнойСтоимости = Ложь;
	
	Если ПараметрыРасчета.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет
		И ДанныеОбъекта.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
		И ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении
		И РаботаСПереоценкой.ИспользуетсяОценкаПоАмортизированнойСтоимости(ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости, ПараметрыРасчета.Дата)
	Тогда
	
		#Область Получение_учетных_активов_ЕПС
		
		УчетныеАктивыОцениваемыеПоАС = Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости();
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		РаботаСЦеннымиБумагами.ЗаполнитьУчетныеАктивыЕПСИПоместитьВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, ДатаОценки, ДанныеОбъекта, ОцениваемыеБумаги, "_УчетныеАктивыЕПС", Отказ);
		
		УчетныеАктивыЕПС = МенеджерВременныхТаблиц.Таблицы["_УчетныеАктивыЕПС"].ПолучитьДанные().Выгрузить();
		УчетныеАктивыЕПС.Индексы.Добавить("ЦеннаяБумага, Партия, СтрокаПартии");
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "УчетныеАктивыЕПС", УчетныеАктивыЕПС.Скопировать(), "Учетные активы ЕПС", Истина);  
		КонецЕсли;
		
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед расчетом рыночной стоимости необходимо заполнить учетный актив вручную для этих ценных бумаг");
			Возврат;
		КонецЕсли;
		
		#КонецОбласти
		
		ОцениваемыеПоАмортизированнойСтоимости = УчетныеАктивыЕПС.Скопировать(Новый Структура("ОценкаПоАмортизированнойСтоимости", Истина), "ЦеннаяБумага, Партия, СтрокаПартии, Количество");	
		ОцениваемыеПоАмортизированнойСтоимости.Свернуть("ЦеннаяБумага, Партия, СтрокаПартии", "Количество");
		
		ЕстьОцениваемыеПоАмортизированнойСтоимости = (ОцениваемыеПоАмортизированнойСтоимости.Количество() > 0);
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаПараметров.Вставить("ЕстьОцениваемыеПоАмортизированнойСтоимости", ЕстьОцениваемыеПоАмортизированнойСтоимости);
	КонецЕсли;	
	
	// Расчет стоимости ценных бумаг с учетом указания ЦБ РФ № 6073-У следует выполнять в разрезе партий,
	// т.к. цены партий могут отличаться в зависимости от даты приобретения
	// При выводе ценных бумаг, оцениваемых по амортизированной стоимости, нужно получить выводимые партии
	
	РасчетПоПартиям = ОценкаПриВыводеЦенныхБумаг
		И (ЕстьОцениваемыеПоАмортизированнойСтоимости И ДокументЗаписан
			ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316
			ИЛИ НастройкиОценки.ВестиРасчетПоПартиям);
	
	Если РасчетПоПартиям Тогда
		
		Если Не ДокументЗаписан Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет рыночной стоимости выводимых партий ценных бумаг необходимо выполнять после записи документа", , , , Отказ);
			Возврат;
		КонецЕсли;
		
		ВзятьПартииИзДвижений = РегистрыСведений.ДатыЗапретаРедактирования.ПроверитьЗапретРедактирования(ДатаОценки,
			Новый Структура("Организация, СчетДоверительногоУправления, ГруппаЗапрета, ВидУчета",
				ДанныеОбъекта.Организация, ДанныеОбъекта.СчетДоверительногоУправления, Перечисления.ГруппыЗапретаРедактирования.Партии, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет));	
			
		Если ВзятьПартииИзДвижений Тогда
			
			#Область Чтение_выводимых_партий_из_движений			
			
			ЗаписанныеПартии = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумаг
				|ГДЕ
				|	Регистратор = &Регистратор
				|	И ВидУчета = &ВидУчета
				|	И Активность");
			
			ЗаписанныеПартии.УстановитьПараметр("Регистратор",	ДанныеОбъекта.Ссылка);
			ЗаписанныеПартии.УстановитьПараметр("ВидУчета",		Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
			
			ВыводимыеПартии = ЗаписанныеПартии.Выполнить().Выгрузить();
			
			#КонецОбласти
			
		Иначе
			
			#Область Расчет_выводимых_партий
			
			РеквизитыОценки = РаботаСКоллекциями.СкопироватьСтруктуру(ПараметрыРасчета);
			РеквизитыОценки.Вставить("Дата",   КонецДня(ДатаОценки)); // Т.к. цены иногда берутся на предыдущую оценку, а партии считаем именно на дату оценки 
			РеквизитыОценки.Вставить("Ссылка", Документы.РегистрацияСтоимостиПереоценки.ПустаяСсылка());
			
			ПараметрыПолученияПартий = РаботаСПереоценкой.ПолучитьПараметрыПолученияПартийПоМетодике(
				РеквизитыОценки.ЦельРасчета, РеквизитыОценки.ВидУчета, РеквизитыОценки.ВариантРасчетаОценочнойСтоимости, РеквизитыОценки.Дата, , РеквизитыОценки.СчетДоверительногоУправления);
			
			// Если документ не проведен, то передадим его движения через таблицу плановых операций
			
			ТаблицаПлановыхОпераций	= Неопределено;	

			Если Не ДанныеОбъекта.Проведен Тогда 
				
				#Область Заполнение_таблицы_плановых_операций
				
				ТаблицаПлановыхОпераций = РегистрыСведений.ОперацииСЦеннымиБумагами.ПолучитьОписаниеТаблицыПлановыхОпераций();
				
				Для Каждого СтрокаЦеннойБумаги Из ОцениваемыеБумаги Цикл
					
					СтрокаПлановойОперации = ТаблицаПлановыхОпераций.Добавить();
					
					СтрокаПлановойОперации.Период			= ДатаОценки;
					СтрокаПлановойОперации.МоментВремени	= ДатаОценки;
					СтрокаПлановойОперации.Регистратор		= ДанныеОбъекта.Ссылка;
					СтрокаПлановойОперации.ВидДвижения		= Перечисления.ВидыДвижений.Расход;
					
					СтрокаПлановойОперации.Рынок			= ДанныеОбъекта.Рынок;
					СтрокаПлановойОперации.ЦеннаяБумага		= СтрокаЦеннойБумаги.ЦеннаяБумага;
					СтрокаПлановойОперации.Количество		= СтрокаЦеннойБумаги.Количество;
					
					СтрокаПлановойОперации.Партия			= СтрокаЦеннойБумаги.Партия;
					СтрокаПлановойОперации.СтрокаПартии		= СтрокаЦеннойБумаги.СтрокаПартии;
					СтрокаПлановойОперации.УчетныйАктивЕПС	= СтрокаЦеннойБумаги.УчетныйАктивЕПС;
					
					Если Не ЗначениеЗаполнено(СтрокаПлановойОперации.УчетныйАктивЕПС) Тогда
						
						СтрокиУчетногоАктиваЕПС = УчетныеАктивыЕПС.НайтиСтроки(
							Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", СтрокаПлановойОперации.ЦеннаяБумага, СтрокаПлановойОперации.Партия, СтрокаПлановойОперации.СтрокаПартии));
						
						Если СтрокиУчетногоАктиваЕПС.Количество() > 0 Тогда
							СтрокаПлановойОперации.УчетныйАктивЕПС = СтрокиУчетногоАктиваЕПС[0].УчетныйАктивЕПС; 
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				#КонецОбласти
				
			КонецЕсли;	
			
			// Рассчитаем партии

			СообщенияДоРасчета = ПолучитьСообщенияПользователю(Истина);
			
			УстановитьПривилегированныйРежим(Истина);
			
			Попытка
				
				РасчетПартий = Неопределено;
				
				РаботаСПереоценкой.ПолучитьЦенныеБумаги(
					РеквизитыОценки, Новый МенеджерВременныхТаблиц, "ТаблицаПартийЦБ",
					ПараметрыПолученияПартий,
					РасчетПартий, ТаблицаПлановыхОпераций);
					
			Исключение
				
				РасчетПартий				= Неопределено;
				ТекстОшибки					= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстСообщенийПользователю	= ОбщегоНазначения.ПолучитьТекстСообщенийПользователю(Символы.ПС, Ложь);
				
				РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(
					ТекстОшибки + ?(ПустаяСтрока(ТекстСообщенийПользователю), "", Символы.ПС + "Сообщения пользователю:" + Символы.ПС + ТекстСообщенийПользователю),
					"Заполнение рыночной стоимости ценных бумаг");
				
			КонецПопытки;
			
			УстановитьПривилегированныйРежим(Ложь);
			
			СообщенияПослеРасчета = ПолучитьСообщенияПользователю(Истина);
			
			ОбщегоНазначения.ВывестиСообщенияПользователю(СообщенияДоРасчета);
			ОбщегоНазначения.ВывестиСообщенияПользователю(СообщенияПослеРасчета);
			
			Если ТипЗнч(РасчетПартий) <> Тип("ОбработкаОбъект.РасчетПартий") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет выводимых партий не выполнен. Заполнение рыночной стоимости ценных бумаг прекращено.", , , , Отказ);
				Возврат;
			КонецЕсли;
			
			ВыводимыеПартии = РасчетПартий.РассчитанныеПартии.Выгрузить();	
			
			#КонецОбласти
			
		КонецЕсли;
		
		ОтборПартий = Новый Структура("Регистратор", ДанныеОбъекта.Ссылка);
		ОтборПартий.Вставить("ВидДвижения", ?(ВзятьПартииИзДвижений, ВидДвиженияНакопления.Расход, Перечисления.ВидыДвижений.Расход));
		
		Если ИдентификаторСтроки <> Неопределено Тогда
			
			ОтборПартий.Вставить("ЦеннаяБумага", ЗаполняемаяСтрока.ЦеннаяБумага);
			
			Если ЕстьПоляПартий И ЗначениеЗаполнено(ЗаполняемаяСтрока.Партия) И ЗначениеЗаполнено(ЗаполняемаяСтрока.СтрокаПартии) Тогда
				ОтборПартий.Вставить("Партия",		 ЗаполняемаяСтрока.Партия);
				ОтборПартий.Вставить("СтрокаПартии", ЗаполняемаяСтрока.СтрокаПартии);
			КонецЕсли;
			
		КонецЕсли;		
		
		ТаблицаЦБ = ВыводимыеПартии.Скопировать(ОтборПартий, "Рынок, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС, Количество, СуммаРезервовПодОбесценение");
		ТаблицаЦБ.Колонки.Добавить("ТипЗадолженности",	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		
	Иначе
		
		ТаблицаЦБ = ОцениваемыеБумаги.Скопировать(Неопределено, "ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС, Количество");
		ТаблицаЦБ.Колонки.Добавить("Рынок",							Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
		ТаблицаЦБ.Колонки.Добавить("ТипЗадолженности",				Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		ТаблицаЦБ.Колонки.Добавить("СуммаРезервовПодОбесценение",	Метаданные.РегистрыНакопления.БухПартииЦенныхБумаг.Ресурсы.СуммаРезервовПодОбесценение.Тип);
		ТаблицаЦБ.ЗаполнитьЗначения(ДанныеОбъекта.Рынок, "Рынок");
		
		// Т.к. без партий амортизированную стоимость рассчитать нельзя, то из оценки такие бумаги исключаем 
		
		Если ЕстьОцениваемыеПоАмортизированнойСтоимости Тогда
		
			#Область Удаление_бумаг_оцениваемых_по_амортизированной_стоимости
			
			Для Каждого СтрокаЦеннойБумаги Из ОцениваемыеПоАмортизированнойСтоимости Цикл
				
				УдаляемыеСтроки = ТаблицаЦБ.НайтиСтроки(
					Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", СтрокаЦеннойБумаги.ЦеннаяБумага, СтрокаЦеннойБумаги.Партия, СтрокаЦеннойБумаги.СтрокаПартии));
				
				Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
					ТаблицаЦБ.Удалить(УдаляемаяСтрока);
				КонецЦикла;
				
			КонецЦикла;
			
			#КонецОбласти
		
		КонецЕсли;

	КонецЕсли;	
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаПараметров.Вставить("РасчетПоПартиям", РасчетПоПартиям);
	КонецЕсли;	
	
	// Получение стоимостей, рассчитанных по методике клиента	
			
	УстановитьПривилегированныйРежим(Истина);	
	
	ПереоценкаЦБ = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
	
	Если ТаблицаЦБ.Количество() > 0 Тогда
		
		Если ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом
			И АдресТаблицыСтоимостей = Неопределено
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные об оценочной стоимости ценных бумаг, предоставленные клиентом", , , , Отказ);
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПереоценкаЦБ, ПараметрыРасчета);
		
		ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
		ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ОценкаПриВводеВыводеЦенныхБумаг", ОценкаПриВводеЦенныхБумаг ИЛИ ОценкаПриВыводеЦенныхБумаг);
		ПереоценкаЦБ.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, АдресТаблицыСтоимостей, Ложь, РасшифровкаРасчета, ТаблицаЦБ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаСтоимостей = ПереоценкаЦБ.СтоимостиПереоценки.Выгрузить();
	ТаблицаСтоимостей.Колонки.Сумма.Имя					  = "СуммаРынок";
	ТаблицаСтоимостей.Колонки.СуммаКупона.Имя			  = "СуммаКупонаРынок";
	ТаблицаСтоимостей.Колонки.СуммаВВалютеУчета.Имя		  = "СуммаРынокВВалютеУчета";
	ТаблицаСтоимостей.Колонки.СуммаКупонаВВалютеУчета.Имя = "СуммаКупонаРынокВВалютеУчета";
	
	УстановитьПривилегированныйРежим(Ложь);

	// Избавляемся от партий 
	
	ОтборУсредняемыхСтрок = Новый Структура;
	
	Если ЕстьПоляПартий Тогда
		
		#Область Очистка_партий_в_таблице_стоимостей_для_оцениваемых_без_партий_бумаг
		
		ОчищаемыеПоля = Новый Структура("Партия, СтрокаПартии", Неопределено, 0);

		ТаблицаСтоимостей.Колонки.Добавить("ЕстьДанныеОПартии", Новый ОписаниеТипов("Булево"));
		
		Для Каждого СтрокаЦеннойБумаги Из ТаблицаСтоимостей Цикл
			
			Если СтрокаЦеннойБумаги.Партия <> Неопределено Тогда // Партия заполнена, либо с пустой ссылкой
				
				Если ЗначениеЗаполнено(СтрокаЦеннойБумаги.Партия) И ЗначениеЗаполнено(СтрокаЦеннойБумаги.СтрокаПартии) Тогда
				
					ПараметрыПоиска = Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии",
						СтрокаЦеннойБумаги.ЦеннаяБумага, СтрокаЦеннойБумаги.Партия, СтрокаЦеннойБумаги.СтрокаПартии);
					
					СтрокаЦеннойБумаги.ЕстьДанныеОПартии = (ОцениваемыеБумаги.НайтиСтроки(ПараметрыПоиска).Количество() > 0);
					
				КонецЕсли;	
					
				Если Не СтрокаЦеннойБумаги.ЕстьДанныеОПартии Тогда
					ЗаполнитьЗначенияСвойств(СтрокаЦеннойБумаги, ОчищаемыеПоля);
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЦикла;

		// Если хоть в одной строке есть данные о партии, то для усреднения нужен дополнительный отбор
		
		Если ТаблицаСтоимостей.Найти(Истина, "ЕстьДанныеОПартии") <> Неопределено Тогда
			ОтборУсредняемыхСтрок.Вставить("ЕстьДанныеОПартии", Ложь); 
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	Если РасчетПоПартиям Тогда
		
		// При оценке с учетом указания ЦБ РФ № 6073-У, либо для бумаг, оцененных по АС, рассчитываем среднюю цену
		
		ОчищаемыеПоля = Новый Структура("ЦенаКотировки", 0, Неопределено, 0);
		
		Если НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316 Тогда
			РаботаСКоллекциями.ДополнитьСтруктуру(ОчищаемыеПоля, Новый Структура("ВидЦены, УровеньОценки, ДатаЦены, Источник", Перечисления.ИсточникиЦеныДляПереоценки.РасчетнаяЦена, 0, '00010101', Неопределено));
		Иначе
			РаботаСКоллекциями.ДополнитьСтруктуру(ОтборУсредняемыхСтрок, Новый Структура("ВидЦены", Перечисления.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость));
		КонецЕсли;
		
		УсредняемыеСтроки = ?(ОтборУсредняемыхСтрок.Количество() = 0, ТаблицаСтоимостей, ТаблицаСтоимостей.НайтиСтроки(ОтборУсредняемыхСтрок));
		Для Каждого СтрокаЦеннойБумаги Из УсредняемыеСтроки Цикл
			ЗаполнитьЗначенияСвойств(СтрокаЦеннойБумаги, ОчищаемыеПоля); 
		КонецЦикла;
		
		ТаблицаСтоимостей.Свернуть(
			"ЦеннаяБумага, Партия, СтрокаПартии, ЦенаКотировки, ВалютаКотировки, ЦенаКотировкиКупона, ВалютаКотировкиКупона, ВидЦены, УровеньОценки, ДатаЦены, Источник" + ?(ОтборУсредняемыхСтрок.Свойство("ЕстьДанныеОПартии"), ", ЕстьДанныеОПартии", ""),
			"Количество, СуммаРынок, СуммаКупонаРынок, СуммаРынокВВалютеУчета, СуммаКупонаРынокВВалютеУчета");	
		
		УсредняемыеСтроки = ?(ОтборУсредняемыхСтрок.Количество() = 0, ТаблицаСтоимостей, ТаблицаСтоимостей.НайтиСтроки(ОтборУсредняемыхСтрок));
		Для Каждого СтрокаЦеннойБумаги Из УсредняемыеСтроки Цикл
			СтрокаЦеннойБумаги.ЦенаКотировки = СтрокаЦеннойБумаги.СуммаРынок / СтрокаЦеннойБумаги.Количество;	
		КонецЦикла;
		
	Иначе
		
		// Добавляем строки с бумагами, оцениваемыми по АС, заполнив вид цены
		
		Если ЕстьОцениваемыеПоАмортизированнойСтоимости Тогда
			
			#Область Добавление_бумаг_оцениваемых_по_амортизированной_стоимости
			
			Для Каждого СтрокаЦеннойБумаги Из ОцениваемыеПоАмортизированнойСтоимости Цикл
				
				СтрокиСтоимостейЦБ = ТаблицаСтоимостей.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокиСтоимостейЦБ, СтрокаЦеннойБумаги);
				
				СтрокиСтоимостейЦБ.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость;
				
			КонецЦикла;
			
			Если ОценкаПриВводеЦенныхБумаг Тогда
				ТекстШаблонаСообщения = "Расчет рыночной стоимости ценных бумаг, оцениваемых по амортизированной стоимости, выполнен по данным ТЧ ""В валюте учета"" и ""Группа ЕПС""";
			Иначе
				ТекстШаблонаСообщения = "Расчет рыночной стоимости ценных бумаг, оцениваемых по амортизированной стоимости, необходимо выполнить после записи документа";
			КонецЕсли;
			
			ЦенныеБумагиОцениваемыеПоАмортизированнойСтоимости = ОцениваемыеПоАмортизированнойСтоимости.Скопировать(Неопределено, "ЦеннаяБумага");
			ЦенныеБумагиОцениваемыеПоАмортизированнойСтоимости.Свернуть("ЦеннаяБумага");
			ЦенныеБумагиОцениваемыеПоАмортизированнойСтоимости = ЦенныеБумагиОцениваемыеПоАмортизированнойСтоимости.ВыгрузитьКолонку("ЦеннаяБумага");
			
			ТекстСообщения = СтрШаблон(ТекстШаблонаСообщения + ":" + Символы.ПС + "- %1", СтрСоединить(ЦенныеБумагиОцениваемыеПоАмортизированнойСтоимости, Символы.ПС + "- "));
			
			Если РасшифровкаРасчета = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе	
				РасшифровкаПараметров.Вставить("РасчетАмортизированойСтоимости", ТекстШаблонаСообщения);
			КонецЕсли;	
				
			#КонецОбласти	
				
		КонецЕсли;
		
		ТаблицаСтоимостей.Свернуть("ЦеннаяБумага, Партия, СтрокаПартии, ЦенаКотировки, ВалютаКотировки, ЦенаКотировкиКупона, ВалютаКотировкиКупона, ВидЦены, УровеньОценки, ДатаЦены, Источник", "Количество, СуммаРынок, СуммаКупонаРынок, СуммаРынокВВалютеУчета, СуммаКупонаРынокВВалютеУчета");	
		
	КонецЕсли;

	ТаблицаСтоимостей.Индексы.Добавить("ЦеннаяБумага, Партия, СтрокаПартии");
	
	// Количество должно браться из переданной таблицы ЦБ, но мало ли, проверим на всякий случай
	
	КоличествоЦБ = ОцениваемыеБумаги.Скопировать(Неопределено, "ЦеннаяБумага, Количество");
	КоличествоЦБ.Свернуть("ЦеннаяБумага", "Количество");
	
	КоличествоОцененныхЦБ = ТаблицаСтоимостей.Скопировать(Неопределено, "ЦеннаяБумага, Количество");
	КоличествоОцененныхЦБ.Свернуть("ЦеннаяБумага", "Количество");
	
	Для Каждого СтрокаЦеннойБумаги Из КоличествоЦБ Цикл
		СтрокаОцененнойЦБ = КоличествоОцененныхЦБ.Найти(СтрокаЦеннойБумаги.ЦеннаяБумага, "ЦеннаяБумага");
		Если СтрокаОцененнойЦБ <> Неопределено И СтрокаОцененнойЦБ.Количество <> СтрокаЦеннойБумаги.Количество Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка расчета рыночной стоимости " + Строка(СтрокаЦеннойБумаги.ЦеннаяБумага) + ": расчетное количество отличается от количества в табличной части", , , , Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;		
	
	// Непосредственно заполнение стоимости
	
	РаспределяемыеПоля = СтрРазделить("Количество, СуммаРынок, СуммаКупонаРынок, СуммаРынокВВалютеУчета, СуммаКупонаРынокВВалютеУчета", ", ", Ложь);
	
	#Область Варианты_округления_валютных_сумм_при_расчете_сумм_в_валюте_учета 	
	
	ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета = РаботаСПереоценкой.ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета(
		ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости, ПараметрыРасчета.СчетДоверительногоУправления, ПараметрыРасчета.Дата); 
		
	РассчитыватьСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы = (ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму <> "НеОкруглять");	
		
	Если РассчитыватьСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы Тогда
		Если ТипЗнч(ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму) <> Тип("Число") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Неизвестный вариант округления валютной суммы '%1'", ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму), , , , Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	РассчитыватьСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы = (ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона <> "НеОкруглять");	
	
	Если РассчитыватьСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы Тогда
		Если ТипЗнч(ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона) <> Тип("Число") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Неизвестный вариант округления валютной суммы купона '%1'", ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона), , , , Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаПараметров.Вставить("РассчитыватьСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы",		РассчитыватьСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы);
		РасшифровкаПараметров.Вставить("ТочностьОкругленнойВалютнойСуммы",								ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму);
		РасшифровкаПараметров.Вставить("РассчитыватьСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы",	РассчитыватьСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы);
		РасшифровкаПараметров.Вставить("ТочностьОкругленнойВалютнойСуммыКупона",						ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона);
	КонецЕсли;	
	
	#КонецОбласти	

	Для Каждого СтрокаЦеннойБумаги Из СтрокиЦенныхБумаг Цикл
		
		РасчетныеПоля = Новый Структура("ВидЦены, УровеньОценки, ДатаЦены, Источник, ЦенаКотировки, ВалютаКотировки, ЦенаКотировкиКупона, ВалютаКотировкиКупона, СуммаРынок, СуммаКупонаРынок, СуммаРынокВВалютеУчета, СуммаКупонаРынокВВалютеУчета",
			Неопределено, 0, '00010101', Неопределено, 0, Неопределено, 0, Неопределено, 0, 0, 0, 0);
		
		РасчетнаяСтоимостьЦБ = Неопределено;
		
		#Область Поиск_строки_с_рассчитанной_стоимостью

		Если ЕстьПоляПартий И ЗначениеЗаполнено(СтрокаЦеннойБумаги.Партия) И ЗначениеЗаполнено(СтрокаЦеннойБумаги.СтрокаПартии) Тогда
			
			РасчетныеСтоимостиЦБ = ТаблицаСтоимостей.НайтиСтроки(
				Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", СтрокаЦеннойБумаги.ЦеннаяБумага, СтрокаЦеннойБумаги.Партия, СтрокаЦеннойБумаги.СтрокаПартии));
			
			Если РасчетныеСтоимостиЦБ.Количество() > 0 Тогда
				РасчетнаяСтоимостьЦБ = РасчетныеСтоимостиЦБ[0];
			КонецЕсли;
			
		КонецЕсли;
		
		Если РасчетнаяСтоимостьЦБ = Неопределено Тогда
			
			РасчетныеСтоимостиЦБ = ТаблицаСтоимостей.НайтиСтроки(
				Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", СтрокаЦеннойБумаги.ЦеннаяБумага, Неопределено, 0));
				
			Если РасчетныеСтоимостиЦБ.Количество() > 0 Тогда
				
				Если ЕстьОцениваемыеПоАмортизированнойСтоимости Тогда
				
					// Потенциально возможна ситуация, что один актив будет по двум видам - АС и СС:
					// АС-ные активы должны быть с видом цены "АмортизированнаяСтоимость", а СС - с любым другим видом цены
					
					#Область Определяем_учетный_актив_ЕПС
					
					УчетныйАктивЕПС = СтрокаЦеннойБумаги.УчетныйАктивЕПС;
					
					Если Не ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда
					
						Если ЕстьПоляПартий Тогда
							ОтборУчетныхАктивов = Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", СтрокаЦеннойБумаги.ЦеннаяБумага, СтрокаЦеннойБумаги.Партия, СтрокаЦеннойБумаги.СтрокаПартии);
						Иначе
							ОтборУчетныхАктивов = Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", СтрокаЦеннойБумаги.ЦеннаяБумага, Неопределено, 0);
						КонецЕсли;
							
						СтрокиУчетногоАктиваЕПС = УчетныеАктивыЕПС.НайтиСтроки(ОтборУчетныхАктивов);	
								
						Если СтрокиУчетногоАктиваЕПС.Количество() > 0 Тогда
							УчетныйАктивЕПС = СтрокиУчетногоАктиваЕПС[0].УчетныйАктивЕПС; 
						КонецЕсли;
						
					КонецЕсли;
					
					#КонецОбласти
					
					Для Каждого СтрокаРасчетныеСтоимостиЦБ Из РасчетныеСтоимостиЦБ Цикл
						
						Если УчетныеАктивыОцениваемыеПоАС.Найти(УчетныйАктивЕПС) <> Неопределено
							= (СтрокаРасчетныеСтоимостиЦБ.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
						Тогда
							РасчетнаяСтоимостьЦБ = СтрокаРасчетныеСтоимостиЦБ;		
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					РасчетнаяСтоимостьЦБ = РасчетныеСтоимостиЦБ[0];
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
		#КонецОбласти
		
		Если РасчетнаяСтоимостьЦБ <> Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(РасчетныеПоля, РасчетнаяСтоимостьЦБ, "ВидЦены, УровеньОценки, ДатаЦены, Источник, ЦенаКотировки, ВалютаКотировки, ЦенаКотировкиКупона, ВалютаКотировкиКупона");
			
			Если РасчетнаяСтоимостьЦБ.Количество > 0 Тогда // Если количество не заполнено, значит, нужна только цена, а суммы нет
			
				РаспределеноВсеКоличество = (СтрокаЦеннойБумаги.Количество = РасчетнаяСтоимостьЦБ.Количество);
				
				// При вводе бумаг, оцениваемых по АС, указываем цены, посчитанные из сумм табличной части,
				// в остальных случаях берем цены, рассчитанные по методике 
				
				Если ОценкаПриВводеЦенныхБумаг И РасчетныеПоля.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость Тогда
					
					АмортизированнаяСтоимость = Документы.ВводЦенныхБумаг.РассчитатьСуммуВВалютеУчета(
						РаботаСКоллекциями.ЗначениеВМассив(СтрокаЦеннойБумаги), ПараметрыРасчета.Организация, ПараметрыРасчета.Дата,
						"Сумма, СуммаПереоценки, ДисконтПремияНачисленный, КорректировкаЭСП, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, -РезервПодОбесценение", Отказ);
					
					РасчетныеПоля.СуммаРынок					= АмортизированнаяСтоимость;
					РасчетныеПоля.ВалютаКотировки				= ПараметрыРасчета.ВалютаУчета;
					РасчетныеПоля.ЦенаКотировки					= РасчетныеПоля.СуммаРынок / СтрокаЦеннойБумаги.Количество;
					РасчетныеПоля.СуммаРынокВВалютеУчета		= РасчетныеПоля.СуммаРынок;
					
					РасчетныеПоля.ЦенаКотировкиКупона			= Справочники.Облигации.ПолучитьКупон(СтрокаЦеннойБумаги.ЦеннаяБумага, ПараметрыРасчета.Дата, ПараметрыРасчета.СчетДоверительногоУправления, , РасчетныеПоля.ВалютаКотировкиКупона);
					РасчетныеПоля.СуммаКупонаРынок				= РасчетныеПоля.ЦенаКотировкиКупона * СтрокаЦеннойБумаги.Количество;
					РасчетныеПоля.СуммаКупонаРынокВВалютеУчета	= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(РасчетныеПоля.СуммаКупонаРынок, РасчетныеПоля.ВалютаКотировкиКупона, ПараметрыРасчета.Организация, ПараметрыРасчета.Дата, Отказ);
					
				Иначе
					
					КоэффициентРаспределения = ?(РаспределеноВсеКоличество, 1, СтрокаЦеннойБумаги.Количество / РасчетнаяСтоимостьЦБ.Количество);
					
					РасчетныеПоля.СуммаРынок					= РасчетнаяСтоимостьЦБ.СуммаРынок * КоэффициентРаспределения;
					РасчетныеПоля.СуммаКупонаРынок				= РасчетнаяСтоимостьЦБ.СуммаКупонаРынок * КоэффициентРаспределения; 
					РасчетныеПоля.СуммаРынокВВалютеУчета		= РасчетнаяСтоимостьЦБ.СуммаРынокВВалютеУчета * КоэффициентРаспределения;
					РасчетныеПоля.СуммаКупонаРынокВВалютеУчета	= РасчетнаяСтоимостьЦБ.СуммаКупонаРынокВВалютеУчета * КоэффициентРаспределения;
					
				КонецЕсли;
				
				// Если расчет сумм в валюте учета требуется от округленной суммы в валюте,
				// то пересчитаем для каждой строки
				
				Если РассчитыватьСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы И РасчетныеПоля.ВалютаКотировки <> ПараметрыРасчета.ВалютаУчета Тогда
					
					СуммаРынок = Окр(РасчетныеПоля.СуммаРынок, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму);
					
					РасчетныеПоля.СуммаРынокВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаРынок, РасчетныеПоля.ВалютаКотировки, ПараметрыРасчета.Организация, ПараметрыРасчета.Дата, Отказ);
					
				КонецЕсли;	
				
				Если ТипЗнч(СтрокаЦеннойБумаги.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда 
				
					Если РассчитыватьСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы И РасчетныеПоля.ВалютаКотировкиКупона <> ПараметрыРасчета.ВалютаУчета Тогда 
						
						СуммаКупонаРынок = Окр(РасчетныеПоля.СуммаКупонаРынок, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона);
						
						РасчетныеПоля.СуммаКупонаРынокВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупонаРынок, РасчетныеПоля.ВалютаКотировкиКупона, ПараметрыРасчета.Организация, ПараметрыРасчета.Дата, Отказ);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
		ЗаполнитьЗначенияСвойств(СтрокаЦеннойБумаги, РасчетныеПоля);
		
		// Корректировку нераспределенной стоимости выполняем после заполнения, т.к. при нем применяются округления.
		// Не удаляем строки с полностью распределенной стоимостью, т.к. может понадобится цена для строк с незаполненным количеством.
		
		Если РасчетнаяСтоимостьЦБ <> Неопределено И РасчетнаяСтоимостьЦБ.Количество > 0 Тогда
			Для Каждого Поле Из РаспределяемыеПоля Цикл
				РасчетнаяСтоимостьЦБ[Поле] = РасчетнаяСтоимостьЦБ[Поле] - СтрокаЦеннойБумаги[Поле];
			КонецЦикла; 
		КонецЕсли;
		
		// Полей СуммаВсегоРынок может не быть, но проверить это у ТЧ или ДанныеФормыКоллекция нельзя 
		
		ПоляВсего = Новый Структура("СуммаВсегоРынок, СуммаВсегоРынокВВалютеУчета");
		ПоляВсего.СуммаВсегоРынок				= СтрокаЦеннойБумаги.СуммаРынок + СтрокаЦеннойБумаги.СуммаКупонаРынок;
		ПоляВсего.СуммаВсегоРынокВВалютеУчета	= СтрокаЦеннойБумаги.СуммаРынокВВалютеУчета + СтрокаЦеннойБумаги.СуммаКупонаРынокВВалютеУчета;
		
		ЗаполнитьЗначенияСвойств(СтрокаЦеннойБумаги, ПоляВсего); 
		
	КонецЦикла;

	// Выведем параметры и результаты оценки в расшифроку расчета
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		
		#Область Расшифровка_результата_расчета
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ПараметрыРасчета", РасшифровкаПараметров, "Параметры расчета", , Истина);
		
		КолонкиРезультата =
			"ЦеннаяБумага, УчетныйАктивЕПС, ВидЦены, УровеньОценки, ДатаЦены, Источник, ЦенаКотировки, ВалютаКотировки, ЦенаКотировкиКупона, ВалютаКотировкиКупона,
			|Количество, СуммаРынок, СуммаКупонаРынок, СуммаРынокВВалютеУчета, СуммаКупонаРынокВВалютеУчета, СуммаВсегоРынок, СуммаВсегоРынокВВалютеУчета";
		
		Если ЕстьОцениваемыеПоАмортизированнойСтоимости И ОценкаПриВводеЦенныхБумаг Тогда
			КолонкиРезультата = КолонкиРезультата + ",
				|СуммаВВалютеУчета, СуммаПереоценкиВВалютеУчета, ДисконтПремияНачисленныйВВалютеУчета, КорректировкаЭСПВВалютеУчета,
				|РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, КорректировкаЭСПВВалютеУчета, РезервПодОбесценение";
		КонецЕсли;	
		
		КолонкиРезультата = Новый Структура(КолонкиРезультата);
		
		Для ИндКолонки = 1 - СтрокиЦенныхБумаг.Колонки.Количество() По 0 Цикл
			Если Не КолонкиРезультата.Свойство(СтрокиЦенныхБумаг.Колонки[-ИндКолонки].Имя) Тогда
				СтрокиЦенныхБумаг.Колонки.Удалить(-ИндКолонки);		
			КонецЕсли;
		КонецЦикла;
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "РезультатыРасчета", СтрокиЦенныхБумаг, "Результаты расчета", , Истина);
		
		#КонецОбласти
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоминалыИКотировкиЦенныхБумаг(Форма, ДанныеОбъекта, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги", НомерСтрокиКорзины = Неопределено) Экспорт
	
	МестоХранения = Константы.ОсновнаяБиржаДляКотировок.Получить();
	
	Если НомерСтрокиКорзины <> Неопределено Тогда // обновим только указанную строку корзины
		
		СтрокаЦенныеБумаги = ДанныеОбъекта[ИмяКорзиныЦенныхБумаг][НомерСтрокиКорзины];
		
		СтрокиЦенныеБумаги = Новый Массив();
		СтрокиЦенныеБумаги.Добавить(СтрокаЦенныеБумаги);
		
		ЦенныеБумагиНаСервере = РаботаСЦеннымиБумагами.ЗаполнитьКотировкиНоминалыИСуммыВсегоВТаблице(
			ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Выгрузить(СтрокиЦенныеБумаги), ДанныеОбъекта.Дата, ДанныеОбъекта.Рынок, МестоХранения,
			Справочники.СчетаДоверительногоУправления.КлиентЯвляетсяПНилиНПФ(ДанныеОбъекта.СчетДоверительногоУправления),
			ДанныеОбъекта.Организация);
			
		Если ЦенныеБумагиНаСервере.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаЦенныеБумаги, ЦенныеБумагиНаСервере[0]);
		КонецЕсли;
		
	Иначе // обновим все строки корзины
		
		ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Загрузить(
			РаботаСЦеннымиБумагами.ЗаполнитьКотировкиНоминалыИСуммыВсегоВТаблице(
				ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Выгрузить(), ДанныеОбъекта.Дата, ДанныеОбъекта.Рынок, МестоХранения,
				Справочники.СчетаДоверительногоУправления.КлиентЯвляетсяПНилиНПФ(ДанныеОбъекта.СчетДоверительногоУправления),
				ДанныеОбъекта.Организация));
	
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНоминалыИКотировкиЦенныхБумаг

&НаСервере
Процедура ЗаполнитьНоминалыЦенныхБумагИСуммыВсего(Форма, ДанныеОбъекта, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги", НомерСтрокиКорзины = Неопределено) Экспорт
	
	Если Форма.КорзинаЦенныхБумаг Тогда
		
		Если НомерСтрокиКорзины = Неопределено Тогда
			СтрокиЦенныеБумаги = Неопределено;	
		Иначе
			СтрокиЦенныеБумаги = РаботаСКоллекциями.ЗначениеВМассив(ДанныеОбъекта[ИмяКорзиныЦенныхБумаг][НомерСтрокиКорзины]);
		КонецЕсли;
		
		ТаблицаБумагИсходная	= ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Выгрузить(СтрокиЦенныеБумаги);
		ТаблицаБумагЗаполненная	= РаботаСЦеннымиБумагами.ЗаполнитьНоминалыИСуммыВсегоВТаблице(ТаблицаБумагИсходная, ДанныеОбъекта.Дата, ДанныеОбъекта.Организация);
		
		Если НомерСтрокиКорзины = Неопределено Тогда
			ДанныеОбъекта[ИмяКорзиныЦенныхБумаг].Загрузить(ТаблицаБумагЗаполненная);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокиЦенныеБумаги[0], ТаблицаБумагЗаполненная[0]);
		КонецЕсли;
		
		ЭлементИтоговаяСтрока = Форма.Элементы.Найти("ИтоговаяСтрока" + ИмяКорзиныЦенныхБумаг);
		Если ЭлементИтоговаяСтрока <> Неопределено Тогда
			ЗаполнитьИтоговуюСтроку(ЭлементИтоговаяСтрока, ДанныеОбъекта.Рынок, ДанныеОбъекта[ИмяКорзиныЦенныхБумаг]);
		КонецЕсли;
		
	Иначе
		
		ЗаполнитьОписаниеНоминалаЦеннойБумаги(Форма, ДанныеОбъекта.Дата, ИмяКорзиныЦенныхБумаг);
		
		Форма[ИмяКорзиныЦенныхБумаг + "СуммаВсего1"] = Форма[ИмяКорзиныЦенныхБумаг + "Сумма1"] + Форма[ИмяКорзиныЦенныхБумаг + "СуммаКупона1"];
		
	КонецЕсли;
	
КонецПроцедуры

// актуально только для выкл. корзины ценных бумаг
Процедура ЗаполнитьОписаниеНоминалаЦеннойБумаги(Форма, Дата, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт
	
	НоминалИВалютаЦеннойБумаги = РаботаСЦеннымиБумагами.ПолучитьНоминалИВалютуЦеннойБумаги(Форма[ИмяКорзиныЦенныхБумаг + "ЦеннаяБумага1"], Дата);
	
	Форма[ИмяКорзиныЦенныхБумаг + "Номинал1"]        = НоминалИВалютаЦеннойБумаги.Номинал;
	Форма[ИмяКорзиныЦенныхБумаг + "ВалютаНоминала1"] = НоминалИВалютаЦеннойБумаги.ВалютаНоминала;
	
	Форма.Элементы.ОписаниеНоминалаЦеннойБумаги.Заголовок = "Номинал: " + НоминалИВалютаЦеннойБумаги.Номинал + " " + НоминалИВалютаЦеннойБумаги.ВалютаНоминала;
	
КонецПроцедуры // ЗаполнитьОписаниеНоминалаЦеннойБумаги

////////////////////////////////////////////////////////////////////////////////
// ИТОГОВАЯ СТРОКА

Функция ФормаМножественногоЧислаЦеннойБумаги(Количество, Рынок) Экспорт
	
	Если      Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Акции") Тогда
		Возврат РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(Количество, "акция", "акции", "акций");
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		Возврат РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(Количество, "облигация", "облигации", "облигаций");
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи") Тогда
		Возврат РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(Количество, "пай", "пая", "паев");
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя") Тогда
		Возврат РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(Количество, "вексель", "векселя", "векселей");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции // ФормаМножественногоЧислаЦеннойБумаги

Процедура ЗаполнитьИтоговуюСтроку(ЭлементИтоговаяСтрока, Рынок, КорзинаЦенныхБумаг) Экспорт

	ИтоговыеДанные = Новый Структура("Количество, Номинал, Сумма, СуммаКупона, СуммаВсего",
		КорзинаЦенныхБумаг.Итог("Количество"),
		0,
		КорзинаЦенныхБумаг.Итог("Сумма"),
		КорзинаЦенныхБумаг.Итог("СуммаКупона"),
		КорзинаЦенныхБумаг.Итог("Сумма") + КорзинаЦенныхБумаг.Итог("СуммаКупона"));
		
	// т.к. номиналы могут быть в разной валюте учтем этот факт
	НоминалыЦенныхБумаг = Новый Соответствие;
	
	Для каждого СтрокаКорзинаЦенныхБумаг Из КорзинаЦенныхБумаг Цикл
		Если НоминалыЦенныхБумаг.Получить(СтрокаКорзинаЦенныхБумаг.ВалютаНоминала) = Неопределено Тогда
			НоминалыЦенныхБумаг.Вставить(СтрокаКорзинаЦенныхБумаг.ВалютаНоминала, СтрокаКорзинаЦенныхБумаг.Номинал * СтрокаКорзинаЦенныхБумаг.Количество);
		Иначе
			НоминалыЦенныхБумаг[СтрокаКорзинаЦенныхБумаг.ВалютаНоминала] = НоминалыЦенныхБумаг[СтрокаКорзинаЦенныхБумаг.ВалютаНоминала]
				+ СтрокаКорзинаЦенныхБумаг.Номинал * СтрокаКорзинаЦенныхБумаг.Количество;
		КонецЕсли;
	КонецЦикла;
	
	// получим строку номиналов
	СтрокаНоминалыЦенныхБумаг = "";
	
	Для каждого КлючЗначение Из НоминалыЦенныхБумаг Цикл
		Если ЗначениеЗаполнено(КлючЗначение.Ключ) Или КлючЗначение.Значение > 0 Тогда // тем самым исключаем строки с пустыми показателями
			СтрокаНоминалыЦенныхБумаг = СтрокаНоминалыЦенныхБумаг + ?(ПустаяСтрока(СтрокаНоминалыЦенныхБумаг), "", ", ")
				+ КлючЗначение.Значение + " " + КлючЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	// заполним итоговую строку
	ЭлементИтоговаяСтрока.Заголовок = "Итого: "
			+ ИтоговыеДанные.Количество + " " + ФормаМножественногоЧислаЦеннойБумаги(ИтоговыеДанные.Количество, Рынок)
			+ " на сумму " + ИтоговыеДанные.Сумма
			+ ?(Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"), ", сумма НКД " + ИтоговыеДанные.СуммаКупона +  ", всего " + ИтоговыеДанные.СуммаВсего, "")
			+ ?(Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи"), ", сумма номиналов " + СтрокаНоминалыЦенныхБумаг, "");

КонецПроцедуры // ЗаполнитьИтоговуюСтроку
