&НаСервере
Функция СфомироватьДокументыСЭД(Организация, СчетДоверительногоУправления, Период, КаталогФайлов) Экспорт
	
	ВестиЕдиныйБухгалтерскийУчет = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Период, 
		Организация, 
		СчетДоверительногоУправления, 
		"ВестиЕдиныйБухгалтерскийУчет");
	
	ВестиБухгалтерскийУчет = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Период, 
		Организация, 
		СчетДоверительногоУправления, 
		"ВестиБухгалтерскийУчет");
		
	ВидУчета = ?(ВестиЕдиныйБухгалтерскийУчет, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, ?(ВестиБухгалтерскийУчет, Перечисления.ВидыУчета.БухгалтерскийУчет, Неопределено));
	Если ВидУчета = Неопределено Тогда
		Сообщить("Не настроен вид учета (РСБУ или ЕПС)!");
		Возврат Ложь;
	КонецЕсли;
			
	// Подготовим параметры для передачи в обработку выгрузки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования) КАК ДатаЗапретаРедактирования,
	|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _ДатыЗапретаЕПС
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Организация = &Организация
	|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
	|	И ДатыЗапретаРедактирования.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыЗапретаРедактирования.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ФинансовыеПоказатели.СубъектАналитики КАК СчетДоверительногоУправления,
	|	ФинансовыеПоказатели.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ _ДатыЗапретаЕПС.ДатаЗапретаРедактирования ЕСТЬ NULL
	|	КОНЕЦ КАК ПартииНеПроведены
	|ИЗ
	|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыЗапретаЕПС КАК _ДатыЗапретаЕПС
	|		ПО ФинансовыеПоказатели.СубъектАналитики = _ДатыЗапретаЕПС.СчетДоверительногоУправления
	|			И (_ДатыЗапретаЕПС.ДатаЗапретаРедактирования >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))
	|ГДЕ
	|	ФинансовыеПоказатели.Период = &Период
	|	И ФинансовыеПоказатели.Организация = &Организация
	|	И (ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = &СчетДоверительногоУправления
	|	И ТИПЗНАЧЕНИЯ(ФинансовыеПоказатели.Регистратор) = ТИП(Документ.РегистрацияСтоимостиАктивов)";
	
	Запрос.УстановитьПараметр("Период", 					  Период);
	Запрос.УстановитьПараметр("Организация", 				  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ПартииНеПроведены Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По счету ДУ " + СокрЛП(Выборка.СчетДоверительногоУправления) + " не проведен бухгалтерский учет (ЕПС). Файл выгрузки по нему не сформирован", Выборка.СчетДоверительногоУправления);			
			Возврат Ложь;
		КонецЕсли;
		
		ТекДокумент = Выборка.Регистратор;
		ОбработкаВыгрузки = Обработки.ПечатьИВыгрузка_СЧА_РСА.Создать();  		
		ОбработкаВыгрузки.ДатаИВремяФормирования = ТекущаяДата();
		
		Разрядность = 2;
				
		// сформируем файл данных
		ПолноеИмяФайла = КаталогФайлов + ?(Прав(КаталогФайлов, 1) = "\", "", "\") + "029\F029" +СтрЗаменить(СокрЛП(СчетДоверительногоУправления), """", "") + "_" + Формат(Период, "ДФ=dd.MM.yyyy") + ".xml";
	
		МассивДокументов = Новый Массив;			
		МассивДокументов.Добавить(ТекДокумент);
			
		Результат = ОбработкаВыгрузки.ПолучитьВыгрузкиФормы029(МассивДокументов, Разрядность, Справочники.ЮрФизЛица.ПустаяСсылка());

		Если Результат.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Попытка
			Результат[0].ТекстОтчета.Записать(ПолноеИмяФайла, "windows-1251");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() + ". Выгрузка отменена по счету ДУ " + СокрЛП(СчетДоверительногоУправления));
			Возврат Ложь;
		КонецПопытки;	
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
			
КонецФункции
