
#Область Регистрационные_данные

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Импорт данных по биржевым депозитам",
		"0.14",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область Экспортные_процедуры_и_функции

Процедура ЗаполнитьТаблицуКодовКлиентовНаММВБ() Экспорт
			
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ЗначенияДополнительныхСведений.Значение КАК КодНаММВБ,
		|	ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код, """") КАК КодУБрокера,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО СчетаДоверительногоУправления.Ссылка = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""РасчетныйКодНаРынкеДепозитов"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&Дата, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			И (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер)");
		
	Запрос.УстановитьПараметр("Дата", 				ЭтотОбъект.ДатаИмпорта);
	Запрос.УстановитьПараметр("Организация", 		ЭтотОбъект.Организация);
	
	ЭтотОбъект.КодыСчетовДУНаММВБ.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ЗагрузитьШаблоныПреобразованияВHTML() Экспорт

	ЭтотОбъект.ШаблонДляФайлаСделок	= ПолучитьМакет("ШаблонПреобразованияФайлаСделокВHTML").ПолучитьТекст();
	ЭтотОбъект.ШаблонДляФайлаДДС	= ПолучитьМакет("ШаблонПреобразованияФайлаДДСВHTML").ПолучитьТекст();
	
КонецПроцедуры

#КонецОбласти
