&НаСервере
Процедура ОбновитьСписокНаСервере(ЗапомнитьРанееВыбранныеФлажки = Истина)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Объект.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Объект.Период");
	КонецЕсли;
	
	// Запомним текущую строку	
	ТекущиеДанные		= ?(Элементы.Список.ТекущаяСтрока = Неопределено, Неопределено, Объект.Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока));
	КлиентДоОбновления	= ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.СчетДоверительногоУправления);
	
	Если ЭтаФорма.РежимОтбора = 0 И Не ЗначениеЗаполнено(ЭтаФорма.ВидДоговораДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Вид договора доверительного управления' не заполнено", ЭтаФорма, "ВидДоговораДоверительногоУправления");
		Возврат;
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 2 И Не ЗначениеЗаполнено(ЭтаФорма.КлиентДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Клиент доверительного управления' не заполнено", ЭтаФорма, "КлиентДоверительногоУправления");
		Возврат;
		
	КонецЕсли;
	
	Объект.Список.Очистить();
	
	// инициализируем запрос и его параметры
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	Запрос.УстановитьПараметр("Период",			Объект.Период.ДатаОкончания);
	
	Если ЭтаФорма.РежимОтбора = 0 Тогда
		
		ДействующиеСчетаДУ = Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(Объект.Период.ДатаОкончания, 
										Справочники.СчетаДоверительногоУправления.СтруктураДляОтбораСчетовДоверительногоУправления(
													Объект.Организация, 
													ЭтаФорма.ВидДоговораДоверительногоУправления)
										);		
										
	ИначеЕсли ЭтаФорма.РежимОтбора = 1 Тогда // все, кроме контроля ДК и ИИС
		
		ИсключаемыеВидыДоговоровДУ = Новый Массив;
		ИсключаемыеВидыДоговоровДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.КонтрольСаморегулируемыхОрганизаций);
		ИсключаемыеВидыДоговоровДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.КонтрольСтраховыхКомпаний);
		
		ВидыДоговоровДоверительногоУправления = Новый Массив;
		
		Для Каждого МетаВидДоговораДУ Из Метаданные.Перечисления.ВидыДоговоровДоверительногоУправления.ЗначенияПеречисления Цикл
			ЗначениеПеречисления = Перечисления.ВидыДоговоровДоверительногоУправления[МетаВидДоговораДУ.Имя];
			
			Если ИсключаемыеВидыДоговоровДУ.Найти(ЗначениеПеречисления) = Неопределено Тогда
				ВидыДоговоровДоверительногоУправления.Добавить(ЗначениеПеречисления);		
			КонецЕсли;
		КонецЦикла;
			
		ДействующиеСчетаДУ = Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(Объект.Период.ДатаОкончания, 
										Справочники.СчетаДоверительногоУправления.СтруктураДляОтбораСчетовДоверительногоУправления(
													Объект.Организация, 
													ВидыДоговоровДоверительногоУправления)
										);		    										
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 2 Тогда
		
		ДействующиеСчетаДУ = Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(Объект.Период.ДатаОкончания, 
										Справочники.СчетаДоверительногоУправления.СтруктураДляОтбораСчетовДоверительногоУправления(
													Объект.Организация, 
													ЭтаФорма.КлиентДоверительногоУправления)
										);		    											
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 3 Тогда // 1-я очередь: ПФР, ПН, ПР, ПИФ, СРО, СТРАХ, ФОГФ
		
		ВидыДоговоровДоверительногоУправления = Новый Массив;
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ);
				
		ДействующиеСчетаДУ = Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(Объект.Период.ДатаОкончания, 
										Справочники.СчетаДоверительногоУправления.СтруктураДляОтбораСчетовДоверительногоУправления(
													Объект.Организация, 
													ВидыДоговоровДоверительногоУправления)
										);
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 4 Тогда // 2-я очередь: ЮЛ, ФЛ, НПФ СС, СОБ, Активы целевых капиталов
										
		ВидыДоговоровДоверительногоУправления = Новый Массив;
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.Собственный);
		ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов);
				
		ДействующиеСчетаДУ = Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(Объект.Период.ДатаОкончания, 
										Справочники.СчетаДоверительногоУправления.СтруктураДляОтбораСчетовДоверительногоУправления(
													Объект.Организация, 
													ВидыДоговоровДоверительногоУправления)
										);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", ДействующиеСчетаДУ.ВыгрузитьКолонку("СчетДоверительногоУправления"));
	
	// сначала счета доверительного управления
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Наименование КАК Наименование
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка В(&СчетаДоверительногоУправления)
		|	И СчетаДоверительногоУправления.КодСчета <> ""О""";
	
	Запрос.Выполнить();
		
	// Получение таблицы дат СЧА по счетам ДУ (_ДатыДействияЗаПериод)
	Справочники.НастройкиРегламентныхДействий.ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу(Запрос, Новый Структура("ВидДействия, ДатаС, ДатаПо, ДополнитьРабочимиДнями", "СЧА", Объект.Период.ДатаНачала, НачалоДня(Объект.Период.ДатаОкончания), Истина));
	
	// Основная выборка данных
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Наименование КАК Наименование
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод
		|		ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = _ДатыДействияЗаПериод.СчетДоверительногоУправления
		|
		|УПОРЯДОЧИТЬ ПО
		|	_СчетаДоверительногоУправления.Наименование";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
						
		НоваяСтрокаСписка = Объект.Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСписка, Выборка);
		
	КонецЦикла;	

	// Переходим к ранее выбранной строке
	Если КлиентДоОбновления <> Неопределено Тогда 
		СтрокиКлиента = Объект.Список.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", КлиентДоОбновления));
		
		Если СтрокиКлиента.Количество() > 0 Тогда
			Элементы.Список.ТекущаяСтрока = СтрокиКлиента[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Список.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При заполнении не обнаружено ни одного действующего счета ДУ, согласно способу заполнения, по которому в периоде должна быть зарегистрирована СЧА.");
	КонецЕсли;
	
	Элементы.РезультатКонтроля.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ВидДоговораДоверительногоУправления.Видимость	= ЭтаФорма.РежимОтбора = 0;
	Элементы.КлиентДоверительногоУправления.Видимость		= ЭтаФорма.РежимОтбора = 2;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатКонтроля = ОбработкаОбъект.ПолучитьОтчетОПроверке();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПроверить");
	Попытка
		ВыполнитьПроверить(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверить(ПараметрыСессии)
	
	Если ПроверитьЗаполнение() Тогда
		ПроверитьНаСервере();
		
		Элементы.РезультатКонтроля.Доступность = Истина;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультатПроверки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация	= ПараметрыСеанса.ТекущаяОрганизация.Ссылка;
	Объект.ПроцентОтклоненияСЧА = 5;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Объект.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Объект.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	НастроитьВидимостьДоступностьЭлементовФормы();
	
	Если РежимОтбора = 1 ИЛИ РежимОтбора = 3 ИЛИ РежимОтбора = 4 Тогда
		ЗадатьВопросОНеобходимостиПерезаполнения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Применить");
	Попытка
		ОбновитьСписокНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОНеобходимостиПерезаполнения()
	
	Если Вопрос("Перезаполнить список счетов доверительного управления к проверке?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОбновитьСписокНаСервере();
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСчетаДоверительногоУправленияКПроверке;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗадатьВопросОНеобходимостиПерезаполнения();
	
	Элементы.РезультатКонтроля.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ОчиститьСписок");
	Попытка
		ВыполнитьОчиститьСписок(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчиститьСписок(ПараметрыСессии)
	
	Объект.Список.Очистить();
	
	Элементы.РезультатКонтроля.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВидДоговораДоверительногоУправления(СДУ)
	
	Результат = Истина;
	
	Если СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.КонтрольСаморегулируемыхОрганизаций
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.КонтрольСтраховыхКомпаний Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбран счет ДУ с недопустимым видом договора ДУ! Выбор отменен.");
		РезультатПроверки = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СписокСчетДоверительногоУпралвенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ПроверитьВидДоговораДоверительногоУправления(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗадатьВопросОНеобходимостиПерезаполнения();
	
	Элементы.РезультатКонтроля.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Элементы.РезультатКонтроля.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьУспешноПрошедшихКонтрольПриИзменении(Элемент)
	
	Элементы.РезультатКонтроля.Доступность = Ложь;
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
