
&НаСервере
Процедура ОбновитьНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");  	
	
	Результат = ДокОбъект.ПолучитьСведенияОСтраховщиках(ЭтаФорма.Организация, ЭтаФорма.Период);
	
	ЭтаФорма.СведенияОСтраховщиках.Очистить();
	
	Для каждого Страховщик из Результат Цикл		
		
		НоваяСтрока = ЭтаФорма.СведенияОСтраховщиках.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Страховщик);  

	КонецЦикла;  

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Период      = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортироватьНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");  	
	
	ДокОбъект.ЭкспортироватьСведенияОСтраховщиках( ЭтаФорма.СведенияОСтраховщиках, ЭтаФорма.Период );
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные успешно экспортированы во внешнюю систему", ,,, );
	
КонецПроцедуры

&НаКлиенте
Процедура Экспортировать(Команда)
	ЭкспортироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры



	