
Функция СведенияОВнешнейОбработке() Экспорт
	
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, "Отчет по начислению налога с дивидендов", "0.15", "", Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Перем СписокЦенныхБумаг;
	Перем ФильтрЦБ;
	Перем РазворачиватьПоЦеннымБумагам;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонца", ЭтотОбъект.Период.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", ЭтотОбъект.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонцаСтрока", Формат(ЭтотОбъект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачалаСтрока", Формат(ЭтотОбъект.Период.ДатаНачала,"ДФ=dd.MM.yyyy"));
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);		
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект,ДокументРезультат,ДанныеРасшифровки,СтандартнаяОбработка,,,,);
	
	
КонецПроцедуры
