// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"ОСВ для ГАЗФОНДа",
		"0.23",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СформироватьОтчет(ДокументРезультат, НастройкиОтчета.Подписант);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

#Область ДанныеБухУчета

Функция ПолучитьТаблицуСчетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель КАК СчетРодитель,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель.Код КАК СчетРодительКод,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Код КАК СчетКод,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Наименование КАК СчетНаименование,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Родитель.Наименование КАК СчетРодительНаименование
		|ПОМЕСТИТЬ ОстаткиСчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Субсчет,
		|	ОстаткиСчета.Счет КАК Счет,
		|	ОстаткиСчета.СчетКод КАК СчетКод,
		|	ОстаткиСчета.СуммаНачальныйОстатокДт КАК СНД,
		|	ОстаткиСчета.СуммаНачальныйОстатокКт КАК СНК,
		|	ОстаткиСчета.СуммаОборотДт КАК ДО,
		|	ОстаткиСчета.СуммаОборотКт КАК КО,
		|	ОстаткиСчета.СуммаКонечныйОстатокДт КАК СКД,
		|	ОстаткиСчета.СуммаКонечныйОстатокКт КАК СКК,
		|	ОстаткиСчета.СчетНаименование КАК СчетНаименование
		|ИЗ
		|	ОстаткиСчета КАК ОстаткиСчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ОстаткиСчета.СчетРодитель,
		|	ОстаткиСчета.СчетРодительКод,
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокКт),
		|	СУММА(ОстаткиСчета.СуммаОборотДт),
		|	СУММА(ОстаткиСчета.СуммаОборотКт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокКт),
		|	ОстаткиСчета.СчетРодительНаименование
		|ИЗ
		|	ОстаткиСчета КАК ОстаткиСчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиСчета.СчетРодитель,
		|	ОстаткиСчета.СчетРодительКод,
		|	ОстаткиСчета.СчетРодительНаименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	""Итого"",
		|	""Итого"",
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаНачальныйОстатокКт),
		|	СУММА(ОстаткиСчета.СуммаОборотДт),
		|	СУММА(ОстаткиСчета.СуммаОборотКт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокДт),
		|	СУММА(ОстаткиСчета.СуммаКонечныйОстатокКт),
		|	""Итого""
		|ИЗ
		|	ОстаткиСчета КАК ОстаткиСчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетКод";
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоДня(ЭтотОбъект.Период.ДатаНачала), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ВывестиПоСчету(Результат, Счет, ОбластьАналитика)

	ДанныеСчета = БухгалтерскийУчет.ПолучитьСвойстваСчета(Счет);
	
	Если ЭтотОбъект.ПоСубконто Тогда
	
		Если ДанныеСчета.КоличествоСубконто = 0 Тогда
			Возврат;
		ИначеЕсли ДанныеСчета.КоличествоСубконто = 1 Тогда
			СтрокаИтогов = "Субконто1";
		ИначеЕсли ДанныеСчета.КоличествоСубконто = 2 Тогда
			СтрокаИтогов = "Субконто1,Субконто2";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Субконто1,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Субконто2,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СНД,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СНК,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК ДО,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК КО,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СКД,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СКК
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Период,
			|			ДвиженияИГраницыПериода,
			|			Счет = &Счет,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
			|
			|УПОРЯДОЧИТЬ ПО
			|	Субконто1,
			|	Субконто2
			|ИТОГИ
			|	СУММА(СНД),
			|	СУММА(СНК),
			|	СУММА(ДО),
			|	СУММА(КО),
			|	СУММА(СКД),
			|	СУММА(СКК)
			|ПО
			|	" + СтрокаИтогов;
		
		
		Если ДанныеСчета.КоличествоСубконто = 1 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Субконто2,", "");
		КонецЕсли;
		
		Если НЕ ЭтотОбъект.ПоЛицевымСчетам Тогда
		    Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,", "");
		КонецЕсли;
		
	Иначе // только лицевики
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СНД,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СНК,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК ДО,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК КО,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СКД,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СКК
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Период,
			|			ДвиженияИГраницыПериода,
			|			Счет = &Счет,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЛицевойСчет";
		
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоДня(ЭтотОбъект.Период.ДатаНачала), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Счет", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЭтотОбъект.ПоСубконто Тогда
	
		ВыборкаСубконто1 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСубконто1.Следующий() Цикл
			
			ВывестиПоАналитике(Результат, ВыборкаСубконто1, ВыборкаСубконто1.Субконто1, ОбластьАналитика, 4);
			
			Если ДанныеСчета.КоличествоСубконто = 2 Тогда
			
				ВыборкаСубконто2 = ВыборкаСубконто1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСубконто2.Следующий() Цикл
					
					ВывестиПоАналитике(Результат, ВыборкаСубконто2, ВыборкаСубконто2.Субконто2, ОбластьАналитика, 6);
					
					Если ЭтотОбъект.ПоЛицевымСчетам Тогда
						
						ВыборкаДетальныеЗаписи = ВыборкаСубконто2.Выбрать();
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							ВывестиПоАналитике(Результат, ВыборкаДетальныеЗаписи, ВыборкаДетальныеЗаписи.ЛицевойСчет, ОбластьАналитика, 8);
						КонецЦикла;
					
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ЭтотОбъект.ПоЛицевымСчетам Тогда
				
				ВыборкаДетальныеЗаписи = ВыборкаСубконто1.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ВывестиПоАналитике(Результат, ВыборкаДетальныеЗаписи, ВыборкаДетальныеЗаписи.ЛицевойСчет, ОбластьАналитика, 6);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе // только лицевики
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВывестиПоАналитике(Результат, ВыборкаДетальныеЗаписи, ВыборкаДетальныеЗаписи.ЛицевойСчет, ОбластьАналитика, 4);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныйВывод

Функция ВывестиДанныеСчета(Результат, ОбластьСчет, Счет, СчетКод, СчетНаименование, Субсчет)

	Если ЭтотОбъект.ВыводитьНаименованиеСчета И СчетКод <> "Итого" Тогда
		ОбластьСчет.Параметры.Счет = СчетКод + ", " + СчетНаименование;
	Иначе
		ОбластьСчет.Параметры.Счет = СчетКод;
	КонецЕсли;
	
	ОбластьСчет.Области.НаименованиеСчета.Отступ = ?(Субсчет, 2, 0);
	
	Уровень = 1;
	Если СчетКод = "Итого" Тогда
		
		ОбластьСчет.Области.ОбластьСчет.Шрифт = Новый Шрифт(ОбластьСчет.ТекущаяОбласть.Шрифт,,, Истина);
		//Уровень = 0;
		
	ИначеЕсли Счет.Вид = ВидСчета.АктивноПассивный Тогда //Аня настаивает на активном или пассивном, а не на активно-пассивном сальдо
	
		Если ОбластьСчет.Параметры.СНД <> Null И ОбластьСчет.Параметры.СНК <> Null Тогда
			
			Если ОбластьСчет.Параметры.СНД >= ОбластьСчет.Параметры.СНК Тогда
			
				ОбластьСчет.Параметры.СНД = ОбластьСчет.Параметры.СНД - ОбластьСчет.Параметры.СНК;
				ОбластьСчет.Параметры.СНК = 0;
				
			Иначе
				
				ОбластьСчет.Параметры.СНК = ОбластьСчет.Параметры.СНК - ОбластьСчет.Параметры.СНД;
				ОбластьСчет.Параметры.СНД = 0;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ОбластьСчет.Параметры.СКД <> Null И ОбластьСчет.Параметры.СКК <> Null Тогда
			
			Если ОбластьСчет.Параметры.СКД >= ОбластьСчет.Параметры.СКК Тогда
			
				ОбластьСчет.Параметры.СКД = ОбластьСчет.Параметры.СКД - ОбластьСчет.Параметры.СКК;
				ОбластьСчет.Параметры.СКК = 0;
				
			Иначе
			
				ОбластьСчет.Параметры.СКК = ОбластьСчет.Параметры.СКК - ОбластьСчет.Параметры.СКД;
				ОбластьСчет.Параметры.СКД = 0;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Результат.Вывести(ОбластьСчет, Уровень);
	
	Возврат ОбластьСчет.Параметры;
	
КонецФункции

Процедура ВывестиПоАналитике(Результат, Выборка, Аналитика, ОбластьАналитика, Отступ)

	Если (Выборка.СНД = 0 ИЛИ Выборка.СНД = Null)
		И (Выборка.СНК = 0 ИЛИ Выборка.СНК = Null)
		И (Выборка.ДО = 0 ИЛИ Выборка.ДО = Null)
		И (Выборка.КО = 0 ИЛИ Выборка.КО = Null)
		И (Выборка.СКД = 0 ИЛИ Выборка.СКД = Null)
		И (Выборка.СКК = 0 ИЛИ Выборка.СКК = Null) Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбластьАналитика.Параметры, Выборка);
	
	Если Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.СодержитТип(ТипЗнч(Аналитика)) Тогда
		ОбластьАналитика.Параметры.Аналитика = РаботаСОтчетами.ПолучитьПредставлениеЦеннойБумаги(Аналитика, ЭтотОбъект.Период.ДатаОкончания);
	Иначе	
		ОбластьАналитика.Параметры.Аналитика = Аналитика;
	КонецЕсли;	
		
	ОбластьАналитика.Области.НаименованиеАналитики.Отступ = Отступ;
	
	Результат.Вывести(ОбластьАналитика, Отступ);

КонецПроцедуры

#КонецОбласти

#Область ДанныеПартий

Функция ПолучитьТекстЗапросаПартииССубконто() // ЦеннаяБумага, Партия, СтрокаПартии, СНД, СНК, ДО, КО, СКД, СКК

	Возврат 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	ТаблицаПогашений.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	ТаблицаПогашений.Партия КАК Партия,
	        	|	ТаблицаПогашений.СтрокаПартии КАК СтрокаПартии,
	        	|	ТаблицаПогашений.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	        	|	ТаблицаПогашений.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	        	|	ТаблицаПогашений.СНД КАК СНД,
	        	|	ТаблицаПогашений.ДО КАК ДО,
	        	|	ТаблицаПогашений.КО КАК КО,
	        	|	ТаблицаПогашений.СКД КАК СКД
	        	|ПОМЕСТИТЬ ТаблицаПогашений
	        	|ИЗ
	        	|	&ТаблицаПогашений КАК ТаблицаПогашений
	        	|;
	        	|
	        	|////////////////////////////////////////////////////////////////////////////////
	        	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	ТаблицаПогашений.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	ТаблицаПогашений.Партия КАК Партия,
	        	|	ТаблицаПогашений.СтрокаПартии КАК СтрокаПартии,
	        	|	СУММА(ТаблицаПогашений.СНД) КАК СНД,
	        	|	0 КАК СНК,
	        	|	СУММА(ТаблицаПогашений.ДО) КАК ДО,
	        	|	СУММА(ТаблицаПогашений.КО) КАК КО,
	        	|	СУММА(ТаблицаПогашений.СКД) КАК СКД,
	        	|	0 КАК СКК
	        	|ПОМЕСТИТЬ ТаблицаНужныхПогашений
	        	|ИЗ
	        	|	ТаблицаПогашений КАК ТаблицаПогашений
	        	|ГДЕ
	        	|	ТаблицаПогашений.УчетныйАктивЕПС = &УчетныйАктивЕПС
	        	|
	        	|СГРУППИРОВАТЬ ПО
	        	|	ТаблицаПогашений.ЦеннаяБумага,
	        	|	ТаблицаПогашений.Партия,
	        	|	ТаблицаПогашений.СтрокаПартии
	        	|;
	        	|
	        	|////////////////////////////////////////////////////////////////////////////////
	        	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.Партия КАК Партия,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтрокаПартии КАК СтрокаПартии,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаНачальныйОстаток + БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаНачальныйОстаток + БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаНачальныйОстаток + БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток КАК СНД,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаПриход + БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаПриход + БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаПриход + ВЫБОР
	        	|		КОГДА БухПартииЦенныхБумагОстаткиИОбороты.Партия.Дата > &ДатаНачалаДата
	        	|				И БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход > 0
	        	|			ТОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход
	        	|		ИНАЧЕ ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход < 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|			КОНЕЦ + ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход > 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ -БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход
	        	|			КОНЕЦ
	        	|	КОНЕЦ КАК ДО,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаРасход + БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаРасход + ВЫБОР
	        	|		КОГДА БухПартииЦенныхБумагОстаткиИОбороты.Партия.Дата > &ДатаНачалаДата
	        	|				И БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход > 0
	        	|			ТОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход - БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|		ИНАЧЕ ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход < 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход
	        	|			КОНЕЦ + ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход > 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ -БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|			КОНЕЦ
	        	|	КОНЕЦ КАК КО,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаКонечныйОстаток + БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаКонечныйОстаток + БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаКонечныйОстаток + БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаКонечныйОстаток КАК СКД,
	        	|	0 КАК СНК,
	        	|	0 КАК СКК
	        	|ИЗ
	        	|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
	        	|			&ДатаНачала,
	        	|			&ДатаОкончания,
	        	|			Период,
	        	|			ДвиженияИГраницыПериода,
	        	|			ВидУчета = &ВидУчета
	        	|				И Организация = &Организация
	        	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	        	|				И УчетныйАктивЕПС = &УчетныйАктивЕПС) КАК БухПартииЦенныхБумагОстаткиИОбороты
	        	|
	        	|ОБЪЕДИНИТЬ ВСЕ
	        	|
	        	|ВЫБРАТЬ
	        	|	ТаблицаНужныхПогашений.ЦеннаяБумага,
	        	|	ТаблицаНужныхПогашений.Партия,
	        	|	ТаблицаНужныхПогашений.СтрокаПартии,
	        	|	ТаблицаНужныхПогашений.СНД,
	        	|	ТаблицаНужныхПогашений.ДО,
	        	|	ТаблицаНужныхПогашений.КО,
	        	|	ТаблицаНужныхПогашений.СКД,
	        	|	ТаблицаНужныхПогашений.СНК,
	        	|	ТаблицаНужныхПогашений.СКК
	        	|ИЗ
	        	|	ТаблицаНужныхПогашений КАК ТаблицаНужныхПогашений
	        	|
	        	|УПОРЯДОЧИТЬ ПО
	        	|	ЦеннаяБумага,
	        	|	Партия,
	        	|	СтрокаПартии
	        	|ИТОГИ
	        	|	СУММА(СНД),
	        	|	СУММА(ДО),
	        	|	СУММА(КО),
	        	|	СУММА(СКД)
	        	|ПО
	        	|	ОБЩИЕ,
	        	|	ЦеннаяБумага,
	        	|	Партия";

КонецФункции

Функция ПолучитьТекстЗапросаПартииСЛицевымиИСубконто() // ЦеннаяБумага, Партия, СтрокаПартии, ДополнительнаяАналитика, СНД, СНК, ДО, КО, СКД, СКК

	Возврат 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	ТаблицаПогашений.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	ТаблицаПогашений.Партия КАК Партия,
	        	|	ТаблицаПогашений.СтрокаПартии КАК СтрокаПартии,
	        	|	ТаблицаПогашений.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	        	|	ТаблицаПогашений.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	        	|	ТаблицаПогашений.СНД КАК СНД,
	        	|	ТаблицаПогашений.ДО КАК ДО,
	        	|	ТаблицаПогашений.КО КАК КО,
	        	|	ТаблицаПогашений.СКД КАК СКД
	        	|ПОМЕСТИТЬ ТаблицаПогашений
	        	|ИЗ
	        	|	&ТаблицаПогашений КАК ТаблицаПогашений
	        	|;
	        	|
	        	|////////////////////////////////////////////////////////////////////////////////
	        	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	ТаблицаПогашений.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	ТаблицаПогашений.Партия КАК Партия,
	        	|	ТаблицаПогашений.СтрокаПартии КАК СтрокаПартии,
	        	|	СУММА(ТаблицаПогашений.СНД) КАК СНД,
	        	|	СУММА(ТаблицаПогашений.ДО) КАК ДО,
	        	|	СУММА(ТаблицаПогашений.КО) КАК КО,
	        	|	СУММА(ТаблицаПогашений.СКД) КАК СКД,
	        	|	ТаблицаПогашений.ДополнительнаяАналитика КАК ДополнительнаяАналитика
	        	|ПОМЕСТИТЬ ТаблицаНужныхПогашений
	        	|ИЗ
	        	|	ТаблицаПогашений КАК ТаблицаПогашений
	        	|ГДЕ
	        	|	ТаблицаПогашений.УчетныйАктивЕПС = &УчетныйАктивЕПС
	        	|
	        	|СГРУППИРОВАТЬ ПО
	        	|	ТаблицаПогашений.ЦеннаяБумага,
	        	|	ТаблицаПогашений.Партия,
	        	|	ТаблицаПогашений.СтрокаПартии,
	        	|	ТаблицаПогашений.ДополнительнаяАналитика
	        	|;
	        	|
	        	|////////////////////////////////////////////////////////////////////////////////
	        	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.Партия КАК Партия,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтрокаПартии КАК СтрокаПартии,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаНачальныйОстаток КАК СтоимостьВВалютеУчетаНачальныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаНачальныйОстаток КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаНачальныйОстаток КАК ДисконтПремияНачисленныйВВалютеУчетаНачальныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток КАК ПереоценкаКупонаВВалютеУчетаНачальныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаПриход КАК СтоимостьВВалютеУчетаПриход,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаПриход КАК СтоимостьКупонаВВалютеУчетаПриход,
	        	|	ВЫБОР
	        	|		КОГДА БухПартииЦенныхБумагОстаткиИОбороты.Партия.Дата > &ДатаНачалаДата
	        	|				И БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход > 0
	        	|			ТОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход
	        	|		ИНАЧЕ ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход < 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|			КОНЕЦ + ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход > 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ -БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход
	        	|			КОНЕЦ
	        	|	КОНЕЦ КАК ДисконтПремияНачисленныйВВалютеУчетаПриход,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаПриход КАК ПереоценкаКупонаВВалютеУчетаПриход,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаРасход КАК СтоимостьВВалютеУчетаРасход,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход,
	        	|	ВЫБОР
	        	|		КОГДА БухПартииЦенныхБумагОстаткиИОбороты.Партия.Дата > &ДатаНачалаДата
	        	|				И БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход > 0
	        	|			ТОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПриход - БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|		ИНАЧЕ ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход < 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход
	        	|			КОНЕЦ + ВЫБОР
	        	|				КОГДА БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход > 0
	        	|					ТОГДА 0
	        	|				ИНАЧЕ -БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|			КОНЕЦ
	        	|	КОНЕЦ КАК ДисконтПремияНачисленныйВВалютеУчетаРасход,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаРасход,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьВВалютеУчетаКонечныйОстаток КАК СтоимостьВВалютеУчетаКонечныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаКонечныйОстаток КАК СтоимостьКупонаВВалютеУчетаКонечныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйВВалютеУчетаКонечныйОстаток КАК ДисконтПремияНачисленныйВВалютеУчетаКонечныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаКонечныйОстаток КАК ПереоценкаКупонаВВалютеУчетаКонечныйОстаток,
	        	|	БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПокупкиНачальныйОстаток + БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияПокупкиПриход КАК ДисконтПремияПокупкиНачальныйОстаток
	        	|ПОМЕСТИТЬ СырыеОстатки
	        	|ИЗ
	        	|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
	        	|			&ДатаНачала,
	        	|			&ДатаОкончания,
	        	|			Период,
	        	|			ДвиженияИГраницыПериода,
	        	|			ВидУчета = &ВидУчета
	        	|				И Организация = &Организация
	        	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	        	|				И УчетныйАктивЕПС = &УчетныйАктивЕПС) КАК БухПартииЦенныхБумагОстаткиИОбороты
	        	|;
	        	|
	        	|////////////////////////////////////////////////////////////////////////////////
	        	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	СырыеОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	СырыеОстатки.Партия КАК Партия,
	        	|	СырыеОстатки.СтрокаПартии КАК СтрокаПартии,
	        	|	ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги) КАК ДополнительнаяАналитика,
	        	|	СырыеОстатки.СтоимостьВВалютеУчетаНачальныйОстаток КАК СтоимостьВВалютеУчетаНачальныйОстаток,
	        	|	СырыеОстатки.СтоимостьВВалютеУчетаПриход КАК СтоимостьВВалютеУчетаПриход,
	        	|	СырыеОстатки.СтоимостьВВалютеУчетаРасход КАК СтоимостьВВалютеУчетаРасход,
	        	|	СырыеОстатки.СтоимостьВВалютеУчетаКонечныйОстаток КАК СтоимостьВВалютеУчетаКонечныйОстаток
	        	|ПОМЕСТИТЬ ОстаткиПоАналитикам
	        	|ИЗ
	        	|	СырыеОстатки КАК СырыеОстатки
	        	|
	        	|ОБЪЕДИНИТЬ ВСЕ
	        	|
	        	|ВЫБРАТЬ
	        	|	СырыеОстатки.ЦеннаяБумага,
	        	|	СырыеОстатки.Партия,
	        	|	СырыеОстатки.СтрокаПартии,
	        	|	ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный),
	        	|	СырыеОстатки.СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
	        	|	СырыеОстатки.СтоимостьКупонаВВалютеУчетаПриход,
	        	|	СырыеОстатки.СтоимостьКупонаВВалютеУчетаРасход,
	        	|	СырыеОстатки.СтоимостьКупонаВВалютеУчетаКонечныйОстаток
	        	|ИЗ
	        	|	СырыеОстатки КАК СырыеОстатки
	        	|
	        	|ОБЪЕДИНИТЬ ВСЕ
	        	|
	        	|ВЫБРАТЬ
	        	|	СырыеОстатки.ЦеннаяБумага,
	        	|	СырыеОстатки.Партия,
	        	|	СырыеОстатки.СтрокаПартии,
	        	|	ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный),
	        	|	СырыеОстатки.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток,
	        	|	СырыеОстатки.ПереоценкаКупонаВВалютеУчетаПриход,
	        	|	СырыеОстатки.ПереоценкаКупонаВВалютеУчетаРасход,
	        	|	СырыеОстатки.ПереоценкаКупонаВВалютеУчетаКонечныйОстаток
	        	|ИЗ
	        	|	СырыеОстатки КАК СырыеОстатки
	        	|
	        	|ОБЪЕДИНИТЬ ВСЕ
	        	|
	        	|ВЫБРАТЬ
	        	|	СырыеОстатки.ЦеннаяБумага,
	        	|	СырыеОстатки.Партия,
	        	|	СырыеОстатки.СтрокаПартии,
	        	|	ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.Дисконт),
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток > 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаНачальныйОстаток
	        	|	КОНЕЦ,
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток > 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|	КОНЕЦ,
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток > 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаРасход
	        	|	КОНЕЦ,
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток > 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаКонечныйОстаток
	        	|	КОНЕЦ
	        	|ИЗ
	        	|	СырыеОстатки КАК СырыеОстатки
	        	|
	        	|ОБЪЕДИНИТЬ ВСЕ
	        	|
	        	|ВЫБРАТЬ
	        	|	СырыеОстатки.ЦеннаяБумага,
	        	|	СырыеОстатки.Партия,
	        	|	СырыеОстатки.СтрокаПартии,
	        	|	ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.Премия),
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток < 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаНачальныйОстаток
	        	|	КОНЕЦ,
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток < 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаПриход
	        	|	КОНЕЦ,
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток < 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаРасход
	        	|	КОНЕЦ,
	        	|	ВЫБОР
	        	|		КОГДА СырыеОстатки.ДисконтПремияПокупкиНачальныйОстаток < 0
	        	|			ТОГДА 0
	        	|		ИНАЧЕ СырыеОстатки.ДисконтПремияНачисленныйВВалютеУчетаКонечныйОстаток
	        	|	КОНЕЦ
	        	|ИЗ
	        	|	СырыеОстатки КАК СырыеОстатки
	        	|
	        	|ОБЪЕДИНИТЬ ВСЕ
	        	|
	        	|ВЫБРАТЬ
	        	|	ТаблицаНужныхПогашений.ЦеннаяБумага,
	        	|	ТаблицаНужныхПогашений.Партия,
	        	|	ТаблицаНужныхПогашений.СтрокаПартии,
	        	|	ТаблицаНужныхПогашений.ДополнительнаяАналитика,
	        	|	ТаблицаНужныхПогашений.СНД,
	        	|	ТаблицаНужныхПогашений.ДО,
	        	|	ТаблицаНужныхПогашений.КО,
	        	|	ТаблицаНужныхПогашений.СКД
	        	|ИЗ
	        	|	ТаблицаНужныхПогашений КАК ТаблицаНужныхПогашений
	        	|;
	        	|
	        	|////////////////////////////////////////////////////////////////////////////////
	        	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	ОстаткиПоАналитикам.ЦеннаяБумага КАК ЦеннаяБумага,
	        	|	ОстаткиПоАналитикам.Партия КАК Партия,
	        	|	ОстаткиПоАналитикам.СтрокаПартии КАК СтрокаПартии,
	        	|	ОстаткиПоАналитикам.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	        	|	ОстаткиПоАналитикам.СтоимостьВВалютеУчетаНачальныйОстаток КАК СНД,
	        	|	ОстаткиПоАналитикам.СтоимостьВВалютеУчетаПриход КАК ДО,
	        	|	ОстаткиПоАналитикам.СтоимостьВВалютеУчетаРасход КАК КО,
	        	|	ОстаткиПоАналитикам.СтоимостьВВалютеУчетаКонечныйОстаток КАК СКД,
	        	|	0 КАК СНК,
	        	|	0 КАК СКК
	        	|ИЗ
	        	|	ОстаткиПоАналитикам КАК ОстаткиПоАналитикам
	        	|
	        	|УПОРЯДОЧИТЬ ПО
	        	|	ОстаткиПоАналитикам.ЦеннаяБумага.Наименование,
	        	|	Партия,
	        	|	СтрокаПартии,
	        	|	ДополнительнаяАналитика
	        	|ИТОГИ
	        	|	СУММА(СНД),
	        	|	СУММА(ДО),
	        	|	СУММА(КО),
	        	|	СУММА(СКД),
	        	|	СУММА(СНК),
	        	|	СУММА(СКК)
	        	|ПО
	        	|	ОБЩИЕ,
	        	|	ЦеннаяБумага,
	        	|	Партия,
	        	|	СтрокаПартии";
	
КонецФункции

Функция ПолучитьЛицевойСчет(ЛицевойСчетЦБ, Партия, СтрокаПартии);

	Если ТипЗнч(Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
		
		// 10символов из номера лицевого + 9 символов из номера документа + 3 символа номер строки + 3 правых символа из номера лицевого
		Возврат Лев(ЛицевойСчетЦБ.Наименование, 10) + Прав(СокрЛП(Партия.Номер), 9) + Формат(СтрокаПартии, "ЧЦ=3; ЧВН=") + Прав(ЛицевойСчетЦБ.Наименование, 3);
		
	ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
		
		// 10символов из номера лицевого + 10 символов номер сделки + 5 правых символа из номера лицевого
		Возврат Лев(ЛицевойСчетЦБ.Наименование, 10) + СокрЛП(Партия.Основание.НомерСделки) + Прав(ЛицевойСчетЦБ.Наименование, 5);
		
	ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
		
		// 10символов из номера лицевого + 9 символов из номера документа + 3 символа номер строки + 3 правых символа из номера лицевого
		Возврат Лев(ЛицевойСчетЦБ.Наименование, 10) + Прав(СокрЛП(Партия.Номер), 9) + Формат(СтрокаПартии, "ЧЦ=3; ЧВН=") + Прав(ЛицевойСчетЦБ.Наименование, 3);
		
	ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.Сделка") Тогда
		
		// 10символов из номера лицевого + 10 символов номер сделки + 5 правых символа из номера лицевого
		Возврат Лев(ЛицевойСчетЦБ.Наименование, 10) + СокрЛП(Партия.НомерСделки) + Прав(ЛицевойСчетЦБ.Наименование, 5);
		
	ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		
		// 10символов из номера лицевого + 10 символов номер сделки + 5 правых символа из номера лицевого
		Возврат Лев(ЛицевойСчетЦБ.Наименование, 10) + СокрЛП(Партия.НомерСделки) + Прав(ЛицевойСчетЦБ.Наименование, 5);
		
	КонецЕсли;

КонецФункции

Процедура ВывестиПоСчетуПереоценкиКорректировкиЦБ(Результат, СтрокаТаблицыСчетов, ОбластьСчет, ОбластьАналитика, ТаблицаПереоценокИКорректировок, Аналитика)

	// ТаблицаПереоценокИКорректировок:
	// 	УчетныйАктивЕПС, ЦеннаяБумага, Партия, СтрокаПартии, 
	//	СчетУчетаПереоценкиА, ПереоценкаА, ПереоценкаАПриход, ПереоценкаАРасход, ПереоценкаАОстаток
	//	СчетУчетаПереоценкиП, ПереоценкаП, ПереоценкаППриход, ПереоценкаПРасход, ПереоценкаПОстаток
	//	СчетУчетаКорректировокА, КорректировкаА, КорректировкаАПриход, КорректировкаАРасход, КорректировкаАОстаток
	//	СчетУчетаКорректировокП, КорректировкаП, КорректировкаППриход, КорректировкаПРасход, КорректировкаПОстаток
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПереоценокИКорректировок.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ТаблицаПереоценокИКорректировок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаПереоценокИКорректировок.Партия КАК Партия,
		|	ТаблицаПереоценокИКорректировок.СтрокаПартии КАК СтрокаПартии,
		|	ТаблицаПереоценокИКорректировок.ПереоценкаА КАК НачальныйОстаток,
		|	ТаблицаПереоценокИКорректировок.ПереоценкаАПриход КАК Приход,
		|	ТаблицаПереоценокИКорректировок.ПереоценкаАРасход КАК Расход,
		|	ТаблицаПереоценокИКорректировок.ПереоценкаАОстаток КАК КонечныйОстаток,
		|	ТаблицаПереоценокИКорректировок.СчетУчетаПереоценкаА КАК СчетУчета
		|ПОМЕСТИТЬ ВсеОстатки
		|ИЗ
		|	&ТаблицаПереоценокИКорректировок КАК ТаблицаПереоценокИКорректировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ВсеОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВсеОстатки.Партия КАК Партия,
		|	ВсеОстатки.СтрокаПартии КАК СтрокаПартии,
		|	ВсеОстатки.НачальныйОстаток КАК НачальныйОстаток,
		|	ВсеОстатки.Приход КАК Приход,
		|	ВсеОстатки.Расход КАК Расход,
		|	ВсеОстатки.КонечныйОстаток КАК КонечныйОстаток,
		|	ВсеОстатки.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ОстаткиПоСчету
		|ИЗ
		|	ВсеОстатки КАК ВсеОстатки
		|ГДЕ
		|	ВсеОстатки.СчетУчета = &СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиПоСчету.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиПоСчету.Партия КАК Партия,
		|	ОстаткиПоСчету.СтрокаПартии КАК СтрокаПартии,
		|	ОстаткиПоСчету.НачальныйОстаток КАК НачальныйОстаток1,
		|	ОстаткиПоСчету.Приход КАК Приход1,
		|	ОстаткиПоСчету.Расход КАК Расход1,
		|	ОстаткиПоСчету.КонечныйОстаток КАК КонечныйОстаток1,
		|	0 КАК ОбратныйНачальныйОстаток1,
		|	0 КАК ОбратныйКонечныйОстаток1
		|ИЗ
		|	ОстаткиПоСчету КАК ОстаткиПоСчету
		|ИТОГИ
		|	СУММА(НачальныйОстаток),
		|	СУММА(Приход),
		|	СУММА(Расход),
		|	СУММА(КонечныйОстаток)
		|ПО
		|	ОБЩИЕ,
		|	ЦеннаяБумага,
		|	Партия";
	
	Если Аналитика = "Переоценка+" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПереоценкаА", "ПереоценкаА");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК НачальныйОстаток1", "КАК СНД");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйНачальныйОстаток1", "КАК СНК");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Приход1", "КАК ДО");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Расход1", "КАК КО");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК КонечныйОстаток1", "КАК СКД");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйКонечныйОстаток1", "КАК СКК");
		
	ИначеЕсли Аналитика = "Переоценка-" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПереоценкаА", "ПереоценкаП");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК НачальныйОстаток1", "КАК СНК");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйНачальныйОстаток1", "КАК СНД");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Приход1", "КАК КО");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Расход1", "КАК ДО");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК КонечныйОстаток1", "КАК СКК");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйКонечныйОстаток1", "КАК СКД");
		
	ИначеЕсли Аналитика = "Корректировка+" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПереоценкаА", "КорректировкаА");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК НачальныйОстаток1", "КАК СНД");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйНачальныйОстаток1", "КАК СНК");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Приход1", "КАК ДО");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Расход1", "КАК КО");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК КонечныйОстаток1", "КАК СКД");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйКонечныйОстаток1", "КАК СКК");
		
	ИначеЕсли Аналитика = "Корректировка-" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПереоценкаА", "КорректировкаП");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК НачальныйОстаток1", "КАК СНК");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйНачальныйОстаток1", "КАК СНД");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Приход1", "КАК КО");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Расход1", "КАК ДО");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК КонечныйОстаток1", "КАК СКК");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбратныйКонечныйОстаток1", "КАК СКД");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетУчета", СтрокаТаблицыСчетов.Счет);
	Запрос.УстановитьПараметр("ТаблицаПереоценокИКорректировок", ТаблицаПереоценокИКорректировок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	Если (ВыборкаОбщийИтог.СНД = 0 ИЛИ ВыборкаОбщийИтог.СНД = NULL)
		И (ВыборкаОбщийИтог.СКД = 0 ИЛИ ВыборкаОбщийИтог.СКД = NULL)
		И (ВыборкаОбщийИтог.ДО = 0 ИЛИ ВыборкаОбщийИтог.ДО = NULL)
		И (ВыборкаОбщийИтог.КО = 0 ИЛИ ВыборкаОбщийИтог.КО = NULL)
		И (ВыборкаОбщийИтог.СКД = 0 ИЛИ ВыборкаОбщийИтог.СКД = NULL)
		И (ВыборкаОбщийИтог.СКК = 0 ИЛИ ВыборкаОбщийИтог.СКК = NULL) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбластьСчет.Параметры, ВыборкаОбщийИтог);
	
	ВывестиДанныеСчета(Результат, ОбластьСчет, СтрокаТаблицыСчетов.Счет, СтрокаТаблицыСчетов.СчетКод, СтрокаТаблицыСчетов.СчетНаименование, СтрокаТаблицыСчетов.Субсчет);	
	
	ВыборкаЦеннаяБумага = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦеннаяБумага.Следующий() Цикл
		
		Если ВыборкаЦеннаяБумага.СНД = 0 И ВыборкаЦеннаяБумага.СКД = 0 И 
			ВыборкаЦеннаяБумага.ДО = 0 И ВыборкаЦеннаяБумага.КО = 0 И 
			ВыборкаЦеннаяБумага.СКД = 0 И ВыборкаЦеннаяБумага.СКК = 0 Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Если ЭтотОбъект.ПоСубконто Тогда
			ВывестиПоАналитике(Результат, ВыборкаЦеннаяБумага, ВыборкаЦеннаяБумага.ЦеннаяБумага, ОбластьАналитика, 4);
		КонецЕсли;
		
		Если ЭтотОбъект.ПоЛицевымСчетам Тогда
		
			ЛицевойСчетЦБ = БухгалтерскийУчетПовтИсп.ПолучитьЛицевойСчет(
										СтрокаТаблицыСчетов.Счет,
										ЭтотОбъект.Организация.ВалютаУчета,
										ЭтотОбъект.Организация,
										ЭтотОбъект.СчетДоверительногоУправления,
										ВыборкаЦеннаяБумага.ЦеннаяБумага);
		
		КонецЕсли;
		
		ВыборкаПартия = ВыборкаЦеннаяБумага.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартия.Следующий() Цикл
			
			Если ЭтотОбъект.ПоСубконто Тогда
				ВывестиПоАналитике(Результат, ВыборкаПартия, ВыборкаПартия.Партия, ОбластьАналитика, 6);
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = ВыборкаПартия.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ЭтотОбъект.ПоСубконто Тогда
					ВывестиПоАналитике(Результат, ВыборкаДетальныеЗаписи, ВыборкаДетальныеЗаписи.СтрокаПартии, ОбластьАналитика, 8);
				КонецЕсли;
				
				Если ЭтотОбъект.ПоЛицевымСчетам Тогда
					
					ЛицевойСчет = ПолучитьЛицевойСчет(ЛицевойСчетЦБ, ВыборкаПартия.Партия, ВыборкаДетальныеЗаписи.СтрокаПартии);
					Отступ = ?(ЭтотОбъект.ПоСубконто, 10, 4);
					ВывестиПоАналитике(Результат, ВыборкаДетальныеЗаписи, ЛицевойСчет, ОбластьАналитика, Отступ);
				
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиПоСчетуЦБ(Результат, СтрокаТаблицыСчетов, ОбластьСчет, ОбластьАналитика, ТаблицаПереоценокИКорректировок, ТаблицаПогашений)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеАктивыЕПС.Ссылка КАК УчетныйАктивЕПС,
		|	ВЫБОР
		|		КОГДА УчетныеАктивыЕПС.СчетУчета = &Счет
		|				ИЛИ УчетныеАктивыЕПС.СчетУчетаКупона = &Счет
		|			ТОГДА ""Тело""
		|		КОГДА УчетныеАктивыЕПС.СчетУчетаПереоценкиА = &Счет
		|			ТОГДА ""Переоценка+""
		|		КОГДА УчетныеАктивыЕПС.СчетУчетаПереоценкиП = &Счет
		|			ТОГДА ""Переоценка-""
		|		КОГДА УчетныеАктивыЕПС.СчетУчетаКорректировокА = &Счет
		|			ТОГДА ""Корректировка+""
		|		КОГДА УчетныеАктивыЕПС.СчетУчетаКорректировокП = &Счет
		|			ТОГДА ""Корректировка-""
		|		ИНАЧЕ ""Неизвестно""
		|	КОНЕЦ КАК Аналитика
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	(УчетныеАктивыЕПС.СчетУчета = &Счет
		|			ИЛИ УчетныеАктивыЕПС.СчетУчетаПереоценкиА = &Счет
		|			ИЛИ УчетныеАктивыЕПС.СчетУчетаПереоценкиП = &Счет
		|			ИЛИ УчетныеАктивыЕПС.СчетУчетаКупона = &Счет
		|			ИЛИ УчетныеАктивыЕПС.СчетУчетаКорректировокА = &Счет
		|			ИЛИ УчетныеАктивыЕПС.СчетУчетаКорректировокП = &Счет)";
	
	Запрос.УстановитьПараметр("Счет", СтрокаТаблицыСчетов.Счет);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		УчетныйАктивЕПС = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
		Аналитика = ВыборкаДетальныеЗаписи.Аналитика;
		Если Аналитика <> "Тело" Тогда
			ВывестиПоСчетуПереоценкиКорректировкиЦБ(Результат, СтрокаТаблицыСчетов, ОбластьСчет, ОбластьАналитика, ТаблицаПереоценокИКорректировок, Аналитика);
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// 4 варианта: 
	//	1. Субконто и Лицевик 	- запрос ПолучитьТекстЗапросаПартииСЛицевымиИСубконто 
	//	2. Лицевик	 			- запрос ПолучитьТекстЗапросаПартииСЛицевымиИСубконто - только субконто не выводим
	//	3. Субконто 			- запрос ПолучитьТекстЗапросаПартииССубконто
	//	4. 			 			- просто выведем по счету данные без запросов
	
	Если ЭтотОбъект.ПоЛицевымСчетам Тогда
		Запрос.Текст = ПолучитьТекстЗапросаПартииСЛицевымиИСубконто(); 
		// Поля - ЦеннаяБумага, Партия, СтрокаПартии, ДополнительнаяАналитика, СНД, СНК, ДО, КО, СКД, СКК
		// Группировки - ЦеннаяБумага, Партия, СтрокаПартии
	ИначеЕсли ЭтотОбъект.ПоСубконто Тогда
		Запрос.Текст = ПолучитьТекстЗапросаПартииССубконто(); 
		// Поля - ЦеннаяБумага, Партия, СтрокаПартии, СНД, СНК, ДО, КО, СКД, СКК
		// Группировки - ЦеннаяБумага, Партия
	Иначе
		
		ЗаполнитьЗначенияСвойств(ОбластьСчет.Параметры, СтрокаТаблицыСчетов);
		
		ВывестиДанныеСчета(Результат, ОбластьСчет, СтрокаТаблицыСчетов.Счет, СтрокаТаблицыСчетов.СчетКод, СтрокаТаблицыСчетов.СчетНаименование, СтрокаТаблицыСчетов.Субсчет);
		
		Возврат;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Запрос.УстановитьПараметр("ДатаНачалаДата", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаНачала", Новый Граница(НачалоДня(ЭтотОбъект.Период.ДатаНачала), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("УчетныйАктивЕПС", УчетныйАктивЕПС);
	Запрос.УстановитьПараметр("ТаблицаПогашений", ТаблицаПогашений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	ЗаполнитьЗначенияСвойств(ОбластьСчет.Параметры, ВыборкаОбщийИтог);
	
	ВывестиДанныеСчета(Результат, ОбластьСчет, СтрокаТаблицыСчетов.Счет, СтрокаТаблицыСчетов.СчетКод, СтрокаТаблицыСчетов.СчетНаименование, СтрокаТаблицыСчетов.Субсчет);
	
	
	ВыборкаЦеннаяБумага = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦеннаяБумага.Следующий() Цикл
		
		Если ЭтотОбъект.ПоСубконто Тогда
			ВывестиПоАналитике(Результат, ВыборкаЦеннаяБумага, ВыборкаЦеннаяБумага.ЦеннаяБумага, ОбластьАналитика, 4);
		КонецЕсли;
		
		ВыборкаПартия = ВыборкаЦеннаяБумага.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартия.Следующий() Цикл
			
			Если ЭтотОбъект.ПоСубконто Тогда
				ВывестиПоАналитике(Результат, ВыборкаПартия, ВыборкаПартия.Партия, ОбластьАналитика, 6);
			КонецЕсли;
			
			Если ЭтотОбъект.ПоЛицевымСчетам Тогда
				
				ВыборкаСтрокаПартии = ВыборкаПартия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСтрокаПартии.Следующий() Цикл
					
					Если ЭтотОбъект.ПоСубконто Тогда
						ВывестиПоАналитике(Результат, ВыборкаСтрокаПартии, ВыборкаСтрокаПартии.СтрокаПартии, ОбластьАналитика, 8);
					КонецЕсли;
					
					ВыборкаДетальныеЗаписи = ВыборкаСтрокаПартии.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						ЛицевойСчетЦБ = БухгалтерскийУчетПовтИсп.ПолучитьЛицевойСчет(
													СтрокаТаблицыСчетов.Счет,
													ЭтотОбъект.Организация.ВалютаУчета,
													ЭтотОбъект.Организация,
													ЭтотОбъект.СчетДоверительногоУправления,
													ВыборкаЦеннаяБумага.ЦеннаяБумага,,,
													ВыборкаДетальныеЗаписи.ДополнительнаяАналитика);
						
						ЛицевойСчет = ПолучитьЛицевойСчет(ЛицевойСчетЦБ, ВыборкаПартия.Партия, ВыборкаСтрокаПартии.СтрокаПартии);
						
						Отступ = ?(ЭтотОбъект.ПоСубконто, 10, 4);
						ВывестиПоАналитике(Результат, ВыборкаДетальныеЗаписи, ЛицевойСчет, ОбластьАналитика, Отступ);
						
					КонецЦикла;
				
				КонецЦикла;
				
			Иначе
				
				ВыборкаДетальныеЗаписи = ВыборкаПартия.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ВывестиПоАналитике(Результат, ВыборкаДетальныеЗаписи, ВыборкаДетальныеЗаписи.СтрокаПартии, ОбластьАналитика, 8);
				КонецЦикла;
			
			КонецЕсли;
		КонецЦикла;
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

Функция РасчитатьПогашения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход КАК СуммаПриход,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход КАК СуммаРасход,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета + БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК Стоимость,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ ДвиженияПогашений
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (&ВидыЗадолженности)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ПО ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание = БухПартииЦенныхБумаг.Регистратор
		|			И (БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|ГДЕ
		|	НЕ БухПартииЦенныхБумаг.ЦеннаяБумага ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияПогашений.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ДвиженияПогашений.Партия КАК Партия,
		|	ДвиженияПогашений.СтрокаПартии КАК СтрокаПартии,
		|	ДвиженияПогашений.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ВЫБОР
		|		КОГДА ДвиженияПогашений.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела)
		|	КОНЕЦ КАК ДополнительнаяАналитика,
		|	ДвиженияПогашений.СуммаНачальныйОстаток * ДвиженияПогашений.Стоимость / (ДвиженияПогашений.СуммаНачальныйОстаток + ДвиженияПогашений.СуммаПриход) КАК СНД,
		|	ДвиженияПогашений.СуммаПриход * ДвиженияПогашений.Стоимость / (ДвиженияПогашений.СуммаНачальныйОстаток + ДвиженияПогашений.СуммаПриход) КАК ДО,
		|	ДвиженияПогашений.СуммаРасход * ДвиженияПогашений.Стоимость / (ДвиженияПогашений.СуммаНачальныйОстаток + ДвиженияПогашений.СуммаПриход) КАК КО,
		|	ДвиженияПогашений.СуммаКонечныйОстаток * ДвиженияПогашений.Стоимость / (ДвиженияПогашений.СуммаНачальныйОстаток + ДвиженияПогашений.СуммаПриход) КАК СКД
		|ИЗ
		|	ДвиженияПогашений КАК ДвиженияПогашений";
	
	ВидыЗадолженности = Новый Массив;
	
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюКупона);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюОблигации);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации);
	
	Запрос.УстановитьПараметр("ВидыЗадолженности", ВидыЗадолженности);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция РасчитатьПереоценкуИКорректировку()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток
		|	КОНЕЦ КАК ПереоценкаА,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток > 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток
		|	КОНЕЦ КАК ПереоценкаП,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток
		|	КОНЕЦ КАК КорректировкаА,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток > 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток
		|	КОНЕЦ КАК КорректировкаП,
		|	0 КАК ПереоценкаАПриход,
		|	0 КАК ПереоценкаАРасход,
		|	0 КАК ПереоценкаППриход,
		|	0 КАК ПереоценкаПРасход,
		|	0 КАК КорректировкаАПриход,
		|	0 КАК КорректировкаАРасход,
		|	0 КАК КорректировкаППриход,
		|	0 КАК КорректировкаПРасход,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток
		|	КОНЕЦ КАК ПереоценкаАОстаток,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток > 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток
		|	КОНЕЦ КАК ПереоценкаПОстаток,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток
		|	КОНЕЦ КАК КорректировкаАОстаток,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток > 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток
		|	КОНЕЦ КАК КорректировкаПОстаток,
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК СчетУчетаПереоценкаА,
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП КАК СчетУчетаПереоценкаП,
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокА КАК СчетУчетаКорректировкаА,
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокП КАК СчетУчетаКорректировкаП
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = &ВидУчета
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|		ПО БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС = УчетныеАктивыЕПС.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Наименование";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(НачалоДня(ЭтотОбъект.Период.ДатаНачала), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И БухПартииЦенныхБумаг.Организация = &Организация
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	БухПартииЦенныхБумаг.МоментВремени";
	
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокиОстатков = ТаблицаОстатков.НайтиСтроки(
							Новый Структура("УчетныйАктивЕПС,ЦеннаяБумага,Партия,СтрокаПартии", 
								ВыборкаДетальныеЗаписи.УчетныйАктивЕПС,
								ВыборкаДетальныеЗаписи.ЦеннаяБумага,
								ВыборкаДетальныеЗаписи.Партия,
								ВыборкаДетальныеЗаписи.СтрокаПартии));
								
		Если СтрокиОстатков.Количество() = 0 Тогда
		    СтрокаОстатков = ТаблицаОстатков.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОстатков, ВыборкаДетальныеЗаписи);
			СтрокаОстатков.ПереоценкаА = 0; СтрокаОстатков.ПереоценкаАПриход = 0; СтрокаОстатков.ПереоценкаАРасход = 0; СтрокаОстатков.ПереоценкаАОстаток = 0;
			СтрокаОстатков.ПереоценкаП = 0; СтрокаОстатков.ПереоценкаППриход = 0; СтрокаОстатков.ПереоценкаПРасход = 0; СтрокаОстатков.ПереоценкаПОстаток = 0;
			СтрокаОстатков.КорректировкаА = 0; СтрокаОстатков.КорректировкаАПриход = 0; СтрокаОстатков.КорректировкаАРасход = 0; СтрокаОстатков.КорректировкаАОстаток = 0;
			СтрокаОстатков.КорректировкаП = 0; СтрокаОстатков.КорректировкаППриход = 0; СтрокаОстатков.КорректировкаПРасход = 0; СтрокаОстатков.КорректировкаПОстаток = 0;
			
			СтрокаОстатков.СчетУчетаПереоценкаА = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиА;
			СтрокаОстатков.СчетУчетаПереоценкаП = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиП;
			СтрокаОстатков.СчетУчетаКорректировкаА = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА;
			СтрокаОстатков.СчетУчетаКорректировкаП = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП;
			
		Иначе
			СтрокаОстатков = СтрокиОстатков[0];
		КонецЕсли;
		
								
		СуммаПереоценки = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета * ?(ВыборкаДетальныеЗаписи.ВидДвижения = ВидДвиженияНакопления.Приход, 1, -1);
		СуммаКорректировки = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета * ?(ВыборкаДетальныеЗаписи.ВидДвижения = ВидДвиженияНакопления.Приход, 1, -1);
		
		Если СуммаКорректировки <> 0 Тогда
			// обрабатываем как парные: если требуется - меняем счет в проводке,
			// если после этого ушли в минус - добавляем проводку по перебросу минуса на парный счет 
			// например 71005 был кр. остаток 90, документ пришел сюда с проводкой 71006-50156 на сумму 110
			// меняем счет на парный в исходной проводке, получаем 71005-50156 (110), в результате на 71005 оразуется дт. остаток 20
			// добавляем проводку 71006-71005 (20)
			Если СтрокаОстатков.КорректировкаПОстаток > 0 Тогда // пассивное сальдо
				
				Если СуммаКорректировки > 0 Тогда // уменьшаем пассивное сальдо
					
					Если СтрокаОстатков.КорректировкаПОстаток >= СуммаКорректировки Тогда // просто уменьшим
						
						СтрокаОстатков.КорректировкаПРасход = СтрокаОстатков.КорректировкаПРасход + СуммаКорректировки;
						СтрокаОстатков.КорректировкаПОстаток = СтрокаОстатков.КорректировкаПОстаток - СуммаКорректировки;
						
					Иначе // уйдем в минус а затем вернемся в ноль и перейдем в активное сальдо
						
						СуммаПоложительнойКорректировки = СуммаКорректировки - СтрокаОстатков.КорректировкаПОстаток;
						
						СтрокаОстатков.КорректировкаПРасход = СтрокаОстатков.КорректировкаПРасход + СуммаКорректировки;
						СтрокаОстатков.КорректировкаППриход = СтрокаОстатков.КорректировкаППриход + СуммаПоложительнойКорректировки;
						СтрокаОстатков.КорректировкаПОстаток = 0;
						
						СтрокаОстатков.КорректировкаАПриход = СтрокаОстатков.КорректировкаАПриход + СуммаПоложительнойКорректировки;
						СтрокаОстатков.КорректировкаАОстаток = СуммаПоложительнойКорректировки;
						
					КонецЕсли;
					
				Иначе // увеличиваем пассивное сальдо
					
					СтрокаОстатков.КорректировкаППриход = СтрокаОстатков.КорректировкаППриход + (-СуммаКорректировки);
					СтрокаОстатков.КорректировкаПОстаток = СтрокаОстатков.КорректировкаПОстаток + (-СуммаКорректировки);
				
				КонецЕсли;
			
			Иначе // активное или нулевое сальдо
				
				Если СуммаКорректировки > 0 Тогда // увеличиваем активное сальдо
					
					СтрокаОстатков.КорректировкаАПриход = СтрокаОстатков.КорректировкаАПриход + СуммаКорректировки;
					СтрокаОстатков.КорректировкаАОстаток = СтрокаОстатков.КорректировкаАОстаток + СуммаКорректировки;
					
				Иначе // уменьшаем активное сальдо
					
					Если СтрокаОстатков.КорректировкаАОстаток >= (-СуммаКорректировки) Тогда // просто уменьшим
						
						СтрокаОстатков.КорректировкаАРасход = СтрокаОстатков.КорректировкаАРасход - (-СуммаКорректировки);
						СтрокаОстатков.КорректировкаАОстаток = СтрокаОстатков.КорректировкаАОстаток - (-СуммаКорректировки);
						
					Иначе // уйдем в минус а затем вернемся в ноль и пассивное сальдо
						
						СуммаОтрицательнойКорректировки = -СуммаКорректировки - СтрокаОстатков.КорректировкаАОстаток;
						
						СтрокаОстатков.КорректировкаАРасход = СтрокаОстатков.КорректировкаАРасход + (-СуммаКорректировки);
						СтрокаОстатков.КорректировкаАПриход = СтрокаОстатков.КорректировкаАПриход + СуммаОтрицательнойКорректировки;
						СтрокаОстатков.КорректировкаАОстаток = 0;
						
						СтрокаОстатков.КорректировкаППриход = СтрокаОстатков.КорректировкаППриход + СуммаОтрицательнойКорректировки;
						СтрокаОстатков.КорректировкаПОстаток = СуммаОтрицательнойКорректировки;
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СуммаПереоценки <> 0 Тогда
			// обрабатываем иначе: если требуется - меняем счет в проводке,
			// если после этого ушли в минус - корректируем сумму в этой проводке и добавляем такую же с парным счетом на разность
			// например 71503 был кр. остаток 90, документ пришел сюда с проводкой 71504-50131 на сумму 110
			// меняем счет на парный в исходной проводке, получаем 71503-50131, чтобы не уйти в минус меняем сумму на 90
			// добавляем проводку 71504-50131 (20)
			Если СтрокаОстатков.ПереоценкаПОстаток > 0 Тогда // пассивное сальдо
				
				Если СуммаПереоценки > 0 Тогда // уменьшаем пассивное сальдо
					
					Если СтрокаОстатков.ПереоценкаПОстаток >= СуммаПереоценки Тогда // просто уменьшим
						
						СтрокаОстатков.ПереоценкаПРасход = СтрокаОстатков.ПереоценкаПРасход + СуммаПереоценки;
						СтрокаОстатков.ПереоценкаПОстаток = СтрокаОстатков.ПереоценкаПОстаток - СуммаПереоценки;
						
					Иначе // уменьшим до нуля и перейдем в активное сальдо
						
						СуммаПоложительнойПереоценки = СуммаПереоценки - СтрокаОстатков.ПереоценкаПОстаток;
						
						СтрокаОстатков.ПереоценкаПРасход = СтрокаОстатков.ПереоценкаПРасход + СтрокаОстатков.ПереоценкаПОстаток;
						СтрокаОстатков.ПереоценкаПОстаток = 0;
						
						СтрокаОстатков.ПереоценкаАПриход = СтрокаОстатков.ПереоценкаАПриход + СуммаПоложительнойПереоценки;
						СтрокаОстатков.ПереоценкаАОстаток = СуммаПоложительнойПереоценки;
						
					КонецЕсли;
					
				Иначе // увеличиваем пассивное сальдо
					
					СтрокаОстатков.ПереоценкаППриход = СтрокаОстатков.ПереоценкаППриход + (-СуммаПереоценки);
					СтрокаОстатков.ПереоценкаПОстаток = СтрокаОстатков.ПереоценкаПОстаток + (-СуммаПереоценки);
				
				КонецЕсли;
			
			Иначе // активное или нулевое сальдо
				
				Если СуммаПереоценки > 0 Тогда // увеличиваем активное сальдо
					
					СтрокаОстатков.ПереоценкаАПриход = СтрокаОстатков.ПереоценкаАПриход + СуммаПереоценки;
					СтрокаОстатков.ПереоценкаАОстаток = СтрокаОстатков.ПереоценкаАОстаток + СуммаПереоценки;
					
				Иначе // уменьшаем активное сальдо
					
					Если СтрокаОстатков.ПереоценкаАОстаток >= (-СуммаПереоценки) Тогда // просто уменьшим
						
						СтрокаОстатков.ПереоценкаАРасход = СтрокаОстатков.ПереоценкаАРасход + (-СуммаПереоценки);
						СтрокаОстатков.ПереоценкаАОстаток = СтрокаОстатков.ПереоценкаАОстаток - (-СуммаПереоценки);
						
					Иначе // уменьшим до нуля и перейдем в пассивное сальдо
						
						СуммаОтрицательнойПереоценки = -СуммаПереоценки - СтрокаОстатков.ПереоценкаАОстаток;
						
						СтрокаОстатков.ПереоценкаАРасход = СтрокаОстатков.ПереоценкаАРасход + СтрокаОстатков.ПереоценкаАОстаток;
						СтрокаОстатков.ПереоценкаАОстаток = 0;
						
						СтрокаОстатков.ПереоценкаППриход = СтрокаОстатков.ПереоценкаППриход + СуммаОтрицательнойПереоценки;
						СтрокаОстатков.ПереоценкаПОстаток = СуммаОтрицательнойПереоценки;
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаОстатков;
	
КонецФункции

Функция ЭтоСчетЦБ(КодСчета)

	Код3 = Лев(КодСчета, 3);
	
	Возврат Код3 = "501" ИЛИ Код3 = "502" ИЛИ Код3 = "503" ИЛИ Код3 = "504" ИЛИ Код3 = "506" ИЛИ Код3 = "507";
	
КонецФункции

Процедура ПроверитьНаличиеСчетаОстатков(Счет, ТаблицаСчетов)

	Если НЕ ЗначениеЗаполнено(Счет) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если ТаблицаСчетов.НайтиСтроки(Новый Структура("Счет", Счет)).Количество() = 0 Тогда
	
		НоваяСтрокаТаблицаСчетов = ТаблицаСчетов.Добавить();
		
		НоваяСтрокаТаблицаСчетов.Счет = Счет;
		НоваяСтрокаТаблицаСчетов.СчетКод = Счет.Код;
		НоваяСтрокаТаблицаСчетов.Субсчет = Истина;
		НоваяСтрокаТаблицаСчетов.СчетНаименование = Счет.Наименование;
		
	КонецЕсли;	

КонецПроцедуры

Функция СформироватьОтчет(Результат, Подписант) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,ПоЛицевымСчетам,ПоСубконто,БратьДанныеРегистраПартий", Новый Структура("Подписант", Подписант));
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Результат.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСчет = Макет.ПолучитьОбласть("ОбластьСчет");
	ОбластьАналитика = Макет.ПолучитьОбласть("ОбластьАналитика");
	
	
	ОбластьЗаголовок.Параметры.Организация   = ЭтотОбъект.Организация;
	ОбластьЗаголовок.Параметры.Заголовок   = "Оборотно-сальдовая ведомость" + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	ОбластьЗаголовок.Параметры.Параметры   = "Счет д/у: """ + ЭтотОбъект.СчетДоверительногоУправления + """" + Символы.ПС +
			" По договору: №" + ЭтотОбъект.СчетДоверительногоУправления.НомерДоговора + 
			" от " + Формат(ЭтотОбъект.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy") + " года";
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.НачатьАвтогруппировкуСтрок();
	
	// Бухгалтерские остатки и обороты по счетам и субсчетам
	ТаблицаСчетов = ПолучитьТаблицуСчетов();
	
	Если ЭтотОбъект.БратьДанныеРегистраПартий Тогда
		// сразу посчитаем их целиком, иначе никак
		ТаблицаПереоценокИКорректировок = РасчитатьПереоценкуИКорректировку();
		ТаблицаПогашений = РасчитатьПогашения();
		
		Для каждого СтрокаТаблицаПереоценокИКорректировок Из ТаблицаПереоценокИКорректировок Цикл
			
			ПроверитьНаличиеСчетаОстатков(СтрокаТаблицаПереоценокИКорректировок.УчетныйАктивЕПС.СчетУчетаПереоценкиА, ТаблицаСчетов);
			ПроверитьНаличиеСчетаОстатков(СтрокаТаблицаПереоценокИКорректировок.УчетныйАктивЕПС.СчетУчетаПереоценкиП, ТаблицаСчетов);
			ПроверитьНаличиеСчетаОстатков(СтрокаТаблицаПереоценокИКорректировок.УчетныйАктивЕПС.СчетУчетаКорректировокА, ТаблицаСчетов);
			ПроверитьНаличиеСчетаОстатков(СтрокаТаблицаПереоценокИКорректировок.УчетныйАктивЕПС.СчетУчетаКорректировокП, ТаблицаСчетов);
		
		КонецЦикла;
		
		ТаблицаСчетов.Сортировать("СчетКод");
		
	КонецЕсли;
	
	ИтоговыеСуммы = Новый Структура("СНД,СНК,ДО,КО,СКД,СКК",0,0,0,0,0,0);
	
	Для Каждого СтрокаТаблицыСчетов Из ТаблицаСчетов Цикл
		
		Если СтрокаТаблицыСчетов.Субсчет И ЭтоСчетЦБ(СтрокаТаблицыСчетов.СчетКод) И ЭтотОбъект.БратьДанныеРегистраПартий Тогда 
			// вывод с регистра партий
			ВывестиПоСчетуЦБ(Результат, СтрокаТаблицыСчетов, ОбластьСчет, ОбластьАналитика, ТаблицаПереоценокИКорректировок, ТаблицаПогашений);
			
		Иначе // обычный вывод
			
			// СНД,СНК,ДО,КО,СКД,СКК
			ЗаполнитьЗначенияСвойств(ОбластьСчет.Параметры, СтрокаТаблицыСчетов);
			
			Если СтрокаТаблицыСчетов.СчетКод = "Итого" Тогда
			    ЗаполнитьЗначенияСвойств(ОбластьСчет.Параметры, ИтоговыеСуммы);
			КонецЕсли;
			
			// Счет, наименование
			СуммыСчета = ВывестиДанныеСчета(Результат, ОбластьСчет, СтрокаТаблицыСчетов.Счет, СтрокаТаблицыСчетов.СчетКод, СтрокаТаблицыСчетов.СчетНаименование, СтрокаТаблицыСчетов.Субсчет);
			
			Если НЕ СтрокаТаблицыСчетов.Субсчет Тогда
			     ИтоговыеСуммы.СНД	= ИтоговыеСуммы.СНД + СуммыСчета.СНД;
			     ИтоговыеСуммы.СНК	= ИтоговыеСуммы.СНК + СуммыСчета.СНК;
			     ИтоговыеСуммы.ДО	= ИтоговыеСуммы.ДО + СуммыСчета.ДО;
			     ИтоговыеСуммы.КО	= ИтоговыеСуммы.КО + СуммыСчета.КО;
			     ИтоговыеСуммы.СКД	= ИтоговыеСуммы.СКД + СуммыСчета.СКД;
			     ИтоговыеСуммы.СКК	= ИтоговыеСуммы.СКК + СуммыСчета.СКК;
			ИначеЕсли СтрокаТаблицыСчетов.Субсчет И (ЭтотОбъект.ПоСубконто ИЛИ ЭтотОбъект.ПоЛицевымСчетам) Тогда
				// По субконто и лицевикам
				ВывестиПоСчету(Результат, СтрокаТаблицыСчетов.Счет, ОбластьАналитика);	 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ЗакончитьАвтогруппировкуСтрок();
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(Подписант, ЭтотОбъект.Организация);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(Результат, ПараметрыВыводаПодписей);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецФункции