
#Область СобытияБизнесПроцесса

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если НЕ ДанныеЗаполнения.Свойство("Дата") Тогда
		ЭтотОбъект.Дата = ТекущаяДата();
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтотОбъект.ПометкаУдаления И НЕ ЭтотОбъект.Отменен Тогда
		КонтрольУникальностиБизнесПроцесса(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	Если ЭтотОбъект.ПометкаУдаления И Не ЭтотОбъект.Ссылка.ПометкаУдаления Тогда
		КонтрольНеПомеченныхНаУдалениеЗадач(Отказ);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ПриСозданииЗадач

Процедура ПровестиОбучениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ГруппаИсполнителей = ПолучитьГруппуИсполнителей();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Ссылка", ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбучениеСотрудника.Дата КАК Дата,
		|	СостояниеСотрудниковОрганизаций.Период КАК Период,
		|	СостояниеСотрудниковОрганизаций.Состояние КАК Состояние
		|ПОМЕСТИТЬ _СостояниеСотрудника
		|ИЗ
		|	БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСотрудниковОрганизаций КАК СостояниеСотрудниковОрганизаций
		|		ПО ОбучениеСотрудника.Сотрудник = СостояниеСотрудниковОрганизаций.Сотрудник
		|			И ОбучениеСотрудника.Организация = СостояниеСотрудниковОрганизаций.Организация
		|ГДЕ
		|	ОбучениеСотрудника.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ДатыСостояний.ДатаПоследнегоСостояния ЕСТЬ NULL
		|			ТОГДА ОбучениеСотрудника.Дата
		|		КОГДА СостояниеНаДату.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)
		|			ТОГДА СостояниеНаДату.Дата
		|		ИНАЧЕ ДатыСостояний.ДатаВыходаНаРаботу
		|	КОНЕЦ КАК Дата,
		|	ОбучениеСотрудника.Сотрудник.Пользователь КАК Пользователь,
		|	ОбучениеСотрудника.Организация КАК Организация,
		|	ОбучениеСотрудника.Основание КАК Основание,
		|	ОбучениеСотрудника.Основание.ОкончаниеОбучения КАК СрокИсполнения,
		|	ОбучениеСотрудника.Основание.ТемаОбучения КАК ТемаОбучения
		|ИЗ
		|	БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(СостояниеСотрудникаНаДату.Период) КАК ДатаПоследнегоСостояния,
		|			МИНИМУМ(СостояниеСотрудникаРаботаетПослеДаты.Период) КАК ДатаВыходаНаРаботу
		|		ИЗ
		|			_СостояниеСотрудника КАК СостояниеСотрудникаНаДату
		|				ЛЕВОЕ СОЕДИНЕНИЕ _СостояниеСотрудника КАК СостояниеСотрудникаРаботаетПослеДаты
		|				ПО (СостояниеСотрудникаРаботаетПослеДаты.Период > СостояниеСотрудникаРаботаетПослеДаты.Дата)
		|					И (СостояниеСотрудникаРаботаетПослеДаты.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа))
		|		ГДЕ
		|			СостояниеСотрудникаНаДату.Период <= СостояниеСотрудникаНаДату.Дата) КАК ДатыСостояний
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СостояниеСотрудника КАК СостояниеНаДату
		|		ПО (ДатыСостояний.ДатаПоследнегоСостояния = СостояниеНаДату.Период)
		|ГДЕ
		|	ОбучениеСотрудника.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Для Каждого Задача Из ФормируемыеЗадачи Цикл		
			ЗаполнитьЗначенияСвойств(Задача, Выборка);
			Задача.ГруппаИсполнителей 	= ГруппаИсполнителей;
			
			Задача.Наименование			= ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи;
			Задача.ТекстЗадачи			= ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " по теме " + Выборка.ТемаОбучения;
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Отсутсвуют данные о состоянии сотрудника %1 на %2",
			ЭтотОбъект.Сотрудник,
			Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy")),,,, Отказ);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПройтиОбучениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Если ЭтотОбъект.Сотрудник.Пользователь.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("У сотрудника %1 не указан пользователь. Создание задачи невозможно.", ЭтотОбъект.Сотрудник),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		Задача.Дата				= ЭтотОбъект.Дата;
		Задача.Исполнитель		= ЭтотОбъект.Сотрудник.Пользователь;
		Задача.Организация		= ЭтотОбъект.Организация;
		Задача.Основание		= ЭтотОбъект.Основание;
		Задача.СрокИсполнения	= ЭтотОбъект.Основание.ОкончаниеОбучения;
		Задача.Наименование		= "Пройти обучение";
		Задача.ТекстЗадачи		= "Пройти обучение по теме: " + ЭтотОбъект.Основание.ТемаОбучения;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗнанияПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ГруппаИсполнителей			= ПолучитьГруппуИсполнителей();
	ДатыЗадачНаПроверкуЗнаний	= ПолучитьДатыЗадачНаПроверкуЗнаний(ФормируемыеЗадачи);
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Дата					= РаботаСДокументами.ПолучитьВремяДокумента(ДатыЗадачНаПроверкуЗнаний.Получить(Задача.БизнесПроцесс), Задача.Ссылка);
		Задача.ГруппаИсполнителей 	= ГруппаИсполнителей;
		Задача.Организация			= ЭтотОбъект.Организация;
		Задача.Основание			= ЭтотОбъект.Основание;
		Задача.СрокИсполнения		= ЭтотОбъект.Основание.ОкончаниеПроверкиЗнаний;
		Задача.Наименование			= "Проверка знаний";
		Задача.ТекстЗадачи			= "Проверка знаний по теме:  " + ЭтотОбъект.Основание.ТемаОбучения;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаУсловия

Процедура УсловиеТребуетсяПроверкаЗнанийПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ОбучениеСотрудников")
					И ЗначениеЗаполнено(ЭтотОбъект.Основание.НачалоПроверкиЗнаний);
	
КонецПроцедуры

Процедура УсловиеИспользуютсяПростыеПодписиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ОбучениеСотрудников")
					И Документы.ОбучениеСотрудников.ИспользуютсяПростыеПодписи(ЭтотОбъект.Основание.Организация, ЭтотОбъект.Основание.ВидПеречня, ЭтотОбъект.Основание.Дата);	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеФункции

Процедура КонтрольНеПомеченныхНаУдалениеЗадач(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления";
	
	
	Реузлтат = Запрос.Выполнить();
	Если НЕ Реузлтат.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед пометкой на удаление бизнес-процесса, необходимо пометить на удаление подчинённые задачи:",,,, Отказ);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("	" + Выборка.Ссылка, Выборка.Ссылка,,, Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДатыЗадачНаПроверкуЗнаний(ФормируемыеЗадачи)
	
	ДатыЗадачНаПроверкуЗнаний = Новый Соответствие;
	
	МассивБизнесПроцессов = Новый Массив;
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		МассивБизнесПроцессов.Добавить(Задача.БизнесПроцесс);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивБизнесПроцессов", МассивБизнесПроцессов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбучениеСотрудника.Ссылка КАК БизнесПроцесс,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗадачаНаОбучение.ДатаВыполнения, ОбучениеСотрудника.Основание.НачалоПроверкиЗнаний) <= ОбучениеСотрудника.Основание.НачалоПроверкиЗнаний
		|			ТОГДА ОбучениеСотрудника.Основание.НачалоПроверкиЗнаний
		|		ИНАЧЕ ЗадачаНаОбучение.ДатаВыполнения
		|	КОНЕЦ КАК Дата
		|ИЗ
		|	БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаНаОбучение
		|		ПО ОбучениеСотрудника.Ссылка = ЗадачаНаОбучение.БизнесПроцесс
		|			И (ЗадачаНаОбучение.ТочкаМаршрута = ЗНАЧЕНИЕ(БизнесПроцесс.ОбучениеСотрудника.ТочкаМаршрута.ПройтиОбучение))
		|			И (НЕ ЗадачаНаОбучение.ПометкаУдаления)
		|			И (ЗадачаНаОбучение.Выполнена)
		|ГДЕ
		|	ОбучениеСотрудника.Ссылка В(&МассивБизнесПроцессов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДатыЗадачНаПроверкуЗнаний.Вставить(Выборка.БизнесПроцесс, Выборка.Дата);
	КонецЦикла;
	
	Возврат ДатыЗадачНаПроверкуЗнаний;
	
КонецФункции

Процедура КонтрольУникальностиБизнесПроцесса(Отказ)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Основание",		ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Сотрудник",		ЭтотОбъект.Сотрудник);
	Запрос.УстановитьПараметр("Ссылка",			ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбучениеСотрудника.Ссылка КАК БизнесПроцесс
		|ИЗ
		|	БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|ГДЕ
		|	НЕ ОбучениеСотрудника.ПометкаУдаления
		|	И НЕ ОбучениеСотрудника.Отменен
		|	И ОбучениеСотрудника.Организация = &Организация
		|	И ОбучениеСотрудника.Основание = &Основание
		|	И ОбучениеСотрудника.Сотрудник = &Сотрудник
		|	И ОбучениеСотрудника.Ссылка <> &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("По сотруднику %1 уже запущен бизнес-процесс %2", ЭтотОбъект.Сотрудник, Выборка.БизнесПроцесс), Выборка.БизнесПроцесс,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьГруппуИсполнителей()
	
	Если ЭтотОбъект.Основание.ВидПеречня = Справочники.ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ Тогда
		ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект("ОбучениеПОДФТ"), ЭтотОбъект.Организация);
		
	ИначеЕсли ЭтотОбъект.Основание.ВидПеречня = Справочники.ВидыПеречнейОбъектов.Инсайдеры Тогда
		ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект("ОбучениеИнсайдеров"), ЭтотОбъект.Организация);
		
	Иначе
		ВызватьИсключение "Не удалось вычислить группу исполнителей для вида перечня " + ЭтотОбъект.Основание.ВидПеречня + " для обучения " + ЭтотОбъект.Основание;
		
	КонецЕсли;
	
	Возврат ГруппаИсполнителей;
	
КонецФункции

#КонецОбласти