
Процедура УточнитьТекстЗапросаКУсловиямСделки(ТекстЗапроса, Основание) Экспорт
	
	ТипОснования = ТипЗнч(Основание);
	
	Если      ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СделкаРЕПО", "Сделка");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "УсловияСделокРЕПО", "УсловияСделок");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоВидуЗадолженности", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтавкаРЕПО КАК СтавкаРЕПО,", "");
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоВидуЗадолженности", "И ВидЗадолженности = &ВидЗадолженности");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,", "УсловияСделокСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтавкаРЕПО КАК СтавкаРЕПО,", "УсловияСделокСрезПоследних.СтавкаРЕПО КАК СтавкаРЕПО,");
	КонецЕсли;
	
КонецПроцедуры // УточнитьТекстЗапросаКУсловиямСделки

Функция ПолучитьУсловияСделки(Период, Основание, ВидЗадолженности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	&ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	&СтавкаРЕПО КАК СтавкаРЕПО,
		|	УсловияСделокСрезПоследних.ДатаИсполнения КАК ДатаИсполнения,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокСрезПоследних.ВалютаОплаты КАК ВалютаОплаты,
		|	УсловияСделокСрезПоследних.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	УсловияСделокСрезПоследних.КурсОплаты КАК КурсОплаты,
		|	УсловияСделокСрезПоследних.Количество КАК Количество,
		|	УсловияСделокСрезПоследних.Цена КАК Цена,
		|	УсловияСделокСрезПоследних.ЦенаПроцент КАК ЦенаПроцент,
		|	УсловияСделокСрезПоследних.ЦенаКупона КАК ЦенаКупона,
		|	УсловияСделокСрезПоследних.Сумма КАК Сумма,
		|	УсловияСделокСрезПоследних.СуммаКупона КАК СуммаКупона,
		|	УсловияСделокСрезПоследних.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&Период,
		|			НЕ Отменено
		|				И СделкаРЕПО = &Сделка
		|				И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних";
		
	УточнитьТекстЗапросаКУсловиямСделки(Запрос.Текст, Основание);

	Запрос.УстановитьПараметр("Период",           Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(Основание) = тип("ДокументСсылка.СделкаРЕПО") И Основание.ЧастьСделкиРЕПО = 2, Основание.ПерваяЧастьРЕПО, Основание));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьУсловияСделки
