
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Период") И ЗначениеЗаполнено(Параметры.Период) Тогда
		ЭтаФорма.Период = Параметры.Период;
	Иначе
		ЭтаФорма.Период = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Организация", , ВидСравненияКомпоновкиДанных.Равно, Параметры.Организация, , РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Период",				ЭтаФорма.Период);
	Список.Параметры.УстановитьЗначениеПараметра("ОтбражатьАктуальные", Истина);
	
	Если Параметры.Свойство("ГруппаВидовОпераций") Тогда
		РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Пользователь", , ВидСравненияКомпоновкиДанных.НеРавно, Справочники.Пользователи.ПустаяСсылка(), , РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСкрытьАктуальных(Команда)
	
	Элементы.ФормаКомандаПоказатьСкрытьАктуальных.Пометка = Не Элементы.ФормаКомандаПоказатьСкрытьАктуальных.Пометка;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтбражатьАктуальные",
		Элементы.ФормаКомандаПоказатьСкрытьАктуальных.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	
КонецПроцедуры
