&НаСервере
Функция СфомироватьДокументыСЭД(Организация, СчетаДоверительногоУправления, Период, КаталогФайлов, Подписант) Экспорт
				
	// Подготовим параметры для передачи в обработку выгрузки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегистрацияСтоимостиАктивов.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
	|ГДЕ
	|	РегистрацияСтоимостиАктивов.Организация = &Организация
	|	И РегистрацияСтоимостиАктивов.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
	|	И РегистрацияСтоимостиАктивов.Проведен
	|	И НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ) = &Период";
	
	Запрос.УстановитьПараметр("Период", 					  Период);
	Запрос.УстановитьПараметр("Организация", 				  Организация);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДоверительногоУправления);
	
	МассивДокументов = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекДокумент = Выборка.Регистратор;
		МассивДокументов.Добавить(ТекДокумент);
		
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На выбранную дату отсутствуют документы 'Регистрация стоимости активов'");
		Возврат Ложь;	
	КонецЕсли;
	
	ОбработкаВыгрузки = Обработки.ПечатьИВыгрузка_СЧА_РСА.Создать();  		
	ОбработкаВыгрузки.ДатаИВремяФормирования = ТекущаяДата();
	
	Разрядность = 5;
				
	// сформируем файл данных
	ПолноеИмяФайла = КаталогФайлов + ?(Прав(КаталогФайлов, 1) = "\", "", "\");
	Результат = ОбработкаВыгрузки.ПолучитьТабличныеДокументыРСАНСД(МассивДокументов, Подписант, Разрядность);

	Если Результат.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРезультата Из Результат Цикл		
		
		Попытка
			СтрокаРезультата.ТабличныйДокумент.Записать(ПолноеИмяФайла + СтрокаРезультата.ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"Не удалось записать данные в файл '" + ПолноеИмяФайла + СтрокаРезультата.ИмяФайла + "'!
					|Ошибка:
					|" + ОписаниеОшибки());
			
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;	
		
	Возврат Истина;
						
КонецФункции
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

