
&НаСервере
Процедура ВывестиРеквизитыЮрЛицаНаСервере()
	
	РаботаСНормативноСправочнойИнформацией.ВывестиРеквизитыЮрФизЛица(Объект.ЮрФизЛицо, ЭтаФорма, "РеквизитыКонтрагента");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ВывестиРеквизитыЮрЛицаНаСервере();
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ВидыДеятельностиОрганизации"));
	
КонецПроцедуры


&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНаименованиеФункциональнойРоли(Объект);
	
	ВывестиРеквизитыЮрЛицаНаСервере();
	
КонецПроцедуры
