
#Область Обработчики_событий_формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Каталог) Тогда
		ЗаполнитьСписокОтчетов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация				= Параметры.Организация;
	СчетВнутреннегоУчета	= Параметры.СчетДоверительногоУправления;
	ГруппаОтчетов			= Параметры.ГруппаОтчетов;
	
	ЗаполнитьДанныеПоУмолчанию(Истина, Истина, Истина, Истина, Истина, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СписокПолучателей.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке получателей не выбраны получатели отправления!", ЭтотОбъект, "СписокПолучателей",, Отказ);
	Иначе
		
		Индекс = -1;
		
		Для Каждого Получатель Из СписокПолучателей Цикл
			Индекс = Индекс + 1;
			
			Если НЕ ЗначениеЗаполнено(Получатель.Значение) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							СтрШаблон("В строке №%1 не указан адрес почты получателя", Формат(Индекс + 1, "ЧДЦ=0; ЧГ=0")),
							ЭтотОбъект, "СписокПолучателей",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Отбор = Новый Структура("Отправить", Истина);
	
	Если СписокОтчетов.НайтиСтроки(Отбор).Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке отчетов не выбраны отчеты для отправления!", ЭтотОбъект, "СписокОтчетов",, Отказ);
	Иначе
		
		Индекс = -1;
		
		Для Каждого Отчет Из СписокОтчетов Цикл
			Индекс = Индекс + 1;
			
			Если НЕ Отчет.Отправить Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Отчет.ПолноеИмяФайла) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							СтрШаблон("В строке №%1 не выбран файл отчета", Формат(Индекс + 1, "ЧДЦ=0; ЧГ=0")),
							ЭтотОбъект, "СписокОтчетов[" + Индекс + "].Отчет",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОтчетов", СписокОтчетов.Выгрузить());
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(СписокОтчетов.Отправить КАК БУЛЕВО) КАК Отправить,
		|	ВЫРАЗИТЬ(СписокОтчетов.Отчет КАК СТРОКА(259)) КАК Отчет,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки
		|ПОМЕСТИТЬ _СписокОтчетов
		|ИЗ
		|	&СписокОтчетов КАК СписокОтчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокОтчетов.Отчет КАК Отчет,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ _Дубли
		|ИЗ
		|	_СписокОтчетов КАК _СписокОтчетов
		|
		|СГРУППИРОВАТЬ ПО
		|	_СписокОтчетов.Отчет
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СписокОтчетов.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	_СписокОтчетов КАК _СписокОтчетов
		|ГДЕ
		|	_СписокОтчетов.Отчет В
		|			(ВЫБРАТЬ
		|				_Дубли.Отчет КАК Отчет
		|			ИЗ
		|				_Дубли КАК _Дубли)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							СтрШаблон("В строке №%1 обнаружено дублирование имени файла!", Формат(Выборка.НомерСтроки, "ЧДЦ=0; ЧГ=0")),
							ЭтотОбъект, "СписокОтчетов[" + Число(Выборка.НомерСтроки - 1) + "].Отчет",, Отказ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбора.ПолноеИмяФайла = Каталог;
	
	Если ДиалогВыбора.Выбрать() Тогда
		ВыбранныйКаталог = ДиалогВыбора.Каталог;
		
		Если СписокОтчетов.Количество() > 0
			И Вопрос("Перед загрузкой имен файлов-отчетов из выбранного каталога удалить ранее добавленные отчеты из списка?",
					РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СписокОтчетов.Очистить();
		КонецЕсли;
		
		Каталог = ВыбранныйКаталог;
		
		ЗаполнитьСписокОтчетов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетВнутреннегоУчетаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СчетВнутреннегоУчета) Тогда
		ЗаполнитьДанныеПоУмолчанию(Истина, Ложь, Истина, Ложь, Истина, Ложь);
		
		Если ЗначениеЗаполнено(АдресОтправителя) Тогда
			ЗаполнитьТекстПисьма();
		Иначе
			ТекстПисьма = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	СписокОтчетов.Очистить();
	
	ЗаполнитьСписокОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовОтчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТД = Элементы.СписокОтчетов.ТекущиеДанные;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	
	// Если файл уже есть в строке, по умолчанию открываем каталог с этим файлом.
	Если ЗначениеЗаполнено(ТД.ПолноеИмяФайла) Тогда
		Файл = Новый Файл(ТД.ПолноеИмяФайла);
		ДиалогВыбора.Каталог = Файл.Путь;
	// Иначе открываем выбранный каталог.
	Иначе
		ДиалогВыбора.Каталог = Каталог;
	КонецЕсли;
	
	Если ДиалогВыбора.Выбрать() Тогда
		Файл = Новый Файл(ДиалогВыбора.ВыбранныеФайлы[0]);
		
		ТД.Отправить		= Истина;
		ТД.Отчет			= Файл.Имя;
		ТД.ПолноеИмяФайла	= Файл.ПолноеИмя;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОтправителяПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СчетВнутреннегоУчета)
		И ЗначениеЗаполнено(АдресОтправителя) Тогда
		ЗаполнитьТекстПисьма();
	Иначе
		ТекстПисьма = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовОтчетПриИзменении(Элемент)
	
	ТД = Элементы.СписокОтчетов.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТД.Отчет) Тогда
		ТД.Отправить		= Ложь;
		ТД.ПолноеИмяФайла	= "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.МножественныйВыбор = Ложь;
	ДВФ.Каталог = Каталог;
	
	Если ДВФ.Выбрать() Тогда
		Файл = Новый Файл(ДВФ.ВыбранныеФайлы[0]);
		
		НоваяСтрока = СписокОтчетов.Добавить();
		
		НоваяСтрока.Отправить		= Истина;
		НоваяСтрока.Отчет			= Файл.Имя;
		НоваяСтрока.ПолноеИмяФайла	= Файл.ПолноеИмя;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_команд

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		МассивФайлов = Новый Массив;
		
		Отказ = Ложь;
		
		Индекс = -1;
		
		Для Каждого Отчет Из СписокОтчетов Цикл
			Индекс = Индекс + 1;
			
			Если НЕ Отчет.Отправить Тогда
				Продолжить;
			КонецЕсли;
			
			Файл = Новый Файл(Отчет.ПолноеИмяФайла);
			
			Если Файл.Существует() Тогда
				
				Если НЕ Отказ Тогда
					
					Попытка
						Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя), ЭтаФорма.УникальныйИдентификатор);
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							СтрШаблон("При обработке файла в строке №%1 произошла ошибка:%2", Формат(Индекс + 1, "ЧДЦ=0; ЧГ=0"), Символы.ПС + ОписаниеОшибки()),
							ЭтотОбъект, "СписокОтчетов[" + Индекс + "].Отчет",, Отказ);
						Продолжить;
					КонецПопытки;
					
					МассивФайлов.Добавить(Новый Структура("Отчет, Адрес", Отчет.Отчет, Адрес));
					
				КонецЕсли;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							СтрШаблон("Файл, указанный в строке №%1 не существует!", Формат(Индекс + 1, "ЧДЦ=0; ЧГ=0")),
							ЭтотОбъект, "СписокОтчетов[" + Индекс + "].Отчет",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			
			Попытка
				ОтправитьОтчетыНаСервере(МассивФайлов);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Электронное письмо создано и поставлено в очередь на отправку!");
			
			Если ПереместитьВОтправленные Тогда
				ПереместитьФайлы();
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Электронное письмо не создано!");
		КонецЕсли;
		
		Для Каждого Файл Из МассивФайлов Цикл
			УдалитьИзВременногоХранилища(Файл.Адрес);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовУстановитьВсе(Команда)
	
	УстановитьВсеФлажки(Истина, СписокОтчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовСнятьВсе(Команда)
	
	УстановитьВсеФлажки(Ложь, СписокОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

#Область Клиентские

&НаКлиенте
Процедура ЗаполнитьСписокОтчетов()
	
	Если ЗначениеЗаполнено(Каталог) Тогда
		
		ФайлыВКаталоге = НайтиФайлы(Каталог, "*.*", Ложь);
		
		Для Каждого Файл Из ФайлыВКаталоге Цикл
			Если Файл.ЭтоКаталог() Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = СписокОтчетов.Добавить();
			
			НоваяСтрока.Отправить		= Истина;
			НоваяСтрока.Отчет			= Файл.Имя;
			НоваяСтрока.ПолноеИмяФайла	= Файл.ПолноеИмя;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки(НовоеЗначение, Таблица, ИмяПоляСФлажком = "Отправить")
	
	Для Каждого ТекСтрока Из Таблица Цикл
		Если ТекСтрока[ИмяПоляСФлажком] <> НовоеЗначение Тогда
			ТекСтрока[ИмяПоляСФлажком] = НовоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьФайлы()
	
	Путь = Каталог + ?(Прав(Каталог, 1) = "\", "", "\") + "Отправленные";
	
	КаталогДляОтправленных = Новый Файл(Путь);
	
	Если НЕ КаталогДляОтправленных.Существует() Тогда
		Попытка
			СоздатьКаталог(Путь);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать каталог для отправленных отчетов! Перемещение файлов не будет выполнено.");
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Отбор = Новый Структура("Отправить", Истина);
	
	НайденныеСтроки = СписокОтчетов.НайтиСтроки(Отбор);
	
	Для Каждого ТекФайл Из НайденныеСтроки Цикл
		Попытка
			ПереместитьФайл(ТекФайл.ПолноеИмяФайла, Путь + "\" + ТекФайл.Отчет);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не выполнено перемещение отчета '%1' из-за ошибки: %2", ТекФайл.Отчет, ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Серверные

&НаСервере
Процедура ЗаполнитьАдресОтправителя()
	
	Элементы.АдресОтправителя.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",			ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ГруппаОтчетов",	ГруппаОтчетов);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Настройка.Код = ""АдресОтправителя""
		|				И (Отчет = ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|					ИЛИ Отчет В ИЕРАРХИИ (&ГруппаОтчетов))) КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановленоЗначение = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если НЕ УстановленоЗначение Тогда
			АдресОтправителя = Выборка.Значение;
		КонецЕсли;
		
		Элементы.АдресОтправителя.СписокВыбора.Добавить(Выборка.Значение, Выборка.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТемуПисьма()
	
	Если ЗначениеЗаполнено(СчетВнутреннегоУчета) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("ТекущаяДата",	ТекущаяДата());
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Наименование
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|			&ТекущаяДата,
			|			ЮрФизЛицо В
			|					(ВЫБРАТЬ
			|						Организации.ЮрФизЛицо КАК ЮрФизЛицо
			|					ИЗ
			|						Справочник.Организации КАК Организации
			|					ГДЕ
			|						Организации.Ссылка = &Организация)
			|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			НаименованиеОрганизации = Выборка.Наименование;
		Иначе
			НаименованиеОрганизации = "";
		КонецЕсли;
		
		ТемаПисьма = СчетВнутреннегоУчета.Наименование + " Договор " + СчетВнутреннегоУчета.НомерДоговора + " Отчетность " + НаименованиеОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКаталог()
	
	Путь = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьЗначениеНастройки(ТекущаяДата(), СчетВнутреннегоУчета, ГруппаОтчетов, "ПутьКФайлу");
	
	Путь = Лев(Путь, СтрНайти(Путь, "\", НаправлениеПоиска.СКонца));
	
	СтрокаНастроек = Новый Структура;
	
	СтрокаНастроек.Вставить("Субъект",						СчетВнутреннегоУчета);
	СтрокаНастроек.Вставить("Отчет",						ГруппаОтчетов);
	СтрокаНастроек.Вставить("Периодичность",				Перечисления.ПериодичностьПредоставленияОтчетности.Ежемесячно);
	СтрокаНастроек.Вставить("ДатаНачала",					ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1));
	СтрокаНастроек.Вставить("ДатаОкончания",				ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1));
	
	Каталог = РегистрыСведений.СоставИНастройкиОтчетов.ОбработатьПутьКФайлу(Путь, СтрокаНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПисьма()
	
	Если ЗначениеЗаполнено(СчетВнутреннегоУчета)
		И ЗначениеЗаполнено(АдресОтправителя) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ТекущаяДата", 	ТекущаяДата());
		Запрос.УстановитьПараметр("Организация",	Организация);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|			&ТекущаяДата,
			|			Организация = &Организация
			|				И ЮрФизЛицо = ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ЮрФизЛицо
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			НомерТелефона = " " + Выборка.Телефоны;
		Иначе
			НомерТелефона = "";
		КонецЕсли;
		
		МассивАдресов = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресОтправителя);
		
		Если МассивАдресов.Количество() <> 1 Тогда
			ВызватьИсключение СтрШаблон("Некорректный адрес отправителя: ""%1""", АдресОтправителя);
		Иначе
			СтруктураАдреса = МассивАдресов[0];
		КонецЕсли; 
		
		АдресОтвета = СтруктураАдреса.Адрес;
		
		HTML = "<HTML><HEAD>
				|<BODY>
				|<P>Добрый день.</P>
				|<BR>
				|<P>Направляем Вам отчетность по договору ДУ №" + СчетВнутреннегоУчета.НомерДоговора + " от " + Формат(СчетВнутреннегоУчета.ДатаЗаключения, "ДФ=dd.MM.yyyy") + "</P>
				|<BR>
				|<P>Для получения информации по возникшим вопросам Вам необходимо связаться с сотрудниками Управляющей компании по телефону" + НомерТелефона + " или отправить сообщение по адресу <a href=""mailto:" + АдресОтвета + """>" + АдресОтвета + "</a></P>
				|</BODY></HTML>";
		
		ТекстПисьма.УстановитьHTML(HTML, Новый Структура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПолучателей()
	
	СписокПолучателей.Очистить();
	
	СписокАдресов = ПолучитьСписокАдресовЭлектроннойПочтыКлиентов(Организация, СчетВнутреннегоУчета, ГруппаОтчетов);
	
	Для Каждого Адрес Из СписокАдресов Цикл
		НоваяСтрока = СписокПолучателей.Добавить(Адрес, Адрес);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетыНаСервере(МассивФайлов)
	
	// Получаем значение настройки "Адрес отправителя" для группы отчетов "Бухгалтерия УК".
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущаяДата",	ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&ТекущаяДата,
		|			Организация = &Организация
		|				И Настройка.Код = ""АдресОтправителя""
		|				И Отчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Отчеты.Бухгалтерия))) КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное)";
	
	АдресДляБухгалтерии = "";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		МассивАдресов = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Выборка.Значение);
		
		Если МассивАдресов.Количество() = 1 Тогда
			СтруктураАдреса = МассивАдресов[0];
			
			Если ЗначениеЗаполнено(СтруктураАдреса.Адрес) Тогда
				АдресДляБухгалтерии = СтруктураАдреса.Адрес;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Получаем адрес отправителя.
	МассивАдресов = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресОтправителя);
	
	Если МассивАдресов.Количество() <> 1 Тогда
		ВызватьИсключение СтрШаблон("Некорректный адрес отправителя: ""%1""", АдресОтправителя);
	Иначе
		СтруктураАдреса = МассивАдресов[0];
	КонецЕсли; 
	
	ПараметрыПисьма = Новый Структура;
	
	ПараметрыПисьма.Вставить("Файлы", Новый Массив);
	
	Для Каждого Отчет Из МассивФайлов Цикл
		
		Файл = Новый Структура;
		
		Файл.Вставить("ДанныеФайла",	ПолучитьИзВременногоХранилища(Отчет.Адрес));
		Файл.Вставить("Имя",			Отчет.Отчет);
		
		ПараметрыПисьма.Файлы.Добавить(Файл);
		
	КонецЦикла;
	
	ПараметрыПисьма.Вставить("Организация", 				Организация);
	ПараметрыПисьма.Вставить("Тема",						ТемаПисьма);
	ПараметрыПисьма.Вставить("Текст",						ТекстПисьма);
	ПараметрыПисьма.Вставить("ТипТекста",					Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	ПараметрыПисьма.Вставить("ОбратныйАдрес",				СтруктураАдреса.Адрес);
	ПараметрыПисьма.Вставить("АдресОтправителя",			СтруктураАдреса.Адрес);
	ПараметрыПисьма.Вставить("ПредставлениеОтправителя",	СтруктураАдреса.Представление);
	ПараметрыПисьма.Вставить("Получатели",					Новый Массив);
	
	Для Каждого Получатель Из СписокПолучателей Цикл
		
		НовыйПолучатель = Новый Структура;
		
		НовыйПолучатель.Вставить("Адрес",			Получатель.Значение);
		НовыйПолучатель.Вставить("Представление",	"");
		
		ПараметрыПисьма.Получатели.Добавить(НовыйПолучатель);
		
	КонецЦикла;
	
	ПараметрыПисьма.Вставить("ПолучателиСлепыхКопий", Новый Массив);
	
	НовыйПолучатель = Новый Структура;
	
	НовыйПолучатель.Вставить("Адрес",			СтруктураАдреса.Адрес);
	НовыйПолучатель.Вставить("Представление",	СтруктураАдреса.Представление);
	
	ПараметрыПисьма.ПолучателиСлепыхКопий.Добавить(НовыйПолучатель);
	
	Попытка
		РаботаСПакетамиДанныхКОбработке.СоздатьПакетДанных(Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо, ПараметрыПисьма);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось сформировать электронное письмо из-за ошибки:%1", Символы.ПС + ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоУмолчанию(ЗаполнитьКаталог, ЗаполнитьАдресОтправителя, ЗаполнитьТемуПисьма, ЗаполнитьТекстПисьма, ЗаполнитьСписокПолучателей, ЗаполнитьПереместитьВОтправленные)
	
	Если ЗаполнитьАдресОтправителя Тогда
		ЗаполнитьАдресОтправителя();
	КонецЕсли;
	
	Если ЗаполнитьТемуПисьма Тогда
		ЗаполнитьТемуПисьма();
	КонецЕсли;
	
	Если ЗаполнитьКаталог Тогда
		ЗаполнитьКаталог();
	КонецЕсли;
	
	Если ЗаполнитьТекстПисьма Тогда
		ЗаполнитьТекстПисьма();
	КонецЕсли;
	
	Если ЗаполнитьСписокПолучателей Тогда
		ЗаполнитьСписокПолучателей();
	КонецЕсли;
	
	Если ЗаполнитьПереместитьВОтправленные Тогда
		ПереместитьВОтправленные = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокАдресовЭлектроннойПочтыКлиентов(Организация, Договор, ГруппаОтчетов)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",			ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Договор",		Договор);
	Запрос.УстановитьПараметр("ГруппаОтчетов",	ГруппаОтчетов);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Ссылка КАК Договор
		|ПОМЕСТИТЬ _ПринадлежностьККлиентам
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент В
		|			(ВЫБРАТЬ
		|				КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|			ИЗ
		|				РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация
		|					И СчетДоверительногоУправления = &Договор) КАК КлиентыДоверительногоУправленияСрезПоследних)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Отчет В ИЕРАРХИИ (&ГруппаОтчетов)
		|				И Настройка.Код = ""АдресЭлектроннойПочты""
		|				И (Субъект, ВидДоговора) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ПринадлежностьККлиентам.Клиент КАК Субъект,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговора
		|					ИЗ
		|						_ПринадлежностьККлиентам КАК _ПринадлежностьККлиентам
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ПринадлежностьККлиентам.Клиент,
		|						_ПринадлежностьККлиентам.ВидДоговора
		|					ИЗ
		|						_ПринадлежностьККлиентам КАК _ПринадлежностьККлиентам
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ПринадлежностьККлиентам.Договор,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|					ИЗ
		|						_ПринадлежностьККлиентам КАК _ПринадлежностьККлиентам)) КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Получатели = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Значение, ";", Истина, Истина);
		
		Для Каждого Получатель Из Получатели Цикл
			Если СтрНайти(Получатель, ",") > 0 Тогда
				РаботаСКоллекциями.ДополнитьМассив(Результат, РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Получатель, ",", Истина, Истина));
			Иначе
				Результат.Добавить(Получатель);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти