&НаКлиенте
Перем КонтекстДокументаHTML;

&НаКлиенте
Перем КонтекстОкнаHTML;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Ссылка = Параметры.Ссылка;
	
	ИнициализироватьHTML();	
	
	ДанныеДляСравнения = ДокументыДляСравнения(Параметры.Ссылка);
	ТекущийКвартал = ПредставлениеПериода(НачалоКвартала(ДанныеДляСравнения.Текущий.Дата), 
		КонецКвартала(ДанныеДляСравнения.Текущий.Дата), "ДФ=к 'квартал' гггг 'г.'");
	ПредыдущийКвартал = ПредставлениеПериода(НачалоКвартала(ДобавитьМесяц(ДанныеДляСравнения.Текущий.Дата, -3)), 
		КонецКвартала(ДобавитьМесяц(ДанныеДляСравнения.Текущий.Дата, -3)), "ДФ=к 'квартал' гггг 'г.'");
	ТекстЗаголовка = СтрШаблон("Анализ изменений данных отчета за %1 по отношению к данным за %2", 
		ТекущийКвартал, ПредыдущийКвартал);	
		
	ЭтаФорма.Элементы.ДекорацияЗаголовок.Заголовок = ТекстЗаголовка;	
		
	Если Не ЗначениеЗаполнено(ДанныеДляСравнения.Предыдущий.Ссылка) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось найти документ предыдущего периода - %1", ПредыдущийКвартал), , , , Отказ);
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьHTML()

	HTML = Документы.ПоказателиОперационнойНадежности.ПолучитьМакет("script").ПолучитьТекст();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументыДляСравнения(ДокументТекущегоПериода)
	
	Возврат Документы.ПоказателиОперационнойНадежности.ДокументыДляСравнения(ДокументТекущегоПериода);
	
КонецФункции

&НаСервереБезКонтекста
Функция СравнениеДанных(ДанныеДляСравнения)
	
 	Возврат Документы.ПоказателиОперационнойНадежности.СравненииеДанных(ДанныеДляСравнения);
	
КонецФункции	

&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	
	Если НЕ HTMLЭлементыИнициализированы Тогда 
		
		HTMLЭлементыИнициализированы = Истина;
		
		КонтекстДокументаHTML = Элемент.Документ;
		КонтекстОкнаHTML 	  = КонтекстДокументаHTML.parentWindow;
		Если КонтекстОкнаHTML = Неопределено Тогда
			
			КонтекстОкнаHTML = КонтекстДокументаHTML.defaultView;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ФормированиеОтчетаОбработчик", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеОтчетаОбработчик() Экспорт
	
	Если Не HTMLЭлементыИнициализированы Тогда

		ПодключитьОбработчикОжидания("ФормированиеОтчетаОбработчик", 0.1, Истина);
		Возврат;
		
	КонецЕсли;
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ОписаниеТаблиц = СравнениеДанных(ДанныеДляСравнения);
	ДобавитьДетализациюСравненияДанных(ОписаниеТаблиц);
	СформироватьОтчетОСравненииДанныхНаСервере(ОписаниеТаблиц);
	
	ВремяФормирования = ДлительностьВЧасахМинутахСекундах(ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала);
	
КонецПроцедуры	

&НаСервере
Процедура СформироватьОтчетОСравненииДанныхНаСервере(ОписаниеТаблиц)
	
	ТабДок = Новый ТабличныйДокумент;

	Макет = Документы.ПоказателиОперационнойНадежности.ПолучитьМакет("РезультатСравнения");	
	ОбластьЛегенда     = Макет.ПолучитьОбласть("Легенда");
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабДок.Вывести(ОбластьЛегенда);
	ТабДок.Вывести(ОбластьРазделитель);	
	
	Для Каждого ОписаниеТаблицы Из ОписаниеТаблиц Цикл
		
		ОбластьТаблица = Макет.ПолучитьОбласть("ИмяТаблицы");
		ОбластьТаблица.Параметры.Заполнить(ОписаниеТаблицы);
		ТабДок.Вывести(ОбластьТаблица);	
		
		ВывестиДанныеТаблицыРасхождений(ОписаниеТаблицы, ТабДок, Макет);
		ТабДок.Вывести(ОбластьРазделитель);	
		
	КонецЦикла;	 
	Для Ном = 1 По 31 - ТабДок.ВысотаТаблицы Цикл
		
		ТабДок.Вывести(ОбластьРазделитель);
		
	КонецЦикла;
	Если ВРег(Метаданные.РежимСовместимости) < "ВЕРСИЯ8_3_24" Тогда
		
		Результат = ОбработанныйТабличныйДокумент(ТабДок);
		
	Иначе
		
		Результат = ТабДок;
		
	КонецЕсли;	
    Элементы.Обновить.Видимость = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработанныйТабличныйДокумент(Знач ТабДок)
	
	Поток1 = Новый ПотокВПамяти;
	Поток2 = Новый ПотокВПамяти;
	ТабДок.Записать(Поток1, ТипФайлаТабличногоДокумента.MXL);
	Поток1.Перейти(0, ПозицияВПотоке.Начало);

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(Поток1, КодировкаТекста.UTF8);
	СодержимоеMXL = ТекстовыйДокумент.ПолучитьТекст();

	НомераСтрокДляОбработки = Новый Массив;
	Для НомерСтроки = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
		
		СтрокаMXL = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
		Если СтрНайти(СтрокаMXL, "##>") > 0 Тогда
	
	    	НомераСтрокДляОбработки.Добавить(НомерСтроки);
	
		КонецЕсли;
		
	КонецЦикла;	
	Смещение = 0;
	Для Каждого НомерСтроки Из НомераСтрокДляОбработки Цикл
		
		ОбработатьДокумент(НомерСтроки + Смещение, ТекстовыйДокумент);
		Смещение = Смещение + 5;
		
	КонецЦикла;	
	СодержимоеMXL = ТекстовыйДокумент.ПолучитьТекст();
	// Двоичные данные используются для записи в кодировке UTF-8 без BOM
	//ДвоичныеДанныеИзСтроки = ПолучитьДвоичныеДанныеИзСтроки(СодержимоеMXL, КодировкаТекста.UTF8, Ложь);
	//ДвоичныеДанныеИзСтроки.Записать(Поток2);
	
	ТекстовыйДокумент.Записать(Поток2, КодировкаТекста.UTF8, , Ложь);
	Поток2.Перейти(0, ПозицияВПотоке.Начало);
	ТабДок.Прочитать(Поток2, , ТипФайлаТабличногоДокумента.MXL);
	
	Возврат ТабДок;
	
КонецФункции

// Из-за включенного режима совместивмости программная работа с форматированной строкой в табличном документе не работает
// Создадим форматирование на уровне MXL
&НаСервереБезКонтекста
Процедура ОбработатьДокумент(НомерСтроки, ТекстовыйДокумент)

    ТекущаяСтрока   = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
 	СледующаяСтрока = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки + 1);
	Если СтрНайти(ТекущаяСтрока, "##>") > 0 И СтрНайти(ТекущаяСтрока, "<##") > 0 Тогда
		
		СтрокаБезФормата = СтрЗаменить(ТекущаяСтрока,    "<##", "");
		СтрокаБезФормата = СтрЗаменить(СтрокаБезФормата, "##>", "");
		СтрокаСФорматом  = СтрЗаменить(ТекущаяСтрока,    "<##", "<bgcolorstyle -47>");
		СтрокаСФорматом  = СтрЗаменить(СтрокаСФорматом,  "##>", "</>");
		
		ТекстовыйДокумент.ЗаменитьСтроку(НомерСтроки, СтрокаБезФормата);
		
		НачалоСледующейСтроки    = Лев(СледующаяСтрока, 2);
		ОкончаниеСледующейСтроки = Сред(СледующаяСтрока, 4);
		
	    ТекстовыйДокумент.ЗаменитьСтроку(НомерСтроки + 1, НачалоСледующейСтроки + "1,");
		ТекстовыйДокумент.ВставитьСтроку(НомерСтроки + 2, "{1,");
		ТекстовыйДокумент.ВставитьСтроку(НомерСтроки + 3, "{1,1,");
		ТекстовыйДокумент.ВставитьСтроку(НомерСтроки + 4, СтрокаСФорматом);
		ТекстовыйДокумент.ВставитьСтроку(НомерСтроки + 5, "},1}");
		ТекстовыйДокумент.ВставитьСтроку(НомерСтроки + 6, ОкончаниеСледующейСтроки);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДанныеТаблицыРасхождений(ОписаниеТаблицы, ТабДок, Макет)

	ТабДокТаблица = Новый ТабличныйДокумент;

	ВывестиШапкуТаблицы(ОписаниеТаблицы, ТабДокТаблица, Макет);
	КэшШирокихКолонок = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ОписаниеТаблицы.СтрокиТаблицы Цикл
		
		ВывестиСтрокуТаблицы(СтрокаТаблицы, ОписаниеТаблицы, ТабДокТаблица, Макет, КэшШирокихКолонок);
		
	КонецЦикла;
	ТабДокТаблица.Область(1, 1, ТабДокТаблица.ВысотаТаблицы, ТабДокТаблица.ШиринаТаблицы).СоздатьФорматСтрок();
	ТабДок.Вывести(ТабДокТаблица);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиШапкуТаблицы(ОписаниеТаблицы, ТабДок, Макет)

	Для Ном = 0 По ОписаниеТаблицы.Оси.ВГраница() Цикл
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Измерение");
		ОбластьШапка.Параметры.Представление = ПредставлениеИмени(СтрЗаменить(ОписаниеТаблицы.Оси[Ном], "_Ось", ""));
		Если Ном = 0 Тогда
			
			ТабДок.Вывести(ОбластьШапка);
			
		Иначе
			
			ТабДок.Присоединить(ОбластьШапка);
			
		КонецЕсли;	
		
	КонецЦикла;
	Для Ном = 0 По ОписаниеТаблицы.Ресурсы.ВГраница() Цикл
		
		Если ВРег(ОписаниеТаблицы.Ресурсы[Ном]) = ВРег("ТехническаяКолонка") Тогда
			
			Продолжить;
			
		КонецЕсли;	
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Ресурс");
		ОбластьШапка.Параметры.Представление = ПредставлениеИмени(ОписаниеТаблицы.Ресурсы[Ном]);
		ТабДок.Присоединить(ОбластьШапка);
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПредставлениеИмени(Знач Имя)
                                
	Возврат Документы.ПоказателиОперационнойНадежности.ПредставлениеИмени(Имя);
	
КонецФункции	

&НаСервереБезКонтекста
Процедура ВывестиСтрокуТаблицы(СтрокаТаблицы, ОписаниеТаблицы, ТабДок, Макет, КэшШирокихКолонок)
	
	Если ОписаниеТаблицы.ИмяТаблицы = "_Операторы_Связи" Тогда
		
		КонтрольДлины = 50;
		
	Иначе
		
		КонтрольДлины = 100;
		
	КонецЕсли;	
	
	Для Ном = 0 По ОписаниеТаблицы.Оси.ВГраница() Цикл
		
		ОбластьИзмерение = Макет.ПолучитьОбласть(СтрШаблон("Строка_%1|Измерение", СтрокаТаблицы.Статус));
		ОбластьИзмерение.Параметры.Значение = СтрокаТаблицы[ОписаниеТаблицы.Оси[Ном]];
		Если Ном = 0 Тогда
			
			ТабДок.Вывести(ОбластьИзмерение);
			
		Иначе
			
			ТабДок.Присоединить(ОбластьИзмерение);
			
		КонецЕсли;	
		
	КонецЦикла;
	Для Ном = 0 По ОписаниеТаблицы.Ресурсы.ВГраница() Цикл
		
		Если ВРег(ОписаниеТаблицы.Ресурсы[Ном]) = ВРег("ТехническаяКолонка") Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		ЧастьРесурс = КэшШирокихКолонок.Получить(ОписаниеТаблицы.Ресурсы[Ном]);
		Если ЧастьРесурс = Неопределено Тогда

			ЧастьРесурс = ?(СтрДлина(СтрокаТаблицы[ОписаниеТаблицы.Ресурсы[Ном]]) > КонтрольДлины 
				Или СтрДлина(СтрокаТаблицы["_" + ОписаниеТаблицы.Ресурсы[Ном]]) > КонтрольДлины, 
				"РесурсДлинныйТекст", "Ресурс");
				
			Если ЧастьРесурс = "РесурсДлинныйТекст"	 Тогда
				
				КэшШирокихКолонок.Вставить(ОписаниеТаблицы.Ресурсы[Ном], "РесурсДлинныйТекст");
				
			КонецЕсли;
			
		КонецЕсли;	
			
		ДополнительнаяЧасть = ?(СтрокаТаблицы.Статус <> 3, "", 
			?(СтрокаТаблицы[ОписаниеТаблицы.Ресурсы[Ном]] = СтрокаТаблицы["_" + ОписаниеТаблицы.Ресурсы[Ном]],
			"", "_Различные"));
		ИмяОбласти = СтрШаблон("Строка_%1%2|%3", СтрокаТаблицы.Статус, ДополнительнаяЧасть, ЧастьРесурс);
		
		ОбластьРесурс = Макет.ПолучитьОбласть(ИмяОбласти);
		Если СтрокаТаблицы.Статус = 1 Тогда
			
			ОбластьРесурс.Параметры._Значение = СтрокаТаблицы["_" + ОписаниеТаблицы.Ресурсы[Ном]];
			
		ИначеЕсли СтрокаТаблицы.Статус = 2 Тогда 	
			
			ОбластьРесурс.Параметры.Значение = СтрокаТаблицы[ОписаниеТаблицы.Ресурсы[Ном]];
			
		Иначе	
			
			Детализация = Неопределено;
			Если СтрокаТаблицы.Свойство(ОписаниеТаблицы.Ресурсы[Ном] + "_Детализация", Детализация) Тогда
				
				ВывестиДетальноеСравнение(ОбластьРесурс, ЧастьРесурс, Детализация);
				
			Иначе	
				
				Если ЗначениеЗаполнено(ДополнительнаяЧасть) Тогда
					
					ОбластьРесурс.Область(?(ЧастьРесурс = "РесурсДлинныйТекст", "ЗначениеДл",  "Значение")).Текст  = 
						СтрокаТаблицы[ОписаниеТаблицы.Ресурсы[Ном]];
					ОбластьРесурс.Область(?(ЧастьРесурс = "РесурсДлинныйТекст", "_ЗначениеДл", "_Значение")).Текст = 
						СтрокаТаблицы["_" + ОписаниеТаблицы.Ресурсы[Ном]];
						
				Иначе
					
					ОбластьРесурс.Параметры.Значение  = СтрокаТаблицы[ОписаниеТаблицы.Ресурсы[Ном]];	
					ОбластьРесурс.Параметры._Значение = СтрокаТаблицы["_" + ОписаниеТаблицы.Ресурсы[Ном]];
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;	
		ТабДок.Присоединить(ОбластьРесурс);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДетальноеСравнение(ОбластьРесурс, ЧастьРесурс, Детализация)

	ФорматированныйТекст = Новый Структура;
	ФорматированныйТекст.Вставить("Значение",  ФорматированнаяСтрокаДетализации(Детализация, 1));
	ФорматированныйТекст.Вставить("_Значение", ФорматированнаяСтрокаДетализации(Детализация, 2));
	
	ОбластьРесурс.Область(?(ЧастьРесурс = "РесурсДлинныйТекст", "ЗначениеДл",  "Значение")).Текст  = ФорматированныйТекст.Значение;
	ОбластьРесурс.Область(?(ЧастьРесурс = "РесурсДлинныйТекст", "_ЗначениеДл", "_Значение")).Текст = ФорматированныйТекст._Значение;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ФорматированнаяСтрокаДетализации(Детализация, ЧастьДанных)
	
	Шаблон   = ?(ВРег(Метаданные.РежимСовместимости) < "ВЕРСИЯ8_3_24", "<##%1##>", "%1");
	ЦветФона = Новый Цвет(219, 255, 204);
	
	ИнформацияОСравнении    = Детализация.ИнформацияОСравнении;
	ОбщаяПоследовательность = ИнформацияОСравнении.lcsString;
	Фрагменты               = ИнформацияОСравнении["fragments" + ЧастьДанных];
	Суффикс                 = ИнформацияОСравнении["suff" + ЧастьДанных];
	
	Старт = 1;
	ЧастиСтроки = Новый Массив;
	Если ЗначениеЗаполнено(Детализация.ОбщееНачало) Тогда
		
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Детализация.ОбщееНачало));	
	
	КонецЕсли;
	Для Каждого Фрагмент Из Фрагменты Цикл
		
		Если Фрагмент[0] + 1 > Старт Тогда
		
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Сред(ОбщаяПоследовательность, Старт, Фрагмент[0] + 1 - Старт)));
			
		КонецЕсли;	
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(Шаблон, Фрагмент[1]), , , ЦветФона));
		Старт = Фрагмент[0] + 1;
		
	КонецЦикла;	
	Если Старт <= СтрДлина(ОбщаяПоследовательность) Тогда

		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Сред(ОбщаяПоследовательность, Старт, СтрДлина(ОбщаяПоследовательность))));
		
	КонецЕсли;	
	Если СтрДлина(Суффикс) > 0 Тогда
		
		Если ПустаяСтрока(Суффикс) Тогда
			
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(Шаблон, СтрЗаменить(Суффикс, " ", Символы.НПП)), , , ЦветФона));
			
		Иначе	
			
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(Шаблон, Суффикс), , , ЦветФона));
			
		КонецЕсли;	
		
	КонецЕсли;	
	Если ЗначениеЗаполнено(Детализация.ОбщееОкончание) Тогда
		
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Детализация.ОбщееОкончание));	
	
	КонецЕсли;
    Возврат Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьДетализациюСравненияДанных(ОписаниеТаблиц)
	
	Для Каждого ОписаниеТаблицы Из ОписаниеТаблиц Цикл
		
		Если Не ОписаниеТаблицы.Свойство("СтрокиТаблицы") Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		Для Каждого СтрокаТаблицы Из ОписаниеТаблицы.СтрокиТаблицы Цикл
			
			Если СтрокаТаблицы.Статус = 3 Тогда
				
				Для Каждого Ресурс Из ОписаниеТаблицы.Ресурсы Цикл
					
					Если СтрокаТаблицы[Ресурс] <> СтрокаТаблицы["_" + Ресурс] И СтрДлина(СтрокаТаблицы[Ресурс]) < 1000 И СтрДлина(СтрокаТаблицы["_" + Ресурс]) < 1000 Тогда
						
						ДобавитьДетализацию(СтрокаТаблицы, Ресурс);
						
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОбщаяЧастьСтроки(Строка1, Строка2, ПроверятьСНачала)
	
	Ном = 1;
	ОбщаяЧасть = "";
	Пока Ном <= СтрДлина(Строка1) Цикл
		
		Если ПроверятьСНачала И Лев(Строка1, Ном) = Лев(Строка2, Ном) Или Не ПроверятьСНачала И Прав(Строка1, Ном) = Прав(Строка2, Ном) Тогда
			
			ОбщаяЧасть = ?(ПроверятьСНачала, Лев(Строка1, Ном), Прав(Строка1, Ном));
			Ном = Ном + 1;
			
		Иначе
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	
	Возврат ОбщаяЧасть;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьДетализацию(СтрокаТаблицы, Ресурс)

	Строка1 = СтрокаТаблицы[Ресурс];
	Строка2 = СтрокаТаблицы["_" + Ресурс];
	
	// Предварительная обработка для ускорения - удаление общего начала и окончания строк
	ОбщееНачало    = ОбщаяЧастьСтроки(Строка1, Строка2, Истина);
	Строка1 = Сред(Строка1, СтрДлина(ОбщееНачало) + 1);
	Строка2 = Сред(Строка2, СтрДлина(ОбщееНачало) + 1);
	ОбщееОкончание = ОбщаяЧастьСтроки(Строка1, Строка2, Ложь);
	Строка1 = Лев(Строка1, СтрДлина(Строка1) - СтрДлина(ОбщееОкончание));
	Строка2 = Лев(Строка2, СтрДлина(Строка2) - СтрДлина(ОбщееОкончание));
	
	РезJSON = КонтекстОкнаHTML.findLineDifferences(Строка1, Строка2);
	
	НовыйЧтениеJSON = Новый ЧтениеJSON;
	НовыйЧтениеJSON.УстановитьСтроку(РезJSON);
	Рез = ПрочитатьJSON(НовыйЧтениеJSON);
	
	СтрокаТаблицы.Вставить(Ресурс + "_Детализация", Новый Структура("ИнформацияОСравнении, ОбщееНачало, ОбщееОкончание", Рез, ОбщееНачало, ОбщееОкончание));
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ДлительностьВЧасахМинутахСекундах(ДлительностьМСек)
	
	Часы     = Цел(ДлительностьМСек / 3600000);
	Минуты   = Цел(ДлительностьМСек % 3600000 / 60000);
	Секунды  = Цел(ДлительностьМСек % 60000 / 1000);
	МСекунды = ДлительностьМСек % 1000;
	
	Если Часы > 23 Тогда
		Возврат "Время превысило 24 часа!";
	КонецЕсли;	
	
	Возврат СтрШаблон("%1:%2:%3:%4", Формат(Часы, "ЧЦ=2; ЧН=; ЧВН="), Формат(Минуты, "ЧЦ=2; ЧН=; ЧВН="), Формат(Секунды, "ЧЦ=2; ЧН=; ЧВН="), Формат(МСекунды, "ЧЦ=3; ЧН=; ЧВН="));
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ДанныеДляСравнения = ДокументыДляСравнения(ЭтаФорма.Ссылка);
	ОписаниеТаблиц     = СравнениеДанных(ДанныеДляСравнения);

	ДобавитьДетализациюСравненияДанных(ОписаниеТаблиц);
	СформироватьОтчетОСравненииДанныхНаСервере(ОписаниеТаблиц);
	
	ВремяФормирования = ДлительностьВЧасахМинутахСекундах(ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала);
	
КонецПроцедуры
	

