
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	НастроитьВидимостьИДоступность(ЭтотОбъект);
		
	ПроверитьКорректностьИНН(ЭтотОбъект);
	ПроверитьКорректностьОГРН(ЭтотОбъект);
	
	КоличествоПодчиненных = Элементы.ГруппаУчастники.ПодчиненныеЭлементы.Количество();
	Для Сч = 1 По КоличествоПодчиненных Цикл
		Элементы.Удалить(Элементы.ГруппаУчастники.ПодчиненныеЭлементы[КоличествоПодчиненных - Сч]);	
	КонецЦикла; 
		
	Для каждого СтрокаУчастник из Объект.ПредставителиВыгодоприобретатели Цикл
		РазместитьУчастникаНаСервере(СтрокаУчастник.НомерСтроки - 1);
		УстановитьВидимостьРеквизитовУчастников(Элементы, СтрокаУчастник.ВидУчастника, Формат(СтрокаУчастник.НомерСтроки - 1, "ЧН=0; ЧГ="));	
	КонецЦикла;
	
	КоличествоПодчиненных = Элементы.ГруппаБанковскиеСчета.ПодчиненныеЭлементы.Количество();
	Для Сч = 1 По КоличествоПодчиненных Цикл
		Элементы.Удалить(Элементы.ГруппаБанковскиеСчета.ПодчиненныеЭлементы[КоличествоПодчиненных - Сч]);	
	КонецЦикла; 

	Для каждого СтрокаУчастник из Объект.БанковскиеРеквизиты Цикл
		РазместитьБанковскийСчетНаСервере(СтрокаУчастник.НомерСтроки - 1);
	КонецЦикла;
	
	ТекущееПолноеНаименование = Объект.ПолноеНаименованиеПоУставу;
	
	ЭтаФорма.ЮрФизЛицаОрганизации.ЗагрузитьЗначения(РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаОрганизации(Объект.Организация));
	ЗаполнитьФИОБенефициарногоВладельца();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОбоснованиеУровняРиска = ПолучитьСтандартноеОбоснованиеУровняРиска(Объект.ВысокийУровеньРиска);
	КонецЕсли;
	
	ЗаполнитьФИОБенефициарногоВладельцаУстановленногоКомпанией();
	НастроитьОтображениеБенефициарногоВладельцаУстановленногоКомпанией(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПриЗакрытииОкнаРазличий" Тогда
		ПроверитьКорректностьИНН(ЭтотОбъект, Истина);
		
		Если ЭтаФорма.ИННКорректен И НЕ Объект.РезидентРФ Тогда
			Объект.КИО = Сред(Объект.ИНН, 5, 5); 
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическийАдресОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ЮридическийАдресФИАС = "";

КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ФактическийАдресФИАС = "";

КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйАдресОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ПочтовыйАдресФИАС = "";

КонецПроцедуры

#КонецОбласти

#Область НастройкаФормы

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	УстановитьВидимостьОпросников(Форма);
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.КИО.Видимость = НЕ Объект.РезидентРФ;
	Элементы.КодПоОКАТО.Видимость = Объект.РезидентРФ;
	
	ЭтоИП = (Объект.ОрганизационноПравоваяФорма = ПредопределенноеЗначение("Справочник.ОрганизационноПравовыеФормы.ИндивидуальноеЧастноеПредприятие"));
	Элементы.КПП.Видимость 						= Не ЭтоИП;
	Элементы.КПП2.Видимость 					= Не ЭтоИП;
	Элементы.ДекорацияКППКрупнейшего.Видимость 	= Не ЭтоИП;
	
	БенефициарныйВладелецУстановлен = (Объект.БенефициарныйВладелец 
		= ПредопределенноеЗначение("Перечисление.ВариантыСведенийОБенефициарныхВладельцах.Установлен"));
	Элементы.БенефициарныйВладелецФИО.Видимость = БенефициарныйВладелецУстановлен;
	Элементы.БенефициарныйВладелецКомментарий.Видимость = Не БенефициарныйВладелецУстановлен;
	Элементы.СпособСозданияМеждународнойКомпании.Видимость = Объект.МеждународнаяКомпания;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьОпросников(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.НаличиеСчетаВГосударствахНеВыполняющихРекомендацииФАТФОписание.Видимость = Объект.НаличиеСчетаВГосударствахНеВыполняющихРекомендацииФАТФ;
	Элементы.ЦельДругоеОписание.Видимость = Объект.ЦельДругое;
	Элементы.ЦелиДеятельностиОписание.Видимость = Объект.ЦелиДеятельности = "Другое";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитовУчастников(Элементы, ВидУчастника, НомерУчастникаСтрока)
	
	Если ВидУчастника = ПредопределенноеЗначение("Перечисление.ВидыУчастниковАнкет.Представитель") Тогда
		ВидимостьРеквизитов = Истина;
		ВидимостьКомментария = Ложь;
	ИначеЕсли ВидУчастника = ПредопределенноеЗначение("Перечисление.ВидыУчастниковАнкет.Выгодоприобретатель") Тогда
		ВидимостьРеквизитов = Ложь;
		ВидимостьКомментария = Истина;
	ИначеЕсли ВидУчастника = ПредопределенноеЗначение("Перечисление.ВидыУчастниковАнкет.БенефициарныйВладелец") Тогда
		ВидимостьРеквизитов = Ложь;
		ВидимостьКомментария = Истина;
	Иначе
		ВидимостьРеквизитов = Ложь;
		ВидимостьКомментария = Ложь;
	КонецЕсли;
		
	Элементы["Должность" + НомерУчастникаСтрока].Видимость = ВидимостьРеквизитов;
	Элементы["ОснованиеПолномочий" + НомерУчастникаСтрока].Видимость = ВидимостьРеквизитов;
	Элементы["Комментарий" + НомерУчастникаСтрока].Видимость = ВидимостьКомментария;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаКорректностиКодов

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьКорректностьИНН(Форма, Сообщать = Ложь)
	
	ТекстСообщения = РаботаСКодамиКлиентСервер.ПроверитьИНН(Форма.Объект.ИНН);
	ОбработатьРезультатПроверки(Форма, "ИНН", ТекстСообщения, Сообщать);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьКорректностьОГРН(Форма, Сообщать = Ложь)
	
	Если Форма.Объект.ОрганизационноПравоваяФорма = ПредопределенноеЗначение("Справочник.ОрганизационноПравовыеФормы.ИндивидуальноеЧастноеПредприятие") Тогда
		ТекстСообщения = РаботаСКодамиКлиентСервер.ПроверитьОГРНИП(Форма.Объект.ОГРН);
	Иначе
		ТекстСообщения = РаботаСКодамиКлиентСервер.ПроверитьОГРН(Форма.Объект.ОГРН);
	КонецЕсли;
	
	ОбработатьРезультатПроверки(Форма, "ОГРН", ТекстСообщения, Сообщать);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьРезультатПроверки(Форма, Поле, ТекстСообщения, Сообщать)
	
	ПолеКорректен = Поле + "Корректен";
	
	Форма[ПолеКорректен] = Не ЗначениеЗаполнено(ТекстСообщения);
	Если Форма[ПолеКорректен] Тогда
		Форма.Элементы[Поле].Подсказка = "";	
	Иначе
		Форма.Элементы[Поле].Подсказка = ТекстСообщения;
	КонецЕсли;
	
	Если Не Форма[ПолеКорректен] и Сообщать Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Форма.Объект.Ссылка, Поле, "Объект");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОсновные

&НаКлиенте
Процедура ПолноеНаименованиеПоУставуПриИзменении(Элемент)
	
	ОбработатьНаименованиеЮрЛица(Объект.ПолноеНаименованиеПоУставу);
	
	Для каждого СтрокаТабЧасти из Объект.БанковскиеРеквизиты Цикл
		СтрокаТабЧасти.ПолучательПлатежа = СтрЗаменить(СтрокаТабЧасти.ПолучательПлатежа, ТекущееПолноеНаименование, Объект.ПолноеНаименованиеПоУставу);
	КонецЦикла;
	
	ТекущееПолноеНаименование = Объект.ПолноеНаименованиеПоУставу;
	
КонецПроцедуры

&НаКлиенте
Процедура КраткоеНаименованиеПоУставуПриИзменении(Элемент)

	ОбработатьНаименованиеЮрЛица(Объект.КраткоеНаименованиеПоУставу);
	
КонецПроцедуры

&НаКлиенте
Процедура СокращенноеНаименованиеПриИзменении(Элемент)

	ОбработатьНаименованиеЮрЛица(Объект.СокращенноеНаименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РезидентРФПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДокументы

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Объект.ИНН = СокрЛП(Объект.ИНН);
	
	ПроверитьКорректностьИНН(ЭтотОбъект, Истина);
	
	Если ЭтаФорма.ИННКорректен И НЕ Объект.РезидентРФ Тогда
		Объект.КИО = Сред(Объект.ИНН, 5, 5); 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганВыдавшийОГРНПриИзменении(Элемент)

	Объект.ОрганВыдавшийОГРН = СокрЛП(Объект.ОрганВыдавшийОГРН);
	
КонецПроцедуры

&НаКлиенте
Процедура ОГРНИППриИзменении(Элемент)
	ПроверитьКорректностьОГРН(ЭтотОбъект, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКонтактнаяИнформация

&НаКлиенте
Процедура ЮридическийАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСКонтактнойИнформациейКлиент.НачалоВыбора(ЭтаФорма, Объект, "ЮридическийАдрес", "ЮридическийАдресФИАС", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес"), ПолучитьОбязательныеРеквизитыАдреса(), СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСКонтактнойИнформациейКлиент.НачалоВыбора(ЭтаФорма, Объект, "ФактическийАдрес", "ФактическийАдресФИАС", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактическийАдрес"), ПолучитьОбязательныеРеквизитыАдреса(), СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСКонтактнойИнформациейКлиент.НачалоВыбора(ЭтаФорма, Объект, "ПочтовыйАдрес", "ПочтовыйАдресФИАС", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПочтовыйАдрес"), ПолучитьОбязательныеРеквизитыАдреса(), СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьАдрес(Команда)
	
	СписокВыборка = Новый СписокЗначений;
	
	СписокВыборка.Добавить("ЮридическийАдрес"	, "Скопировать юридический адрес");
	СписокВыборка.Добавить("ФактическийАдрес"	, "Скопировать фактический адрес");
	СписокВыборка.Добавить("ПочтовыйАдрес"		, "Скопировать почтовый адрес");
	
	ИмяЭлемента = СтрЗаменить(Команда.Имя, "КомандаЗаполнить", "");

	СписокВыборка.Удалить(СписокВыборка.НайтиПоЗначению(ИмяЭлемента));
	
	ВыбранноеЗначение = ЭтаФорма.ВыбратьИзМеню(СписокВыборка, Команда);
	Если ВыбранноеЗначение <> Неопределено Тогда
		Объект[ИмяЭлемента] = Объект[ВыбранноеЗначение.Значение];
		Объект[ИмяЭлемента + "ФИАС"] = Объект[ВыбранноеЗначение.Значение + "ФИАС"];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОбязательныеРеквизитыАдреса()
	
	ОбязательныеРеквизитыАдреса = "";
	
	Если ЭтаФорма.ЮрФизЛицаОрганизации.НайтиПоЗначению(Объект.ЮрФизЛицо) <> Неопределено И Объект.Дата >= Дата(2021,10,1) Тогда
		ОбязательныеРеквизитыАдреса = "КодАдресаФИАС";
	КонецЕсли;	
	
	Возврат ОбязательныеРеквизитыАдреса;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийБанковскиеРеквизиты

&НаСервереБезКонтекста
Функция ПолучитьБанковскиеРеквизиты(БИК, Период)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Банки.Ссылка КАК Банк,
	|	ЕСТЬNULL(РеквизитыБанковСрезПоследних.Наименование, Банки.Наименование) КАК НаименованиеБанка,
	|	ЕСТЬNULL(РеквизитыБанковСрезПоследних.КоррСчет, Банки.КоррСчет) КАК КоррСчет
	|ИЗ
	|	Справочник.Банки КАК Банки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыБанков.СрезПоследних(&Период, ) КАК РеквизитыБанковСрезПоследних
	|		ПО (РеквизитыБанковСрезПоследних.Банк = Банки.Ссылка)
	|ГДЕ
	|	Банки.Код = &Код
	|	И Банки.ЭтоГруппа = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Код", БИК);
	
	Результат = Новый Структура("Банк, НаименованиеБанка, КоррСчет");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	
	НомерСтрокиСтрока = Сред(Элемент.Имя, СтрДлина("БИК") + 1);
	НомерСтрокиЧисло  = Число(НомерСтрокиСтрока);

	ТекущиеДанные = Объект.БанковскиеРеквизиты[НомерСтрокиЧисло];
	
	БанковскиеРеквизиты = ПолучитьБанковскиеРеквизиты(ТекущиеДанные.БИК, Объект.Дата);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, БанковскиеРеквизиты);
	
	Если Не ПустаяСтрока(ТекущиеДанные.БИК) и Не ЗначениеЗаполнено(БанковскиеРеквизиты.Банк) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден банк по БИК " + ТекущиеДанные.БИК, Объект.Ссылка, "Объект.БанковскиеРеквизиты[" + НомерСтрокиСтрока + "].БИК");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуПоНомеруСчета(Знач НомерСчета)
	Возврат Справочники.БанковскиеСчета.ПолучитьВалютуПоНомеруСчета(НомерСчета);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыСчета(Знач НомерСчета, Знач БИК, Знач Организация)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет,
	|	БанковскиеСчета.Банк.Наименование КАК НаименованиеБанка,
	|	БанковскиеСчета.Ссылка КАК РасчетныйСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Организация = &Организация
	|	И БанковскиеСчета.НомерСчета = &НомерСчета
	|	И &Код В(БанковскиеСчета.Банк.Код, """")");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НомерСчета",  НомерСчета);
	Запрос.УстановитьПараметр("Код",         БИК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РеквизитыСчета = Новый Структура("БИК,КоррСчет,НаименованиеБанка,Валюта,РасчетныйСчет");
		ЗаполнитьЗначенияСвойств(РеквизитыСчета, Выборка);
		
		Возврат РеквизитыСчета;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	НомерСтрокиСтрока = Сред(Элемент.Имя, СтрДлина("НомерСчета") + 1);
	НомерСтрокиЧисло  = Число(НомерСтрокиСтрока);

	ТекущиеДанные = Объект.БанковскиеРеквизиты[НомерСтрокиЧисло];
	
	Если Не ПустаяСтрока(ТекущиеДанные.НомерСчета) Тогда
		
		РеквизитыСчета = ПолучитьРеквизитыСчета(ТекущиеДанные.НомерСчета, ТекущиеДанные.БИК, Объект.Организация);
		
		Если РеквизитыСчета <> Неопределено Тогда
			
			Если ТекущиеДанные.СозданДокументом Тогда
				ИсключаемыеСвойства = "РасчетныйСчет";
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, РеквизитыСчета,, ИсключаемыеСвойства);
			
		Иначе
			
			Если Не ТекущиеДанные.СозданДокументом Тогда
				ТекущиеДанные.РасчетныйСчет = Неопределено;
			КонецЕсли;
			
			Валюта = ПолучитьВалютуПоНомеруСчета(ТекущиеДанные.НомерСчета);
			
			Если СтрДлина(ТекущиеДанные.НомерСчета) >= 20 и Не ЗначениеЗаполнено(Валюта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена валюта с кодом " + Сред(ТекущиеДанные.НомерСчета, 6, 3), Объект.Ссылка, "Объект.БанковскиеРеквизиты[" + НомерСтрокиСтрока + "].НомерСчета");	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерСтрокиСтрока = Сред(Элемент.Имя, СтрДлина("НомерСчета") + 1);
	НомерСтрокиЧисло  = Число(НомерСтрокиСтрока);

	ТекущиеДанные = Объект.БанковскиеРеквизиты[НомерСтрокиЧисло];
	
	Если СистемныеФункции.СсылкаСуществует(ТекущиеДанные.РасчетныйСчет) Тогда
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.РасчетныйСчет), Элемент);
	Иначе
		ПоказатьПредупреждение(,"Банковский счет не создан");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБанковскийСчет(Команда)

	НоваяСтрока = Объект.БанковскиеРеквизиты.Добавить();
	
	НоваяСтрока.ПолучательПлатежа = ТекущееПолноеНаименование;
	
	РазместитьБанковскийСчетНаСервере(НоваяСтрока.НомерСтроки - 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьБанковскийСчет(Элемент)
	
	Модифицированность = Истина;
	
	НомерУчастникаСтрока = Сред(Элемент.Имя, СтрДлина("ДекорацияУдаленияСчета") + 1);
	НомерУчастникаЧисло  = Число(НомерУчастникаСтрока);
	
	УдалитьБанковскийСчетНаСервере();
	
	Объект.БанковскиеРеквизиты.Удалить(НомерУчастникаЧисло);
	
КонецПроцедуры

&НаСервере
Процедура РазместитьБанковскийСчетНаСервере(Знач ИндексЭлемента)
	
	НомерУчастникаСтрока = Формат(ИндексЭлемента, "ЧН=0; ЧГ=0");
	
	НоваяГруппа = Элементы.Добавить("ГруппаБанковскийСчет" + НомерУчастникаСтрока, Тип("ГруппаФормы"), Элементы.ГруппаБанковскиеСчета);
	НоваяГруппа.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок            = "Банковский счет";
	НоваяГруппа.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	НоваяГруппа.ПутьКДаннымЗаголовка = "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].НомерСчета";
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияУдаленияСчета" + НомерУчастникаСтрока, Тип("ДекорацияФормы"), НоваяГруппа);
	НовыйЭлемент.Подсказка          = "Удалить банковский счет";
	НовыйЭлемент.Вид                = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка           = БиблиотекаКартинок.Удалить;
	НовыйЭлемент.Гиперссылка        = Истина;
	НовыйЭлемент.Доступность        = Не ТолькоПросмотр;
	НовыйЭлемент.ПропускатьПриВводе = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "УдалитьБанковскийСчет");
	
	НоваяПодГруппа = Элементы.Добавить("ГруппаСсылка" + НомерУчастникаСтрока, Тип("ГруппаФормы"), НоваяГруппа);
	НоваяПодГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяПодГруппа.ОтображатьЗаголовок = Ложь;
	НоваяПодГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяПодГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
	
	НовыйЭлемент = Элементы.Добавить("БИК" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.ПутьКДанным               = "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].БИК";
	НовыйЭлемент.Вид                       = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПодсказкаВвода            = "БИК";
	НовыйЭлемент.Заголовок                 = "БИК";
	НовыйЭлемент.ПоложениеЗаголовка        = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.РастягиватьПоГоризонтали  = Ложь;
	НовыйЭлемент.Ширина                    = 10;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "БИКПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("БанковскийСчет" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.ПутьКДанным				= "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].РасчетныйСчет";
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок                  = "Ссылка";
	НовыйЭлемент.ПоложениеЗаголовка			= ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.Ширина						= 10;
	НовыйЭлемент.ТолькоПросмотр				= Истина;
	
	НоваяПодГруппа = Элементы.Добавить("ГруппаБанк" + НомерУчастникаСтрока, Тип("ГруппаФормы"), НоваяГруппа);
	НоваяПодГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяПодГруппа.ОтображатьЗаголовок = Ложь;
	НоваяПодГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяПодГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
	
	НовыйЭлемент = Элементы.Добавить("НаименованиеБанка" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.ПутьКДанным              = "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].НаименованиеБанка";
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПодсказкаВвода           = "Наименование банка";
	НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Заголовок                = "Банк";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПропускатьПриВводе       = Истина;
	НовыйЭлемент.Ширина                   = 30;
	
	НовыйЭлемент = Элементы.Добавить("КоррСчет" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.ПутьКДанным              = "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].КоррСчет";
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПодсказкаВвода           = "Корреспондентский счет";
	НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Заголовок                = "к/с";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПропускатьПриВводе       = Истина;
	НовыйЭлемент.Ширина                   = 30;
	
	НоваяПодГруппа = Элементы.Вставить("ГруппаСчет" + НомерУчастникаСтрока, Тип("ГруппаФормы"), НоваяГруппа);
	НоваяПодГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяПодГруппа.ОтображатьЗаголовок = Ложь;
	НоваяПодГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяПодГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
	
	НовыйЭлемент = Элементы.Добавить("НомерСчета" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.ПутьКДанным              = "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].НомерСчета";
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПодсказкаВвода           = "Номер счета";
	НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Заголовок                = "р/с";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Ширина                   = 30;
	НовыйЭлемент.КнопкаОткрытия           = Неопределено;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "НомерСчетаПриИзменении");
	НовыйЭлемент.УстановитьДействие("Открытие",     "НомерСчетаОткрытие");
	
	НоваяПодГруппа = Элементы.Добавить("ГруппаПолучатель" + НомерУчастникаСтрока, Тип("ГруппаФормы"), НоваяГруппа);
	НоваяПодГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяПодГруппа.ОтображатьЗаголовок = Ложь;
	НоваяПодГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяПодГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
	
	НовыйЭлемент = Элементы.Добавить("ПолучательПлатежа" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.ПутьКДанным              = "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].ПолучательПлатежа";
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПодсказкаВвода           = "Получатель платежа";
	НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Заголовок                = "Получатель";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Ширина                   = 30;

	НовыйЭлемент = Элементы.Добавить("НазначениеПлатежа" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным              = "Объект.БанковскиеРеквизиты[" + НомерУчастникаСтрока + "].НазначениеПлатежа";
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПодсказкаВвода           = "Назначение платежа";
	НовыйЭлемент.Заголовок                = "Назначение";
	НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
	НовыйЭлемент.Высота                   = 2;
	НовыйЭлемент.МаксимальнаяВысота       = 2;
	НовыйЭлемент.АвтоМаксимальнаяВысота   = Ложь;
	НовыйЭлемент.МногострочныйРежим       = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьБанковскийСчетНаСервере()
	
	НомерУчастника = Объект.БанковскиеРеквизиты.Количество() - 1;
	НомерУчастникаСтрока = Формат(НомерУчастника, "ЧН=0; ЧГ=0");
	
	Элементы.Удалить(Элементы["ГруппаБанковскийСчет" + НомерУчастникаСтрока]);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОпросники

&НаКлиенте
Процедура НаличиеСчетаВГосударствахНеВыполняющихРекомендацииФАТФПриИзменении(Элемент)
	
	УстановитьВидимостьОпросников(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеловаяРепутацияПоложительнаяПриИзменении(Элемент)
	
	УстановитьВидимостьОпросников(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦельДругоеПриИзменении(Элемент)
	
	УстановитьВидимостьОпросников(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦелиДеятельностиПриИзменении(Элемент)
	 УстановитьВидимостьОпросников(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийУчастников

&НаКлиенте
Процедура ДобавитьУчастника(Команда)
	
	НоваяСтрока = Объект.ПредставителиВыгодоприобретатели.Добавить();
	НоваяСтрока.ВидУчастника = ПредопределенноеЗначение("Перечисление.ВидыУчастниковАнкет.Представитель");
	
	РазместитьУчастникаНаСервере(НоваяСтрока.НомерСтроки - 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУчастника(Элемент)
	
	Модифицированность = Истина;
	
	НомерУчастникаСтрока = Сред(Элемент.Имя, СтрДлина("ДекорацияУдаления") + 1);
	НомерУчастникаЧисло  = Число(НомерУчастникаСтрока);
	
	УдалитьУчастникаНаСервере();
	
	Объект.ПредставителиВыгодоприобретатели.Удалить(НомерУчастникаЧисло);
	
	Для Сч = НомерУчастникаЧисло по Объект.ПредставителиВыгодоприобретатели.Количество() - 1 Цикл
		УстановитьВидимостьРеквизитовУчастников(Элементы, Объект.ПредставителиВыгодоприобретатели[Сч].ВидУчастника, Формат(Сч, "ЧН=0; ЧГ="));	
	КонецЦикла;
	
	НастроитьОтображениеБенефициарногоВладельцаУстановленногоКомпанией(ЭтаФорма);
	ЗаполнитьФИОБенефициарногоВладельцаУстановленногоКомпанией();
	
КонецПроцедуры

&НаСервере
Процедура РазместитьУчастникаНаСервере(Знач ИндексЭлемента)
	
	НомерУчастникаСтрока = Формат(ИндексЭлемента, "ЧН=0; ЧГ=0");
	
	НоваяГруппа = Элементы.Вставить("ГруппаУчастник" + НомерУчастникаСтрока, Тип("ГруппаФормы"), Элементы.ГруппаУчастники);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияУдаления" + НомерУчастникаСтрока, Тип("ДекорацияФормы"), НоваяГруппа);
	НовыйЭлемент.Подсказка = "Удалить участника";
	НовыйЭлемент.Вид       = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка  = БиблиотекаКартинок.Удалить;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "УдалитьУчастника");
	
	Если ТолькоПросмотр Тогда
		НовыйЭлемент.Доступность = Ложь;	
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("ВидУчастника" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.ПредставителиВыгодоприобретатели[" + НомерУчастникаСтрока + "].ВидУчастника";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ВидУчастникаПриИзменении");
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Ширина = 20;
	
	НовыйЭлемент = Элементы.Добавить("ЮрФизЛицо" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.ПредставителиВыгодоприобретатели[" + НомерУчастникаСтрока + "].ЮрФизЛицо";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ЮрФизЛицоУчастникаПриИзменении");
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Ширина = 30;
	
	НовыйЭлемент = Элементы.Добавить("Должность" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.ПредставителиВыгодоприобретатели[" + НомерУчастникаСтрока + "].Должность";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.ПодсказкаВвода = "Должность";
	
	НовыйЭлемент = Элементы.Добавить("ОснованиеПолномочий" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.ПредставителиВыгодоприобретатели[" + НомерУчастникаСтрока + "].ОснованиеПолномочий";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.ПодсказкаВвода = "Основание полномочий";
	
	НовыйЭлемент = Элементы.Добавить("Комментарий" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.ПредставителиВыгодоприобретатели[" + НомерУчастникаСтрока + "].Комментарий";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Ложь;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.ПодсказкаВвода = "Комментарий";
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияПечать" + НомерУчастникаСтрока, Тип("ДекорацияФормы"), НоваяГруппа);
	НовыйЭлемент.Подсказка           = "Печать анкет";
	НовыйЭлемент.Вид                 = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка            = БиблиотекаКартинок.Печать;
	НовыйЭлемент.Гиперссылка         = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "НапечататьАнкетуУчастника");
		
КонецПроцедуры

&НаСервере
Процедура УдалитьУчастникаНаСервере()
	
	НомерУчастника = Объект.ПредставителиВыгодоприобретатели.Количество() - 1;
	НомерУчастникаСтрока = Формат(НомерУчастника, "ЧН=0; ЧГ=0");
	
	Элементы.Удалить(Элементы["ВидУчастника" + НомерУчастникаСтрока]);
	//Элементы.Удалить(Элементы["Анкета" + НомерУчастникаСтрока]);
	Элементы.Удалить(Элементы["Должность" + НомерУчастникаСтрока]);
	Элементы.Удалить(Элементы["ОснованиеПолномочий" + НомерУчастникаСтрока]);
	Элементы.Удалить(Элементы["ДекорацияУдаления" + НомерУчастникаСтрока]);
	Элементы.Удалить(Элементы["ГруппаУчастник" + НомерУчастникаСтрока]);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУчастникаПриИзменении(Элемент)
	
	НомерУчастникаСтрокой = СтрЗаменить(Элемент.Имя, "ВидУчастника", "");
	НомерУчастникаЧислом  = Число(НомерУчастникаСтрокой);
	
	УстановитьВидимостьРеквизитовУчастников(Элементы, Объект.ПредставителиВыгодоприобретатели[НомерУчастникаЧислом].ВидУчастника, НомерУчастникаСтрокой);
	
	НастроитьОтображениеБенефициарногоВладельцаУстановленногоКомпанией(ЭтаФорма);
	ЗаполнитьФИОБенефициарногоВладельцаУстановленногоКомпанией();
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоУчастникаПриИзменении(Элемент)
	
	НастроитьОтображениеБенефициарногоВладельцаУстановленногоКомпанией(ЭтаФорма);
	ЗаполнитьФИОБенефициарногоВладельцаУстановленногоКомпанией();
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьАнкетуУчастника(Элемент)
	
	НомерУчастникаСтрока = Сред(Элемент.Имя, СтрДлина("ДекорацияПечать") + 1);
	НомерУчастникаЧисло  = Число(НомерУчастникаСтрока);
	
	СтрокаТабЧасти = Объект.ПредставителиВыгодоприобретатели[НомерУчастникаЧисло];
	
	ОткрытьФорму("Обработка.ПечатьАнкетныхДанных.Форма.Форма", Новый Структура("ЮрФизЛицо, ВариантАнкеты, ОснованиеПолномочий", СтрокаТабЧасти.ЮрФизЛицо, СтрокаТабЧасти.ВидУчастника, СтрокаТабЧасти.ОснованиеПолномочий), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиНаименованияНаИностранныхЯзыках

&НаКлиенте
Процедура НаименованияНаИностранныхЯзыкахЯзыкНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(МассивИностранныхЯзыков());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МассивИностранныхЯзыков()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Языки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Языки КАК Языки
		|ГДЕ
		|	Языки.Ссылка <> ЗНАЧЕНИЕ(Справочник.Языки.Русский)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура НаименованияНаИностранныхЯзыкахКраткоеНаименованиеПоУставуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаименованияНаИностранныхЯзыках.ТекущиеДанные;
	ОбработатьНаименованиеЮрЛица(ТекущиеДанные.КраткоеНаименованиеПоУставу);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаИностранныхЯзыкахПолноеНаименованиеПоУставуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаименованияНаИностранныхЯзыках.ТекущиеДанные;
	ОбработатьНаименованиеЮрЛица(ТекущиеДанные.ПолноеНаименованиеПоУставу);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаИностранныхЯзыкахСокращенноеНаименованиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаименованияНаИностранныхЯзыках.ТекущиеДанные;
	ОбработатьНаименованиеЮрЛица(ТекущиеДанные.СокращенноеНаименование);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработатьНаименованиеЮрЛица(Наименование)

	МассивЗамен = Новый Массив;

	МассивЗамен.Добавить("«");
	МассивЗамен.Добавить("»");
	МассивЗамен.Добавить("“");
	МассивЗамен.Добавить("”");
	МассивЗамен.Добавить("‘‘");
	МассивЗамен.Добавить("’’");

	Для Каждого ЭлементЗамены Из МассивЗамен Цикл
		Наименование = СтрЗаменить(Наименование, ЭлементЗамены, """");
	КонецЦикла;
		
	Наименование = РаботаСоСтрокамиКлиентСервер.ЗаменитьПробельныеСимволы(Наименование, " ");
	
	Пока СтрНайти(Наименование, "  ") > 0 Цикл
		Наименование = СтрЗаменить(Наименование, "  ", " ");
	КонецЦикла;	
	
	Наименование = СокрЛП(Наименование);

КонецПроцедуры

&НаКлиенте
Процедура ОрганизационноПравоваяФормаПриИзменении(Элемент)
	НастроитьВидимостьИДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура БенефициарныйВладелецПриИзменении(Элемент)
	НастроитьВидимостьИДоступность(ЭтотОбъект);
	ЗаполнитьФИОБенефициарногоВладельца();
	ЗаполнитьФИОБенефициарногоВладельцаУстановленногоКомпанией();
	НастроитьОтображениеБенефициарногоВладельцаУстановленногоКомпанией(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФИОБенефициарногоВладельца()

	Если Объект.БенефициарныйВладелец = Перечисления.ВариантыСведенийОБенефициарныхВладельцах.Установлен Тогда

		Отбор = Новый Структура("ВидУчастника", Перечисления.ВидыУчастниковАнкет.БенефициарныйВладелец);
		БенефициарныеВладельцы = Объект.ПредставителиВыгодоприобретатели.Выгрузить(Отбор, "ЮрФизЛицо");

		ЭтаФорма.БенефициарныйВладелецФИО = Документы.АнкетаЮридическогоЛица.ПолучитьПредставлениеБенефициарныхВладельцев(Объект.Дата, Объект.Организация, БенефициарныеВладельцы);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВысокийУровеньРискаПриИзменении(Элемент)
	
	Объект.ОбоснованиеУровняРиска = ПолучитьСтандартноеОбоснованиеУровняРиска(Объект.ВысокийУровеньРиска);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтандартноеОбоснованиеУровняРиска(ВысокийУровеньРиска)

	СтандартноеОбоснованиеУровняРиска = ?(ВысокийУровеньРиска, "", "факторы высокого уровня риска не установлены");
	Возврат СтандартноеОбоснованиеУровняРиска;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеБенефициарногоВладельцаУстановленногоКомпанией(Форма)
	
	Отбор = Новый Структура("ВидУчастника", ПредопределенноеЗначение("Перечисление.ВидыУчастниковАнкет.БенефициарныйВладелецУстановленныйКомпанией"));
	БенефициарныеВладельцы = Форма.Объект.ПредставителиВыгодоприобретатели.НайтиСтроки(Отбор);
	
	Если БенефициарныеВладельцы.Количество() = 0 Тогда
		Форма.Элементы.БенефициарныйВладелецОбоснование.АвтоОтметкаНезаполненного = Ложь;
		Форма.Элементы.БенефициарныйВладелецОбоснование.ОтметкаНезаполненного = Ложь;
	Иначе
		Форма.Элементы.БенефициарныйВладелецОбоснование.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФИОБенефициарногоВладельцаУстановленногоКомпанией()

	Отбор = Новый Структура("ВидУчастника", Перечисления.ВидыУчастниковАнкет.БенефициарныйВладелецУстановленныйКомпанией);
	БенефициарныеВладельцы = Объект.ПредставителиВыгодоприобретатели.Выгрузить(Отбор, "ЮрФизЛицо");
	
	ЭтаФорма.БенефициарныйВладелецУстановленныйКомпаниейФИО = Документы.АнкетаЮридическогоЛица.ПолучитьПредставлениеБенефициарныхВладельцев(
		Объект.Дата, 
		Объект.Организация, 
		БенефициарныеВладельцы);
		
КонецПроцедуры

&НаКлиенте
Процедура МеждународнаяКомпанияПриИзменении(Элемент)

	НастроитьВидимостьИДоступность(ЭтаФорма);	

КонецПроцедуры

