
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "ЮрФизЛицо, КоррСчет, Адрес, Телефоны");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		// т.к. банки мы грузим из классификатора РБК, где при изменении значащих реквизитов (БИК, КорСчет и т.д.)
		// создается новый элемент, то одна несколько банков могут быть связаны с одним юр. лицом и проверять
		// уникальность функциональной роли по аналогии с прочими смысла нет
		
		// есть смысл качать расширенный классификатор с сайта ЦБ и серяться с ним, проверяя
		// корректность заполнения банковских реквизито в Матрихе, но это уже отдельная задача
		
		//пока юрлицо пустое для ТОФК
		Если ЭтотОбъект.ЭтоТерриториальныйОрганФедеральногоКазначейства И ЗначениеЗаполнено(ЭтотОбъект.ЮрФизЛицо) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для подразделений федерального казначейства юрлицо должно быть пустым!",ЭтотОбъект,"ЮрФизЛицо",,Отказ);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

