
&НаСервереБезКонтекста
Функция ОпределитьНомерКартинкиГруппы(Группа)
	
	Если      Группа.Предопределенный Тогда
		Возврат 4;
	ИначеЕсли Группа.ПометкаУдаления Тогда
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции // ОпределитьНомерКартинкиГруппы

&НаСервереБезКонтекста
Процедура ДобавитьЦепочкуГруппДопСведений(ГруппыДопСведений, ГруппаНачалаЦепочки)
	
	Если ГруппыДопСведений.Найти(ГруппаНачалаЦепочки, "Группа") <> Неопределено Тогда // если есть группа начала цепочки, то и все её родительские группы тоже есть
		Возврат;
	КонецЕсли;
	
	// добавим группу начала цепочки
	НоваяСтрокаГруппыДопСведений = ГруппыДопСведений.Добавить();
	НоваяСтрокаГруппыДопСведений.Группа        = ГруппаНачалаЦепочки;
	НоваяСтрокаГруппыДопСведений.Родитель      = ГруппаНачалаЦепочки.Родитель;
	НоваяСтрокаГруппыДопСведений.НомерКартинки = ОпределитьНомерКартинкиГруппы(ГруппаНачалаЦепочки);
	
	// добавим все родительские группы
	Родитель = ГруппаНачалаЦепочки.Родитель;
	
	Пока ЗначениеЗаполнено(Родитель) И ГруппыДопСведений.Найти(Родитель, "Группа") = Неопределено Цикл
		НоваяСтрокаГруппыДопСведений = ГруппыДопСведений.Добавить();
		НоваяСтрокаГруппыДопСведений.Группа        = Родитель;
		НоваяСтрокаГруппыДопСведений.Родитель      = Родитель.Родитель;
		НоваяСтрокаГруппыДопСведений.НомерКартинки = ОпределитьНомерКартинкиГруппы(Родитель);
		
		Родитель = Родитель.Родитель;
	КонецЦикла;
	
КонецПроцедуры // ДобавитьЦепочкуГруппДопСведений

&НаСервереБезКонтекста
Процедура ЗаполнитьДеревоДополнительныеСведения(ДеревоДопСведений, ДопСведения, ГруппыДопСведений, Родитель)
	
	СтрокиГруппыДопСведений = ГруппыДопСведений.НайтиСтроки(
		Новый Структура("Родитель", Родитель));
	
	Для каждого СтрокаГруппыДопСведений Из СтрокиГруппыДопСведений Цикл
		НоваяСтрокаДеревоДопСведений = ДеревоДопСведений.Строки.Добавить();
		НоваяСтрокаДеревоДопСведений.Сведение         = СтрокаГруппыДопСведений.Группа;
		НоваяСтрокаДеревоДопСведений.НомерКартинки    = СтрокаГруппыДопСведений.НомерКартинки;
		НоваяСтрокаДеревоДопСведений.ЗначениеЗаписано = Истина;
		
		ЗаполнитьДеревоДополнительныеСведения(НоваяСтрокаДеревоДопСведений, ДопСведения, ГруппыДопСведений, СтрокаГруппыДопСведений.Группа);
	КонецЦикла;
	
	СтрокиДопСведения = ДопСведения.НайтиСтроки(
		Новый Структура("ГруппаДополнительныхСведений", Родитель));
	
	Для каждого СтрокаДопСведения Из СтрокиДопСведения Цикл
		ЗаполнитьЗначенияСвойств(ДеревоДопСведений.Строки.Добавить(), СтрокаДопСведения);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДеревоДополнительныеСведения

&НаСервереБезКонтекста
Процедура СформироватьДеревоДополнительныеСведения(ДеревоДопСведений, ДопСведения, ГруппыДопСведений = Неопределено)
	
	ДеревоДопСведений.Строки.Очистить();
	
	ГруппыДопСведений = Новый ТаблицаЗначений;
	ГруппыДопСведений.Колонки.Добавить("Группа",   Новый ОписаниеТипов("СправочникСсылка.ГруппыДополнительныхСведений"));
	ГруппыДопСведений.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.ГруппыДополнительныхСведений"));
	ГруппыДопСведений.Колонки.Добавить("НомерКартинки");
	
	Для каждого СтрокаДопСведения Из ДопСведения Цикл
		ДобавитьЦепочкуГруппДопСведений(ГруппыДопСведений, СтрокаДопСведения.ГруппаДополнительныхСведений);
	КонецЦикла;
	
	ГруппыДопСведений.Индексы.Добавить("Родитель");
	ДопСведения.Индексы.Добавить("ГруппаДополнительныхСведений");
	
	ЗаполнитьДеревоДополнительныеСведения(ДеревоДопСведений, ДопСведения, ГруппыДопСведений, Справочники.ГруппыДополнительныхСведений.ПустаяСсылка());
	
КонецПроцедуры // СформироватьДеревоДополнительныеСведения

&НаСервереБезКонтекста
Процедура ПеренестиЗначенияСвойствИзДереваВРегистр(НаборЗаписей, Объект, ДеревоСведений)
	
	Для каждого СтрокаДеревоСведений Из ДеревоСведений.ПолучитьЭлементы() Цикл
		Если ТипЗнч(СтрокаДеревоСведений.Сведение) <> Тип("СправочникСсылка.ГруппыДополнительныхСведений")
			И (ЗначениеЗаполнено(СтрокаДеревоСведений.Значение) Или СтрокаДеревоСведений.ЗначениеЗаписано)
		Тогда
			МенеджерЗаписи = НаборЗаписей.Добавить();
			МенеджерЗаписи.Объект   = Объект;
			МенеджерЗаписи.Свойство = СтрокаДеревоСведений.Сведение;
			МенеджерЗаписи.Значение = СтрокаДеревоСведений.Значение;
		КонецЕсли;
		
		ПеренестиЗначенияСвойствИзДереваВРегистр(НаборЗаписей, Объект, СтрокаДеревоСведений);
	КонецЦикла;
	
КонецПроцедуры // ПеренестиЗначенияСвойствИзДереваВРегистр


&НаСервере
Процедура ОбновитьДополнительныеСведенияНаСервере()
	
	ДополнительныеСведенияНаСервере = РеквизитФормыВЗначение("ДополнительныеСведения");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеСведенияОбъектыНазначения.Ссылка КАК Сведение,
		|	ДополнительныеСведения.ТипЗначения,
		|	ДополнительныеСведения.ГруппаДополнительныхСведений,
		|	ЗначенияДополнительныхСведений.Значение,
		|	ВЫБОР
		|		КОГДА ЗначенияДополнительныхСведений.Значение ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЗначениеЗаписано,
		|	ВЫБОР
		|		КОГДА НЕ ДополнительныеСведения.Предопределенный
		|				И НЕ ДополнительныеСведения.ПометкаУдаления
		|			ТОГДА 2
		|		КОГДА НЕ ДополнительныеСведения.Предопределенный
		|				И ДополнительныеСведения.ПометкаУдаления
		|			ТОГДА 3
		|		КОГДА ДополнительныеСведения.Предопределенный
		|			ТОГДА 5
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК НомерКартинки
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения.ОбъектыНазначения КАК ДополнительныеСведенияОбъектыНазначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ДополнительныеСведенияОбъектыНазначения.Ссылка = ДополнительныеСведения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО ДополнительныеСведенияОбъектыНазначения.Ссылка = ЗначенияДополнительныхСведений.Свойство
		|			И (ЗначенияДополнительныхСведений.Объект = &Объект)
		|ГДЕ
		|	(ДополнительныеСведенияОбъектыНазначения.ПолноеИмяОбъекта = &ПолноеИмяОбъекта
		|			ИЛИ ДополнительныеСведения.НазначатьВсемОбъектам)";
		
	Запрос.УстановитьПараметр("Объект",           ЭтаФорма.Объект);
	Запрос.УстановитьПараметр("ПолноеИмяОбъекта", ЭтаФорма.ПолноеИмяОбъекта);
			
	СформироватьДеревоДополнительныеСведения(ДополнительныеСведенияНаСервере, Запрос.Выполнить().Выгрузить());
	
	ЗначениеВРеквизитФормы(ДополнительныеСведенияНаСервере, "ДополнительныеСведения");
	
КонецПроцедуры // ОбновитьДополнительныеСведенияНаСервере

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	
	НачатьТранзакцию();
	
	// установим блокировку
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ЗначенияДополнительныхСведений");
	ЭлементБлокировки.УстановитьЗначение("Объект", ЭтаФорма.Объект);
	
	БлокировкаДанных.Заблокировать();
	
	// рекурсивно соберем новые значения свойств в таблицу
	НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	ПеренестиЗначенияСвойствИзДереваВРегистр(НаборЗаписей, ЭтаФорма.Объект, ЭтаФорма.ДополнительныеСведения);
	
	НаборЗаписей.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ЗаписатьИзмененияНаСервере


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЭтаФорма.Параметры.Свойство("Объект") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан объект, дополнительные сведения которого требуется отобразить.",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Объект           = ЭтаФорма.Параметры.Объект;
	ЭтаФорма.ПолноеИмяОбъекта = ЭтаФорма.Объект.Метаданные().ПолноеИмя();
	
	Если СтрНачинаетсяС(ЭтаФорма.ПолноеИмяОбъекта, "Справочник.") Тогда
		ЭтаФорма.Заголовок = "справочника";
	ИначеЕсли СтрНачинаетсяС(ЭтаФорма.ПолноеИмяОбъекта, "Документ.") Тогда
		ЭтаФорма.Заголовок = "документа";
	Иначе
		ЭтаФорма.Заголовок = "";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "Доп. сведения " + ЭтаФорма.Заголовок + " " + ЭтаФорма.Объект;
	ЭтаФорма.АвтоЗаголовок = Ложь;
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Объект",, ВидСравненияКомпоновкиДанных.Равно, ЭтаФорма.Объект);
	
	ОбновитьДополнительныеСведенияНаСервере();
	
	Если Не РольДоступна("ПолныеПрава") И НЕ РольДоступна("ОперацииБухгалтерии") Тогда
		Элементы.СтраницаСписок.Видимость = Ложь;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьДополнительныеСведения(Команда)
	
	ОбновитьДополнительныеСведенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеСведенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДополнительныеСведения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДополнительныеСведенияЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеСведенияПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДополнительныеСведения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные) = Тип("СправочникСсылка.ГруппыДополнительныхСведений") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИзменения(Команда)
	
	Перем КлючиРазвернутыхСтрокДерева;
	
	ЗаписатьИзмененияНаСервере();
	
	ЭтаФорма.Модифицированность = Ложь;
	
	Если Команда <> Неопределено Тогда // интерактивный вызов => обновим дерево
		РаботаСФормамиКлиент.ПолучитьКлючиРазвернутыхСтрокДерева(ЭтаФорма.ДополнительныеСведения, Элементы.ДополнительныеСведения, "Сведение", КлючиРазвернутыхСтрокДерева);
		КлючКлючТекущейСтроки = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ДополнительныеСведения, "Сведение");
		
		ОбновитьДополнительныеСведенияНаСервере();
		
		РаботаСФормамиКлиент.ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ЭтаФорма.ДополнительныеСведения, Элементы.ДополнительныеСведения, "Сведение", КлючиРазвернутыхСтрокДерева);
		РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ДополнительныеСведения, Элементы.ДополнительныеСведения, "Сведение", КлючКлючТекущейСтроки);
	КонецЕсли;
	
КонецПроцедуры
