
&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ВыполнитьПроверку");
	Если ПроверитьЗаполнение() Тогда
		ВыполнитьПроверкуНаСервере();
	Иначе
		ТекстОшибки = "Не заполнены обязательные реквизиты";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()

	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	РеквизитОбъект.ПроверитьБанковскиеСчета(ДатаПроверки);
	РеквизитОбъект.ПроверитьДепозитныеВклады(ДатаПроверки);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ДатаПроверки = ТекущаяДатаСеанса();

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
