
&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ВыполнитьПроверку");
	Попытка
		Если ПроверитьЗаполнение() Тогда
			ВыполнитьПроверкуНаСервере();
		Иначе
			ДобавитьТекстОшибки(ПараметрыСессии, "Не заполнены обязательные реквизиты.");
		КонецЕсли;
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()

	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	РеквизитОбъект.ПроверитьБанковскиеСчета(ДатаПроверки);
	РеквизитОбъект.ПроверитьДепозитныеВклады(ДатаПроверки);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ДатаПроверки = ТекущаяДатаСеанса();

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
