&НаСервере
Перем Соединение;


#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма, "Отчет.Организация");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыбратьКаталог(ПараметрыСкачивания)

	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог для сохранения отчета";	
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ПриВыбореКаталога", ЭтаФорма, ПараметрыСкачивания));

КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореКаталога(ВыбранныеФайлы, ПараметрыСкачивания) Экспорт
	
	Если Не ВыбранныеФайлы = Неопределено Тогда
		СохранитьФайлНаКлиенте(ВыбранныеФайлы[0], ПараметрыСкачивания);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбратьКаталог(Расшифровка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлНаКлиенте(Каталог, ПараметрыСкачивания)
	
	ДанныеФайлаXML = ПолучитьДанныеФайлаXMLНаСервере(ПараметрыСкачивания);	
	
	Если ДанныеФайлаXML <> Неопределено Тогда
		
		ПолноеИмяФайла = СтрШаблон("%1\%2.xml", Каталог, ПараметрыСкачивания.ИмяФайла);
		
		ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ДанныеФайлаXML);
		ДвоичныеДанные.Записать(ПолноеИмяФайла);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Файл %1 сохранен.", ПолноеИмяФайла));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФайлаXMLНаСервере(ПараметрыСкачивания)
	
	Если Соединение = Неопределено Тогда

		Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(РаботаСВнешнимиСистемами.СтрокаСоединенияСXE());
		
	КонецЕсли;	

	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	ТаблицаФайловXE = ОтчетНаСервере.ПолучитьТаблицуФайловИзXE(Соединение, 
																ПараметрыСкачивания.ВерсияТаксономии, 
																ПараметрыСкачивания.ТочкаВхода, 
																ПараметрыСкачивания.ОГРН, 
																ПараметрыСкачивания.ОтчетнаяДата, 
																?(СтрНайти(ПараметрыСкачивания.ИмяФайла, "ОКУД0420431") > 0, "", ПараметрыСкачивания.РазделыXBRL), 
																ПараметрыСкачивания.УсловиеОтбора, 
																Истина);

	Для Каждого СтрокаФайловXE Из ТаблицаФайловXE Цикл
		
		Если СтрокаФайловXE.ИмяФайла = ПараметрыСкачивания.ИмяФайла И СтрокаФайловXE.ДатаЗагрузки = ПараметрыСкачивания.ДатаЗагрузки 
			И СтрокаФайловXE.Примечание = ПараметрыСкачивания.Примечание И СтрокаФайловXE.ИдентификаторОтчета = ПараметрыСкачивания.ИдентификаторОтчета Тогда
			
			Возврат СтрокаФайловXE.ДанныеXML; 
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные файла.");
	Возврат Неопределено;
	
КонецФункции	
