#Область Обработчики_событий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Заполняем только на основании поручений на вывод денежных средств или ценных бумаг
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг") Тогда
		
		ЭтотОбъект.Основание	= ДанныеЗаполнения;
		ЭтотОбъект.Дата 		= ТекущаяДата();
		ЭтотОбъект.Организация	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось начать процесс согласования поручения на вывод активов: не заполнен документ-основание",,,, Отказ);
		
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ТребуетсяПодтверждениеКлиентскогоОтделаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Ложь;
	
	Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда		
		Результат = ЭтотОбъект.ДополнительныеСвойства.Свойство("ТребуетсяПодтверждениеКлиентскогоОтдела");		
	КонецЕсли;                                                                                                                                 		
		
КонецПроцедуры 

Процедура ЭтоПоручениеНаВыводЦенныхБумагПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = (ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг"));
		
КонецПроцедуры

Процедура СозданиеПроведениеАкцептаОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "СчетДоверительногоУправления, ПометкаУдаления");
	
	Если РеквизитыДокумента.ПометкаУдаления Или ЭтотОбъект.Отменен Тогда
		// Документ в процессе был помечен на удаление или бизнес-процесс отменен. Дальнейшие действия не требуются
		Возврат;	
	КонецЕсли;                                                              	
	
	// Не у всех согласующих пользователей есть права на проведение акцептов, поэтому на время установим соответствующий параметр сеанса
	ВременныйПараметрСеанса = Не ОбщегоНазначения.ЗначениеПараметраСеанса("ФормированиеДвиженийПоРегистрамБэкОфиса");	
	
	Если ВременныйПараметрСеанса Тогда                					
		ПараметрыСеанса.ФормированиеДвиженийПоРегистрамБэкОфиса = Истина;				
	КонецЕсли;
	
	Акцептант = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо");
	
	//т.к. у пользователя есть возможность отменить согласование (при этом распроводится документ "Акцепт")
	//нужно проверить - возможно это повторное согласование, и документ "Акцепт" уже существует.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Акцепт.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Акцепт КАК Акцепт
		|ГДЕ
		|	Акцепт.Организация = &Организация
		|	И Акцепт.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И Акцепт.ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов)
		|	И Акцепт.Объект = &Поручение
		|	И Акцепт.Акцептант = &Акцептант
		|	И НЕ Акцепт.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", РеквизитыДокумента.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Поручение", ЭтотОбъект.Основание); 
	Запрос.УстановитьПараметр("Акцептант", Акцептант);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Акцепт = Выборка.Ссылка.ПолучитьОбъект(); 
			Акцепт.Дата = ТекущаяДата();
	
		КонецЦикла;
		
	Иначе
		
		Акцепт 								= Документы.Акцепт.СоздатьДокумент();	
		Акцепт.Организация 					= ЭтотОбъект.Организация;
		Акцепт.Объект 						= ЭтотОбъект.Основание;
		Акцепт.Дата 						= ТекущаяДата();
		Акцепт.ВидАкцепта 					= Перечисления.ВидыАкцептов.ПоручениеНаВыводАктивов;
		Акцепт.СчетДоверительногоУправления = РеквизитыДокумента.СчетДоверительногоУправления;
		Акцепт.Акцептант 					= Акцептант; 
			
	КонецЕсли;
			
	Акцепт.Записать(РежимЗаписиДокумента.Проведение);
	
	Если ВременныйПараметрСеанса Тогда
		ПараметрыСеанса.ФормированиеДвиженийПоРегистрамБэкОфиса = Ложь;		
	КонецЕсли;

КонецПроцедуры

Процедура КонтрольОтделомСопровожденияОперацийПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "ОтделСопровождения");
	
КонецПроцедуры

Процедура ПодтверждениеКлиентскогоОтделаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "КлиентскийОтдел");
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Основание");

КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_функции

Процедура ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, ИмяГруппыИсполнителей)
		
	ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект(ИмяГруппыИсполнителей), ЭтотОбъект.Организация);
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		
		Задача.ГруппаИсполнителей = ГруппаИсполнителей;
		Задача.Основание 		  = ЭтотОбъект.Основание;
		Задача.Организация		  = ЭтотОбъект.Организация;

		Если Задача.ТочкаМаршрута = БизнесПроцессы.СогласованиеПорученийНаВыводАктивов.ТочкиМаршрута.ПодтверждениеКлиентскогоОтдела Тогда
			Задача.ТекстЗадачи = "Подтвердить документ " + СокрЛП(ЭтотОбъект.Основание);
		ИначеЕсли Задача.ТочкаМаршрута = БизнесПроцессы.СогласованиеПорученийНаВыводАктивов.ТочкиМаршрута.КонтрольОтделомСопровожденияОпераций Тогда
			Задача.ТекстЗадачи = "Провести контроль движения " + ?(ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг"), "ценных бумаг" , "денежных средств") + " по документу " + СокрЛП(ЭтотОбъект.Основание);
		ИначеЕсли Задача.ТочкаМаршрута = БизнесПроцессы.СогласованиеПорученийНаВыводАктивов.ТочкиМаршрута.СогласованиеОтделомСопровожденияОпераций Тогда
			Задача.ТекстЗадачи = "Согласовать документ " + СокрЛП(ЭтотОбъект.Основание);
		КонецЕсли;
				
	КонецЦикла;
				
КонецПроцедуры

Процедура СогласованиеОтделомСопровожденияОперацийПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "ОтделСопровождения");
		
КонецПроцедуры

Процедура СогласованиеОтделомСопровожденияОперацийПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
				
	ЗадачаСогласования = РаботаСБизнесПроцессамиИЗадачами.ПолучитьЗадачуНаСогласованиеПорученияНаВыводАктивовПоДействию(ЭтотОбъект.Основание, ТочкаМаршрутаБизнесПроцесса);
		
	Если ЗначениеЗаполнено(ЗадачаСогласования) Тогда
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
				
КонецПроцедуры

#КонецОбласти