Функция GUIDToUUID(GUID) Экспорт

    Возврат Сред(GUID, 20, 4) + Прав(GUID, 12) + Сред(GUID, 15, 4) + Сред(GUID, 10, 4) + Лев(GUID, 8);

КонецФункции

Процедура ПроинформироватьОНеобходимостиЗаведенияДокументаРегистрацииСведений(Облигация, Организация) Экспорт

	ДатаОповещения = НачалоДня(ТекущаяДата());
	
	ТаблицаПартий = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПартииПоАСиРегистрациейЭСП(ДатаОповещения, Облигация, Организация);
	Если ТаблицаПартий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПодключения = РаботаСоСтрокамиКлиентСервер.ПолучитьПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	СсылкаИБ = СтрШаблон("e1c://server/%1/%2", ПараметрыПодключения.Srvr, ПараметрыПодключения.Ref);
	
	Оповещение = Новый Структура("Организация, Облигация, Дата, ТекстОповещения", Организация, Облигация, Формат(ДатаОповещения, "ДЛФ=DD"), "");
	Оповещение.ТекстОповещения = Оповещение.ТекстОповещения + "<table border=""0"" cellspacing=""1"" bgcolor=""#000000""><tr bgcolor=""#FFFFFF""><td><b>Клиент</b></td></tr>";
	
	МассивКлиентов = ТаблицаПартий.ВыгрузитьКолонку("Клиент");
	РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(МассивКлиентов);
	Для каждого Клиент Из МассивКлиентов Цикл

		Ссылка = СсылкаИБ;
		
		Ссылка = Ссылка + "#e1cib/command/Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Команда.ОбработкаСсылкиОбъявленияОферты?cmdprm=";
		Ссылка = Ссылка + "СправочникСсылка.Облигации:" + GUIDToUUID(Строка(Облигация.УникальныйИдентификатор()));
		Ссылка = Ссылка + ",СправочникСсылка.ЮрФизЛица:" + GUIDToUUID(Строка(Клиент.УникальныйИдентификатор()));
		Ссылка = Ссылка + ",СправочникСсылка.Организации:" + GUIDToUUID(Строка(Организация.УникальныйИдентификатор()));
		
		Оповещение.ТекстОповещения = Оповещение.ТекстОповещения + "<tr bgcolor=""#FFFFFF""><td valign = ""top""><A href=""" + Ссылка + """>" + Строка(Клиент) + "</A></td></tr>";
	
	КонецЦикла;

	Оповещение.ТекстОповещения = Оповещение.ТекстОповещения + "</table>";
	
	Справочники.Оповещения.СформироватьОповещения("РегистрСведений.УсловияОферт.ПроинформироватьОНеобходимостиЗаведенияДокументаРегистрацииСведений", Перечисления.ТипыСобытий.ВнешнийВызов, Оповещение);
	
КонецПроцедуры
