
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Организация = ПараметрыСеанса.ТекущаяОрганизация;

	Объект.РежимПерезаписи = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПредъявления) Тогда
		Объект.ДатаНачалаПредъявления = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	ЭтаФорма.Элементы.Облигация.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачиНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	МассивНомеров = ОбъектНаСервере.СоздатьЗадачиПоОфертам();
	
	Если ТипЗнч(МассивНомеров) = Тип("Массив") И МассивНомеров.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В 1Ф созданы задачи: " + РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивНомеров));	
	КонецЕсли;
	
	ОбъектНаСервере.ОповеститьОбОшибках(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачи(Команда)
	
	Объект.РежимПерезаписи = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПредъявления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата начала предъявления.",,, "Объект.ДатаНачалаПредъявления");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "СоздатьЗадачи" Тогда
		Объект.ДатаФормированияОстатков = Объект.ДатаНачалаПредъявления;
	КонецЕсли;
	
	СоздатьЗадачиНаСервере();
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Команда выполнена.");
							
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоБумагеПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.Облигация.Видимость = ЭтаФорма.ФильтрПоБумаге;
	
	Если ЭтаФорма.ФильтрПоБумаге = Ложь тогда
		Объект.Облигация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличнуюЧасть(Команда)
	
	//Команда для обновления табличной части в ранее созданной задаче.
	//На услучай если изменилось количество ценных бумаг на остатках, и эти изменения нужно отразить в задаче.
	Объект.РежимПерезаписи = Истина;
	Объект.Облигация       = Неопределено;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПредъявления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата начала предъявления.",,, "Объект.ДатаНачалаПредъявления");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.НомерЗадачи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите номер задачи для перезаписи табличной части.",,, "Объект.НомерЗадачи");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаФормированияОстатков) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите дату формирования остатков.",,, "Объект.ДатаФормированияОстатков");
		Возврат;
	КонецЕсли;
	
	СоздатьЗадачиНаСервере();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Команда выполнена.");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачиПоЗапросамФССПНаСервере()
		
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
    ОбъектНаСервере.СоздатьЗадачиПоЗапросамФССП(ЭтаФорма.Организация);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачиПоЗапросамФССП(Команда)	
	
	СоздатьЗадачиПоЗапросамФССПНаСервере(); 
	
КонецПроцедуры
