
#Область Расчет_доходности_управления

// Функция - Рассчитать доходность управления
//
// Параметры:
//  СчетДоверительногоУправления - СправочникСсылка.СчетаДоверительногоУправления
//  Период						 - Дата - Конец периода
//  ВалютаРасчета				 - СправочникСсылка.Валюты, Неопределено - Валюта, в которой оцениваются активы. Если не указана, расчеты выполняются в валюте учета.
//  НачалоПериода				 - Дата, Неопределено - Начало периода. Если не указан - используется дата первого ввода
//  РасшифровкаРасчета			 - Булево - Определяет тип возвращаемого значения. Если Истина - возвращается структура для вывода расшифровки
// 								   Если Ложь - возвращается соответствие. Ключ - СправочникСсылка.ВидыФинансовыхПоказателей, Значение - значение доходности
// 
// Возвращаемое значение:
//	Структура - при расшифровке
//	Соответствие - ключи: Средневзвешенная доходность управления | Текущая доходность управления (с начала года)  
//
Функция РассчитатьДоходностьУправления(ПараметрыРасчета, Отказ = Ложь) Экспорт
	
	Если ПараметрыРасчета.ДатаНачала = НачалоГода(ПараметрыРасчета.ДатаОкончания) Тогда 
		ПараметрыРасчета.Вставить("Показатель", "Средневзвешенная доходность управления");
	Иначе	
		ПараметрыРасчета.Вставить("Показатель", "Средневзвешенная доходность управления (с начала года)");
	КонецЕсли;

	Если НЕ ПараметрыРасчета.Свойство("ВалютаРасчета") Тогда
		ПараметрыРасчета.Вставить("ВалютаРасчета", Справочники.Валюты.ПустаяСсылка());
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.Свойство("МассивОшибок") Тогда
		ПараметрыРасчета.Вставить("МассивОшибок", Неопределено);
	КонецЕсли;
	
	Если ПараметрыРасчета.Свойство("СписокАктивовДляИсключенияИзРасчетаДоходности") 
		И ЗначениеЗаполнено(ПараметрыРасчета.СписокАктивовДляИсключенияИзРасчетаДоходности) Тогда
		ПараметрыРасчета.Вставить("ИсключитьАктивыИзРасчетаДоходности", Истина);
	Иначе
		ПараметрыРасчета.Вставить("ИсключитьАктивыИзРасчетаДоходности", Ложь);
		ПараметрыРасчета.Вставить("СписокАктивовДляИсключенияИзРасчетаДоходности", Справочники.Облигации.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",									ПараметрыРасчета.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 					ПараметрыРасчета.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачала",										ПараметрыРасчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",									КонецДня(ПараметрыРасчета.ДатаОкончания));
	Запрос.УстановитьПараметр("ВалютаРасчета",									ПараметрыРасчета.ВалютаРасчета);
	Запрос.УстановитьПараметр("МассивВидыОпераций", 							ПолучитьМассивВидыОперацийДляРасчетаДоходности());
    Запрос.УстановитьПараметр("ИсключитьАктивыИзРасчетаДоходности",				ПараметрыРасчета.ИсключитьАктивыИзРасчетаДоходности);
	Запрос.УстановитьПараметр("СписокАктивовДляИсключенияИзРасчетаДоходности",	ПараметрыРасчета.СписокАктивовДляИсключенияИзРасчетаДоходности);

	ЗаполнитьДатыСЧАДляРасчетаДоходности(Запрос, ПараметрыРасчета, Отказ);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыРасчета.ДатаНачала) Тогда	
		Возврат Новый Соответствие;
	КонецЕсли;
	
	ПоместитьТаблицыДляРасчетаДоходностиУправленияВМенеджерВременныхТаблиц(
		Запрос, 
		ПараметрыРасчета.Организация, 
		Новый СтандартныйПериод(ПараметрыРасчета.ДатаНачала, КонецДня(ПараметрыРасчета.ДатаОкончания)),
		"СчетаДоверительногоУправления", 
		ПараметрыРасчета.СчетДоверительногоУправления, 
		ПараметрыРасчета);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.Период КАК Период,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Сумма
		|ПОМЕСТИТЬ _СуммаАктивовДляИсключения
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	&ИсключитьАктивыИзРасчетаДоходности
		|	И СтоимостьПереоценки.Активность
		|	И СтоимостьПереоценки.Период В (&ДатаСЧАНачала, &ДатаСЧАОкончания)
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.ЦеннаяБумага В(&СписокАктивовДляИсключенияИзРасчетаДоходности)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.Период,
		|	СтоимостьПереоценки.ЦеннаяБумага
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики,
		|	СУММА(-СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета)
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	&ИсключитьАктивыИзРасчетаДоходности
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период В (&ДатаСЧАНачала, &ДатаСЧАОкончания)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики В(&СписокАктивовДляИсключенияИзРасчетаДоходности)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Активность КАК Активность,
		|	ФинансовыеПоказатели.Период КАК Период,
		|	ФинансовыеПоказатели.Регистратор КАК Регистратор,
		|	ФинансовыеПоказатели.Организация КАК Организация,
		|	ФинансовыеПоказатели.СубъектАналитики КАК СубъектАналитики,
		|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
		|	ФинансовыеПоказатели.Значение - ЕСТЬNULL(СуммаАктивовДляИсключения.Сумма, 0) КАК Значение,
		|	ФинансовыеПоказатели.Значение КАК СЧА,
		|	ЕСТЬNULL(СуммаАктивовДляИсключения.Сумма, 0) КАК СЧАИсключаемыхАктивов,
		|	ВЫБОР
		|		КОГДА ФинансовыеПоказатели.Период < &ДатаСЧАОкончания
		|			ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1), &ДатаОкончания, ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, -1), &ДатаОкончания, ДЕНЬ)
		|	КОНЕЦ КАК КоличествоДнейВПериоде
		|ПОМЕСТИТЬ _ФинансовыеПоказатели
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СуммвАктивовДляИсключения.Период КАК Период,
		|			СУММА(_СуммвАктивовДляИсключения.Сумма) КАК Сумма
		|		ИЗ
		|			_СуммаАктивовДляИсключения КАК _СуммвАктивовДляИсключения
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СуммвАктивовДляИсключения.Период) КАК СуммаАктивовДляИсключения
		|		ПО ФинансовыеПоказатели.Период = СуммаАктивовДляИсключения.Период
		|ГДЕ
		|	ФинансовыеПоказатели.Активность
		|	И ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.Период В (&ДатаСЧАНачала, &ДатаСЧАОкончания)
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивов.Дата КАК Дата,
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(СтоимостьАктивов.Дата, ДЕНЬ, -1), &ДатаОкончания, ДЕНЬ) КАК КоличествоДнейВПериоде,
		|	СУММА(СтоимостьАктивов.Сумма) КАК СтоимостьПортфеля,
		|	СУММА(СтоимостьАктивов.ЗадолженностьПоНДФЛ) КАК ЗадолженностьПоНДФЛ
		|ПОМЕСТИТЬ _СтоимостьПортфеля
		|ИЗ
		|	(ВЫБРАТЬ
		|		&ДатаНачала КАК Дата,
		|		ВЫБОР
		|			КОГДА &ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|				ТОГДА ФинансовыеПоказатели.Значение
		|			ИНАЧЕ ФинансовыеПоказатели.Значение / КурсыВалют.Курс * КурсыВалют.Кратность
		|		КОНЕЦ КАК Сумма,
		|		0 КАК ЗадолженностьПоНДФЛ
		|	ИЗ
		|		_ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (КурсыВалют.Валюта = &ВалютаРасчета)
		|				И (КурсыВалют.Период = &ДатаНачала)
		|	ГДЕ
		|		ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|		И ФинансовыеПоказатели.Организация = &Организация
		|		И ФинансовыеПоказатели.Период = &ДатаСЧАНачала
		|		И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&ДатаНачала,
		|		0,
		|		0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&ДатаОкончания,
		|		0,
		|		0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&ДатаОкончания,
		|		ВЫБОР
		|			КОГДА &ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|				ТОГДА ФинансовыеПоказатели.Значение
		|			ИНАЧЕ ФинансовыеПоказатели.Значение / КурсыВалют.Курс * КурсыВалют.Кратность
		|		КОНЕЦ,
		|		0
		|	ИЗ
		|		_ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (КурсыВалют.Валюта = &ВалютаРасчета)
		|				И (КурсыВалют.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|	ГДЕ
		|		ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|		И ФинансовыеПоказатели.Организация = &Организация
		|		И ФинансовыеПоказатели.Период = &ДатаСЧАОкончания
		|		И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата,
		|		-_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Сумма,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Сумма
		|	ИЗ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА КАК _ЗадолженностьПоНДФЛНеучтеннаяВСЧА
		|	ГДЕ
		|		&ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте.Дата,
		|		-_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте.Сумма,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте.Сумма
		|	ИЗ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте КАК _ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте
		|	ГДЕ
		|		НЕ &ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК СтоимостьАктивов
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивов.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ""Ввод актива""
		|		КОГДА ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ""Вывод актива""
		|	КОНЕЦ КАК Комментарий,
		|	ВводыВыводы.Активность КАК Активность,
		|	ВводыВыводы.Период КАК Период,
		|	ВводыВыводы.Регистратор КАК Регистратор,
		|	ВводыВыводы.Организация КАК Организация,
		|	ВводыВыводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводыВыводы.НаправлениеДвижения КАК НаправлениеДвижения,
		|	ВводыВыводы.ВидАктива КАК ВидАктива,
		|	ВводыВыводы.ВидОперацииВводаВыводаДС КАК ВидОперацииВводаВыводаДС,
		|	ВводыВыводы.БалансоваяСтоимость КАК БалансоваяСтоимость,
		|	ВводыВыводы.РыночнаяСтоимость КАК РыночнаяСтоимость,
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ВводыВыводы.Период, ДЕНЬ, -1), &ДатаОкончания, ДЕНЬ) КАК КоличествоДнейВПериоде
		|ПОМЕСТИТЬ _ВводыВыводыАктивовВВалютеУчета
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводы
		|ГДЕ
		|	ВводыВыводы.Активность
		|	И ВводыВыводы.Организация = &Организация
		|	И ВводыВыводы.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъединенныеДанные.ВидДвиженияДенежныхСредств,
		|	ОбъединенныеДанные.Активность,
		|	ОбъединенныеДанные.Период,
		|	ОбъединенныеДанные.Регистратор,
		|	ОбъединенныеДанные.Организация,
		|	ОбъединенныеДанные.СчетДоверительногоУправления,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги),
		|	ОбъединенныеДанные.ВидОперацииВводаВыводаДС,
		|	СУММА(ОбъединенныеДанные.БалансоваяСтоимость),
		|	СУММА(ОбъединенныеДанные.РыночнаяСтоимость),
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ОбъединенныеДанные.Период, ДЕНЬ, -1), &ДатаОкончания, ДЕНЬ)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиДенежныхСредств.Активность КАК Активность,
		|		ОстаткиДенежныхСредств.Период КАК Период,
		|		ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
		|		ОстаткиДенежныхСредств.Организация КАК Организация,
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
		|		ВЫБОР ОстаткиДенежныхСредств.ВидДвижения
		|			КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление)
		|			КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению)
		|		КОНЕЦ КАК ВидОперацииВводаВыводаДС,
		|		СУММА(ОстаткиДенежныхСредств.Сумма * ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ) КАК БалансоваяСтоимость,
		|		СУММА(ОстаткиДенежныхСредств.Сумма * ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ) КАК РыночнаяСтоимость
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ПО ОстаткиДенежныхСредств.Организация = ОплатаОснования.Ссылка.Организация
		|				И ОстаткиДенежныхСредств.СчетДоверительногоУправления = ОплатаОснования.Ссылка.СчетДоверительногоУправления
		|				И ОстаткиДенежныхСредств.Регистратор = ОплатаОснования.Ссылка
		|				И (ОплатаОснования.НомерСтроки = 1)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумаг
		|			ПО (ОплатаОснования.Ссылка.Организация = ВводЦенныхБумаг.Ссылка.Организация)
		|				И (ОплатаОснования.Ссылка.СчетДоверительногоУправления = ВводЦенныхБумаг.Ссылка.СчетДоверительногоУправления)
		|				И (ОплатаОснования.Основание = ВводЦенныхБумаг.Ссылка)
		|				И (ВводЦенныхБумаг.НомерСтроки = 1)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделке
		|			ПО (ОплатаОснования.Ссылка.Организация = ИсполнениеОбязательствПоСделке.Ссылка.Организация)
		|				И (ОплатаОснования.Ссылка.СчетДоверительногоУправления = ИсполнениеОбязательствПоСделке.Ссылка.СчетДоверительногоУправления)
		|				И (ОплатаОснования.Основание = ИсполнениеОбязательствПоСделке.Ссылка)
		|				И (ИсполнениеОбязательствПоСделке.НомерСтроки = 1)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
		|			ПО (ОплатаОснования.Ссылка.Организация = НачислениеДивидендов.Организация)
		|				И (ОплатаОснования.Ссылка.СчетДоверительногоУправления = НачислениеДивидендов.СчетДоверительногоУправления)
		|				И (ОплатаОснования.Основание = НачислениеДивидендов.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеКупона КАК ПогашениеКупона
		|			ПО (ОплатаОснования.Ссылка.Организация = ПогашениеКупона.Организация)
		|				И (ОплатаОснования.Ссылка.СчетДоверительногоУправления = ПогашениеКупона.СчетДоверительногоУправления)
		|				И (ОплатаОснования.Основание = ПогашениеКупона.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|			ПО (ОплатаОснования.Ссылка.Организация = ПогашениеЦеннойБумаги.Организация)
		|				И (ОплатаОснования.Ссылка.СчетДоверительногоУправления = ПогашениеЦеннойБумаги.СчетДоверительногоУправления)
		|				И (ОплатаОснования.Основание = ПогашениеЦеннойБумаги.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК Сделка
		|			ПО (ОплатаОснования.Ссылка.Организация = Сделка.Ссылка.Организация)
		|				И (ОплатаОснования.Ссылка.СчетДоверительногоУправления = Сделка.Ссылка.СчетДоверительногоУправления)
		|				И (ОплатаОснования.Основание = Сделка.Ссылка)
		|				И (Сделка.НомерСтроки = 1)
		|	ГДЕ
		|		&ИсключитьАктивыИзРасчетаДоходности
		|		И ОстаткиДенежныхСредств.Активность
		|		И ОстаткиДенежныхСредств.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И ВЫБОР ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор)
		|				КОГДА ТИП(Документ.Оплата)
		|					ТОГДА ВЫБОР ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание)
		|							КОГДА ТИП(Документ.ПогашениеКупона)
		|								ТОГДА ПогашениеКупона.Облигация
		|							КОГДА ТИП(Документ.Сделка)
		|								ТОГДА Сделка.ЦеннаяБумага
		|							КОГДА ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|								ТОГДА ИсполнениеОбязательствПоСделке.ЦеннаяБумага
		|							КОГДА ТИП(Документ.ВводЦенныхБумаг)
		|								ТОГДА ВводЦенныхБумаг.ЦеннаяБумага
		|							КОГДА ТИП(Документ.НачислениеДивидендов)
		|								ТОГДА НачислениеДивидендов.ЦеннаяБумага
		|							КОГДА ТИП(Документ.ПогашениеЦеннойБумаги)
		|								ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага
		|							ИНАЧЕ NULL
		|						КОНЕЦ
		|			КОНЕЦ В (&СписокАктивовДляИсключенияИзРасчетаДоходности)
		|		И ОстаткиДенежныхСредств.Организация = &Организация
		|		И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюИпотечногоСертификатаУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОстаткиДенежныхСредств.Активность,
		|		ОстаткиДенежныхСредств.Период,
		|		ОстаткиДенежныхСредств.Регистратор,
		|		ОстаткиДенежныхСредств.Организация,
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств,
		|		ОстаткиДенежныхСредств.ВидДвижения
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиДенежныхСредств.Активность,
		|		ОстаткиДенежныхСредств.Период,
		|		ОстаткиДенежныхСредств.Регистратор,
		|		ОстаткиДенежныхСредств.Организация,
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств,
		|		ВЫБОР ОстаткиДенежныхСредств.ВидДвижения
		|			КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление)
		|			КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению)
		|		КОНЕЦ,
		|		СУММА(ОстаткиДенежныхСредств.Сумма * ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ),
		|		СУММА(ОстаткиДенежныхСредств.Сумма * ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ)
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ПО ОстаткиДенежныхСредств.Организация = СделкаЦенныеБумаги.Ссылка.Организация
		|				И ОстаткиДенежныхСредств.СчетДоверительногоУправления = СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления
		|				И ОстаткиДенежныхСредств.Регистратор = СделкаЦенныеБумаги.Ссылка
		|				И (СделкаЦенныеБумаги.НомерСтроки = 1)
		|	ГДЕ
		|		&ИсключитьАктивыИзРасчетаДоходности
		|		И ОстаткиДенежныхСредств.Активность
		|		И ОстаткиДенежныхСредств.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И ОстаткиДенежныхСредств.Организация = &Организация
		|		И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюИпотечногоСертификатаУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|		И СделкаЦенныеБумаги.ЦеннаяБумага В(&СписокАктивовДляИсключенияИзРасчетаДоходности)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОстаткиДенежныхСредств.Активность,
		|		ОстаткиДенежныхСредств.Период,
		|		ОстаткиДенежныхСредств.Регистратор,
		|		ОстаткиДенежныхСредств.Организация,
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств,
		|		ОстаткиДенежныхСредств.ВидДвижения
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиДенежныхСредств.Активность,
		|		ОстаткиДенежныхСредств.Период,
		|		ОстаткиДенежныхСредств.Регистратор,
		|		ОстаткиДенежныхСредств.Организация,
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств,
		|		ВЫБОР ОстаткиДенежныхСредств.ВидДвижения
		|			КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление)
		|			КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению)
		|		КОНЕЦ,
		|		СУММА(ОстаткиДенежныхСредств.Сумма * ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ),
		|		СУММА(ОстаткиДенежныхСредств.Сумма * ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ)
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|			ПО ОстаткиДенежныхСредств.Организация = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Организация
		|				И ОстаткиДенежныхСредств.СчетДоверительногоУправления = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.СчетДоверительногоУправления
		|				И ОстаткиДенежныхСредств.Регистратор = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|				И (ИсполнениеОбязательствПоСделкеЦенныеБумаги.НомерСтроки = 1)
		|	ГДЕ
		|		&ИсключитьАктивыИзРасчетаДоходности
		|		И ОстаткиДенежныхСредств.Активность
		|		И ОстаткиДенежныхСредств.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И ОстаткиДенежныхСредств.Организация = &Организация
		|		И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюИпотечногоСертификатаУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|		И ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага В(&СписокАктивовДляИсключенияИзРасчетаДоходности)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОстаткиДенежныхСредств.Активность,
		|		ОстаткиДенежныхСредств.Период,
		|		ОстаткиДенежныхСредств.Регистратор,
		|		ОстаткиДенежныхСредств.Организация,
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств,
		|		ОстаткиДенежныхСредств.ВидДвижения) КАК ОбъединенныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъединенныеДанные.Активность,
		|	ОбъединенныеДанные.Период,
		|	ОбъединенныеДанные.Регистратор,
		|	ОбъединенныеДанные.Организация,
		|	ОбъединенныеДанные.СчетДоверительногоУправления,
		|	ОбъединенныеДанные.ВидОперацииВводаВыводаДС,
		|	ОбъединенныеДанные.ВидДвиженияДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводы.Период КАК Период,
		|	ВводыВыводы.Регистратор КАК Операция,
		|	ВводыВыводы.Организация.ВалютаУчета КАК Валюта,
		|	ВЫБОР
		|		КОГДА &ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА ВводыВыводы.РыночнаяСтоимость
		|		ИНАЧЕ ВводыВыводы.РыночнаяСтоимость / КурсыВалют.Курс * КурсыВалют.Кратность
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА ВводыВыводы.РыночнаяСтоимость
		|		ИНАЧЕ ВводыВыводы.РыночнаяСтоимость / КурсыВалют.Курс * КурсыВалют.Кратность
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВводов,
		|	ВЫБОР
		|		КОГДА &ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА ВводыВыводы.РыночнаяСтоимость
		|		ИНАЧЕ ВводыВыводы.РыночнаяСтоимость / КурсыВалют.Курс * КурсыВалют.Кратность
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА -1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВыводов,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВводыВыводы.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ), ДЕНЬ) + 1 КАК ДнейВУправлении,
		|	ВводыВыводы.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	_ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Валюта = &ВалютаРасчета)
		|			И (КурсыВалют.Период = НАЧАЛОПЕРИОДА(ВводыВыводы.Период, ДЕНЬ))
		|ГДЕ
		|	ВводыВыводы.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВводыВыводы.Организация = &Организация
		|	И ВводыВыводы.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводы.ВидОперацииВводаВыводаДС В(&МассивВидыОпераций)
		|	И ВводыВыводы.Активность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СтоимостьПортфеляНаНачало.СтоимостьПортфеля КАК СтоимостьАктивовНаНачало,
		|	_СтоимостьПортфеляНаНачало.ЗадолженностьПоНДФЛ КАК ЗадолженностьПоНДФЛНаНачало,
		|	_СтоимостьПортфеляНаКонец.СтоимостьПортфеля КАК СтоимостьАктивовНаКонец,
		|	_СтоимостьПортфеляНаКонец.ЗадолженностьПоНДФЛ КАК ЗадолженностьПоНДФЛНаКонец,
		|	_СтоимостьПортфеляНаНачало.КоличествоДнейВПериоде КАК КоличествоДнейВПериоде,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания,
		|	ЕСТЬNULL(ВводыВыводыИтог.Сумма, 0) КАК СуммаОпераций,
		|	ЕСТЬNULL(ВводыВыводыИтог.СуммаВводов, 0) КАК СуммаВводов,
		|	ЕСТЬNULL(ВводыВыводыИтог.СуммаВыводов, 0) КАК СуммаВыводов,
		|	ЕСТЬNULL(ВводыВыводыИтог.СуммаВУправлении, 0) КАК СуммаВУправлении,
		|	_СтоимостьПортфеляНаКонец.СтоимостьПортфеля - _СтоимостьПортфеляНаНачало.СтоимостьПортфеля - ЕСТЬNULL(ВводыВыводыИтог.Сумма, 0) КАК ФинансовыйРезультат,
		|	ВЫБОР
		|		КОГДА _СтоимостьПортфеляНаНачало.СтоимостьПортфеля * _СтоимостьПортфеляНаНачало.КоличествоДнейВПериоде + ЕСТЬNULL(ВводыВыводыИтог.СуммаВУправлении, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ (_СтоимостьПортфеляНаКонец.СтоимостьПортфеля - _СтоимостьПортфеляНаНачало.СтоимостьПортфеля - ЕСТЬNULL(ВводыВыводыИтог.Сумма, 0)) * ДЕНЬГОДА(КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД)) * 100 / (_СтоимостьПортфеляНаНачало.СтоимостьПортфеля * _СтоимостьПортфеляНаНачало.КоличествоДнейВПериоде + ЕСТЬNULL(ВводыВыводыИтог.СуммаВУправлении, 0))
		|	КОНЕЦ КАК Доходность,
		|	ВЫБОР
		|		КОГДА _СтоимостьПортфеляНаНачало.СтоимостьПортфеля * _СтоимостьПортфеляНаНачало.КоличествоДнейВПериоде + ЕСТЬNULL(ВводыВыводыИтог.СуммаВУправлении, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ (_СтоимостьПортфеляНаКонец.СтоимостьПортфеля - _СтоимостьПортфеляНаНачало.СтоимостьПортфеля - ЕСТЬNULL(ВводыВыводыИтог.Сумма, 0) + ЕСТЬNULL(_ПоказателиУвеличивающиеЭффективнуюДоходность.СуммаПоказателей, 0)) * ДЕНЬГОДА(КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД)) * 100 / (_СтоимостьПортфеляНаНачало.СтоимостьПортфеля * _СтоимостьПортфеляНаНачало.КоличествоДнейВПериоде + ЕСТЬNULL(ВводыВыводыИтог.СуммаВУправлении, 0))
		|	КОНЕЦ КАК ЭффективнаяДоходность
		|ИЗ
		|	_СтоимостьПортфеля КАК _СтоимостьПортфеляНаНачало
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПортфеля КАК _СтоимостьПортфеляНаКонец
		|		ПО (_СтоимостьПортфеляНаКонец.Дата = &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(_ВводыВыводы.Сумма) КАК Сумма,
		|			СУММА(_ВводыВыводы.СуммаВводов) КАК СуммаВводов,
		|			СУММА(_ВводыВыводы.СуммаВыводов) КАК СуммаВыводов,
		|			СУММА(_ВводыВыводы.Сумма * _ВводыВыводы.ДнейВУправлении) КАК СуммаВУправлении
		|		ИЗ
		|			_ВводыВыводы КАК _ВводыВыводы) КАК ВводыВыводыИтог
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоказателиУвеличивающиеЭффективнуюДоходность КАК _ПоказателиУвеличивающиеЭффективнуюДоходность
		|		ПО (ИСТИНА)
		|ГДЕ
		|	_СтоимостьПортфеляНаНачало.Дата = &ДатаНачала";
#КонецОбласти

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ВводыВыводы = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ВводыВыводы").ПолучитьДанные().Выгрузить();
	ВводыВыводы.Сортировать("Период");
	
	ФинансовыеПоказатели = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ФинансовыеПоказатели").ПолучитьДанные().Выгрузить();
	ФинансовыеПоказатели.Сортировать("Период");
	
	СуммаАктивовДляИсключения = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СуммаАктивовДляИсключения").ПолучитьДанные().Выгрузить();
	СуммаАктивовДляИсключения.Сортировать("Период");
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.ВалютаРасчета) Тогда
		Для Каждого СтрокаВводыВыводы Из ВводыВыводы Цикл
			Если СтрокаВводыВыводы.Сумма = Null Тогда
				ЗарегистрироватьОшибку(СтрШаблон("Расчет показателя %1 по счету %2 невозможен, т.к. на дату операции (%3) не загружен курс валюты %4!", ПараметрыРасчета.Показатель, ПараметрыРасчета.СчетДоверительногоУправления, Формат(СтрокаВводыВыводы.Период, "ДЛФ=DD"), ПараметрыРасчета.ВалютаРасчета), ПараметрыРасчета.МассивОшибок, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыРасчета.Свойство("РасшифровкаРасчета") И ПараметрыРасчета.РасшифровкаРасчета Тогда
	
		ДеталиРасчета = Новый Структура;
		
		ДеталиРасчета.Вставить("СчетДоверительногоУправления", 	Выборка.СчетДоверительногоУправления);
		ДеталиРасчета.Вставить("КоличествоДнейВПериоде", 		Выборка.КоличествоДнейВПериоде);
		ДеталиРасчета.Вставить("СтоимостьАктивовНаКонец", 		Выборка.СтоимостьАктивовНаКонец);
		ДеталиРасчета.Вставить("СтоимостьАктивовНаНачало", 		Выборка.СтоимостьАктивовНаНачало);
		ДеталиРасчета.Вставить("ЗадолженностьПоНДФЛНаКонец", 	Выборка.ЗадолженностьПоНДФЛНаКонец);
		ДеталиРасчета.Вставить("ЗадолженностьПоНДФЛНаНачало", 	Выборка.ЗадолженностьПоНДФЛНаНачало);
		ДеталиРасчета.Вставить("ДатаНачала", 					Выборка.ДатаНачала);
		ДеталиРасчета.Вставить("ДатаОкончания", 				Выборка.ДатаОкончания);
		ДеталиРасчета.Вставить("СуммаОпераций", 				Выборка.СуммаОпераций);
		ДеталиРасчета.Вставить("СуммаВводов", 					Выборка.СуммаВводов);
		ДеталиРасчета.Вставить("СуммаВыводов", 					Выборка.СуммаВыводов);
		ДеталиРасчета.Вставить("СуммаВУправлении", 				Выборка.СуммаВУправлении);
		ДеталиРасчета.Вставить("ФинансовыйРезультат",			Выборка.ФинансовыйРезультат);
		ДеталиРасчета.Вставить("Доходность", 					Выборка.Доходность);
		ДеталиРасчета.Вставить("ЭффективнаяДоходность", 		Выборка.ЭффективнаяДоходность);
		
		ДеталиРасчета.Вставить("Операции", 						ВводыВыводы);
		ДеталиРасчета.Вставить("ФинансовыеПоказатели", 			ФинансовыеПоказатели);
		ДеталиРасчета.Вставить("СуммаАктивовДляИсключения", 	СуммаАктивовДляИсключения);
		
	Иначе
		
		ДеталиРасчета = Новый Соответствие;
		ДеталиРасчета.Вставить(ПараметрыРасчета.Показатель, Выборка.Доходность);

	КонецЕсли; 	
	
	Возврат ДеталиРасчета;
	
КонецФункции

Процедура ЗаполнитьДатыСЧАДляРасчетаДоходности(Запрос, ПараметрыРасчета, Отказ) Экспорт
	
#Область ПараметрыЗапроса
	Если НЕ Запрос.Параметры.Свойство("МассивВидыОпераций") Тогда
		Запрос.УстановитьПараметр("МассивВидыОпераций",				ПолучитьМассивВидыОперацийДляРасчетаДоходности());
		Запрос.УстановитьПараметр("Организация",					ПараметрыРасчета.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ПараметрыРасчета.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ДатаНачала",						ПараметрыРасчета.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания",					КонецДня(ПараметрыРасчета.ДатаОкончания));
	КонецЕсли;	
	
#КонецОбласти
	
#Область ДатаПервогоВвода
	РасчетСНачалаУправления = Ложь;

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НАЧАЛОПЕРИОДА(ВводыВыводы.Период, ДЕНЬ) КАК ДатаПервогоВвода
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводы
		|ГДЕ
		|	ВводыВыводы.Организация = &Организация
		|	И ВводыВыводы.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|	И ВводыВыводы.ВидОперацииВводаВыводаДС В(&МассивВидыОпераций)
		|	И ВводыВыводы.Активность
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПервогоВвода";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ДатаПервогоВвода >= ПараметрыРасчета.ДатаНачала Тогда
			ПараметрыРасчета.Вставить("ДатаНачала", Выборка.ДатаПервогоВвода);
			Запрос.УстановитьПараметр("ДатаНачала", Выборка.ДатаПервогоВвода);
			РасчетСНачалаУправления = Истина;
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(ПараметрыРасчета.ДатаНачала) Тогда	
		Возврат;
	Иначе
		ЗарегистрироватьОшибку(СтрШаблон("Расчет показателя %1 по счету %2 невозможен, т.к. нет ни одного ввода!", ПараметрыРасчета.Показатель, ПараметрыРасчета.СчетДоверительногоУправления), ПараметрыРасчета.МассивОшибок, Отказ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РасчетСНачалаУправления", РасчетСНачалаУправления);
	
#КонецОбласти
	
#Область ДатыСЧА 
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Периоды.ДатаПериода КАК ДатаПериода,
		|	МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаСЧА
		|ИЗ
		|	(ВЫБРАТЬ
		|		Даты.ДатаПериода КАК ДатаПериода,
		|		МАКСИМУМ(ДанныеКалендаря.Дата) КАК ДатаНачала,
		|		Даты.ДатаОкончания КАК ДатаОкончания
		|	ИЗ
		|		(ВЫБРАТЬ
		|			&ДатаНачала КАК ДатаПериода,
		|			ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1) КАК ДатаОкончания
		|		ГДЕ
		|			НЕ &РасчетСНачалаУправления
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			&ДатаОкончания,
		|			&ДатаОкончания) КАК Даты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|			ПО (ДанныеКалендаря.Дата <= Даты.ДатаОкончания)
		|				И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Даты.ДатаПериода,
		|		Даты.ДатаОкончания) КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления)
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ФинансовыеПоказатели.Период МЕЖДУ Периоды.ДатаНачала И Периоды.ДатаОкончания)
		|
		|СГРУППИРОВАТЬ ПО
		|	Периоды.ДатаПериода";
	
	ДатыСЧА = Запрос.Выполнить().Выгрузить();
	ДатыСЧА.Сортировать("ДатаПериода");
	
	Если РасчетСНачалаУправления Тогда
		ДатаСЧАНачала		= Неопределено;
		ДатаСЧАОкончания	= ДатыСЧА[0].ДатаСЧА;
	Иначе
		ДатаСЧАНачала		= ДатыСЧА[0].ДатаСЧА;
		ДатаСЧАОкончания	= ДатыСЧА[1].ДатаСЧА;
		
		Если НЕ ЗначениеЗаполнено(ДатаСЧАНачала) Тогда
			ЗарегистрироватьОшибку(СтрШаблон("Расчет показателя %1 по счету %2 невозможен, т.к. стоимость портфеля на %3 не зарегистрирована!", ПараметрыРасчета.Показатель, ПараметрыРасчета.СчетДоверительногоУправления, Формат(НачалоДня(ПараметрыРасчета.ДатаНачала) - 1, "ДЛФ=DD")), ПараметрыРасчета.МассивОшибок, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСЧАОкончания) Тогда
		ЗарегистрироватьОшибку(СтрШаблон("Расчет показателя %1 по счету %2 невозможен, т.к. стоимость портфеля на %3 не зарегистрирована!", ПараметрыРасчета.Показатель, ПараметрыРасчета.СчетДоверительногоУправления, Формат(ПараметрыРасчета.ДатаОкончания, "ДЛФ=DD")), ПараметрыРасчета.МассивОшибок, Отказ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаСЧАНачала",		ДатаСЧАНачала);
	Запрос.УстановитьПараметр("ДатаСЧАОкончания",	ДатаСЧАОкончания);
	
	ПараметрыРасчета.Вставить("ДатаСЧАНачала",		ДатаСЧАНачала);
	ПараметрыРасчета.Вставить("ДатаСЧАОкончания",	ДатаСЧАОкончания);

#КонецОбласти	
	
КонецПроцедуры

Функция ПолучитьМассивВидыОперацийДляРасчетаДоходности() 
	
	МассивВидыОпераций = Новый Массив;
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствСПереводомВсехАктивовНаДругойИИС);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДляОбеспеченияИОУД);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводУчредителюДоходаПолученногоОтРазмещения);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствИспользованныхДляСобственныхСделок);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыделениеДенежныхСредствДляСобственныхСделок);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику);
	МассивВидыОпераций.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПустаяСсылка());
	
	Возврат МассивВидыОпераций;
	
КонецФункции

Функция ТребуетсяРегистрацияФинансовыхПоказателейДоходности(Организация, Дата) Экспорт
	
	ДатаНачалаРасчетаДоходности = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "ДатаНачалаРасчетаДоходности", Организация);
	
	Возврат (ЗначениеЗаполнено(ДатаНачалаРасчетаДоходности) И Дата >= ДатаНачалаРасчетаДоходности);

КонецФункции

// Помещает таблицы для расчета доходности в источник временных таблиц, используемые для расчёта доходности по методу начисления НДФЛ
//
// Параметры
//	ИсточникВременныхТаблиц	- Запрос, МенеджерВременныхТаблиц	- источник временных таблиц
//	Организация				- СправочникСсылка.Организации		- Отбор по ораганизации
//	Период					- Дата								- Дата на которую расчитывается доходность
//	ИмяОтбора				- Строка							- Имя отбора по которому будут отобраны счета ДУ, в порядке приоритета работает только один отбор
//																"СчетаДоверительногоУправления" - отбор по списку счетов ДУ
//																"СтратегииИндивидуальногоИнвестирования" - отбор по стратегии в которую входят счета ДУ
//																"ВидыДоговоровДоверительногоУправления" - отбор по видам договоров
//																"" - без отбора
//	ЗначениеОтбора			- СправочникСсылка.СчетаДоверительногоУправления,СправочникСсылка.СтратегииИндивидуальногоИнвестирования,ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления,СписокЗначений,Массив	- элемент или массив элемнтов по которым будет работать отбор с учётом имени отбора
//	ДополнительныеПараметры - Структура - ВидВалюты -	"ВалютаУчета" - расчёт доходности в валюте учёта, "ВалютаЦелиРасчета" - расчёт доходности в валюте цели расчёта, если она цель зарегистрирована, иначе в валюте учёта. Необязательно, по умолчанию "ВалютаУчета"
//							-			- УчитыватьНДФЛПоНачислению - Булево, если Ложь в запрос помещаются пустые таблицы с задолженностью. Необязательно, по умолчанию ЛОЖЬ.
//							-			- ДатаСЧАНачала - Дата, неопределено - передаётся если дата начальное СЧА определена заранее, иначе запрос поместит даты СЧА в _ДатыСЧА. Необязательно.
//							-			- ДатаСЧАОкончания - Дата, неопределено - передаётся если дата конечное СЧА определена заранее, иначе запрос поместит даты СЧА в _ДатыСЧА. Необязательно.
Процедура ПоместитьТаблицыДляРасчетаДоходностиУправленияВМенеджерВременныхТаблиц(ИсточникВременныхТаблиц, Организация, Период, ИмяОтбора, ЗначениеОтбора, ДополнительныеПараметры) Экспорт
	
	МенеджерВременныхТаблиц = СистемныеФункции.МенеджерВременныхТаблицИзИсточникаВременныхТаблиц(ИсточникВременныхТаблиц);
	
	МассивИменВременныхТаблиц = СистемныеФункции.ПолучитьИменаВременныхТаблицЗапроса(МенеджерВременныхТаблиц);
	МассивИменВременныхТаблиц.Добавить("_ДатыСЧА");
	МассивИменВременныхТаблиц.Добавить("_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте");
	МассивИменВременныхТаблиц.Добавить("_ЗадолженностьПоНДФЛНеучтеннаяВСЧА");
	МассивИменВременныхТаблиц.Добавить("_ПоказателиУвеличивающиеЭффективнуюДоходностьПодробно");
	МассивИменВременныхТаблиц.Добавить("_ПоказателиУвеличивающиеЭффективнуюДоходность");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаНачала",		Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ИмяОтбора",		ИмяОтбора);
	Запрос.УстановитьПараметр("ЗначениеОтбора", ЗначениеОтбора);
	
	Если ДополнительныеПараметры.Свойство("ВалютаРасчета") И ЗначениеЗаполнено(ДополнительныеПараметры.ВалютаРасчета) Тогда
		Запрос.УстановитьПараметр("ВидВалюты", 		"ВалютаРасчета");	
		Запрос.УстановитьПараметр("ВалютаРасчета",	ДополнительныеПараметры.ВалютаРасчета);
		
	Иначе 
		Запрос.УстановитьПараметр("ВидВалюты",		?(ДополнительныеПараметры.Свойство("ВидВалюты"), ДополнительныеПараметры.ВидВалюты, "ВалютаУчета"));
		Запрос.УстановитьПараметр("ВалютаРасчета",	Неопределено);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("УчитыватьНДФЛПоНачислению",	ДополнительныеПараметры.Свойство("УчитыватьНДФЛПоНачислению") И ДополнительныеПараметры.УчитыватьНДФЛПоНачислению);
	
#Область ПОМЕСТИТЬ_СчетаДоверительногоУправления
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА &ВидВалюты = ""ВалютаРасчета""
		|			ТОГДА &ВалютаРасчета
		|		КОГДА &ВидВалюты = ""ВалютаУчета""
		|				ИЛИ ИнвестиционныеПрофилиСрезПоследних.Цель.Валюта ЕСТЬ NULL
		|			ТОГДА Организации.ВалютаУчета
		|		КОГДА &ВидВалюты = ""ВалютаЦелиРасчета""
		|			ТОГДА ИнвестиционныеПрофилиСрезПоследних.Цель.Валюта
		|	КОНЕЦ КАК Валюта,
		|	ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок) КАК ВидПоказателя
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО СчетаДоверительногоУправления.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеПрофили.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК ИнвестиционныеПрофилиСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = ИнвестиционныеПрофилиСрезПоследних.СубъектУчета
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД))
		|	И ВЫБОР
		|			КОГДА &ИмяОтбора = ""СчетаДоверительногоУправления""
		|				ТОГДА СчетаДоверительногоУправления.Ссылка В (&ЗначениеОтбора)
		|			КОГДА &ИмяОтбора = ""ВидыДоговоровДоверительногоУправления""
		|				ТОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ЗначениеОтбора)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.Выполнить();
	
#КонецОбласти	

#Область ПОМЕСТИТЬ_ДатыСЧА
	Если ДополнительныеПараметры.Свойство("ДатаСЧАНачала") Тогда
		
		Запрос.УстановитьПараметр("ДатаСЧАНачала",		ДополнительныеПараметры.ДатаСЧАНачала);
		Запрос.УстановитьПараметр("ДатаСЧАОкончания",	ДополнительныеПараметры.ДатаСЧАОкончания);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СчетаДоверительногоУправления.ВидПоказателя КАК ВидПоказателя,
			|	ДатыСЧА.Дата КАК Дата,
			|	ДатыСЧА.ДатаСЧА КАК ДатаСЧА
			|ПОМЕСТИТЬ _ДатыСЧА
			|ИЗ
			|	(ВЫБРАТЬ
			|		&ДатаНачала КАК Дата,
			|		&ДатаСЧАНачала КАК ДатаСЧА
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		&ДатаОкончания,
			|		&ДатаСЧАОкончания) КАК ДатыСЧА,
			|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления";

		
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&ДатаНачала КАК Дата,
			|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК ДатаНачала,
			|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1) КАК ДатаОкончания
			|ПОМЕСТИТЬ _РабочиеДни
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Дата < &ДатаНачала
			|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ДатаОкончания,
			|	МАКСИМУМ(ДанныеКалендаря.Дата),
			|	&ДатаОкончания
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Дата <= &ДатаОкончания
			|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_РабочиеДни.Дата КАК Дата,
			|	_СчетаДоверительногоУправления.ВидПоказателя КАК ВидПоказателя,
			|	МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаСЧА
			|ПОМЕСТИТЬ _ДатыСЧА
			|ИЗ
			|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _РабочиеДни КАК _РабочиеДни
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|		ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
			|			И (ФинансовыеПоказатели.ВидПоказателя = _СчетаДоверительногоУправления.ВидПоказателя)
			|			И (ФинансовыеПоказатели.Период МЕЖДУ _РабочиеДни.ДатаНачала И _РабочиеДни.ДатаОкончания)
			|
			|СГРУППИРОВАТЬ ПО
			|	_СчетаДоверительногоУправления.СчетДоверительногоУправления,
			|	_РабочиеДни.Дата,
			|	_СчетаДоверительногоУправления.ВидПоказателя";
	КонецЕсли;
	
	Запрос.Выполнить();
#КонецОбласти	

#Область ПОМЕСТИТЬ_ЗадолженностьПоНДФЛНеучтеннаяВСЧА_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Период КАК Дата,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход КАК Сумма
		|ПОМЕСТИТЬ _ОплатаЗадолженности
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&ДатаНачала,
		|			,
		|			День,
		|			&УчитыватьНДФЛПоНачислению
		|				И (Организация, СчетДоверительногоУправления, ТипЗадолженности) В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.Организация КАК Организация,
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|						ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская) КАК ТипЗадолженности
		|					ИЗ
		|						_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)
		|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата КАК Дата,
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание КАК Основание,
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание.Дата КАК ДатаНачисления,
		|	СУММА(ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _ЗадолженностьПоНДФЛНеучтеннаяВСЧА
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		&ДатаНачала КАК Дата,
		|		ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|		ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&ДатаНачала,
		|				(Организация, СчетДоверительногоУправления, ТипЗадолженности) В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.Организация КАК Организация,
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|							ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская) КАК ТипЗадолженности
		|						ИЗ
		|							_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)
		|					И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления,
		|		&ДатаОкончания,
		|		ЗадолженностиПоДенежнымСредствамОстатки.Основание,
		|		ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&ДатаОкончания,
		|				(Организация, СчетДоверительногоУправления, ТипЗадолженности) В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.Организация КАК Организация,
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|							ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская) КАК ТипЗадолженности
		|						ИЗ
		|							_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)
		|					И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ДатыСЧА.СчетДоверительногоУправления,
		|		_ДатыСЧА.Дата,
		|		СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание,
		|		СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|	ИЗ
		|		_ДатыСЧА КАК _ДатыСЧА
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|			ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = _ДатыСЧА.ДатаСЧА)
		|				И _ДатыСЧА.СчетДоверительногоУправления = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|				И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация)
		|				И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
		|				И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ)))) КАК ЗадолженностьПоНДФЛНеучтеннаяВСЧА
		|ГДЕ
		|	&УчитыватьНДФЛПоНачислению
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.СчетДоверительногоУправления,
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата,
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание,
		|	ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.ДатаЗадолженности КАК Дата,
		|	СУММА(_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.Сумма * КурсыВалют.Кратность / КурсыВалют.Курс) КАК Сумма
		|ПОМЕСТИТЬ _ЗадолженностьПоНДФЛНеучтеннаяВСЧАВВалюте
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата КАК ДатаЗадолженности,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание КАК Основание,
		|		""Оплачена"" КАК ВидСуммы,
		|		_ОплатаЗадолженности.Дата КАК ДатаКурса,
		|		_ОплатаЗадолженности.Сумма КАК Сумма
		|	ИЗ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА КАК _ЗадолженностьПоНДФЛНеучтеннаяВСЧА
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОплатаЗадолженности КАК _ОплатаЗадолженности
		|			ПО _ЗадолженностьПоНДФЛНеучтеннаяВСЧА.СчетДоверительногоУправления = _ОплатаЗадолженности.СчетДоверительногоУправления
		|				И _ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание = _ОплатаЗадолженности.Основание
		|				И _ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата <= _ОплатаЗадолженности.Дата
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.СчетДоверительногоУправления,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание,
		|		""Не оплачена"",
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.ДатаНачисления,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Сумма - ЕСТЬNULL(СУММА(_ОплатаЗадолженности.Сумма), 0)
		|	ИЗ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА КАК _ЗадолженностьПоНДФЛНеучтеннаяВСЧА
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ОплатаЗадолженности КАК _ОплатаЗадолженности
		|			ПО _ЗадолженностьПоНДФЛНеучтеннаяВСЧА.СчетДоверительногоУправления = _ОплатаЗадолженности.СчетДоверительногоУправления
		|				И _ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание = _ОплатаЗадолженности.Основание
		|				И _ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата <= _ОплатаЗадолженности.Дата
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.СчетДоверительногоУправления,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Дата,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Основание,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Сумма,
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.ДатаНачисления
		|	
		|	ИМЕЮЩИЕ
		|		_ЗадолженностьПоНДФЛНеучтеннаяВСЧА.Сумма - ЕСТЬNULL(СУММА(_ОплатаЗадолженности.Сумма), 0) > 0) КАК _ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО (_СчетаДоверительногоУправления.СчетДоверительногоУправления = _ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Валюта = _СчетаДоверительногоУправления.Валюта)
		|			И (НАЧАЛОПЕРИОДА(_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.ДатаКурса, ДЕНЬ) = КурсыВалют.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.СчетДоверительногоУправления,
		|	_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.ДатаЗадолженности
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(СУММА(_ЗадолженностьПоНДФЛНеучтеннаяВСЧАВалюте.Сумма * КурсыВалют.Кратность / КурсыВалют.Курс), 0) <> 0";
	
	Запрос.Выполнить();
	
#КонецОбласти	

#Область ПОМЕСТИТЬ_ПоказателиУвеличивающиеЭффективнуюДоходность
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) КАК Период,
		|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности КАК ВидПоказателя,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты.Аванс
		|				ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход
		|			ИНАЧЕ ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|		КОНЕЦ * ВЫБОР ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ * КурсыЗадолженности.Курс * КурсыВалют.Кратность / КурсыЗадолженности.Кратность / КурсыВалют.Курс) КАК СуммаПоказателя
		|ПОМЕСТИТЬ _ПоказателиУвеличивающиеЭффективнуюДоходностьПодробно
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)
		|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыЗадолженности
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Валюта = КурсыЗадолженности.Валюта
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) = КурсыЗадолженности.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (_СчетаДоверительногоУправления.Валюта = КурсыВалют.Валюта)
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) = КурсыВалют.Период)
		|ГДЕ
		|	(ЗадолженностиПоДенежнымСредствамОбороты.Регистратор ССЫЛКА Документ.НачислениеЗадолженности
		|			ИЛИ НЕ ЗадолженностиПоДенежнымСредствамОбороты.Аванс)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ),
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоказателиУвеличивающиеЭффективнуюДоходностьПодробно.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(_ПоказателиУвеличивающиеЭффективнуюДоходностьПодробно.СуммаПоказателя) КАК СуммаПоказателей
		|ПОМЕСТИТЬ _ПоказателиУвеличивающиеЭффективнуюДоходность
		|ИЗ
		|	_ПоказателиУвеличивающиеЭффективнуюДоходностьПодробно КАК _ПоказателиУвеличивающиеЭффективнуюДоходностьПодробно
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоказателиУвеличивающиеЭффективнуюДоходностьПодробно.СчетДоверительногоУправления";
	
	Запрос.Выполнить();
	
#КонецОбласти	

	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(ИсточникВременныхТаблиц, , МассивИменВременныхТаблиц);

КонецПроцедуры

#КонецОбласти

#Область Расчет_доходности_инвестирования_ПФР

// Расчет Доходности ПФР
Процедура ДобавитьВРасшифровкуСреднееГеометрическое(ТаблицаДоходностей, Доходность, Формула)
	
	Основание = 1;
	МассивМножителей = Новый Массив;
	
	Для Каждого СтрокаДоходностей Из ТаблицаДоходностей Цикл
		Основание = Основание * (СтрокаДоходностей.Доходность/100+1);
		МассивМножителей.Добавить("(" + Формат(СтрокаДоходностей.Доходность, "ЧДЦ=2") + "/100 + 1)");
	КонецЦикла;
	
	Доходность = Окр((Pow(Основание, 1/ТаблицаДоходностей.Количество())-1)*100, 2);
	Формула = "(" + СтрСоединить(МассивМножителей, "*") + "^(1/" + ТаблицаДоходностей.Количество() + " - 1)*100 = " + Формат(Доходность, "ЧДЦ=2");
	
КонецПроцедуры

Функция ПолучитьДатуРасчетаДоходностиПФР(Организация, СчетДоверительногоУправления, Период, Отказ) Экспорт
	
	ДатаРасчетаДоходности = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПоследнегоРасчетаСЧАЗаПериод(СчетДоверительногоУправления, НачалоКвартала(Период), КонецКвартала(Период), Отказ);
	
	Если ДатаРасчетаДоходности = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить дату расчета доходности ПФР для счета " + СчетДоверительногоУправления + " на " + Формат(КонецКвартала(Период), "ДФ=dd.MM.yy"), СчетДоверительногоУправления);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДатаРасчетаДоходности;
	
КонецФункции

Функция РассчитатьДоходностьИнвестированияПФР(Организация, СчетДоверительногоУправления, Период, РасшифровкаРасчета = Ложь) Экспорт
	
	ДнейВГоду = ДеньГода(КонецГода(Период));
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация"						, Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления"	, СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период"							, Период);
	
	ДатаЗаключения					= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "ДатаЗаключения");
	ДоговорЗаключенПослеНачалаГода	= ДатаЗаключения > НачалоГода(Период);
	
	Запрос.УстановитьПараметр("ДоговорЗаключенПослеНачалаГода",	ДоговорЗаключенПослеНачалаГода); 
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПоследних.Период, ДЕНЬ) КАК Период,
		|	ФинансовыеПоказателиСрезПоследних.Значение КАК СЧА,
		|	""Период"" КАК ИдентификаторПериода
		|ПОМЕСТИТЬ _ПериодыИСЧА
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПоследних.Период, ДЕНЬ),
		|	ФинансовыеПоказателиСрезПоследних.Значение,
		|	""НачалоГода""
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			НАЧАЛОПЕРИОДА(&Период, ГОД),
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиСрезПоследних
		|ГДЕ
		|	НЕ &ДоговорЗаключенПослеНачалаГода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПервых.Период, ДЕНЬ),
		|	ФинансовыеПоказателиСрезПервых.Значение,
		|	""НачалоГода""
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПервых(
		|			НАЧАЛОПЕРИОДА(&Период, ГОД),
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиСрезПервых
		|ГДЕ
		|	&ДоговорЗаключенПослеНачалаГода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПоследних.Период, ДЕНЬ),
		|	ФинансовыеПоказателиСрезПоследних.Значение,
		|	""ПериодМинусГод""
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ГОД, -1), МЕСЯЦ),
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиСрезПоследних
		|ГДЕ
		|	НЕ &ДоговорЗаключенПослеНачалаГода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ГОД, -1), МЕСЯЦ), ДЕНЬ),
		|	0,
		|	""ПериодМинусГод""
		|ГДЕ
		|	&ДоговорЗаключенПослеНачалаГода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК Период,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.БалансоваяСтоимостьОборот
		|			ИНАЧЕ -ВводыВыводыАктивовВВалютеУчетаОбороты.БалансоваяСтоимостьОборот
		|		КОНЕЦ) КАК БалансоваяСтоимость
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, -13), МЕСЯЦ),
		|			&Период,
		|			День,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыИСЧА КАК _ПериодыИСЧА
		|		ПО (_ПериодыИСЧА.ИдентификаторПериода = ""ПериодМинусГод"")
		|			И (_ПериодыИСЧА.Период < ВводыВыводыАктивовВВалютеУчетаОбороты.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыИСЧА.Период КАК Период,
		|	_ПериодыИСЧА.СЧА КАК СЧА,
		|	ЕСТЬNULL(_ВводыВыводы.БалансоваяСтоимость, 0) КАК ВводыВыводы
		|ПОМЕСТИТЬ _ВводыВыводыИСЧА
		|ИЗ
		|	_ПериодыИСЧА КАК _ПериодыИСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО _ПериодыИСЧА.Период = _ВводыВыводы.Период
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ВводыВыводы.Период,
		|	ФинансовыеПоказатели.Значение,
		|	_ВводыВыводы.БалансоваяСтоимость
		|ИЗ
		|	_ВводыВыводы КАК _ВводыВыводы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО _ВводыВыводы.Период = ФинансовыеПоказатели.Период
		|			И (ФинансовыеПоказатели.Активность)
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВводыВыводыИСЧА.Период КАК ДатаСЧА,
		|	_ВводыВыводыИСЧА.ВводыВыводы КАК ВводВывод,
		|	_ВводыВыводыИСЧА.СЧА КАК СЧА,
		|	_ВводыВыводыИСЧАДо.СЧА КАК предСЧА,
		|	ВЫБОР
		|		КОГДА _ВводыВыводыИСЧАДо.СЧА ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ _ВводыВыводыИСЧА.СЧА - _ВводыВыводыИСЧА.ВводыВыводы
		|	КОНЕЦ КАК СЧАбезВВ,
		|	ВЫБОР
		|		КОГДА _ВводыВыводыИСЧАДо.СЧА = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ВводыВыводыИСЧА.СЧА - _ВводыВыводыИСЧА.ВводыВыводы КАК ЧИСЛО(27, 10))) / _ВводыВыводыИСЧАДо.СЧА КАК ЧИСЛО(12, 10))
		|	КОНЕЦ КАК Прирост,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(12, 10)) КАК ПриростИтог
		|ПОМЕСТИТЬ _Строка010
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВводыВыводыИСЧА.Период КАК Период,
		|		_ВводыВыводыИСЧА.СЧА КАК СЧА,
		|		_ВводыВыводыИСЧА.ВводыВыводы КАК ВводыВыводы,
		|		МАКСИМУМ(_ВводыВыводыИСЧАПериоды.Период) КАК ПериодДо
		|	ИЗ
		|		_ВводыВыводыИСЧА КАК _ВводыВыводыИСЧА
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыИСЧА КАК _ПериодыИСЧА
		|			ПО (_ПериодыИСЧА.ИдентификаторПериода = ""НачалоГода"")
		|				И (_ПериодыИСЧА.Период <= _ВводыВыводыИСЧА.Период)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводыИСЧА КАК _ВводыВыводыИСЧАПериоды
		|			ПО _ВводыВыводыИСЧА.Период > _ВводыВыводыИСЧАПериоды.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВводыВыводыИСЧА.Период,
		|		_ВводыВыводыИСЧА.СЧА,
		|		_ВводыВыводыИСЧА.ВводыВыводы) КАК _ВводыВыводыИСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводыИСЧА КАК _ВводыВыводыИСЧАДо
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыИСЧА КАК _ПериодыИСЧА
		|			ПО (_ПериодыИСЧА.ИдентификаторПериода = ""НачалоГода"")
		|				И (_ПериодыИСЧА.Период <= _ВводыВыводыИСЧАДо.Период)
		|		ПО _ВводыВыводыИСЧА.ПериодДо = _ВводыВыводыИСЧАДо.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВводыВыводыИСЧА.Период КАК ДатаСЧА,
		|	_ВводыВыводыИСЧА.ВводыВыводы КАК ВводВывод,
		|	_ВводыВыводыИСЧА.СЧА КАК СЧА,
		|	_ВводыВыводыИСЧАДо.СЧА КАК предСЧА,
		|	ВЫБОР
		|		КОГДА _ВводыВыводыИСЧАДо.СЧА ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ _ВводыВыводыИСЧА.СЧА - _ВводыВыводыИСЧА.ВводыВыводы
		|	КОНЕЦ КАК СЧАбезВВ,
		|	ВЫБОР
		|		КОГДА _ВводыВыводыИСЧАДо.СЧА = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ВводыВыводыИСЧА.СЧА - _ВводыВыводыИСЧА.ВводыВыводы КАК ЧИСЛО(27, 10))) / _ВводыВыводыИСЧАДо.СЧА КАК ЧИСЛО(12, 10))
		|	КОНЕЦ КАК Прирост,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(12, 10)) КАК ПриростИтог
		|ПОМЕСТИТЬ _Строка020
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВводыВыводыИСЧА.Период КАК Период,
		|		_ВводыВыводыИСЧА.СЧА КАК СЧА,
		|		_ВводыВыводыИСЧА.ВводыВыводы КАК ВводыВыводы,
		|		МАКСИМУМ(_ВводыВыводыИСЧАПериоды.Период) КАК ПериодДо
		|	ИЗ
		|		_ВводыВыводыИСЧА КАК _ВводыВыводыИСЧА
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводыИСЧА КАК _ВводыВыводыИСЧАПериоды
		|			ПО _ВводыВыводыИСЧА.Период > _ВводыВыводыИСЧАПериоды.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВводыВыводыИСЧА.Период,
		|		_ВводыВыводыИСЧА.СЧА,
		|		_ВводыВыводыИСЧА.ВводыВыводы) КАК _ВводыВыводыИСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводыИСЧА КАК _ВводыВыводыИСЧАДо
		|		ПО _ВводыВыводыИСЧА.ПериодДо = _ВводыВыводыИСЧАДо.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПоследних.Период, ДЕНЬ) КАК Период,
		|	ФинансовыеПоказателиСрезПоследних.Значение КАК Доходность
		|ПОМЕСТИТЬ _Строка030
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ГОД, -1), МЕСЯЦ),
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода)) КАК ФинансовыеПоказателиСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПоследних.Период, ДЕНЬ),
		|	ФинансовыеПоказателиСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ГОД, -2), МЕСЯЦ),
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода)) КАК ФинансовыеПоказателиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ФинансовыеПоказатели.Период) КАК Период,
		|	ГОД(ФинансовыеПоказатели.Период) КАК ГОД
		|ПОМЕСТИТЬ _НаКонцыГодов
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Период <= НАЧАЛОПЕРИОДА(&Период, ГОД)
		|	И ФинансовыеПоказатели.Активность
		|	И ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГОД(ФинансовыеПоказатели.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Значение КАК Доходность,
		|	ФинансовыеПоказатели.Период КАК Период
		|ПОМЕСТИТЬ _Строка040
		|ИЗ
		|	_НаКонцыГодов КАК _НаКонцыГодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО _НаКонцыГодов.Период = ФинансовыеПоказатели.Период
		|ГДЕ
		|	ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.Активность
		|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПоследних.Период, ДЕНЬ) КАК Период,
		|	ВЫБОР
		|		КОГДА ФинансовыеПоказателиСрезПоследних.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода)
		|			ТОГДА ""010""
		|		КОГДА ФинансовыеПоказателиСрезПоследних.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода)
		|			ТОГДА ""020""
		|		КОГДА ФинансовыеПоказателиСрезПоследних.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущихТрехЛет)
		|			ТОГДА ""030""
		|		КОГДА ФинансовыеПоказателиСрезПоследних.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРВесьПериод)
		|			ТОГДА ""040""
		|	КОНЕЦ КАК Показатель,
		|	ФинансовыеПоказателиСрезПоследних.Значение КАК ДоходностьУчет,
		|	0 КАК ДоходностьРасчет
		|ПОМЕСТИТЬ _Проверка
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СубъектАналитики = &СчетДоверительногоУправления
		|				И ВидПоказателя В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФР))) КАК ФинансовыеПоказателиСрезПоследних
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ФинансовыеПоказателиСрезПоследних.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)";
#КонецОбласти

	Запрос.Выполнить();
	
	ПериодыСЧА = Новый Структура;
	ПериодыСЧА.Вставить("Период"		, Период);
	ПериодыСЧА.Вставить("НачалоГода"	, КонецГода(ДобавитьМесяц(Период, -12)));
	ПериодыСЧА.Вставить("ПериодМинусГод", ДобавитьМесяц(Период, -12));
	
	Для Каждого СтрокаПериода Из Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ПериодыИСЧА").ПолучитьДанные().Выгрузить() Цикл
		Если ЗначениеЗаполнено(СтрокаПериода.Период) Тогда
			ПериодыСЧА.Вставить(СтрокаПериода.ИдентификаторПериода, СтрокаПериода.Период);
		КонецЕсли;
	КонецЦикла;
	
#Область Строка010

	КоличествоДней_Строка010 = ?(ДоговорЗаключенПослеНачалаГода, ДеньГода(Период) - ДеньГода(ПериодыСЧА.НачалоГода) + 1, ДеньГода(Период));
	Расшифровка_Строка010 = Новый Структура;
	Расшифровка_Строка010.Вставить("ДатаНачала"		, ПериодыСЧА.НачалоГода);
	Расшифровка_Строка010.Вставить("ДатаОкончания"	, Период);
	Расшифровка_Строка010.Вставить("ПриростИтог"	, 1);
	Расшифровка_Строка010.Вставить("Доходность"		, 0);
	Расшифровка_Строка010.Вставить("Формула"		, 0);
	Расшифровка_Строка010.Вставить("КоличествоДней"	, КоличествоДней_Строка010);
	Расшифровка_Строка010.Вставить("Таблица"		, Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Строка010").ПолучитьДанные().Выгрузить());
	
	Для Индекс = 1 По Расшифровка_Строка010.Таблица.Количество() - 1 Цикл
		СтрокаДанных = Расшифровка_Строка010.Таблица[Индекс];
		Расшифровка_Строка010.ПриростИтог	= Расшифровка_Строка010.ПриростИтог * СтрокаДанных.Прирост;
		СтрокаДанных.ПриростИтог			= Расшифровка_Строка010.ПриростИтог;
	КонецЦикла;
	
	Расшифровка_Строка010.Доходность	= ОКР((Расшифровка_Строка010.ПриростИтог - 1) * 365 / Расшифровка_Строка010.КоличествоДней * 100, 2);
	Расшифровка_Строка010.Формула		= "(" +Строка(Окр(Расшифровка_Строка010.ПриростИтог, 10)) + " - 1)*365/" + Расшифровка_Строка010.КоличествоДней + "*100 = ";
	
#КонецОбласти

#Область Строка020
	Расшифровка_Строка020 = Новый Структура;
	Расшифровка_Строка020.Вставить("ДатаНачала"		, ПериодыСЧА.ПериодМинусГод);
	Расшифровка_Строка020.Вставить("ДатаОкончания"	, Период);
	Расшифровка_Строка020.Вставить("ПриростИтог"	, 1);
	Расшифровка_Строка020.Вставить("Доходность"		, 0);
	Расшифровка_Строка020.Вставить("Формула"		, "");
	Расшифровка_Строка020.Вставить("КоличествоДней"	, ДнейВГоду);
	Расшифровка_Строка020.Вставить("Таблица"		, Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Строка020").ПолучитьДанные().Выгрузить());
	
	Для Индекс = 1 По Расшифровка_Строка020.Таблица.Количество() - 1 Цикл
		СтрокаДанных = Расшифровка_Строка020.Таблица[Индекс];
		Расшифровка_Строка020.ПриростИтог	= Расшифровка_Строка020.ПриростИтог * СтрокаДанных.Прирост;
		СтрокаДанных.ПриростИтог			= Расшифровка_Строка020.ПриростИтог;
	КонецЦикла;
	
	Расшифровка_Строка020.Доходность	= ОКР((Расшифровка_Строка020.ПриростИтог - 1) * 365 / Расшифровка_Строка020.КоличествоДней * 100, 2);
	Расшифровка_Строка020.Формула		= "(" +Строка(Окр(Расшифровка_Строка020.ПриростИтог, 10)) + " - 1)*365/" + Расшифровка_Строка020.КоличествоДней + "*100 = ";
	
#КонецОбласти
	
#Область Строка030
	Расшифровка_Строка030 = Новый Структура;
	Расшифровка_Строка030.Вставить("Доходность"	, 0);
	Расшифровка_Строка030.Вставить("Формула"	, 0);
	Расшифровка_Строка030.Вставить("Таблица"	, Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Строка030").ПолучитьДанные().Выгрузить());
	
	Строка030 = Расшифровка_Строка030.Таблица.Добавить();
	Строка030.Период		= Период;
	Строка030.Доходность	= Расшифровка_Строка020.Доходность;
	
	ДобавитьВРасшифровкуСреднееГеометрическое(Расшифровка_Строка030.Таблица, Расшифровка_Строка030.Доходность, Расшифровка_Строка030.Формула); 
	
#КонецОбласти
	
#Область Строка040
	Расшифровка_Строка040 = Новый Структура;
	Расшифровка_Строка040.Вставить("Доходность"	, 0);
	Расшифровка_Строка040.Вставить("Формула"	, 0);
	Расшифровка_Строка040.Вставить("Таблица"	, Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Строка040").ПолучитьДанные().Выгрузить());
	
	Строка040 = Расшифровка_Строка040.Таблица.Добавить();
	Строка040.Период		= Период;
	Строка040.Доходность	= Расшифровка_Строка010.Доходность;
	
	ДобавитьВРасшифровкуСреднееГеометрическое(Расшифровка_Строка040.Таблица, Расшифровка_Строка040.Доходность, Расшифровка_Строка040.Формула); 
	
#КонецОбласти

#Область Проверка

	Расшифровка_Проверка = Новый Структура;
	ТаблицаРасшифровки = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Проверка").ПолучитьДанные().Выгрузить();
	
	Для Каждого СтрокаРасшифровки из ТаблицаРасшифровки Цикл 
		Если СтрокаРасшифровки.Показатель = "010" Тогда 
			СтрокаРасшифровки.ДоходностьРасчет = Расшифровка_Строка010.Доходность;
		ИначеЕсли СтрокаРасшифровки.Показатель = "020" Тогда 
			СтрокаРасшифровки.ДоходностьРасчет = Расшифровка_Строка020.Доходность;
		ИначеЕсли СтрокаРасшифровки.Показатель = "030" Тогда 
			СтрокаРасшифровки.ДоходностьРасчет = Расшифровка_Строка030.Доходность;
		ИначеЕсли СтрокаРасшифровки.Показатель = "040" Тогда 	
			СтрокаРасшифровки.ДоходностьРасчет = Расшифровка_Строка040.Доходность;
		КонецЕсли;	
	КонецЦикла;	
	
	Расшифровка_Проверка.Вставить("Таблица", ТаблицаРасшифровки );

#КонецОбласти

	Если РасшифровкаРасчета Тогда		
		ФинансовыеПоказатели = Новый Структура;
		ФинансовыеПоказатели.Вставить("Расшифровка_Строка010"	, Расшифровка_Строка010);
		ФинансовыеПоказатели.Вставить("Расшифровка_Строка020"	, Расшифровка_Строка020);
		ФинансовыеПоказатели.Вставить("Расшифровка_Строка030"	, Расшифровка_Строка030);
		ФинансовыеПоказатели.Вставить("Расшифровка_Строка040"	, Расшифровка_Строка040);	
		ФинансовыеПоказатели.Вставить("Расшифровка_Проверка"	, Расшифровка_Проверка);
		
	Иначе
		ФинансовыеПоказатели = Новый Соответствие;
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода		, Расшифровка_Строка010.Доходность);		
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода	, Расшифровка_Строка020.Доходность);
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущихТрехЛет	, Расшифровка_Строка030.Доходность);
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРВесьПериод			, Расшифровка_Строка040.Доходность);	
	КонецЕсли;
	
	Возврат ФинансовыеПоказатели;	
	
КонецФункции

#КонецОбласти

#Область Расчет_доходности_стратегии

Функция РассчитатьДоходностьСтратегииСНачалаГода(Организация, СубъектАналитики, Период, РасшифровкаРасчета, Отказ) Экспорт
	
	ОшибкаРасчета = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("СубъектАналитики",	СубъектАналитики);
	Запрос.УстановитьПараметр("Период",				КонецДня(Период));
	
	ПоместитьТаблицыДляРасчетаДоходностиСтратегииСНачалаГодаВМенеджерВременныхТаблиц(Запрос, Организация, Период, СубъектАналитики.Метаданные().Имя, СубъектАналитики);
	
	#Область Контроли

	Для Каждого Строка_КонтрольСЧА Из СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_КонтрольСЧА").Выгрузить() Цикл
		
		ТекстОшибки = СтрШаблон("По счёту %1 не зарегистрирована СЧА на %2.", Строка_КонтрольСЧА.СчетДоверительногоУправления, Формат(Строка_КонтрольСЧА.ДатаСЧА, "ДФ=dd.MM.yyyy"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , ОшибкаРасчета);
			
	КонецЦикла;
	
	#КонецОбласти
	
	#Область Параметры_расшифровки
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_ДатыРасчета.Период) КАК ДатаНачала,
		|	МАКСИМУМ(_ДатыРасчета.Период) КАК ДатаОкончания,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА _Расшифровка.ДатаРасчета < НАЧАЛОПЕРИОДА(&Период, ГОД)
		|				ТОГДА ДЕНЬГОДА(&Период)
		|			ИНАЧЕ РАЗНОСТЬДАТ(ВЫРАЗИТЬ(_Расшифровка.ДатаРасчета КАК ДАТА), &Период, ДЕНЬ) + 1
		|		КОНЕЦ) КАК КоличествоДней
		|ПОМЕСТИТЬ _ПараметрыРасшифровки
		|ИЗ
		|	_ДатыРасчета КАК _ДатыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Расшифровка КАК _Расшифровка
		|		ПО _ДатыРасчета.СубъектАналитики = _Расшифровка.СубъектАналитики
		|			И _Расшифровка.СЧА ЕСТЬ НЕ NULL
		|ГДЕ _ДатыРасчета.СубъектАналитики = &СубъектАналитики";

	Запрос.Выполнить();	
	
	#КонецОбласти

	Таблица_ПараметрыРасшифровки	= СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ПараметрыРасшифровки").Выгрузить();
	Таблица_Расшифровка				= СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_Расшифровка",,, Новый Структура("Текст, Параметры", "СубъектАналитики = &СубъектАналитики", Новый Структура("СубъектАналитики", СубъектАналитики)), "ДатаРасчета").Выгрузить();
	
	Расшифровка = Новый Структура;
	Расшифровка.Вставить("ДатаНачала",		Таблица_ПараметрыРасшифровки[0].ДатаНачала);
	Расшифровка.Вставить("ДатаОкончания",	Таблица_ПараметрыРасшифровки[0].ДатаОкончания);
	Расшифровка.Вставить("ПриростИтог",		1);
	Расшифровка.Вставить("Доходность",		0);
	Расшифровка.Вставить("Формула",			"Ошибка расчета"); // При отсутствии ошибки текст будет заменен
	Расшифровка.Вставить("КоличествоДней",	Таблица_ПараметрыРасшифровки[0].КоличествоДней);
	Расшифровка.Вставить("Таблица",			Таблица_Расшифровка);
	
	Если ОшибкаРасчета Тогда

		ТекстОшибки = СтрШаблон("Показатель %1 не рассчитан.", Справочники.ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);

	Иначе
	
		Для Каждого Строка_Расшифровка Из Таблица_Расшифровка Цикл
			Расшифровка.ПриростИтог			= Расшифровка.ПриростИтог * Строка_Расшифровка.Прирост;
			Строка_Расшифровка.ПриростИтог	= Расшифровка.ПриростИтог;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Расшифровка.КоличествоДней) Тогда
			Расшифровка.Доходность = Окр((Расшифровка.ПриростИтог - 1) * 365 / Расшифровка.КоличествоДней * 100, 2);
		КонецЕсли;
		
		Расшифровка.Формула = "(" + Строка(Окр(Расшифровка.ПриростИтог, 10)) + " - 1)*365/" + Расшифровка.КоличествоДней + "*100 = ";
		
	КонецЕсли;	
		
	Если РасшифровкаРасчета Тогда
		ФинансовыеПоказатели = Новый Структура;
		ФинансовыеПоказатели.Вставить("Расшифровка", Расшифровка);
	Иначе
		ФинансовыеПоказатели = Новый Соответствие;
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода, Расшифровка.Доходность);
	КонецЕсли;
	
	Возврат ФинансовыеПоказатели;
	
КонецФункции

Функция ТребуетсяРегистрацияДоходностиСтратегииСНачалаГода(Организация, СубъектАналитики, Период, ВыводитьСообщения = Ложь) Экспорт

	ВидПоказателя		= Справочники.ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода;
	НачалоИспользования = Дата(2023, 03, 31);
	
	Если НЕ ТипЗнч(СубъектАналитики) = Тип("СправочникСсылка.СчетаДоверительногоУправления") И НЕ ТипЗнч(СубъектАналитики) = Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования") Тогда
		Если ВыводитьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Расчёт доходности стратегии с начала года для субъекта &1 не предусмотрено", СубъектАналитики));
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если КонецДня(Период) <> КонецМесяца(Период) Тогда 
		Если ВыводитьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Показатель '%1' регистрируется только на конец месяца", ВидПоказателя));
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если Период < НачалоИспользования Тогда
		Если ВыводитьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Показатель '%1' регистрируется только начиная с %2", ВидПоказателя, Формат(НачалоИспользования, "ДФ=dd.MM.yyyy")));
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("СубъектАналитики",	СубъектАналитики);
	Запрос.УстановитьПараметр("Период",				Период);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(
		|				&Период,
		|				Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(&СубъектАналитики) = ТИП(Справочник.СчетаДоверительногоУправления)
		|				ТОГДА СчетаДоверительногоУправления.Ссылка = &СубъектАналитики
		|						И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|						И ЕСТЬNULL(СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Стандартная, ЛОЖЬ) = ЛОЖЬ
		|			КОГДА ТИПЗНАЧЕНИЯ(&СубъектАналитики) = ТИП(Справочник.СтратегииИндивидуальногоИнвестирования)
		|				ТОГДА СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия = &СубъектАналитики
		|						И СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Стандартная
		|		КОНЕЦ
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Период)
		|	И ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|	И ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует";
		
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Помещает таблицы для расчёта доходности стратегии с начала года в источник временных таблиц
//
// Параметры
//	ИсточникВременныхТаблиц	- Запрос, МенеджерВременныхТаблиц	- источник временных таблиц
//	Организация				- СправочникСсылка.Организации		- Отбор по ораганизации
//	Период					- Дата								- Дата на которую расчитывается доходность
//	ИмяОтбора				- Строка							- Имя отбора по которому будут отобраны счета ДУ, в порядке приоритета работает только один отбор
//																"СчетаДоверительногоУправления" - отбор по списку счетов ДУ
//																"СтратегииИндивидуальногоИнвестирования" - отбор по стратегии в которую входят счета ДУ
//																"ВидыДоговоровДоверительногоУправления" - отбор по видам договоров
//																"" - без отбора
//	ЗначениеОтбора			- СправочникСсылка.СчетаДоверительногоУправления,СправочникСсылка.СтратегииИндивидуальногоИнвестирования,ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления,СписокЗначений,Массив	- элемент или массив элемнтов по которым будет работать отбор с учётом имени отбора
//	ВидВалюты				- Строка -	"ВалютаУчета" - расчёт доходности в валюте учёта
//										"ВалютаЦелиРасчета" - расчёт доходности в валюте цели расчёта, если она цель зарегистрирована, иначе в валюте учёта.
Процедура ПоместитьТаблицыДляРасчетаДоходностиСтратегииСНачалаГодаВМенеджерВременныхТаблиц(ИсточникВременныхТаблиц, Организация, Период, ИмяОтбора, ЗначениеОтбора, ВидВалюты = "ВалютаУчета") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СистемныеФункции.МенеджерВременныхТаблицИзИсточникаВременныхТаблиц(ИсточникВременныхТаблиц);
	
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Период",		 		КонецДня(Период));
	Запрос.УстановитьПараметр("ВидВалюты",	 		ВидВалюты);
	Запрос.УстановитьПараметр("ИмяОтбора",			ИмяОтбора);
	Запрос.УстановитьПараметр("ЗначениеОтбора", 	ЗначениеОтбора);
	Запрос.УстановитьПараметр("МассивВидыОпераций", ПолучитьМассивВидыОперацийДляРасчетаДоходности());
	
#Область ПОМЕСТИТЬ_СчетаДоверительногоУправления
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия КАК Стратегия,
		|	ВЫБОР
		|		КОГДА &ВидВалюты = ""ВалютаУчета""
		|				ИЛИ ИнвестиционныеПрофилиСрезПоследних.Цель.Валюта ЕСТЬ NULL
		|			ТОГДА Организации.ВалютаУчета
		|		КОГДА &ВидВалюты = ""ВалютаЦелиРасчета""
		|			ТОГДА ИнвестиционныеПрофилиСрезПоследних.Цель.Валюта
		|	КОНЕЦ КАК Валюта,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО СчетаДоверительногоУправления.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&Период, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеПрофили.СрезПоследних(&Период, Организация = &Организация) КАК ИнвестиционныеПрофилиСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = ИнвестиционныеПрофилиСрезПоследних.СубъектУчета
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= НАЧАЛОПЕРИОДА(&Период, ГОД))
		|	И ВЫБОР
		|			КОГДА &ИмяОтбора = ""СчетаДоверительногоУправления""
		|				ТОГДА СчетаДоверительногоУправления.Ссылка В (&ЗначениеОтбора)
		|			КОГДА &ИмяОтбора = ""СтратегииИндивидуальногоИнвестирования""
		|				ТОГДА СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия В (&ЗначениеОтбора)
		|			КОГДА &ИмяОтбора = ""ВидыДоговоровДоверительногоУправления""
		|				ТОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ЗначениеОтбора)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.Выполнить();
	
#КонецОбласти	
	
	Справочники.НастройкиРегламентныхДействий.ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу(Запрос, 
		Новый Структура("ВидДействия, ДатаС, ДатаПо, ДополнитьРабочимиДнями", "СЧА", ДобавитьМесяц(НачалоГода(Период), -2), Период, Ложь));

#Область ВыполнитьОсновнойЗапрос 
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(МИНИМУМ(ВводыВыводыАктивовВВалютеУчета.Период), ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ _ДатыПервыхВводов
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|		ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления
		|			И (ВводыВыводыАктивовВВалютеУчета.Период <= &Период)
		|			И (ВводыВыводыАктивовВВалютеУчета.Активность)
		|ГДЕ
		|	ВводыВыводыАктивовВВалютеУчета.ВидОперацииВводаВыводаДС В(&МассивВидыОпераций)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДатыДействияЗаПериод.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.Стратегия КАК Стратегия,
		|	_СчетаДоверительногоУправления.Валюта КАК Валюта,
		|	ВЫРАЗИТЬ(_ДатыДействияЗаПериод.Дата КАК ДАТА) КАК ДатаСЧА
		|ПОМЕСТИТЬ _ДатыСЧА
		|ИЗ
		|	_ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыПервыхВводов КАК _ДатыПервыхВводов
		|		ПО _ДатыДействияЗаПериод.СчетДоверительногоУправления = _ДатыПервыхВводов.СчетДоверительногоУправления
		|			И _ДатыДействияЗаПериод.Дата >= _ДатыПервыхВводов.Дата
		|			И (_ДатыДействияЗаПериод.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ГОД) И &Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ДатыДействияЗаПериод.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ДатыДействияЗаПериод.СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент,
		|	_СчетаДоверительногоУправления.Стратегия,
		|	_СчетаДоверительногоУправления.Валюта,
		|	МАКСИМУМ(ВЫРАЗИТЬ(_ДатыДействияЗаПериод.Дата КАК ДАТА))
		|ИЗ
		|	_ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыПервыхВводов КАК _ДатыПервыхВводов
		|		ПО _ДатыДействияЗаПериод.СчетДоверительногоУправления = _ДатыПервыхВводов.СчетДоверительногоУправления
		|			И _ДатыДействияЗаПериод.Дата >= _ДатыПервыхВводов.Дата
		|			И (_ДатыДействияЗаПериод.Дата < НАЧАЛОПЕРИОДА(&Период, ГОД))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ДатыДействияЗаПериод.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыДействияЗаПериод.СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент,
		|	_СчетаДоверительногоУправления.Стратегия,
		|	_СчетаДоверительногоУправления.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.Стратегия КАК Стратегия,
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчетаОбороты.Период, ДЕНЬ) КАК Период,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|		КОНЕЦ * КурсыВалют.Кратность / КурсыВалют.Курс) КАК Сумма
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			НАЧАЛОПЕРИОДА(&Период, ГОД),
		|			&Период,
		|			День,
		|			(Организация, СчетДоверительногоУправления) В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.Организация,
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)
		|				И ВидОперацииВводаВыводаДС В (&МассивВидыОпераций)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (_СчетаДоверительногоУправления.Валюта = КурсыВалют.Валюта)
		|			И (НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчетаОбороты.Период, ДЕНЬ) = КурсыВалют.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент,
		|	_СчетаДоверительногоУправления.Стратегия,
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчетаОбороты.Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыСЧА.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ДатыСЧА.Клиент КАК Клиент,
		|	_ДатыСЧА.Стратегия КАК Стратегия,
		|	ФинансовыеПоказатели.Период КАК ДатаСЧА,
		|	ФинансовыеПоказатели.Значение * КурсыВалют.Кратность / КурсыВалют.Курс КАК СЧА
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыСЧА КАК _ДатыСЧА
		|		ПО (ФинансовыеПоказатели.Организация = &Организация)
		|			И ФинансовыеПоказатели.СубъектАналитики = _ДатыСЧА.СчетДоверительногоУправления
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И ФинансовыеПоказатели.Период = _ДатыСЧА.ДатаСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (_ДатыСЧА.Валюта = КурсыВалют.Валюта)
		|			И ФинансовыеПоказатели.Период = КурсыВалют.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СЧА.СчетДоверительногоУправления КАК СубъектАналитики,
		|	_СЧА.ДатаСЧА КАК ДатаСЧА,
		|	_СЧА.СЧА КАК СЧА
		|ПОМЕСТИТЬ _ОбщееСЧА
		|ИЗ
		|	_СЧА КАК _СЧА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СЧА.ВидДоговораДоверительногоУправления,
		|	_СЧА.ДатаСЧА,
		|	СУММА(_СЧА.СЧА)
		|ИЗ
		|	_СЧА КАК _СЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧА.ВидДоговораДоверительногоУправления,
		|	_СЧА.ДатаСЧА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СЧА.Клиент,
		|	_СЧА.ДатаСЧА,
		|	СУММА(_СЧА.СЧА)
		|ИЗ
		|	_СЧА КАК _СЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧА.Клиент,
		|	_СЧА.ДатаСЧА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СЧА.Стратегия,
		|	_СЧА.ДатаСЧА,
		|	СУММА(_СЧА.СЧА)
		|ИЗ
		|	_СЧА КАК _СЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧА.Стратегия,
		|	_СЧА.ДатаСЧА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВводыВыводы.СчетДоверительногоУправления КАК СубъектАналитики,
		|	_ВводыВыводы.Период КАК Период,
		|	_ВводыВыводы.Сумма КАК Сумма
		|ПОМЕСТИТЬ _ОбщееВводыВыводы
		|ИЗ
		|	_ВводыВыводы КАК _ВводыВыводы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ВводыВыводы.ВидДоговораДоверительногоУправления,
		|	_ВводыВыводы.Период,
		|	СУММА(_ВводыВыводы.Сумма)
		|ИЗ
		|	_ВводыВыводы КАК _ВводыВыводы
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВводыВыводы.ВидДоговораДоверительногоУправления,
		|	_ВводыВыводы.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ВводыВыводы.Клиент,
		|	_ВводыВыводы.Период,
		|	СУММА(_ВводыВыводы.Сумма)
		|ИЗ
		|	_ВводыВыводы КАК _ВводыВыводы
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВводыВыводы.Клиент,
		|	_ВводыВыводы.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ВводыВыводы.Стратегия,
		|	_ВводыВыводы.Период,
		|	СУММА(_ВводыВыводы.Сумма)
		|ИЗ
		|	_ВводыВыводы КАК _ВводыВыводы
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВводыВыводы.Стратегия,
		|	_ВводыВыводы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыСЧА.СчетДоверительногоУправления КАК СубъектАналитики,
		|	МИНИМУМ(_ДатыСЧА.ДатаСЧА) КАК Период
		|ПОМЕСТИТЬ _ДатыРасчета
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыСЧА.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыСЧА.ВидДоговораДоверительногоУправления,
		|	МИНИМУМ(_ДатыСЧА.ДатаСЧА)
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыСЧА.ВидДоговораДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыСЧА.Клиент,
		|	МИНИМУМ(_ДатыСЧА.ДатаСЧА)
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыСЧА.Клиент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыСЧА.Стратегия,
		|	МИНИМУМ(_ДатыСЧА.ДатаСЧА)
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|ГДЕ
		|	_ДатыСЧА.Стратегия ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыСЧА.Стратегия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.Клиент,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.Стратегия,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|ГДЕ
		|	_СчетаДоверительногоУправления.Стратегия ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ОбщееВводыВыводы.СубъектАналитики,
		|	_ОбщееВводыВыводы.Период
		|ИЗ
		|	_ОбщееВводыВыводы КАК _ОбщееВводыВыводы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыРасчета.СубъектАналитики КАК СубъектАналитики,
		|	_ДатыРасчета.Период КАК ДатаРасчета,
		|	МАКСИМУМ(Предыдущие_ДатыРасчета.Период) КАК ПредыдущаяДатаРасчета
		|ПОМЕСТИТЬ _ДатыРасчетаСПредыдущимиДатамиРасчета
		|ИЗ
		|	_ДатыРасчета КАК _ДатыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыРасчета КАК Предыдущие_ДатыРасчета
		|		ПО _ДатыРасчета.СубъектАналитики = Предыдущие_ДатыРасчета.СубъектАналитики
		|			И _ДатыРасчета.Период > Предыдущие_ДатыРасчета.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыРасчета.СубъектАналитики,
		|	_ДатыРасчета.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыРасчетаСПредыдущимиДатамиРасчета.СубъектАналитики КАК СубъектАналитики,
		|	_ДатыРасчетаСПредыдущимиДатамиРасчета.ДатаРасчета КАК ДатаРасчета,
		|	_ДатыРасчетаСПредыдущимиДатамиРасчета.ПредыдущаяДатаРасчета КАК ПредыдущаяДатаРасчета,
		|	МАКСИМУМ(_ОбщееСЧА.ДатаСЧА) КАК ПредыдущаяДатаСЧА
		|ПОМЕСТИТЬ _ДатыРасчетаСПредыдущимиДатами
		|ИЗ
		|	_ДатыРасчетаСПредыдущимиДатамиРасчета КАК _ДатыРасчетаСПредыдущимиДатамиРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбщееСЧА КАК _ОбщееСЧА
		|		ПО _ДатыРасчетаСПредыдущимиДатамиРасчета.СубъектАналитики = _ОбщееСЧА.СубъектАналитики
		|			И _ДатыРасчетаСПредыдущимиДатамиРасчета.ДатаРасчета > _ОбщееСЧА.ДатаСЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыРасчетаСПредыдущимиДатамиРасчета.СубъектАналитики,
		|	_ДатыРасчетаСПредыдущимиДатамиРасчета.ДатаРасчета,
		|	_ДатыРасчетаСПредыдущимиДатамиРасчета.ПредыдущаяДатаРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыРасчетаСПредыдущимиДатами.СубъектАналитики КАК СубъектАналитики,
		|	_ДатыРасчетаСПредыдущимиДатами.ДатаРасчета КАК ДатаРасчета,
		|	СУММА(_ОбщееВводыВыводы.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _ВводыВыводыМеждуПоследнейСЧАИДатойРасчета
		|ИЗ
		|	_ДатыРасчетаСПредыдущимиДатами КАК _ДатыРасчетаСПредыдущимиДатами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбщееВводыВыводы КАК _ОбщееВводыВыводы
		|		ПО _ДатыРасчетаСПредыдущимиДатами.СубъектАналитики = _ОбщееВводыВыводы.СубъектАналитики
		|			И (_ОбщееВводыВыводы.Период МЕЖДУ ДОБАВИТЬКДАТЕ(_ДатыРасчетаСПредыдущимиДатами.ПредыдущаяДатаСЧА, ДЕНЬ, 1) И _ДатыРасчетаСПредыдущимиДатами.ДатаРасчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыРасчетаСПредыдущимиДатами.СубъектАналитики,
		|	_ДатыРасчетаСПредыдущимиДатами.ДатаРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыРасчетаСПредыдущимиДатами.СубъектАналитики КАК СубъектАналитики,
		|	_ДатыРасчетаСПредыдущимиДатами.ДатаРасчета КАК ДатаРасчета,
		|	_ОбщееВводыВыводы.Период КАК ДатаОперации,
		|	_ДатыРасчетаСПредыдущимиДатами.ПредыдущаяДатаРасчета КАК ПредыдущаяДатаРасчета,
		|	_ДатыРасчетаСПредыдущимиДатами.ПредыдущаяДатаСЧА КАК ПредыдущаяДатаСЧА,
		|	ЕСТЬNULL(_ОбщееВводыВыводы.Сумма, 0) КАК ВводВывод,
		|	ЕСТЬNULL(СЧАНаДатуРасчета.ДатаСЧА, СЧАПередОперацией.ДатаСЧА) КАК ДатаСЧА,
		|	ЕСТЬNULL(СЧАНаДатуРасчета.СЧА, ЕСТЬNULL(СЧАПередОперацией.СЧА, 0) + ЕСТЬNULL(_ВводыВыводыМеждуПоследнейСЧАИДатойРасчета.Сумма, 0)) КАК СЧА,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СЧАНаДатуРасчета.СЧА, ЕСТЬNULL(СЧАПередОперацией.СЧА, 0) + ЕСТЬNULL(_ВводыВыводыМеждуПоследнейСЧАИДатойРасчета.Сумма, 0)) - ЕСТЬNULL(_ОбщееВводыВыводы.Сумма, 0) КАК ЧИСЛО(27, 10)) КАК СЧАбезВВ,
		|	ВЫБОР
		|		КОГДА СЧАНаДатуРасчета.СЧА ЕСТЬ НЕ NULL 
		|				ИЛИ _ВводыВыводыМеждуПоследнейСЧАИДатойРасчета.Сумма ЕСТЬ НЕ NULL 
		|			ТОГДА ВЫБОР
		|					КОГДА _ДатыРасчетаСПредыдущимиДатами.ДатаРасчета < НАЧАЛОПЕРИОДА(&Период, ГОД)
		|						ТОГДА ДЕНЬГОДА(&Период)
		|					ИНАЧЕ РАЗНОСТЬДАТ(_ДатыРасчетаСПредыдущимиДатами.ДатаРасчета, &Период, ДЕНЬ) + 1
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоДней
		|ПОМЕСТИТЬ _ДатыРасчетаСоСЧА
		|ИЗ
		|	_ДатыРасчетаСПредыдущимиДатами КАК _ДатыРасчетаСПредыдущимиДатами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбщееВводыВыводы КАК _ОбщееВводыВыводы
		|		ПО _ДатыРасчетаСПредыдущимиДатами.СубъектАналитики = _ОбщееВводыВыводы.СубъектАналитики
		|			И _ДатыРасчетаСПредыдущимиДатами.ДатаРасчета = _ОбщееВводыВыводы.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводыМеждуПоследнейСЧАИДатойРасчета КАК _ВводыВыводыМеждуПоследнейСЧАИДатойРасчета
		|		ПО _ДатыРасчетаСПредыдущимиДатами.СубъектАналитики = _ВводыВыводыМеждуПоследнейСЧАИДатойРасчета.СубъектАналитики
		|			И _ДатыРасчетаСПредыдущимиДатами.ДатаРасчета = _ВводыВыводыМеждуПоследнейСЧАИДатойРасчета.ДатаРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбщееСЧА КАК СЧАНаДатуРасчета
		|		ПО _ДатыРасчетаСПредыдущимиДатами.СубъектАналитики = СЧАНаДатуРасчета.СубъектАналитики
		|			И _ДатыРасчетаСПредыдущимиДатами.ДатаРасчета = СЧАНаДатуРасчета.ДатаСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбщееСЧА КАК СЧАПередОперацией
		|		ПО _ДатыРасчетаСПредыдущимиДатами.СубъектАналитики = СЧАПередОперацией.СубъектАналитики
		|			И _ДатыРасчетаСПредыдущимиДатами.ПредыдущаяДатаСЧА = СЧАПередОперацией.ДатаСЧА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыРасчетаСоСЧА.СубъектАналитики КАК СубъектАналитики,
		|	_ДатыРасчетаСоСЧА.ДатаРасчета КАК ДатаРасчета,
		|	_ДатыРасчетаСоСЧА.ДатаОперации КАК ДатаОперации,
		|	_ДатыРасчетаСоСЧА.ПредыдущаяДатаРасчета КАК ПредыдущаяДатаРасчета,
		|	Предыдущие_ДатыРасчетаСоСЧА.ДатаСЧА КАК ДатаПредыдущейСЧА,
		|	Предыдущие_ДатыРасчетаСоСЧА.СЧА КАК ПредыдущаяСЧА,
		|	_ДатыРасчетаСоСЧА.ВводВывод КАК ВводВывод,
		|	_ДатыРасчетаСоСЧА.ДатаСЧА КАК ДатаСЧА,
		|	_ДатыРасчетаСоСЧА.СЧА КАК СЧА,
		|	_ДатыРасчетаСоСЧА.СЧАбезВВ КАК СЧАбезВВ,
		|	_ДатыРасчетаСоСЧА.КоличествоДней КАК КоличествоДней,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Предыдущие_ДатыРасчетаСоСЧА.СЧА, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(_ДатыРасчетаСоСЧА.СЧАбезВВ, 0) / Предыдущие_ДатыРасчетаСоСЧА.СЧА КАК ЧИСЛО(15, 10))
		|	КОНЕЦ КАК Прирост,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 10)) КАК ПриростИтог
		|ПОМЕСТИТЬ _Расшифровка
		|ИЗ
		|	_ДатыРасчетаСоСЧА КАК _ДатыРасчетаСоСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыРасчетаСоСЧА КАК Предыдущие_ДатыРасчетаСоСЧА
		|		ПО _ДатыРасчетаСоСЧА.СубъектАналитики = Предыдущие_ДатыРасчетаСоСЧА.СубъектАналитики
		|			И _ДатыРасчетаСоСЧА.ПредыдущаяДатаРасчета = Предыдущие_ДатыРасчетаСоСЧА.ДатаРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.Стратегия КАК Стратегия,
		|	_ДатыРасчета.Период КАК ДатаСЧА
		|ПОМЕСТИТЬ _КонтрольСЧА
		|ИЗ
		|	_ДатыРасчета КАК _ДатыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДатыСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ДатыСЧА.ДатаСЧА КАК ДатаСЧА
		|		ИЗ
		|			_ДатыСЧА КАК _ДатыСЧА
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			_СчетаДоверительногоУправления.СчетДоверительногоУправления,
		|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|		ИЗ
		|			_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ГДЕ
		|			(_СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ _СчетаДоверительногоУправления.ДатаРасторжения >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))) КАК _ДатыСЧА
		|		ПО _ДатыРасчета.Период = _ДатыСЧА.ДатаСЧА
		|			И _ДатыРасчета.СубъектАналитики = _ДатыСЧА.СчетДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыПервыхВводов КАК _ДатыПервыхВводов
		|		ПО (_ДатыСЧА.СчетДоверительногоУправления = _ДатыПервыхВводов.СчетДоверительногоУправления)
		|			И (_ДатыСЧА.ДатаСЧА >= _ДатыПервыхВводов.Дата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ДатыРасчета.СубъектАналитики = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
		|		ПО _ДатыРасчета.СубъектАналитики = _СЧА.СчетДоверительногоУправления
		|			И _ДатыРасчета.Период = _СЧА.ДатаСЧА
		|ГДЕ
		|	_СЧА.СЧА ЕСТЬ NULL";

	Запрос.Выполнить();
	
#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область Расчет_резервов_ПИФ

Функция ПолучитьПредварительнуюСЧА(ПараметрыЗаполнения) Экспорт
	
	Запрос = Новый Запрос;
	
	ОтсутствуютНастройки = Ложь;	
	ДатаПредыдущегоСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(ПараметрыЗаполнения.СчетДоверительногоУправления, ПараметрыЗаполнения.Дата, ОтсутствуютНастройки); 
	Если ОтсутствуютНастройки Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СокрЛП(ПараметрыЗаполнения.СчетДоверительногоУправления) + " не определены настройки формирования СЧА на дату " + Формат(ПараметрыЗаполнения.Дата, "ДФ=dd.MM.yyyy") + "", ПараметрыЗаполнения.СчетДоверительногоУправления);
		Возврат Неопределено;
	КонецЕсли;
	                                                                                                                                                                 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаКурса", 							НачалоДня(ПараметрыЗаполнения.Дата));
	Запрос.УстановитьПараметр("Организация", 						ПараметрыЗаполнения.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 		ПараметрыЗаполнения.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", 			ПараметрыЗаполнения.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("ВалютаУчета", 						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаполнения.Организация, "ВалютаУчета")); 	
	Запрос.УстановитьПараметр("ДатаПредыдущегоСЧА", 				Новый Граница(КонецДня(ДатаПредыдущегоСЧА), ВидГраницы.Включая));		
	Запрос.УстановитьПараметр("ПериодОкончание", 					Новый Граница(КонецДня(ПараметрыЗаполнения.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СтоимостиПереоценки", 				ПараметрыЗаполнения.СтоимостиПереоценки);
	Запрос.УстановитьПараметр("АктивыНеОтносящиесяКЦеннымБумагам", 	ПараметрыЗаполнения.АктивыНеОтносящиесяКЦеннымБумагам);
	
	Справочники.ВариантыРасчетаОценочнойСтоимости.ПоместитьКурсыВалютВМенеджерВременныхТаблиц(Запрос, НачалоДня(ПараметрыЗаполнения.Дата));
	
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеУправляющего) КАК Резерв
		|ПОМЕСТИТЬ _РезервыДляУчетаВСЧА
		|ИЗ
		|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&ПериодОкончание, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
		|ГДЕ
		|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеДепозитарияАудитораОценщика)
		|ИЗ
		|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&ПериодОкончание, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
		|ГДЕ
		|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Резервы.ПрочиеВозмещаемыеРасходыУправляющего)
		|ИЗ
		|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&ПериодОкончание, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
		|ГДЕ
		|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезервыПИФОстаткиИОбороты.Резерв КАК Резерв,
		|	РезервыПИФОстаткиИОбороты.Валюта КАК Валюта,
		|	-(РезервыПИФОстаткиИОбороты.СуммаКонечныйОстаток - РезервыПИФОстаткиИОбороты.СуммаПриход) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиРезервов
		|ИЗ
		|	РегистрНакопления.РезервыПИФ.ОстаткиИОбороты(
		|			&ДатаПредыдущегоСЧА,
		|			&ПериодОкончание,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Резерв В
		|					(ВЫБРАТЬ
		|						_РезервыДляУчетаВСЧА.Резерв
		|					ИЗ
		|						_РезервыДляУчетаВСЧА)) КАК РезервыПИФОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостиПереоценки.СуммаКупонаВВалютеУчета + СтоимостиПереоценки.СуммаВВалютеУчета КАК Сумма
		|ПОМЕСТИТЬ _РСП
		|ИЗ
		|	&СтоимостиПереоценки КАК СтоимостиПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктивыНеОтносящиесяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК Сумма,
		|	АктивыНеОтносящиесяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
		|	ВЫРАЗИТЬ(АктивыНеОтносящиесяКЦеннымБумагам.Основание КАК Документ.НачислениеЗадолженности) КАК Основание
		|ПОМЕСТИТЬ _ПрочиеАктивыНеРезервы
		|ИЗ
		|	&АктивыНеОтносящиесяКЦеннымБумагам КАК АктивыНеОтносящиесяКЦеннымБумагам
		|ГДЕ
		|	ВЫРАЗИТЬ(АктивыНеОтносящиесяКЦеннымБумагам.ВидЗадолженности КАК Справочник.Резервы) ЕСТЬ NULL
		|	И АктивыНеОтносящиесяКЦеннымБумагам.Примечание <> ""КЗ: Расч. По вознаграждению управляющего""
		|	И АктивыНеОтносящиесяКЦеннымБумагам.Примечание <> ""КЗ: Расч. расходы по вознаграждению спецдепозитария""
		|	И АктивыНеОтносящиесяКЦеннымБумагам.Примечание <> ""КЗ: Расч. расходы по вознаграждению спец.регистратора""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА НЕ УсловияПравилПаевогоИнвестиционногоФонда.УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего
		|				И УсловияПравилПаевогоИнвестиционногоФонда.РасчетРезерваПИФНаВознаграждениеУправляющегоОтСреднегодовойСЧА
		|				И _ПрочиеАктивыНеРезервы.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|				И НАЧАЛОПЕРИОДА(_ПрочиеАктивыНеРезервы.Основание.Дата, ДЕНЬ) = &ДатаКурса
		|			ТОГДА 0
		|		ИНАЧЕ _ПрочиеАктивыНеРезервы.Сумма
		|	КОНЕЦ КАК Сумма
		|ПОМЕСТИТЬ _РСА
		|ИЗ
		|	_ПрочиеАктивыНеРезервы КАК _ПрочиеАктивыНеРезервы
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Составляющие.БазаРасчета ЕСТЬ НЕ NULL  КАК РасчетРезерваПИФНаВознаграждениеУправляющегоОтСреднегодовойСЧА,
		|			УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего КАК УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего
		|		ИЗ
		|			РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&ПериодОкончание, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК Составляющие
		|				ПО УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.НастройкаРасчетаРезервовЗаВознаграждениеУправляющего = Составляющие.Ссылка
		|					И (Составляющие.БазаРасчета = ЗНАЧЕНИЕ(Справочник.БазыРасчета.РасчетРезерваПИФОтСреднегодовойСЧА))) КАК УсловияПравилПаевогоИнвестиционногоФонда
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиРезервов.Сумма * _КурсыВалют.Курс / _КурсыВалютыУчета.Курс КАК Сумма
		|ПОМЕСТИТЬ _Объединение
		|ИЗ
		|	_ОстаткиРезервов КАК _ОстаткиРезервов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
		|		ПО _ОстаткиРезервов.Валюта = _КурсыВалют.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалютыУчета
		|		ПО (_КурсыВалютыУчета.Валюта = &ВалютаУчета)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СУММА(_РСП.Сумма) КАК ЧИСЛО(19, 2))
		|ИЗ
		|	_РСП КАК _РСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_РСА.Сумма
		|ИЗ
		|	_РСА КАК _РСА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(_Объединение.Сумма), 0) КАК Сумма
		|ИЗ
		|	_Объединение КАК _Объединение";		
	#КонецОбласти 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ПоместитьОстаткиРезервовВМенеджерВременныхТаблиц(Запрос) Экспорт

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеУправляющего) КАК Резерв
	|ПОМЕСТИТЬ _РезервыДляУчетаВСЧА
	|ИЗ
	|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(
	|			&ПериодОкончание,
	|			ПаевойИнвестиционныйФонд В
	|				(ВЫБРАТЬ
	|					КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|				ИЗ
	|					РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ПериодОкончание, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
	|ГДЕ
	|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеДепозитарияАудитораОценщика)
	|ИЗ
	|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(
	|			&ПериодОкончание,
	|			ПаевойИнвестиционныйФонд В
	|				(ВЫБРАТЬ
	|					КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|				ИЗ
	|					РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ПериодОкончание, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
	|ГДЕ
	|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Резервы.ПрочиеВозмещаемыеРасходыУправляющего)
	|ИЗ
	|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(
	|			&ПериодОкончание,
	|			ПаевойИнвестиционныйФонд В
	|				(ВЫБРАТЬ
	|					КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|				ИЗ
	|					РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ПериодОкончание, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
	|ГДЕ
	|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервыПИФОстаткиИОбороты.Резерв КАК Резерв,
	|	РезервыПИФОстаткиИОбороты.Валюта КАК Валюта,
	|	-(РезервыПИФОстаткиИОбороты.СуммаКонечныйОстаток - РезервыПИФОстаткиИОбороты.СуммаПриход) КАК Сумма
	|ПОМЕСТИТЬ _ОстаткиРезервов
	|ИЗ
	|	РегистрНакопления.РезервыПИФ.ОстаткиИОбороты(
	|			&ПериодНачало,
	|			&ПериодОкончание,
	|			,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Резерв В
	|					(ВЫБРАТЬ
	|						_РезервыДляУчетаВСЧА.Резерв
	|					ИЗ
	|						_РезервыДляУчетаВСЧА)) КАК РезервыПИФОстаткиИОбороты";
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_функции

Процедура ЗарегистрироватьОшибку(ТекстОшибки, МассивОшибок, Отказ)
	
	Если МассивОшибок = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	ИначеЕсли МассивОшибок.Найти(ТекстОшибки) = Неопределено Тогда
		МассивОшибок.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция РасшифровкаСтрокФинПоказателей(ТабличныйДокумент, МакетРасшифровка, РасшифровкаРасчета, НомерСтроки) Экспорт
	
	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("НомерСтроки", "Строка" + НомерСтроки);
	
	Если ПустаяСтрока(НомерСтроки) Тогда
		ПараметрыРасшифровки.Вставить("НомерСтроки", "");
		ПараметрыРасшифровки.Вставить("СуффиксМакета", "");
		
	ИначеЕсли НомерСтроки > "020" Тогда
		ПараметрыРасшифровки.Вставить("СуффиксМакета", "3040");
		
	Иначе
		ПараметрыРасшифровки.Вставить("СуффиксМакета", "1020");
		
	КонецЕсли;
	
	ОбластьШапка	= МакетРасшифровка.ПолучитьОбласть("Шапка" + ПараметрыРасшифровки.СуффиксМакета);
	ОбластьСтрока	= МакетРасшифровка.ПолучитьОбласть("Строка" + ПараметрыРасшифровки.СуффиксМакета);
	ОбластьИтог		= МакетРасшифровка.ПолучитьОбласть("Итог" + ПараметрыРасшифровки.СуффиксМакета);
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, РасшифровкаРасчета);
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ПараметрыРасшифровки);

	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Для Каждого СтрокаРасшифровки Из РасшифровкаРасчета.Таблица Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаРасшифровки);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, РасшифровкаРасчета);
	ТабличныйДокумент.Вывести(ОбластьИтог);

КонецФункции	

Функция ПолучитьТекстЗапросаДляСпискаЦБ(ТаблицаЦБ = Неопределено, ДетализацияПоПартиям = Ложь) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.Партия КАК Партия,
		|	СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.ВидУчета КАК ВидУчета,
		|	СтоимостьПереоценки.Рынок КАК Рынок,
		|	ВЫРАЗИТЬ(СтоимостьПереоценки.Цена КАК ЧИСЛО) КАК Стоимость,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки,
		|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
		|	СтоимостьПереоценки.Источник КАК Источник,
		|	СтоимостьПереоценки.РучнойВвод КАК РучнойВвод,
		|	СтоимостьПереоценки.ВидЦеныОценки КАК ВидЦеныОценки,
		|	СтоимостьПереоценки.Примечание КАК Примечание,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) КАК Сумма,
		|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Купон,
		|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
		|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета + СтоимостьПереоценки.СуммаВВалютеУчета) КАК ИтогоРынок
		|ПОМЕСТИТЬ _ТаблицаЦБ
		|ИЗ
		|	_Источник КАК СтоимостьПереоценки
		|ГДЕ
		|	&Условия
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.Партия,
		|	СтоимостьПереоценки.СтрокаПартии,
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.ВидУчета,
		|	СтоимостьПереоценки.Рынок,
		|	СтоимостьПереоценки.ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки,
		|	СтоимостьПереоценки.ДатаЦены,
		|	СтоимостьПереоценки.Источник,
		|	СтоимостьПереоценки.РучнойВвод,
		|	СтоимостьПереоценки.ВидЦеныОценки,
		|	СтоимостьПереоценки.Примечание,
		|	ВЫРАЗИТЬ(СтоимостьПереоценки.Цена КАК ЧИСЛО)";   	
	
	ТипЧислаЦена = Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип.КвалификаторыЧисла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЧИСЛО(0, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТипЧислаЦена.Разрядность, ТипЧислаЦена.РазрядностьДробнойЧасти));
	
	Если Не ДетализацияПоПартиям Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтоимостьПереоценки.Партия КАК Партия,", 				"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,",	"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтоимостьПереоценки.Партия,",			"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтоимостьПереоценки.СтрокаПартии,",	"");
	КонецЕсли;
	
	Если ТаблицаЦБ = Неопределено Тогда
						
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_Источник", "РегистрСведений.СтоимостьПереоценки");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условия", "СтоимостьПереоценки.Период = &Период
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ВидУчета = &ВидУчета
		|	И СтоимостьПереоценки.ЦельРасчета = &ЦельРасчета
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)");
		
	Иначе
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьПереоценки.Партия КАК Партия,
			|	СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,
			|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	&ВидУчета КАК ВидУчета,
			|	СтоимостьПереоценки.Рынок КАК Рынок,
			|	СтоимостьПереоценки.Цена КАК Цена,
			|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
			|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки,
			|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
			|	СтоимостьПереоценки.Источник КАК Источник,
			|	СтоимостьПереоценки.РучнойВвод КАК РучнойВвод,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки) КАК ВидЦеныОценки,
			|	СтоимостьПереоценки.Примечание КАК Примечание,
			|	СтоимостьПереоценки.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
			|	СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
			|	СтоимостьПереоценки.Количество КАК Количество
			|ПОМЕСТИТЬ _СтоимостьПереоценки
			|ИЗ
			|	&ТаблицаЦБ КАК СтоимостьПереоценки" + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|" + ТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_Источник", "_СтоимостьПереоценки");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условия", "ИСТИНА");
		
	КонецЕсли; 
	
	Возврат ТекстЗапроса;	
	
КонецФункции 

#КонецОбласти
