
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ЗапомнитьПароль = ЗначениеЗаполнено(Объект.Пароль);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	Если ЭтаФорма.Параметры.БлокироватьВладельца Тогда
		ЭтаФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	Если Не ЗапомнитьПароль Тогда
		ТекущийОбъект.Пароль = "";
	КонецЕсли;
	
	Если Объект.SMTPАутентификация <> Перечисления.ВариантыSMTPАутентификации.ЗадаетсяПараметрами Тогда
		Объект.ПользовательSMTP = "";
		Объект.ПарольSMTP       = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановкаДополнительныхПараметровУчетнойЗаписи" И Источник = Объект.Ссылка Тогда
		Объект.ВремяОжидания                    = Параметр.ДлительностьОжиданияСервера;
		Объект.ОставлятьКопииСообщенийНаСервере = Параметр.ОставлятьКопииСообщенийНаСервере;
		Объект.ПериодХраненияСообщенийНаСервере = Параметр.ПериодХраненияСообщенийНаСервере;
		Объект.ПользовательSMTP                 = Параметр.ПользовательSMTP;
		Объект.ПарольSMTP                       = Параметр.ПарольSMTP;
		Объект.ПортIMAP                         = Параметр.ПортIMAP;
		Объект.ПортSMTP                         = Параметр.ПортSMTP;
		Объект.SMTPАутентификация               = Параметр.SMTPАутентификация;
		Объект.МаксимальныйРазмерПисьма         = Параметр.МаксимальныйРазмерПисьма;
		Объект.ТолькоЗащищеннаяАутентификацияIMAP         = Параметр.ТолькоЗащищеннаяАутентификацияIMAP;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ДополнительныеНастройкиВыполнить()
	
	УчетнаяЗаписьСтруктура = Новый Структура;
	УчетнаяЗаписьСтруктура.Вставить("ВремяОжидания",                    Объект.ВремяОжидания);
	УчетнаяЗаписьСтруктура.Вставить("ОставлятьКопииСообщенийНаСервере", Объект.ОставлятьКопииСообщенийНаСервере);
	УчетнаяЗаписьСтруктура.Вставить("ПериодХраненияСообщенийНаСервере", Объект.ПериодХраненияСообщенийНаСервере);
	УчетнаяЗаписьСтруктура.Вставить("ПользовательSMTP",                 Объект.ПользовательSMTP);
	УчетнаяЗаписьСтруктура.Вставить("ПарольSMTP",                       Объект.ПарольSMTP);
	УчетнаяЗаписьСтруктура.Вставить("ПортIMAP",                         Объект.ПортIMAP);
	УчетнаяЗаписьСтруктура.Вставить("ПортSMTP",                         Объект.ПортSMTP);
	УчетнаяЗаписьСтруктура.Вставить("SMTPАутентификация",               Объект.SMTPАутентификация);
	УчетнаяЗаписьСтруктура.Вставить("МаксимальныйРазмерПисьма",         Объект.МаксимальныйРазмерПисьма);
	УчетнаяЗаписьСтруктура.Вставить("ТолькоЗащищеннаяАутентификацияIMAP",         Объект.ТолькоЗащищеннаяАутентификацияIMAP);
	
	ПараметрыВызова = Новый Структура("Ссылка, УчетнаяЗаписьСтруктура, ТолькоПросмотр", Объект.Ссылка, УчетнаяЗаписьСтруктура, ТолькоПросмотр);
	
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.ДополнительныеСвойстваУчетнойЗаписи", ПараметрыВызова);
	
КонецПроцедуры
