
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_шапки_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		
	ОбновитьРеквизитДвиженияНаСервере("Дата", 	Объект.Дата);
		
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьРеквизитДвиженияНаСервере("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_таблицы_формы

&НаКлиенте
Процедура ИнвестиционныеРискиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвестиционныеРискиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущиеДанные.Организация 					= Объект.Организация;
	ТекущиеДанные.СчетДоверительногоУправления 	= Объект.СчетДоверительногоУправления;  	
	ТекущиеДанные.Дата 							= Объект.Дата;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитДвиженияНаСервере(ИмяРеквизита, Значение)
	
	Для каждого Движение Из Объект.Движения.СведенияОбОценкеИнвестиционныхРисков Цикл
		Движение[ИмяРеквизита] = Значение;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
