
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
		Элементы.ОрганизацияНадпись.Видимость = Ложь;	
	Иначе
		Элементы.Организация.Видимость = Ложь;	
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.Отбор);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Организация) Тогда
		ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда;
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ЭтаФорма.Подписант, ЭтаФорма.Организация);
	КонецЕсли;
	
	ОбновитьСписокВыбораПолучателей(ЭтаФорма);
	
	ЭтаФорма.ВсеАналоги = Не ЗначениеЗаполнено(ЭтаФорма.ЦеннаяБумага);
	
	Если Параметры.Свойство("СформироватьПриОткрытии") И Параметры.СформироватьПриОткрытии = Истина Тогда
		Сформировать();
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтаФорма.ВсеАналоги Тогда
		ПроверяемыеРеквизиты.Добавить("ЦеннаяБумага");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьСписокВыбораПолучателей(ЭтаФорма);	
	
	ПриИзмененииРеквизитовШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ОбновитьСписокВыбораПолучателей(ЭтаФорма);	
	
	ПриИзмененииРеквизитовШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьСписокВыбораПолучателей(ЭтаФорма);	
	
	ПриИзмененииРеквизитовШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	
	ПриИзмененииРеквизитовШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	ПриИзмененииРеквизитовШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантНачалоВыбора(ЭтаФорма, Элемент, ЭтаФорма.Подписант, ЭтаФорма.Организация, СтандартнаяОбработка); 	

КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ЭтаФорма.СтруктураДанныхКонтактногоЛица, ЭтаФорма.Организация); 	
	
	ЭтаФорма.Подписант = ?(ЭтаФорма.СтруктураДанныхКонтактногоЛица = Неопределено, Неопределено, ЭтаФорма.СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	РаботаСОтчетамиКлиент.ПодписантПриИзменении(ЭтаФорма.Подписант, ЭтаФорма.СтруктураДанныхКонтактногоЛица);	
	
	ПриИзмененииРеквизитовШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеАналогиПриИзменении(Элемент)
	
	Если ЭтаФорма.ВсеАналоги Тогда
		ЭтаФорма.ЦеннаяБумага = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
	ПриИзмененииРеквизитовШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	Сформировать();
	
КонецПроцедуры

&НаСервере
Процедура Сформировать()

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ФормированиеПисьма = Обработки.ПечатьСпискаАналогичныхЦенныхБумаг.Создать();	
	
	ТабличныйДокумент.Очистить();
	
	ТабличныйДокумент = ФормированиеПисьма.СформироватьПечатнуюФормуСпискаАналогов(ЭтаФорма.Клиент, ЭтаФорма.Организация, ЭтаФорма.Период, ЭтаФорма.ЦеннаяБумага, ЭтаФорма.Получатель, ЭтаФорма.СтруктураДанныхКонтактногоЛица);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеИспользовать");			
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписокВыбораПолучателей(ЭтаФорма)
	
	СписокВыбораПолучателя = ЭтаФорма.Элементы.Получатель.СписокВыбора;
	СписокВыбораПолучателя.Очистить();
	
	Если ЗначениеЗаполнено(ЭтаФорма.Клиент) Тогда

		ВозможныеПолучатели = ПолучитьВозможныхПолучателей(ЭтаФорма.Клиент, ЭтаФорма.Организация, ЭтаФорма.Период);
		
		СписокВыбораПолучателя.ЗагрузитьЗначения(ВозможныеПолучатели);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВозможныхПолучателей(Клиент, Организация, Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Клиент",	Клиент);
	
	РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(Клиент, Организация, Период, Истина, "_СчетаКлиента", Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаКлиента.СчетДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо КАК Получатель
		|ИЗ
		|	_СчетаКлиента КАК _СчетаКлиента
		|ГДЕ
		|	_СчетаКлиента.СчетДоверительногоУправления.СпециализированныйДепозитарий <> ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Клиент";
	
	ВозможныеПолучатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
	
	Возврат ВозможныеПолучатели;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Форма.Элементы.ЦеннаяБумага.Доступность = Не Форма.ВсеАналоги;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовШапки()
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");		
	
КонецПроцедуры
