
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСделкаПриИзменении(Элемент)
	ЦенныеБумагиСделкаПриИзмененииНаСервере(Элементы.ЦенныеБумаги.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЦенныеБумагиСделкаПриИзмененииНаСервере(ИдСтрокиЦБ)
	
	ТекСтрока = Объект.ЦенныеБумаги.НайтиПоИдентификатору(ИдСтрокиЦБ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка.Рынок,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРЕПОЦенныеБумаги.Ссылка.Рынок,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.Количество
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрока.Сделка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекСтрока.Рынок        = ВыборкаДетальныеЗаписи.Рынок;
		ТекСтрока.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
		ТекСтрока.Количество   = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ЦеннаяБумага, УчетныйАктивЕПС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка.Рынок КАК Рынок,
		|	&ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Ссылка КАК Сделка,
		|	&УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
		|	И СделкаЦенныеБумаги.Ссылка.Организация = &Организация
		|	И СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаЦенныеБумаги.ЦеннаяБумага = &ЦеннаяБумага
		|	И СделкаЦенныеБумаги.Ссылка.ВидСделки = &ВидСделки";

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидСделки", Перечисления.ВидыСделок.Покупка);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("УчетныйАктивЕПС", УчетныйАктивЕПС);

	Объект.ЦенныеБумаги.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	БумагаАктив = ОткрытьФормуМодально("Документ.РаспределениеАктивовЕПС.Форма.ФормаВыбораРаспределения");
	
	Если БумагаАктив <> Неопределено Тогда
	
		ЗаполнитьНаСервере(БумагаАктив.ЦеннаяБумага, БумагаАктив.УчетныйАктивЕПС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЭСПНаРыночностьСервере(НомерСтроки)
	
	ДатаПереоценки = НачалоДня(Объект.Дата);
	
	СтрокаЦенныеБумаги = Объект.ЦенныеБумаги[НомерСтроки - 1];
	
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(СтрокаЦенныеБумаги);
	
	ДанныеЦенныеБумаги = Объект.ЦенныеБумаги.Выгрузить(МассивСтрок);
	ДанныеЦенныеБумаги.Колонки.Сделка.Имя = "Партия";
	
	ДанныеЦенныеБумаги.Колонки.Добавить("СтрокаПартии", Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
	Для каждого СтрокаДанныеЦенныеБумаги Из ДанныеЦенныеБумаги Цикл
		СтрокаДанныеЦенныеБумаги.СтрокаПартии = 1;
	КонецЦикла;
	
	ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ДанныеЦенныеБумаги, Объект.СчетДоверительногоУправления, ДатаПереоценки).Выгрузить();
	
	ПараметрыПроверки = РаботаСКоллекциями.ТаблицаЗначений_В_МассивСтруктур(ДатыИЦеныПокупки);
	
	Облигация = СтрокаЦенныеБумаги.ЦеннаяБумага;
	
	ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ВидУчета);
	НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(ДатаПереоценки, Объект.Организация, Объект.СчетДоверительногоУправления, ЦельРасчета);
	ВариантРасчетаОценочнойСтоимости = НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости;
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("Организация",							Объект.Организация);
	ПараметрыОценки.Вставить("СчетДоверительногоУправления",		Объект.СчетДоверительногоУправления);
	ПараметрыОценки.Вставить("ВидУчета",							ВидУчета);
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости",	ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("Клиент",								Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, ДатаПереоценки));
	ПараметрыОценки.Вставить("ПараметрыПолученияПартий",			РаботаСПереоценкой.ПолучитьПараметрыПолученияПартийПоМетодике(ЦельРасчета, ВидУчета, ВариантРасчетаОценочнойСтоимости, ДатаПереоценки));
	
	Отказ = Ложь;
	
	ПараметрыДенежногоПотока = РаботаСПереоценкой.ПолучитьПараметрыДенежногоПотока(ПараметрыОценки, ДатаПереоценки, Облигация, Отказ);
	Если Отказ Тогда
	    Возврат Неопределено;
	КонецЕсли;
	
	ДоходностьДюрация = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
							Облигация,
							ПараметрыДенежногоПотока.ДоДатыПогашения,
							ДатаПереоценки,
							ПараметрыПроверки[0].ЦенаПокупки,
							Объект.СчетДоверительногоУправления,
							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	
	Если ТипЗнч(ДоходностьДюрация) = Тип("Структура") Тогда
		
		ЭСП = ДоходностьДюрация.Доходность;
		
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки, Объект.Организация, Объект.СчетДоверительногоУправления);
		Если НастройкиУчета.РазрядностьОкругленияЭСП > 0 Тогда
			ЭСП = Окр(ЭСП, НастройкиУчета.РазрядностьОкругленияЭСП);
		Иначе
			ЭСП = Метаданные.ОпределяемыеТипы.ЭффективнаяПроцентнаяСтавка.Тип.ПривестиЗначение(ЭСП);	
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	Отчет = Новый ТабличныйДокумент;;
	
	Если БухгалтерскийУчетЕПС.ПроверитьЭСПНаРыночность(Облигация, ЭСП, ДатаПереоценки, Объект.СчетДоверительногоУправления, Отчет, ПараметрыПроверки[0], Отказ) <> Неопределено Тогда
		Возврат Отчет;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЭСПНаРыночность(Команда)
	
	ДанныеЦенныхБумаг = ЭтаФорма.Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ДанныеЦенныхБумаг = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите сделку!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЦенныхБумаг.УчетныйАктивЕПС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран учетный актив ЕПС!");
		Возврат;
	КонецЕсли;
	
	Отчет = ПроверитьЭСПНаРыночностьСервере(ДанныеЦенныхБумаг.НомерСтроки);
	
	Если Отчет <> Неопределено Тогда
		Отчет.Показать("ПроверкаЭСП");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.ПоСделке) Тогда
		Форма.Элементы.РучнойВвод.Видимость = Истина;
		Форма.Элементы.СчетДоверительногоУправления.Доступность = Объект.РучнойВвод;
		Форма.Элементы.ЦенныеБумаги.ТолькоПросмотр = Не Объект.РучнойВвод;
		Форма.Элементы.ЦенныеБумагиЗаполнить.Доступность = Объект.РучнойВвод;
	Иначе	
		Форма.Элементы.РучнойВвод.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Асинх Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
	Если Не Объект.РучнойВвод Тогда
	
		РезультатВопроса = Ждать ВопросАсинх("При отключении ручного режима производится возврат к автоматически рассчитанным показателям. Вы уверены?", РежимДиалогаВопрос.ДаНет);
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			РаспределитьАктивыЕПС();
		Иначе
			Объект.РучнойВвод = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьАктивыЕПС()
	
	КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	НастройкиЦенныхБумаг = НастройкиУчета.НастройкиУчетаЦенныхБумаг;
	
	Для Каждого СтрокаЦенныеБумаги Из Объект.ЦенныеБумаги Цикл
		
		ОбъектРаспределения = Новый Структура;
		ОбъектРаспределения.Вставить("ЦеннаяБумага", СтрокаЦенныеБумаги.ЦеннаяБумага);
		ОбъектРаспределения.Вставить("НастройкиЦенныхБумаг", НастройкиЦенныхБумаг);
		ОбъектРаспределения.Вставить("Дата", Объект.Дата);
		ОбъектРаспределения.Вставить("Ссылка", СтрокаЦенныеБумаги.Сделка);
		ОбъектРаспределения.Вставить("СтрокаПартии", 1);

		Отказ = Ложь;
		
		УчетныйАктивЕПС = БухгалтерскийУчетЕПС.РаспределитьАктивЕПС(Объект.СчетДоверительногоУправления, КлиентДоверительногоУправления, ОбъектРаспределения, Отказ);

		Если Не Отказ И ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда
			
			СтрокаЦенныеБумаги.УчетныйАктивЕПС = УчетныйАктивЕПС;
			
		Иначе	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось автоматически распределить ценную бумагу " + Строка(СтрокаЦенныеБумаги.ЦеннаяБумага), , , , Отказ);
			
			Объект.РучнойВвод = Истина;
			
			Возврат;
			
		КонецЕсли;	
						
	КонецЦикла;						
						
КонецПроцедуры						
