
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Объект.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	Объект.ИмпортироватьТолькоОтсутствующиеКотировки = Ложь;
		
	Если ЭтаФорма.Параметры.Свойство("ЦеннаяБумага") Тогда
		Объект.ЦеннаяБумага = ЭтаФорма.Параметры.ЦеннаяБумага;
		ЭтаФорма.ОтборПоЦеннойБумаге = Истина;
	КонецЕсли;
	
	Элементы.ЦеннаяБумага.Видимость = ЭтаФорма.ОтборПоЦеннойБумаге;
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОтборПоЦеннойБумаге И Не ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При отборе необходимо указать ценную бумагу.",,, "Объект.ЦеннаяБумага", Отказ);
	КонецЕсли;
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Объект.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Объект.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДНаСервере()
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРД();
	
	Если Объект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		 Объект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьРасчетныеЦеныПоНовойМетодикеНРДНаСервере()
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьРасчетныеЦеныПоНовойМетодикеНРД();
	
	Если Объект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Объект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьРасчетныеЦеныRUDataНаСервере()
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьРасчетныеЦеныRUData();
	
	Если Объект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Объект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЦеннойБумагеПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ОтборПоЦеннойБумаге Тогда
		Объект.ЦеннаяБумага = Неопределено;
	КонецЕсли;
	
	Элементы.ЦеннаяБумага.Видимость = ЭтаФорма.ОтборПоЦеннойБумаге;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРД(Команда)
	
	КомандаЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьРасчетныеЦеныПоНовойМетодикеНРД(Команда)
	
	КомандаЗагрузитьРасчетныеЦеныПоНовойМетодикеНРДНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьРасчетныеЦеныRUData(Команда)
	
	КомандаЗагрузитьРасчетныеЦеныRUDataНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДизЭкстерналсНаСервере()
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДизЭкстерналс();
	
	Если Объект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Объект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДизЭкстерналс(Команда)
	
	КомандаЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДизЭкстерналсНаСервере();
	
КонецПроцедуры
