
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьДанныеНаСервере(Параметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(Параметры)
	
	Если Параметры.Свойство("Расшифровка") Тогда
		
		Расшифровка = Параметры.Расшифровка;
		
		ИмяТипаСтрока = Расшифровка.ИмяТипа;
		
		ТекстXML = ПолучитьИзВременногоХранилища(Расшифровка.АдресXML).Получить();
		
		Представление = Новый ФорматированнаяСтрока(СтрШаблон(" (%1)", Расшифровка.Представление), Новый Шрифт( , , , Истина), Новый Цвет(192, 0, 0));
		ИмяТипа       = Новый ФорматированнаяСтрока(Расшифровка.ИмяТипа, Новый Шрифт( , , Истина));
		ОписаниеТипа  = Новый ФорматированнаяСтрока(ИмяТипа, Представление);
		
		ТаблицаФасетов = ПолучитьИзВременногоХранилища(Расшифровка.АдресФасеты).Получить();
				
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Фасеты");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Для Каждого СтрокаФасета Из ТаблицаФасетов Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(СтрокаФасета);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;	
		
		Если ТаблицаФасетов.Количество() Тогда
			Элементы.Ограничения.Заголовок = СтрШаблон("Ограничения (%1)", ТаблицаФасетов.Количество());
		КонецЕсли;	
	КонецЕсли;	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Закрыть;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		Если ЗначениеЗаполнено(Область.Текст) Тогда
			СредстваБуфераОбмена.ПоместитьДанныеАсинх(Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, СокрЛП(Область.Текст)));
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеТипаНажатие(Элемент, СтандартнаяОбработка)

	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		СтандартнаяОбработка = Ложь;
		СредстваБуфераОбмена.ПоместитьДанныеАсинх(Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, ИмяТипаСтрока));
	КонецЕсли;	
	Состояние("Имя типа скопировано в буфер обмена");
	
КонецПроцедуры

&НаКлиенте
Процедура Буфер(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Буфер");
	Попытка
		ВыполнитьКопированиеВБуфер();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКопированиеВБуфер()
	
	ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
	Если ВыделенныеОбласти.Количество() = 1 Тогда
		ВыделеннаяОбласть = ВыделенныеОбласти[0];
		
		СтрокиСТекстом  = Новый СписокЗначений;
		СтолбцыСТекстом = Новый СписокЗначений;
		
		Для ТекСтрока = ВыделеннаяОбласть.Верх По ВыделеннаяОбласть.Низ Цикл
			Для ТекСтолбец = ВыделеннаяОбласть.Лево По ВыделеннаяОбласть.Право Цикл
				ТекущаяОбласть = ТабличныйДокумент.Область(ТекСтрока, ТекСтолбец, ТекСтрока, ТекСтолбец);
				Если ТекущаяОбласть.Видимость Тогда
					ТекущийТекст = СокрЛП(ТекущаяОбласть.Текст);
					Если ЗначениеЗаполнено(ТекущийТекст) Тогда
						Если СтолбцыСТекстом.НайтиПоЗначению(ТекСтолбец) = Неопределено Тогда
							СтолбцыСТекстом.Добавить(ТекСтолбец);	
						КонецЕсли;	
						Если СтрокиСТекстом.НайтиПоЗначению(ТекСтрока) = Неопределено Тогда
							СтрокиСТекстом.Добавить(ТекСтрока);	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;
		СтрокиСТекстом.СортироватьПоЗначению();
		СтолбцыСТекстом.СортироватьПоЗначению();
		
		ИтоговыйТекст = "";
		Для Каждого СтрокаСписка Из СтрокиСТекстом Цикл
			ТекстСтроки = Новый Массив;
			Для Каждого СтолбецСписка Из СтолбцыСТекстом Цикл
				ТекущаяОбласть = ТабличныйДокумент.Область(СтрокаСписка.Значение, СтолбецСписка.Значение, СтрокаСписка.Значение, СтолбецСписка.Значение);
				ТекущийТекст   = СокрЛП(ТекущаяОбласть.Текст);
				ТекстСтроки.Добавить(ТекущийТекст);
			КонецЦикла;	
			ИтоговыйТекст = ИтоговыйТекст + СтрСоединить(ТекстСтроки, Символы.Таб) + Символы.ПС;
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(ИтоговыйТекст) Тогда
			ИтоговыйТекст = Лев(ИтоговыйТекст, СтрДлина(ИтоговыйТекст) - 1);
		КонецЕсли;	
		
		Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
			СредстваБуфераОбмена.ПоместитьДанныеАсинх(Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, ИтоговыйТекст));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти