Перем ТекущееОписание;
Перем ОписаниеТиповДокумента;
Перем ДокументDOM;
Перем КэшXML;
Перем RegExp;
Перем КэшRegExp;
Перем КэшДанныхТипа;
Перем ОбластьЭлементItemШапкаАтрибутов;

Функция ПредставлениеXSD(АдресФайла) Экспорт
	
	КэшXML        = Новый Соответствие;
	КэшДанныхТипа = Новый Соответствие;
	КэшRegExp     = Новый Соответствие;
	
	Макет = ПолучитьМакет("ПредставлениеXSD");
	ОбластьЭлементItemШапкаАтрибутов = Макет.ПолучитьОбласть("СтрокаItem|ItemШапкаАтрибутов");
	
	// Используем регулярные выражения для анализа имени атрибутов
	RegExp         = Новый COMОбъект("VBScript.RegExp");
	RegExp.Global  = Истина;
	RegExp.Pattern = "^Value\d+$"; // Ищем по шаблону Value№, где номер это число
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xsd");
	ПолучитьИзВременногоХранилища(АдресФайла).Записать(ИмяФайла);

	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяФайла);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(Чтение);
	
	//СтрокаЗапросаXPath = "//xs:complexType[@name='type_sr_0420011_ODS_nfo_r1_p1_p1_ostatki']/xs:annotation/xs:documentation";
	//ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath(СтрокаЗапросаXPath, ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
	//ЭлементDOM =  ВыборкаXPath.ПолучитьСледующий();
	//Сообщить(ЭлементDOM.ТекстовоеСодержимое);
	
	// Извлечение описаний .../annotation/documentation
	ОписаниеТиповДокумента = Новый Соответствие;
	
	СписокЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("xs:annotation");
	Для Каждого ЭлементDOM Из СписокЭлементов Цикл
		
		Если ЭлементDOM.РодительскийУзел.ИмяУзла = "xs:complexType" Тогда
			ОписаниеТиповДокумента.Вставить(СокрЛП(ЭлементDOM.РодительскийУзел.Атрибуты.ПолучитьИменованныйЭлемент("name").ТекстовоеСодержимое), 
											СокрЛП(ЭлементDOM.ТекстовоеСодержимое));
		КонецЕсли;	
		Если ЭлементDOM.РодительскийУзел.ИмяУзла = "xs:element" Тогда
			СоставноеИмя = СтрШаблон("%1/%2", СокрЛП(ЭлементDOM.РодительскийУзел.Атрибуты.ПолучитьИменованныйЭлемент("name").ТекстовоеСодержимое),
												СтрЗаменить(СокрЛП(ЭлементDOM.РодительскийУзел.Атрибуты.ПолучитьИменованныйЭлемент("type").ТекстовоеСодержимое), "tns:", ""));
			ОписаниеТиповДокумента.Вставить(СоставноеИмя, 
											СокрЛП(ЭлементDOM.ТекстовоеСодержимое));
		КонецЕсли;	
		
	КонецЦикла;	
	
	СписокЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("xs:restriction");
	Для Каждого ЭлементDOM Из СписокЭлементов Цикл
		ИмяТипаРодителя = СокрЛП(ЭлементDOM.РодительскийУзел.Атрибуты.ПолучитьИменованныйЭлемент("name").ТекстовоеСодержимое);
		Для Каждого ЭлементОграниченияDOM Из ЭлементDOM.ДочерниеУзлы Цикл
			
			Если ЭлементОграниченияDOM.ЛокальноеИмя = "enumeration" Тогда
				СоставноеИмя = СтрШаблон("%1/%2", ИмяТипаРодителя, СокрЛП(ЭлементОграниченияDOM.Атрибуты.ПолучитьИменованныйЭлемент("value").ТекстовоеСодержимое)); 
				Описание     = ?(ЭлементОграниченияDOM.ПервыйДочерний <> Неопределено, СокрЛП(ЭлементОграниченияDOM.ПервыйДочерний.ТекстовоеСодержимое), "");
				ОписаниеТиповДокумента.Вставить(СоставноеИмя, Описание);
			КонецЕсли;	
			
		КонецЦикла;
		
		СтрокаXML = КэшXML.Получить(ИмяТипаРодителя);
		
		Если СтрокаXML = Неопределено Тогда
			// Извлечение текста XML узла-типа
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			ЗаписьDOM = Новый ЗаписьDOM;
			ЗаписьDOM.Записать(ЭлементDOM.РодительскийУзел, ЗаписьXML);
			СтрокаXML = ЗаписьXML.Закрыть();		
			
			// Удаление лишнего описания пространства имен, т.к. в оригинальном XML его нет внутри элементов
			СтрокаXML = СтрЗаменить(СтрокаXML, " xmlns:xs=""http://www.w3.org/2001/XMLSchema""", "");
			КэшXML.Вставить(ИмяТипаРодителя, СтрокаXML);
		КонецЕсли;
		
	КонецЦикла;	
	
	// Следующие примеры ограничений иллюстририут логику кода получения данных ограничений выше (xs:restriction)
	
	//<xs:simpleType name="enum_Kod_ValyutyAxis_sr_0420011_ODS_nfo_r1_p1_p1_oboroty_total">
	//  <xs:restriction base="xs:string">
	//    <xs:enumeration value="Valyuta_008AllLekMember">
	//      <xs:annotation>
	//        <xs:documentation>008-ALL</xs:documentation>
	
	//<xs:simpleType name="type_Open_Dimension_Value">
	//  <xs:restriction base="xs:string">
	//    <xs:minLength value="1" />
	//    <xs:pattern value="[\S]|[^\s].*[^\s]" />
	
	//<xs:simpleType name="enum_Units">
	//  <xs:restriction base="xs:string">
	//    <xs:enumeration value="shares" />
	//    <xs:enumeration value="pure" />
	//    <xs:enumeration value="RUB" />
	
	
	НоваяФабрикаXDTO = СоздатьФабрикуXDTO(ИмяФайла);
	
	ТипXBRLEntryPoint = НоваяФабрикаXDTO.Тип("XBRL", "type_XBRL_Entry_Point");
	
	ДанныеТочкиВхода = ВывестиИнформациюОТочкеВхода(ТипXBRLEntryPoint);
	
	Возврат ДанныеТочкиВхода;
	
КонецФункции

Функция ВывестиИнформациюОТочкеВхода(ТипXDTO) 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ПредставлениеXSD");
	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(ОбластьПустаяСтрока);
	
	// Вывод атрибутов корневого узла XBRL с фиксированным значением 
	НачальнаяСтрока = ТабДок.ВысотаТаблицы + 1;
	Для Каждого СвойствоXDTO Из ТипXDTO.Свойства Цикл
		Если СвойствоXDTO.Форма = ФормаXML.Атрибут И СвойствоXDTO.Фиксированное Тогда
			ОбластьСтрокаТочкиВхода = Макет.ПолучитьОбласть("СтрокаТочкиВхода");
			ОбластьСтрокаТочкиВхода.Параметры.Атрибут  = СвойствоXDTO.Имя;
			ОбластьСтрокаТочкиВхода.Параметры.Значение = ОбработатьЗначениеСвойства(СвойствоXDTO);
			ТабДок.Вывести(ОбластьСтрокаТочкиВхода);
		КонецЕсли;	
	КонецЦикла;	
	
	ТабДок.Область(НачальнаяСтрока, 1, ТабДок.ВысотаТаблицы, 6).Объединить();
	
	// Вывод разделов
	
	РазделыОтчета = Новый ТаблицаЗначений;
	РазделыОтчета.Колонки.Добавить("ИмяРазделаДляСортировки", Новый ОписаниеТипов("Строка"));
	РазделыОтчета.Колонки.Добавить("СвойствоXDTO");
	
	Для Каждого СвойствоXDTO Из ТипXDTO.Свойства Цикл
		Если СвойствоXDTO.Форма = ФормаXML.Элемент И Не СтрНайти(ВРег("EPS_chasti,OFR_chasti"), ВРег(СокрЛП(СвойствоXDTO.Имя))) > 0   Тогда
			НоваяСтрока = РазделыОтчета.Добавить();
			НоваяСтрока.ИмяРазделаДляСортировки = ОбработатьИмяРазделаДляСортировки(СвойствоXDTO.Имя);
			НоваяСтрока.СвойствоXDTO            = СвойствоXDTO;
		КонецЕсли;	
	КонецЦикла;	
	РазделыОтчета.Сортировать("ИмяРазделаДляСортировки");
	
	RegExp.Pattern = "^Value\d+$"; // Ищем по шаблону Value№, где номер это число
	
	УникальныеЗначенияЗакрытыхОсей = Новый ТаблицаЗначений;
	УникальныеЗначенияЗакрытыхОсей.Колонки.Добавить("Раздел");
	УникальныеЗначенияЗакрытыхОсей.Колонки.Добавить("Элемент");
	УникальныеЗначенияЗакрытыхОсей.Колонки.Добавить("Описание");
	УникальныеЗначенияЗакрытыхОсей.Колонки.Добавить("ЗначениеАтрибута");
	УникальныеЗначенияЗакрытыхОсей.Колонки.Добавить("ОписаниеЗначения");
	УникальныеЗначенияЗакрытыхОсей.Колонки.Добавить("Ключ");
	
	ИменаРазделов  = Новый Массив;
	
	ТабличныеДанные = Новый	ТаблицаЗначений;
	ТабличныеДанные.Колонки.Добавить("Раздел");
	ТабличныеДанные.Колонки.Добавить("ТабДокументАдрес");
	ТабличныеДанные.Колонки.Добавить("АдресаЭлементовРасшифровок");
	
	Для Каждого Раздел Из РазделыОтчета Цикл

		СтруктураРаздела = СформироватьСтруктуруРаздела(Раздел.СвойствоXDTO);
		
		Если СтруктураРаздела.УникальныеЗначенияЗакрытыхОсей <> Неопределено Тогда
			Для Каждого СтрокаУникальныхЗначенийОсей Из СтруктураРаздела.УникальныеЗначенияЗакрытыхОсей Цикл
				НоваяСтрока = УникальныеЗначенияЗакрытыхОсей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУникальныхЗначенийОсей);
				НоваяСтрока.Раздел = ВРег(НоваяСтрока.Раздел);
				НоваяСтрока.Ключ   = СтрШаблон("Ось:%1,Значение:%2", НоваяСтрока.Описание, НоваяСтрока.ОписаниеЗначения);
			КонецЦикла;	
		КонецЕсли;	
		
		ИменаРазделов.Добавить(СтруктураРаздела.Имя);
	
		
		ТабДокумент = Новый ТабличныйДокумент;
		ВывестиИнформациюОРазделе(СтруктураРаздела, ТабДокумент, Макет);

		АдресаЭлементовРасшифровок = Новый Массив;
		
		Для Каждого Элемент Из СтруктураРаздела.Item.Элементы Цикл
			Для Каждого Атрибут Из Элемент.Атрибуты Цикл
				Если ТипЗнч(Атрибут.РасшифровкаТипа) = Тип("Структура") Тогда
					Если АдресаЭлементовРасшифровок.Найти(Атрибут.РасшифровкаТипа.АдресXML) = Неопределено Тогда
						АдресаЭлементовРасшифровок.Добавить(Атрибут.РасшифровкаТипа.АдресXML);	
					КонецЕсли;	
					Если АдресаЭлементовРасшифровок.Найти(Атрибут.РасшифровкаТипа.АдресФасеты) = Неопределено Тогда
						АдресаЭлементовРасшифровок.Добавить(Атрибут.РасшифровкаТипа.АдресФасеты);	
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;	
		
		НоваяСтрока = ТабличныеДанные.Добавить();
		НоваяСтрока.Раздел                     = ВРег(СтруктураРаздела.Имя);
		НоваяСтрока.ТабДокументАдрес           = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(ТабДокумент, Новый СжатиеДанных(9)), Новый УникальныйИдентификатор);
		НоваяСтрока.АдресаЭлементовРасшифровок = СтрСоединить(АдресаЭлементовРасшифровок, "#");
		
	КонецЦикла;
	
	ТабДокПропуск = Новый ТабличныйДокумент;
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокПропуск.Вывести(ОбластьПустаяСтрока);
	
	
	УникальныеЗначенияЗакрытыхОсей.Свернуть("Раздел, Элемент, Описание, ЗначениеАтрибута, ОписаниеЗначения, Ключ");
	
	Результат = Новый Структура();
	Результат.Вставить("ТабличныйДокумент",              ТабДок);
	Результат.Вставить("ТабличныеДанные",                ТабличныеДанные);
	Результат.Вставить("ТабДокПропуск",                  ТабДокПропуск);
	Результат.Вставить("ИменаРазделов",                  ИменаРазделов);
	Результат.Вставить("УникальныеЗначенияЗакрытыхОсей", УникальныеЗначенияЗакрытыхОсей);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьСтруктуруРаздела(Раздел)
	
	СтруктураРаздела = Новый Структура;
	
	ОписаниеРаздела      = ОписаниеТиповДокумента.Получить(Раздел.Тип.Имя);
	ТекстОписаниеРаздела = ?(ОписаниеРаздела <> Неопределено, ОписаниеРаздела, "Описание отсутствует :(");
	
	СтруктураРаздела.Вставить("Раздел",   Раздел);
	СтруктураРаздела.Вставить("Имя",      Раздел.Имя);
	СтруктураРаздела.Вставить("Описание", ТекстОписаниеРаздела);
	
	Если ЕстьItemЭлементРаздела(Раздел) Тогда
		СтруктураРаздела.Вставить("Item", СформироватьСтруктуруItemЭлементаРаздела(Раздел.Тип.Свойства[0]));	
		ДобавитьУникальныеЗначенияЗакрытыхОсей(СтруктураРаздела);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден элемент %1 в разделе %2", Раздел.Имя + "_Item", Раздел.Имя));
	КонецЕсли;	
	
	Возврат СтруктураРаздела;
	
КонецФункции

Процедура ДобавитьУникальныеЗначенияЗакрытыхОсей(СтруктураРаздела)
	
	// Нас интересуют элементы разделов у которых только одно возможное значение (закрытые оси, Axis). Это помогает сразу получать информацию о необходимости формирования раздела.
	// Например, если Вид деятельности = Брокерская деятельность, то для компании, не явлюящейся брокером, такой раздел не заполняется
	ЭлементыСЕдинственнымЗначениемАтрибута = Новый ТаблицаЗначений;
	ЭлементыСЕдинственнымЗначениемАтрибута.Колонки.Добавить("Раздел");
	ЭлементыСЕдинственнымЗначениемАтрибута.Колонки.Добавить("Элемент");
	ЭлементыСЕдинственнымЗначениемАтрибута.Колонки.Добавить("Описание");
	ЭлементыСЕдинственнымЗначениемАтрибута.Колонки.Добавить("ЗначениеАтрибута");
	ЭлементыСЕдинственнымЗначениемАтрибута.Колонки.Добавить("ОписаниеЗначения");
	
	Для Каждого Элемент Из СтруктураРаздела.Item.Элементы Цикл
		Для Каждого Атрибут Из Элемент.Атрибуты Цикл
			Если Атрибут.РасшифровкаТипа <> Неопределено И Атрибут.РасшифровкаТипа.Представление = "Перечисление" И ТипЗнч(Атрибут.ЕдинственныйФасет) = Тип("Структура") Тогда
				НоваяСтрока = ЭлементыСЕдинственнымЗначениемАтрибута.Добавить();
				НоваяСтрока.Раздел           = СтруктураРаздела.Имя;
				НоваяСтрока.Элемент          = Элемент.Имя;
				НоваяСтрока.Описание         = Элемент.Описание;
				НоваяСтрока.ЗначениеАтрибута = Атрибут.ЕдинственныйФасет.Значение;
				НоваяСтрока.ОписаниеЗначения = Атрибут.ЕдинственныйФасет.Описание;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
	СтруктураРаздела.Вставить("УникальныеЗначенияЗакрытыхОсей", ?(ЭлементыСЕдинственнымЗначениемАтрибута.Количество(), ЭлементыСЕдинственнымЗначениемАтрибута, Неопределено));	
	
КонецПроцедуры

Функция СформироватьСтруктуруItemЭлементаРаздела(ItemЭлемент)
	
	СтруктураItemЭлемента = Новый Структура;
	СтруктураItemЭлемента.Вставить("Элемент", ItemЭлемент);
	СтруктураItemЭлемента.Вставить("Имя",     ItemЭлемент.Имя);
	
	// Получение атрибутов элемента Item
	Атрибуты = Новый Массив;
	Для Каждого СвойствоXDTO Из ItemЭлемент.Тип.Свойства Цикл
		Если СвойствоXDTO.Форма = ФормаXML.Атрибут Тогда 
			Атрибуты.Добавить(СформироватьСтруктуруАтрибута(СвойствоXDTO));
		КонецЕсли;	
	КонецЦикла;	
	СтруктураItemЭлемента.Вставить("Атрибуты", Атрибуты);
	
	// Получение элементов элемента Item
	Элементы = Новый Массив;
	Для Каждого СвойствоXDTO Из ItemЭлемент.Тип.Свойства Цикл
		Если СвойствоXDTO.Форма = ФормаXML.Элемент Тогда 
			Элементы.Добавить(СформироватьСтруктуруЭлемента(СвойствоXDTO));
		КонецЕсли;
	КонецЦикла;	
	СтруктураItemЭлемента.Вставить("Элементы", Элементы);
	
	Возврат СтруктураItemЭлемента;
	
КонецФункции	

Функция СформироватьСтруктуруЭлемента(СвойствоXDTO)
	
	СтруктураЭлемента = Новый Структура("Элемент, Имя, Описание, Тип, ИмяТипа, Обязательный");
	
	ОписаниеЭлемента      = ОписаниеТиповДокумента.Получить(СтрШаблон("%1/%2", СвойствоXDTO.Имя, СвойствоXDTO.Тип.Имя));
	ТекстОписаниеЭлемента = ?(ОписаниеЭлемента <> Неопределено, ОписаниеЭлемента, "Описание отсутствует :(");
	
	СтруктураЭлемента.Элемент      = СвойствоXDTO;
	СтруктураЭлемента.Имя          = СвойствоXDTO.Имя;
	СтруктураЭлемента.Описание     = ТекстОписаниеЭлемента;
	СтруктураЭлемента.Тип          = СвойствоXDTO.Тип;
	СтруктураЭлемента.ИмяТипа      = СвойствоXDTO.Тип.Имя;
	СтруктураЭлемента.Обязательный = ?(СвойствоXDTO.НижняяГраница = 1, Истина, Ложь);
	
	// Т.к. атрибутов Value у элемента может быть несколько десятков, то заменим их общими с именем ValueN1 - ValueN2
	АтрибутыЭлемента = СвернутыеАтрибутыЭлемента(СвойствоXDTO.Тип);
	
	// Получение атрибутов элементов элемента Item
	Атрибуты = Новый Массив;
	Для Каждого Атрибут Из АтрибутыЭлемента Цикл
		Атрибуты.Добавить(СформироватьСтруктуруАтрибута(Атрибут));
	КонецЦикла;	
	СтруктураЭлемента.Вставить("Атрибуты", Атрибуты);
	
	Возврат СтруктураЭлемента;
	
КонецФункции	

Функция СформироватьСтруктуруАтрибута(Атрибут)
	
	СтруктураАтрибута = Новый Структура("Имя, Тип, ИмяТипа, ЗначениеПоУмолчанию, Обязательный, РасшифровкаТипа, ЕдинственныйФасет");
	
	ДанныеТипа = КэшДанныхТипа.Получить(Атрибут.Тип);
	Если ДанныеТипа = Неопределено Тогда
		ДанныеТипа = СформироватьПредставлениеИРасшифровкуТипаЗначения(Атрибут.Тип);
		КэшДанныхТипа.Вставить(Атрибут.Тип, ДанныеТипа);
	КонецЕсли;
	
	СтруктураАтрибута.Имя               = Атрибут.Имя;
	СтруктураАтрибута.Тип               = Атрибут.Тип;
	СтруктураАтрибута.ИмяТипа           = ДанныеТипа.Представление;
	СтруктураАтрибута.ЕдинственныйФасет = ДанныеТипа.ЕдинственныйФасет;
	
	Если ТипЗнч(Атрибут) = Тип("СвойствоXDTO") Тогда
		СтруктураАтрибута.ЗначениеПоУмолчанию = ?(ТипЗнч(Атрибут.ЗначениеПоУмолчанию) = Тип("ЗначениеXDTO"), Атрибут.ЗначениеПоУмолчанию.ЛексическоеЗначение, "");
		СтруктураАтрибута.Обязательный        = ?(Атрибут.НижняяГраница = 1, Истина, Ложь);
	Иначе
		СтруктураАтрибута.ЗначениеПоУмолчанию = Атрибут.ЗначениеПоУмолчанию;
		СтруктураАтрибута.Обязательный        = Атрибут.Обязательный;
	КонецЕсли;	
	СтруктураАтрибута.РасшифровкаТипа = ДанныеТипа.РасшифровкаТипа;
	
	Возврат СтруктураАтрибута;
	
КонецФункции	

Функция ОбработатьИмяРазделаДляСортировки(Знач ИмяРаздела)
	
	Стр = "";
	Если ВРег(ИмяРаздела) = ВРег("SR_INFO") Тогда
		Стр = "Z1"
	ИначеЕсли ВРег(ИмяРаздела) = ВРег("sr_sved_otch_org_podpisant") Тогда
		Стр = "Z2";
	ИначеЕсли ВРег(ИмяРаздела) = ВРег("sr_sved_otch_org_uk") Тогда
		Стр = "Z3";
	ИначеЕсли ВРег(ИмяРаздела) = ВРег("SR_Sved_ObOtchOrg_OtvLicza") Тогда
		Стр = "Z4";
	ИначеЕсли ВРег(ИмяРаздела) = ВРег("sr_sved_otch_org_otv_predm_obl") Тогда
		Стр = "Z5";
	ИначеЕсли ВРег(ИмяРаздела) = ВРег("sr_sved_otch_org_inf_ob_otch") Тогда
		Стр = "Z6";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр) Тогда
		Возврат Стр;
	КонецЕсли;	
	
	// Имена в некоторых разделах имеют разную структуру. Например: r1 и r_4 не будут правильно упорядочены без обработки
	Стр = ИмяРаздела;
	Стр = ВРег(СтрЗаменить(Стр, "r_", "r"));
	Стр = СтрЗаменить(Стр, "R_", "R");
	
	СоставляющиеИмени = СтрРазделить(Стр, "_");
	
	Для Ном = 0 По СоставляющиеИмени.ВГраница() Цикл
	    ЧастьИмени = СоставляющиеИмени[Ном];
		Если СтрНачинаетсяС(ЧастьИмени, "0420") Тогда
			Продолжить;
		КонецЕсли;	
		
		RegExp.Pattern = "^R\d+$"; 
		Если RegExp.Test(ЧастьИмени) Тогда
			ЧислоВИмени = Число(СтрЗаменить(ЧастьИмени, "R", ""));
			ЧислоВИмени = Формат(ЧислоВИмени, "ЧЦ=2; ЧВН=");
			ЧастьИмени = "R" + ЧислоВИмени;
			СоставляющиеИмени[Ном] = ЧастьИмени;
		Иначе	
			RegExp.Pattern = "^\d+$"; 
			Если RegExp.Test(ЧастьИмени) Тогда
				ЧислоВИмени = Формат(Число(ЧастьИмени), "ЧЦ=2; ЧВН=");
				СоставляющиеИмени[Ном] = ЧислоВИмени;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	Стр = СтрСоединить(СоставляющиеИмени, "_");
	
	Возврат Стр;
	
КонецФункции	

Процедура ВывестиИнформациюОРазделе(СтруктураРаздела, ТабДок, Макет)
	
	#Если ItsMagic Тогда
		ТабДок = Новый ТабличныйДокумент;
	#КонецЕсли	
	
	ОбластьСтрокаРаздела = Макет.ПолучитьОбласть("СтрокаРаздела");
	
	ТекстОписаниеРаздела = СтруктураРаздела.Описание;
	
	ОбластьСтрокаРаздела.Параметры.Раздел   = СтруктураРаздела.Имя;
	ОбластьСтрокаРаздела.Параметры.Описание = ?(ТекстОписаниеРаздела <> ТекущееОписание, ТекстОписаниеРаздела, ТекстОписаниеРаздела);
	
	Если ТекстОписаниеРаздела <> ТекущееОписание И ТекстОписаниеРаздела <> "Описание отсутствует :(" Тогда
		ТекущееОписание = ТекстОписаниеРаздела;
	КонецЕсли;	
	
	// Вывод названия и описания раздела
	ТабДок.Вывести(ОбластьСтрокаРаздела);
	
	Если СтруктураРаздела.УникальныеЗначенияЗакрытыхОсей <> Неопределено Тогда
		ОбластьУникальныеЗначенияЗакрытыхОсей = Макет.ПолучитьОбласть("СтрокаУникальныеЗначенияЗакрытыхОсей");
		СтрокиПризнаков = Новый Массив;
		Для Каждого УникальныйПризнак Из СтруктураРаздела.УникальныеЗначенияЗакрытыхОсей Цикл
			СтрокиПризнаков.Добавить(СтрШаблон("%1%2 = %3", Символы.Таб, УникальныйПризнак.Описание, УникальныйПризнак.ОписаниеЗначения));
		КонецЦикла;	
		ОбластьУникальныеЗначенияЗакрытыхОсей.Параметры.УникальныеЗначенияЗакрытыхОсей = СтрСоединить(СтрокиПризнаков, Символы.ПС);
		ТабДок.Вывести(ОбластьУникальныеЗначенияЗакрытыхОсей);
	КонецЕсли;	
	
	ТабДок.НачатьГруппуСтрок(, Ложь);
	
	// Вывод структуры раздела
	Если СтруктураРаздела.Свойство("Item") Тогда
		ВывестиИнформациюОСтруктуреРаздела(СтруктураРаздела.Item, ТабДок, Макет);		
	КонецЕсли;	
	
	ТабДок.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

Функция ЕстьItemЭлементРаздела(СвойствоXDTO)
	
	Возврат СвойствоXDTO.Тип.Свойства.Количество() = 1 И СвойствоXDTO.Тип.Свойства[0].Имя = СвойствоXDTO.Имя + "_Item";
	
КонецФункции	

Процедура ВывестиИнформациюОСтруктуреРаздела(ЭлементItem, ТабДок, Макет)
	
	ОбластьЭлементItemАтрибут = Макет.ПолучитьОбласть("СтрокаItem|ItemАтрибут");
	
	// Вывод элемента Item раздела
	ОбластьItem = Макет.ПолучитьОбласть("СтрокаItem|ЭлементItem");
	ОбластьItem.Параметры.Имя           = ЭлементItem.Имя;
	ОбластьItem.Параметры.ДопИнформация = СтрШаблон("Элементов: %1", ЭлементItem.Элементы.Количество());
	ТабДок.Вывести(ОбластьItem);
	ОбластьItemШапкаАтрибутов = Макет.ПолучитьОбласть("СтрокаItem|ItemШапкаАтрибутов");
	ТабДок.Присоединить(ОбластьItemШапкаАтрибутов);
	
	// Вывод атрибутов элемента Item раздела
	Для Каждого Атрибут Из ЭлементItem.Атрибуты Цикл
		ВывестиАтрибут(Атрибут, ТабДок, ОбластьЭлементItemАтрибут);
	КонецЦикла;	
	
	ОбластьЭлементItem = Макет.ПолучитьОбласть("СтрокаЭлементаItem|ПолеЭлементаItem");
			
	// Вывод элементов элемента Item раздела
	Для Каждого Элемент Из ЭлементItem.Элементы Цикл
		ВывестиЭлемент(Элемент, ТабДок, ОбластьЭлементItem);
		
		ТабДок.Присоединить(ОбластьЭлементItemШапкаАтрибутов);
		
		Для Каждого Атрибут Из Элемент.Атрибуты Цикл
			ВывестиАтрибут(Атрибут, ТабДок, ОбластьЭлементItemАтрибут);
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВывестиЭлемент(Элемент, ТабДок, ОбластьЭлемент)
	
	ОбластьЭлемент.Параметры.Имя      = Элемент.Имя;
	ОбластьЭлемент.Параметры.Описание = Элемент.Описание;
	
	Если Элемент.Обязательный Тогда
		// Обязательные элементы выделим жирным шрифтом
		ОбластьЭлемент.Область("ИмяЭлемента").Шрифт = Новый Шрифт(ОбластьЭлемент.Область("ИмяЭлемента").Шрифт, , , Истина, Ложь);
	Иначе
		// Необязательные - наклонным
		ОбластьЭлемент.Область("ИмяЭлемента").Шрифт = Новый Шрифт(ОбластьЭлемент.Область("ИмяЭлемента").Шрифт, , , Ложь, Истина);
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьЭлемент);
	
КонецПроцедуры	
	
Процедура ВывестиАтрибут(Атрибут, ТабДок, ОбластьАтрибут)
	
	ОбластьАтрибут.Параметры.Атрибут         = Атрибут.Имя;
	ОбластьАтрибут.Параметры.ТипАтрибута     = Атрибут.ИмяТипа;
	ОбластьАтрибут.Параметры.ЗначПоУмолчанию = Атрибут.ЗначениеПоУмолчанию;
	ОбластьАтрибут.Параметры.Обязательный    = ?(Атрибут.Обязательный, "+", "");
	ОбластьАтрибут.Параметры.РасшифровкаТипа = Атрибут.РасшифровкаТипа;
	
	Если Атрибут.Обязательный Тогда
		// Обязательные атрибуты выделим жирным шрифтом
		ОбластьАтрибут.Область("ИмяАтрибута").Шрифт = Новый Шрифт(ОбластьАтрибут.Область("ИмяАтрибута").Шрифт, , , Истина, Ложь);
	Иначе	
		// Необязательные - наклонным
		ОбластьАтрибут.Область("ИмяАтрибута").Шрифт = Новый Шрифт(ОбластьАтрибут.Область("ИмяАтрибута").Шрифт, , , Ложь, Истина);
	КонецЕсли;	
	
	ОбластьТипАтрибута = ОбластьАтрибут.Область("ТипАтрибута");
	Если Атрибут.РасшифровкаТипа <> Неопределено Тогда
		ОбластьТипАтрибута.ЦветТекста       = Новый Цвет(139, 0, 0);
		ОбластьТипАтрибута.Шрифт            = Новый Шрифт(ОбластьАтрибут.Область("ТипАтрибута").Шрифт, , , Истина, , Истина);
		ОбластьТипАтрибута.Гиперссылка      = Истина;
		ОбластьТипАтрибута.Примечание.Текст = Атрибут.РасшифровкаТипа.Примечание;
	Иначе	
		ОбластьТипАтрибута.ЦветТекста       = Новый Цвет(0, 0, 0);
		ОбластьТипАтрибута.Шрифт            = Новый Шрифт(ОбластьАтрибут.Область("ТипАтрибута").Шрифт, , , Ложь, , Ложь);
		ОбластьТипАтрибута.Гиперссылка      = Ложь;
		ОбластьТипАтрибута.Примечание.Текст = "";
	КонецЕсли;	
	
	ТабДок.Присоединить(ОбластьАтрибут);
	
КонецПроцедуры	

Функция СформироватьТекстПримечания(Фасеты, Тип)
	
	Результат = "";
	Если Тип = "Перечисление" И Фасеты.Количество() < 16 Тогда
		СтрокиПримечания = Новый Массив;
		Для Каждого Фасет Из Фасеты Цикл
			СтрокиПримечания.Добавить(СтрШаблон("%1 (%2)", Фасет.Значение, Фасет.Описание));
		КонецЦикла;	
		Результат = СтрСоединить(СтрокиПримечания, Символы.ПС);
	ИначеЕсли Тип = "Открытая ось" Тогда
		Результат = СтрШаблон("Строка текста, которая формируется согласно заданным правилам.%1Должна соответствовать заданному шаблону.", Символы.ПС);
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции	

Функция СвернутыеАтрибутыЭлемента(ТипXDTO)
	
	КС = Новый КвалификаторыСтроки(100);
	
	АтрибутыДляСвертки = Новый ТаблицаЗначений;
	АтрибутыДляСвертки.Колонки.Добавить("НомерСтроки",         Новый ОписаниеТипов("Число"));
	АтрибутыДляСвертки.Колонки.Добавить("Имя",                 Новый ОписаниеТипов("Строка", , , , КС));
	АтрибутыДляСвертки.Колонки.Добавить("Тип",                 Новый ОписаниеТипов("ТипЗначенияXDTO"));
	АтрибутыДляСвертки.Колонки.Добавить("ИмяТипа",             Новый ОписаниеТипов("Строка", , , , КС));
	АтрибутыДляСвертки.Колонки.Добавить("ЭтоValueНом",         Новый ОписаниеТипов("Булево"));
	АтрибутыДляСвертки.Колонки.Добавить("Обязательный",        Новый ОписаниеТипов("Булево"));
	АтрибутыДляСвертки.Колонки.Добавить("Номер",               Новый ОписаниеТипов("Число"));
	АтрибутыДляСвертки.Колонки.Добавить("ЗначениеПоУмолчанию", Новый ОписаниеТипов("Строка", , , , КС));
	
	ФлагValueНом = Ложь;
	НомерСтроки = 0;
	Для Каждого СвойствоXDTO Из ТипXDTO.Свойства Цикл
		Если СвойствоXDTO.Форма = ФормаXML.Атрибут Тогда
			НомерСтроки = НомерСтроки + 1;
			НоваяСтрока = АтрибутыДляСвертки.Добавить();
			
			НоваяСтрока.НомерСтроки         = НомерСтроки;
			НоваяСтрока.Тип                 = СвойствоXDTO.Тип;
			НоваяСтрока.ИмяТипа             = СвойствоXDTO.Тип.Имя;
			
			ПроверкаRegExp = КэшRegExp.Получить(СвойствоXDTO.Имя);
			Если ПроверкаRegExp = Неопределено Тогда
				// Проверка имени атрибута по шаблону "^Value\d+$" с использованием регулярных выражений
				ПроверкаRegExp = RegExp.Test(СвойствоXDTO.Имя);
				КэшRegExp.Вставить(СвойствоXDTO.Имя, ПроверкаRegExp);
			КонецЕсли;	
			НоваяСтрока.ЭтоValueНом = ПроверкаRegExp;
				
			НоваяСтрока.Имя                 = ?(НоваяСтрока.ЭтоValueНом, "Value", СвойствоXDTO.Имя);
			НоваяСтрока.Обязательный        = СвойствоXDTO.НижняяГраница = 1;
			НоваяСтрока.Номер               = ?(НоваяСтрока.ЭтоValueНом, СтрЗаменить(СвойствоXDTO.Имя, "Value", ""), 0);
			НоваяСтрока.ЗначениеПоУмолчанию = ?(ТипЗнч(СвойствоXDTO.ЗначениеПоУмолчанию) = Тип("ЗначениеXDTO"), СвойствоXDTO.ЗначениеПоУмолчанию.ЛексическоеЗначение, "");
			
			ФлагValueНом = ФлагValueНом Или НоваяСтрока.ЭтоValueНом;
		КонецЕсли;
	КонецЦикла;	
	
	Если ФлагValueНом Тогда
		АтрибутыДляСвертки = СвернутьАтрибуы(АтрибутыДляСвертки);
	КонецЕсли;	
	
	Возврат АтрибутыДляСвертки;
	
КонецФункции	

Функция СвернутьАтрибуы(АтрибутыДляСвертки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Атрибуты", АтрибутыДляСвертки.Скопировать(, "НомерСтроки, Имя, ИмяТипа, ЭтоValueНом, Обязательный, Номер, ЗначениеПоУмолчанию"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.НомерСтроки КАК НомерСтроки,
	               |	Таб.Имя КАК Имя,
	               |	Таб.ИмяТипа КАК ИмяТипа,
	               |	Таб.ЭтоValueНом КАК ЭтоValueНом,
	               |	Таб.Обязательный КАК Обязательный,
	               |	Таб.Номер КАК Номер,
	               |	Таб.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
	               |ПОМЕСТИТЬ _Атрибуты
	               |ИЗ
	               |	&Атрибуты КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	_Атрибуты.НомерСтроки КАК НомерСтроки,
	               |	_Атрибуты.Имя КАК Имя,
	               |	_Атрибуты.ИмяТипа КАК ИмяТипа,
	               |	_Атрибуты.Обязательный КАК Обязательный,
	               |	_Атрибуты.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	               |	_Атрибуты.Номер КАК Номер
	               |ПОМЕСТИТЬ _НачалаИнтервалов
	               |ИЗ
	               |	_Атрибуты КАК _Атрибуты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _Атрибуты КАК _Атрибуты2
	               |		ПО _Атрибуты.Имя = _Атрибуты2.Имя
	               |			И _Атрибуты.ИмяТипа = _Атрибуты2.ИмяТипа
	               |			И _Атрибуты.ЭтоValueНом = _Атрибуты2.ЭтоValueНом
	               |			И _Атрибуты.Обязательный = _Атрибуты2.Обязательный
	               |			И _Атрибуты.ЗначениеПоУмолчанию = _Атрибуты2.ЗначениеПоУмолчанию
	               |			И (_Атрибуты2.Номер < _Атрибуты.Номер)
	               |ГДЕ
	               |	_Атрибуты.ЭтоValueНом
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_Атрибуты.НомерСтроки,
	               |	_Атрибуты.Имя,
	               |	_Атрибуты.ИмяТипа,
	               |	_Атрибуты.Обязательный,
	               |	_Атрибуты.ЗначениеПоУмолчанию,
	               |	_Атрибуты.Номер
	               |
	               |ИМЕЮЩИЕ
	               |	_Атрибуты.Номер - МАКСИМУМ(ЕСТЬNULL(_Атрибуты2.Номер, 0)) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	_Атрибуты.НомерСтроки КАК НомерСтроки,
	               |	_Атрибуты.Имя КАК Имя,
	               |	_Атрибуты.ИмяТипа КАК ИмяТипа,
	               |	_Атрибуты.Обязательный КАК Обязательный,
	               |	_Атрибуты.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	               |	_Атрибуты.Номер КАК Номер
	               |ПОМЕСТИТЬ _КонцыИнтервалов
	               |ИЗ
	               |	_Атрибуты КАК _Атрибуты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _Атрибуты КАК _Атрибуты2
	               |		ПО _Атрибуты.Имя = _Атрибуты2.Имя
	               |			И _Атрибуты.ИмяТипа = _Атрибуты2.ИмяТипа
	               |			И _Атрибуты.ЭтоValueНом = _Атрибуты2.ЭтоValueНом
	               |			И _Атрибуты.Обязательный = _Атрибуты2.Обязательный
	               |			И _Атрибуты.ЗначениеПоУмолчанию = _Атрибуты2.ЗначениеПоУмолчанию
	               |			И (_Атрибуты2.Номер > _Атрибуты.Номер)
	               |ГДЕ
	               |	_Атрибуты.ЭтоValueНом
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_Атрибуты.НомерСтроки,
	               |	_Атрибуты.Имя,
	               |	_Атрибуты.ИмяТипа,
	               |	_Атрибуты.Обязательный,
	               |	_Атрибуты.ЗначениеПоУмолчанию,
	               |	_Атрибуты.Номер
	               |
	               |ИМЕЮЩИЕ
	               |	(МИНИМУМ(ЕСТЬNULL(_Атрибуты2.Номер, 0)) - _Атрибуты.Номер > 1
	               |		ИЛИ МИНИМУМ(ЕСТЬNULL(_Атрибуты2.Номер, 0)) = 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	_НачалаИнтервалов.НомерСтроки КАК НомерСтроки,
	               |	_НачалаИнтервалов.Имя КАК Имя,
	               |	_НачалаИнтервалов.ИмяТипа КАК ИмяТипа,
	               |	_НачалаИнтервалов.Обязательный КАК Обязательный,
	               |	_НачалаИнтервалов.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	               |	_НачалаИнтервалов.Номер КАК МинНомер,
	               |	МИНИМУМ(ЕСТЬNULL(_КонцыИнтервалов.Номер, 0)) КАК МаксНомер
	               |ПОМЕСТИТЬ _ИнтервалыНомеров
	               |ИЗ
	               |	_НачалаИнтервалов КАК _НачалаИнтервалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _КонцыИнтервалов КАК _КонцыИнтервалов
	               |		ПО (_КонцыИнтервалов.Имя = _НачалаИнтервалов.Имя)
	               |			И (_КонцыИнтервалов.ИмяТипа = _НачалаИнтервалов.ИмяТипа)
	               |			И (_КонцыИнтервалов.Обязательный = _НачалаИнтервалов.Обязательный)
	               |			И (_КонцыИнтервалов.ЗначениеПоУмолчанию = _НачалаИнтервалов.ЗначениеПоУмолчанию)
	               |			И (_КонцыИнтервалов.Номер >= _НачалаИнтервалов.Номер)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_НачалаИнтервалов.НомерСтроки,
	               |	_НачалаИнтервалов.Имя,
	               |	_НачалаИнтервалов.ИмяТипа,
	               |	_НачалаИнтервалов.Обязательный,
	               |	_НачалаИнтервалов.ЗначениеПоУмолчанию,
	               |	_НачалаИнтервалов.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	_Атрибуты.НомерСтроки КАК НомерСтроки,
	               |	_Атрибуты.Имя КАК Имя,
	               |	_Атрибуты.ИмяТипа КАК ИмяТипа,
	               |	_Атрибуты.Обязательный КАК Обязательный,
	               |	0 КАК МинНомер,
	               |	0 КАК МаксНомер,
	               |	_Атрибуты.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
	               |ИЗ
	               |	_Атрибуты КАК _Атрибуты
	               |ГДЕ
	               |	НЕ _Атрибуты.ЭтоValueНом
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	_ИнтервалыНомеров.НомерСтроки,
	               |	_ИнтервалыНомеров.Имя,
	               |	_ИнтервалыНомеров.ИмяТипа,
	               |	_ИнтервалыНомеров.Обязательный,
	               |	_ИнтервалыНомеров.МинНомер,
	               |	_ИнтервалыНомеров.МаксНомер,
	               |	_ИнтервалыНомеров.ЗначениеПоУмолчанию
	               |ИЗ
	               |	_ИнтервалыНомеров КАК _ИнтервалыНомеров
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Рез = Запрос.Выполнить().Выгрузить();
	Рез.Колонки.Добавить("Тип", Новый ОписаниеТипов("ТипЗначенияXDTO"));
	
	Для Каждого СтрокаТаблицы Из Рез Цикл
		Если СтрокаТаблицы.МаксНомер >  СтрокаТаблицы.МинНомер Тогда
			СтрокаТаблицы.Имя = СтрШаблон("%1%2 - %3", СтрокаТаблицы.Имя, СтрокаТаблицы.МинНомер, СтрокаТаблицы.МаксНомер);
		ИначеЕсли СтрокаТаблицы.МаксНомер > 0 Тогда	
			СтрокаТаблицы.Имя = СтрШаблон("%1%2", СтрокаТаблицы.Имя, СтрокаТаблицы.МаксНомер);
		КонецЕсли;	
		СтрокаПоТипу = АтрибутыДляСвертки.Найти(СтрокаТаблицы.ИмяТипа, "ИмяТипа");
		Если СтрокаПоТипу <> Неопределено Тогда
			СтрокаТаблицы.Тип = СтрокаПоТипу.Тип;
		КонецЕсли;	
	КонецЦикла;	
	
	Рез.Колонки.Удалить(Рез.Колонки.Найти("ИмяТипа"));
	Рез.Колонки.Удалить(Рез.Колонки.Найти("МинНомер"));
	Рез.Колонки.Удалить(Рез.Колонки.Найти("МаксНомер"));
	
	Возврат Рез;
	
КонецФункции	

Функция СформироватьПредставлениеИРасшифровкуТипаЗначения(ТипXDTO)
	
	Если ТипЗнч(ТипXDTO) <> Тип("ТипЗначенияXDTO") Тогда
		ВызватьИсключение СтрШаблон("Тип значения параметра функции ""%1"" не равен типу ""%2""", "СформироватьПредставлениеИРасшифровкуТипаЗначения", "ТипЗначенияXDTO");
	КонецЕсли;	
	
	РасширенныеДанныеТипа = Новый Структура;
	РасширенныеДанныеТипа.Вставить("ИмяТипа",           ТипXDTO.Имя);
	РасширенныеДанныеТипа.Вставить("Представление",     ТипXDTO.Имя);
	РасширенныеДанныеТипа.Вставить("РасшифровкаТипа",   Неопределено);
	РасширенныеДанныеТипа.Вставить("ЕдинственныйФасет", Неопределено);
	
	Если ТипXDTO.URIПространстваИмен = "XBRL" И ТипXDTO.Фасеты <> Неопределено Тогда
		ДобавитьДетализациюПоТипу(ТипXDTO, РасширенныеДанныеТипа);
	КонецЕсли;	
	
	Возврат РасширенныеДанныеТипа;
	
КонецФункции	

Процедура ДобавитьДетализациюПоТипу(ТипXDTO, РасширенныеДанныеТипа)
	
	Если СтрНачинаетсяС(ВРег(ТипXDTO.Имя), ВРег("ENUM_")) Тогда
		
		РасширенныеДанныеТипа.Вставить("Представление",   "Перечисление");
		
	ИначеЕсли ТипXDTO.Имя = "type_Open_Dimension_Value"	Тогда
		
		РасширенныеДанныеТипа.Вставить("Представление",   "Открытая ось");
		
	КонецЕсли;	
	
	Если СтрНачинаетсяС(ВРег(ТипXDTO.Имя), ВРег("ENUM_")) Или ТипXDTO.Имя = "type_Open_Dimension_Value" Тогда
		Фасеты = Новый ТаблицаЗначений;
		Фасеты.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
		Фасеты.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
		
		Для Каждого Фасет Из ТипXDTO.Фасеты Цикл
			СоставноеИмя = ?(Фасет.Вид = ВидФасетаXDTO.Перечисление, СтрШаблон("%1/%2", ТипXDTO.Имя, СокрЛП(Фасет.Значение)), ""); 
			НоваяСтрока = Фасеты.Добавить();
			НоваяСтрока.Значение = ?(Фасет.Вид = ВидФасетаXDTO.Перечисление, Фасет.Значение, Фасет.Вид);
			НоваяСтрока.Описание = ?(Фасет.Вид = ВидФасетаXDTO.Перечисление, ОписаниеТиповДокумента.Получить(СоставноеИмя), Фасет.Значение);
		КонецЦикла;
		
		Расшифровка = Новый Структура;
		Расшифровка.Вставить("ВидРасшифровки", "Фасеты");
		Расшифровка.Вставить("ИмяТипа",        ТипXDTO.Имя);
		Расшифровка.Вставить("Представление",  РасширенныеДанныеТипа.Представление);
		Расшифровка.Вставить("АдресФасеты",    ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(Фасеты, Новый СжатиеДанных(9)), Новый УникальныйИдентификатор));
		
		СтрокаXML = КэшXML.Получить(ТипXDTO.Имя);
		Если СтрокаXML = Неопределено Тогда
			СтрокаXML = "";
		КонецЕсли;
		
		Расшифровка.Вставить("АдресXML",   ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(СтрокаXML, Новый СжатиеДанных(9)), Новый УникальныйИдентификатор));
		Расшифровка.Вставить("Примечание", СформироватьТекстПримечания(Фасеты, Расшифровка.Представление));
		
		РасширенныеДанныеТипа.Вставить("РасшифровкаТипа", Расшифровка);
		Если Фасеты.Количество() = 1 Тогда 
			РасширенныеДанныеТипа.Вставить("ЕдинственныйФасет", Новый Структура("Значение, Описание", Фасеты[0].Значение, Фасеты[0].Описание));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ОбработатьЗначениеСвойства(СвойствоXDTO)
	
	Результат = СвойствоXDTO.ЗначениеПоУмолчанию.Значение;
	
	Если СвойствоXDTO.Имя = "ID" Тогда
		ПозицияСлэша = СтрНайти(Результат, "/", НаправлениеПоиска.СКонца);
		Результат    = Сред(Результат, ПозицияСлэша + 1);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции  

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Визуализация структуры точки входа",
		"00.03",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции