Функция СформироватьПриложениеКАкту(ВыводЦенныхБумаг, ВариантОтчета = Неопределено, ЗаголовокОтчета = Неопределено) Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакет("ПриложениеКАкту");
	
	Если ВариантОтчета = Неопределено Тогда	
		НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		
	Иначе
		ВыбранныйВариантОтчета = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(ВариантОтчета);
		Если ВыбранныйВариантОтчета = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вариант отчета '" + ВариантОтчета + "' не найден");
			Возврат Неопределено;	
		КонецЕсли;
		
		НастройкиКомпоновки = ВыбранныйВариантОтчета.Настройки;	
	КонецЕсли;	
	
	Параметры = РаботаСОтчетами.ПолучитьПараметрыШапки(ВыводЦенныхБумаг.Дата, ВыводЦенныхБумаг.Организация, ВыводЦенныхБумаг.СчетДоверительногоУправления);
	
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеКлиента", Параметры.УчредительУправленияПолноеНаименование);
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Договор", Параметры.НомерДоговора + " от " + Формат(Параметры.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаВывода",		НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыводЦенныхБумаг, "Дата")));
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Регистратор",	ВыводЦенныхБумаг);
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаУчета",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыводЦенныхБумаг, "Организация").ВалютаУчета);
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ВыводЦенныхБумаг.Организация);
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ВыводЦенныхБумаг.СчетДоверительногоУправления);   
	
	//#692184 Делаем шапку для Акта  
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрДатаВывода",	Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыводЦенныхБумаг, "Дата"), "ДФ=dd.MM.yyyy")); 
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеКлиентаКраткое", Параметры.УчредительУправления);
	
	
	// Соберем данные для ставки ЭСП
	ЦенныеБумагиЭСП = Новый ТаблицаЗначений;
	ЦенныеБумагиЭСП.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	ЦенныеБумагиЭСП.Колонки.Добавить("Партия",  Метаданные.ОпределяемыеТипы.Партия.Тип);
	ЦенныеБумагиЭСП.Колонки.Добавить("СтрокаПартии", Новый ОписаниеТипов("Число"));
	ЦенныеБумагиЭСП.Колонки.Добавить("ЭСПКорректировка",  Новый ОписаниеТипов("Число"));
	
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ВыводЦенныхБумаг.Дата, ВыводЦенныхБумаг.Организация, ВыводЦенныхБумаг.СчетДоверительногоУправления);
	
	Для Каждого ОтборПоВидуУчета Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если ОтборПоВидуУчета.Использование И ОтборПоВидуУчета.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ОтборПоВидуУчета.ПравоеЗначение = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда 
			
			ЦенныеБумаги = Новый ТаблицаЗначений;
			ЦенныеБумаги.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
			ЦенныеБумаги.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
			ЦенныеБумаги.Колонки.Добавить("Партия",  Метаданные.ОпределяемыеТипы.Партия.Тип);
			ЦенныеБумаги.Колонки.Добавить("СтрокаПартии", Новый ОписаниеТипов("Число"));
			ЦенныеБумаги.Колонки.Добавить("УчетныйАктивЕПС", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
			ЦенныеБумаги.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.НомерСтроки КАК НомерСтроки,
			|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумаг.Партия КАК Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК БалансовыеДисконтПремия,
			|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК БалансоваяРазницаППНеНаблюдаемыеДанные,
			|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК НачальнаяРазницаППНеНаблюдаемыеДанные,
			|	БухПартииЦенныхБумаг.СтоимостьКупона + БухПартииЦенныхБумаг.ПереоценкаКупона КАК ОценочнаяСуммаКупона,
			|	БухПартииЦенныхБумаг.Количество КАК Количество,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПСРодитель,
			|	БухПартииЦенныхБумаг.Стоимость КАК Стоимость
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РешенияКлиентовПоЗначениямЭСП.СрезПоследних(&Период, ) КАК РешенияКлиентовПоЗначениямЭСПСрезПоследних
			|		ПО БухПартииЦенныхБумаг.СчетДоверительногоУправления = РешенияКлиентовПоЗначениямЭСПСрезПоследних.СчетДоверительногоУправления
			|			И БухПартииЦенныхБумаг.ЦеннаяБумага = РешенияКлиентовПоЗначениямЭСПСрезПоследних.ЦеннаяБумага
			|			И БухПартииЦенныхБумаг.Партия = РешенияКлиентовПоЗначениямЭСПСрезПоследних.Партия
			|			И БухПартииЦенныхБумаг.СтрокаПартии = РешенияКлиентовПоЗначениямЭСПСрезПоследних.СтрокаПартии
			|ГДЕ
			|	БухПартииЦенныхБумаг.Активность
			|	И БухПартииЦенныхБумаг.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И РешенияКлиентовПоЗначениямЭСПСрезПоследних.ЭСП ЕСТЬ NULL
			|	И БухПартииЦенныхБумаг.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|	И БухПартииЦенныхБумаг.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД))";
			
			Запрос.УстановитьПараметр("Регистратор", ВыводЦенныхБумаг);
			Запрос.УстановитьПараметр("Период", ВыводЦенныхБумаг.Дата);
			
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрокаЦенныеБумаги = ЦенныеБумаги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЦенныеБумаги, ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
			ТаблицаДатИЦенПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ЦенныеБумаги, ВыводЦенныхБумаг.СчетДоверительногоУправления, ВыводЦенныхБумаг.Дата).Выгрузить();
			
			ВыборкаДетальныеЗаписи.Сбросить();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Количество) Тогда 
					Отказ = Ложь;
					
					СтрокиПокупки = ТаблицаДатИЦенПокупки.НайтиСтроки(Новый Структура("Партия, СтрокаПартии", ВыборкаДетальныеЗаписи.Партия, ВыборкаДетальныеЗаписи.СтрокаПартии));
					
					Если СтрокиПокупки.Количество() > 0 Тогда
						
						СтрокаПокупки = СтрокиПокупки[0];
						
						ДанныеПереоценки = Новый Структура;
						ДанныеПереоценки.Вставить("ДатаПереоценки",												  КонецДня(ВыводЦенныхБумаг.Дата));
						ДанныеПереоценки.Вставить("Партия",														  ВыборкаДетальныеЗаписи.Партия);
						ДанныеПереоценки.Вставить("СтрокаПартии",												  ВыборкаДетальныеЗаписи.СтрокаПартии);
						ДанныеПереоценки.Вставить("БалансовыйДисконт",											  ВыборкаДетальныеЗаписи.БалансовыеДисконтПремия);
						ДанныеПереоценки.Вставить("УчетныйАктивЕПС",											  ВыборкаДетальныеЗаписи.УчетныйАктивЕПС);
						ДанныеПереоценки.Вставить("Количество",													  ВыборкаДетальныеЗаписи.Количество);
						ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона",										  ВыборкаДетальныеЗаписи.ОценочнаяСуммаКупона);
						ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", ВыборкаДетальныеЗаписи.БалансоваяРазницаППНеНаблюдаемыеДанные); //????
						ДанныеПереоценки.Вставить("СчетДоверительногоУправления", 								  ВыводЦенныхБумаг.СчетДоверительногоУправления);
						ДанныеПереоценки.Вставить("Стоимость",													  ВыборкаДетальныеЗаписи.Стоимость);
						
						ДанныеПокупки = Новый Структура;
						ДанныеПокупки.Вставить("НачальныйДисконт",												СтрокаПокупки.НачальныйДисконт);
						ДанныеПокупки.Вставить("ДатаПокупки",													СтрокаПокупки.ДатаПокупки);
						ДанныеПокупки.Вставить("ДатаПокупкиНачальная",											СтрокаПокупки.ДатаПокупкиНачальная);
						ДанныеПокупки.Вставить("КорректировкаЭСПНачальная",										СтрокаПокупки.КорректировкаЭСПНачальная);
						ДанныеПокупки.Вставить("ЦенаПокупки",													СтрокаПокупки.ЦенаПокупки);
						ДанныеПокупки.Вставить("ЦенаПокупкиКупона",												СтрокаПокупки.ЦенаКупона);
						ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные",	ВыборкаДетальныеЗаписи.НачальнаяРазницаППНеНаблюдаемыеДанные / ВыборкаДетальныеЗаписи.Количество); // ???
						ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", 											СтрокаПокупки.ЦенаПокупкиНачальная);
						
						НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
							НастройкиУчетаОбщие,
							ВыборкаДетальныеЗаписи.ЦеннаяБумага,
							ВыборкаДетальныеЗаписи.УчетныйАктивЕПС,
							ВыборкаДетальныеЗаписи.Партия,
							ВыборкаДетальныеЗаписи.СтрокаПартии);
						
						// у клиента не считается ЭСП
						Если НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода <> Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке Тогда
							// по всем, кроме "через прибыль/убыток" считаем Корректировку ЭСП независимо от настроек
							Если ВыборкаДетальныеЗаписи.УчетныйАктивЕПСРодитель <> Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток Тогда
								НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке;
							КонецЕсли;
						КонецЕсли;
						
						ДанныеРасчета = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);				
						
						НоваяСтрокаЦенныеБумагиЭСП = ЦенныеБумагиЭСП.Добавить();
						НоваяСтрокаЦенныеБумагиЭСП.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
						НоваяСтрокаЦенныеБумагиЭСП.Партия = ВыборкаДетальныеЗаписи.Партия;
						НоваяСтрокаЦенныеБумагиЭСП.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
						НоваяСтрокаЦенныеБумагиЭСП.ЭСПКорректировка = ДанныеРасчета.ЭСПКорректировка;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗаголовокОтчета) Тогда
		НастройкиКомпоновки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ЗаголовокОтчета);
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
	
	ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ЦенныеБумагиЭСП", ЦенныеБумагиЭСП);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, , Истина);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	// Заполняем настройки печати по умолчанию
	КлючПараметровПечати = "Документ.ВыводЦенныхБумаг.ПриложениеКАкту" + ?(ВариантОтчета = Неопределено, "", ВариантОтчета);
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, КлючПараметровПечати, , ОриентацияСтраницы.Ландшафт);		
	
	Возврат ДокументРезультат;	
КонецФункции

Функция СформироватьПриложениеКАктуСводное(ВыводыЦенныхБумаг, Дата, ВариантОтчета = Неопределено, ЗаголовокОтчета = Неопределено) Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакет("ПриложениеКАктуСводное");
	
	Если ВариантОтчета = Неопределено Тогда	
		НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		
	Иначе
		ВыбранныйВариантОтчета = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(ВариантОтчета);
		Если ВыбранныйВариантОтчета = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вариант отчета '" + ВариантОтчета + "' не найден");
			Возврат Неопределено;	
		КонецЕсли;
		
		НастройкиКомпоновки = ВыбранныйВариантОтчета.Настройки;	
	КонецЕсли;	
	
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ДокВывод", ВыводыЦенныхБумаг);
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачало", НачалоДня(Дата));
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонец", КонецДня(Дата));
		
	Если ЗначениеЗаполнено(ЗаголовокОтчета) Тогда
		НастройкиКомпоновки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ЗаголовокОтчета);
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	// Заполняем настройки печати по умолчанию
	КлючПараметровПечати = "Документ.ВыводЦенныхБумаг.ПриложениеКАктуСводное" + ?(ВариантОтчета = Неопределено, "", ВариантОтчета);
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, КлючПараметровПечати, , ОриентацияСтраницы.Ландшафт);		
	
	Возврат ДокументРезультат;	
	
КонецФункции
