&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период.Вариант = ВариантСтандартногоПериода.Сегодня; 
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").Выгрузить(ПараметрыСессии);
КонецПроцедуры //ВыгрузитьНаСервере()

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Выгрузить");
	ВыгрузитьНаСервере(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры //Выгрузить()


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
	
КонецПроцедуры

#КонецОбласти
