
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Анкета управляющей компании",
		"0.58",
		"",
		Истина,
		""
	);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Вариант = РаботаСОтчетамиКлиентСервер.ПолучитьКлючВариантаОтчета(ЭтотОбъект);
	
	Если Вариант = "СтруктураИДинамикаСЧА" Тогда
		
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Вариант = РаботаСОтчетамиКлиентСервер.ПолучитьКлючВариантаОтчета(ЭтотОбъект);
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, , Новый Структура("ВариантОтчета", Вариант));
    Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);

	БиржаММВБ			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
	ВалютаРубли			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
	КалендарьКотировок	= ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок");
	ВалютаУчета			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета");
	
	ПараметрыОтчета = Новый Структура;		
	ПараметрыОтчета.Вставить("Организация",					ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("ОтчетнаяДата",				ЭтотОбъект.ОтчетнаяДата);
	ПараметрыОтчета.Вставить("ОтчетнаяДатаКонецДня",		КонецДня(ЭтотОбъект.ОтчетнаяДата));
	ПараметрыОтчета.Вставить("ОтчетнаяДатаКонецДняГраница",	Новый Граница(КонецДня(ЭтотОбъект.ОтчетнаяДата), ВидГраницы.Включая));
	ПараметрыОтчета.Вставить("БиржаММВБ",					БиржаММВБ);
	ПараметрыОтчета.Вставить("ВалютаУчета",					ВалютаУчета);
	ПараметрыОтчета.Вставить("ВалютаРубли",					ВалютаРубли);
	ПараметрыОтчета.Вставить("КалендарьКотировок",			КалендарьКотировок);	
	ПараметрыОтчета.Вставить("ТипыЦенныхБумаг",				Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.Типы());	
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация",					ПараметрыОтчета.Организация);
	ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетнаяДата",					ПараметрыОтчета.ОтчетнаяДата);
	ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетнаяДатаКонецДня",			ПараметрыОтчета.ОтчетнаяДатаКонецДня);
	ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетнаяДатаКонецДняГраница",	ПараметрыОтчета.ОтчетнаяДатаКонецДняГраница);
	ПараметрыДанных.УстановитьЗначениеПараметра("БиржаММВБ",					ПараметрыОтчета.БиржаММВБ);
	ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаУчета",					ПараметрыОтчета.ВалютаУчета);
	ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаРубли",					ПараметрыОтчета.ВалютаРубли);
	ПараметрыДанных.УстановитьЗначениеПараметра("ТипыЦенныхБумаг",				ПараметрыОтчета.ТипыЦенныхБумаг);
	
	// Задаем округление
	
	Если ЭтотОбъект.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда
		ФорматСумм = "ЧС=3";
	ИначеЕсли ЭтотОбъект.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		ФорматСумм = "ЧС=6";
	Иначе	
		ФорматСумм = "ЧС=0;";
	КонецЕсли;	
	
	Для Каждого НаборДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		Для Каждого ПолеНабораДанных Из НаборДанных.Поля Цикл
			ПолеОформленияФормат = ПолеНабораДанных.Оформление.Элементы.Найти("Формат");
			Если ПолеОформленияФормат <> Неопределено И СтрНайти(ПолеОформленияФормат.Значение, "[ЧС]") > 0 Тогда
				ПолеОформленияФормат.Значение = СтрЗаменить(ПолеОформленияФормат.Значение, "[ЧС]", ФорматСумм);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Определяем включенные отчеты
	
	ВключенныеОтчеты = Новый Соответствие;
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	Для Каждого ЭлементСтруктуры Из НастройкиКомпоновкиДанных.Структура Цикл
		Если ЭлементСтруктуры.Использование Тогда
			ВключенныеОтчеты.Вставить(ЭлементСтруктуры.Имя, Истина);		
		КонецЕсли;
	КонецЦикла;
	
	// Собираем данные
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОбщиеВременныеТаблицы	= "_ДанныеСЧА77, _КатегорииКлиентов, _КатегорииСчетовДУ, _КатегорииПИФ, _Последние8Кварталов, _Последние4Квартала, _Последние2Года, _КлиентыСрезПоПоследним8Кварталам, _ТаблицаВознаграждений";
	
	ПоместитьКатегорииКлиентовВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц);
	ПоместитьВременныеИнтервалыВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц);
	ПоместитьСрезКлиентовПоПоследним8КварталамВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц);
	
	Если ВключенныеОтчеты.Получить("Вознаграждения_УК") = Истина
		ИЛИ ВключенныеОтчеты.Получить("Вознаграждения_УК_Бухгалтерия") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДоходыОт10КрупнейшихКлиентов") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДоходыОт3КрупнейшихКлиентов") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДоходыОт10КрупнейшихКлиентовЗа4Квартала") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДоходыОтВсехКлиентов") = Истина
	Тогда
		ПоместитьВознагражденияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц);
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура; 	
	
#Область СЧА_из_7_7

	Если ВключенныеОтчеты.Получить("СЧА_за_9_кварталов") = Истина
		ИЛИ ВключенныеОтчеты.Получить("СЧА10КрупнейшихКлиентов") = Истина 		
		ИЛИ ВключенныеОтчеты.Получить("ДинамикаСЧАПортфелей") = Истина 
		ИЛИ ВключенныеОтчеты.Получить("АктивыДепозитариев") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДоляАктивовПоИсточникамСредств") = Истина
		ИЛИ ВключенныеОтчеты.Получить("СтруктураПортфелей") = Истина
	Тогда
		
		Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
			ДанныеСЧА77 = ПолучитьСЧАИзМакета("_СЧА_из_77_РЭМ, _Форма501_РЭМ_без_2018");
		ИначеЕсли ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
			ДанныеСЧА77 = ПолучитьСЧАИзМакета("_СЧА_из_77_Траст, _Форма501_Траст_без_2018");
		Иначе
			ДанныеСЧА77 = ПолучитьСЧАИзМакета(""); 	
		КонецЕсли;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеСЧА77.Период КАК Период,
			|	ДанныеСЧА77.Организация КАК Организация,
			|	ДанныеСЧА77.СубъектАналитики КАК СубъектАналитики,
			|	ДанныеСЧА77.ВидПоказателя КАК ВидПоказателя,
			|	ДанныеСЧА77.Значение КАК Значение
			|ПОМЕСТИТЬ _ДанныеСЧА77
			|ИЗ
			|	&ДанныеСЧА77 КАК ДанныеСЧА77");	
			
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ДанныеСЧА77", ДанныеСЧА77);
		
		Запрос.Выполнить();
	
	КонецЕсли;

#КонецОбласти
	
#Область СЧА_за_9_кварталов	

	Если ВключенныеОтчеты.Получить("СЧА_за_9_кварталов") = Истина Тогда

		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеСЧА77.Период КАК Период,
			|	_ДанныеСЧА77.Организация КАК Организация,
			|	_ДанныеСЧА77.СубъектАналитики КАК СубъектАналитики,
			|	_ДанныеСЧА77.ВидПоказателя КАК ВидПоказателя,
			|	_ДанныеСЧА77.Значение КАК Значение
			|ПОМЕСТИТЬ _ФинансовыеПоказатели
			|ИЗ
			|	_ДанныеСЧА77 КАК _ДанныеСЧА77
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ФинансовыеПоказатели.Период,
			|	ФинансовыеПоказатели.Организация,
			|	ФинансовыеПоказатели.СубъектАналитики,
			|	ФинансовыеПоказатели.ВидПоказателя,
			|	ФинансовыеПоказатели.Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Последние8Кварталов.КонецПериодаНачалоДня КАК Период,
			|	ДатыРегистрацииСЧА.ДатаРегистрации КАК ДатаРегистрацииСЧА,
			|	ЕСТЬNULL(_КатегорииСчетовДУ.Категория, СчетаДоверительногоУправления.Ссылка) КАК Категория,
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДУ,
			|	ФинансовыеПоказатели.Значение КАК СЧА,
			|	РАЗНОСТЬДАТ(ДатыРегистрацииСЧА.ДатаРегистрации, _Последние8Кварталов.КонецПериода, ДЕНЬ) > 2 КАК ЭтоСтароеСЧА,
			|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
			|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
			|ПОМЕСТИТЬ _ВеличинаСредствПодУправлением
			|ИЗ
			|	_Последние8Кварталов КАК _Последние8Кварталов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ПО (СчетаДоверительногоУправления.Организация = &Организация)
			|			И (СчетаДоверительногоУправления.ДатаЗаключения <= _Последние8Кварталов.КонецПериодаНачалоДня)
			|			И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|				ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > _Последние8Кварталов.КонецПериодаНачалоДня)
			|			И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииСчетовДУ КАК _КатегорииСчетовДУ
			|		ПО _КатегорииСчетовДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				_Последние8Кварталов.КонецПериодаНачалоДня КАК Период,
			|				ФинансовыеПоказатели.СубъектАналитики КАК СубъектАналитики,
			|				МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаРегистрации
			|			ИЗ
			|				_ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Последние8Кварталов КАК _Последние8Кварталов
			|					ПО (ФинансовыеПоказатели.Период МЕЖДУ _Последние8Кварталов.НачалоПериода И _Последние8Кварталов.КонецПериодаНачалоДня)
			|			ГДЕ
			|				ФинансовыеПоказатели.Организация = &Организация
			|				И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				_Последние8Кварталов.КонецПериодаНачалоДня,
			|				ФинансовыеПоказатели.СубъектАналитики) КАК ДатыРегистрацииСЧА
			|			ПО (ДатыРегистрацииСЧА.СубъектАналитики = ФинансовыеПоказатели.СубъектАналитики)
			|				И (ДатыРегистрацииСЧА.ДатаРегистрации = ФинансовыеПоказатели.Период)
			|		ПО (ФинансовыеПоказатели.Организация = &Организация)
			|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
			|			И (ФинансовыеПоказатели.СубъектАналитики = СчетаДоверительногоУправления.Ссылка)
			|			И (ДатыРегистрацииСЧА.Период = _Последние8Кварталов.КонецПериодаНачалоДня)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_Последние8Кварталов.КонецПериодаНачалоДня, _ВеличинаСредствПодУправлением.Период) КАК Период4,
			|	ЕСТЬNULL(_КатегорииКлиентов.Наименование, _ВеличинаСредствПодУправлением.Категория) КАК Категория4,
			|	ЕСТЬNULL(СУММА(_ВеличинаСредствПодУправлением.СЧА), 0) КАК СЧА4,
			|	_ВеличинаСредствПодУправлением.СчетДУ КАК СчетДУ4,
			|	_ВеличинаСредствПодУправлением.СчетДУ.НомерДоговора КАК НомерДоговора4,
			|	_ВеличинаСредствПодУправлением.СчетДУ.ДатаЗаключения КАК ДатаЗаключения4,
			|	_ВеличинаСредствПодУправлением.СчетДУ.ДатаРасторжения КАК ДатаРасторжения4,
			|	_КатегорииКлиентов.Порядок КАК Порядок4
			|ИЗ
			|	_Последние8Кварталов КАК _Последние8Кварталов
			|		ПОЛНОЕ СОЕДИНЕНИЕ _КатегорииКлиентов КАК _КатегорииКлиентов
			|		ПО (ИСТИНА)
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ВеличинаСредствПодУправлением КАК _ВеличинаСредствПодУправлением
			|		ПО (_ВеличинаСредствПодУправлением.Категория = _КатегорииКлиентов.Наименование)
			|			И (_ВеличинаСредствПодУправлением.Период = _Последние8Кварталов.КонецПериодаНачалоДня)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(_Последние8Кварталов.КонецПериодаНачалоДня, _ВеличинаСредствПодУправлением.Период),
			|	_КатегорииКлиентов.Порядок,
			|	ЕСТЬNULL(_КатегорииКлиентов.Наименование, _ВеличинаСредствПодУправлением.Категория),
			|	_ВеличинаСредствПодУправлением.СчетДУ,
			|	_ВеличинаСредствПодУправлением.СчетДУ.НомерДоговора,
			|	_ВеличинаСредствПодУправлением.СчетДУ.ДатаЗаключения,
			|	_ВеличинаСредствПодУправлением.СчетДУ.ДатаРасторжения");
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
			Запрос.УстановитьПараметр(ПараметрОтчета.Ключ, ПараметрОтчета.Значение);
		КонецЦикла;
		
		ВнешниеНаборыДанных.Вставить("СЧА_за_9_кварталов", Запрос.Выполнить().Выгрузить());
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
		
	КонецЕсли;	
		
#КонецОбласти

#Область Вознаграждения_УК_из_Бухгалтерии

	Если ВключенныеОтчеты.Получить("Вознаграждения_УК_Бухгалтерия") = Истина Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Последние8Кварталов.КонецПериодаНачалоДня КАК Период,
			|	ЕСТЬNULL(_КатегорииСчетовДУ.Категория, ДвиженияДС.СчетДоверительногоУправления) КАК Категория,
			|	ДвиженияДС.СчетДоверительногоУправления КАК СчетДУ,
			|	ДвиженияДС.Клиент КАК Клиент,
			|	ДвиженияДС.Сумма КАК Сумма
			|ПОМЕСТИТЬ _ВознагражденияУК
			|ИЗ
			|	_Последние8Кварталов КАК _Последние8Кварталов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаВознаграждений КАК ДвиженияДС
			|		ПО (ДвиженияДС.Период МЕЖДУ _Последние8Кварталов.НачалоПериода И _Последние8Кварталов.КонецПериода)
			|			И (ДвиженияДС.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииСчетовДУ КАК _КатегорииСчетовДУ
			|		ПО (_КатегорииСчетовДУ.СчетДоверительногоУправления = ДвиженияДС.СчетДоверительногоУправления)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_Последние8Кварталов.КонецПериодаНачалоДня, _ВознагражденияУК.Период) КАК Период5_1,
			|	ЕСТЬNULL(_КатегорииКлиентов.Наименование, _ВознагражденияУК.Категория) КАК Категория5_1,
			|	ЕСТЬNULL(СУММА(_ВознагражденияУК.Сумма), 0) КАК ВознаграждениеСНачалаГода5_1,
			|	_КатегорииКлиентов.Порядок КАК Порядок5_1,
			|	_ВознагражденияУК.Клиент КАК Клиент5_1
			|ИЗ
			|	_Последние8Кварталов КАК _Последние8Кварталов
			|		ПОЛНОЕ СОЕДИНЕНИЕ _КатегорииКлиентов КАК _КатегорииКлиентов
			|		ПО (ИСТИНА)
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ВознагражденияУК КАК _ВознагражденияУК
			|		ПО (_ВознагражденияУК.Категория = _КатегорииКлиентов.Наименование)
			|			И (_ВознагражденияУК.Период = _Последние8Кварталов.КонецПериодаНачалоДня)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(_Последние8Кварталов.КонецПериодаНачалоДня, _ВознагражденияУК.Период),
			|	_КатегорииКлиентов.Порядок,
			|	ЕСТЬNULL(_КатегорииКлиентов.Наименование, _ВознагражденияУК.Категория),
			|	_ВознагражденияУК.Клиент");
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ОтчетнаяДата", ЭтотОбъект.ОтчетнаяДата);
		Запрос.УстановитьПараметр("ОтчетнаяДатаКонецДня", КонецДня(ЭтотОбъект.ОтчетнаяДата));
		
		ВознагражденияУК_Бухгалтерия = Запрос.Выполнить().Выгрузить();
		
		ВнешниеНаборыДанных.Вставить("ВознагражденияУК_Бухгалтерия", ВознагражденияУК_Бухгалтерия);
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
				
	КонецЕсли;

#КонецОбласти
	
#Область Доходы_за_последние_8_кварталов 

	// 6_2 Доходы от доверительного управления имуществом 10 крупнейших (по объему полученных вознаграждений) клиентов
	
	Если ВключенныеОтчеты.Получить("ДоходыОт10КрупнейшихКлиентов") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДоходыОт3КрупнейшихКлиентов") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДоходыОтВсехКлиентов") = Истина
	Тогда

		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Последние8Кварталов.КонецПериодаНачалоДня КАК Период,
			|	ДвиженияДС.СчетДоверительногоУправления КАК СчетДУ,
			|	ВЫБОР
			|		КОГДА &ОтчетнаяДата >= ДАТАВРЕМЯ(2020, 1, 1)
			|			ТОГДА ЕСТЬNULL(_КатегорииСчетовДУ.Категория, ДвиженияДС.СчетДоверительногоУправления)
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ИсточникСредств,
			|	ДвиженияДС.Клиент КАК Клиент,
			|	ДвиженияДС.Сумма КАК Сумма
			|ПОМЕСТИТЬ _ВознагражденияУК
			|ИЗ
			|	_Последние8Кварталов КАК _Последние8Кварталов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаВознаграждений КАК ДвиженияДС
			|		ПО (ДвиженияДС.Период МЕЖДУ НАЧАЛОПЕРИОДА(_Последние8Кварталов.КонецПериода, ГОД) И _Последние8Кварталов.КонецПериода)
			|			И (ДвиженияДС.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПИФ
			|		ПО (ПИФ.Ссылка = ДвиженияДС.Клиент)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииСчетовДУ КАК _КатегорииСчетовДУ
			|		ПО (_КатегорииСчетовДУ.СчетДоверительногоУправления = ДвиженияДС.СчетДоверительногоУправления)
			|ГДЕ
			|	(НЕ &Скрывать_ОПИФ_ИПИФ_БПИФ
			|			ИЛИ ПИФ.Тип ЕСТЬ NULL
			|			ИЛИ НЕ ПИФ.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой)))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ВознагражденияУК.Период КАК Период,
			|	_ВознагражденияУК.Клиент КАК Клиент,
			|	_ВознагражденияУК.ИсточникСредств КАК ИсточникСредств,
			|	СУММА(_ВознагражденияУК.Сумма) КАК Сумма
			|ПОМЕСТИТЬ _ДоходыОтКлиентов
			|ИЗ
			|	_ВознагражденияУК КАК _ВознагражденияУК
			|
			|СГРУППИРОВАТЬ ПО
			|	_ВознагражденияУК.Период,
			|	_ВознагражденияУК.Клиент,
			|	_ВознагражденияУК.ИсточникСредств
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДоходыОтКлиентов.Период КАК Период6_2,
			|	_ДоходыОтКлиентов.Клиент КАК Клиент6_2,
			|	СУММА(_ДоходыОтКлиентов.Сумма) КАК ДоходОтДУ6_2,
			|	ЕСТЬNULL(РеквизитыКлиентаЮрЛица.КраткоеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыКлиентаФизЛица.Фамилия + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Имя, 1, 1) + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Отчество, 1, 1), _ДоходыОтКлиентов.Клиент)) КАК КраткоеНаименованиеПоУставу6_2,
			|	РеквизитыКлиентаЮрЛица.ОГРН КАК ОГРН6_2
			|ИЗ
			|	_ДоходыОтКлиентов КАК _ДоходыОтКлиентов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК РеквизитыКлиентаЮрЛица
			|		ПО _ДоходыОтКлиентов.Клиент = РеквизитыКлиентаЮрЛица.ЮрФизЛицо
			|			И (РеквизитыКлиентаЮрЛица.Организация = &Организация)
			|			И (РеквизитыКлиентаЮрЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК РеквизитыКлиентаФизЛица
			|		ПО _ДоходыОтКлиентов.Клиент = РеквизитыКлиентаФизЛица.ЮрФизЛицо
			|			И (РеквизитыКлиентаФизЛица.Организация = &Организация)
			|			И (РеквизитыКлиентаФизЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДоходыОтКлиентов.Период,
			|	_ДоходыОтКлиентов.Клиент,
			|	ЕСТЬNULL(РеквизитыКлиентаЮрЛица.КраткоеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыКлиентаФизЛица.Фамилия + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Имя, 1, 1) + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Отчество, 1, 1), _ДоходыОтКлиентов.Клиент)),
			|	РеквизитыКлиентаЮрЛица.ОГРН
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период6_2,
			|	СУММА(_ДоходыОтКлиентов.Сумма) УБЫВ
			|ИТОГИ ПО
			|	Период6_2");

		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;		
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ОтчетнаяДата", ЭтотОбъект.ОтчетнаяДата);
		Запрос.УстановитьПараметр("ОтчетнаяДатаКонецДня", КонецДня(ЭтотОбъект.ОтчетнаяДата));

		//Если ЭтотОбъект.ОтчетнаяДата >= '20200101' Тогда
		//	УстановитьПредставлениеОтбора("ДоходыОт10КрупнейшихКлиентов", "не учитывать ОПИФ, ИПИФ и БПИФ");
		//	УстановитьПредставлениеОтбора("ДоходыОт3КрупнейшихКлиентов", "не учитывать ОПИФ, ИПИФ и БПИФ");
		//	Запрос.УстановитьПараметр("Скрывать_ОПИФ_ИПИФ_БПИФ", Истина);
		//Иначе
		//	УстановитьПредставлениеОтбора("ДоходыОт10КрупнейшихКлиентов", Неопределено);
		//	УстановитьПредставлениеОтбора("ДоходыОт3КрупнейшихКлиентов", Неопределено);
		//	Запрос.УстановитьПараметр("Скрывать_ОПИФ_ИПИФ_БПИФ", Ложь);
		//КонецЕсли;
		Запрос.УстановитьПараметр("Скрывать_ОПИФ_ИПИФ_БПИФ", Ложь);
		
		РезультатЗапроса = Запрос.Выполнить();		
		
		// Заполняем результаты
		
		ИсточникиСредствКлиентов = МенеджерВременныхТаблиц.Таблицы["_ДоходыОтКлиентов"].ПолучитьДанные().Выгрузить();
		ИсточникиСредствКлиентов.Индексы.Добавить("Клиент, Период");
		
		Если ВключенныеОтчеты.Получить("ДоходыОт10КрупнейшихКлиентов") = Истина
			ИЛИ ВключенныеОтчеты.Получить("ДоходыОт3КрупнейшихКлиентов") = Истина
		Тогда
		
		    #Область Поиск_10_крупнейших_клиентов
		
			ДоходыОт10КрупнейшихКлиентов = Новый ТаблицаЗначений;
			ДоходыОт10КрупнейшихКлиентов.Колонки.Добавить("Период6_2", Новый ОписаниеТипов("Дата"));
			ДоходыОт10КрупнейшихКлиентов.Колонки.Добавить("Клиент6_2", Метаданные.РегистрыСведений.КлиентыДоверительногоУправления.Ресурсы.Клиент.Тип);
			ДоходыОт10КрупнейшихКлиентов.Колонки.Добавить("ИсточникСредств6_2", Новый ОписаниеТипов("Строка"));
			ДоходыОт10КрупнейшихКлиентов.Колонки.Добавить("ДоходОтДУ6_2", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
			ДоходыОт10КрупнейшихКлиентов.Колонки.Добавить("КраткоеНаименованиеПоУставу6_2", Новый ОписаниеТипов("Строка"));
			ДоходыОт10КрупнейшихКлиентов.Колонки.Добавить("ОГРН6_2", Новый ОписаниеТипов("Строка"));
			ДоходыОт10КрупнейшихКлиентов.Колонки.Добавить("НомерВГруппе6_2", Новый ОписаниеТипов("Число"));
			
			ВыборкаПоДате = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоДате.Следующий() Цикл
				НомерВГруппе = 0;
				
				ВыборкаПоКлиенту = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаПоКлиенту.Следующий() Цикл
					НомерВГруппе = НомерВГруппе + 1;
					
					НоваяСтрока = ДоходыОт10КрупнейшихКлиентов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоКлиенту);
					НоваяСтрока.НомерВГруппе6_2 = НомерВГруппе;
					
					// Заполняем источник средств
					
					ИсточникиСредств = ИсточникиСредствКлиентов.НайтиСтроки(Новый Структура("Клиент, Период", НоваяСтрока.Клиент6_2, НоваяСтрока.Период6_2));
					Для Каждого ИсточникСредств Из ИсточникиСредств Цикл
						НоваяСтрока.ИсточникСредств6_2 = ?(ПустаяСтрока(НоваяСтрока.ИсточникСредств6_2), "", НоваяСтрока.ИсточникСредств6_2 + ", ") + ИсточникСредств.ИсточникСредств;		
					КонецЦикла;
					
					// ДоходыОт10КрупнейшихКлиентов
					Если НомерВГруппе = 10 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			#КонецОбласти
			
			ВнешниеНаборыДанных.Вставить("ДоходыОт10КрупнейшихКлиентов", ДоходыОт10КрупнейшихКлиентов);
		
		КонецЕсли;
		
		Если ВключенныеОтчеты.Получить("ДоходыОтВсехКлиентов") = Истина Тогда
			
			ДоходыОтВсехКлиентов = ИсточникиСредствКлиентов.Скопировать();
			ДоходыОтВсехКлиентов.Колонки.Период.Имя				= "Период7";
			ДоходыОтВсехКлиентов.Колонки.Клиент.Имя				= "Клиент7";
			ДоходыОтВсехКлиентов.Колонки.ИсточникСредств.Имя	= "ИсточникСредств7";
			ДоходыОтВсехКлиентов.Колонки.Сумма.Имя				= "ДоходОтДУ7";
			
			ВнешниеНаборыДанных.Вставить("ДоходыОтВсехКлиентов", ДоходыОтВсехКлиентов);
			
		КонецЕсли;
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);

	КонецЕсли;	
	
#КонецОбласти

#Область СЧА_10_крупнейших_клиентов_последнюю_отчетную_дату_и_дату_годом_ранее 

	// 9 Укажите 10 крупнейших клиентов по объему средств под управлением на последнюю отчетную дату и дату годом ранее
	
	Если ВключенныеОтчеты.Получить("СЧА10КрупнейшихКлиентов") = Истина Тогда 	
	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеСЧА77.Период КАК Период,
			|	_ДанныеСЧА77.Организация КАК Организация,
			|	_ДанныеСЧА77.СубъектАналитики КАК СубъектАналитики,
			|	_ДанныеСЧА77.ВидПоказателя КАК ВидПоказателя,
			|	_ДанныеСЧА77.Значение КАК Значение
			|ПОМЕСТИТЬ _ФинансовыеПоказатели
			|ИЗ
			|	_ДанныеСЧА77 КАК _ДанныеСЧА77
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ФинансовыеПоказатели.Период,
			|	ФинансовыеПоказатели.Организация,
			|	ФинансовыеПоказатели.СубъектАналитики,
			|	ФинансовыеПоказатели.ВидПоказателя,
			|	ФинансовыеПоказатели.Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Последние2Года.КонецПериодаНачалоДня КАК Период,
			|	КлиентыДУ.Клиент КАК Клиент,
			|	МИНИМУМ(ДатыРегистрацииСЧА.ДатаРегистрации) КАК ДатаРегистрацииСЧА,
			|	СУММА(ФинансовыеПоказатели.Значение) КАК СЧА,
			|	МИНИМУМ(РАЗНОСТЬДАТ(ДатыРегистрацииСЧА.ДатаРегистрации, _Последние2Года.КонецПериода, ДЕНЬ) > 2) КАК ЭтоСтароеСЧА
			|ПОМЕСТИТЬ _ВеличинаСредствПодУправлениемЗа2Года
			|ИЗ
			|	_Последние8Кварталов КАК _Последние2Года
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				_Последние2Года.КонецПериодаНачалоДня КАК Период,
			|				ФинансовыеПоказатели.СубъектАналитики КАК СубъектАналитики,
			|				МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаРегистрации
			|			ИЗ
			|				_ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Последние8Кварталов КАК _Последние2Года
			|					ПО ФинансовыеПоказатели.Период <= _Последние2Года.КонецПериодаНачалоДня
			|			ГДЕ
			|				ФинансовыеПоказатели.Организация = &Организация
			|				И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				_Последние2Года.КонецПериодаНачалоДня,
			|				ФинансовыеПоказатели.СубъектАналитики) КАК ДатыРегистрацииСЧА
			|			ПО (ДатыРегистрацииСЧА.СубъектАналитики = ФинансовыеПоказатели.СубъектАналитики)
			|				И (ДатыРегистрацииСЧА.ДатаРегистрации = ФинансовыеПоказатели.Период)
			|		ПО (ФинансовыеПоказатели.Организация = &Организация)
			|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
			|			И (ФинансовыеПоказатели.СубъектАналитики ССЫЛКА Справочник.СчетаДоверительногоУправления)
			|			И (ДатыРегистрацииСЧА.Период = _Последние2Года.КонецПериодаНачалоДня)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ПО (СчетаДоверительногоУправления.Ссылка = ФинансовыеПоказатели.СубъектАналитики)
			|			И (СчетаДоверительногоУправления.ДатаЗаключения <= _Последние2Года.КонецПериодаНачалоДня)
			|			И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|				ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > _Последние2Года.КонецПериодаНачалоДня)
			|			И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК КлиентыДУ
			|		ПО (КлиентыДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|СГРУППИРОВАТЬ ПО
			|	КлиентыДУ.Клиент,
			|	_Последние2Года.КонецПериодаНачалоДня
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ВеличинаСредствПодУправлениемЗа2Года.Период КАК Период9,
			|	_ВеличинаСредствПодУправлениемЗа2Года.СЧА КАК СЧА9,
			|	ЕСТЬNULL(РеквизитыКлиентаЮрЛица.КраткоеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыКлиентаФизЛица.Фамилия + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Имя, 1, 1) + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Отчество, 1, 1), _ВеличинаСредствПодУправлениемЗа2Года.Клиент)) КАК КраткоеНаименованиеПоУставу9,
			|	РеквизитыКлиентаЮрЛица.ОГРН КАК ОГРН9,
			|	_ВеличинаСредствПодУправлениемЗа2Года.ДатаРегистрацииСЧА КАК ДатаРегистрацииСЧА9,
			|	_ВеличинаСредствПодУправлениемЗа2Года.ЭтоСтароеСЧА КАК ЭтоСтароеСЧА9
			|ИЗ
			|	_ВеличинаСредствПодУправлениемЗа2Года КАК _ВеличинаСредствПодУправлениемЗа2Года
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК РеквизитыКлиентаЮрЛица
			|		ПО _ВеличинаСредствПодУправлениемЗа2Года.Клиент = РеквизитыКлиентаЮрЛица.ЮрФизЛицо
			|			И (РеквизитыКлиентаЮрЛица.Организация = &Организация)
			|			И (РеквизитыКлиентаЮрЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК РеквизитыКлиентаФизЛица
			|		ПО _ВеличинаСредствПодУправлениемЗа2Года.Клиент = РеквизитыКлиентаФизЛица.ЮрФизЛицо
			|			И (РеквизитыКлиентаФизЛица.Организация = &Организация)
			|			И (РеквизитыКлиентаФизЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПИФ
			|		ПО ПИФ.Ссылка = _ВеличинаСредствПодУправлениемЗа2Года.Клиент
			|ГДЕ
			|	(НЕ &Скрывать_ОПИФ_ИПИФ_БПИФ
			|			ИЛИ ПИФ.Тип ЕСТЬ NULL
			|			ИЛИ НЕ ПИФ.Тип В (
			|				ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый),
			|				ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный),
			|				ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой)))			
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период9,
			|	СЧА9 УБЫВ
			|ИТОГИ ПО
			|	Период9");

		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
			Запрос.УстановитьПараметр(ПараметрОтчета.Ключ, ПараметрОтчета.Значение);
		КонецЦикла;

		Запрос.УстановитьПараметр("Скрывать_ОПИФ_ИПИФ_БПИФ", Ложь);		
		
		СЧА10КрупнейшихКлиентов = Новый ТаблицаЗначений;
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("Период9", Новый ОписаниеТипов("Дата"));
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("СЧА9", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("КраткоеНаименованиеПоУставу9", Новый ОписаниеТипов("Строка"));
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("ОГРН9", Новый ОписаниеТипов("Строка"));
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("НаправлениеДУ9", Новый ОписаниеТипов("Строка"));
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("НомерВГруппе9", Новый ОписаниеТипов("Число"));
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("СчетДУ9", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("ДатаРегистрацииСЧА9", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		СЧА10КрупнейшихКлиентов.Колонки.Добавить("ЭтоСтароеСЧА9", Новый ОписаниеТипов("Булево"));

		ВыборкаПоДате = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДате.Следующий() Цикл
			НомерВГруппе = 0;
			
			ВыборкаПоКлиенту = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаПоКлиенту.Следующий() Цикл
				НомерВГруппе = НомерВГруппе + 1;
				
				НоваяСтрока = СЧА10КрупнейшихКлиентов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоКлиенту);
				НоваяСтрока.НомерВГруппе9 = НомерВГруппе;
				
				// СЧА10КрупнейшихКлиентов
				//Если НомерВГруппе = 10 Тогда
				//	Прервать;
				//КонецЕсли;
			КонецЦикла;
		КонецЦикла;
			
		ВнешниеНаборыДанных.Вставить("СЧА10КрупнейшихКлиентов", СЧА10КрупнейшихКлиентов);
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
		
	КонецЕсли;

#КонецОбласти

#Область Доходы_от_ДУ_10_крупнейших_клиентов_за_4_квартала 

	// 10 Укажите 10 крупнейших клиентов по объему полученных вознаграждений за доверительное управление имуществом за последние 4 квартала и аналогичный период годом ранее
	
	Если ВключенныеОтчеты.Получить("ДоходыОт10КрупнейшихКлиентовЗа4Квартала") = Истина Тогда 	
	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Последние4Квартала.НачалоПериода КАК НачалоПериода,
			|	_Последние4Квартала.КонецПериода КАК КонецПериода,
			|	ДвиженияДС.СчетДоверительногоУправления КАК СчетДУ,
			|	ВЫБОР
			|		КОГДА &ОтчетнаяДата >= ДАТАВРЕМЯ(2020, 1, 1)
			|			ТОГДА ЕСТЬNULL(_КатегорииСчетовДУ.Категория, ДвиженияДС.СчетДоверительногоУправления)
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ИсточникСредств,
			|	_КлиентыСрезПоПоследним8Кварталам.Клиент КАК Клиент,
			|	ДвиженияДС.Сумма КАК Сумма,
			|	ДвиженияДС.Период КАК ДатаПлатежа
			|ПОМЕСТИТЬ _ВознагражденияУК
			|ИЗ
			|	_Последние4Квартала КАК _Последние4Квартала
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаВознаграждений КАК ДвиженияДС
			|		ПО (ДвиженияДС.Период >= ДОБАВИТЬКДАТЕ(_Последние4Квартала.НачалоПериода, ДЕНЬ, 1))
			|			И (ДвиженияДС.Период < ДОБАВИТЬКДАТЕ(_Последние4Квартала.КонецПериода, ДЕНЬ, 1))
			|			И (ДвиженияДС.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПИФ
			|		ПО (ПИФ.Ссылка = ДвиженияДС.Клиент)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииСчетовДУ КАК _КатегорииСчетовДУ
			|		ПО (_КатегорииСчетовДУ.СчетДоверительногоУправления = ДвиженияДС.СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КлиентыСрезПоПоследним8Кварталам КАК _КлиентыСрезПоПоследним8Кварталам
			|		ПО _КлиентыСрезПоПоследним8Кварталам.СчетДоверительногоУправления = ДвиженияДС.СчетДоверительногоУправления
			|			И _КлиентыСрезПоПоследним8Кварталам.Период = _Последние4Квартала.КонецПериода
			|ГДЕ
			|	(НЕ &Скрывать_ОПИФ_ИПИФ_БПИФ
			|			ИЛИ ПИФ.Тип ЕСТЬ NULL
			|			ИЛИ НЕ ПИФ.Тип В (
			|				ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый),
			|				ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный),
			|				ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой)))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ВознагражденияУК.НачалоПериода КАК НачалоПериода,
			|	МИНИМУМ(_ВознагражденияУК.КонецПериода) КАК КонецПериода,
			|	_ВознагражденияУК.Клиент КАК Клиент,
			|	_ВознагражденияУК.ИсточникСредств КАК ИсточникСредств,
			|	СУММА(_ВознагражденияУК.Сумма) КАК Сумма
			|ПОМЕСТИТЬ _ДоходыОтКлиентов
			|ИЗ
			|	_ВознагражденияУК КАК _ВознагражденияУК
			|
			|СГРУППИРОВАТЬ ПО
			|	_ВознагражденияУК.НачалоПериода,
			|	_ВознагражденияУК.Клиент,
			|	_ВознагражденияУК.ИсточникСредств
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДоходыОтКлиентов.НачалоПериода КАК НачалоПериода,
			|	МИНИМУМ(_ДоходыОтКлиентов.КонецПериода) КАК КонецПериода,
			|	_ДоходыОтКлиентов.Клиент КАК Клиент10,
			|	СУММА(_ДоходыОтКлиентов.Сумма) КАК ДоходОтДУ10,
			|	ЕСТЬNULL(РеквизитыКлиентаЮрЛица.КраткоеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыКлиентаФизЛица.Фамилия + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Имя, 1, 1) + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Отчество, 1, 1), _ДоходыОтКлиентов.Клиент)) КАК КраткоеНаименованиеПоУставу10,
			|	РеквизитыКлиентаЮрЛица.ОГРН КАК ОГРН10
			|ИЗ
			|	_ДоходыОтКлиентов КАК _ДоходыОтКлиентов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК РеквизитыКлиентаЮрЛица
			|		ПО _ДоходыОтКлиентов.Клиент = РеквизитыКлиентаЮрЛица.ЮрФизЛицо
			|			И (РеквизитыКлиентаЮрЛица.Организация = &Организация)
			|			И (РеквизитыКлиентаЮрЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК РеквизитыКлиентаФизЛица
			|		ПО _ДоходыОтКлиентов.Клиент = РеквизитыКлиентаФизЛица.ЮрФизЛицо
			|			И (РеквизитыКлиентаФизЛица.Организация = &Организация)
			|			И (РеквизитыКлиентаФизЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДоходыОтКлиентов.НачалоПериода,
			|	_ДоходыОтКлиентов.Клиент,
			|	РеквизитыКлиентаЮрЛица.ОГРН,
			|	ЕСТЬNULL(РеквизитыКлиентаЮрЛица.КраткоеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыКлиентаФизЛица.Фамилия + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Имя, 1, 1) + "" "" + ПОДСТРОКА(РеквизитыКлиентаФизЛица.Отчество, 1, 1), _ДоходыОтКлиентов.Клиент))
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачалоПериода,
			|	СУММА(_ДоходыОтКлиентов.Сумма) УБЫВ
			|ИТОГИ ПО
			|	НачалоПериода");
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ОтчетнаяДата", ЭтотОбъект.ОтчетнаяДата);
		Запрос.УстановитьПараметр("ОтчетнаяДатаКонецДня", КонецДня(ЭтотОбъект.ОтчетнаяДата));

		//Если ЭтотОбъект.ОтчетнаяДата >= '20200101' Тогда
		//	УстановитьПредставлениеОтбора("ДоходыОт10КрупнейшихКлиентовЗа4Квартала", "не учитывать ОПИФ, ИПИФ и БПИФ"); 
		//	Запрос.УстановитьПараметр("Скрывать_ОПИФ_ИПИФ_БПИФ", Истина);
		//Иначе
		//	УстановитьПредставлениеОтбора("ДоходыОт10КрупнейшихКлиентовЗа4Квартала", Неопределено); 
		//	Запрос.УстановитьПараметр("Скрывать_ОПИФ_ИПИФ_БПИФ", Ложь);
		//КонецЕсли;
		Запрос.УстановитьПараметр("Скрывать_ОПИФ_ИПИФ_БПИФ", Ложь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Заполняем результаты
		
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала = Новый ТаблицаЗначений;
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Колонки.Добавить("Период10", Новый ОписаниеТипов("Строка"));
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Колонки.Добавить("ДоходОтДУ10", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Колонки.Добавить("КраткоеНаименованиеПоУставу10", Новый ОписаниеТипов("Строка"));
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Колонки.Добавить("ИсточникСредств10", Новый ОписаниеТипов("Строка"));
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Колонки.Добавить("ОГРН10", Новый ОписаниеТипов("Строка"));
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Колонки.Добавить("НомерВГруппе10", Новый ОписаниеТипов("Число"));
		ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Колонки.Добавить("Клиент10", Метаданные.РегистрыСведений.КлиентыДоверительногоУправления.Ресурсы.Клиент.Тип);

		ИсточникиСредствКлиентов = МенеджерВременныхТаблиц.Таблицы["_ДоходыОтКлиентов"].ПолучитьДанные().Выгрузить();
		ИсточникиСредствКлиентов.Индексы.Добавить("Клиент, НачалоПериода, КонецПериода");
		
		ВыборкаПоДате = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДате.Следующий() Цикл
			НомерВГруппе = 0;
			
			ВыборкаПоКлиенту = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаПоКлиенту.Следующий() Цикл
				НомерВГруппе = НомерВГруппе + 1;
				
				НоваяСтрока = ДоходыОт10КрупнейшихКлиентовЗа4Квартала.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоКлиенту);
				НоваяСтрока.Период10 = Формат(ВыборкаПоКлиенту.НачалоПериода, "ДФ=dd.MM.yyyy") + " - " + Формат(ВыборкаПоКлиенту.КонецПериода, "ДФ=dd.MM.yyyy");
				НоваяСтрока.НомерВГруппе10 = НомерВГруппе;
				
				// Заполняем источник средств
				
				ИсточникиСредств = ИсточникиСредствКлиентов.НайтиСтроки(Новый Структура("Клиент, НачалоПериода, КонецПериода", НоваяСтрока.Клиент10, ВыборкаПоКлиенту.НачалоПериода,ВыборкаПоКлиенту.КонецПериода ));
				Для Каждого ИсточникСредств Из ИсточникиСредств Цикл
					НоваяСтрока.ИсточникСредств10 = ?(ПустаяСтрока(НоваяСтрока.ИсточникСредств10), "", НоваяСтрока.ИсточникСредств10 + ", ") + ИсточникСредств.ИсточникСредств;		
				КонецЦикла;
				
				//// ДоходыОт10КрупнейшихКлиентовЗа4Квартала
				//Если НомерВГруппе = 10 Тогда
				//	Прервать;
				//КонецЕсли;
			КонецЦикла;
		КонецЦикла;
			
		ВнешниеНаборыДанных.Вставить("ДоходыОт10КрупнейшихКлиентовЗа4Квартала", ДоходыОт10КрупнейшихКлиентовЗа4Квартала);
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
		
	КонецЕсли;

#КонецОбласти

#Область Динамика_СЧА_портфелей

	// 13. Приведите динамику стоимости чистых активов в портфелях, сформированных за счет источников средств под управлением управляющей компании,
	//   доля которых в общем объеме средств под управлением составляет не менее 5%.

	#Область Портфели_для_динамики_СЧА	
	
	Если ВключенныеОтчеты.Получить("ДоляАктивовПоИсточникамСредств") = Истина
		ИЛИ ВключенныеОтчеты.Получить("СтруктураПортфелей") = Истина
		ИЛИ ВключенныеОтчеты.Получить("ДинамикаСЧАПортфелей") = Истина Тогда 	
	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеСЧА77.Период КАК Период,
			|	_ДанныеСЧА77.Организация КАК Организация,
			|	_ДанныеСЧА77.СубъектАналитики КАК СубъектАналитики,
			|	_ДанныеСЧА77.ВидПоказателя КАК ВидПоказателя,
			|	_ДанныеСЧА77.Значение КАК Значение
			|ПОМЕСТИТЬ _ФинансовыеПоказатели
			|ИЗ
			|	_ДанныеСЧА77 КАК _ДанныеСЧА77
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ФинансовыеПоказатели.Период,
			|	ФинансовыеПоказатели.Организация,
			|	ФинансовыеПоказатели.СубъектАналитики,
			|	ФинансовыеПоказатели.ВидПоказателя,
			|	ФинансовыеПоказатели.Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	ЕСТЬNULL(_КатегорииСчетовДУ.Категория, СчетаДоверительногоУправления.Ссылка) КАК ИсточникСредств
			|ПОМЕСТИТЬ _ДействующиеСчетаДУ
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииСчетовДУ КАК _КатегорииСчетовДУ
			|		ПО _КатегорииСчетовДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация = &Организация
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ОтчетнаяДата
			|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &ОтчетнаяДата)
			|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|	И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления			
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДействующиеСчетаДУ.ИсточникСредств КАК ИсточникСредств,
			|	_ДействующиеСчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ФинансовыеПоказатели.Значение КАК Стоимость,
			|	ФинансовыеПоказатели.Период КАК Период
			|ПОМЕСТИТЬ _СтоимостьАктивовПоПортфелям
			|ИЗ
			|	_ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ФинансовыеПоказатели.СубъектАналитики КАК СубъектАналитики,
			|				МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаРегистрации
			|			ИЗ
			|				_ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|					ПО (ФинансовыеПоказатели.СубъектАналитики = _ДействующиеСчетаДУ.СчетДоверительногоУправления)
			|						И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
			|						И (ФинансовыеПоказатели.Организация = &Организация)
			|						И (ФинансовыеПоказатели.Период <= &ОтчетнаяДата)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ФинансовыеПоказатели.СубъектАналитики) КАК ДатыРегистрацииСЧА
			|			ПО (ДатыРегистрацииСЧА.СубъектАналитики = ФинансовыеПоказатели.СубъектАналитики)
			|				И (ДатыРегистрацииСЧА.ДатаРегистрации = ФинансовыеПоказатели.Период)
			|		ПО (ФинансовыеПоказатели.СубъектАналитики = _ДействующиеСчетаДУ.СчетДоверительногоУправления)
			|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
			|			И (ФинансовыеПоказатели.Организация = &Организация)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СтоимостьАктивовПоПортфелям.ИсточникСредств КАК ИсточникСредств13_1,
			|	_СтоимостьАктивовПоПортфелям.СчетДоверительногоУправления КАК СчетДоверительногоУправления13_1,
			|	_СтоимостьАктивовПоПортфелям.Стоимость КАК Стоимость13_1,
			|	_СтоимостьАктивовПоПортфелям.Период КАК Период13_1,
			|	_СтоимостьАктивовПоПортфелям.Стоимость * 100 / ОбщаяСтоимостьАктивов.Стоимость КАК Доля13_1
			|ИЗ
			|	_СтоимостьАктивовПоПортфелям КАК _СтоимостьАктивовПоПортфелям,
			|	(ВЫБРАТЬ
			|		СУММА(_СтоимостьАктивовПоПортфелям.Стоимость) КАК Стоимость
			|	ИЗ
			|		_СтоимостьАктивовПоПортфелям КАК _СтоимостьАктивовПоПортфелям) КАК ОбщаяСтоимостьАктивов
			|
			|УПОРЯДОЧИТЬ ПО
			|	_СтоимостьАктивовПоПортфелям.ИсточникСредств,
			|	_СтоимостьАктивовПоПортфелям.Стоимость УБЫВ,
			|	_СтоимостьАктивовПоПортфелям.СчетДоверительногоУправления
			|ИТОГИ
			|	СУММА(Доля13_1)
			|ПО
			|	ИсточникСредств13_1");

		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
			Запрос.УстановитьПараметр(ПараметрОтчета.Ключ, ПараметрОтчета.Значение);
		КонецЦикла;

		Если Вариант = "СтруктураИДинамикаСЧА" Тогда
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления", ""); 	
		КонецЕсли;
		
		СтоимостьАктивовПоПортфелям = Новый ТаблицаЗначений;
		СтоимостьАктивовПоПортфелям.Колонки.Добавить("ИсточникСредств13_1", Новый ОписаниеТипов("Строка"));
		СтоимостьАктивовПоПортфелям.Колонки.Добавить("СчетДоверительногоУправления13_1", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
		СтоимостьАктивовПоПортфелям.Колонки.Добавить("Стоимость13_1", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		СтоимостьАктивовПоПортфелям.Колонки.Добавить("Период13_1", Новый ОписаниеТипов("Дата"));
		СтоимостьАктивовПоПортфелям.Колонки.Добавить("Доля13_1", Новый ОписаниеТипов("Число"));
		СтоимостьАктивовПоПортфелям.Колонки.Добавить("НомерВГруппе13_1", Новый ОписаниеТипов("Число"));

		ПортфелиДляДинамикиСЧА = Новый Массив;

		ВыборкаПоИсточникуСредств = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоИсточникуСредств.Следующий() Цикл
			НомерВГруппе = 0;
			
			ВыборкаПоКлиенту = ВыборкаПоИсточникуСредств.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаПоКлиенту.Следующий() Цикл
				НомерВГруппе = НомерВГруппе + 1;
				
				НоваяСтрока = СтоимостьАктивовПоПортфелям.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоКлиенту);
				НоваяСтрока.НомерВГруппе13_1 = НомерВГруппе;
				
				// Если источник средств под управлением составляет не менее 50% общего объема средств под управлением,
				//   запрашивается динамика стоимости чистых активов в трех крупнейших портфелях,
				//   сформированных за счет средств данного источника.
				// Если источник средств под управлением составляет от 5% до 50% общего объема средств под управлением,
				//   запрашивается динамика стоимости чистых активов в крупнейшем портфеле,
				//   сформированном за счет средств данного источника (в конце списка листов есть пример заполнения).
				
				Если (ВыборкаПоИсточникуСредств.Доля13_1 >= 50 И НомерВГруппе <= 3)
					ИЛИ (ВыборкаПоИсточникуСредств.Доля13_1 >= 5 И НомерВГруппе <= 1)
				Тогда
					ПортфелиДляДинамикиСЧА.Добавить(НоваяСтрока.СчетДоверительногоУправления13_1);
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
			
		ВнешниеНаборыДанных.Вставить("СтоимостьАктивовПоПортфелям", СтоимостьАктивовПоПортфелям);

		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
				
	КонецЕсли;
	
	#КонецОбласти	
	
	// Т.к. для облигаций нужна разбивка по дюрации, то приходится в цикле получать остатки партий
	
	#Область Разбивка_по_дюрации	
	
	Если ВключенныеОтчеты.Получить("СтруктураПортфелей") = Истина Тогда 	
	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	ЕСТЬNULL(_КатегорииСчетовДУ.Категория, СчетаДоверительногоУправления.Ссылка) КАК ИсточникСредств
			|ПОМЕСТИТЬ _ОтобранныеПортфели
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КатегорииСчетовДУ КАК _КатегорииСчетовДУ
			|		ПО (_КатегорииСчетовДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|ГДЕ
			|	СчетаДоверительногоУправления.Ссылка В(&ПортфелиДляДинамикиСЧА)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ) КАК Период,
			|	РегистрацияСтоимостиАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	РегистрацияСтоимостиАктивов.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ _ПоследниеПереоценкиАктивовНеЦБ
			|ИЗ
			|	Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			РегистрацияСтоимостиАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			МАКСИМУМ(РегистрацияСтоимостиАктивов.Дата) КАК Дата
			|		ИЗ
			|			Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОтобранныеПортфели КАК _ОтобранныеПортфели
			|				ПО (_ОтобранныеПортфели.СчетДоверительногоУправления = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления)
			|		ГДЕ
			|			РегистрацияСтоимостиАктивов.Организация = &Организация
			|			И РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
			|			И РегистрацияСтоимостиАктивов.Проведен = ИСТИНА
			|			И НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ) <= &ОтчетнаяДата
			|		
			|		СГРУППИРОВАТЬ ПО
			|			РегистрацияСтоимостиАктивов.СчетДоверительногоУправления) КАК ДатыПоследнихПереоценок
			|		ПО (ДатыПоследнихПереоценок.СчетДоверительногоУправления = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления)
			|			И (ДатыПоследнихПереоценок.Дата = РегистрацияСтоимостиАктивов.Дата)
			|ГДЕ
			|	РегистрацияСтоимостиАктивов.Организация = &Организация
			|	И РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
			|	И РегистрацияСтоимостиАктивов.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(РегистрацияСтоимостиПереоценки.Дата, ДЕНЬ) КАК Период,
			|	РегистрацияСтоимостиПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	РегистрацияСтоимостиПереоценки.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ _ПоследниеПереоценкиЦБ
			|ИЗ
			|	Документ.РегистрацияСтоимостиПереоценки КАК РегистрацияСтоимостиПереоценки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПоследниеПереоценкиАктивовНеЦБ КАК _ПоследниеПереоценкиАктивовНеЦБ
			|		ПО (_ПоследниеПереоценкиАктивовНеЦБ.СчетДоверительногоУправления = РегистрацияСтоимостиПереоценки.СчетДоверительногоУправления)
			|			И (_ПоследниеПереоценкиАктивовНеЦБ.Период = НАЧАЛОПЕРИОДА(РегистрацияСтоимостиПереоценки.Дата, ДЕНЬ))
			|ГДЕ
			|	РегистрацияСтоимостиПереоценки.Организация = &Организация
			|	И РегистрацияСтоимостиПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
			|	И РегистрацияСтоимостиПереоценки.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
			|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.СубъектАналитики КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
			|		КОГДА СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
			|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.СубъектАналитики КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо
			|		КОГДА СтоимостьАктивовНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
			|			ТОГДА ВЫБОР
			|					КОГДА СтоимостьАктивовНеЦБ.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|						ТОГДА СтоимостьАктивовНеЦБ.Контрагент
			|					КОГДА СтоимостьАктивовНеЦБ.СубъектАналитики ССЫЛКА Документ.МНО
			|						ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.СубъектАналитики КАК Документ.МНО).РасчетныйСчет.Банк.ЮрФизЛицо
			|					КОГДА СтоимостьАктивовНеЦБ.СубъектАналитики.Эмитент.ЮрФизЛицо ЕСТЬ НЕ NULL 
			|						ТОГДА СтоимостьАктивовНеЦБ.СубъектАналитики.Эмитент.ЮрФизЛицо
			|					КОГДА СтоимостьАктивовНеЦБ.Основание ССЫЛКА Документ.СделкаРЕПО
			|						ТОГДА ВЫБОР
			|								КОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.Основание КАК Документ.СделкаРЕПО).РасчетныйСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
			|									ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.Основание КАК Документ.СделкаРЕПО).РасчетныйСчет.Банк.ЮрФизЛицо
			|								ИНАЧЕ ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.Основание КАК Документ.СделкаРЕПО).Брокер.ЮрФизЛицо
			|							КОНЕЦ
			|					КОГДА СтоимостьАктивовНеЦБ.Основание ССЫЛКА Документ.СделкаСВалютой
			|						ТОГДА ВЫБОР
			|								КОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.Основание КАК Документ.СделкаСВалютой).РасчетныйСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
			|									ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.Основание КАК Документ.СделкаСВалютой).РасчетныйСчет.Банк.ЮрФизЛицо
			|								ИНАЧЕ ВЫРАЗИТЬ(СтоимостьАктивовНеЦБ.Основание КАК Документ.СделкаСВалютой).Брокер.ЮрФизЛицо
			|							КОНЕЦ
			|					ИНАЧЕ СтоимостьАктивовНеЦБ.ВидЗадолженности
			|				КОНЕЦ
			|		ИНАЧЕ СтоимостьАктивовНеЦБ.ВидАктива
			|	КОНЕЦ КАК ОбъектВложений,
			|	_ОтобранныеПортфели.ИсточникСредств КАК ИсточникСредств,
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
			|			ТОГДА ""Расчетные, депозитные и иные счета в КО (кроме субордов)""
			|		КОГДА СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И (СтоимостьАктивовНеЦБ.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
			|					ИЛИ СтоимостьАктивовНеЦБ.СубъектАналитики ССЫЛКА Справочник.БрокерскиеКомпании
			|					ИЛИ СтоимостьАктивовНеЦБ.СубъектАналитики ССЫЛКА Документ.МНО)
			|			ТОГДА ""Прочая дебиторка срочностью до года""
			|		ИНАЧЕ СтоимостьАктивовНеЦБ.ВидЗадолженности.Наименование
			|	КОНЕЦ КАК ТипВложений,
			|	СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета КАК Сумма,
			|	СтоимостьАктивовНеЦБ.Валюта КАК Валюта,
			|	СтоимостьАктивовНеЦБ.ВидАктива КАК ВидАктива,
			|	ЛОЖЬ КАК ЭтоОблигация,
			|	СтоимостьАктивовНеЦБ.ВидЗадолженности КАК РасшифровкаАктива,
			|	СтоимостьАктивовНеЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СтоимостьАктивовНеЦБ.Регистратор КАК Регистратор,
			|	_ПоследниеПереоценкиАктивовНеЦБ.Период КАК Период
			|ПОМЕСТИТЬ _ДетализацияАктивов
			|ИЗ
			|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеЦБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПоследниеПереоценкиАктивовНеЦБ КАК _ПоследниеПереоценкиАктивовНеЦБ
			|		ПО (_ПоследниеПереоценкиАктивовНеЦБ.Ссылка = СтоимостьАктивовНеЦБ.Регистратор)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОтобранныеПортфели КАК _ОтобранныеПортфели
			|		ПО (_ОтобранныеПортфели.СчетДоверительногоУправления = СтоимостьАктивовНеЦБ.СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК КлиентыДУ
			|		ПО (КлиентыДУ.СчетДоверительногоУправления = СтоимостьАктивовНеЦБ.СчетДоверительногоУправления)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА СтоимостьПереоценкиЦБ.ЦеннаяБумага.Эмитент.ЮрФизЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА СтоимостьПереоценкиЦБ.ЦеннаяБумага.Эмитент.ЮрФизЛицо
			|		ИНАЧЕ СтоимостьПереоценкиЦБ.ЦеннаяБумага
			|	КОНЕЦ,
			|	_ОтобранныеПортфели.ИсточникСредств,
			|	ВЫБОР
			|		КОГДА СтоимостьПереоценкиЦБ.ЦеннаяБумага ССЫЛКА Справочник.Облигации
			|			ТОГДА ВЫБОР
			|					КОГДА СтоимостьПереоценкиЦБ.ЦеннаяБумага.Субординированность = ИСТИНА
			|						ТОГДА ""Субординированные облигации""
			|					КОГДА ВЫРАЗИТЬ(СтоимостьПереоценкиЦБ.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги))
			|						ТОГДА ""Облигации иностранных КО""
			|					КОГДА ВЫРАЗИТЬ(СтоимостьПереоценкиЦБ.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
			|						ТОГДА ""Облигации иностранных эмитентов (кроме КО)""
			|					КОГДА ВЫРАЗИТЬ(СтоимостьПереоценкиЦБ.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
			|						ТОГДА ""Муниципальные ценные бумаги""
			|					КОГДА ВЫРАЗИТЬ(СтоимостьПереоценкиЦБ.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
			|						ТОГДА ""Государственные ценные бумаги субъектов РФ""
			|					КОГДА ВЫРАЗИТЬ(СтоимостьПереоценкиЦБ.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
			|						ТОГДА ""Государственные ценные бумаги РФ""
			|					КОГДА ВЫРАЗИТЬ(СтоимостьПереоценкиЦБ.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов))
			|						ТОГДА ""Облигации российских КО""
			|					ИНАЧЕ СтоимостьПереоценкиЦБ.ЦеннаяБумага.УчетныйАктивЦБРФ.Наименование
			|				КОНЕЦ
			|		КОГДА СтоимостьПереоценкиЦБ.ЦеннаяБумага ССЫЛКА Справочник.Акции
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(КотировкиАкций.LISTNAME, 0) = 1
			|							ИЛИ ВходящиеВИндексММВБ.ЦеннаяБумага ЕСТЬ НЕ NULL 
			|						ТОГДА ""Акции котировального списка I уровня или индекса ММВБ""
			|					ИНАЧЕ ""Иные акции""
			|				КОНЕЦ
			|		КОГДА СтоимостьПереоценкиЦБ.ЦеннаяБумага ССЫЛКА Справочник.Паи
			|			ТОГДА ""Инвестиционные паи ПИФов""
			|		КОГДА ВЫРАЗИТЬ(СтоимостьПереоценкиЦБ.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
			|			ТОГДА ""Производные финансовые инструменты""
			|		ИНАЧЕ СтоимостьПереоценкиЦБ.ЦеннаяБумага.УчетныйАктивЦБРФ.Наименование
			|	КОНЕЦ,
			|	СтоимостьПереоценкиЦБ.СуммаВВалютеУчета + СтоимостьПереоценкиЦБ.СуммаКупонаВВалютеУчета,
			|	СтоимостьПереоценкиЦБ.ЦеннаяБумага.ВалютаНоминала,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги),
			|	СтоимостьПереоценкиЦБ.ЦеннаяБумага ССЫЛКА Справочник.Облигации,
			|	СтоимостьПереоценкиЦБ.ЦеннаяБумага,
			|	СтоимостьПереоценкиЦБ.СчетДоверительногоУправления,
			|	СтоимостьПереоценкиЦБ.Регистратор,
			|	_ПоследниеПереоценкиЦБ.Период
			|ИЗ
			|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценкиЦБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПоследниеПереоценкиЦБ КАК _ПоследниеПереоценкиЦБ
			|		ПО (_ПоследниеПереоценкиЦБ.Ссылка = СтоимостьПереоценкиЦБ.Регистратор)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОтобранныеПортфели КАК _ОтобранныеПортфели
			|		ПО (_ОтобранныеПортфели.СчетДоверительногоУправления = СтоимостьПереоценкиЦБ.СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиЦенныхБумагСводные.СрезПоследних(
			|				&ОтчетнаяДатаКонецДня,
			|				Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
			|					И Биржа = &БиржаММВБ) КАК КотировкиАкций
			|		ПО (КотировкиАкций.ЦеннаяБумага = СтоимостьПереоценкиЦБ.ЦеннаяБумага)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ПеречниОбъектов.Объект КАК ЦеннаяБумага
			|		ИЗ
			|			РегистрСведений.ПеречниОбъектов.СрезПоследних(
			|					&ОтчетнаяДатаКонецДня,
			|					ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ММВБ)
			|						И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СоставИндексаММВБ)) КАК ПеречниОбъектов
			|		ГДЕ
			|			ПеречниОбъектов.Включен = ИСТИНА) КАК ВходящиеВИндексММВБ
			|		ПО (ВходящиеВИндексММВБ.ЦеннаяБумага = СтоимостьПереоценкиЦБ.ЦеннаяБумага)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НастройкиЦелейРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НастройкиЦелейРасчета.ВидУчетаДляОстатковПартий КАК ВидУчета,
			|	_ДетализацияАктивов.РасшифровкаАктива КАК ЦеннаяБумага
			|ПОМЕСТИТЬ _ПараметрыПартий
			|ИЗ
			|	_ПоследниеПереоценкиЦБ КАК _ПоследниеПереоценкиЦБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДетализацияАктивов КАК _ДетализацияАктивов
			|		ПО (_ДетализацияАктивов.СчетДоверительногоУправления = _ПоследниеПереоценкиЦБ.СчетДоверительногоУправления)
			|			И (_ДетализацияАктивов.ЭтоОблигация = ИСТИНА)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЦелейРасчета КАК НастройкиЦелейРасчета
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				НастройкиЦелейРасчета.Организация КАК Организация,
			|				НастройкиЦелейРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|				НастройкиЦелейРасчета.ЦельРасчета КАК ЦельРасчета,
			|				МАКСИМУМ(НастройкиЦелейРасчета.Период) КАК Период
			|			ИЗ
			|				РегистрСведений.НастройкиЦелейРасчета КАК НастройкиЦелейРасчета
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПоследниеПереоценкиЦБ КАК _ПоследниеПереоценкиЦБ
			|					ПО (НастройкиЦелейРасчета.Организация = &Организация)
			|						И НастройкиЦелейРасчета.СчетДоверительногоУправления = _ПоследниеПереоценкиЦБ.СчетДоверительногоУправления
			|						И (НастройкиЦелейРасчета.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
			|						И НастройкиЦелейРасчета.Период <= _ПоследниеПереоценкиЦБ.Период
			|			
			|			СГРУППИРОВАТЬ ПО
			|				НастройкиЦелейРасчета.Организация,
			|				НастройкиЦелейРасчета.СчетДоверительногоУправления,
			|				НастройкиЦелейРасчета.ЦельРасчета) КАК ПоследниеНастройкиЦелейРасчета
			|			ПО (ПоследниеНастройкиЦелейРасчета.Организация = НастройкиЦелейРасчета.Организация)
			|				И (ПоследниеНастройкиЦелейРасчета.СчетДоверительногоУправления = НастройкиЦелейРасчета.СчетДоверительногоУправления)
			|				И (ПоследниеНастройкиЦелейРасчета.ЦельРасчета = НастройкиЦелейРасчета.ЦельРасчета)
			|				И (ПоследниеНастройкиЦелейРасчета.Период = НастройкиЦелейРасчета.Период)
			|		ПО (НастройкиЦелейРасчета.СчетДоверительногоУправления = _ПоследниеПереоценкиЦБ.СчетДоверительногоУправления)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДетализацияАктивов.ОбъектВложений КАК ОбъектВложений,
			|	_ДетализацияАктивов.ИсточникСредств КАК ИсточникСредств,
			|	_ДетализацияАктивов.ТипВложений КАК ТипВложений,
			|	_ДетализацияАктивов.Сумма КАК Сумма,
			|	_ДетализацияАктивов.ВидАктива КАК ВидАктива,
			|	_ДетализацияАктивов.ЭтоОблигация КАК ЭтоОблигация,
			|	_ДетализацияАктивов.РасшифровкаАктива КАК РасшифровкаАктива,
			|	_ДетализацияАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДетализацияАктивов.Регистратор КАК Регистратор,
			|	_ДетализацияАктивов.Период КАК Период,
			|	_ПараметрыПартий.ВидУчета КАК ВидУчета
			|ИЗ
			|	_ДетализацияАктивов КАК _ДетализацияАктивов
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ПараметрыПартий КАК _ПараметрыПартий
			|		ПО (_ПараметрыПартий.СчетДоверительногоУправления = _ДетализацияАктивов.СчетДоверительногоУправления)
			|			И (_ПараметрыПартий.ЦеннаяБумага = _ДетализацияАктивов.РасшифровкаАктива)
			|ИТОГИ
			|	МАКСИМУМ(ЭтоОблигация),
			|	МАКСИМУМ(Период),
			|	МАКСИМУМ(ВидУчета)
			|ПО
			|	СчетДоверительногоУправления");
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;			
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ОтчетнаяДата", ЭтотОбъект.ОтчетнаяДата);
		Запрос.УстановитьПараметр("ОтчетнаяДатаКонецДня", КонецДня(ЭтотОбъект.ОтчетнаяДата));
		Запрос.УстановитьПараметр("БиржаММВБ", БиржаММВБ);
		Запрос.УстановитьПараметр("ПортфелиДляДинамикиСЧА", ПортфелиДляДинамикиСЧА);
		
		ПартииОблигаций = Новый ТаблицаЗначений;
		ПартииОблигаций.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
		ПартииОблигаций.Колонки.Добавить("ЦеннаяБумага", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
		ПартииОблигаций.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		ПартииОблигаций.Колонки.Добавить("КоличествоВсего", Новый ОписаниеТипов("Число"));
		ПартииОблигаций.Колонки.Добавить("ДюрацияВГодах", Новый ОписаниеТипов("Число"));
			
		ВыборкаПоКлиентам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока ВыборкаПоКлиентам.Следующий() Цикл
			
			Если ВыборкаПоКлиентам.ЭтоОблигация Тогда // Есть облигации
				
				// ПФР не ведет партионный учет, поэтому дюрацию бумаг берем из котировок	
				
				МетодОценкиСтоимости = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(ЭтотОбъект.ОтчетнаяДата, ЭтотОбъект.Организация, ВыборкаПоКлиентам.СчетДоверительногоУправления, ВыборкаПоКлиентам.ВидУчета, "МетодОценкиСтоимости");  
					
				Если МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ПоСреднему Тогда 
					
					Запрос.Текст = 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
						|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
						|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
						|	ВЫРАЗИТЬ(КотировкиЦенныхБумаг.DURATION / 365 КАК ЧИСЛО(27, 5)) КАК ДюрацияВГодах
						|ИЗ
						|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
						|			&Период,
						|			(Организация, СчетДоверительногоУправления, ВидУчета, Рынок, ЦеннаяБумага) В
						|				(ВЫБРАТЬ
						|					&Организация,
						|					_ПараметрыПартий.СчетДоверительногоУправления,
						|					_ПараметрыПартий.ВидУчета,
						|					ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации),
						|					_ПараметрыПартий.ЦеннаяБумага
						|				ИЗ
						|					_ПараметрыПартий КАК _ПараметрыПартий
						|				ГДЕ
						|					_ПараметрыПартий.СчетДоверительногоУправления = &СчетДоверительногоУправления)) КАК БухПартииЦенныхБумагОстатки
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиЦенныхБумагСводные.СрезПоследних(
						|				&ОтчетнаяДатаКонецДня,
						|				Биржа = &БиржаММВБ
						|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК КотировкиЦенныхБумаг
						|		ПО (КотировкиЦенныхБумаг.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага)
						|";
					
				Иначе
					
					Запрос.Текст = "
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
						|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
						|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
						|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
						|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
						|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток / БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК ЦенаПокупки,
						|	ЕСТЬNULL(ВводЦенныхБумаг.ДатаПокупки, БухПартииЦенныхБумагОстатки.Партия.Дата) КАК ДатаПокупки
						|ИЗ
						|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
						|			&Период,
						|			(Организация, СчетДоверительногоУправления, ВидУчета, Рынок, ЦеннаяБумага) В
						|				(ВЫБРАТЬ
						|					&Организация,
						|					_ПараметрыПартий.СчетДоверительногоУправления,
						|					_ПараметрыПартий.ВидУчета,
						|					ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации),
						|					_ПараметрыПартий.ЦеннаяБумага
						|				ИЗ
						|					_ПараметрыПартий КАК _ПараметрыПартий
						|				ГДЕ
						|					_ПараметрыПартий.СчетДоверительногоУправления = &СчетДоверительногоУправления)) КАК БухПартииЦенныхБумагОстатки
						|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумаг    
						|	ПО ВводЦенныхБумаг.Ссылка = БухПартииЦенныхБумагОстатки.Партия
						|		И ВводЦенныхБумаг.НомерСтроки = БухПартииЦенныхБумагОстатки.СтрокаПартии
						|		И ВводЦенныхБумаг.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
						|		И ВводЦенныхБумаг.ДатаПокупки <> ДАТАВРЕМЯ(1, 1, 1)
						|";
					
				КонецЕсли;	
					
				Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ВыборкаПоКлиентам.Период), ВидГраницы.Включая));
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", ВыборкаПоКлиентам.СчетДоверительногоУправления);
				
				ПартииОблигацийКлиента = Запрос.Выполнить().Выгрузить();
				
			КонецЕсли;
			
			ВыборкаПоАктивам = ВыборкаПоКлиентам.Выбрать();
			Пока ВыборкаПоАктивам.Следующий() Цикл
				
				Если ВыборкаПоАктивам.ЭтоОблигация Тогда
					
					ПартииБумагиКлиента = ПартииОблигацийКлиента.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаПоАктивам.РасшифровкаАктива));
					Для Каждого СтрокаПартииБумагиКлиента Из ПартииБумагиКлиента Цикл
						
						Если МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ПоСреднему Тогда 
							
							Если Не ЗначениеЗаполнено(СтрокаПартииБумагиКлиента.ДюрацияВГодах) Тогда
								Сообщить("Не определена дюрация бумаги """ + Строка(СтрокаПартииБумагиКлиента.ЦеннаяБумага) + """ для """ + Строка(СтрокаПартииБумагиКлиента.СчетДоверительногоУправления) + """");
								Продолжить;
							КонецЕсли;
							
							СтрокаПартии = ПартииОблигаций.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаПартии, СтрокаПартииБумагиКлиента);					
							
						Иначе
							
							Если СтрокаПартииБумагиКлиента.ЦенаПокупки = 0 Тогда
								Сообщить("Не определена цена """ + Строка(СтрокаПартииБумагиКлиента.ЦеннаяБумага) + """ по партии """ + Строка(СтрокаПартииБумагиКлиента.Партия) + """ для """ + Строка(СтрокаПартииБумагиКлиента.СчетДоверительногоУправления) + """");
								Продолжить;
							КонецЕсли;
								
							СтрокаПартии = ПартииОблигаций.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаПартии, СтрокаПартииБумагиКлиента);					
								
							ДанныеРасчета = Справочники.Облигации.ПолучитьДоходностьИДюрацию(СтрокаПартииБумагиКлиента.ЦеннаяБумага, Истина, СтрокаПартииБумагиКлиента.ДатаПокупки, СтрокаПартииБумагиКлиента.ЦенаПокупки, СтрокаПартииБумагиКлиента.СчетДоверительногоУправления, БиржаММВБ); 
							СтрокаПартии.ДюрацияВГодах = Окр(ДанныеРасчета.Дюрация / 365, 5);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПартииОблигаций.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ПартииОблигаций.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ПартииОблигаций.Количество КАК Количество,
			|	_ПартииОблигаций.ДюрацияВГодах КАК ДюрацияВГодах
			|ПОМЕСТИТЬ
			|	_ПартииОблигаций
			|ИЗ
			|	&ПартииОблигаций КАК _ПартииОблигаций
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДетализацияАктивов.ОбъектВложений КАК ОбъектВложений13_2,
			|	_ДетализацияАктивов.ИсточникСредств КАК ИсточникСредств13_2,
			|	_ДетализацияАктивов.ВидАктива КАК ВидАктива13_2,
			|	_ДетализацияАктивов.РасшифровкаАктива КАК РасшифровкаАктива13_2,
			|	_ДетализацияАктивов.Валюта КАК Валюта13_2,
			|	_ДетализацияАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления13_2,
			|	_ДетализацияАктивов.Регистратор КАК Регистратор13_2,
			|	_ДетализацияАктивов.Период КАК Период13_2,
			|	ВЫБОР
			|		КОГДА _ПартииОблигаций.ДюрацияВГодах < 1   
			|			ТОГДА _ДетализацияАктивов.ТипВложений + "" 1Y""  
			|		КОГДА _ПартииОблигаций.ДюрацияВГодах < 3   
			|			ТОГДА _ДетализацияАктивов.ТипВложений + "" 1-3Y""  
			|		КОГДА _ПартииОблигаций.ДюрацияВГодах < 5   
			|			ТОГДА _ДетализацияАктивов.ТипВложений + "" 3-5Y""  
			|		КОГДА _ПартииОблигаций.ДюрацияВГодах >= 5   
			|			ТОГДА _ДетализацияАктивов.ТипВложений + "" 5Y+""  
			|		КОГДА _ДетализацияАктивов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)  
			|			ТОГДА ""КЗ: "" + _ДетализацияАктивов.ТипВложений  
			|		ИНАЧЕ _ДетализацияАктивов.ТипВложений
			|	КОНЕЦ КАК ТипВложений13_2,
			|	ВЫБОР
			|		КОГДА _ПартииОблигаций.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА _ДетализацияАктивов.Сумма
			|		ИНАЧЕ _ДетализацияАктивов.Сумма * _ПартииОблигаций.Количество / _ПартииОблигацийИтог.Количество 
			|	КОНЕЦ КАК Сумма13_2,
			|	ВЫБОР
			|		КОГДА _ПартииОблигаций.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА _ДетализацияАктивов.Сумма * 100 / _ДетализацияАктивовИтог.Сумма
			|		ИНАЧЕ _ДетализацияАктивов.Сумма * _ПартииОблигаций.Количество * 100 / _ПартииОблигацийИтог.Количество / _ДетализацияАктивовИтог.Сумма 
			|	КОНЕЦ КАК Доля13_2,
			|	_ПартииОблигаций.Количество КАК Количество13_2
			|ИЗ
			|	_ДетализацияАктивов КАК _ДетализацияАктивов
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
			|		ВЫБРАТЬ
			|			_ДетализацияАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			СУММА(_ДетализацияАктивов.Сумма) КАК Сумма
			|		ИЗ
			|			_ДетализацияАктивов КАК _ДетализацияАктивов
			|			СГРУППИРОВАТЬ ПО
			|				_ДетализацияАктивов.СчетДоверительногоУправления
			|	) КАК _ДетализацияАктивовИтог
			|	ПО _ДетализацияАктивовИтог.СчетДоверительногоУправления = _ДетализацияАктивов.СчетДоверительногоУправления
			|	ЛЕВОЕ СОЕДИНЕНИЕ _ПартииОблигаций КАК _ПартииОблигаций
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
			|			ВЫБРАТЬ
			|				_ПартииОблигаций.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|				_ПартииОблигаций.ЦеннаяБумага КАК ЦеннаяБумага,
			|				СУММА(_ПартииОблигаций.Количество) КАК Количество
			|			ИЗ
			|				_ПартииОблигаций КАК _ПартииОблигаций
			|			СГРУППИРОВАТЬ ПО
			|				_ПартииОблигаций.СчетДоверительногоУправления,
			|				_ПартииОблигаций.ЦеннаяБумага
			|		) КАК _ПартииОблигацийИтог
			|		ПО _ПартииОблигацийИтог.СчетДоверительногоУправления = _ПартииОблигаций.СчетДоверительногоУправления
			|			И _ПартииОблигацийИтог.ЦеннаяБумага = _ПартииОблигаций.ЦеннаяБумага
			|	ПО _ПартииОблигаций.СчетДоверительногоУправления = _ДетализацияАктивов.СчетДоверительногоУправления
			|		И _ПартииОблигаций.ЦеннаяБумага = _ДетализацияАктивов.РасшифровкаАктива";
		
		Запрос.УстановитьПараметр("ПартииОблигаций", ПартииОблигаций);
		
		ВнешниеНаборыДанных.Вставить("СтруктураПортфеляПоИнструментам", Запрос.Выполнить().Выгрузить());
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
		
	КонецЕсли;
	
	#КонецОбласти	
	
	#Область Итоговый_запрос_динамики_СЧА	

	Если ВключенныеОтчеты.Получить("ДинамикаСЧАПортфелей") = Истина Тогда

		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеСЧА77.Период КАК Период,
			|	_ДанныеСЧА77.Организация КАК Организация,
			|	_ДанныеСЧА77.СубъектАналитики КАК СубъектАналитики,
			|	_ДанныеСЧА77.ВидПоказателя КАК ВидПоказателя,
			|	_ДанныеСЧА77.Значение КАК Значение
			|ПОМЕСТИТЬ _ФинансовыеПоказатели
			|ИЗ
			|	_ДанныеСЧА77 КАК _ДанныеСЧА77
			|ГДЕ
			|	_ДанныеСЧА77.Период <= &ОтчетнаяДата			
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ФинансовыеПоказатели.Период,
			|	ФинансовыеПоказатели.Организация,
			|	ФинансовыеПоказатели.СубъектАналитики,
			|	ФинансовыеПоказатели.ВидПоказателя,
			|	ФинансовыеПоказатели.Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|	И ФинансовыеПоказатели.Период <= &ОтчетнаяДата			
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.СубъектАналитики КАК СчетДоверительногоУправления,
			|	ФинансовыеПоказатели.Значение КАК Значение,
			|	ФинансовыеПоказатели.Период КАК Период,
			|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МАКСИМУМ(ФинансовыеПоказателиПредыдущие.Период), ДЕНЬ, 1), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПредыдущейСЧА
			|ПОМЕСТИТЬ _СЧА
			|ИЗ
			|	_ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК ФинансовыеПоказателиПредыдущие
			|		ПО (ФинансовыеПоказателиПредыдущие.Организация = ФинансовыеПоказатели.Организация)
			|			И (ФинансовыеПоказателиПредыдущие.ВидПоказателя = ФинансовыеПоказатели.ВидПоказателя)
			|			И (ФинансовыеПоказателиПредыдущие.СубъектАналитики = ФинансовыеПоказатели.СубъектАналитики)
			|			И (ФинансовыеПоказателиПредыдущие.Период < ФинансовыеПоказатели.Период)
			|ГДЕ
			|	ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|	И ФинансовыеПоказатели.СубъектАналитики В(&ПортфелиДляДинамикиСЧА)
			|
			|СГРУППИРОВАТЬ ПО
			|	ФинансовыеПоказатели.СубъектАналитики,
			|	ФинансовыеПоказатели.Значение,
			|	ФинансовыеПоказатели.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления13_3,
			|	_СЧА.Период КАК Период13_3,
			|	_СЧА.Значение КАК СЧА13_3,
			|	ОборотыАктивов.Период КАК ОборотыПериод13_3,
			|	ВЫБОР
			|		КОГДА ОборотыАктивов.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
			|			ТОГДА -ОборотыАктивов.РыночнаяСтоимостьОборот
			|		ИНАЧЕ ОборотыАктивов.РыночнаяСтоимостьОборот
			|	КОНЕЦ КАК ВводВывод13_3
			|ИЗ
			|	_СЧА КАК _СЧА
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
			|				,
			|				&ОтчетнаяДатаКонецДняГраница,
			|				ДЕНЬ,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В (&ПортфелиДляДинамикиСЧА)
			|					И ВЫБОР
			|						КОГДА СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|							ТОГДА ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваДоходПоПаямЗПИФ), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриНеудачномВыводеДенежныхСредствПайщику))
			|						ИНАЧЕ ИСТИНА
			|					КОНЕЦ) КАК ОборотыАктивов
			|		ПО (ОборотыАктивов.СчетДоверительногоУправления = _СЧА.СчетДоверительногоУправления)
			|			И (ОборотыАктивов.Период МЕЖДУ _СЧА.ДатаПредыдущейСЧА И _СЧА.Период)");
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
			Запрос.УстановитьПараметр(ПараметрОтчета.Ключ, ПараметрОтчета.Значение);
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ПортфелиДляДинамикиСЧА", ПортфелиДляДинамикиСЧА);		
		
		ВнешниеНаборыДанных.Вставить("ДинамикаСЧА", Запрос.Выполнить().Выгрузить());
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
		
	КонецЕсли;	
			
	#КонецОбласти	
	
#КонецОбласти

#Область Активы_депозитариев	

	Если ВключенныеОтчеты.Получить("АктивыДепозитариев") = Истина Тогда

		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеСЧА77.Период КАК Период,
			|	_ДанныеСЧА77.Организация КАК Организация,
			|	_ДанныеСЧА77.СубъектАналитики КАК СубъектАналитики,
			|	_ДанныеСЧА77.ВидПоказателя КАК ВидПоказателя,
			|	_ДанныеСЧА77.Значение КАК Значение
			|ПОМЕСТИТЬ _ФинансовыеПоказатели
			|ИЗ
			|	_ДанныеСЧА77 КАК _ДанныеСЧА77
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ФинансовыеПоказатели.Период,
			|	ФинансовыеПоказатели.Организация,
			|	ФинансовыеПоказатели.СубъектАналитики,
			|	ФинансовыеПоказатели.ВидПоказателя,
			|	ФинансовыеПоказатели.Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.СпециализированныйДепозитарий КАК СпецДеп
			|ПОМЕСТИТЬ _ДействующиеСчетаДУ
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ОтчетнаяДата, ) КАК КлиентыДУ
			|		ПО (КлиентыДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация = &Организация
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ОтчетнаяДата
			|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &ОтчетнаяДата)
			|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОстаткиЦенныхБумаг.ДепозитарныйСчет.Депозитарий КАК Депозитарий,
			|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _ДепозитарииКлиентов
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
			|			&ОтчетнаяДатаКонецДняГраница,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_ДействующиеСчетаДУ.СчетДоверительногоУправления
			|					ИЗ
			|						_ДействующиеСчетаДУ
			|					ГДЕ
			|						_ДействующиеСчетаДУ.СпецДеп = ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.ПустаяСсылка))) КАК ОстаткиЦенныхБумаг
			|ГДЕ
			|	ОстаткиЦенныхБумаг.ДепозитарныйСчет.Депозитарий <> ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиЦенныхБумаг.ДепозитарныйСчет.Депозитарий,
			|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Исполнители.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	Исполнители.ДепозитарныйСчет.Депозитарий КАК Депозитарий
			|ПОМЕСТИТЬ _ДепозитарииИзИсполнителей
			|ИЗ
			|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК Исполнители
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ
			|		ПО (_ДействующиеСчетаДУ.СчетДоверительногоУправления = Исполнители.СчетДоверительногоУправления)
			|			И (Исполнители.Организация = &Организация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ОтчетнаяДата, ) КАК УсловияДоговоровОбщиеСрезПоследних
			|			ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = Исполнители.ДепозитарныйСчет.Договор)
			|ГДЕ
			|	(Исполнители.ДатаЗакрытия > &ОтчетнаяДата
			|			ИЛИ Исполнители.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
			|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
			|		ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|		ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ОтчетнаяДата)
			|	И (Исполнители.ДепозитарныйСчет.Договор.ДатаЗаключения <= &ОтчетнаяДата
			|			ИЛИ Исполнители.ДепозитарныйСчет.Договор.ДатаЗаключения = ДАТАВРЕМЯ(1, 1, 1))
			|
			|СГРУППИРОВАТЬ ПО
			|	Исполнители.СчетДоверительногоУправления,
			|	Исполнители.ДепозитарныйСчет.Депозитарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДействующиеСчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВЫБОР
			|		КОГДА _ДействующиеСчетаДУ.СпецДеп <> ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.ПустаяСсылка)
			|			ТОГДА _ДействующиеСчетаДУ.СпецДеп
			|		КОГДА ЕСТЬNULL(_ДепозитарииКлиентов.Депозитарий, ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.ПустаяСсылка)
			|			ТОГДА _ДепозитарииКлиентов.Депозитарий
			|		ИНАЧЕ _ДепозитарииИзИсполнителей.Депозитарий
			|	КОНЕЦ КАК Депозитарий
			|ПОМЕСТИТЬ _ДепозитарииИСпецДепозитарииСчетовДУ
			|ИЗ
			|	_ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарииКлиентов КАК _ДепозитарииКлиентов
			|		ПО (_ДепозитарииКлиентов.СчетДоверительногоУправления = _ДействующиеСчетаДУ.СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарииИзИсполнителей КАК _ДепозитарииИзИсполнителей
			|		ПО (_ДепозитарииИзИсполнителей.СчетДоверительногоУправления = _ДействующиеСчетаДУ.СчетДоверительногоУправления)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДепозитарииИСпецДепозитарииСчетовДУ.Депозитарий КАК Депозитарий18,
			|	РеквизитыЮрЛица.КраткоеНаименованиеПоУставу КАК НаименованиеДепозитария18,
			|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ОГРНДепозитария18,
			|	_ДепозитарииИСпецДепозитарииСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления18,
			|	ФинансовыеПоказатели.Значение КАК Сумма18,
			|	ФинансовыеПоказатели.Период КАК ДатаСЧА18
			|ИЗ
			|	_ДепозитарииИСпецДепозитарииСчетовДУ КАК _ДепозитарииИСпецДепозитарииСчетовДУ
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ФинансовыеПоказатели.СубъектАналитики КАК СубъектАналитики,
			|				МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаРегистрации
			|			ИЗ
			|				_ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|					ПО (ФинансовыеПоказатели.СубъектАналитики = _ДействующиеСчетаДУ.СчетДоверительногоУправления)
			|						И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
			|						И (ФинансовыеПоказатели.Организация = &Организация)
			|						И (ФинансовыеПоказатели.Период <= &ОтчетнаяДата)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ФинансовыеПоказатели.СубъектАналитики) КАК ДатыРегистрацииСЧА
			|			ПО (ДатыРегистрацииСЧА.СубъектАналитики = ФинансовыеПоказатели.СубъектАналитики)
			|				И (ДатыРегистрацииСЧА.ДатаРегистрации = ФинансовыеПоказатели.Период)
			|		ПО (ФинансовыеПоказатели.СубъектАналитики = _ДепозитарииИСпецДепозитарииСчетовДУ.СчетДоверительногоУправления)
			|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
			|			И (ФинансовыеПоказатели.Организация = &Организация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК РеквизитыЮрЛица
			|		ПО (РеквизитыЮрЛица.ЮрФизЛицо = _ДепозитарииИСпецДепозитарииСчетовДУ.Депозитарий.ЮрФизЛицо)
			|			И (РеквизитыЮрЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
			|			И (РеквизитыЮрЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
			|				&ОтчетнаяДатаКонецДня,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|					И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)
			|					И ЮрФизЛицо В
			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|							_ДепозитарииИСпецДепозитарииСчетовДУ.Депозитарий.ЮрФизЛицо КАК ДепозитарийЮрФизЛицо
			|						ИЗ
			|							_ДепозитарииИСпецДепозитарииСчетовДУ КАК _ДепозитарииИСпецДепозитарииСчетовДУ)) КАК ДокументыЮридическихЛицСрезПоследних
			|		ПО (_ДепозитарииИСпецДепозитарииСчетовДУ.Депозитарий.ЮрФизЛицо = ДокументыЮридическихЛицСрезПоследних.ЮрФизЛицо
			|				И ДокументыЮридическихЛицСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует))");
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
			Запрос.УстановитьПараметр(ПараметрОтчета.Ключ, ПараметрОтчета.Значение);
		КонецЦикла;
		
		ВнешниеНаборыДанных.Вставить("АктивыДепозитариев", Запрос.Выполнить().Выгрузить());
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , ОбщиеВременныеТаблицы);
		
	КонецЕсли;	
			
#КонецОбласти

	СтандартнаяОбработка = Ложь;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, , , МенеджерВременныхТаблиц); 
	
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

#Область Вспомогательные_функции

Процедура ПоместитьКатегорииКлиентовВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц)
	
	// ВНИМАНИЕ!
	// Типы инструментов зависят от категории клиентов, поэтому при изменении категорий
	// необходимо разнести для них типы инструментов в ДетализацияАктивов
	
	Если ЭтотОбъект.ОтчетнаяДата >= '20210101' Тогда	
		
		#Область Актуальные_категории		

		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""средства пенсионных накоплений Пенсионного фонда РФ"" КАК Наименование,
			|	1 КАК Порядок
			|ПОМЕСТИТЬ _КатегорииКлиентов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства пенсионных накоплений НПФ"",
			|	2
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства пенсионных резервов НПФ"",
			|	3
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства накоплений для жилищного обеспечения военнослужащих"",
			|	4
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""активы страховых резервов и собственных средств страховых компаний"",
			|	5
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства открытых, интервальных и биржевых паевых инвестиционных фондов"",
			|	6
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства закрытых паевых инвестиционных фондов"",
			|	7
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства ипотечного покрытия"",
			|	8
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства фондов СРО"",
			|	9
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства эндаумент-фондов"",
			|	10
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства корпоративных клиентов в ИДУ"",
			|	11
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства физических лиц в ИДУ"",
			|	12
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	ВЫБОР
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
			|			ТОГДА ""средства пенсионных накоплений Пенсионного фонда РФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
			|			ТОГДА ""средства пенсионных накоплений НПФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
			|			ТОГДА ""средства пенсионных резервов НПФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
			|			ТОГДА ""средства накоплений для жилищного обеспечения военнослужащих""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
			|			ТОГДА ""активы страховых резервов и собственных средств страховых компаний""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|				И КлиентыДУ.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
			|				И ВЫРАЗИТЬ(КлиентыДУ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой))
			|			ТОГДА ""средства открытых, интервальных и биржевых паевых инвестиционных фондов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|				И КлиентыДУ.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
			|				И ВЫРАЗИТЬ(КлиентыДУ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
			|			ТОГДА ""средства закрытых паевых инвестиционных фондов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
			|			ТОГДА ""средства фондов СРО""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
			|			ТОГДА ""средства эндаумент-фондов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
			|			ТОГДА ""средства корпоративных клиентов в ИДУ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
			|			ТОГДА ""средства физических лиц в ИДУ""
			|	КОНЕЦ КАК Категория,
			|	ВЫБОР
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
			|			ТОГДА ""Пенсионные накопления ПФР, НПФ и накопления для жилищного обеспечения военнослужащих""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
			|			ТОГДА ""Активы страховых резервов и собственных средств страховых компаний""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|				И КлиентыДУ.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
			|				И ВЫРАЗИТЬ(КлиентыДУ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
			|			ТОГДА ""ЗПИФ""
			|		ИНАЧЕ ""Иные средства под управлением""
			|	КОНЕЦ КАК УкрупненнаяКатегория
			|ПОМЕСТИТЬ _КатегорииСчетовДУ
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК КлиентыДУ
			|		ПО (КлиентыДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПаевойИнвестиционныйФонд.Ссылка КАК ПаевойИнвестиционныйФонд,
			|	ВЫБОР
			|		КОГДА ПаевойИнвестиционныйФонд.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой))
			|			ТОГДА ""средства открытых, интервальных и биржевых паевых инвестиционных фондов""
			|		КОГДА ПаевойИнвестиционныйФонд.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
			|			ТОГДА ""средства закрытых паевых инвестиционных фондов""
			|	КОНЕЦ КАК Категория
			|ПОМЕСТИТЬ _КатегорииПИФ
			|ИЗ
			|	Справочник.ПаевыеИнвестиционныеФонды КАК ПаевойИнвестиционныйФонд";
		
		#КонецОбласти		
		
	ИначеЕсли ЭтотОбъект.ОтчетнаяДата >= '20200101' Тогда	
		
		#Область Категории_до_01_01_2021		

		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""средства пенсионных накоплений Пенсионного фонда РФ"" КАК Наименование,
			|	1 КАК Порядок
			|ПОМЕСТИТЬ _КатегорииКлиентов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства пенсионных накоплений НПФ"",
			|	2
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства пенсионных резервов НПФ"",
			|	3
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства накоплений для жилищного обеспечения военнослужащих"",
			|	4
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""активы страховых резервов и собственных средств страховых компаний"",
			|	5
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства открытых, интервальных и биржевых паевых инвестиционных фондов"",
			|	6
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства закрытых паевых инвестиционных фондов"",
			|	7
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства ипотечного покрытия"",
			|	8
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства фондов СРО"",
			|	9
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства эндаумент-фондов"",
			|	10
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства корпоративных клиентов в ИДУ"",
			|	11
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства физических лиц в ИДУ"",
			|	12
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	ВЫБОР
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
			|			ТОГДА ""средства пенсионных накоплений Пенсионного фонда РФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
			|			ТОГДА ""средства пенсионных накоплений НПФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
			|			ТОГДА ""средства пенсионных резервов НПФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
			|			ТОГДА ""средства накоплений для жилищного обеспечения военнослужащих""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
			|			ТОГДА ""активы страховых резервов и собственных средств страховых компаний""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|				И КлиентыДУ.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
			|				И ВЫРАЗИТЬ(КлиентыДУ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой))
			|			ТОГДА ""средства открытых, интервальных и биржевых паевых инвестиционных фондов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|				И КлиентыДУ.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
			|				И ВЫРАЗИТЬ(КлиентыДУ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
			|			ТОГДА ""средства закрытых паевых инвестиционных фондов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
			|			ТОГДА ""средства фондов СРО""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
			|			ТОГДА ""средства эндаумент-фондов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
			|			ТОГДА ""средства корпоративных клиентов в ИДУ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
			|			ТОГДА ""средства физических лиц в ИДУ""
			|	КОНЕЦ КАК Категория,
			|	ВЫБОР
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
			|			ТОГДА ""Пенсионные накопления ПФР, НПФ и накопления для жилищного обеспечения военнослужащих""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
			|				ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
			|			ТОГДА ""Активы страховых резервов и собственных средств страховых компаний""
			|		ИНАЧЕ ""ЗПИФ и иные средства под управлением""
			|	КОНЕЦ КАК УкрупненнаяКатегория
			|ПОМЕСТИТЬ _КатегорииСчетовДУ
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК КлиентыДУ
			|		ПО (КлиентыДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПаевойИнвестиционныйФонд.Ссылка КАК ПаевойИнвестиционныйФонд,
			|	ВЫБОР
			|		КОГДА ПаевойИнвестиционныйФонд.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой))
			|			ТОГДА ""средства открытых, интервальных и биржевых паевых инвестиционных фондов""
			|		КОГДА ПаевойИнвестиционныйФонд.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
			|			ТОГДА ""средства закрытых паевых инвестиционных фондов""
			|	КОНЕЦ КАК Категория
			|ПОМЕСТИТЬ _КатегорииПИФ
			|ИЗ
			|	Справочник.ПаевыеИнвестиционныеФонды КАК ПаевойИнвестиционныйФонд";
		
		#КонецОбласти
		
	Иначе
		
		#Область Категории_до_01_01_2020
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""средства пенсионных накоплений Пенсионного фонда РФ"" КАК Наименование,
			|	1 КАК Порядок
			|ПОМЕСТИТЬ _КатегорииКлиентов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства пенсионных накоплений НПФ"",
			|	2
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства пенсионных резервов НПФ"",
			|	3
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства накоплений для жилищного обеспечения военнослужащих"",
			|	4
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства страховых резервов"",
			|	5
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства открытых и интервальных ПИФов"",
			|	6
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства ЗПИФов"",
			|	7
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства ипотечного покрытия (ИСУ)"",
			|	8
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства фондов СРО"",
			|	9
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства эндаумент-фондов"",
			|	10
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства корпоративных клиентов в ИДУ"",
			|	11
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""средства физических лиц в ИДУ"",
			|	12
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	ВЫБОР
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
			|			ТОГДА ""средства пенсионных накоплений Пенсионного фонда РФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
			|			ТОГДА ""средства пенсионных накоплений НПФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
			|			ТОГДА ""средства пенсионных резервов НПФ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
			|			ТОГДА ""средства накоплений для жилищного обеспечения военнослужащих""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
			|			ТОГДА ""средства страховых резервов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|				И КлиентыДУ.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
			|				И ВЫРАЗИТЬ(КлиентыДУ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный))
			|			ТОГДА ""средства открытых и интервальных ПИФов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
			|				И КлиентыДУ.Клиент ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды
			|				И ВЫРАЗИТЬ(КлиентыДУ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
			|			ТОГДА ""средства ЗПИФов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
			|			ТОГДА ""средства фондов СРО""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
			|			ТОГДА ""средства эндаумент-фондов""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
			|			ТОГДА ""средства корпоративных клиентов в ИДУ""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
			|			ТОГДА ""средства физических лиц в ИДУ""
			|	КОНЕЦ КАК Категория,
			|	ВЫБОР
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
			|			ТОГДА ""Средства пенсионных накоплений""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
			|			ТОГДА ""Средства накоплений для жилищного обеспечения военнослужащих""
			|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
			|			ТОГДА ""Средства страховых резервов""
			|		ИНАЧЕ ""Иные средства под управлением""
			|	КОНЕЦ КАК УкрупненнаяКатегория
			|ПОМЕСТИТЬ _КатегорииСчетовДУ
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ОтчетнаяДатаКонецДня, ) КАК КлиентыДУ
			|		ПО (КлиентыДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПаевойИнвестиционныйФонд.Ссылка КАК ПаевойИнвестиционныйФонд,
			|	ВЫБОР
			|		КОГДА ПаевойИнвестиционныйФонд.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный))
			|			ТОГДА ""средства открытых и интервальных ПИФов""
			|		КОГДА ПаевойИнвестиционныйФонд.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
			|			ТОГДА ""средства ЗПИФов""
			|	КОНЕЦ КАК Категория
			|ПОМЕСТИТЬ _КатегорииПИФ
			|ИЗ
			|	Справочник.ПаевыеИнвестиционныеФонды КАК ПаевойИнвестиционныйФонд";
		
		#КонецОбласти
		
	КонецЕсли;
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",			ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ОтчетнаяДата",			ЭтотОбъект.ОтчетнаяДата);
	Запрос.УстановитьПараметр("ОтчетнаяДатаКонецДня",	КонецДня(ЭтотОбъект.ОтчетнаяДата));
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПоместитьВременныеИнтервалыВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц) 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ОтчетнаяДата, КВАРТАЛ, _Глубины.Значение), КВАРТАЛ) КАК НачалоПериода,
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ОтчетнаяДата, КВАРТАЛ, _Глубины.Значение), КВАРТАЛ) КАК КонецПериода,
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ОтчетнаяДата, КВАРТАЛ, _Глубины.Значение), КВАРТАЛ), ДЕНЬ) КАК КонецПериодаНачалоДня
		|ПОМЕСТИТЬ _Последние8Кварталов
		|ИЗ
		|	(ВЫБРАТЬ
		|		0 КАК Значение
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-1
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-2
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-3
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-4
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-5
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-6
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-7
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-8) КАК _Глубины
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДОБАВИТЬКДАТЕ(&ОтчетнаяДата, ГОД, _Глубины.Значение - 1) КАК НачалоПериода,
		|	ДОБАВИТЬКДАТЕ(&ОтчетнаяДата, ГОД, _Глубины.Значение) КАК КонецПериода
		|ПОМЕСТИТЬ _Последние4Квартала
		|ИЗ
		|	(ВЫБРАТЬ
		|		0 КАК Значение
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-1) КАК _Глубины
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ОтчетнаяДата, ГОД, _Глубины.Значение), ДЕНЬ) КАК КонецПериода,
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ОтчетнаяДата, ГОД, _Глубины.Значение), ДЕНЬ) КАК КонецПериодаНачалоДня
		|ПОМЕСТИТЬ _Последние2Года
		|ИЗ
		|	(ВЫБРАТЬ
		|		0 КАК Значение
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-1) КАК _Глубины";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ОтчетнаяДата", ЭтотОбъект.ОтчетнаяДата);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПоместитьСрезКлиентовПоПоследним8КварталамВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Последние8Кварталов.КонецПериодаНачалоДня КАК Период,
		|	КлиентыДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДУ.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентыСрезПоПоследним8Кварталам
		|ИЗ
		|	_Последние8Кварталов КАК _Последние8Кварталов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДУ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_Последние8Кварталов.КонецПериодаНачалоДня КАК Период,
		|				КлиентыДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|				МАКСИМУМ(КлиентыДУ.Период) КАК ДатаИзменения
		|			ИЗ
		|				_Последние8Кварталов КАК _Последние8Кварталов
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДУ
		|					ПО (КлиентыДУ.СчетДоверительногоУправления.Организация = &Организация)
		|						И (КлиентыДУ.Период <= _Последние8Кварталов.КонецПериодаНачалоДня)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_Последние8Кварталов.КонецПериодаНачалоДня,
		|				КлиентыДУ.СчетДоверительногоУправления) КАК ДатыИзменений
		|			ПО (ДатыИзменений.СчетДоверительногоУправления = КлиентыДУ.СчетДоверительногоУправления)
		|				И (ДатыИзменений.ДатаИзменения = КлиентыДУ.Период)
		|		ПО (ДатыИзменений.Период = _Последние8Кварталов.КонецПериодаНачалоДня)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ОтчетнаяДата", ЭтотОбъект.ОтчетнаяДата);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПоместитьВознагражденияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц)
	
	Если ЭтотОбъект.ОтчетнаяДата >= '20200101' Тогда
		
		ТаблицаВознаграждений = РаботаСВнешнимиСистемами.ПолучитьДанныеБухгалтерииОВознагражденииУК("Начисленное", НачалоГода(ДобавитьМесяц(ЭтотОбъект.ОтчетнаяДата, -24)), КонецДня(ЭтотОбъект.ОтчетнаяДата), ЭтотОбъект.Организация);
		
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаВознаграждений, "_ТаблицаВознаграждений", МенеджерВременныхТаблиц);
		
	Иначе
		
		#Область Уплаченное_вознаграждение
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДвиженияДС.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НАЧАЛОПЕРИОДА(ДвиженияДС.Период, ДЕНЬ) КАК Период,
			|	СУММА(ВЫБОР
			|			КОГДА ДвиженияДС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА ДвиженияДС.Сумма
			|			ИНАЧЕ -ДвиженияДС.Сумма
			|		КОНЕЦ) КАК Сумма
			|ПОМЕСТИТЬ ВТ_ВознагражденияУК
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств КАК ДвиженияДС
			|ГДЕ
			|	ДвиженияДС.Организация = &Организация
			|	И ДвиженияДС.ВариантДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
			|	И ДвиженияДС.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	ДвиженияДС.СчетДоверительногоУправления,
			|	НАЧАЛОПЕРИОДА(ДвиженияДС.Период, ДЕНЬ);
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_ВознагражденияУК.Период КАК Период,
			|	ВТ_ВознагражденияУК.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВТ_ВознагражденияУК.Сумма КАК Сумма,
			|	КлиентыДУ.Клиент КАК Клиент
			|ПОМЕСТИТЬ _ТаблицаВознаграждений
			|ИЗ
			|	ВТ_ВознагражденияУК КАК ВТ_ВознагражденияУК
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДУ
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ВТ_ВознагражденияУК.Период КАК Период,
			|				ВТ_ВознагражденияУК.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|				МАКСИМУМ(КлиентыДУ.Период) КАК ДатаИзменения
			|			ИЗ
			|				ВТ_ВознагражденияУК КАК ВТ_ВознагражденияУК
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДУ
			|					ПО (КлиентыДУ.СчетДоверительногоУправления = ВТ_ВознагражденияУК.СчетДоверительногоУправления)
			|						И (КлиентыДУ.Период <= ВТ_ВознагражденияУК.Период)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ВТ_ВознагражденияУК.Период,
			|				ВТ_ВознагражденияУК.СчетДоверительногоУправления) КАК ДатыИзменений
			|			ПО (ДатыИзменений.СчетДоверительногоУправления = КлиентыДУ.СчетДоверительногоУправления)
			|				И (ДатыИзменений.ДатаИзменения = КлиентыДУ.Период)
			|		ПО (КлиентыДУ.СчетДоверительногоУправления = ВТ_ВознагражденияУК.СчетДоверительногоУправления)
			|			И (ДатыИзменений.Период = ВТ_ВознагражденияУК.Период)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоГода(ДобавитьМесяц(ЭтотОбъект.ОтчетнаяДата, -24))); // 8 кварталов
		Запрос.УстановитьПараметр("КонецПериода",	КонецДня(ЭтотОбъект.ОтчетнаяДата));
		
		Запрос.Выполнить();
			
		#КонецОбласти	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьПредставлениеОтбора(ИмяРаздела, Представление = Неопределено)  
	
	Для Каждого ЭлементСтруктуры Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Если ЭлементСтруктуры.Имя = ИмяРаздела Тогда
			
			ИскомыйПараметр			= Новый ПолеКомпоновкиДанных("ПараметрыДанных.Пустышка");
			НайденныйЭлементОтбора	= Неопределено;
			
			ЭлементыОтбора = ?(ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных"), ЭлементСтруктуры.Строки[0].Отбор.Элементы, ЭлементСтруктуры.Отбор.Элементы);  
			Если ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
				Для Каждого ПараметрВывода Из ЭлементСтруктуры.ПараметрыВывода.Элементы Цикл
					Если ПараметрВывода.Параметр = Новый ПараметрКомпоновкиДанных("Заголовок") Тогда
						Если Представление = Неопределено Тогда
							ПараметрВывода.Значение = ПолучитьЗаголовокРазделаПоУмолчанию(ИмяРаздела);
						Иначе
							ПараметрВывода.Значение = ПолучитьЗаголовокРазделаПоУмолчанию(ИмяРаздела) + " (отбор: " + Представление + ")";
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Возврат;
			КонецЕсли;
			
			Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
				Если ЭлементОтбора.ЛевоеЗначение = ИскомыйПараметр Тогда
					НайденныйЭлементОтбора = ЭлементОтбора;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Представление <> Неопределено Тогда
				
				ЭлементОтбора = ?(НайденныйЭлементОтбора = Неопределено, ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")), НайденныйЭлементОтбора);
				ЭлементОтбора.ЛевоеЗначение	= ИскомыйПараметр;
				ЭлементОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Заполнено;
				ЭлементОтбора.Представление = Представление;
				
			ИначеЕсли НайденныйЭлементОтбора <> Неопределено Тогда
				
				ЭлементСтруктуры.Отбор.Элементы.Удалить(НайденныйЭлементОтбора);	
				
			КонецЕсли;	
				
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьЗаголовокРазделаПоУмолчанию(ИмяРаздела)
	
	Для Каждого ЭлементСтруктуры Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Структура Цикл	
	
		Для Каждого ПараметрВывода Из ЭлементСтруктуры.ПараметрыВывода.Элементы Цикл
			Если ПараметрВывода.Параметр = Новый ПараметрКомпоновкиДанных("Заголовок") Тогда
				Возврат ПараметрВывода.Значение;
			КонецЕсли;
		КонецЦикла;

	КонецЦикла;
	
	Возврат "";	
	
КонецФункции

Функция ПолучитьСЧАИзМакета(ИменаМакетов)
	
	ФинансовыеПоказатели = Новый ТаблицаЗначений;
	ФинансовыеПоказатели.Колонки.Добавить("Период", Метаданные.РегистрыСведений.ФинансовыеПоказатели.СтандартныеРеквизиты.Период.Тип);
	ФинансовыеПоказатели.Колонки.Добавить("Организация", Метаданные.РегистрыСведений.ФинансовыеПоказатели.Измерения.Организация.Тип);
	ФинансовыеПоказатели.Колонки.Добавить("СубъектАналитики", Метаданные.РегистрыСведений.ФинансовыеПоказатели.Измерения.СубъектАналитики.Тип);
	ФинансовыеПоказатели.Колонки.Добавить("ВидПоказателя", Метаданные.РегистрыСведений.ФинансовыеПоказатели.Измерения.ВидПоказателя.Тип);
	ФинансовыеПоказатели.Колонки.Добавить("Значение", Метаданные.РегистрыСведений.ФинансовыеПоказатели.Ресурсы.Значение.Тип);
	
	Ошибки = Новый Массив;
	ПроверятьДанныеНаДубли = Ложь;
	
	СтруктураИмен = Новый Структура(ИменаМакетов);
	Для Каждого Макет Из СтруктураИмен Цикл  	
	
		ДанныеМакета = ПолучитьМакет(Макет.Ключ);

		СериализованныеДанные = Новый ТаблицаЗначений;
		СериализованныеДанные.Колонки.Добавить("Период",     Новый ОписаниеТипов("Дата"));
		СериализованныеДанные.Колонки.Добавить("КодСчетаДУ", Метаданные.Справочники.СчетаДоверительногоУправления.Реквизиты.КодСчета.Тип);
		СериализованныеДанные.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		СериализованныеДанные.Колонки.Добавить("Сумма",      Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);

		Для НомСтр = 1 По ДанныеМакета.ВысотаТаблицы Цикл
			СуммаМакет	= СтрЗаменить(ДанныеМакета.Область(НомСтр, 4).Текст, " ", "");
			ДатаМакет	= ДанныеМакета.Область(НомСтр, 5).Текст;	
			
			Если Не ЗначениеЗаполнено(СуммаМакет)
				ИЛИ Не ЗначениеЗаполнено(ДатаМакет)
			Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаМакет = Число(СуммаМакет);
			Если СуммаМакет = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			СтрокаСериализованныеДанные = СериализованныеДанные.Добавить();
			СтрокаСериализованныеДанные.Период     = Дата(Лев(ДатаМакет, 6) + "20" + Сред(ДатаМакет, "7") + " 00:00:00"); //РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ДанныеМакета.Область(НомСтр, 5).Текст);
			СтрокаСериализованныеДанные.КодСчетаДУ = ДанныеМакета.Область(НомСтр, 2).Текст;
			СтрокаСериализованныеДанные.Сумма      = СуммаМакет;
		КонецЦикла;

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СериализованныеДанные.Период КАК Период,
			|	СериализованныеДанные.КодСчетаДУ КАК КодСчетаДУ,
			|	СериализованныеДанные.Количество КАК Количество,
			|	СериализованныеДанные.Сумма КАК Сумма
			|ПОМЕСТИТЬ _СериализованныеДанные
			|ИЗ
			|	&СериализованныеДанные КАК СериализованныеДанные
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.Организация КАК Организация,
			|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК ПИФ,
			|	_СериализованныеДанные.Период КАК Период,
			|	_СериализованныеДанные.Сумма КАК Сумма,
			|	_СериализованныеДанные.КодСчетаДУ КАК КодСчетаДУ,
			|	ФинансовыеПоказатели.Значение КАК ЗарегистрированноеСЧА
			|ИЗ
			|	_СериализованныеДанные КАК _СериализованныеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ПО СчетаДоверительногоУправления.Организация = &Организация
			|			И _СериализованныеДанные.КодСчетаДУ = СчетаДоверительногоУправления.КодСчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(, ) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ПО (СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|		ПО ФинансовыеПоказатели.Организация = СчетаДоверительногоУправления.Организация
			|			И ФинансовыеПоказатели.СубъектАналитики = СчетаДоверительногоУправления.Ссылка
			|			И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок) 
			|			И ФинансовыеПоказатели.Период = _СериализованныеДанные.Период
			|ГДЕ
			|	ФинансовыеПоказатели.Период ЕСТЬ NULL";

		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СериализованныеДанные", СериализованныеДанные);
			
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.СчетДоверительногоУправления = NULL Тогда
				//Если ЗначениеЗаполнено(Выборка.КодСчетаДУ) Тогда
				//	ВывестиОшибку("Не найден клиент с кодом '" + Выборка.КодСчетаДУ + "'", Ошибки);
				//КонецЕсли;
				
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Выборка.Сумма) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПроверятьДанныеНаДубли И ФинансовыеПоказатели.НайтиСтроки(Новый Структура("СубъектАналитики, Период", Выборка.СчетДоверительногоУправления, Выборка.Период)).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Запись = ФинансовыеПоказатели.Добавить();
			Запись.Период           = Выборка.Период;
			Запись.Организация      = Выборка.Организация;
			Запись.СубъектАналитики = Выборка.СчетДоверительногоУправления;
			Запись.ВидПоказателя    = Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок;
			Запись.Значение         = Выборка.Сумма;

		КонецЦикла;

		Если СтруктураИмен.Количество() > 1 И ПроверятьДанныеНаДубли = Ложь Тогда
			ФинансовыеПоказатели.Индексы.Добавить("СубъектАналитики, Период");
			ПроверятьДанныеНаДубли = Истина;
		КонецЕсли;

	КонецЦикла;
	
	Возврат ФинансовыеПоказатели; 	
	
КонецФункции

Процедура ВывестиОшибку(ТекстОшибки, Ошибки)
	Если Ошибки.Найти(ТекстОшибки) = Неопределено Тогда
		Сообщить(ТекстОшибки);
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти