
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяОбъектаКИД = "_КонтрольИнвестиционныхДеклараций";
	
	Если Запись.Источник = ИмяОбъектаКИД Тогда
	
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ХранилищеЗначений.Идентификатор КАК Идентификатор
			|ИЗ
			|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
			|ГДЕ
			|	ХранилищеЗначений.Идентификатор = &Идентификатор
			|	И ХранилищеЗначений.Источник = &ИмяОбъектаКИД";
			
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Идентификатор", Параметры.Ключ.Идентификатор);
		Запрос.УстановитьПараметр("ИмяОбъектаКИД", ИмяОбъектаКИД);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ВнешняяОбработкаКИД = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта(ИмяОбъектаКИД);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяОбъектаКИД = "_КонтрольИнвестиционныхДеклараций";
	
	Если Запись.Источник = ИмяОбъектаКИД Тогда
	
		Отказ = Истина;
		
		ПолноеИмяОбъекта = "ВнешняяОбработка." + ИмяОбъектаКИД;
		ТекущаяВерсияОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнешняяОбработкаКИД, "Версия");
	
		Для Каждого ТекущееОкно Из ПолучитьОкна() Цикл
			Для Каждого Форма Из ТекущееОкно.Содержимое Цикл
				Если ТипЗнч(Форма) <> Тип("УправляемаяФорма") Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрНачинаетсяС(Форма.ИмяФормы, ПолноеИмяОбъекта) Тогда
					РеквизитыФормы = Новый Структура("ВерсияДополнительногоОтчетаИлиОбработки");
					ЗаполнитьЗначенияСвойств(РеквизитыФормы, Форма);
					
					Если ЗначениеЗаполнено(РеквизитыФормы.ВерсияДополнительногоОтчетаИлиОбработки) Тогда
						Если РеквизитыФормы.ВерсияДополнительногоОтчетаИлиОбработки <> ТекущаяВерсияОбъекта Тогда
							ТекущееОкно.Активизировать();
							ПоказатьПредупреждение(, "Версия отчёта изменилась, для повторного запуска закройте все формы отчёта");
							Возврат;
						КонецЕсли;
					Иначе	
						ТекущееОкно.Активизировать();
						ПоказатьПредупреждение(, "Форма отчёта уже открыта, для повторного запуска закройте форму");
						Возврат;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ВнешняяОбработкаКИД);
		
		ОткрытьФорму("ВнешняяОбработка." + ИмяПодключенногоОбъекта + ".Форма", Новый Структура("ИдентификаторРезультата", Запись.Идентификатор));
	
	КонецЕсли; 
	
КонецПроцедуры

 