
////////////////////////////////////////////////////////////////////////////////
// ОСНОВНОЙ ФУНКЦИОНАЛ

&НаСервере
Процедура ИсключитьЧастныеПоляДанныхВнешнейСистемы()
	
	ПредопределенныеКолонки = Новый Массив();
	ПредопределенныеКолонки.Добавить("ДанныеВнешнейСистемыОбъект");
	ПредопределенныеКолонки.Добавить("ДанныеВнешнейСистемыФлажок");
	ПредопределенныеКолонки.Добавить("ДанныеВнешнейСистемыПредставление");
	ПредопределенныеКолонки.Добавить("ДанныеВнешнейСистемыИдентификатор");
	
	РеквизитыДляУдаления = Новый Массив();
	
	Для Инд = 1 - Элементы.ДанныеВнешнейСистемы.ПодчиненныеЭлементы.Количество() По 0 Цикл
		ПодчиненныйЭлемент = Элементы.ДанныеВнешнейСистемы.ПодчиненныеЭлементы[-Инд];
		
		Если ПредопределенныеКолонки.Найти(ПодчиненныйЭлемент.Имя) = Неопределено Тогда
			Элементы.Удалить(ПодчиненныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты("ДанныеВнешнейСистемы") Цикл
		Если ПредопределенныеКолонки.Найти("ДанныеВнешнейСистемы" + РеквизитФормы.Имя) = Неопределено Тогда
			РеквизитыДляУдаления.Добавить("ДанныеВнешнейСистемы." + РеквизитФормы.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(, РеквизитыДляУдаления);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьЧастныеПоляДанныхВнешнейСистемы(ВнешниеДанные)
	
	ДанныеВнешнейСистемыНаСервере = РеквизитФормыВЗначение("ДанныеВнешнейСистемы");
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для Каждого Колонка Из ВнешниеДанные.Колонки Цикл
        Если ДанныеВнешнейСистемыНаСервере.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
            ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ДанныеВнешнейСистемы"));
        КонецЕсли;
	КонецЦикла;
	
	// отобразим недостающие колонки на форме
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого ДобавляемыйРеквизит Из ДобавляемыеРеквизиты Цикл
		ПолеФормы = Элементы.Добавить("ДанныеВнешнейСистемы" + ДобавляемыйРеквизит.Имя, Тип("ПолеФормы"), Элементы.ДанныеВнешнейСистемы);
		ПолеФормы.Вид            = ВидПоляФормы.ПолеВвода; 
		ПолеФормы.ПутьКДанным    = "ДанныеВнешнейСистемы." + ДобавляемыйРеквизит.Имя;
		ПолеФормы.ТолькоПросмотр = Истина;
	КонецЦикла;
	
	// переместим поле "Идентификатор" в конец списка
	Элементы.Переместить(Элементы.ДанныеВнешнейСистемыИдентификатор, Элементы.ДанныеВнешнейСистемыИдентификатор.Родитель);

КонецПроцедуры // ОтобразитьЧастныеПоляДанныхВнешнейСистемы

&НаСервере
Процедура ПолучитьДанныеДляВыбораНаСервере()
	
	ЭтаФорма.ДанныеВнешнейСистемы.Очистить();
	
	// удалим колонки таблицы и соответствующие им реквизиты формы, за исключением предопределенных
	ИсключитьЧастныеПоляДанныхВнешнейСистемы();
	
	// получим новый набор данных
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ВнешниеДанные = ОбработкаОбъект.ПолучитьДанныеДляВыбора(?(ЭтаФорма.РежимОтображения = 0, ЭтаФорма.СтрокаПоиска, ""));
	
	Если ВнешниеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// дополним поле таблицы значений отсутствующими колонками и заполним выбранными данными
	ОтобразитьЧастныеПоляДанныхВнешнейСистемы(ВнешниеДанные);
	
	// передадим данные на форму
	ЭтаФорма.ДанныеВнешнейСистемы.Загрузить(ВнешниеДанные);
	
КонецПроцедуры // ПолучитьДляВыбора

&НаСервере
Процедура ЗаполнитьГруппыОбъектовНаСервере()

	Элементы.ГруппаОбъектов.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("Объект");
	
	Для каждого ГруппаИмпортируемыхОбъектов Из ОбработкаОбъект.ПолучитьГруппыИмпортируемыхОбъектов(Объект.ГруппаПравил) Цикл
		Элементы.ГруппаОбъектов.СписокВыбора.Добавить(ГруппаИмпортируемыхОбъектов.Значение, ГруппаИмпортируемыхОбъектов.Представление);
	КонецЦикла;
	
	Если Элементы.ГруппаОбъектов.СписокВыбора.Количество() > 0 Тогда
		Объект.ГруппаОбъектов = Элементы.ГруппаОбъектов.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПоляДляПоискаПоСтрокеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтаФорма.ПоляДляПоискаПоСтроке = ОбработкаОбъект.ПолучитьПоляДляПоискаПоСтроке(, Объект.ГруппаПравил, Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьИмяПредопределенного(Объект.ГруппаОбъектов));
	
КонецПроцедуры // ПолучитьПоляДляПоискаПоСтрокеНаСервере

&НаСервере
Функция ИмпортироватьДанныеНаСервере(ТипыДанныхДляОповещения)
	
	// перенесем выбранные объекты в таблицу для импорта
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("Объект");
		
	СтрокиДанныеВнешнейСистемы = ЭтаФорма.ДанныеВнешнейСистемы.НайтиСтроки(Новый Структура("Флажок", Истина));
	
	Для каждого СтрокаДанныеВнешнейСистемы Из СтрокиДанныеВнешнейСистемы Цикл
		СтрокаИмпортируемыеОбъекты = ОбработкаОбъект.ИмпортируемыеОбъекты.Добавить();
		СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = СтрокаДанныеВнешнейСистемы.Идентификатор;
		СтрокаИмпортируемыеОбъекты.Объект              = СтрокаДанныеВнешнейСистемы.Объект;
	КонецЦикла;
	
	// импорт выбранных объектов
	Возврат ОбработкаОбъект.ИмпортироватьДанные(ТипыДанныхДляОповещения);
	
КонецФункции // ИмпортироватьДанныеНаСервере


&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	Элементы.ДанныеВнешнейСистемыОбъект.Видимость = Не Объект.СкрыватьРанееЗагруженныеДанные;
	
	Элементы.СтрокаПоиска.Доступность               = (ЭтаФорма.РежимОтображения = 0);
	Элементы.СтрокаПоиска.АвтоОтметкаНезаполненного = (ЭтаФорма.РежимОтображения = 0);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// значения по умолчанию
	Объект.СкрыватьРанееЗагруженныеДанные = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Объект.Подразделение = Справочники.Подразделения.ГруппаКомпаний;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Язык) Тогда
		Объект.Язык = Справочники.Языки.Русский;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ЗакрытьФормуПослеУспешногоИмпорта") Тогда
		ЭтаФорма.ЗакрытьФормуПослеУспешногоИмпорта = ЭтаФорма.Параметры.ЗакрытьФормуПослеУспешногоИмпорта;
	Иначе
		ЭтаФорма.ЗакрытьФормуПослеУспешногоИмпорта = Ложь;
	КонецЕсли;

	// группы правил
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("Объект");
	
	Элементы.ГруппаПравил.СписокВыбора.ЗагрузитьЗначения(ОбработкаОбъект.ПолучитьГруппыПравил());
	
	Если Элементы.ГруппаПравил.СписокВыбора.Количество() > 0 Тогда
		Если ЭтаФорма.Параметры.Свойство("ГруппаПравил") И Элементы.ГруппаПравил.СписокВыбора.НайтиПоЗначению(ЭтаФорма.Параметры.ГруппаПравил) <> Неопределено Тогда
			Объект.ГруппаПравил = ЭтаФорма.Параметры.ГруппаПравил;
		Иначе
			Объект.ГруппаПравил = Элементы.ГруппаПравил.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	// группа объектов
	ЗаполнитьГруппыОбъектовНаСервере();
	
	Если ЭтаФорма.Параметры.Свойство("ГруппаОбъектов") И Элементы.ГруппаОбъектов.СписокВыбора.НайтиПоЗначению(ЭтаФорма.Параметры.ГруппаОбъектов) <> Неопределено Тогда
		Объект.ГруппаОбъектов = ЭтаФорма.Параметры.ГруппаОбъектов;
	КонецЕсли;
	
	ЭтаФорма.Параметры.Свойство("ОбновитьПриОткрытии", ЭтаФорма.ОбновитьПриОткрытии);
	
КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказатьСкрытьГруппуНастроекВыбора(Неопределено);
	
	ГруппаОбъектовПриИзменении(Неопределено);
	
	Если ЭтаФорма.ОбновитьПриОткрытии Тогда
		ОбновитьДанные(Неопределено);
	КонецЕсли; 
	
КонецПроцедуры // ПриОткрытии

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ГруппаПравилПриИзменении(Элемент)
	
	ЗаполнитьГруппыОбъектовНаСервере();
	
	ГруппаОбъектовПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбъектовПриИзменении(Элемент)
	
	// сбросим таблицу внешних данных к исоходному состоянию
	ЭтаФорма.ДанныеВнешнейСистемы.Очистить();
	
	ИсключитьЧастныеПоляДанныхВнешнейСистемы();
	
	// обновим зависимые данные
	ПолучитьПоляДляПоискаПоСтрокеНаСервере();
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьРанееЗагруженныеДанныеПриИзменении(Элемент)
	
	ПолучитьДанныеДляВыбораНаСервере();
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияПриИзменении(Элемент)
	
	Элементы.СтрокаПоиска.Доступность               = (ЭтаФорма.РежимОтображения = 0);
	Элементы.СтрокаПоиска.АвтоОтметкаНезаполненного = (ЭтаФорма.РежимОтображения = 0);
	
	Если ЭтаФорма.РежимОтображения = 1 Или Не ПустаяСтрока(ЭтаФорма.СтрокаПоиска) Тогда
		ПолучитьДанныеДляВыбораНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭтаФорма.СтрокаПоиска = Текст;
	
	Если Не ПустаяСтрока(ЭтаФорма.СтрокаПоиска) Тогда
		ПолучитьДанныеДляВыбораНаСервере();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура ПоказатьСкрытьГруппуНастроекВыбора(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ПоказатьСкрытьГруппуНастроекВыбора");
	Попытка
		ВыполнитьПоказатьСкрытьГруппуНастроекВыбора(Команда);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоказатьСкрытьГруппуНастроекВыбора(Команда)
	
	Если Команда <> Неопределено Тогда
		ЭтаФорма.ОтображатьНастройки = Не ЭтаФорма.ОтображатьНастройки;
	КонецЕсли;
	
	Элементы.ФормаПоказатьСкрытьГруппуНастроек.Пометка = ЭтаФорма.ОтображатьНастройки;
	
	Элементы.ГруппаНастройкаВыбора.Видимость = ЭтаФорма.ОтображатьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьВыбранные(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ИмпортироватьВыбранные");
	Попытка
		ВыполнитьИмпортироватьВыбранные();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортироватьВыбранные()
	Перем ТипыДанныхДляОповещения;
	
	ОбработанныеОбъекты = ИмпортироватьДанныеНаСервере(ТипыДанныхДляОповещения);
	
	Если (ТипЗнч(ТипыДанныхДляОповещения) = Тип("Массив") И ТипыДанныхДляОповещения.Количество() > 0) Тогда
		Для каждого ТипДанныхДляОповещения Из ТипыДанныхДляОповещения Цикл
			ОповеститьОбИзменении(ТипДанныхДляОповещения);
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтаФорма.ЗакрытьФормуПослеУспешногоИмпорта Тогда
		Если (ТипЗнч(ТипыДанныхДляОповещения) = Тип("Массив") И ТипыДанныхДляОповещения.Количество() > 0) Тогда
			ЭтаФорма.Закрыть(ОбработанныеОбъекты);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПолучитьДанныеДляВыбораНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ОбновитьДанные");
	Попытка
		ПолучитьДанныеДляВыбораНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПакетноеОбновлениеИзМатрих(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПакетноеОбновлениеИзМатрих");
	Попытка
		ОткрытьФорму("Обработка.ИмпортНормативноСправочнойИнформации.Форма.ПакетноеОбновлениеИзМатрих");
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
