
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Период		= ТекущаяДата();
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПередатьДанные(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПередатьДанные");
	Попытка
		ПередатьДанныеНаСервере(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредварительныйПросмотр(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПредварительныйПросмотр");
	Попытка
		ПредварительныйПросмотрНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПередатьДанныеНаСервере(ПараметрыСессии)
	
	МестоположенияWSDL = Новый Массив;
	
	Если ЭтаФорма.ПередатьДанныеВСервисCRMDev Тогда
		МестоположенияWSDL.Добавить("http://ap48/CRM_dev/ws/DU.1cws?wsdl");
	КонецЕсли;
	
	Если ЭтаФорма.ПередатьДанныеВСервисCRMWork Тогда
		МестоположенияWSDL.Добавить("http://ap48/CRM_work/ws/DU.1cws?wsdl");
	КонецЕсли;
	
	Если МестоположенияWSDL.Количество() = 0 Тогда
		ТекстОшибки = "Не выбраны web-сервисы для передачи данных";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ПакетДанных1С = ОбъектНаСервере.ПолучитьПакетДанных1С();
	
	Для Инд = 0 По МестоположенияWSDL.Количество() - 1 Цикл
		ОбъектНаСервере.МестоположениеWSDL = МестоположенияWSDL[Инд];
		
		Ответ = ОбъектНаСервере.ПередатьДанныхВCRM(ПакетДанных1С);
		Если Ответ = "1" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Передача данных в сервис '" + ОбъектНаСервере.МестоположениеWSDL + "' завершена");
		КонецЕсли;
	КонецЦикла;
		
	ОтобразитьПакетПереданныхДанныхНаСервере(ПакетДанных1С);
	
КонецПроцедуры

&НаСервере
Процедура ПредварительныйПросмотрНаСервере()
	
	ОтобразитьПакетПереданныхДанныхНаСервере(РеквизитФормыВЗначение("Объект").ПолучитьПакетДанных1С());
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПакетПереданныхДанныхНаСервере(ПакетДанных)
	
	ЭтаФорма.РасшифровкаПакетаДанных.Очистить();
	
	МакетДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("РасшифровкаПакетаДанных");
	
	// отобразим заголовок пакета
	Область = МакетДанных.ПолучитьОбласть("ЗаголовокПакета");
	Область.Параметры.Период       = Объект.Период;
	Область.Параметры.Организация  = Объект.Организация;
	Область.Параметры.ДатаПередачи = ТекущаяДата();
	
	ЭтаФорма.РасшифровкаПакетаДанных.Вывести(Область);
		
	// отобразим таблицы пакета
	ОбластьЗаголовокТаблицы = МакетДанных.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьПустаяКолонка = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|Пустая");
	ОбластьШапкаТаблицы = МакетДанных.ПолучитьОбласть("ШапкаТаблицы|Колонка");
	ОбластьСтрокаТаблицы = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|Колонка");
	
	ОтображаемыеТаблицыПакета = Новый Соответствие;
	ОтображаемыеТаблицыПакета.Вставить(1, "Анкетные данные");
	ОтображаемыеТаблицыПакета.Вставить(2, "Вводы денежных средств");
	ОтображаемыеТаблицыПакета.Вставить(3, "Расчетные счета");
	
	Для каждого Элемент Из ОтображаемыеТаблицыПакета Цикл
		ОбластьЗаголовокТаблицы.Параметры.Текст = Элемент.Значение;
		ЭтаФорма.РасшифровкаПакетаДанных.Вывести(ОбластьЗаголовокТаблицы);
		ЭтаФорма.РасшифровкаПакетаДанных.НачатьГруппуСтрок();
		
		ТаблицаПакета = ПакетДанных[Элемент.Ключ].Выгрузить();
		
		// шапка таблицы
		ЭтаФорма.РасшифровкаПакетаДанных.Вывести(ОбластьПустаяКолонка);
		
		Для каждого Колонка Из ТаблицаПакета.Колонки Цикл
			ОбластьШапкаТаблицы.Параметры.Текст = Колонка.Имя;
			ЭтаФорма.РасшифровкаПакетаДанных.Присоединить(ОбластьШапкаТаблицы);
		КонецЦикла;
		
		// строки таблицы
		Для каждого СтрокаТаблицаПакета Из ТаблицаПакета Цикл
			ЭтаФорма.РасшифровкаПакетаДанных.Вывести(ОбластьПустаяКолонка);
			
			Для каждого Колонка Из ТаблицаПакета.Колонки Цикл
				ОбластьСтрокаТаблицы.Параметры.Текст = СтрокаТаблицаПакета[Колонка.Имя];
				ЭтаФорма.РасшифровкаПакетаДанных.Присоединить(ОбластьСтрокаТаблицы);
			КонецЦикла;
		КонецЦикла;
		
		ЭтаФорма.РасшифровкаПакетаДанных.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
