&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	Отказ = Ложь;
	
	СтруктураОтбор = Новый Структура();
	СтруктураОтбор.Вставить("Организация", ЭтаФорма.Организация);
	Если ЗначениеЗаполнено(ЭтаФорма.ВидУчета) Тогда 
		СтруктураОтбор.Вставить("ВидУчета",ЭтаФорма.ВидУчета);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан вид учета",,,,Отказ);
	КонецЕсли;	
	СтруктураОтбор.Вставить("Дата",ЭтаФорма.Дата);
	СтруктураОтбор.Вставить("СчетДоверительногоУправления",ЭтаФорма.СчетДоверительногоУправления);
	Если ЗначениеЗаполнено(ЭтаФорма.ЦеннаяБумага) Тогда 
		СтруктураОтбор.Вставить("ЦеннаяБумага",ЭтаФорма.ЦеннаяБумага);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана ценная бумага",,,,Отказ);
	КонецЕсли;	
	Если (ЭтаФорма.Сумма + ЭтаФорма.СуммаКупона) > 0 Тогда 
		СтруктураОтбор.Вставить("Сумма",ЭтаФорма.Сумма);
		СтруктураОтбор.Вставить("СуммаКупона",ЭтаФорма.СуммаКупона);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана сумма для распределения",,,,Отказ);		
	КонецЕсли;	
	
	Если НЕ Отказ Тогда 
		ЭтаФорма.Закрыть(СтруктураОтбор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ЭтаФорма.Параметры.Организация;
	ЭтаФорма.Дата = ЭтаФорма.Параметры.Дата;
	ЭтаФорма.СчетДоверительногоУправления = ЭтаФорма.Параметры.СчетДоверительногоУправления;
	
КонецПроцедуры
