
Функция ПолучитьСтавкуВознагражденияУправляющегоПлатуЗаРазмещение(Период = Неопределено, СчетДоверительногоУправления) Экспорт

	СтавкаВознагражденияУправляющегоПлатаЗаРазмещение = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.СтавкаВознагражденияУправляющегоПлатаЗаРазмещение КАК СтавкаВознагражденияУправляющегоПлатаЗаРазмещение
		|ИЗ
		|	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних";
	
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтавкаВознагражденияУправляющегоПлатаЗаРазмещение = Выборка.СтавкаВознагражденияУправляющегоПлатаЗаРазмещение;
	КонецЕсли;
	
	Возврат СтавкаВознагражденияУправляющегоПлатаЗаРазмещение;

КонецФункции // ПолучитьСтавкуВознагражденияУправляющегоПлатуЗаРазмещение

Функция ПолучитьВидыДоговоровИспользующиеСтратегии(Организация) Экспорт
	
	МассивВидовДоговоров = Новый Массив;
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет);
	
	Если ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "ПрочиеНастройки.ВедетсяУчетСтандартныхСтратегийПоДоговорамФЛ", Организация) = Истина Тогда
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица)
	КонецЕсли;
	
	Возврат МассивВидовДоговоров;
	
КонецФункции