
Функция ПолучитьТаблицуПроверкиДатЗапретаРедактирования(НаборЗаписей) Экспорт
	
	// Если меняется рыночная стоимость, значит должен быть открыт бэк-офис,
	// а если балансовая - партии 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КолонкиНабора				= "Период, Организация, СчетДоверительногоУправления, НаправлениеДвижения, ВидАктива, ВидОперацииВводаВыводаДС, БалансоваяСтоимость, РыночнаяСтоимость, Активность";
	ПредыдущийНаборЗаписей		= ?(НаборЗаписей.ДополнительныеСвойства.Свойство("НаборЗаписейПередЗаписью"), НаборЗаписей.ДополнительныеСвойства.НаборЗаписейПередЗаписью, Неопределено); 
	ТаблицаНабораЗаписей		= НаборЗаписей.Выгрузить(, КолонкиНабора);
	ТаблицаПредыдущегоНабора	= ?(ПредыдущийНаборЗаписей = Неопределено, ТаблицаНабораЗаписей.СкопироватьКолонки(), ПредыдущийНаборЗаписей.Скопировать(, КолонкиНабора));
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаНабораЗаписей, "_НаборЗаписей", Запрос.МенеджерВременныхТаблиц);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаПредыдущегоНабора, "_ПредыдущийНаборЗаписей", Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(_НаборЗаписей.Период, _ПредыдущийНаборЗаписей.Период), ДЕНЬ) КАК Период,
		|	ЕСТЬNULL(_НаборЗаписей.Организация, _ПредыдущийНаборЗаписей.Организация) КАК Организация,
		|	ЕСТЬNULL(_НаборЗаписей.СчетДоверительногоУправления, _ПредыдущийНаборЗаписей.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_НаборЗаписей.РыночнаяСтоимость <> _ПредыдущийНаборЗаписей.РыночнаяСтоимость, ИСТИНА) КАК РасхождениеРыночнойСтоимости,
		|	ЕСТЬNULL(_НаборЗаписей.БалансоваяСтоимость <> _ПредыдущийНаборЗаписей.БалансоваяСтоимость, ИСТИНА) КАК РасхождениеБалансовойСтоимости
		|ПОМЕСТИТЬ _Расхождения
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ПредыдущийНаборЗаписей КАК _ПредыдущийНаборЗаписей
		|		ПО _НаборЗаписей.Период = _ПредыдущийНаборЗаписей.Период
		|			И _НаборЗаписей.Организация = _ПредыдущийНаборЗаписей.Организация
		|			И _НаборЗаписей.СчетДоверительногоУправления = _ПредыдущийНаборЗаписей.СчетДоверительногоУправления
		|			И _НаборЗаписей.НаправлениеДвижения = _ПредыдущийНаборЗаписей.НаправлениеДвижения
		|			И _НаборЗаписей.ВидАктива = _ПредыдущийНаборЗаписей.ВидАктива
		|			И _НаборЗаписей.ВидОперацииВводаВыводаДС = _ПредыдущийНаборЗаписей.ВидОперацииВводаВыводаДС
		|			И _НаборЗаписей.Активность = _ПредыдущийНаборЗаписей.Активность
		|ГДЕ
		|	(ЕСТЬNULL(_НаборЗаписей.РыночнаяСтоимость <> _ПредыдущийНаборЗаписей.РыночнаяСтоимость, ИСТИНА)
		|			ИЛИ ЕСТЬNULL(_НаборЗаписей.БалансоваяСтоимость <> _ПредыдущийНаборЗаписей.БалансоваяСтоимость, ИСТИНА))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Расхождения.Период КАК Период,
		|	_Расхождения.Организация КАК Организация,
		|	_Расхождения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис) КАК ГруппаЗапрета,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ПустаяСсылка) КАК ВидУчета
		|ИЗ
		|	_Расхождения КАК _Расхождения
		|ГДЕ
		|	_Расхождения.РасхождениеРыночнойСтоимости
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Расхождения.Период,
		|	_Расхождения.Организация,
		|	_Расхождения.СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|ИЗ
		|	_Расхождения КАК _Расхождения
		|ГДЕ
		|	_Расхождения.РасхождениеБалансовойСтоимости";		
	
	ТаблицаПроверкиЗапретаРедактирования = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаПроверкиЗапретаРедактирования;
	
КонецФункции