
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;

	ТипЗначенияСделки = ТипЗнч(ЭтотОбъект.Сделка);
	Если ТипЗначенияСделки = Тип("ДокументСсылка.Сделка") ИЛИ ТипЗначенияСделки = Тип("ДокументСсылка.СделкаРЕПО") Тогда
						
		ЗначенияРеквизитаРынок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Сделка, "Рынок");
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЗначенияРеквизитаРынок);
		
		ЦенныеБумаги = ПолучитьЦенныеБумагиСделки();
		ЭлементБлокировкиДанных.ИсточникДанных = ЦенныеБумаги;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ДепозитарныйСчет", "ДепозитарныйСчет");
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ЦеннаяБумага",     "ЦеннаяБумага");
		
	ИначеЕсли ТипЗначенияСделки = Тип("ДокументСсылка.СделкаСВалютой") Тогда
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
		
		ЗначенияРеквизитовСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Сделка, "Брокер, МестоХранения, РасчетныйСчет, РасчетныйСчетКонтрвалюты, ВидСделки");
				
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("Брокер",                       	ЗначенияРеквизитовСделки.Брокер);
		ЭлементБлокировкиДанных.УстановитьЗначение("МестоХранения",                 ЗначенияРеквизитовСделки.МестоХранения);
		
		Если      ЗначенияРеквизитовСделки.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет", ЗначенияРеквизитовСделки.РасчетныйСчетКонтрвалюты);
		ИначеЕсли ЗначенияРеквизитовСделки.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет", ЗначенияРеквизитовСделки.РасчетныйСчет);
		КонецЕсли;
		
	КонецЕсли;

	Если БлокировкаДанных.Количество() <> 0 Тогда
		БлокировкаДанных.Заблокировать();	
	КонецЕсли; 
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	ТипЗначенияСделки = ТипЗнч(ЭтотОбъект.Сделка);
	Если ТипЗначенияСделки = Тип("ДокументСсылка.Сделка") Тогда 
		
		Движения.ОстаткиЦенныхБумаг.Записывать               = Истина;
		Движения.ОстаткиДенежныхСредств.Записывать           = Истина;
		Движения.ЗадолженностиПоЦеннымБумагам.Записывать     = Истина;
		Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
		Движения.ОперацииСЦеннымиБумагами.Записывать         = Истина;
		Движения.УсловияСделок.Записывать                    = Истина;
		Движения.РасходыПоСделке.Записывать                  = Истина;
		
	ИначеЕсли ТипЗначенияСделки = Тип("ДокументСсылка.СделкаРЕПО") Тогда 	
		
		Движения.ОстаткиЦенныхБумаг.Записывать               = Истина;
		Движения.ОстаткиДенежныхСредств.Записывать           = Истина;
		Движения.ЗадолженностиПоВторойЧастиРЕПО.Записывать   = Истина;
		Движения.ЗадолженностиПоЦеннымБумагам.Записывать     = Истина;
		Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
		Движения.УсловияСделокРЕПО.Записывать                = Истина;
		Движения.ОперацииСЦеннымиБумагами.Записывать         = Истина;
		Движения.РасходыПоСделке.Записывать                  = Истина;
		
	Иначе
		
		Движения.ОстаткиДенежныхСредств.Записывать           = Истина;
		Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
		Движения.РасходыПоСделке.Записывать                  = Истина;
	
	КонецЕсли;
	
	Если ТипЗначенияСделки = Тип("ДокументСсылка.Сделка") Тогда
		Движения.УсловияСделок.Записать();
	ИначеЕсли ТипЗначенияСделки = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Движения.УсловияСделокРЕПО.Записать();
	КонецЕсли;

	СформироватьДвиженияНакопленияДляСторнирования(ТипЗначенияСделки);
	
	СформироватьНачислениеЗадолженностиПоОтступным(ТипЗначенияСделки);
	
	Если ТипЗначенияСделки <> Тип("ДокументСсылка.СделкаСВалютой") Тогда
		СформироватьЗаписиРегистровСведенийДляСторнирования(ТипЗначенияСделки);
	КонецЕсли;	
	         	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	СформироватьДвиженияРегистраБухгалтерииДляСторнирования(УчетныйРегистр);
	
КонецПроцедуры
 
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	СформироватьДвиженияРегистраБухгалтерииДляСторнирования(УчетныйРегистр);
			
КонецПроцедуры

Функция ПолучитьЦенныеБумагиСделки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка,
		|	СделкаЦенныеБумаги.ДепозитарныйСчет,
		|	СделкаЦенныеБумаги.ЦеннаяБумага
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Сделка";
	
	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.Сделка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьЦенныеБумагиСделки

Процедура СформироватьДвиженияНакопленияДляСторнирования(ТипЗначенияСделки)

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоДвижениямНакопления(Запрос, ТипЗначенияСделки);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		ЗаписиРегистра = СтрокаРезультата.Выгрузить();
		Если ЗаписиРегистра.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРегистра = ЗаписиРегистра[0].ИмяРегистра;
						
		Для Каждого СтрокаРегистра Из ЗаписиРегистра Цикл
			НоваяЗапись = Движения[ИмяРегистра].Добавить();			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаРегистра);
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвиженияНакопленияДляСторнирования

Процедура СформироватьЗаписиРегистровСведенийДляСторнирования(ТипЗначенияСделки)

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоРегистрамСведений(Запрос, ТипЗначенияСделки);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		ЗаписиРегистра = СтрокаРезультата.Выгрузить();
		Если ЗаписиРегистра.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРегистра = ЗаписиРегистра[0].ИмяРегистра;
						
		Для Каждого СтрокаРегистра Из ЗаписиРегистра Цикл
			НоваяЗапись = Движения[ИмяРегистра].Добавить();			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаРегистра);
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗаписиРегистровСведенийДляСторнирования

Процедура СформироватьДвиженияРегистраБухгалтерииДляСторнирования(УчетныйРегистр)
	
	ДатаНачала = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Сделка, "Дата"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоДвижениямБухгалтерии(Запрос, ДатаНачала, УчетныйРегистр);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		ЗаписиРегистра = СтрокаРезультата.Выгрузить();
		Если ЗаписиРегистра.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРегистра = ЗаписиРегистра[0].ИмяРегистра;
		
		Если ИмяРегистра = "ЕдиныйБухгалтерскийУчет" Тогда
			КоличествоСубконто = Метаданные.ПланыСчетов.Единый.МаксКоличествоСубконто;
		Иначе	
			КоличествоСубконто = Метаданные.ПланыСчетов.Основной.МаксКоличествоСубконто;
		КонецЕсли;
		
		Для Каждого СтрокаРегистра Из ЗаписиРегистра Цикл
			НоваяЗапись = Движения[ИмяРегистра].Добавить();			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаРегистра);
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
			
			Для Сч = 1 По КоличествоСубконто Цикл 
				
				Если ЗначениеЗаполнено(СтрокаРегистра["ВидСубконтоДт" + Сч]) Тогда
					НоваяЗапись.СубконтоДт.Вставить(СтрокаРегистра["ВидСубконтоДт" + Сч], СтрокаРегистра["СубконтоДт" + Сч]);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаРегистра["ВидСубконтоКт" + Сч]) Тогда
					НоваяЗапись.СубконтоКт.Вставить(СтрокаРегистра["ВидСубконтоКт" + Сч], СтрокаРегистра["СубконтоКт" + Сч]);
				КонецЕсли;
				
			КонецЦикла;	

		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвиженияРегистраБухгалтерииДляСторнирования

Процедура СформироватьНачислениеЗадолженностиПоОтступным(ТипЗначенияСделки)
	
	Если ЭтотОбъект.СуммаОтступных = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Начисляем задолженность 	
	Если ТипЗначенияСделки = Тип("ДокументСсылка.СделкаСВалютой") Тогда
		РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Сделка, "РасчетныйСчет"); 
		Контрагент = РеквизитыСделки.РасчетныйСчет.Банк.ЮрФизЛицо;
	Иначе
		РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Сделка, "Контрагент, Брокер");
		Контрагент = ?(ЗначениеЗаполнено(РеквизитыСделки.Контрагент), РеквизитыСделки.Контрагент, РеквизитыСделки.Брокер.ЮрФизЛицо);
	КонецЕсли;	
		
	СтрокаЗадолженности                              = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
	СтрокаЗадолженности.Регистратор                  = ЭтотОбъект.Ссылка;
	СтрокаЗадолженности.Период                       = ЭтотОбъект.Дата;
	СтрокаЗадолженности.Основание                    = ЭтотОбъект.Сделка;
	СтрокаЗадолженности.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
	СтрокаЗадолженности.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоТорговойКомиссии;
	СтрокаЗадолженности.Организация                  = ЭтотОбъект.Организация;
	СтрокаЗадолженности.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	СтрокаЗадолженности.Валюта                       = ЭтотОбъект.Валюта;
	СтрокаЗадолженности.Контрагент                   = Контрагент;
	СтрокаЗадолженности.Содержание                   = "Отступные по отмене сделки";
	СтрокаЗадолженности.Сумма                  		 = ЭтотОбъект.СуммаОтступных;	
	
КонецПроцедуры // СформироватьНачислениеЗадолженностиПоОтступным

Функция ПолучитьТекстЗапросаПоДвижениямНакопления(Запрос, ТипЗначенияСделки)
	
	ТекстЗапроса = "";
	
	Запрос.УстановитьПараметр("Сделка", 					  ЭтотОбъект.Сделка);
	Запрос.УстановитьПараметр("Ссылка", 					  ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", 				  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("Период",		 				  ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("МоментВремени", 				  Новый МоментВремени(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка));
	
	МенеджерТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнениеОбязательствПоСделке.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СвязанныеДокументы
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|ГДЕ
		|	ИсполнениеОбязательствПоСделке.Основание = &Сделка
		|	И ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИсполнениеОбязательствПоСделке.МоментВремени <= &МоментВремени
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
        |	ИзменениеУсловийСделки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|ГДЕ
		|	ИзменениеУсловийСделки.Основание = &Сделка
		|	И ИзменениеУсловийСделки.Организация = &Организация
		|	И ИзменениеУсловийСделки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИзменениеУсловийСделки.МоментВремени <= &МоментВремени
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаРЕПО.Ссылка
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|ГДЕ
		|	СделкаРЕПО.ПерваяЧастьРЕПО = &Сделка
		|	И СделкаРЕПО.Организация = &Организация
		|	И СделкаРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаРЕПО.МоментВремени <= &МоментВремени";
	
	Запрос.Выполнить();
	
	Если ТипЗначенияСделки = Тип("ДокументСсылка.Сделка") Тогда	
		
		// БухПартииЦенныхБумаг
		// БухПартииЦенныхБумагКПолучению
		// ЗадолженностиПоДенежнымСредствам
		// ЗадолженностиПоЦеннымБумагам
		// ОстаткиДенежныхСредств
		// ОстаткиЦенныхБумаг
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""БухПартииЦенныхБумаг"" КАК ИмяРегистра,
			|	БухПартииЦенныхБумаг.Период КАК Период,
			|	БухПартииЦенныхБумаг.Регистратор КАК Регистратор,
			|	БухПартииЦенныхБумаг.НомерСтроки КАК НомерСтроки,
			|	БухПартииЦенныхБумаг.Активность КАК Активность,
			|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумаг.Организация КАК Организация,
			|	БухПартииЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	БухПартииЦенныхБумаг.ВидУчета КАК ВидУчета,
			|	БухПартииЦенныхБумаг.Рынок КАК Рынок,
			|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумаг.Партия КАК Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	-БухПартииЦенныхБумаг.Количество КАК Количество,
			|	-БухПартииЦенныхБумаг.СтоимостьПокупки КАК СтоимостьПокупки,
			|	-БухПартииЦенныхБумаг.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
			|	-БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
			|	-БухПартииЦенныхБумаг.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
			|	-БухПартииЦенныхБумаг.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
			|	-БухПартииЦенныхБумаг.Стоимость КАК Стоимость,
			|	-БухПартииЦенныхБумаг.СтоимостьКупона КАК СтоимостьКупона,
			|	-БухПартииЦенныхБумаг.Переоценка КАК Переоценка,
			|	-БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
			|	-БухПартииЦенныхБумаг.ДисконтПремия КАК ДисконтПремия,
			|	-БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
			|	-БухПартииЦенныхБумаг.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
			|	-БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
			|	-БухПартииЦенныхБумаг.СуммаРезервовПодОбесценениеКупона КАК СуммаРезервовПодОбесценениеКупона,
			|	-БухПартииЦенныхБумаг.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
			|	-БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
			|	-БухПартииЦенныхБумаг.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
			|	-БухПартииЦенныхБумаг.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
			|	-БухПартииЦенныхБумаг.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
			|	-БухПартииЦенныхБумаг.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
			|	БухПартииЦенныхБумаг.СтрокаКорзиныЦенныхБумаг КАК СтрокаКорзиныЦенныхБумаг,
//			|	БухПартииЦенныхБумаг.СписаниеПогрешностиОкругления КАК СписаниеПогрешностиОкругления,
			|	ВЫРАЗИТЬ(БухПартииЦенныхБумаг.Содержание КАК СТРОКА(999)) КАК Содержание,
			|	БухПартииЦенныхБумаг.МоментВремени КАК МоментВремени,
			|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
			|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
			|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
			|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
			|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
			|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
			|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|ГДЕ
			|	(БухПартииЦенныхБумаг.Регистратор = &Сделка
			|			ИЛИ БухПартииЦенныхБумаг.Партия = &Сделка
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И БухПартииЦенныхБумаг.Регистратор <> &Ссылка
			|	И БухПартииЦенныхБумаг.Организация = &Организация
			|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|	И БухПартииЦенныхБумаг.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""БухПартииЦенныхБумагКПолучению"" КАК ИмяРегистра,
			|	БухПартииЦенныхБумагКПолучению.Период КАК Период,
			|	БухПартииЦенныхБумагКПолучению.Регистратор КАК Регистратор,
			|	БухПартииЦенныхБумагКПолучению.НомерСтроки КАК НомерСтроки,
			|	БухПартииЦенныхБумагКПолучению.Активность КАК Активность,
			|	БухПартииЦенныхБумагКПолучению.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумагКПолучению.Организация КАК Организация,
			|	БухПартииЦенныхБумагКПолучению.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	БухПартииЦенныхБумагКПолучению.ВидУчета КАК ВидУчета,
			|	БухПартииЦенныхБумагКПолучению.Рынок КАК Рынок,
			|	БухПартииЦенныхБумагКПолучению.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагКПолучению.Партия КАК Партия,
			|	БухПартииЦенныхБумагКПолучению.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагКПолучению.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	-БухПартииЦенныхБумагКПолучению.Количество КАК Количество,
			|	-БухПартииЦенныхБумагКПолучению.СтоимостьПокупки КАК СтоимостьПокупки,
			|	-БухПартииЦенныхБумагКПолучению.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
			|	-БухПартииЦенныхБумагКПолучению.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
			|	-БухПартииЦенныхБумагКПолучению.Стоимость КАК Стоимость,
			|	-БухПартииЦенныхБумагКПолучению.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
			|	-БухПартииЦенныхБумагКПолучению.СтоимостьКупона КАК СтоимостьКупона,
			|	-БухПартииЦенныхБумагКПолучению.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
			|	-БухПартииЦенныхБумагКПолучению.Переоценка КАК Переоценка,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаКупона КАК ПереоценкаКупона,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
			|	-БухПартииЦенныхБумагКПолучению.ПереоценкаНаБалансе КАК ПереоценкаНаБалансе
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКПолучению КАК БухПартииЦенныхБумагКПолучению
			|ГДЕ
			|	(БухПартииЦенныхБумагКПолучению.Регистратор = &Сделка
			|			ИЛИ БухПартииЦенныхБумагКПолучению.Партия = &Сделка
			|			ИЛИ БухПартииЦенныхБумагКПолучению.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И БухПартииЦенныхБумагКПолучению.Регистратор <> &Ссылка
			|	И БухПартииЦенныхБумагКПолучению.Организация = &Организация
			|	И БухПартииЦенныхБумагКПолучению.СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|	И БухПартииЦенныхБумагКПолучению.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ЗадолженностиПоДенежнымСредствам"" КАК ИмяРегистра,
			|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
			|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
			|	ЗадолженностиПоДенежнымСредствам.НомерСтроки КАК НомерСтроки,
			|	ЗадолженностиПоДенежнымСредствам.Активность КАК Активность,
			|	ЗадолженностиПоДенежнымСредствам.ВидДвижения КАК ВидДвижения,
			|	ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
			|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности,
			|	ЗадолженностиПоДенежнымСредствам.Организация КАК Организация,
			|	ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
			|	ЗадолженностиПоДенежнымСредствам.Контрагент КАК Контрагент,
			|	ЗадолженностиПоДенежнымСредствам.Аванс КАК Аванс,
			|	-ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
			|	-ЗадолженностиПоДенежнымСредствам.СуммаКупона КАК СуммаКупона,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	(ЗадолженностиПоДенежнымСредствам.Регистратор = &Сделка
			|			ИЛИ ЗадолженностиПоДенежнымСредствам.Основание = &Сделка
			|			ИЛИ ЗадолженностиПоДенежнымСредствам.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ЗадолженностиПоДенежнымСредствам.Регистратор <> &Ссылка
			|	И ЗадолженностиПоДенежнымСредствам.Организация = &Организация
			|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности НЕ В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|	И ЗадолженностиПоДенежнымСредствам.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ЗадолженностиПоЦеннымБумагам"" КАК ИмяРегистра,
			|	ЗадолженностиПоЦеннымБумагам.Период КАК Период,
			|	ЗадолженностиПоЦеннымБумагам.Регистратор КАК Регистратор,
			|	ЗадолженностиПоЦеннымБумагам.НомерСтроки КАК НомерСтроки,
			|	ЗадолженностиПоЦеннымБумагам.Активность КАК Активность,
			|	ЗадолженностиПоЦеннымБумагам.ВидДвижения КАК ВидДвижения,
			|	ЗадолженностиПоЦеннымБумагам.Основание КАК Основание,
			|	ЗадолженностиПоЦеннымБумагам.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
			|	ЗадолженностиПоЦеннымБумагам.Организация КАК Организация,
			|	ЗадолженностиПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоЦеннымБумагам.Рынок КАК Рынок,
			|	ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЗадолженностиПоЦеннымБумагам.Валюта КАК Валюта,
			|	-ЗадолженностиПоЦеннымБумагам.Количество КАК Количество,
			|	-ЗадолженностиПоЦеннымБумагам.Сумма КАК Сумма,
			|	-ЗадолженностиПоЦеннымБумагам.СуммаКупона КАК СуммаКупона,
			|	ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагам.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
			|ГДЕ
			|	(ЗадолженностиПоЦеннымБумагам.Регистратор = &Сделка
			|			ИЛИ ЗадолженностиПоЦеннымБумагам.Основание = &Сделка
			|			ИЛИ ЗадолженностиПоЦеннымБумагам.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ЗадолженностиПоЦеннымБумагам.Регистратор <> &Ссылка
			|	И ЗадолженностиПоЦеннымБумагам.Организация = &Организация
			|	И ЗадолженностиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ЗадолженностиПоЦеннымБумагам.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ОстаткиДенежныхСредств"" КАК ИмяРегистра,
			|	ОстаткиДенежныхСредств.Период КАК Период,
			|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
			|	ОстаткиДенежныхСредств.НомерСтроки КАК НомерСтроки,
			|	ОстаткиДенежныхСредств.Активность КАК Активность,
			|	ОстаткиДенежныхСредств.ВидДвижения КАК ВидДвижения,
			|	ОстаткиДенежныхСредств.Организация КАК Организация,
			|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиДенежныхСредств.Брокер КАК Брокер,
			|	ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения,
			|	ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
			|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
			|	-ОстаткиДенежныхСредств.Сумма КАК Сумма,
			|	ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
			|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК ВариантДвиженияДенежныхСредств,
			|	ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
			|ГДЕ
			|	(ОстаткиДенежныхСредств.Регистратор = &Сделка
			|			ИЛИ ОстаткиДенежныхСредств.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ОстаткиДенежныхСредств.Организация = &Организация
			|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ОстаткиДенежныхСредств.МоментВремени <= &МоментВремени
			|	И Не ВЫРАЗИТЬ(ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""ОстаткиЦенныхБумаг"" КАК ИмяРегистра,
			|	ОстаткиЦенныхБумаг.Период КАК Период,
			|	ОстаткиЦенныхБумаг.Регистратор КАК Регистратор,
			|	ОстаткиЦенныхБумаг.НомерСтроки КАК НомерСтроки,
			|	ОстаткиЦенныхБумаг.Активность КАК Активность,
			|	ОстаткиЦенныхБумаг.ВидДвижения КАК ВидДвижения,
			|	ОстаткиЦенныхБумаг.Организация КАК Организация,
			|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиЦенныхБумаг.ДепозитарныйСчет КАК ДепозитарныйСчет,
			|	ОстаткиЦенныхБумаг.Рынок КАК Рынок,
			|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	-ОстаткиЦенныхБумаг.Количество КАК Количество,
			|	ВЫРАЗИТЬ(ОстаткиЦенныхБумаг.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
			|ГДЕ
			|	(ОстаткиЦенныхБумаг.Регистратор = &Сделка
			|			ИЛИ ОстаткиЦенныхБумаг.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ОстаткиЦенныхБумаг.Организация = &Организация
			|	И ОстаткиЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ОстаткиЦенныхБумаг.МоментВремени <= &МоментВремени";
		
	ИначеЕсли ТипЗначенияСделки = Тип("ДокументСсылка.СделкаРЕПО") Тогда	
		
		// БухПартииЦенныхБумаг
		// БухПартииЦенныхБумагКупленныеПоРЕПО
		// БухПартииЦенныхБумагПроданныеВРЕПО
		// ЗадолженностиПоВторойЧастиРЕПО
		// ЗадолженностиПоДенежнымСредствам
		// ЗадолженностиПоЦеннымБумагам
		// ОстаткиДенежныхСредств
		// ОстаткиЦенныхБумаг
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""БухПартииЦенныхБумаг"" КАК ИмяРегистра,
			|	БухПартииЦенныхБумаг.Период КАК Период,
			|	БухПартииЦенныхБумаг.Регистратор КАК Регистратор,
			|	БухПартииЦенныхБумаг.НомерСтроки КАК НомерСтроки,
			|	БухПартииЦенныхБумаг.Активность КАК Активность,
			|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумаг.Организация КАК Организация,
			|	БухПартииЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	БухПартииЦенныхБумаг.ВидУчета КАК ВидУчета,
			|	БухПартииЦенныхБумаг.Рынок КАК Рынок,
			|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумаг.Партия КАК Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	-БухПартииЦенныхБумаг.Количество КАК Количество,
			|	-БухПартииЦенныхБумаг.СтоимостьПокупки КАК СтоимостьПокупки,
			|	-БухПартииЦенныхБумаг.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
			|	-БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
			|	-БухПартииЦенныхБумаг.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
			|	-БухПартииЦенныхБумаг.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
			|	-БухПартииЦенныхБумаг.Стоимость КАК Стоимость,
			|	-БухПартииЦенныхБумаг.СтоимостьКупона КАК СтоимостьКупона,
			|	-БухПартииЦенныхБумаг.Переоценка КАК Переоценка,
			|	-БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
			|	-БухПартииЦенныхБумаг.ДисконтПремия КАК ДисконтПремия,
			|	-БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
			|	-БухПартииЦенныхБумаг.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
			|	-БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
			|	-БухПартииЦенныхБумаг.СуммаРезервовПодОбесценениеКупона КАК СуммаРезервовПодОбесценениеКупона,
			|	-БухПартииЦенныхБумаг.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
			|	-БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
			|	-БухПартииЦенныхБумаг.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
			|	-БухПартииЦенныхБумаг.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
			|	-БухПартииЦенныхБумаг.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
			|	-БухПартииЦенныхБумаг.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
			|	БухПартииЦенныхБумаг.СтрокаКорзиныЦенныхБумаг КАК СтрокаКорзиныЦенныхБумаг,
//			|	БухПартииЦенныхБумаг.СписаниеПогрешностиОкругления КАК СписаниеПогрешностиОкругления,
			|	ВЫРАЗИТЬ(БухПартииЦенныхБумаг.Содержание КАК СТРОКА(999)) КАК Содержание,
			|	БухПартииЦенныхБумаг.МоментВремени КАК МоментВремени,
			|	-БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
			|	-БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
			|	-БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
			|	-БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
			|	-БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
			|	-БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
			|	-БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|ГДЕ
			|	(БухПартииЦенныхБумаг.Регистратор = &Сделка
			|			ИЛИ БухПартииЦенныхБумаг.Партия = &Сделка
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И БухПартииЦенныхБумаг.Регистратор <> &Ссылка
			|	И БухПартииЦенныхБумаг.Организация = &Организация
			|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|	И БухПартииЦенныхБумаг.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""БухПартииЦенныхБумагКупленныеПоРЕПО"" КАК ИмяРегистра,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Период КАК Период,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Регистратор КАК Регистратор,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.НомерСтроки КАК НомерСтроки,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Активность КАК Активность,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Организация КАК Организация,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ВидУчета КАК ВидУчета,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Рынок КАК Рынок,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Партия КАК Партия,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтрокаПартии КАК СтрокаПартии,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.Количество КАК Количество,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.Стоимость КАК Стоимость,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупона КАК СтоимостьКупона,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.Переоценка КАК Переоценка,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупона КАК ПереоценкаКупона,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтрокаКорзиныЦенныхБумаг КАК СтрокаКорзиныЦенныхБумаг,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СписаниеПогрешностиОкругления КАК СписаниеПогрешностиОкругления,
			|	ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПО.Содержание КАК СТРОКА(999)) КАК Содержание,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
			|	-БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО КАК БухПартииЦенныхБумагКупленныеПоРЕПО
			|ГДЕ
			|	(БухПартииЦенныхБумагКупленныеПоРЕПО.Регистратор = &Сделка
			|			ИЛИ БухПартииЦенныхБумагКупленныеПоРЕПО.Партия = &Сделка
			|			ИЛИ БухПартииЦенныхБумагКупленныеПоРЕПО.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.Регистратор <> &Ссылка
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.Организация = &Организация
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""БухПартииЦенныхБумагПроданныеВРепо"" КАК ИмяРегистра,
			|	БухПартииЦенныхБумагПроданныеВРепо.Период КАК Период,
			|	БухПартииЦенныхБумагПроданныеВРепо.Регистратор КАК Регистратор,
			|	БухПартииЦенныхБумагПроданныеВРепо.НомерСтроки КАК НомерСтроки,
			|	БухПартииЦенныхБумагПроданныеВРепо.Активность КАК Активность,
			|	БухПартииЦенныхБумагПроданныеВРепо.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумагПроданныеВРепо.Организация КАК Организация,
			|	БухПартииЦенныхБумагПроданныеВРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	БухПартииЦенныхБумагПроданныеВРепо.ВидУчета КАК ВидУчета,
			|	БухПартииЦенныхБумагПроданныеВРепо.Рынок КАК Рынок,
			|	БухПартииЦенныхБумагПроданныеВРепо.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагПроданныеВРепо.Партия КАК Партия,
			|	БухПартииЦенныхБумагПроданныеВРепо.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагПроданныеВРепо.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО КАК ПродажаРЕПО,
			|	БухПартииЦенныхБумагПроданныеВРепо.СтрокаПродажиРЕПО КАК СтрокаПродажиРЕПО,
			|	-БухПартииЦенныхБумагПроданныеВРепо.Количество КАК Количество,
			|	-БухПартииЦенныхБумагПроданныеВРепо.СтоимостьПокупки КАК СтоимостьПокупки,
			|	-БухПартииЦенныхБумагПроданныеВРепо.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
			|	-БухПартииЦенныхБумагПроданныеВРепо.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
			|	-БухПартииЦенныхБумагПроданныеВРепо.Стоимость КАК Стоимость,
			|	-БухПартииЦенныхБумагПроданныеВРепо.СтоимостьКупона КАК СтоимостьКупона,
			|	-БухПартииЦенныхБумагПроданныеВРепо.Переоценка КАК Переоценка,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупона КАК ПереоценкаКупона,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ДисконтПремия КАК ДисконтПремия,
			|	-БухПартииЦенныхБумагПроданныеВРепо.КорректировкаЭСП КАК КорректировкаЭСП,
			|	-БухПартииЦенныхБумагПроданныеВРепо.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
			|	-БухПартииЦенныхБумагПроданныеВРепо.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
			|	-БухПартииЦенныхБумагПроданныеВРепо.СуммаРезервовПодОбесценениеКупона КАК СуммаРезервовПодОбесценениеКупона,
			|	-БухПартииЦенныхБумагПроданныеВРепо.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
			|	-БухПартииЦенныхБумагПроданныеВРепо.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
			|	-БухПартииЦенныхБумагПроданныеВРепо.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
			|	БухПартииЦенныхБумагПроданныеВРепо.СтрокаКорзиныЦенныхБумаг КАК СтрокаКорзиныЦенныхБумаг,
			|	БухПартииЦенныхБумагПроданныеВРепо.СписаниеПогрешностиОкругления КАК СписаниеПогрешностиОкругления,
			|	ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепо.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо КАК БухПартииЦенныхБумагПроданныеВРепо
			|ГДЕ
			|	(БухПартииЦенныхБумагПроданныеВРепо.Регистратор = &Сделка
			|			ИЛИ БухПартииЦенныхБумагПроданныеВРепо.Партия = &Сделка
			|			ИЛИ БухПартииЦенныхБумагПроданныеВРепо.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И БухПартииЦенныхБумагПроданныеВРепо.Регистратор <> &Ссылка
			|	И БухПартииЦенныхБумагПроданныеВРепо.Организация = &Организация
			|	И БухПартииЦенныхБумагПроданныеВРепо.СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|	И БухПартииЦенныхБумагПроданныеВРепо.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ЗадолженностиПоВторойЧастиРЕПО"" КАК ИмяРегистра,
			|	ЗадолженностиПоВторойЧастиРЕПО.Период КАК Период,
			|	ЗадолженностиПоВторойЧастиРЕПО.Регистратор КАК Регистратор,
			|	ЗадолженностиПоВторойЧастиРЕПО.НомерСтроки КАК НомерСтроки,
			|	ЗадолженностиПоВторойЧастиРЕПО.Активность КАК Активность,
			|	ЗадолженностиПоВторойЧастиРЕПО.ВидДвижения КАК ВидДвижения,
			|	ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО КАК СделкаРЕПО,
			|	ЗадолженностиПоВторойЧастиРЕПО.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоВторойЧастиРЕПО.Организация КАК Организация,
			|	ЗадолженностиПоВторойЧастиРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоВторойЧастиРЕПО.Рынок КАК Рынок,
			|	ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЗадолженностиПоВторойЧастиРЕПО.Валюта КАК Валюта,
			|	-ЗадолженностиПоВторойЧастиРЕПО.Количество КАК Количество,
			|	-ЗадолженностиПоВторойЧастиРЕПО.Сумма КАК Сумма,
			|	-ЗадолженностиПоВторойЧастиРЕПО.СуммаКупона КАК СуммаКупона,
			|	ВЫРАЗИТЬ(ЗадолженностиПоВторойЧастиРЕПО.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО КАК ЗадолженностиПоВторойЧастиРЕПО
			|ГДЕ
			|	(ЗадолженностиПоВторойЧастиРЕПО.Регистратор = &Сделка
			|			ИЛИ ЗадолженностиПоВторойЧастиРЕПО.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ЗадолженностиПоВторойЧастиРЕПО.Регистратор <> &Ссылка
			|	И ЗадолженностиПоВторойЧастиРЕПО.Организация = &Организация
			|	И ЗадолженностиПоВторойЧастиРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ЗадолженностиПоВторойЧастиРЕПО.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ЗадолженностиПоДенежнымСредствам"" КАК ИмяРегистра,
			|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
			|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
			|	ЗадолженностиПоДенежнымСредствам.НомерСтроки КАК НомерСтроки,
			|	ЗадолженностиПоДенежнымСредствам.Активность КАК Активность,
			|	ЗадолженностиПоДенежнымСредствам.ВидДвижения КАК ВидДвижения,
			|	ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
			|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности,
			|	ЗадолженностиПоДенежнымСредствам.Организация КАК Организация,
			|	ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
			|	ЗадолженностиПоДенежнымСредствам.Контрагент КАК Контрагент,
			|	ЗадолженностиПоДенежнымСредствам.Аванс КАК Аванс,
			|	-ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
			|	-ЗадолженностиПоДенежнымСредствам.СуммаКупона КАК СуммаКупона,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	(ЗадолженностиПоДенежнымСредствам.Регистратор = &Сделка
			|			ИЛИ ЗадолженностиПоДенежнымСредствам.Основание = &Сделка
			|			ИЛИ ЗадолженностиПоДенежнымСредствам.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ЗадолженностиПоДенежнымСредствам.Регистратор <> &Ссылка
			|	И ЗадолженностиПоДенежнымСредствам.Организация = &Организация
			|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности НЕ В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|	И ЗадолженностиПоДенежнымСредствам.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ЗадолженностиПоЦеннымБумагам"" КАК ИмяРегистра,
			|	ЗадолженностиПоЦеннымБумагам.Период КАК Период,
			|	ЗадолженностиПоЦеннымБумагам.Регистратор КАК Регистратор,
			|	ЗадолженностиПоЦеннымБумагам.НомерСтроки КАК НомерСтроки,
			|	ЗадолженностиПоЦеннымБумагам.Активность КАК Активность,
			|	ЗадолженностиПоЦеннымБумагам.ВидДвижения КАК ВидДвижения,
			|	ЗадолженностиПоЦеннымБумагам.Основание КАК Основание,
			|	ЗадолженностиПоЦеннымБумагам.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
			|	ЗадолженностиПоЦеннымБумагам.Организация КАК Организация,
			|	ЗадолженностиПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоЦеннымБумагам.Рынок КАК Рынок,
			|	ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЗадолженностиПоЦеннымБумагам.Валюта КАК Валюта,
			|	-ЗадолженностиПоЦеннымБумагам.Количество КАК Количество,
			|	-ЗадолженностиПоЦеннымБумагам.Сумма КАК Сумма,
			|	-ЗадолженностиПоЦеннымБумагам.СуммаКупона КАК СуммаКупона,
			|	ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагам.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
			|ГДЕ
			|	(ЗадолженностиПоЦеннымБумагам.Регистратор = &Сделка
			|			ИЛИ ЗадолженностиПоЦеннымБумагам.Основание = &Сделка
			|			ИЛИ ЗадолженностиПоЦеннымБумагам.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ЗадолженностиПоЦеннымБумагам.Регистратор <> &Ссылка
			|	И ЗадолженностиПоЦеннымБумагам.Организация = &Организация
			|	И ЗадолженностиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ЗадолженностиПоЦеннымБумагам.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ОстаткиДенежныхСредств"" КАК ИмяРегистра,
			|	ОстаткиДенежныхСредств.Период КАК Период,
			|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
			|	ОстаткиДенежныхСредств.НомерСтроки КАК НомерСтроки,
			|	ОстаткиДенежныхСредств.Активность КАК Активность,
			|	ОстаткиДенежныхСредств.ВидДвижения КАК ВидДвижения,
			|	ОстаткиДенежныхСредств.Организация КАК Организация,
			|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиДенежныхСредств.Брокер КАК Брокер,
			|	ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения,
			|	ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
			|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
			|	-ОстаткиДенежныхСредств.Сумма КАК Сумма,
			|	ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
			|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК ВариантДвиженияДенежныхСредств,
			|	ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
			|ГДЕ
			|	(ОстаткиДенежныхСредств.Регистратор = &Сделка
			|			ИЛИ ОстаткиДенежныхСредств.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И Не ВЫРАЗИТЬ(ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|	И ОстаткиДенежныхСредств.Организация = &Организация
			|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ОстаткиДенежныхСредств.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ОстаткиЦенныхБумаг"" КАК ИмяРегистра,
			|	ОстаткиЦенныхБумаг.Период КАК Период,
			|	ОстаткиЦенныхБумаг.Регистратор КАК Регистратор,
			|	ОстаткиЦенныхБумаг.НомерСтроки КАК НомерСтроки,
			|	ОстаткиЦенныхБумаг.Активность КАК Активность,
			|	ОстаткиЦенныхБумаг.ВидДвижения КАК ВидДвижения,
			|	ОстаткиЦенныхБумаг.Организация КАК Организация,
			|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиЦенныхБумаг.ДепозитарныйСчет КАК ДепозитарныйСчет,
			|	ОстаткиЦенныхБумаг.Рынок КАК Рынок,
			|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	-ОстаткиЦенныхБумаг.Количество КАК Количество,
			|	ВЫРАЗИТЬ(ОстаткиЦенныхБумаг.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
			|ГДЕ
			|	(ОстаткиЦенныхБумаг.Регистратор = &Сделка
			|			ИЛИ ОстаткиЦенныхБумаг.Регистратор В
			|				(ВЫБРАТЬ
			|					_СвязанныеДокументы.Ссылка
			|				ИЗ
			|					_СвязанныеДокументы КАК _СвязанныеДокументы))
			|	И ОстаткиЦенныхБумаг.Организация = &Организация
			|	И ОстаткиЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ОстаткиЦенныхБумаг.МоментВремени <= &МоментВремени";
		
	ИначеЕсли ТипЗначенияСделки = Тип("ДокументСсылка.СделкаСВалютой") Тогда	
		
		// ЗадолженностиПоДенежнымСредствам
		// ОстаткиДенежныхСредств

		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ЗадолженностиПоДенежнымСредствам"" КАК ИмяРегистра,
			|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
			|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
			|	ЗадолженностиПоДенежнымСредствам.НомерСтроки КАК НомерСтроки,
			|	ЗадолженностиПоДенежнымСредствам.Активность КАК Активность,
			|	ЗадолженностиПоДенежнымСредствам.ВидДвижения КАК ВидДвижения,
			|	ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
			|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности,
			|	ЗадолженностиПоДенежнымСредствам.Организация КАК Организация,
			|	ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
			|	ЗадолженностиПоДенежнымСредствам.Контрагент КАК Контрагент,
			|	ЗадолженностиПоДенежнымСредствам.Аванс КАК Аванс,
			|	-ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
			|	-ЗадолженностиПоДенежнымСредствам.СуммаКупона КАК СуммаКупона,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Сделка
			|	И ЗадолженностиПоДенежнымСредствам.Регистратор <> &Ссылка
			|	И ЗадолженностиПоДенежнымСредствам.Организация = &Организация
			|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И НЕ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|	И ЗадолженностиПоДенежнымСредствам.МоментВремени <= &МоментВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""ОстаткиДенежныхСредств"" КАК ИмяРегистра,
			|	ОстаткиДенежныхСредств.Период КАК Период,
			|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
			|	ОстаткиДенежныхСредств.НомерСтроки КАК НомерСтроки,
			|	ОстаткиДенежныхСредств.Активность КАК Активность,
			|	ОстаткиДенежныхСредств.ВидДвижения КАК ВидДвижения,
			|	ОстаткиДенежныхСредств.Организация КАК Организация,
			|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиДенежныхСредств.Брокер КАК Брокер,
			|	ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения,
			|	ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
			|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
			|	-ОстаткиДенежныхСредств.Сумма КАК Сумма,
			|	ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
			|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК ВариантДвиженияДенежныхСредств,
			|	ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Содержание КАК СТРОКА(999)) КАК Содержание
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
			|ГДЕ
			|	ОстаткиДенежныхСредств.Регистратор = &Сделка
			|	И НЕ ВЫРАЗИТЬ(ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|	И ОстаткиДенежныхСредств.Организация = &Организация
			|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ОстаткиДенежныхСредств.МоментВремени <= &МоментВремени"; 		
		
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаПоДвижениямНакопления

Функция ПолучитьТекстЗапросаПоРегистрамСведений(Запрос, ТипЗначенияСделки)
			
	ТекстЗапроса = "";
	
	Запрос.УстановитьПараметр("Сделка", 					  ЭтотОбъект.Сделка);
	Запрос.УстановитьПараметр("Ссылка", 					  ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", 				  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", 					  ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("МоментВремени", 				  Новый МоментВремени(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка));
	
	МенеджерТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнениеОбязательствПоСделке.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СвязанныеДокументы
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|ГДЕ
		|	ИсполнениеОбязательствПоСделке.Основание = &Сделка
		|	И ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИсполнениеОбязательствПоСделке.МоментВремени <= &МоментВремени
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
        |	ИзменениеУсловийСделки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|ГДЕ
		|	ИзменениеУсловийСделки.Основание = &Сделка
		|	И ИзменениеУсловийСделки.Организация = &Организация
		|	И ИзменениеУсловийСделки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИзменениеУсловийСделки.МоментВремени <= &МоментВремени
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаРЕПО.Ссылка
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|ГДЕ
		|	СделкаРЕПО.ПерваяЧастьРЕПО = &Сделка
		|	И СделкаРЕПО.Организация = &Организация
		|	И СделкаРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаРЕПО.МоментВремени <= &МоментВремени";
	
	Запрос.Выполнить();
	
	Если ТипЗначенияСделки = Тип("ДокументСсылка.Сделка") Тогда	
		
		// ОперацииСЦеннымиБумагами
		// УсловияСделок
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ОперацииСЦеннымиБумагами"" КАК ИмяРегистра,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Активность,
		|	ОперацииСЦеннымиБумагами.СтрокаПартии,
		|	&Ссылка КАК Операция,
		|	ОперацииСЦеннымиБумагами.ЧастьСделкиРЕПО,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		| 	ОперацииСЦеннымиБумагами.Регистратор КАК Основание,
		|	ОперацииСЦеннымиБумагами.Организация,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Валюта,
		|	ОперацииСЦеннымиБумагами.ДатаПокупки,
		|	ОперацииСЦеннымиБумагами.ДатаПоставкиПлановая,
		|	ОперацииСЦеннымиБумагами.ДатаПоставки,
		|	ОперацииСЦеннымиБумагами.ДатаОплатыПлановая,
		|	ОперацииСЦеннымиБумагами.ДатаОплаты,
		|	-ОперацииСЦеннымиБумагами.Количество КАК Количество,
		|	ОперацииСЦеннымиБумагами.Цена КАК Цена,
		|	ОперацииСЦеннымиБумагами.ЦенаПроцент КАК ЦенаПроцент,
		|	ОперацииСЦеннымиБумагами.ЦенаКупона,
		|	-ОперацииСЦеннымиБумагами.Сумма КАК Сумма,
		|	-ОперацииСЦеннымиБумагами.СуммаКупона КАК СуммаКупона,
		|	ОперацииСЦеннымиБумагами.ДатаОперации
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	(ОперацииСЦеннымиБумагами.Регистратор = &Сделка
		|			ИЛИ ОперацииСЦеннымиБумагами.Основание = &Сделка
		|			ИЛИ ОперацииСЦеннымиБумагами.Операция = &Сделка
		|			ИЛИ ОперацииСЦеннымиБумагами.Регистратор В
		|				(ВЫБРАТЬ
		|					_СвязанныеДокументы.Ссылка
		|				ИЗ
		|					_СвязанныеДокументы КАК _СвязанныеДокументы))
		|	И ОперацииСЦеннымиБумагами.Регистратор <> &Ссылка
		|	И ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.Регистратор.МоментВремени <= &МоментВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""УсловияСделок"" КАК ИмяРегистра,
		|	УсловияСделок.Период КАК Период,
		|	УсловияСделок.Регистратор,
		|	УсловияСделок.НомерСтроки,
		|	УсловияСделок.Активность,
		|	УсловияСделок.Организация,
		|	УсловияСделок.Сделка,
		|	УсловияСделок.Рынок,
		|	УсловияСделок.ЦеннаяБумага,
		|	ИСТИНА КАК Отменено,
		|	УсловияСделок.ДепозитарныйСчет,
		|	УсловияСделок.ДатаИсполнения,
		|	УсловияСделок.ДатаОплаты,
		|	УсловияСделок.ДатаПоставки,
		|	УсловияСделок.ВалютаОплаты,
		|	УсловияСделок.СобственныйКурсОплаты,
		|	УсловияСделок.КурсОплаты,
		|	УсловияСделок.Количество,
		|	УсловияСделок.Цена,
		|	УсловияСделок.ЦенаПроцент,
		|	УсловияСделок.ЦенаКупона,
		|	УсловияСделок.Сумма,
		|	УсловияСделок.СуммаКупона,
		|	УсловияСделок.ОтложенноеИсполнение,
		|	УсловияСделок.РаздельноеИсполнение,
		|	УсловияСделок.СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.УсловияСделок КАК УсловияСделок
		|ГДЕ
		|	(УсловияСделок.Регистратор = &Сделка
		|			ИЛИ УсловияСделок.Сделка = &Сделка
		|			ИЛИ УсловияСделок.Регистратор В
		|				(ВЫБРАТЬ
		|					_СвязанныеДокументы.Ссылка
		|				ИЗ
		|					_СвязанныеДокументы КАК _СвязанныеДокументы))
		|	И УсловияСделок.Регистратор <> &Ссылка
		|	И УсловияСделок.Организация = &Организация
		|	И УсловияСделок.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|   И НЕ Отменено
		|	И УсловияСделок.МоментВремени <= &МоментВремени
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
	ИначеЕсли ТипЗначенияСделки = Тип("ДокументСсылка.СделкаРЕПО") Тогда	
		
		// ОперацииСЦеннымиБумагами
		// УсловияСделокРЕПО
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ОперацииСЦеннымиБумагами"" КАК ИмяРегистра,
		|	ОперацииСЦеннымиБумагами.Регистратор КАК Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки КАК НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Активность КАК Активность,
		|	ОперацииСЦеннымиБумагами.СтрокаПартии КАК СтрокаПартии,
		|	&Ссылка КАК Операция,
		|	ОперацииСЦеннымиБумагами.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	ОперацииСЦеннымиБумагами.ВидДвижения КАК ВидДвижения,
		| 	ОперацииСЦеннымиБумагами.Регистратор КАК Основание,
		|	ОперацииСЦеннымиБумагами.Организация КАК Организация,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОперацииСЦеннымиБумагами.Рынок КАК Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Валюта КАК Валюта,
		|	ОперацииСЦеннымиБумагами.ДатаПокупки КАК ДатаПокупки,
		|	ОперацииСЦеннымиБумагами.ДатаПоставкиПлановая КАК ДатаПоставкиПлановая,
		|	ОперацииСЦеннымиБумагами.ДатаПоставки КАК ДатаПоставки,
		|	ОперацииСЦеннымиБумагами.ДатаОплатыПлановая КАК ДатаОплатыПлановая,
		|	ОперацииСЦеннымиБумагами.ДатаОплаты КАК ДатаОплаты,
		|	-ОперацииСЦеннымиБумагами.Количество КАК Количество,
		|	ОперацииСЦеннымиБумагами.Цена КАК Цена,
		|	ОперацииСЦеннымиБумагами.ЦенаПроцент КАК ЦенаПроцент,
		|	ОперацииСЦеннымиБумагами.ЦенаКупона КАК ЦенаКупона,
		|	-ОперацииСЦеннымиБумагами.Сумма КАК Сумма,
		|	-ОперацииСЦеннымиБумагами.СуммаКупона КАК СуммаКупона,
		|	ОперацииСЦеннымиБумагами.ДатаОперации КАК ДатаОперации
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	(ОперацииСЦеннымиБумагами.Регистратор = &Сделка
		|			ИЛИ ОперацииСЦеннымиБумагами.Основание = &Сделка
		|			ИЛИ ОперацииСЦеннымиБумагами.Операция = &Сделка
		|			ИЛИ ОперацииСЦеннымиБумагами.Регистратор В
		|				(ВЫБРАТЬ
		|					_СвязанныеДокументы.Ссылка
		|				ИЗ
		|					_СвязанныеДокументы КАК _СвязанныеДокументы))
		|	И ОперацииСЦеннымиБумагами.Регистратор <> &Ссылка
		|	И ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.Регистратор.МоментВремени <= &МоментВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""УсловияСделокРЕПО"" КАК ИмяРегистра,
		|	УсловияСделокРЕПО.Период КАК Период,
		|	УсловияСделокРЕПО.Регистратор КАК Регистратор,
		|	УсловияСделокРЕПО.НомерСтроки КАК НомерСтроки,
		|	УсловияСделокРЕПО.Активность КАК Активность,
		|	УсловияСделокРЕПО.Организация КАК Организация,
		|	УсловияСделокРЕПО.Рынок КАК Рынок,
		|	УсловияСделокРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИСТИНА КАК Отменено,
		|	УсловияСделокРЕПО.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	УсловияСделокРЕПО.ДатаИсполнения КАК ДатаИсполнения,
		|	УсловияСделокРЕПО.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокРЕПО.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокРЕПО.ВалютаОплаты КАК ВалютаОплаты,
		|	УсловияСделокРЕПО.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	УсловияСделокРЕПО.КурсОплаты КАК КурсОплаты,
		|	УсловияСделокРЕПО.Количество КАК Количество,
		|	УсловияСделокРЕПО.Цена КАК Цена,
		|	УсловияСделокРЕПО.ЦенаПроцент КАК ЦенаПроцент,
		|	УсловияСделокРЕПО.ЦенаКупона КАК ЦенаКупона,
		|	УсловияСделокРЕПО.Сумма КАК Сумма,
		|	УсловияСделокРЕПО.СуммаКупона КАК СуммаКупона,
		|	УсловияСделокРЕПО.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
		|	УсловияСделокРЕПО.РаздельноеИсполнение КАК РаздельноеИсполнение,
		|	УсловияСделокРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокРЕПО.ВидЗадолженности КАК ВидЗадолженности,
		|	УсловияСделокРЕПО.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	УсловияСделокРЕПО.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПО.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|ГДЕ
		|	(УсловияСделокРЕПО.Регистратор = &Сделка
		|			ИЛИ УсловияСделокРЕПО.Регистратор В
		|				(ВЫБРАТЬ
		|					_СвязанныеДокументы.Ссылка
		|				ИЗ
		|					_СвязанныеДокументы КАК _СвязанныеДокументы))
		|	И УсловияСделокРЕПО.Регистратор <> &Ссылка
		|	И УсловияСделокРЕПО.Организация = &Организация
		|	И УсловияСделокРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НЕ УсловияСделокРЕПО.Отменено
		|	И УсловияСделокРЕПО.МоментВремени <= &МоментВремени
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
			
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаПоРегистрамСведений

Функция ПолучитьТекстЗапросаПоДвижениямБухгалтерии(Запрос, ДатаНачала, УчетныйРегистр)
	
	ТекстЗапроса = "";
	
	Запрос.УстановитьПараметр("Сделка", 					  ЭтотОбъект.Сделка);
	Запрос.УстановитьПараметр("Ссылка", 					  ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", 				  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("НачалоПериода", 				  ДатаНачала);
	Запрос.УстановитьПараметр("Период",		 				  ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("МоментВремени", 				  Новый МоментВремени(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка));
	
	// Исключаем сторнирование проводок по комиссиям.
	// Для этого получим счета учета комиссий из настроек соответствующего учета
	// !!!!Уточнить про предварительные затраты по комиссии!!!!
	СчетаУчетаКомиссии = Новый Массив;
	СубконтоКомиссии = Новый Массив;
	Если Учетныйрегистр = "ЕдиныйБухгалтерскийУчет" Тогда		
		СчетаУчетаКомиссии.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами02);
		СубконтоКомиссии.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссия);		
	Иначе	
		СчетУчетаКомиссии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
				ДатаНачала, 
				ЭтотОбъект.Организация, 
				ЭтотОбъект.СчетДоверительногоУправления,
				Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
				УчетныйРегистр,
				"СчетУчета");
				
		СчетаУчетаКомиссии.Добавить(СчетУчетаКомиссии);		
	КонецЕсли;			
	
	Запрос.УстановитьПараметр("СчетаУчетаКомиссии",	СчетаУчетаКомиссии);
	Запрос.УстановитьПараметр("СубконтоКомиссии",	СубконтоКомиссии);
	
	МенеджерТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнениеОбязательствПоСделке.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СвязанныеДокументы
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|ГДЕ
		|	ИсполнениеОбязательствПоСделке.Основание = &Сделка
		|	И ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИсполнениеОбязательствПоСделке.МоментВремени <= &МоментВремени
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
        |	ИзменениеУсловийСделки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|ГДЕ
		|	ИзменениеУсловийСделки.Основание = &Сделка
		|	И ИзменениеУсловийСделки.Организация = &Организация
		|	И ИзменениеУсловийСделки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИзменениеУсловийСделки.МоментВремени <= &МоментВремени
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаРЕПО.Ссылка
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|ГДЕ
		|	СделкаРЕПО.ПерваяЧастьРЕПО = &Сделка
		|	И СделкаРЕПО.Организация = &Организация
		|	И СделкаРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаРЕПО.МоментВремени <= &МоментВремени";
	
	Запрос.Выполнить();
				
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	" + """" + УчетныйРегистр + """" + " КАК ИмяРегистра,
		|	БухгалтерскийУчетДвиженияССубконто.Период КАК Период,
		|	БухгалтерскийУчетДвиженияССубконто.Регистратор КАК Регистратор,
		|	БухгалтерскийУчетДвиженияССубконто.НомерСтроки КАК НомерСтроки,
		|	БухгалтерскийУчетДвиженияССубконто.Активность КАК Активность,
		|	БухгалтерскийУчетДвиженияССубконто.СчетДт КАК СчетДт,
		|	БухгалтерскийУчетДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
		|	БухгалтерскийУчетДвиженияССубконто.ВидСубконтоДт1 КАК ВидСубконтоДт1,
		|	БухгалтерскийУчетДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
		|	БухгалтерскийУчетДвиженияССубконто.ВидСубконтоДт2 КАК ВидСубконтоДт2,
		|	БухгалтерскийУчетДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
		|	БухгалтерскийУчетДвиженияССубконто.ВидСубконтоДт3 КАК ВидСубконтоДт3,
		|	БухгалтерскийУчетДвиженияССубконто.СчетКт КАК СчетКт,
		|	БухгалтерскийУчетДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
		|	БухгалтерскийУчетДвиженияССубконто.ВидСубконтоКт1 КАК ВидСубконтоКт1,
		|	БухгалтерскийУчетДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
		|	БухгалтерскийУчетДвиженияССубконто.ВидСубконтоКт2 КАК ВидСубконтоКт2,
		|	БухгалтерскийУчетДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
		|	БухгалтерскийУчетДвиженияССубконто.ВидСубконтоКт3 КАК ВидСубконтоКт3,
		|	БухгалтерскийУчетДвиженияССубконто.Организация КАК Организация,
		|	БухгалтерскийУчетДвиженияССубконто.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухгалтерскийУчетДвиженияССубконто.ВалютаДт КАК ВалютаДт,
		|	БухгалтерскийУчетДвиженияССубконто.ВалютаКт КАК ВалютаКт,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетДвиженияССубконто.КоличествоДт = 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухгалтерскийУчетДвиженияССубконто.КоличествоДт
		|	КОНЕЦ КАК КоличествоДт,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетДвиженияССубконто.КоличествоКт = 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухгалтерскийУчетДвиженияССубконто.КоличествоКт
		|	КОНЕЦ КАК КоличествоКт,
		|	-БухгалтерскийУчетДвиженияССубконто.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаДт = 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаДт
		|	КОНЕЦ КАК ВалютнаяСуммаДт,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаКт = 0
		|			ТОГДА 0
		|		ИНАЧЕ -БухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаКт
		|	КОНЕЦ КАК ВалютнаяСуммаКт,
		|	ВЫРАЗИТЬ(БухгалтерскийУчетДвиженияССубконто.Содержание КАК СТРОКА(999)) КАК Содержание,
		|	БухгалтерскийУчетДвиженияССубконто.ПорядокОпераций КАК ПорядокОпераций
		|ИЗ
		|	РегистрБухгалтерии." + УчетныйРегистр + ".ДвиженияССубконто(	
		|			&НачалоПериода,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Активность
		|				И (Регистратор = &Сделка
		|					ИЛИ Регистратор В
		|						(ВЫБРАТЬ
		|							_СвязанныеДокументы.Ссылка
		|						ИЗ
		|							_СвязанныеДокументы КАК _СвязанныеДокументы)),
		|			,
		|			) КАК БухгалтерскийУчетДвиженияССубконто
		|ГДЕ 
		|	БухгалтерскийУчетДвиженияССубконто.МоментВремени <= &МоментВремени
	 	|	И (НЕ (БухгалтерскийУчетДвиженияССубконто.СчетКт В (&СчетаУчетаКомиссии)"
		+ ?(СубконтоКомиссии.Количество() > 0, " И БухгалтерскийУчетДвиженияССубконто.СубконтоКт2 В (&СубконтоКомиссии))", ")") +"
		|)
		|	И (НЕ (БухгалтерскийУчетДвиженияССубконто.СчетДт В (&СчетаУчетаКомиссии)"
		+ ?(СубконтоКомиссии.Количество() > 0, " И БухгалтерскийУчетДвиженияССубконто.СубконтоДт2 В (&СубконтоКомиссии))", ")") +"
		|)";
	 	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаПоДвижениямБухгалтерии

Процедура ПроверитьДублированиеОтменыСделки(Отказ)
	
	Если Отказ ИЛИ ЭтотОбъект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ОтменаСделки)
		|	И ОперацииСЦеннымиБумагами.Основание = &Основание";
	
	Если Не ЭтоНовый() Тогда
		ТекстЗапроса = ТекстЗапроса + " И ОперацииСЦеннымиБумагами.Регистратор <> &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Сделка);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Уже проведена отмена сделки " + СокрЛП(Выборка.Регистратор),,,, Отказ);
	КонецЕсли;
		
КонецПроцедуры // ПроверитьДублированиеОтменыСделки
	
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	// Заполнение шапки
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Сделка") Тогда
		Сделка = ДанныеЗаполнения.Ссылка;
		СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Сделка = ДанныеЗаполнения.Ссылка;
		СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СделкаСВалютой") Тогда
		Сделка = ДанныеЗаполнения.Ссылка;
		СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Сделка");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
			
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
		
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	ПроверитьДублированиеОтменыСделки(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// т.к. по документу используется сводная форма в журнале
	РаботаСЖурналамиОпераций.ПередЗаписьюДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью

Процедура ПередУдалением(Отказ)
	
	РаботаСЖурналамиОпераций.ПередУдалениемДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти

