
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Импорт дивидендов по акциям из рассылки НРД",
		"0.07",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоИмпортДивидендовПоАкциямИзРассылкиНРД",  "Автоимпорт дивидендов по акциям из рассылки НРД",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если Найти(ИдентификаторКоманды, "АвтоИмпортДивидендовПоАкциямИзРассылкиНРД") = 1 Тогда
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		ИмпортироватьДивидендыПоАкциям(ПараметрыСессии);
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

////////////////////////////////////////////////////////////////////////////////

Процедура ИмпортироватьДивидендыПоАкциям(ПараметрыСессии) Экспорт
	
	// соединяемся с сервером
	СтрокаСоединения = РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	ТекстЗапроса     = "select distinct CreDt, 
		|CASE WHEN Mdftndt = '' THEN '0001-01-01'
		|ELSE Mdftndt
		|END AS Mdftndt, 
		|CorpActnEvtId, 
		|EvtTp, 
		|ISIN, 
		|RcrdDt, 
		|GrssDvddRate, 
		|Currency, 
		|NSDSctyCd 
		|FROM Externals.dbo.GM_And_Dividends_NSD 
		|where EvtTp='DVCA' AND NtfctnStatus IN ('NEW','REPL') 
		|order by CorpActnEvtId, ISIN, CreDt";
	
	ПервичныеВнешниеДанные = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса);
	Если ПервичныеВнешниеДанные = Неопределено Тогда
		ТекстОшибки = "Первичные внешние данные не найдены";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	// получим список актуальных ценных бумаг
	АктуальныеЦенныеБумаги = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект,
		|	КодыВТорговыхСистемахСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(, ) КАК КодыВТорговыхСистемахСрезПоследних
		|ГДЕ
		|	КодыВТорговыхСистемахСрезПоследних.Код В(&Код)
		|	И КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)";
	
	Запрос.УстановитьПараметр("Код", ПервичныеВнешниеДанные.ВыгрузитьКолонку("ISIN"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АктуальныеЦенныеБумаги.Вставить(Выборка.Код, Выборка.Объект);
	КонецЦикла;
	
	// получим список актуальных валют
	АктуальныеВалюты = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Валюты.Ссылка,
		|	Валюты.Наименование
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Наименование В(&Наименование)";
		
	Запрос.УстановитьПараметр("Наименование", ПервичныеВнешниеДанные.ВыгрузитьКолонку("Currency"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АктуальныеВалюты.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	
	// десериализуем данные
	ДивидендыПоАкциямМД = Метаданные.РегистрыСведений.ДивидендыПоАкциям;
	
	ДивидендыПоАкциям = Новый ТаблицаЗначений;
	ДивидендыПоАкциям.Колонки.Добавить("Период",                      Новый ОписаниеТипов("Дата"));
	ДивидендыПоАкциям.Колонки.Добавить("ДатаИзменения",               Новый ОписаниеТипов("Дата"));
	ДивидендыПоАкциям.Колонки.Добавить("Акция",                       ДивидендыПоАкциямМД.Измерения.Акция.Тип);
	ДивидендыПоАкциям.Колонки.Добавить("ИдСобытияПоВыплатеДивидендов",ДивидендыПоАкциямМД.Измерения.ИдСобытияПоВыплатеДивидендов.Тип);
	ДивидендыПоАкциям.Колонки.Добавить("ДатаФиксации",                ДивидендыПоАкциямМД.Ресурсы.ДатаФиксации.Тип);
	ДивидендыПоАкциям.Колонки.Добавить("РазмерДивидендовНаОднуАкцию", ДивидендыПоАкциямМД.Ресурсы.РазмерДивидендовНаОднуАкцию.Тип);
	ДивидендыПоАкциям.Колонки.Добавить("Валюта",                      ДивидендыПоАкциямМД.Ресурсы.Валюта.Тип);
	ДивидендыПоАкциям.Колонки.Добавить("Источник",                    ДивидендыПоАкциямМД.Реквизиты.Источник.Тип);
	
	Для каждого СтрокаПервичныеВнешниеДанные Из ПервичныеВнешниеДанные Цикл
		Если Не ЗначениеЗаполнено(АктуальныеЦенныеБумаги[СтрокаПервичныеВнешниеДанные.ISIN]) Тогда // загружаем только те бумаги, которые есть в системе
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаДивидендыПоАкциям = ДивидендыПоАкциям.Добавить();
		НоваяСтрокаДивидендыПоАкциям.Период                      = ДатаИзСтрокиГГГГММДД(СтрокаПервичныеВнешниеДанные.CreDt, "-");
		НоваяСтрокаДивидендыПоАкциям.ДатаИзменения 				 = ДатаИзСтрокиГГГГММДД(СтрокаПервичныеВнешниеДанные.Mdftndt, "-");
		НоваяСтрокаДивидендыПоАкциям.Акция                       = АктуальныеЦенныеБумаги[СтрокаПервичныеВнешниеДанные.ISIN];
		Если СокрЛП(СтрокаПервичныеВнешниеДанные.NSDSctyCd) = "TECS/04" Тогда               //хардкод. переделать. Интер РАО 
			НоваяСтрокаДивидендыПоАкциям.Акция = Справочники.Акции.НайтиПоКоду("000000100");
		ИначеЕсли СокрЛП(СтрокаПервичныеВнешниеДанные.NSDSctyCd) = "TECS/DR" Тогда	
			НоваяСтрокаДивидендыПоАкциям.Акция = Справочники.Акции.НайтиПоКоду("000000101");
		КонецЕсли;					
		НоваяСтрокаДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов= СтрокаПервичныеВнешниеДанные.CorpActnEvtId;
		НоваяСтрокаДивидендыПоАкциям.ДатаФиксации                = ДатаИзСтрокиГГГГММДД(СтрокаПервичныеВнешниеДанные.RcrdDt, "-");
		НоваяСтрокаДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию = ЧислоИзСтроки(СтрокаПервичныеВнешниеДанные.GrssDvddRate);
		НоваяСтрокаДивидендыПоАкциям.Валюта                      = АктуальныеВалюты[СтрокаПервичныеВнешниеДанные.Currency];
		НоваяСтрокаДивидендыПоАкциям.Источник                    = "Рассылка НРД";
	КонецЦикла;
	
	//  _ДивидендыПоАкциям - загружаем данные НРД. ДатаИзменения - Дата Либо первичная дата, либо дата изменения записи. 
	//  					при этом необязательно меняются параметры выплаты дивидендов. 
	// 	_ДивидендыПоАкциямРазличные - отбираем различные записи из первой таблицы, группируя по минимальной дате  
	//   						Если цена и дата фиксации не мяналась, по период не изменится. 
	//  - соединяетм с даными регистра и смотрим изменения.
	// 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДивидендыПоАкциям.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ДивидендыПоАкциям.Период > ДивидендыПоАкциям.ДатаИзменения
		|			ТОГДА ДивидендыПоАкциям.Период
		|		ИНАЧЕ ДивидендыПоАкциям.ДатаИзменения
		|	КОНЕЦ КАК ДатаИзменения,
		|	ДивидендыПоАкциям.Акция КАК Акция,
		|	ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов КАК ИдСобытияПоВыплатеДивидендов,
		|	ДивидендыПоАкциям.ДатаФиксации КАК ДатаФиксации,
		|	ДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию КАК РазмерДивидендовНаОднуАкцию,
		|	ВЫБОР
		|		КОГДА ДивидендыПоАкциям.Валюта = """"
		|			ТОГДА ""RUB""
		|		ИНАЧЕ ДивидендыПоАкциям.Валюта
		|	КОНЕЦ КАК Валюта,
		|	ДивидендыПоАкциям.Источник КАК Источник
		|ПОМЕСТИТЬ _ДивидендыПоАкциям
		|ИЗ
		|	&ДивидендыПоАкциям КАК ДивидендыПоАкциям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_ДивидендыПоАкциям.ДатаИзменения) КАК Период,
		|	_ДивидендыПоАкциям.Акция КАК Акция,
		|	_ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов КАК ИдСобытияПоВыплатеДивидендов,
		|	_ДивидендыПоАкциям.ДатаФиксации КАК ДатаФиксации,
		|	_ДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию КАК РазмерДивидендовНаОднуАкцию,
		|	_ДивидендыПоАкциям.Валюта КАК Валюта,
		|	_ДивидендыПоАкциям.Источник КАК Источник
		|ПОМЕСТИТЬ _ДивидендыПоАкциямРазличные
		|ИЗ
		|	_ДивидендыПоАкциям КАК _ДивидендыПоАкциям
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДивидендыПоАкциям.Акция,
		|	_ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов,
		|	_ДивидендыПоАкциям.ДатаФиксации,
		|	_ДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию,
		|	_ДивидендыПоАкциям.Валюта,
		|	_ДивидендыПоАкциям.Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДивидендыПоАкциямРазличные.Период КАК Период,
		|	_ДивидендыПоАкциямРазличные.Акция КАК Акция,
		|	_ДивидендыПоАкциямРазличные.ИдСобытияПоВыплатеДивидендов КАК ИдСобытияПоВыплатеДивидендов,
		|	_ДивидендыПоАкциямРазличные.ДатаФиксации КАК ДатаФиксации,
		|	_ДивидендыПоАкциямРазличные.РазмерДивидендовНаОднуАкцию КАК РазмерДивидендовНаОднуАкцию,
		|	_ДивидендыПоАкциямРазличные.Валюта КАК Валюта,
		|	_ДивидендыПоАкциямРазличные.Источник КАК Источник,
		|	ВЫБОР
		|		КОГДА ДивидендыПоАкциямРегистр.Акция ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НоваяЗапись,
		|	ВЫБОР
		|		КОГДА ДивидендыПоАкциямРегистр.РазмерДивидендовНаОднуАкцию <> _ДивидендыПоАкциямРазличные.РазмерДивидендовНаОднуАкцию
		|				ИЛИ ДивидендыПоАкциямРегистр.ДатаФиксации <> _ДивидендыПоАкциямРазличные.ДатаФиксации
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИзмененнаяЗапись
		|ИЗ
		|	_ДивидендыПоАкциямРазличные КАК _ДивидендыПоАкциямРазличные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДивидендыПоАкциям КАК ДивидендыПоАкциямРегистр
		|		ПО _ДивидендыПоАкциямРазличные.Период = ДивидендыПоАкциямРегистр.Период
		|			И _ДивидендыПоАкциямРазличные.Акция = ДивидендыПоАкциямРегистр.Акция
		|			И _ДивидендыПоАкциямРазличные.ИдСобытияПоВыплатеДивидендов = ДивидендыПоАкциямРегистр.ИдСобытияПоВыплатеДивидендов
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДивидендыПоАкциямРазличные.Акция,
		|	_ДивидендыПоАкциямРазличные.ИдСобытияПоВыплатеДивидендов,
		|	_ДивидендыПоАкциямРазличные.ДатаФиксации,
		|	_ДивидендыПоАкциямРазличные.РазмерДивидендовНаОднуАкцию,
		|	_ДивидендыПоАкциямРазличные.Валюта,
		|	_ДивидендыПоАкциямРазличные.Источник,
		|	ВЫБОР
		|		КОГДА ДивидендыПоАкциямРегистр.Акция ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДивидендыПоАкциямРегистр.РазмерДивидендовНаОднуАкцию <> _ДивидендыПоАкциямРазличные.РазмерДивидендовНаОднуАкцию
		|				ИЛИ ДивидендыПоАкциямРегистр.ДатаФиксации <> _ДивидендыПоАкциямРазличные.ДатаФиксации
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	_ДивидендыПоАкциямРазличные.Период";
		
	Запрос.УстановитьПараметр("ДивидендыПоАкциям", ДивидендыПоАкциям);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда // расхождений не найдено
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
			ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("Описание", "Расхождений не найдено"));
		Возврат;
	КонецЕсли;
	
	// добавим новые записи
	НаборДивидендыПоАкциям = РегистрыСведений.ДивидендыПоАкциям.СоздатьНаборЗаписей();
	
	Расхождения = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаРасхождения Из Расхождения Цикл
		Если СтрокаРасхождения.НоваяЗапись ИЛИ СтрокаРасхождения.ИзмененнаяЗапись Тогда
			ЗаписьДивидендыПоАкциям = РегистрыСведений.ДивидендыПоАкциям.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ЗаписьДивидендыПоАкциям, СтрокаРасхождения);
			ЗаписьДивидендыПоАкциям.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ИмпортироватьДивидендыПоАкциям

////////////////////////////////////////////////////////////////////////////////

Функция ДатаИзСтрокиГГГГММДД(Знач СтрокаГГГГММДД, Разделитель = ".")
	
	Возврат Дата(СтрЗаменить(СтрокаГГГГММДД, Разделитель, ""));
	
КонецФункции // ДатаИзСтрокиГГГГММДД

Функция ЧислоИзСтроки(Знач ЧислоСтр)
	
	Если ПустаяСтрока(ЧислоСтр) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Лев(ЧислоСтр, 1) = "." Тогда
		ЧислоСтр = "0" + ЧислоСтр;
	КонецЕсли;
	
	Возврат Число(ЧислоСтр);
	
КонецФункции // ЧислоИзСтроки

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки) Экспорт
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(ЭтотОбъект, ИмяКоманды);
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
КонецПроцедуры

#КонецОбласти