
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РеквизитыПлатежа") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.РеквизитыПлатежа);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, ЮрФизЛицо, Дата");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРеквизиты(Команда)
	
	РезультатВыбора = Новый Структура("БИК, НаименованиеБанка, КоррСчет, НомерСчета, ПолучательПлатежа, ИННПолучателя, ЛицевойСчет, НазначениеПлатежа, РасчетныйСчет, СозданДокументом");
	ЗаполнитьЗначенияСвойств(РезультатВыбора, ЭтотОбъект);
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБанковскиеРеквизиты(БИК, Период)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Банки.Ссылка КАК Банк,
	|	ЕСТЬNULL(РеквизитыБанковСрезПоследних.Наименование, Банки.Наименование) КАК НаименованиеБанка,
	|	ЕСТЬNULL(РеквизитыБанковСрезПоследних.КоррСчет, Банки.КоррСчет) КАК КоррСчет
	|ИЗ
	|	Справочник.Банки КАК Банки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыБанков.СрезПоследних(&Период, ) КАК РеквизитыБанковСрезПоследних
	|		ПО (РеквизитыБанковСрезПоследних.Банк = Банки.Ссылка)
	|ГДЕ
	|	Банки.Код = &Код
	|	И Банки.ЭтоГруппа = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Код", БИК);
	
	Результат = Новый Структура("Банк, НаименованиеБанка, КоррСчет");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	
	БанковскиеРеквизиты = ПолучитьБанковскиеРеквизиты(БИК, Дата);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, БанковскиеРеквизиты);
	
	Если Не ПустаяСтрока(БИК) и Не ЗначениеЗаполнено(БанковскиеРеквизиты.Банк) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден банк по БИК " + БИК, , "БИК");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыСчета(Знач НомерСчета, Знач БИК, Знач Организация)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет,
	|	БанковскиеСчета.Банк.Наименование КАК НаименованиеБанка,
	|	БанковскиеСчета.Ссылка КАК РасчетныйСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Организация = &Организация
	|	И БанковскиеСчета.НомерСчета = &НомерСчета
	|	И &Код В(БанковскиеСчета.Банк.Код, """")");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НомерСчета",  НомерСчета);
	Запрос.УстановитьПараметр("Код",         БИК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РеквизитыСчета = Новый Структура("БИК,КоррСчет,НаименованиеБанка,Валюта,РасчетныйСчет");
		ЗаполнитьЗначенияСвойств(РеквизитыСчета, Выборка);
		
		Возврат РеквизитыСчета;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВалютуПоНомеруСчета(Знач НомерСчета)
	Возврат Справочники.БанковскиеСчета.ПолучитьВалютуПоНомеруСчета(НомерСчета);
КонецФункции

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	Если Не ПустаяСтрока(НомерСчета) Тогда
		
		РеквизитыСчета = ПолучитьРеквизитыСчета(НомерСчета, БИК, Организация);
		
		Если РеквизитыСчета <> Неопределено Тогда
			
			Если СозданДокументом Тогда
				ИсключаемыеСвойства = "РасчетныйСчет";
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСчета,, ИсключаемыеСвойства);
			
		Иначе
			
			Если Не СозданДокументом Тогда
				РасчетныйСчет = Неопределено;
			КонецЕсли;
			
			Валюта = ПолучитьВалютуПоНомеруСчета(НомерСчета);
			
			Если СтрДлина(НомерСчета) >= 20 и Не ЗначениеЗаполнено(Валюта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена валюта с кодом " + Сред(НомерСчета, 6, 3), , "НомерСчета");	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если СистемныеФункции.СсылкаСуществует(РасчетныйСчет) Тогда
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаОбъекта", Новый Структура("Ключ", РасчетныйСчет), Элемент);
	Иначе
		ПоказатьПредупреждение(,"Банковский счет не создан");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ОткрытьФорму("Справочник.БанковскиеСчета.Форма.ФормаВыбораСчетаКлиента", Новый Структура("Организация, ЮрФизЛицо", Организация, ЮрФизЛицо), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		Если ВыбранноеЗначение <> РасчетныйСчет Тогда
			СозданДокументом = Ложь;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПолучитьРеквизитыПлатежа(Организация, ЮрФизЛицо, ВыбранноеЗначение, Дата));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыПлатежа(Знач Организация, Знач ЮрФизЛицо, РасчетныйСчет, Период)
	
	Возврат Справочники.БанковскиеСчета.ПолучитьРеквизитыПлатежа(Организация, ЮрФизЛицо, РасчетныйСчет, Период);
	
КонецФункции
