
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Объект.Ссылка);
		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СтатусыЛицензийСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыЛицензий.СрезПоследних(&Период, Лицензия = &Лицензия) КАК СтатусыЛицензийСрезПоследних";
		
	Запрос.УстановитьПараметр("Период"	, ТекущаяДата());
	Запрос.УстановитьПараметр("Лицензия", ТекущийОбъект.Ссылка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтаФорма.Статус = Выборка.Статус;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДеятельностиПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокСсылкиОбновить(ЭтаФорма, Объект.Ссылка);
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры
