
//Получает массив доступных стратегий для счёта ду или вида договора ду
Функция ПолучитьМассивДоступныхСтратегий(Источник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", Источник);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК Ссылка
		|ПОМЕСТИТЬ _ВидыДоговоров
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &Источник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыДоговоровДоверительногоУправления.Ссылка
		|ИЗ
		|	Перечисление.ВидыДоговоровДоверительногоУправления КАК ВидыДоговоровДоверительногоУправления
		|ГДЕ
		|	ВидыДоговоровДоверительногоУправления.Ссылка = &Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестирования.Ссылка КАК Стратегия
		|ИЗ
		|	Справочник.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|ГДЕ
		|	НЕ СтратегииИндивидуальногоИнвестирования.ПометкаУдаления
		|	И (НЕ СтратегииИндивидуальногоИнвестирования.Стандартная
		|			ИЛИ СтратегииИндивидуальногоИнвестирования.ВидДоговораДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_ВидыДоговоров.Ссылка
		|				ИЗ
		|					_ВидыДоговоров КАК _ВидыДоговоров))";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Стратегия");
	
КонецФункции