
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	УстановитьЗаголовкиИДоступностьСубконтоЕПС(ЭтаФорма, Объект.Организация, Объект.КоррСчетЕПС);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
	
	Объект.КоррСчет = ПланыСчетов.Основной.ПрочиеРасходы;
	Объект.Субконто1 = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ПрекращениеПризнанияОблигацииКорп"); // как-бы госы не банкротятся
	Объект.Субконто3 = Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается; // обращающиеся не списываем
	
	Объект.КоррСчетЕПС = ПланыСчетов.Единый.ВыбытиеИРеализация10;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Объект.ВыбытиеПоБУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиБухгалтерскийУчет");
	Объект.ВыбытиеПоНУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиНалоговыйУчет");
	Объект.ВыбытиеПоЕПС = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиЕдиныйБухгалтерскийУчет");
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура РынокПриИзменении(Элемент)

	Элементы["ЦеннаяБумага"].ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["Субконто" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетЕПСПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоЕПС(ЭтаФорма, Объект.Организация, Объект.КоррСчетЕПС);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["СубконтоЕПС" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	
	Если Объект.КоррСчет = ПредопределенноеЗначение("ПланСчетов.Основной.ПрочиеРасходы") Тогда
		Объект.Субконто2 = Объект.ЦеннаяБумага;
	КонецЕсли;
	
	Если Объект.КоррСчетЕПС = ПредопределенноеЗначение("ПланСчетов.Единый.ВыбытиеИРеализация10") Тогда
		Объект.СубконтоЕПС1 = Объект.ЦеннаяБумага;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеПоБУПриИзменении(Элемент)
	
	ПриИзмененииВидовУчета();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеПоНУПриИзменении(Элемент)
	
	ПриИзмененииВидовУчета();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеПоЕПСПриИзменении(Элемент)
	
	ПриИзмененииВидовУчета();
	УправлениеВидимостью();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриИзмененииВидовУчета()

	Если НЕ Объект.ВыбытиеПоБУ И НЕ Объект.ВыбытиеПоНУ Тогда // почистим КорСчет
	
		Объект.КоррСчет = ПредопределенноеЗначение("ПланСчетов.Основной.ПустаяСсылка");	
		Объект.Субконто1 = Неопределено;
		Объект.Субконто2 = Неопределено;
		Объект.Субконто3 = Неопределено;
	
	КонецЕсли;
	
	Если НЕ Объект.ВыбытиеПоЕПС Тогда // почистим КорСчетЕПС
	
		Объект.КоррСчетЕПС = ПредопределенноеЗначение("ПланСчетов.Единый.ПустаяСсылка");	
		Объект.СубконтоЕПС1 = Неопределено;
		Объект.СубконтоЕПС2 = Неопределено;
		Объект.СубконтоЕПС3 = Неопределено;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()

	ВестиБУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиБухгалтерскийУчет");
	ВестиНУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиНалоговыйУчет");
	ВестиЕПС = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиЕдиныйБухгалтерскийУчет");
	
	ЭтаФорма.Элементы.ВыбытиеПоБУ.Доступность = ВестиБУ;
	ЭтаФорма.Элементы.ВыбытиеПоНУ.Доступность = ВестиНУ;
	ЭтаФорма.Элементы.ВыбытиеПоЕПС.Доступность = ВестиЕПС;
	
	ЭтаФорма.Элементы.ГруппаСчет.Видимость = Объект.ВыбытиеПоБУ ИЛИ Объект.ВыбытиеПоНУ;
	ЭтаФорма.Элементы.ГруппаСчетЕПС.Видимость = Объект.ВыбытиеПоЕПС;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто1",
		"Субконто2",
		"Субконто3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЕПС(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоЕПС1",
		"СубконтоЕПС2",
		"СубконтоЕПС3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

