
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	
	СтрТекстЗапроса = ЗаписьОбъект.ТекстЗапроса.Получить();
	
	Если РаботаСоСтрокамиКлиентСервер.ЭтоJSON(СтрТекстЗапроса) Тогда
		ЭтаФорма.ТекстЗапроса.ДобавитьСтроку(РаботаСоСтрокамиКлиентСервер.ФорматСтрокиJSON(СтрТекстЗапроса));
	Иначе
		ЭтаФорма.ТекстЗапроса.ДобавитьСтроку(СтрТекстЗапроса);
	КонецЕсли;
	
	СтрТекстОтвета = ЗаписьОбъект.ТекстОтвета.Получить();
	
	Если РаботаСоСтрокамиКлиентСервер.ЭтоJSON(СтрТекстОтвета) Тогда
		ЭтаФорма.ТекстОтвета.ДобавитьСтроку(РаботаСоСтрокамиКлиентСервер.ФорматСтрокиJSON(СтрТекстОтвета));
	Иначе
		ЭтаФорма.ТекстОтвета.ДобавитьСтроку(СтрТекстОтвета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтрТекстЗапроса = ЭтаФорма.ТекстЗапроса.ПолучитьТекст();
	
	Если РаботаСоСтрокамиКлиентСервер.ЭтоJSON(СтрТекстЗапроса) Тогда
		СтрТекстЗапроса = СтрЗаменить(СтрТекстЗапроса, Символы.Таб	, "");
		СтрТекстЗапроса = СтрЗаменить(СтрТекстЗапроса, Символы.ПС	, "");
	КонецЕсли;
	
	ТекущийОбъект.ТекстЗапроса	= Новый ХранилищеЗначения(СтрТекстЗапроса, Новый СжатиеДанных(9));
	
	
	СтрТекстОтвета = ЭтаФорма.ТекстОтвета.ПолучитьТекст();
	
	Если РаботаСоСтрокамиКлиентСервер.ЭтоJSON(СтрТекстОтвета) Тогда
		СтрТекстОтвета = СтрЗаменить(СтрТекстОтвета, Символы.Таб, "");
		СтрТекстОтвета = СтрЗаменить(СтрТекстОтвета, Символы.ПС	, "");
	КонецЕсли;
	
	ТекущийОбъект.ТекстОтвета	= Новый ХранилищеЗначения(СтрТекстОтвета, Новый СжатиеДанных(9));
	
КонецПроцедуры