// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет по брокерам",
		"0.9",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаАктивыДУ			= Макет.ПолучитьОбласть("ШапкаАктивыДУ");
	ОбластьСтрокаБрокер         	= Макет.ПолучитьОбласть("СтрокаБрокер");
	ОбластьСтрокаСчетДУ             = Макет.ПолучитьОбласть("СтрокаСчетДУ");
	ОбластьСтрокаПереводДС          = Макет.ПолучитьОбласть("СтрокаПереводДС");
	ОбластьСтрокаКомиссии           = Макет.ПолучитьОбласть("СтрокаКомиссии");	
	ОбластьЗаголовокРаздела         = Макет.ПолучитьОбласть("ЗаголовокРаздела");
	ОбластьИтого                    = Макет.ПолучитьОбласть("СтрокаИтого");
	ОбластьПодвалТаблицы            = Макет.ПолучитьОбласть("ПодвалТаблицы");
	//ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");
	
	ПараметрыШапки = ПолучитьПараметрыШапки();

	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаНачала    = Формат(ПараметрыШапки.ДатаНачала, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаОкончания = Формат(ПараметрыШапки.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	РезультатЗапроса = ПолучитьВыборкуДанных();
	
	Выборка_ОборотыОбщие		   = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Таблица_ОборотыПоКомиссиям     = РезультатЗапроса[1].Выгрузить();
	Таблица_ОборотыПоПереводамДС   = РезультатЗапроса[2].Выгрузить();
	
	// Общие итоги
	ИтогоСуммаОборотов = 0;
	Если Выборка_ОборотыОбщие.Количество() > 0 Тогда 
		Выборка_ОборотыОбщие.Следующий();
		ИтогоСуммаОборотов = Выборка_ОборотыОбщие.Сумма;
	КонецЕсли;
	
	Выборка_ОборотыПоВидамСчетовДУ = Выборка_ОборотыОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка_ОборотыПоВидамСчетовДУ.Следующий() Цикл
		
		Если Выборка_ОборотыПоВидамСчетовДУ.ВидДоговора = "ДУ" Тогда
			ОбластьЗаголовокРаздела.Параметры.ЗаголовокРаздела = "";
			ДокументРезультат.Вывести(ОбластьЗаголовокРаздела);
			ДокументРезультат.Вывести(ОбластьШапкаАктивыДУ);
		КонецЕсли;
			
		Выборка_ОборотыПоБрокерам = Выборка_ОборотыПоВидамСчетовДУ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка_ОборотыПоБрокерам.Следующий() Цикл
			
			ОбластьСтрокаБрокер.Параметры.Заполнить(Выборка_ОборотыПоБрокерам);
			ОбластьСтрокаБрокер.Параметры.Сумма = Окр(Выборка_ОборотыПоБрокерам.Сумма / 1000000, 2, 1);
			ОбластьСтрокаБрокер.Параметры.Доля  = Окр(Выборка_ОборотыПоБрокерам.Сумма / ИтогоСуммаОборотов * 100, 2, 1);
			ДокументРезультат.Вывести(ОбластьСтрокаБрокер);
			
			ДокументРезультат.НачатьГруппуСтрок();
			Выборка_ОборотыПоСчетамДУ = Выборка_ОборотыПоБрокерам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка_ОборотыПоСчетамДУ.Следующий() Цикл
				Если Выборка_ОборотыПоСчетамДУ.Сумма = 0 Тогда 
					Продолжить;
				КонецЕсли;
				ОбластьСтрокаСчетДУ.Параметры.Заполнить(Выборка_ОборотыПоСчетамДУ);
				ОбластьСтрокаСчетДУ.Параметры.Сумма = Окр(Выборка_ОборотыПоСчетамДУ.Сумма / 1000000, 2, 1);
				ОбластьСтрокаСчетДУ.Параметры.Доля  = Окр(Выборка_ОборотыПоСчетамДУ.Сумма / ИтогоСуммаОборотов * 100, 2, 1);
				ДокументРезультат.Вывести(ОбластьСтрокаСчетДУ);
			КонецЦикла;
			
			ДокументРезультат.ЗакончитьГруппуСтрок(); 
			
			ОбластьЗаголовокРаздела.Параметры.ЗаголовокРаздела = "Переводы денежных средств";
			ДокументРезультат.Вывести(ОбластьЗаголовокРаздела);
			
			НайдСтроки = Таблица_ОборотыПоПереводамДС.НайтиСтроки(Новый Структура("Брокер, ВидДоговора", Выборка_ОборотыПоБрокерам.Брокер, Выборка_ОборотыПоВидамСчетовДУ.ВидДоговора));
			Если НайдСтроки.Количество() > 0 Тогда
				
				ДокументРезультат.НачатьГруппуСтрок();
				Для Каждого НайдСтрока Из НайдСтроки Цикл
					ОбластьСтрокаПереводДС.Параметры.Заполнить(НайдСтрока);
					ОбластьСтрокаПереводДС.Параметры.Сумма = Окр(НайдСтрока.Сумма / 1000000, 2, 1);
					ДокументРезультат.Вывести(ОбластьСтрокаПереводДС);
				КонецЦикла;
				ДокументРезультат.ЗакончитьГруппуСтрок(); 
				
			КонецЕсли;
			
			ОбластьЗаголовокРаздела.Параметры.ЗаголовокРаздела = "Комиссии";
			ДокументРезультат.Вывести(ОбластьЗаголовокРаздела);
			
			НайдСтроки = Таблица_ОборотыПоКомиссиям.НайтиСтроки(Новый Структура("Брокер, ВидДоговора", Выборка_ОборотыПоБрокерам.Брокер.ЮрФизЛицо, Выборка_ОборотыПоВидамСчетовДУ.ВидДоговора));
			Если НайдСтроки.Количество() > 0 Тогда
				
				ДокументРезультат.НачатьГруппуСтрок();
				Для Каждого НайдСтрока Из НайдСтроки Цикл
					ОбластьСтрокаКомиссии.Параметры.Заполнить(НайдСтрока);
					ОбластьСтрокаКомиссии.Параметры.Сумма = Окр(НайдСтрока.Сумма / 1000000, 2, 1);
					ДокументРезультат.Вывести(ОбластьСтрокаКомиссии);
				КонецЦикла;
				ДокументРезультат.ЗакончитьГруппуСтрок(); 
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;
	
	ДокументРезультат.Вывести(ОбластьПодвалТаблицы);
	
	//СтруктураДанныхКонтактногоЛица = Неопределено;
	//КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	//
	//ПараметрыВыводаПодписей = Новый Структура;
	//ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	//ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	//
	//Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	//
	//	ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
	//	ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
	//	ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	//
	//КонецЕсли; 
	//
	//РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);

	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	&НачалоПериода КАК ДатаНачала,
		|	&КонецПериода КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&КонецПериода,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации";
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ЮрФизЛицо", 	   ЭтотОбъект.Организация.ЮрФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьВыборкуДанных()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ОперацииСЦеннымиБумагами.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
	|			ТОГДА ""Собственный""
	|		ИНАЧЕ ""ДУ""
	|	КОНЕЦ КАК ВидДоговора,
	|	ОперацииСЦеннымиБумагами.Регистратор.Брокер КАК РегистраторБрокер,
	|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	СУММА(ВЫБОР
	|			КОГДА (ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Сделка)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СделкаРЕПО))
	|					И НЕ ОперацииСЦеннымиБумагами.Регистратор.ОтложенноеИсполнение
	|				ТОГДА (ОперацииСЦеннымиБумагами.Сумма + ОперацииСЦеннымиБумагами.СуммаКупона) * КурсыВалют.Курс
	|			КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.ПоставкаЦенныхБумаг)
	|				ТОГДА (ОперацииСЦеннымиБумагами.Сумма + ОперацииСЦеннымиБумагами.СуммаКупона) * КурсыВалют.Курс
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ _ОборотыПоСчетамДУ
	|ИЗ
	|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериодаДата, ) КАК КурсыВалют
	|		ПО ОперацииСЦеннымиБумагами.Валюта = КурсыВалют.Валюта
	|ГДЕ
	|	ОперацииСЦеннымиБумагами.Организация = &Организация
	|	И ОперацииСЦеннымиБумагами.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И ОперацииСЦеннымиБумагами.Активность
	|	И НЕ(ОперацииСЦеннымиБумагами.Регистратор.Брокер ЕСТЬ NULL
	|				ИЛИ ОперацииСЦеннымиБумагами.Регистратор.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ОперацииСЦеннымиБумагами.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
	|			ТОГДА ""Собственный""
	|		ИНАЧЕ ""ДУ""
	|	КОНЕЦ,
	|	ОперацииСЦеннымиБумагами.Регистратор.Брокер,
	|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
	|			ТОГДА ""Собственный""
	|		ИНАЧЕ ""ДУ""
	|	КОНЕЦ КАК ВидДоговора,
	|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности КАК ВидЗадолженности,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Контрагент КАК Брокер,
	|	СУММА((ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход + ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаРасход) * КурсыВалют.Курс) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериодаДата, ) КАК КурсыВалют
	|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Валюта = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
	|			ТОГДА ""Собственный""
	|		ИНАЧЕ ""ДУ""
	|	КОНЕЦ,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Контрагент,
	|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДоговора УБЫВ,
	|	Брокер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ОстаткиДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
	|			ТОГДА ""Собственный""
	|		ИНАЧЕ ""ДУ""
	|	КОНЕЦ КАК ВидДоговора,
	|	ОстаткиДенежныхСредств.Брокер КАК Брокер,
	|	СУММА(ОстаткиДенежныхСредств.Сумма * КурсыВалют.Курс) КАК Сумма,
	|	ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
	|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК ВариантДвиженияДенежныхСредств
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериодаДата, ) КАК КурсыВалют
	|		ПО ОстаткиДенежныхСредств.Валюта = КурсыВалют.Валюта
	|ГДЕ
	|	ОстаткиДенежныхСредств.Организация = &Организация
	|	И ОстаткиДенежныхСредств.Активность = ИСТИНА
	|	И ОстаткиДенежныхСредств.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
	|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.СоСчетаБрокераНаРасчетныйСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.СРасчетногоСчетаНаСчетБрокера))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ОстаткиДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
	|			ТОГДА ""Собственный""
	|		ИНАЧЕ ""ДУ""
	|	КОНЕЦ,
	|	ОстаткиДенежныхСредств.Брокер,
	|	ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств,
	|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДоговора УБЫВ,
	|	Брокер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОборотыПоСчетамДУ.ВидДоговора КАК ВидДоговора,
	|	_ОборотыПоСчетамДУ.РегистраторБрокер КАК Брокер,
	|	_ОборотыПоСчетамДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ОборотыПоСчетамДУ.Сумма КАК Сумма
	|ИЗ
	|	_ОборотыПоСчетамДУ КАК _ОборотыПоСчетамДУ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДоговора УБЫВ,
	|	Брокер,
	|	СчетДоверительногоУправления
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	ВидДоговора,
	|	Брокер,
	|	СчетДоверительногоУправления
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	//Запрос.УстановитьПараметр("Биржа", 			ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Запрос.УстановитьПараметр("Организация",  		ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", 		ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 		Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериодаДата",	КонецДня(ЭтотОбъект.Период.ДатаОкончания));
		
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции // ПолучитьВыборкуДанных()	
