
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЗаявкаПайщика", ЗаявкаПайщика);
	
	Если ЗначениеЗаполнено(ЗаявкаПайщика) Тогда
		Элементы.ЗаявкаПайщика.Видимость = Ложь;	
	КонецЕсли;

	Язык = Справочники.Языки.Русский;
	Подразделение = Справочники.Подразделения.ГруппаКомпаний;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипСчетаВладельца(ВидПайщика)
	
	Если ВидПайщика = Перечисления.ВидыПайщиков.Владелец Тогда
		Возврат "Лицевой счет владельца ценных бумаг";
	ИначеЕсли ВидПайщика = Перечисления.ВидыПайщиков.ДоверительныйУправляющий Тогда
		Возврат "Лицевой счет доверительного управляющего";
	ИначеЕсли ВидПайщика = Перечисления.ВидыПайщиков.НоминальныйДержатель Тогда
		Возврат "Лицевой счет номинального держателя";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСобственностьВладенияПаями(ВидСобственности)
	
	Если ВидСобственности = Перечисления.ВидыСобственности.НеДолеваяНеСовместная Тогда
		Возврат "Не является долевой или совместной";
	ИначеЕсли ВидСобственности = Перечисления.ВидыСобственности.Совместная Тогда
		Возврат "На праве совместной собственности";
	ИначеЕсли ВидСобственности = Перечисления.ВидыСобственности.Долевая Тогда
		Возврат "На праве общей долевой собственности";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьБанковскиеРеквизиты()
	
	БанковскиеРеквизиты = СокрЛП(ЗаявкаПайщика.ПолучательПлатежа) 
			+ ", в банке " + СокрЛП(ЗаявкаПайщика.НаименованиеБанка)	
			+ ", БИК " + СокрЛП(ЗаявкаПайщика.БИК)	
			+ ", ИНН " + СокрЛП(ЗаявкаПайщика.ИННПолучателя)	
			+ ", к/с " + СокрЛП(ЗаявкаПайщика.КоррСчет)	
			+ ", р/с " + СокрЛП(ЗаявкаПайщика.НомерСчета)
			+ ?(ПустаяСтрока(ЗаявкаПайщика.ЛицевойСчет), "", ", л/с " + СокрЛП(ЗаявкаПайщика.ЛицевойСчет));
	
	Возврат БанковскиеРеквизиты;
	
КонецФункции

&НаСервере
Процедура ДобавитьДанныеДляПечатиЗаявкиНаЛицевойСчет(ДанныеДляПечати)
		
	Если ЗаявкаПайщика.Пайщик.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		ДанныеДляПечати.Вставить("НаименованиеЛица",      ДанныеДляПечати.ФИО);	
		ДанныеДляПечати.Вставить("НаименованиеДокумента", Строка(ДанныеДляПечати.ВидУдостоверенияЛичности));	
		
		ДанныеДляПечати.Вставить("ОписаниеДокумента",     ДанныеДляПечати.СерияУдостоверенияЛичности 
														  	+ ", " + ДанныеДляПечати.НомерУдостоверенияЛичности);	
															
		ДанныеДляПечати.Вставить("ОрганВыдавшийДокумент", ДанныеДляПечати.ОрганВыдавшийУдостоверениеЛичности 
															+ ", " + Формат(ДанныеДляПечати.ДатаВыдачиУдостоверенияЛичности, "ДФ=dd.MM.yyyy")
															+ ", " + ДанныеДляПечати.КодОрганаВыдавшегоУдостоверениеЛичности);	
	Иначе
		
		ДанныеДляПечати.Вставить("НаименованиеЛица", ДанныеДляПечати.ПолноеНаименованиеПоУставу);
		ДанныеДляПечати.Вставить("НаименованиеДокумента", "свидетельство о регистрации");	
		
		ДанныеДляПечати.Вставить("ОписаниеДокумента",     ДанныеДляПечати.ОГРН);	
															
		ДанныеДляПечати.Вставить("ОрганВыдавшийДокумент", Строка(ДанныеДляПечати.ОрганВыдавшийОГРН)
															+ ", " + Формат(ДанныеДляПечати.ДатаВыдачиОГРН, "ДФ=dd.MM.yyyy"));	
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ТипВладельцаСчета",  ПолучитьТипСчетаВладельца(ЗаявкаПайщика.ВидПайщика));
	ДанныеДляПечати.Вставить("СобственностьНаПаи", ПолучитьСобственностьВладенияПаями(ЗаявкаПайщика.СобственностьНаПаи));

	ДанныеДляПечати.Вставить("Дата", Формат(ЗаявкаПайщика.Дата, "ДФ='dd MMMM yyyy ''г.'''"));
	
	Если ЗначениеЗаполнено(ЗаявкаПайщика.ДепозитарныйСчет) Тогда
		Депозитарий = ЗаявкаПайщика.ДепозитарныйСчет.Депозитарий;
	Иначе
		СчетДУ = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЗаявкаПайщика.ПаевойИнвестиционныйФонд);
		Если ЗначениеЗаполнено(СчетДУ) Тогда
			Депозитарий = СчетДУ.СпециализированныйДепозитарий;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДепозитарийЮрЛицо = Депозитарий.ЮрФизЛицо;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",				ЗаявкаПайщика.Дата);
	Запрос.УстановитьПараметр("Депозитарий",		Депозитарий);
	Запрос.УстановитьПараметр("ДепозитарийЮрЛицо",	ДепозитарийЮрЛицо);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Наименование,
	|	Лицензии.Номер КАК ЛицензияНомер,
	|	Лицензии.ДатаВыдачи КАК ЛицензияДатаВыдачи,
	|	Лицензии.ОрганВыдавшийЛицензию КАК ЛицензияОрганВыдавшийЛицензию,
	|	КонтактнаяИнформацияСрезПоследнихАдрес.Представление КАК Адрес,
	|	ЗначенияДополнительныхСведений.Значение КАК ЭлПочта,
	|	КонтактнаяИнформацияСрезПоследнихТелефон.Представление КАК Телефон
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|			&Период,
	|			ЮрФизЛицо = &ДепозитарийЮрЛицо
	|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Лицензии КАК Лицензии
	|		ПО (ИСТИНА)
	|			И (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Период,
	|				Объект = &ДепозитарийЮрЛицо
	|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Телефон)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК КонтактнаяИнформацияСрезПоследнихТелефон
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	|		ПО (ИСТИНА),
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&Период,
	|			Объект = &ДепозитарийЮрЛицо
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)
	|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК КонтактнаяИнформацияСрезПоследнихАдрес
	|ГДЕ
	|	Лицензии.ЮрФизЛицо = &ДепозитарийЮрЛицо
	|	И Лицензии.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиВКачествеСпециализированногоДепозитарияИнвестиционныхФондовИПИФ)
	|	И ЗначенияДополнительныхСведений.Свойство.Ключ = ""Обработка.ПечатьЗаявокПайщиков.EmailСпецдепозитария""
	|	И ЗначенияДополнительныхСведений.Объект = &Депозитарий";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеДляПечати.Вставить("ДепозитарийНаименование",						Выборка.Наименование);
		ДанныеДляПечати.Вставить("ДепозитарийЛицензияНомер",					Выборка.ЛицензияНомер);
		ДанныеДляПечати.Вставить("ДепозитарийЛицензияДатаВыдачи",				Формат(Выборка.ЛицензияДатаВыдачи, "ДФ='dd.MM.yyyy ''г.'''"));
		ДанныеДляПечати.Вставить("ДепозитарийЛицензияОрганВыдавшийЛицензию",	Выборка.ЛицензияОрганВыдавшийЛицензию);
		ДанныеДляПечати.Вставить("ДепозитарийАдрес",							Выборка.Адрес);
		ДанныеДляПечати.Вставить("ДепозитарийТелефон",							Выборка.Телефон);
		ДанныеДляПечати.Вставить("ДепозитарийЭлПочта",							Выборка.ЭлПочта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеДанныеДляПечатиЗаявкиПайщика(ДанныеДляПечати)
		
	ДанныеДляПечати.Вставить("НомерЗаявки", ЗаявкаПайщика.НомерЗаявки);
	ДанныеДляПечати.Вставить("ДатаЗаявки",  Формат(ЗаявкаПайщика.Дата, "ДФ=dd.MM.yyyy"));
	ДанныеДляПечати.Вставить("ВремяЗаявки", Формат(ЗаявкаПайщика.Дата, "ДФ=HH:mm:ss"));
	
	ДанныеДляПечати.Вставить("НомерЛицевогоСчета", ЗаявкаПайщика.ДепозитарныйСчет.НомерСчета);
	
	Если ЗаявкаПайщика.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		
		Если ЗаявкаПайщика.Сумма = 0 Тогда
			ДанныеДляПечати.Вставить("Сумма", 					"   ----------  ");
			ДанныеДляПечати.Вставить("СуммаПрописьюБезКопеек",  "   ---------------------  ");
			ДанныеДляПечати.Вставить("Копейки", 				"00");
		Иначе
			ДанныеДляПечати.Вставить("Сумма", 					Формат(ЗаявкаПайщика.Сумма, "ЧДЦ=2"));
			ДанныеДляПечати.Вставить("СуммаПрописьюБезКопеек",  ЧислоПрописью(Цел(ЗаявкаПайщика.Сумма), "Л = ru", ",,,,,,,,0"));
			ДанныеДляПечати.Вставить("Копейки", 				Формат(100*(ЗаявкаПайщика.Сумма % 1), "ЧН=00"));
		КонецЕсли;
		
	Иначе
		ДанныеДляПечати.Вставить("Количество", ЗаявкаПайщика.Количество);
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("БанковскиеРеквизиты", ПолучитьБанковскиеРеквизиты());
			
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПечатиЮрФизЛица(ЮрФизЛицоДляПечати, Отказ)
	
	Если ЮрФизЛицоДляПечати.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		ДанныеДляПечати = ПолучитьДанныеДляПечатиФизЛица(ЮрФизЛицоДляПечати, Отказ);	
	ИначеЕсли ЮрФизЛицоДляПечати.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		ДанныеДляПечати = ПолучитьДанныеДляПечатиЮрЛица(ЮрФизЛицоДляПечати, Отказ);	
	КонецЕсли;
		
	Возврат ДанныеДляПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляПечатиФизЛица(ЮрФизЛицоДляПечати, Отказ)
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	РеквизитыФизическихЛицСрезПоследних.Имя КАК Имя,
	|	РеквизитыФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	РеквизитыФизическихЛицСрезПоследних.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
	|	РеквизитыФизическихЛицСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
	|	РеквизитыФизическихЛицСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
	|	РеквизитыФизическихЛицСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
	|	РеквизитыФизическихЛицСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийУдостоверениеЛичности,
	|	РеквизитыФизическихЛицСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности
	|ИЗ
	|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|				,
	|				ЮрФизЛицо = &ЮрФизЛицо
	|					И Организация = &Организация
	|					И Язык = &Язык) КАК РеквизитыФизическихЛицСрезПоследних");
	
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицоДляПечати);
	Запрос.УстановитьПараметр("Организация", ЗаявкаПайщика.Организация);
	Запрос.УстановитьПараметр("Язык", Язык);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДанныеДляПечати = Новый Структура;
	Для каждого Колонка из Результат.Колонки Цикл
		ДанныеДляПечати.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляПечати, Выборка);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружена анкета физ. лица: " + ЮрФизЛицоДляПечати,,,, Отказ);
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ФИО", "" + ДанныеДляПечати.Фамилия + " " + ДанныеДляПечати.Имя + " " + ДанныеДляПечати.Отчество);
	
	ДанныеДляПечати.Вставить("УдостоверениеЛичности", 
		Строка(ДанныеДляПечати.ВидУдостоверенияЛичности)
		+ ", " + ДанныеДляПечати.СерияУдостоверенияЛичности
		+ ", " + ДанныеДляПечати.НомерУдостоверенияЛичности
		+ ", " + ДанныеДляПечати.ОрганВыдавшийУдостоверениеЛичности
		+ ", " + Формат(ДанныеДляПечати.ДатаВыдачиУдостоверенияЛичности, "ДФ=dd.MM.yyyy")
		+ ", " + ДанныеДляПечати.КодОрганаВыдавшегоУдостоверениеЛичности
		);
		
	Возврат ДанныеДляПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляПечатиЮрЛица(ЮрФизЛицоДляПечати, Отказ)
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследнихГоловнойОрганизации.ОГРН, РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН) КАК ОГРН,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследнихГоловнойОрганизации.ДатаВыдачиОГРН, РеквизитыЮридическихЛицАнкетныеСрезПоследних.ДатаВыдачиОГРН) КАК ДатаВыдачиОГРН,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследнихГоловнойОрганизации.ОрганВыдавшийОГРН, РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганВыдавшийОГРН) КАК ОрганВыдавшийОГРН
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|			,
	|			ЮрФизЛицо = &ЮрФизЛицо
	|				И Организация = &Организация
	|				И Язык = &Язык) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				,
	|				ЮрФизЛицо = &ЮрФизЛицоГоловное
	|					И Организация = &Организация
	|					И Язык = &Язык) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследнихГоловнойОрганизации
	|		ПО (ИСТИНА)");
	
	Запрос.УстановитьПараметр("ЮрФизЛицоГоловное", РаботаСНормативноСправочнойИнформацией.ПолучитьГоловнуюОрганизацию(ЮрФизЛицоДляПечати));
	Запрос.УстановитьПараметр("ЮрФизЛицо",   ЮрФизЛицоДляПечати);
	Запрос.УстановитьПараметр("Организация", ЗаявкаПайщика.Организация);
	Запрос.УстановитьПараметр("Язык", Язык);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДанныеДляПечати = Новый Структура;
	Для каждого Колонка из Результат.Колонки Цикл
		ДанныеДляПечати.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляПечати, Выборка);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружена анкета юр. лица: " + ЮрФизЛицоДляПечати,,,, Отказ);
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("НаименованиеОрганизации",   ?(Выборка.ПолноеНаименованиеПоУставу = NULL, "", Выборка.ПолноеНаименованиеПоУставу));
	ДанныеДляПечати.Вставить("СвидетельствоОРегистрации", ?(Выборка.ОГРН = NULL, "", Строка(Выборка.ОГРН)
														+ ", " + Выборка.ОрганВыдавшийОГРН
														+ ", " + Формат(Выборка.ДатаВыдачиОГРН, "ДФ=dd.MM.yyyy")));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

&НаСервере
Процедура ДобавитьДанныеОрганизации(ДанныеДляПечати)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|			,
	|			Подразделение = &Подразделение
	|				И Язык = &Язык
	|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицСрезПоследних");
	
	Запрос.УстановитьПараметр("ЮрФизЛицо",     ЗаявкаПайщика.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Язык", Язык);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеДляПечати.Вставить("НаименованиеУправляющейКомпании", Выборка.ПолноеНаименованиеПоУставу);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеПредставителя(ДанныеДляПечати, Отказ)
	
	ДанныеДляПечати.Вставить("НаименованиеПредставителя");
	ДанныеДляПечати.Вставить("ОснованиеПолномочий");
	
	ДанныеДляПечати.Вставить("УдостоверениеЛичностиПредставителя");
	
	ДанныеДляПечати.Вставить("СвидетельствоОРегистрацииПредставителя");
	ДанныеДляПечати.Вставить("ВЛице");
	ДанныеДляПечати.Вставить("УдостоверениеЛичностиВЛице");
	ДанныеДляПечати.Вставить("ОснованиеПолномочийВЛице");
	
	ДанныеДляПечати.Вставить("ПодписантЗаявитель", " ");
	ДанныеДляПечати.Вставить("ПредставительВЛице");
	ДанныеДляПечати.Вставить("ОснованиеПолномочийПредставителяВЛице");

	Если ЗаявкаПайщика.Представители.Количество() Тогда
		
		Представитель = ЗаявкаПайщика.Представители[0].Представитель;
		ВЛице         = ЗаявкаПайщика.Представители[0].ВЛице;
		
		ОснованиеПолномочий      = ЗаявкаПайщика.Представители[0].ОснованиеПолномочий;
		ОснованиеПолномочийВЛице = ЗаявкаПайщика.Представители[0].ОснованиеПолномочийВЛице;
		
		Если Представитель.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
			
			ДанныеПредставителя = ПолучитьДанныеДляПечатиФизЛица(Представитель, Отказ);
			
			ДанныеДляПечати.Вставить("НаименованиеПредставителя", ДанныеПредставителя.ФИО);
			ДанныеДляПечати.Вставить("ОснованиеПолномочий",       ОснованиеПолномочий);
			
			ДанныеДляПечати.Вставить("УдостоверениеЛичностиПредставителя", ДанныеПредставителя.УдостоверениеЛичности);
			
			ДанныеДляПечати.Вставить("Подписант");
			ДанныеДляПечати.Вставить("ОснованиеПолномочийПодписанта");
			
			ДанныеДляПечати.Вставить("ПодписантЗаявитель", ДанныеПредставителя.ФИО);
			ДанныеДляПечати.Вставить("ПредставительВЛице", ДанныеПредставителя.ФИО);
			ДанныеДляПечати.Вставить("ОснованиеПолномочийПредставителяВЛице", ОснованиеПолномочий);
			
		Иначе
			
			ДанныеПредставителя = ПолучитьДанныеДляПечатиЮрЛица(Представитель, Отказ);
			ДанныеВЛице			= ПолучитьДанныеДляПечатиФизЛица(ВЛице, Отказ);
		
			ДанныеДляПечати.Вставить("НаименованиеПредставителя", ДанныеПредставителя.ПолноеНаименованиеПоУставу);
			ДанныеДляПечати.Вставить("ОснованиеПолномочий",       ОснованиеПолномочий);
			
			ДанныеДляПечати.Вставить("СвидетельствоОРегистрацииПредставителя", ДанныеПредставителя.СвидетельствоОРегистрации);
			
			ДанныеДляПечати.Вставить("ВЛице", ДанныеВЛице.ФИО);
			ДанныеДляПечати.Вставить("УдостоверениеЛичностиВЛице", ДанныеВЛице.УдостоверениеЛичности);
			ДанныеДляПечати.Вставить("ОснованиеПолномочийВЛице",   ОснованиеПолномочийВЛице);
			
			ДанныеДляПечати.Вставить("ПодписантЗаявитель", ДанныеВЛице.ФИО);
			ДанныеДляПечати.Вставить("ПредставительВЛице", ДанныеВЛице.ФИО);
			ДанныеДляПечати.Вставить("ОснованиеПолномочийПредставителяВЛице", ОснованиеПолномочийВЛице);
			
		КонецЕсли;
		
	ИначеЕсли ЗаявкаПайщика.Пайщик.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		ДанныеДляПечати.Вставить("ПодписантЗаявитель", ДанныеДляПечати.ФИО);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеВладельца(ДанныеДляПечати, Отказ)
	
	ДанныеДляПечати.Вставить("НаименованиеВладельца");
	ДанныеДляПечати.Вставить("ДокументВладельца");
	ДанныеДляПечати.Вставить("НомерСчетаДепоВладельца"	, ЗаявкаПайщика.НомерСчетаДепоВладельца);
	ДанныеДляПечати.Вставить("КоличествоПаевНаСчете"	, ЗаявкаПайщика.КоличествоНаСчетеДепоВладельца);
	
	Если ЗаявкаПайщика.Владелец.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		ДанныеВладельца = ПолучитьДанныеДляПечатиФизЛица(ЗаявкаПайщика.Владелец, Отказ);
		
		ДанныеДляПечати.Вставить("НаименованиеВладельца", ДанныеВладельца.ФИО);
		ДанныеДляПечати.Вставить("ДокументВладельца"	, ДанныеВладельца.УдостоверениеЛичности);
		
	Иначе
		
		ДанныеВладельца = ПолучитьДанныеДляПечатиЮрЛица(ЗаявкаПайщика.Владелец, Отказ);
	
		ДанныеДляПечати.Вставить("НаименованиеВладельца", ДанныеВладельца.ПолноеНаименованиеПоУставу);
		ДанныеДляПечати.Вставить("ДокументВладельца"	, ДанныеВладельца.СвидетельствоОРегистрации);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеПодписанта(ДанныеДляПечати)
	
	ДанныеДляПечати.Вставить("ПодписантУК", "____________");
	
	Если ЗначениеЗаполнено(Подписант) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыСотрудниковОрганизации.Фамилия КАК Фамилия,
		|	РеквизитыСотрудниковОрганизации.Имя КАК Имя,
		|	РеквизитыСотрудниковОрганизации.Отчество КАК Отчество,
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий
		|ИЗ
		|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = &Язык
		|				И ЮрФизЛицо = &Подписант) КАК РеквизитыСотрудниковОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО (КонтактныеЛица.КонтактноеЛицо = РеквизитыСотрудниковОрганизации.ЮрФизЛицо)
		|			И (КонтактныеЛица.Подразделение = &Подразделение)
		|			И (КонтактныеЛица.Язык = &Язык)
		|			И (КонтактныеЛица.Объект = &ОрганизацияЮрФизЛицо)");
		
		Запрос.УстановитьПараметр("Период",        ЗаявкаПайщика.Дата);
		Запрос.УстановитьПараметр("ОрганизацияЮрФизЛицо",   ЗаявкаПайщика.Организация.ЮрФизЛицо);
		Запрос.УстановитьПараметр("Организация",   ЗаявкаПайщика.Организация);
		Запрос.УстановитьПараметр("Подписант", 	   Подписант);
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Язык",          Язык);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ДанныеДляПечати.Вставить("ПодписантУК",
							СокрЛП(Выборка.Должность)
							+ " " + Выборка.Фамилия
							+ Символы.НПП + Лев(Выборка.Имя, 1) + "."
							+ ?(ЗначениеЗаполнено(Выборка.Отчество), Символы.НПП + Лев(Выборка.Отчество, 1) + ".", ""));
							
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеПараметры(ДанныеДляПечати)
	
	Для каждого КлючИЗнач из ДанныеДляПечати Цикл
		
		Если ТипЗнч(КлючИЗнач.Значение) = Тип("ТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КлючИЗнач.Значение) Тогда
			ДанныеДляПечати.Вставить(КлючИЗнач.Ключ, "–"); // Здесь "длинное" тире. Скопировано из Word.
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеДляУведомленияОРеквизитах(ДанныеДляПечати)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _СДУ
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(, ) КАК КлиентыДоверительногоУправленияСрезПоследних
	|ГДЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &ПИФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.НомерСчета КАК НомерСчета,
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.Наименование КАК БанкНаименование,
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.Код КАК БанкБИК,
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.КоррСчет КАК БанкКоррСчет,
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.Город КАК БанкГород
	|ИЗ
	|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
	|ГДЕ
	|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
	|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления В
	|			(ВЫБРАТЬ
	|				_СДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|			ИЗ
	|				_СДУ КАК _СДУ)
	|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.ТранзитныйПИФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеУправляющейКомпании,
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННУправляющейКомпании,
	|	РеквизитыЮридическихЛицСрезПоследних.КПП КАК КППУправляющейКомпании
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|			,
	|			(ЮрФизЛицо, Подразделение, Язык) В
	|				(ВЫБРАТЬ
	|					РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо КАК ЮрФизЛицо,
	|					ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) КАК Подразделение,
	|					ЗНАЧЕНИЕ(Справочник.Языки.Русский) КАК Язык
	|				ИЗ
	|					РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ПаевойИнвестиционныйФонд = &ПИФ) КАК РеквизитыПИФСрезПоследних)) КАК РеквизитыЮридическихЛицСрезПоследних");
	
	Запрос.УстановитьПараметр("ПИФ",			ЗаявкаПайщика.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Организация",	ЗаявкаПайщика.Организация);
	Запрос.УстановитьПараметр("КонецПериода",	ЗаявкаПайщика.Дата);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеДляПечати.Вставить("НомерСчета",			Выборка.НомерСчета);
		ДанныеДляПечати.Вставить("БанкНаименование",	Выборка.БанкНаименование);
		ДанныеДляПечати.Вставить("БанкГород",			Выборка.БанкГород);
		ДанныеДляПечати.Вставить("БанкБИК",				Выборка.БанкБИК);
		ДанныеДляПечати.Вставить("БанкКоррСчет",		Выборка.БанкКоррСчет);
	КонецЕсли;
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеДляПечати.Вставить("КраткоеНаименованиеУправляющейКомпании",	Выборка.КраткоеНаименованиеУправляющейКомпании);
		ДанныеДляПечати.Вставить("ИННУправляющейКомпании",					Выборка.ИННУправляющейКомпании);
		ДанныеДляПечати.Вставить("КППУправляющейКомпании",					Выборка.КППУправляющейКомпании);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПечати(Отказ)
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаПайщика, "Пайщик, ПаевойИнвестиционныйФонд, Дата, НоминальныеДержатели, ВидПайщика, ВидЗаявки, ИсточникЗаявки, Организация");
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатиЮрФизЛица(РеквизитыЗаявки.Пайщик, Отказ);  
	
	РеквизитыПИФ 	= РегистрыСведений.РеквизитыПИФ.ПолучитьРеквизитыПИФ(РеквизитыЗаявки.ПаевойИнвестиционныйФонд, РеквизитыЗаявки.Дата);
	
	ДанныеДляПечати.Вставить("НаименованиеПИФ", РеквизитыПИФ.ПолноеНаименованиеФонда);
	ДанныеДляПечати.Вставить("КраткоеНаименованиеПИФ", РеквизитыПИФ.КраткоеНаименованиеФонда);
	ДанныеДляПечати.Вставить("НоминальныеДержатели", РеквизитыЗаявки.НоминальныеДержатели);
	
	ДобавитьДанныеПредставителя(ДанныеДляПечати, Отказ);
	ДобавитьДанныеОрганизации(ДанныеДляПечати);
	ДобавитьДанныеПодписанта(ДанныеДляПечати);
	ДобавитьДанныеВладельца(ДанныеДляПечати, Отказ);
	
	ДанныеДанныеДляПечатиЗаявкиПайщика(ДанныеДляПечати);
	ДобавитьДанныеДляПечатиЗаявкиНаЛицевойСчет(ДанныеДляПечати);
	ДобавитьДанныеДляУведомленияОРеквизитах(ДанныеДляПечати);
	
	Если РеквизитыЗаявки.ВидПайщика = ПредопределенноеЗначение("Перечисление.ВидыПайщиков.Владелец") Тогда
		ДанныеДляПечати.Вставить("НаименованиеПайщика", ДанныеДляПечати.НаименованиеЛица);
	Иначе
		ДанныеДляПечати.Вставить("НаименованиеПайщика", "<Наименование юр. лица>");
	КонецЕсли;
	
	ЗаполнитьПустыеПараметры(ДанныеДляПечати);
	
	Если РеквизитыЗаявки.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Зачисление")
		И РеквизитыЗаявки.ИсточникЗаявки = ПредопределенноеЗначение("Перечисление.ИсточникиАнкетИЗаявок.Офис")
		И РеквизитыЗаявки.ВидПайщика <> ПредопределенноеЗначение("Перечисление.ВидыПайщиков.НоминальныйДержатель") Тогда
		
		Траст = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
		РЭМ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
		
		Если РеквизитыЗаявки.Организация = Траст Тогда
			ДанныеДляПечати.Вставить("Логотип", ПолучитьОбщийМакет("ЛоготипТраст"));
		ИначеЕсли РеквизитыЗаявки.Организация = РЭМ Тогда
			ДанныеДляПечати.Вставить("Логотип", ПолучитьОбщийМакет("ЛоготипРЭМ"));
		КонецЕсли;
		
	КонецЕсли;

	Возврат ДанныеДляПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивШаблонов()
	
	МассивШаблонов = Новый Массив;
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	
	ЭтоЗаявкаНаЗачислениеПаев = (ЗаявкаПайщика.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление);
	
	// Макеты для печати заявления на открытие/закрытие лицевых счетов
	
	ИмяМакета = ?(ЭтоЗаявкаНаЗачислениеПаев 
						, "ОткрытиеЛицевогоСчета"
						, "ЗакрытиеЛицевогоСчета");	
	
	Если ЗаявкаПайщика.ОткрытьЗакрытьДепозитарныйСчет Тогда
		
		МассивШаблонов.Добавить(Новый Структура("Шаблон", ОбработкаНаСервере.ПолучитьМакет(ИмяМакета)));
		
	КонецЕсли;
	
	// Макеты для печати заявок пайщиков
	
	ВидЛица      = ?(ЗаявкаПайщика.Пайщик.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо, "ФизЛицо", "ЮрЛицо");
	Многократная = ?(ЭтоЗаявкаНаЗачислениеПаев, ЗаявкаПайщика.Многократная, Неопределено);	
	
	Если ЗаявкаПайщика.ПаевойИнвестиционныйФонд.ДатаПравил > Дата(2019, 1, 1) Тогда
		ИмяМакета = ?(ЭтоЗаявкаНаЗачислениеПаев , "ПриобритениеПаев", "ПогашениеПаев") + ?(ЗаявкаПайщика.ВидПайщика = Перечисления.ВидыПайщиков.НоминальныйДержатель, "НоминальныйДержатель", ВидЛица) + "2019";	

	Иначе 
		ИмяМакета = ?(ЭтоЗаявкаНаЗачислениеПаев 
						, "ПриобритениеПаев" + ВидЛица + ?(Многократная, "Многократная", "Однократная")
						, "ПогашениеПаев" + ВидЛица);	
	КонецЕсли;						
	
	МассивШаблонов.Добавить(Новый Структура("Шаблон", ОбработкаНаСервере.ПолучитьМакет(ИмяМакета)));
	
	Если ЗаявкаПайщика.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Зачисление")
		И ЗаявкаПайщика.ИсточникЗаявки = ПредопределенноеЗначение("Перечисление.ИсточникиАнкетИЗаявок.Офис")
		И ЗаявкаПайщика.ВидПайщика <> ПредопределенноеЗначение("Перечисление.ВидыПайщиков.НоминальныйДержатель") Тогда
		МассивШаблонов.Добавить(Новый Структура("Шаблон, ВывестиЛоготип", ОбработкаНаСервере.ПолучитьМакет("УведомлениеОРеквизитахТранзитногоСчета"), Истина));
	КонецЕсли;
	
	Возврат МассивШаблонов;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДляПечати(Отказ)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеДляПечати", ПолучитьДанныеДляПечати(Отказ));
	Результат.Вставить("МассивШаблонов",  ПолучитьМассивШаблонов());
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	Отказ = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДляПечати = ПолучитьСтруктуруДляПечати(Отказ);
	
	Если НЕ Отказ И СтруктураДляПечати.МассивШаблонов.Количество() <> 0 Тогда
		
		// создадим документ MS Word на основании сохраненного шаблона
		WordApp = СоздатьОбъектWord(Истина);
		
		Для каждого Шаблон из СтруктураДляПечати.МассивШаблонов Цикл
			НапечататьДокумент(WordApp, Шаблон.Шаблон, СтруктураДляПечати.ДанныеДляПечати, Шаблон.Свойство("ВывестиЛоготип") И ЗначениеЗаполнено(Шаблон.ВывестиЛоготип));	
		КонецЦикла;	
		
	КонецЕсли;
	
	Если НЕ Отказ И ВладелецФормы <> Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьДокумент(WordApp, ДвоичныеДанныеШаблона, ДанныеДляПечати, ВывестиЛоготип)
	
	Попытка
		
		ПутьКФайлуШаблона = СохранитьШаблонНаДиск(ДвоичныеДанныеШаблона);
		
		NewDoc = ДобавитьДокументWord(WordApp, ПутьКФайлуШаблона);
		ЗаполнитьПараметрыWord(NewDoc, ДанныеДляПечати);
		
		// Если в макете должен быть логотип и данные для печати его содержат.
		Если ВывестиЛоготип И ДанныеДляПечати.Свойство("Логотип") Тогда
			
			// Сохраняем картинку во временный файл.
			ВременныйФайлСКартинкой = ПолучитьИмяВременногоФайла("bmp");
			ДанныеДляПечати.Логотип.Записать(ВременныйФайлСКартинкой);
			
			// Вставляем картинку в документ.
			Параграф = NewDoc.Paragraphs.Item(1);
			КартинкаWord = Параграф.Range.InlineShapes.AddPicture(ВременныйФайлСКартинкой, Ложь, Истина); // Второй параметр - связь с файлом, третий параметр - сохранение рисунка вместе с документом.
			
			// Преобразуем картинку в фигуру Word.
			Фигура = КартинкаWord.ConvertToShape();
			Фигура.WrapFormat.Type = 5;	// Размещение перед текстом (обтекание).
			Фигура.Left = 350;			// Позиция слева
			Фигура.Top = 30;			// Позиция сверху
			Фигура.Height = 50;			// Высота
			Фигура.Width = 90;			// Ширина
			
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	УдалитьФайлШаблона(ПутьКФайлуШаблона);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАБОТА с WORD

&НаКлиенте
Функция СоздатьОбъектWord(Visible = False)
	
	WordApp = Новый COMОбъект("Word.Application");
	WordApp.Application.Visible = Visible;

	Возврат WordApp;
	
КонецФункции

&НаКлиенте
Функция ДобавитьДокументWord(WordApp, ПутьКФайлу)
	
	Возврат WordApp.Application.Documents.Add(ПутьКФайлу, WordApp.Application.Visible);	
	
КонецФункции

&НаКлиенте
Функция СохранитьШаблонНаДиск(ДвоичныеДанные)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("docx");
	ДвоичныеДанные.Записать(ВременныйФайл);
	
	Возврат ВременныйФайл;

КонецФункции

&НаКлиенте
Процедура УдалитьФайлШаблона(ПутьКФайлу)
	
	// удалим файл шаблона
	Попытка
		УдалитьФайлы(ПутьКФайлу);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыWord(ДокументWord, СтруктураРеквизитов)
	
	WordVars = ДокументWord.Variables;
	Для каждого КлючИЗнач из СтруктураРеквизитов Цикл
		Если КлючИЗнач.Ключ = "Таблицы" Тогда
			Для каждого КлючИзначТаб из КлючИЗнач.Значение Цикл
				ЗаполнитьТаблицуWord(ДокументWord.Tables(КлючИзначТаб.Ключ), КлючИзначТаб.Значение)	
			КонецЦикла;
		Иначе
			Переменная = WordVars.Item(КлючИЗнач.Ключ);
			Попытка
				Переменная.Value = Формат(КлючИЗнач.Значение, "ДФ=dd.MM.yyyy");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ДокументWord.Fields.Update();
	
	Для каждого Секция из ДокументWord.Sections Цикл
	
		Для каждого ВерхнийКолонтитул из Секция.Headers Цикл
			Если ВерхнийКолонтитул.Range.Fields.Count Тогда
				ВерхнийКолонтитул.Range.Fields.Update();
			КонецЕсли;
		КонецЦикла;
		
		Для каждого НижнийКолонтитул из Секция.Footers Цикл
			Если НижнийКолонтитул.Range.Fields.Count Тогда
				НижнийКолонтитул.Range.Fields.Update();	
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуWord(ТаблицаWord, МассивСтруктур)
	
	КоличествоСтрок = ТаблицаWord.Rows.Count;
	Для каждого Структура из МассивСтруктур Цикл
		
		Если КоличествоСтрок < Структура.Строка Тогда
			Для Сч = 1 По Структура.Строка - КоличествоСтрок Цикл
				ТаблицаWord.Rows.Add();	
			КонецЦикла;
			КоличествоСтрок = Структура.Строка;
		КонецЕсли;
		
		Ячейка = ТаблицаWord.Cell(Структура.Строка, Структура.Колонка);
		Попытка
			Ячейка.Range.InsertAfter(Структура.Значение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры
