
Процедура ПриИзмененииФлагаЛицензии(Объект, ИмяРеквизитаКлиент, ИмяРеквизитаЛицензии) Экспорт

	Если Объект[ИмяРеквизитаЛицензии] Тогда
		ПроверитьКорректностьФлаговЛицензий(Объект, ИмяРеквизитаКлиент, ИмяРеквизитаЛицензии);
	КонецЕсли;

КонецПроцедуры 

Процедура ПроверитьКорректностьФлаговЛицензий(Объект, ИмяРеквизитаКлиент, ИмяРеквизитаЛицензии = "") Экспорт

	Если ТипЗнч(Объект[ИмяРеквизитаКлиент]) = Тип("СправочникСсылка.ЮрФизЛица")
		И (Объект.ПоЛицензииДУ Или Объект.ПоЛицензииУКПИФ) Тогда
	
		СтруктураЛицензий = РаботаСДокументооборотом.ПолучитьДействующиеЛицензииПоДоговорамКлиента(Объект.Дата, Объект.Организация, Объект[ИмяРеквизитаКлиент]);
		
		Если ИмяРеквизитаЛицензии = "" Тогда // Проверяем все лицензии
		
			Для каждого Лицензия Из СтруктураЛицензий Цикл
				
				Если ТребуемаяЛицензияОтсутствует(Объект, Лицензия.Ключ, Лицензия.Значение) Тогда
				
					ЗадатьВопросОбновитьРеквизитПоЛицензии(Объект, Лицензия.Ключ);
				
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ТребуемаяЛицензияОтсутствует(Объект, ИмяРеквизитаЛицензии, СтруктураЛицензий[ИмяРеквизитаЛицензии]) Тогда
			ЗадатьВопросОбновитьРеквизитПоЛицензии(Объект, ИмяРеквизитаЛицензии);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуемаяЛицензияОтсутствует(Объект, ИмяРеквизитаЛицензии, НаличиеЛицензии)

	Возврат Объект[ИмяРеквизитаЛицензии] И Не НаличиеЛицензии;

КонецФункции 

Процедура ЗадатьВопросОбновитьРеквизитПоЛицензии(Объект, ИмяРеквизитаЛицензии)

	ТекстВопроса = "Отсутствуют действующие договоры по лицензии ";
	
	Если ИмяРеквизитаЛицензии = "ПоЛицензииУКПИФ" Тогда
		Подстрока = "УК ПИФ";
	ИначеЕсли ИмяРеквизитаЛицензии = "ПоЛицензииДУ" Тогда 
		Подстрока = "ДУ";
	КонецЕсли; 
	
	ТекстВопроса = ТекстВопроса + Подстрока + Символы.ПС + "Снять флаг?";
	
	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	
		Объект[ИмяРеквизитаЛицензии] = Ложь;
	
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ОбработкаПереключенияТипаЮрФизЛицоСтрока(Форма, ИмяРеквизитаФормы, ИмяРеквизитаОбъекта, ОчиститьПараметрыВыбораДоговоров = Ложь) Экспорт

	Если Форма[ИмяРеквизитаФормы] = 1 Тогда
		
		Форма.Объект[ИмяРеквизитаОбъекта] = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
		
	ИначеЕсли Форма[ИмяРеквизитаФормы] = 2 Тогда
		
		Форма.Объект[ИмяРеквизитаОбъекта] = "";
		
		Если ОчиститьПараметрыВыбораДоговоров И Форма.Элементы.Найти("ДоговорыДоговор") <> Неопределено Тогда
			Форма.Элементы.ДоговорыДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

Процедура ПодборДоговоров(Форма, ЮрФизЛицо) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период", НачалоДня(Форма.Объект.Дата));
	ПараметрыФормы.Вставить("ЮрФизЛицо", ЮрФизЛицо);
	ПараметрыФормы.Вставить("Организация", Форма.Объект.Организация);
	
	ОткрытьФормуМодально("Документ.ВходящийДокумент.Форма.ФормаВыбораДоговора", ПараметрыФормы, Форма.Элементы.Договоры);

КонецПроцедуры 

Процедура ДатаПриИзменении(Форма, ИмяРеквизитаКлиент = "") Экспорт

	Форма.Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Форма.Объект.Дата, Форма.Объект.Ссылка);
	
	Если Не Форма.ЭтоДокументДепозитарнойКомпании И НачалоДня(Форма.Объект.Дата) <> Форма.ИсходнаяДатаДокумента Тогда
		
		Форма.Объект.Номер = "";
		
		Если ЗначениеЗаполнено(ИмяРеквизитаКлиент) Тогда
		
			РаботаСДокументооборотомКлиентСервер.УстановитьПараметрыВыбораДоговора(Форма, ИмяРеквизитаКлиент);
		
		КонецЕсли; 		
		
	КонецЕсли; 

КонецПроцедуры

Процедура ДоговорыОбработкаВыбора(Форма, ВыбранноеЗначение) Экспорт 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Для каждого Структура Из ВыбранноеЗначение Цикл
			ЗаполнитьЗначенияСвойств(Форма.Объект.Договоры.Добавить(), Структура);
		КонецЦикла; 
		Форма.Модифицированность = Истина;
		РаботаСДокументооборотомКлиентСервер.ЗаполнитьЗаголовокГруппыДоговоров(Форма);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СчетДоверительногоУправленияПриИзменении(Форма, ИмяРеквизитаКлиент) Экспорт
	
	Если Форма.Объект.Договоры.Количество() = 0 Тогда
		Форма.Объект.Договоры.Добавить();
	КонецЕсли; 
	Форма.Объект.Договоры[0].Договор = Форма.СчетДоверительногоУправления;
	
	Форма.Объект[ИмяРеквизитаКлиент] = РаботаСДокументооборотом.ПолучитьЮрФизЛицоДляСчетаДоверительногоУправления(Форма.СчетДоверительногоУправления);
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьСодержаниеИсходящихДокументов(ИсходящиеДокументы, РежимЗаполнения) Экспорт

	ДокументыКЗаполнению = РаботаСДокументооборотом.ПолучитьИсходящиеДокументыБезСодержания(ИсходящиеДокументы);
	Если ДокументыКЗаполнению.Количество() = 1 Тогда
		ТекстВопроса = "В документе ";
	ИначеЕсли ДокументыКЗаполнению.Количество() > 1 Тогда 
		ТекстВопроса = "В документах ";
	Иначе
		ТекстВопроса = "";
	КонецЕсли; 
	
	Если ТекстВопроса <> "" Тогда
	
		ТекстВопроса = ТекстВопроса + СтрСоединить(ДокументыКЗаполнению, ", ") + " не заполнено содержание." + Символы.ПС + "Заполнить по шаблону?";
		
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
			РаботаСДокументооборотом.ЗаполнитьСтандартноеСодержаниеИсходящихДокументов(ДокументыКЗаполнению, РежимЗаполнения);
		
		КонецЕсли;

	КонецЕсли; 
	
КонецПроцедуры