
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиКомпоновкиДанных = Параметры.НастройкиКомпоновкиДанных;
	
	СКД = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСКДБазиса("Основной");
	ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
	ЭтаФорма.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.АдресСКД));
	ЭтаФорма.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	ЭтаФорма.КомпоновщикНастроек.Восстановить();
	
КонецПроцедуры

