
#Область Интерфейс

Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
     
	Если Метод = "ЭкспортироватьСписокДляСверки" Тогда
		ЭкспортироватьСписокДляСверки(Экземпляры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ЭкспортироватьСписокДляСверки(Экземпляры)
	
	Идентификатор	= Экземпляры[0].Идентификатор;
	Параметры		= Экземпляры[0].Параметры;
	
	ЭтотОбъект.Организация	= Параметры.Организация;
	ВидСписка				= Параметры.ВидСписка;		
	ПутьКФайлу				= Параметры.ПутьКФайлу;
		
	Отказ = Ложь;
	ВидСпискаСтрокой = ""; 
	
	Если ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокТеррористов Тогда
		ВидСпискаСтрокой = "possible_terrorists";
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокОтказников Тогда
		ВидСпискаСтрокой = "operation_cancels";
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СводныйПереченьСоветаБезопасностиООН Тогда
		ВидСпискаСтрокой = "uns";
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокРешенийМВК Тогда
		ВидСпискаСтрокой = "frozen_assets";		
	Иначе
		ВызватьИсключение "Недопустимый вид перечня для выгрузки в ЛКК (" + СокрЛП(ВидСписка) +")";		
	КонецЕсли;
			
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
	
	ЭкспортСпискаДляПроверки(ВидСпискаСтрокой, АдресВоВременномХранилище, ПутьКФайлу, Отказ);
		
	РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(Идентификатор, Отказ);
	
	ОповеститьОбОшибках();
	 
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЭтотОбъект.Дата = ТекущаяДатаСеанса(); 
		
	ЭтотОбъект.Организация	= ПараметрыКоманды.Организация;
	ЭтотОбъект.Пиф			= ПараметрыКоманды.Пиф;
		
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда 
		
		ЗафиксироватьСообщение("Не указан параметр [Организация]. Команда импорта заявок пайщиков из системы ЕСИА.Финанс отклонена.");
		
	ИначеЕсли ИдентификаторКоманды = "ИмпортЗаявокПайщиковИзЛКК" Тогда
		
		ИмпортироватьЗаявкиПайщиков(Перечисления.ВидыЗаявокПайщиков.Зачисление);
		ИмпортироватьЗаявкиПайщиков(Перечисления.ВидыЗаявокПайщиков.Погашение);
		ИмпортироватьЗаявкиПайщиков(Перечисления.ВидыЗаявокПайщиков.Обмен);
		
	Иначе
		ЗафиксироватьСообщение("Для команды [" + ИдентификаторКоманды + "] не определены действия.");	
	КонецЕсли;
		
	ОповеститьОбОшибках();
	
КонецПроцедуры

Процедура ВыгрузитьСтоимостьПаев(ЦенаПая, СЧА, Отказ = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК КодПифа
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды)
		|				И Объект = &Пиф) КАК КодыВоВнешнихСистемахСрезПоследних";
	Запрос.УстановитьПараметр("Пиф", ЭтотОбъект.Пиф);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПараметрыПодключения = ПолучитьПараметрыПодключения(); 
		
		СтруктураЗапроса = Новый Структура();
		СтруктураЗапроса.Вставить("fund_code", Формат(Выборка.КодПифа, "ЧГ=0"));	
		СтруктураЗапроса.Вставить("date", Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"));
		СтруктураЗапроса.Вставить("value", ЦенаПая);
		СтруктураЗапроса.Вставить("scha_value", СЧА);
		
		СтруктураЗапроса = Новый Структура("data", РаботаСКоллекциями.ЗначениеВМассив(СтруктураЗапроса));
		
		ТекТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
				
		ТекстСообщения = "Не удалось выполнить запрос.";
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/v1/back_office/portfolio/import?import_type=fund_values", ТекТелоЗапроса, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ЗафиксироватьСообщение(ТекстСообщения);
			Отказ = Истина;
		Иначе
			ЗафиксироватьСообщение("На дату [" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + "] выгружена сумма СЧА [" + СЧА + "] и стоимость пая [" + ЦенаПая + "] пифа [" + ЭтотОбъект.Пиф + "]", Ложь);	
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры 

Процедура ВыгрузитьОперацииПоПаям(ОперацияПоПаям, НомерДокумента, Отказ = Ложь) Экспорт
	
	РеквизитыОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОперацияПоПаям,
		Новый Структура("Пайщик, Дата, ПаевойИнвестиционныйФонд, Заявка, ДатаДокумента, СчетДоверительногоУправления",
			"Заявка.Пайщик",
			"Дата",
			"ПаевойИнвестиционныйФонд",
			"Заявка",
			"Дата",
			"СчетДоверительногоУправления"));
	
	ЭтотОбъект.Дата = РеквизитыОперации.Дата;
			
	ПараметрыПодключения = ПолучитьПараметрыПодключения(); 

	//1. Получаем остатки паев на портале Есиа.Финанс + лицевые счета
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды) КАК ЭтоПиф,
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыЕсиаФинанс
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&КонецПериода,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))
		|				И Объект В (&Объекты)) КАК КодыВоВнешнихСистемахСрезПоследних";
#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация); 
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(РеквизитыОперации.Пайщик);
	МассивОбъектов.Добавить(РеквизитыОперации.ПаевойИнвестиционныйФонд);
	
	Запрос.УстановитьПараметр("Объекты", МассивОбъектов);
	
	Запрос.УстановитьПараметр("ПредыдущийРабочийДень",
		Справочники.Календари.ДобавитьКДатеРабочиеДни(
			Справочники.Календари.Общероссийский,
			ЭтотОбъект.Дата,
			-2));
	
	Запрос.Выполнить();
	
	ВыборкаКодов = Запрос.МенеджерВременныхТаблиц.Таблицы["_КодыЕсиаФинанс"]. ПолучитьДанные().Выбрать();
	
	КодыСтр = "";
	
	Пока ВыборкаКодов.Следующий() Цикл
		
		Если Не ВыборкаКодов.ЭтоПиф Тогда 
			КодыСтр = КодыСтр + ?(КодыСтр = "", "?", "&") + "ids%5B%5D=" + ВыборкаКодов.Код;
		КонецЕсли; 
		
	КонецЦикла;
	
	ТаблицаДанныхЕсиа = Новый ТаблицаЗначений;
	ТаблицаДанныхЕсиа.Колонки.Добавить("КодПайщика", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки("55")));
	ТаблицаДанныхЕсиа.Колонки.Добавить("КодПифа", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки("55")));
	ТаблицаДанныхЕсиа.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	ТаблицаДанныхЕсиа.Колонки.Добавить("НомерСчета", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки("100"))); 
	
	Если ЗначениеЗаполнено(КодыСтр) Тогда
	
		ТекстСообщения = "Не удалось получить остатки паев.";
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, "/api/v1/back_office/users/piece_balances" + КодыСтр,, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ЗафиксироватьСообщение(ТекстСообщения,, Отказ);
			Возврат;
		КонецЕсли;
		
		ДанныеЕсиа = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
		
		Если Не (ТипЗнч(ДанныеЕсиа) = Тип("Структура") И ДанныеЕсиа.Свойство("success") И ДанныеЕсиа.success)
			Или Не ДанныеЕсиа.Свойство("balance") Тогда
		
			ЗафиксироватьСообщение("Не удалось получить данные паевого баланса пользователей ЕСИА.Финанс",, Отказ);
			Возврат;
			
		КонецЕсли;
		
		Для Каждого ТекОстаток Из ДанныеЕсиа.balance Цикл
			
			НоваяЗаписьОстатка = ТаблицаДанныхЕсиа.Добавить();
			НоваяЗаписьОстатка.КодПайщика = ТекОстаток.user_id;
			НоваяЗаписьОстатка.КодПифа = ТекОстаток.fund;
			НоваяЗаписьОстатка.Количество = ТекОстаток.count;
			НоваяЗаписьОстатка.НомерСчета = ТекОстаток.account_number;
			
		КонецЦикла;
		
	КонецЕсли;
	
#Область Текст_Запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхЕсиа.КодПайщика КАК КодПайщика,
		|	ТаблицаДанныхЕсиа.КодПифа КАК КодПифа,
		|	ТаблицаДанныхЕсиа.Количество КАК Количество,
		|	ТаблицаДанныхЕсиа.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ _ТаблицаДанныхЕсиа
		|ИЗ
		|	&ТаблицаДанныхЕсиа КАК ТаблицаДанныхЕсиа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаДанныхЕсиа.КодПайщика КАК КодПайщика,
		|	_ТаблицаДанныхЕсиа.КодПифа КАК КодПифа,
		|	_ТаблицаДанныхЕсиа.Количество КАК Количество,
		|	_ТаблицаДанныхЕсиа.НомерСчета КАК НомерСчета,
		|	_КодыПайщиков.Объект КАК Пайщик,
		|	_КодыПифов.Объект КАК Пиф
		|ПОМЕСТИТЬ _ДанныеЕсиа
		|ИЗ
		|	_ТаблицаДанныхЕсиа КАК _ТаблицаДанныхЕсиа
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыПайщиков
		|		ПО _ТаблицаДанныхЕсиа.КодПайщика = _КодыПайщиков.Код
		|			И (НЕ _КодыПайщиков.ЭтоПиф)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыПифов
		|		ПО _ТаблицаДанныхЕсиа.КодПифа = _КодыПифов.Код
		|			И (_КодыПифов.ЭтоПиф)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыПайщиков.Код КАК КодПайщика,
		|	_КодыПифов.Код КАК КодПифа,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.ПаевойИнвестиционныйФонд КАК Пиф,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.Пайщик КАК Пайщик,
		|	ЗаявкаПайщика.ДепозитарныйСчет.НомерСчета КАК НомерСчета,
		|	ЗаявкаПайщика.НомерЗаявки КАК НомерЗаявки,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.КоличествоНачальныйОстаток КАК КолвоДоОперации,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.КоличествоКонечныйОстаток КАК КолвоПослеОперации,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.КоличествоОборот КАК КолвоОборот,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СуммаНачОстаток,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СуммаКонОстаток,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.СтоимостьОборот КАК СуммаОборот,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиНаНачалоИКонец.КоличествоКонечныйОстаток КАК ОстатокПаевНаКонецДня,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиНаНачалоИКонец.СтоимостьКонечныйОстаток КАК СтоимостьНаКонецДня,
		|	ДолиПайщиковВИнвестиционномФондеОстаткиНаНачалоИКонец.КоличествоНачальныйОстаток КАК ОстатокПаевНаНачалоДня,
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК СтоимостьПая,
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход, 0) КАК СуммаНадбавкиСкидки
		|ПОМЕСТИТЬ _ДанныеУчетнойСистемы
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Движения,
		|			Организация = &Организация
		|				И ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд
		|				И Пайщик = &Пайщик) КАК ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыПифов
		|		ПО ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.ПаевойИнвестиционныйФонд = _КодыПифов.Объект
		|			И (_КодыПифов.ЭтоПиф)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыПайщиков
		|		ПО ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.Пайщик = _КодыПайщиков.Объект
		|			И (НЕ _КодыПайщиков.ЭтоПиф)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ПО (ЗаявкаПайщика.Ссылка = &Заявка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
		|			И ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики)
		|			И (ФинансовыеПоказатели.Период = &ПредыдущийРабочийДень)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.УдержаниеНадбавокПИФ), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.УдержаниеСкидокПИФ))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ПО ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.Регистратор = ЗадолженностиПоДенежнымСредствамОбороты.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериодаГраница,
		|				,
		|				,
		|				Организация = &Организация
		|					И ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд
		|					И Пайщик = &Пайщик) КАК ДолиПайщиковВИнвестиционномФондеОстаткиНаНачалоИКонец
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ДолиПайщиковВИнвестиционномФондеОстаткиИОбороты.Регистратор = &Операция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеЕсиа.КодПайщика КАК КодЕсиа,
		|	ИСТИНА КАК КодПайщика
		|ПОМЕСТИТЬ _ОшибкиОпределенияОбъектовУчетнойСистемы
		|ИЗ
		|	_ДанныеЕсиа КАК _ДанныеЕсиа
		|ГДЕ
		|	_ДанныеЕсиа.Пайщик ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ДанныеЕсиа.КодПифа,
		|	ЛОЖЬ
		|ИЗ
		|	_ДанныеЕсиа КАК _ДанныеЕсиа
		|ГДЕ
		|	_ДанныеЕсиа.Пиф ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЕсиа.Пайщик КАК Пайщик,
		|	_ДанныеЕсиа.Пиф КАК Пиф,
		|	_ДанныеЕсиа.Количество КАК Количество,
		|	_ДанныеЕсиа.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ _ВнешниеДанные
		|ИЗ
		|	_ДанныеЕсиа КАК _ДанныеЕсиа
		|ГДЕ
		|	НЕ _ДанныеЕсиа.Пайщик ЕСТЬ NULL
		|	И НЕ _ДанныеЕсиа.Пиф ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ДанныеУчетнойСистемы.Пайщик, _ВнешниеДанные.Пайщик) КАК Пайщик,
		|	ЕСТЬNULL(_ДанныеУчетнойСистемы.Пиф, _ВнешниеДанные.Пиф) КАК Пиф,
		|	ЕСТЬNULL(_ДанныеУчетнойСистемы.НомерСчета, _ВнешниеДанные.НомерСчета) КАК НомерСчета,
		|	_ДанныеУчетнойСистемы.ОстатокПаевНаНачалоДня КАК КоличествоУчетнаяСистема,
		|	_ВнешниеДанные.Количество КАК КоличествоЕсиа
		|ПОМЕСТИТЬ _РасхожденияНачальныхОстатков
		|ИЗ
		|	_ДанныеУчетнойСистемы КАК _ДанныеУчетнойСистемы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ВнешниеДанные КАК _ВнешниеДанные
		|		ПО _ДанныеУчетнойСистемы.Пайщик = _ВнешниеДанные.Пайщик
		|			И _ДанныеУчетнойСистемы.Пиф = _ВнешниеДанные.Пиф
		|			И _ДанныеУчетнойСистемы.НомерСчета = _ВнешниеДанные.НомерСчета
		|ГДЕ
		|	ЕСТЬNULL(_ДанныеУчетнойСистемы.ОстатокПаевНаНачалоДня, 0) <> ЕСТЬNULL(_ВнешниеДанные.Количество, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеУчетнойСистемы.КодПайщика КАК КодПайщика,
		|	_ДанныеУчетнойСистемы.КодПифа КАК КодПифа,
		|	_ДанныеУчетнойСистемы.Пиф КАК Пиф,
		|	_ДанныеУчетнойСистемы.Пайщик КАК Пайщик,
		|	_ДанныеУчетнойСистемы.НомерСчета КАК НомерСчета,
		|	_ДанныеУчетнойСистемы.НомерЗаявки КАК НомерЗаявки,
		|	_ДанныеУчетнойСистемы.КолвоДоОперации КАК КолвоДоОперации,
		|	_ДанныеУчетнойСистемы.КолвоПослеОперации КАК КолвоПослеОперации,
		|	_ДанныеУчетнойСистемы.ОстатокПаевНаКонецДня КАК ОстатокПаевНаКонецДня,
		|	_ДанныеУчетнойСистемы.КолвоОборот КАК КолвоОборот,
		|	_ДанныеУчетнойСистемы.СуммаНачОстаток КАК СуммаНачОстаток,
		|	_ДанныеУчетнойСистемы.СтоимостьНаКонецДня КАК СтоимостьНаКонецДня,
		|	_ДанныеУчетнойСистемы.СуммаОборот КАК СуммаОборот,
		|	_ДанныеУчетнойСистемы.СтоимостьПая КАК СтоимостьПая,
		|	_ДанныеУчетнойСистемы.СуммаНадбавкиСкидки КАК СуммаНадбавкиСкидки
		|ИЗ
		|	_ДанныеУчетнойСистемы КАК _ДанныеУчетнойСистемы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнешниеДанные КАК _ВнешниеДанные
		|		ПО _ДанныеУчетнойСистемы.Пайщик = _ВнешниеДанные.Пайщик
		|			И _ДанныеУчетнойСистемы.Пиф = _ВнешниеДанные.Пиф
		|			И _ДанныеУчетнойСистемы.НомерСчета = _ВнешниеДанные.НомерСчета
		|			И _ДанныеУчетнойСистемы.ОстатокПаевНаНачалоДня = _ВнешниеДанные.Количество
		|			И (_ДанныеУчетнойСистемы.КолвоОборот > 0)";
#КонецОбласти	

	Запрос.УстановитьПараметр("Операция",						ОперацияПоПаям);
	Запрос.УстановитьПараметр("ТаблицаДанныхЕсиа",				ТаблицаДанныхЕсиа);
	Запрос.УстановитьПараметр("Пайщик",							РеквизитыОперации.Пайщик);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд",		РеквизитыОперации.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Заявка",							РеквизитыОперации.Заявка);	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	РеквизитыОперации.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("КонецПериодаГраница",			Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивОпераций = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Операция = Новый Структура(); 
		
		//##Техдолг: повторная выгрузка дублирует данные в ЛКК из-за перенумерации документов
		Операция.Вставить("account",	Выборка.НомерСчета);										//Лицевой счет клиента в реестре фонда
		Операция.Вставить("all",		Выборка.СуммаОборот);										//Сумма операции
		Операция.Вставить("base",		СокрЛП(Выборка.НомерЗаявки));								//Основание операции
		Операция.Вставить("cost",		Выборка.СтоимостьНаКонецДня);								//Блок оценочной стоимости остатка паев
		Операция.Вставить("date",		Формат(РеквизитыОперации.ДатаДокумента, "ДФ=dd.MM.yyyy"));	//Дата операции
		Операция.Вставить("fund",		Выборка.КодПифа);											//Идентификатор фонда
		Операция.Вставить("id",			НомерДокумента);											//Номер операции
		Операция.Вставить("mark",		Выборка.СуммаНадбавкиСкидки);								//сумма скидки/надбавки
		Операция.Вставить("num",		Выборка.КолвоОборот);										//количество паев по операции
		Операция.Вставить("points",		0);															//Бонусные баллы по операции
		Операция.Вставить("quantity",	Выборка.ОстатокПаевНаКонецДня);								//Количество паев на конец дня. для всех операций в течение дня должно быть одинаковое значение
		Операция.Вставить("restin",		Выборка.КолвоДоОперации);									//Остаток паев до проведения операции
		Операция.Вставить("restout",	Выборка.КолвоПослеОперации);								//Количество паев после операции
		Операция.Вставить("sumall",		Выборка.СуммаОборот);										//Сумма приобретения/погашения паев (включая комиссии) 
		Операция.Вставить("tax",		0);															//Налог (НДФЛ)
		Операция.Вставить("type",		
			?(ТипЗнч(ОперацияПоПаям) = Тип("ДокументСсылка.ЗачислениеПаев"), 1, 2));				//1 - Приобретение (зачисление) паев, 2 - Погашение (списание) паев		
		Операция.Вставить("user",		Выборка.КодПайщика);										//Код пайщика (pifs_portfolio_code)
		Операция.Вставить("value",		Выборка.СтоимостьПая);										//Стоимость пая на отчётную дату, предшествующую операции
		
		МассивОпераций.Добавить(Операция);
	
	КонецЦикла; 
	
	СтруктураЗапроса = Новый Структура("data", МассивОпераций);
	
	ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);

	ТекстСообщения = "Не удалось выполнить запрос.";

	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/v1/back_office/portfolio/import?import_type=pifs_operations_data", ТелоЗапроса, ТекстСообщения);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗафиксироватьСообщение(ТекстСообщения,, Отказ);
	Иначе
		ЗафиксироватьСообщение("Выгружены данные о зачислении паев", Ложь);
	КонецЕсли; 
	
	//отработать ошибки: расхождение остатков, отсутствие кодов, объектов
	//схлопнуть остатки на начало дня и на конец дня в разрезе лицевого счета (без операций) для сверки и для заполнения реквизита "quantity"
		
КонецПроцедуры

Процедура ВыгрузитьВводыДенежныхСредств(ТекВводДС = Неопределено, Отказ = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ТекВводДС) Тогда
		ЭтотОбъект.Дата = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекВводДС, "Дата"));
	КонецЕсли;	
		
	ПараметрыПодключения = ПолучитьПараметрыПодключения(); 
	
	// Суммы нужно выгружать в копейках, т. е. умножать на 100
	Запрос = Новый Запрос;
	
#Область Текст_запроса

	Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыЕсиаФинанс
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&КонецПериода,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков))) КАК КодыВоВнешнихСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыПайщиков.Код КАК user_id,
		|	ВводДенежныхСредств.СтрокаБанковскойВыписки.Номер КАК order_id,
		|	ВводДенежныхСредств.Сумма * 100 КАК amount,
		|	ВводДенежныхСредств.Сумма * 100 КАК amount_no_commission,
		|	""approved"" КАК status,
		|	ВводДенежныхСредств.СтрокаБанковскойВыписки.ДатаПлатежногоДокумента КАК date,
		|	ВводДенежныхСредств.СтрокаБанковскойВыписки.НазначениеПлатежа КАК description,
		|	""643"" КАК currency,
		|	""transfer"" КАК pay_type,
		|	_КодыЗаявок.Код КАК owner_id,
		|	""Claim"" КАК owner_type,
		|	ВводДенежныхСредств.Дата КАК uk_date,
		|	""purchase"" КАК operation_type
		|ИЗ
		|	Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыЗаявок
		|		ПО ВводДенежныхСредств.Основание = _КодыЗаявок.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыПайщиков
		|		ПО ВводДенежныхСредств.Основание.Пайщик = _КодыПайщиков.Объект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВводДенежныхСредств <> НЕОПРЕДЕЛЕНО
		|				ТОГДА ВводДенежныхСредств.Ссылка = &ВводДенежныхСредств
		|			ИНАЧЕ ВводДенежныхСредств.Организация = &Организация
		|					И (ВводДенежныхСредств.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|					И ВводДенежныхСредств.Проведен
		|		КОНЕЦ";
		
#КонецОбласти	

	Запрос.УстановитьПараметр("НачалоПериода",			НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("КонецПериода",			КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация",			ЭтотОбъект.Организация); 
	Запрос.УстановитьПараметр("ВводДенежныхСредств",	ТекВводДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	КолонкиРезультата = РезультатЗапроса.Колонки;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивОпераций = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Операция = Новый Структура(); 
		
		Для Каждого Колонка Из КолонкиРезультата Цикл			
			Операция.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
		МассивОпераций.Добавить(Операция);
	
	КонецЦикла; 
		
	Если МассивОпераций.Количество() = 1 Тогда
		ТелоЗапроса = ПолучитьСтрокуJSON(МассивОпераций[0]);
	Иначе
		ТелоЗапроса = ПолучитьСтрокуJSON(МассивОпераций);		
	КонецЕсли;	
	
	ТекстСообщения = "Не удалось выполнить запрос.";

	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/v1/back_office/payments", ТелоЗапроса, ТекстСообщения);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗафиксироватьСообщение(ТекстСообщения,, Отказ);
	Иначе
		ЗафиксироватьСообщение("Выгружены данные о вводе денежных средств", Ложь);
	КонецЕсли; 
			
КонецПроцедуры

Процедура СверитьОстаткиПаев()
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(); 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды) КАК ЭтоПиф,
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _КодыЕсиаФинанс
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Дата, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО КодыВоВнешнихСистемахСрезПоследних.Объект = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	_КодыПифовЕсиаФинанс.Код КАК КодПифа,
		|	_КодыКлиентовЕсиаФинанс.Код КАК КодКлиента
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_КодыЕсиаФинанс.СчетДоверительногоУправления
		|					ИЗ
		|						_КодыЕсиаФинанс КАК _КодыЕсиаФинанс
		|					ГДЕ
		|						НЕ _КодыЕсиаФинанс.СчетДоверительногоУправления ЕСТЬ NULL)
		|				И ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд В
		|					(ВЫБРАТЬ
		|						_КодыЕсиаФинанс.Объект
		|					ИЗ
		|						_КодыЕсиаФинанс КАК _КодыЕсиаФинанс
		|					ГДЕ
		|						_КодыЕсиаФинанс.ЭтоПиф)) КАК ОстаткиЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыПифовЕсиаФинанс
		|		ПО (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = _КодыПифовЕсиаФинанс.Объект)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЕсиаФинанс КАК _КодыКлиентовЕсиаФинанс
		|		ПО ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления = _КодыКлиентовЕсиаФинанс.СчетДоверительногоУправления";
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация); 
	
	Результат = Запрос.Выполнить();
	
	ВыборкаКодов = Запрос.МенеджерВременныхТаблиц.Таблицы["_КодыЕсиаФинанс"]. ПолучитьДанные().Выбрать();
	
	КодыСтр = "";
	
	Пока ВыборкаКодов.Следующий() Цикл	
		КодыСтр = КодыСтр + ?(КодыСтр = "", "?", "&") + "ids%5B%5D=" + ВыборкаКодов.Код; 	
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(КодыСтр) Тогда
		
		ТекстСообщения = "Не удалось получить остатки паев.";
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/v1/back_office//api/v1/back_office/users/piece_balances" + КодыСтр,, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ЗафиксироватьСообщение(ТекстСообщения);
		КонецЕсли;

	КонецЕсли;

	
КонецПроцедуры

Процедура ВыгрузитьФайлы(ЗаявкаПайщика, АдресФайла, ИмяФайла, Описание = "", Отказ = Ложь) Экспорт 
	
	//Разрешенные: doc, docx, pdf, jpeg, jpg, png, tiff, tif, zip, 7z
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаПайщика, "Дата, Пайщик");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыЗаявок.Код КАК КодЗаявки,
		|	КодыПайщиков.Код КАК КодПайщика
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Дата,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков)
		|				И Объект = &ЗаявкаПайщика) КАК КодыЗаявок,
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Дата,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)
		|				И Объект = &Пайщик) КАК КодыПайщиков";
	
	Запрос.УстановитьПараметр("ЗаявкаПайщика",	ЗаявкаПайщика);
	Запрос.УстановитьПараметр("Дата",			РеквизитыЗаявки.Дата);	
	Запрос.УстановитьПараметр("Пайщик",			РеквизитыЗаявки.Пайщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		
		Разделитель = СтрЗаменить(Новый УникальныйИдентификатор(), "_", "");
	
		ТекПоток = Новый ПотокВПамяти();
		
		ЗаписьДанных = Новый ЗаписьДанных(ТекПоток,,, Символы.ВК + Символы.ПС, ""); 
		
		Если ПустаяСтрока(Описание) Тогда
			Описание = "Подтверждение от спецдепозитария от " + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
		КонецЕсли;
				
		ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[body]""; filename=""" + ИмяФайла + """", ПолучитьИзВременногоХранилища(АдресФайла));
	    ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[description]""", Описание); //описание 
		ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[by]""", "backoffice"); //Кем загружен файл
		ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[state]""", "visible"); //Статус файла "Доступно для клиента", значение по умолчанию
	   	ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[attachmentable_id]""", Выборка.КодЗаявки); //ид заявки 
		ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[attachmentable_type]""", "Claim"); //Признак владельца файла(owner_id) - заявка. Пока все подгружаем к заявкам
	    ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[kind]""", "pifs_sd_notifications_succeed"); //тип документа - Уведомление об операции по лицевому счету
		
		ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[wait_for_sign]""", "false"); //ожидает подписи клиента
		//Если устанавливаем параметр wait_for_sign = false, необходимо указывать ид пользователя
		ДобавитьЗначениеПараметра(ЗаписьДанных, Разделитель, """attachment[uploader_id]""", Выборка.КодПайщика); //ид пользователя
	 
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--");
		ЗаписьДанных.ЗаписатьСтроку("");
		
		ЗаписьДанных.Закрыть();
		
		ТекТелоЗапроса = ТекПоток.ЗакрытьИПолучитьДвоичныеДанные();
		
		ПараметрыПодключения = ПолучитьПараметрыПодключения("multipart/form-data; boundary=" + Разделитель);
		
		ТекстОшибки = "Не удалось выполнить запрос."; 
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/v1/back_office/attachments", ТекТелоЗапроса, ТекстОшибки, 1); 
		
		Если HTTPОтвет = Неопределено Тогда
			ЗафиксироватьСообщение(ТекстОшибки,, Отказ);
		Иначе
			МассивСтрок = СтрРазделить(ИмяФайла, "\");			
			ЗафиксироватьСообщение("К операции [" + ЗаявкаПайщика + "] загружен файл [" + МассивСтрок[МассивСтрок.Количество()-1] + "]", Ложь);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЭкспортСпискаДляПроверки(ТипСписка, АдресФайла, ИмяФайла, Отказ = Ложь) Экспорт 
	
	МассивСтрок = СтрРазделить(ИмяФайла, "\");
	ТекИмяФайла = МассивСтрок[МассивСтрок.Количество()-1];
		
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор(), "-", "");

	ПотокЗаписиТелаЗапроса = Новый ПотокВПамяти();
	ЗаписьТелаЗапроса = Новый ЗаписьДанных(ПотокЗаписиТелаЗапроса);
	ДобавитьЗначениеПараметра(ЗаписьТелаЗапроса, Разделитель, """body""; filename=""" + ТекИмяФайла + """", ПолучитьИзВременногоХранилища(АдресФайла));
 
	ЗаписьТелаЗапроса.ЗаписатьСтроку("" + Символы.ПС); //"особенная" строка, из-за отсутствия символа ПС не загружались файлы, при этом запрос возвращал код 200 ОК.
	
	ЗаписьТелаЗапроса.ЗаписатьСтроку("--" + Разделитель + "--");
	ЗаписьТелаЗапроса.Закрыть(); 
	
	ТекТелоЗапроса = ПотокЗаписиТелаЗапроса.ЗакрытьИПолучитьДвоичныеДанные();
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения("multipart/form-data; boundary=" + Разделитель);  

	ТекстОшибки = "Не удалось выполнить запрос.";
	
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/v1/back_office/upload_database?database%5Bkind%5D=" + ТипСписка, ТекТелоЗапроса, ТекстОшибки, 1);

    Если HTTPОтвет = Неопределено Тогда
		ЗафиксироватьСообщение(ТекстОшибки);
		Отказ = Истина;
	Иначе
		ОтветОбъект = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
		ЗафиксироватьСообщение("Загружен файл со списком [" + ТекИмяФайла + "]. Статус загрузки [success = " + ОтветОбъект.success + "], описание статуса [" + ОтветОбъект.status_str + "].", Ложь);	
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьЗначениеПараметра(ТекЗапись, Разделитель, ОписаниеПараметра, ЗначениеПараметра)
	
	ТекЗапись.ЗаписатьСтроку("--" + Разделитель);
	ТекЗапись.ЗаписатьСтроку("Content-Disposition: form-data; name=" + ОписаниеПараметра);
	ТекЗапись.ЗаписатьСтроку("");
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
		ТекЗапись.ЗаписатьСтроку(ЗначениеПараметра);	
	ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("ДвоичныеДанные") Тогда
		ТекЗапись.Записать(ЗначениеПараметра);	
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИмпортироватьЗаявкиПайщиков(ВидЗаявок) Экспорт
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(); 
	
	ТекстОшибки = "Не удалось получить данные заявок пайщиков из системы ЕСИА.Финанс"; 
	
	//ТекстЗапроса = "/api/v1/back_office/claims?filter%5Bcreated_at%5D%5Bgt%5D=" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") +
	//				"&filter%5Bkind%5D=pifs_purchase";//&filter%5Bkind%5D=pifs_selling";
	
	ОтборПоДате = Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"); 
	
	ОтборПоВидуЗаявки = "";
	
	Если ВидЗаявок = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		ОтборПоВидуЗаявки = "&filter%5Bkind%5D=pifs_purchase";
	ИначеЕсли ВидЗаявок = Перечисления.ВидыЗаявокПайщиков.Погашение Тогда
		ОтборПоВидуЗаявки = "&filter%5Bkind%5D=pifs_selling";	
	ИначеЕсли ВидЗаявок = Перечисления.ВидыЗаявокПайщиков.Обмен Тогда
		ОтборПоВидуЗаявки = "&filter%5Bkind%5D=pifs_exchange";
	Иначе
		ЗафиксироватьСообщение("Не удалось определить вид заявок пайщиков для импорта из системы ЕСИА.Финанс");
		Возврат;
	КонецЕсли;
	
	//ОтборПоВидуЗаявки = "&filter%5Bkind%5D=pifs_purchase";//&filter%5Bkind%5D=pifs_selling&filter%5Bkind%5D=pifs_exchange"; //приобретение, погашение, обмен 
	
	ТекстЗапроса = "/api/v1/back_office/claims?filter%5Bcreated_at%5D%5Bgt%5D=" + ОтборПоДате + ОтборПоВидуЗаявки;
	
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, ТекстЗапроса,, ТекстОшибки);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗафиксироватьСообщение(ТекстОшибки);
		Возврат;
	КонецЕсли;

	ДанныеЕсиа = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
		
	Если Не (ТипЗнч(ДанныеЕсиа) = Тип("Структура") И ДанныеЕсиа.Свойство("success") И ДанныеЕсиа.success)
		Или Не ДанныеЕсиа.Свойство("claims") Тогда
		
		ЗафиксироватьСообщение("Не удалось получить данные заявок пайщиков из системы ЕСИА.Финанс");
		Возврат;	
		
	КонецЕсли;
	
	Если ДанныеЕсиа.claims.Количество() = 0 Тогда  //отсутствуют заявки
		ЗафиксироватьСообщение("В системе ЕСИА.Финанс отсутствуют заявки пайщиков на дату " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + ".", Ложь);
		Возврат;	
	Конецесли;
	
	ЗаявкиПайщиков = ДесериализоватьДанныеЗаявокЕсиа(ДанныеЕсиа, ПараметрыПодключения); //заявки, банковские счета
	
	Если ЗаявкиПайщиков.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область Текст_запроса

	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкиПайщиков.Идентификатор КАК Идентификатор,
		|	ЗаявкиПайщиков.ВидЗаявки КАК ВидЗаявки,
		|	ЗаявкиПайщиков.Статус КАК Статус,
		|	ЗаявкиПайщиков.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	ЗаявкиПайщиков.НомерЗаявки КАК НомерЗаявки,
		|	ЗаявкиПайщиков.ДатаЗаявки КАК ДатаЗаявки,
		|	ЗаявкиПайщиков.ИдентификаторПифа КАК ИдентификаторПифа,
		|	ЗаявкиПайщиков.ИдентификаторПифаДляОбмена КАК ИдентификаторПифаДляОбмена,
		|	ЗаявкиПайщиков.Сумма КАК Сумма,
		|	ЗаявкиПайщиков.ИдентификаторРасчетногоСчета КАК ИдентификаторРасчетногоСчета,
		|	ЗаявкиПайщиков.Количество КАК Количество,
		|	ЗаявкиПайщиков.Многократная КАК Многократная,
		|	ЗаявкиПайщиков.НомерСчетаДепо КАК НомерСчетаДепо,
		|	ЗаявкиПайщиков.НомерСчетаДепоДляОбмена КАК НомерСчетаДепоДляОбмена,
		|	ЗаявкиПайщиков.ОткрытьЗакрытьДепозитарныйСчет КАК ОткрытьЗакрытьДепозитарныйСчет,
		|	ЗаявкиПайщиков.ОткрытьДепозитарныйСчетДляОбмена КАК ОткрытьДепозитарныйСчетДляОбмена,
		|	ЗаявкиПайщиков.ПЭП_НомерТелефона КАК ПЭП_НомерТелефона,
		|	ЗаявкиПайщиков.ПЭП_Код КАК ПЭП_Код,
		|	ЗаявкиПайщиков.ПЭП_ДатаВремяПодписи КАК ПЭП_ДатаВремяПодписи,
		|	ЗаявкиПайщиков.ЕстьОшибкиДанных КАК ЕстьОшибкиДанных
		|ПОМЕСТИТЬ _ДанныеЗаявок
		|ИЗ
		|	&ЗаявкиПайщиков КАК ЗаявкиПайщиков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов,
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыВоВнешнихСистемах
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.АнкетыФизическихЛиц), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыВоВнешнихСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЗаявок.НомерЗаявки КАК НомерЗаявки,
		|	_ДанныеЗаявок.Идентификатор КАК Идентификатор,
		|	_ДанныеЗаявок.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	_ДанныеЗаявок.ИдентификаторПифа КАК ИдентификаторПифа,
		|	_ДанныеЗаявок.ИдентификаторПифаДляОбмена КАК ИдентификаторПифаДляОбмена,
		|	_КодыЗаявок.Объект КАК ЗаявкаПайщика,
		|	_КодыПайщиков.Объект КАК Пайщик,
		|	_КодыПифов.Объект КАК Пиф,
		|	_КодыПифовДляОбмена.Объект КАК ПифДляОбмена,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Анкета,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Период КАК ДатаАнкетныхДанных
		|ПОМЕСТИТЬ _ОбъектыУчетнойСистемы
		|ИЗ
		|	_ДанныеЗаявок КАК _ДанныеЗаявок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыЗаявок
		|		ПО _ДанныеЗаявок.Идентификатор = _КодыЗаявок.Код
		|			И (_КодыЗаявок.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыПайщиков
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|					&ДатаКонецДня,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						И ЮрФизЛицо В
		|							(ВЫБРАТЬ
		|								_КодыПайщиков.Объект
		|							ИЗ
		|								_КодыВоВнешнихСистемах КАК _КодыПайщиков
		|							ГДЕ
		|								_КодыПайщиков.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица))) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|			ПО _КодыПайщиков.Объект = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ПО _ДанныеЗаявок.ИдентификаторПользователя = _КодыПайщиков.Код
		|			И (_КодыПайщиков.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыПифов
		|		ПО _ДанныеЗаявок.ИдентификаторПифа = _КодыПифов.Код
		|			И (_КодыПифов.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыПифовДляОбмена
		|		ПО _ДанныеЗаявок.ИдентификаторПифаДляОбмена = _КодыПифовДляОбмена.Код
		|			И (_КодыПифов.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))
		|			И (_ДанныеЗаявок.ИдентификаторПифаДляОбмена <> """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Идентификатор КАК Идентификатор,
		|	ВложенныйЗапрос.НомерСчетаДепо КАК НомерСчета,
		|	ВложенныйЗапрос.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	ВложенныйЗапрос.ИдентификаторПифа КАК ИдентификаторПифа,
		|	ВложенныйЗапрос.Пайщик КАК Пайщик,
		|	ВложенныйЗапрос.Пиф КАК Пиф,
		|	ДепозитарныеСчета.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ДепозитарныеСчета
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеЗаявок.Идентификатор КАК Идентификатор,
		|		_ДанныеЗаявок.НомерСчетаДепо КАК НомерСчетаДепо,
		|		_ОбъектыУчетнойСистемы.Пайщик КАК Пайщик,
		|		_ОбъектыУчетнойСистемы.Пиф КАК Пиф,
		|		_ОбъектыУчетнойСистемы.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|		_ОбъектыУчетнойСистемы.ИдентификаторПифа КАК ИдентификаторПифа
		|	ИЗ
		|		_ДанныеЗаявок КАК _ДанныеЗаявок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОбъектыУчетнойСистемы КАК _ОбъектыУчетнойСистемы
		|			ПО _ДанныеЗаявок.Идентификатор = _ОбъектыУчетнойСистемы.Идентификатор
		|				И (_ДанныеЗаявок.НомерСчетаДепо <> """")
		|	ГДЕ
		|		НЕ(_ОбъектыУчетнойСистемы.Пайщик ЕСТЬ NULL
		|					И _ОбъектыУчетнойСистемы.Пиф ЕСТЬ NULL)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеЗаявок.Идентификатор,
		|		_ДанныеЗаявок.НомерСчетаДепоДляОбмена,
		|		_ОбъектыУчетнойСистемы.Пайщик,
		|		_ОбъектыУчетнойСистемы.ПифДляОбмена,
		|		_ОбъектыУчетнойСистемы.ИдентификаторПользователя,
		|		_ОбъектыУчетнойСистемы.ИдентификаторПифаДляОбмена
		|	ИЗ
		|		_ДанныеЗаявок КАК _ДанныеЗаявок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОбъектыУчетнойСистемы КАК _ОбъектыУчетнойСистемы
		|			ПО _ДанныеЗаявок.Идентификатор = _ОбъектыУчетнойСистемы.Идентификатор
		|				И (_ДанныеЗаявок.НомерСчетаДепоДляОбмена <> """")
		|	ГДЕ
		|		НЕ(_ОбъектыУчетнойСистемы.Пайщик ЕСТЬ NULL
		|					И _ОбъектыУчетнойСистемы.ПифДляОбмена ЕСТЬ NULL)) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
		|		ПО ВложенныйЗапрос.Пайщик = ДепозитарныеСчета.ВладелецСчета
		|			И ВложенныйЗапрос.Пиф = ДепозитарныеСчета.Эмитент
		|			И ВложенныйЗапрос.НомерСчетаДепо = ДепозитарныеСчета.НомерСчета
		|			И (ДепозитарныеСчета.Организация = &Организация)
		|			И (ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.Лицевой))
		|			И (НЕ ДепозитарныеСчета.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОбъектыУчетнойСистемы.Идентификатор КАК ИдентификаторЗаявки,
		|	_ОбъектыУчетнойСистемы.ИдентификаторПифа КАК ИдентификаторПифа
		|ПОМЕСТИТЬ _ОшибкиОпределенияПифов
		|ИЗ
		|	_ОбъектыУчетнойСистемы КАК _ОбъектыУчетнойСистемы
		|ГДЕ
		|	_ОбъектыУчетнойСистемы.Пиф ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ОбъектыУчетнойСистемы.Идентификатор,
		|	_ОбъектыУчетнойСистемы.ИдентификаторПифаДляОбмена
		|ИЗ
		|	_ОбъектыУчетнойСистемы КАК _ОбъектыУчетнойСистемы
		|ГДЕ
		|	_ОбъектыУчетнойСистемы.ПифДляОбмена ЕСТЬ NULL
		|	И _ОбъектыУчетнойСистемы.ИдентификаторПифаДляОбмена <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДепозитарныеСчета.Идентификатор КАК ИдентификаторЗаявки,
		|	_ДепозитарныеСчета.НомерСчета КАК НомерСчета,
		|	_ДепозитарныеСчета.Пайщик КАК Пайщик,
		|	_ДепозитарныеСчета.Пиф КАК Пиф
		|ПОМЕСТИТЬ _ОшибкиОпределенияДепозитарныхСчетов
		|ИЗ
		|	_ДепозитарныеСчета КАК _ДепозитарныеСчета
		|ГДЕ
		|	_ДепозитарныеСчета.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЗаявок.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	_ДанныеЗаявок.ИдентификаторПифа КАК ИдентификаторПифа
		|ПОМЕСТИТЬ _ОшибкиДублейЗаявок
		|ИЗ
		|	_ДанныеЗаявок КАК _ДанныеЗаявок
		|ГДЕ
		|	_ДанныеЗаявок.Статус = ""in_queue""
		|	И _ДанныеЗаявок.Многократная
		|	И _ДанныеЗаявок.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеЗаявок.ИдентификаторПользователя,
		|	_ДанныеЗаявок.ИдентификаторПифа
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ДанныеЗаявок.Идентификатор) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОбъектыУчетнойСистемы.Пайщик КАК Ссылка,
		|	_ОбъектыУчетнойСистемы.Анкета КАК АнкетаСсылка,
		|	_ОбъектыУчетнойСистемы.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	NULL КАК ДатаАнкетныхДанных
		|ИЗ
		|	_ОбъектыУчетнойСистемы КАК _ОбъектыУчетнойСистемы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеЗаявок КАК _ДанныеЗаявок
		|		ПО _ОбъектыУчетнойСистемы.Идентификатор = _ДанныеЗаявок.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиОпределенияПифов КАК _ОшибкиОпределенияПифов
		|		ПО _ОбъектыУчетнойСистемы.Идентификатор = _ОшибкиОпределенияПифов.ИдентификаторЗаявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиДублейЗаявок КАК _ОшибкиДублейЗаявок
		|		ПО _ОбъектыУчетнойСистемы.ИдентификаторПользователя = _ОшибкиДублейЗаявок.ИдентификаторПользователя
		|			И _ОбъектыУчетнойСистемы.ИдентификаторПифа = _ОшибкиДублейЗаявок.ИдентификаторПифа
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиОпределенияДепозитарныхСчетов КАК _ОшибкиОпределенияДепозитарныхСчетов
		|		ПО _ОбъектыУчетнойСистемы.Идентификатор = _ОшибкиОпределенияДепозитарныхСчетов.ИдентификаторЗаявки
		|ГДЕ
		|	НЕ _ДанныеЗаявок.ЕстьОшибкиДанных
		|	И _ОшибкиОпределенияПифов.ИдентификаторПифа ЕСТЬ NULL
		|	И _ОшибкиДублейЗаявок.ИдентификаторПользователя ЕСТЬ NULL
		|	И _ОшибкиОпределенияДепозитарныхСчетов.ИдентификаторЗаявки ЕСТЬ NULL
		|	И (_ОбъектыУчетнойСистемы.Пайщик ЕСТЬ NULL
		|			ИЛИ _ОбъектыУчетнойСистемы.Анкета ЕСТЬ NULL
		|			ИЛИ _ДанныеЗаявок.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление)
		|				И _ДанныеЗаявок.ОткрытьЗакрытьДепозитарныйСчет
		|			ИЛИ _ДанныеЗаявок.ВидЗаявки В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Погашение), ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)))
		|	И РАЗНОСТЬДАТ(ЕСТЬNULL(_ОбъектыУчетнойСистемы.ДатаАнкетныхДанных, ДАТАВРЕМЯ(2000, 1, 1)), &ДатаНачалоДня, ДЕНЬ) > 0";
	
#КонецОбласти

	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЗаявкиПайщиков", ЗаявкиПайщиков);
	Запрос.УстановитьПараметр("ДатаНачалоДня", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКонецДня", КонецДня(ЭтотОбъект.Дата));
	
	ТаблицаАнкет = Запрос.Выполнить().Выгрузить(); 
	
	ОшибкиОпределенияПифов = МВТ.Таблицы["_ОшибкиОпределенияПифов"].ПолучитьДанные().Выбрать();
	
	Пока ОшибкиОпределенияПифов.Следующий() Цикл
		ЗафиксироватьСообщение("Не удалось определить ПИФ по коду системы ЕСИА.Финанс [" + ОшибкиОпределенияПифов.ИдентификаторПифа + "]");	
	КонецЦикла; 
	
	ОшибкиДублейЗаявок = МВТ.Таблицы["_ОшибкиДублейЗаявок"].ПолучитьДанные().Выбрать();
	
	Пока ОшибкиДублейЗаявок.Следующий() Цикл
		ЗафиксироватьСообщение("Ошибка загрузки заявки пайщика. Из системы ЕСИА.Финанс для пользователя [" + ОшибкиДублейЗаявок.ИдентификаторПользователя + "] получено несколько заявок.");	
	КонецЦикла;
	
	ОшибкиСчетовДепо = МВТ.Таблицы["_ОшибкиОпределенияДепозитарныхСчетов"].ПолучитьДанные().Выбрать();
	
	Пока ОшибкиСчетовДепо.Следующий() Цикл
		ЗафиксироватьСообщение("Не удалось найти в 1С лицевой счет по номеру [" + ОшибкиСчетовДепо.НомерСчета + "].
								| Пользователь [" + ОшибкиСчетовДепо.Пайщик + "], ID заявки [" + ОшибкиСчетовДепо.ИдентификаторЗаявки + "]");	
	КонецЦикла;

	Если ТаблицаАнкет.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ДанныеПользователей = ДесериализоватьДанныеПользователейЕсиа(ТаблицаАнкет, ПараметрыПодключения); //получаем данные пайщиков (физ лиц) на основании данных заявок
	БанковскиеСчета = ДесериализоватьДанныеБанковскихСчетовЕсиа(ДанныеПользователей, ПараметрыПодключения);
				
	//загружаем анкеты в 1С 
	СформироватьИЗагрузитьАнкеты(ДанныеПользователей, БанковскиеСчета, МВТ, ПараметрыПодключения);
				
#Область Текст_Запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЗаявок.Идентификатор КАК Идентификатор,
		|	_ДанныеЗаявок.ВидЗаявки КАК ВидЗаявки,
		|	_ДанныеЗаявок.Статус КАК Статус,
		|	_ДанныеЗаявок.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	_ДанныеЗаявок.НомерЗаявки КАК НомерЗаявки,
		|	_ДанныеЗаявок.ДатаЗаявки КАК ДатаЗаявки,
		|	_ДанныеЗаявок.ИдентификаторПифа КАК ИдентификаторПифа,
		|	_ДанныеЗаявок.Сумма КАК Сумма,
		|	_ДанныеЗаявок.Количество КАК Количество,
		|	_ДанныеЗаявок.Многократная КАК Многократная,
		|	_ДанныеЗаявок.ПЭП_НомерТелефона КАК ПЭП_НомерТелефона,
		|	_ДанныеЗаявок.ПЭП_Код КАК ПЭП_Код,
		|	_ДанныеЗаявок.ПЭП_ДатаВремяПодписи КАК ПЭП_ДатаВремяПодписи,
		|	_ДанныеЗаявок.ОткрытьЗакрытьДепозитарныйСчет КАК ОткрытьЗакрытьДепозитарныйСчет,
		|	_ДанныеЗаявок.ОткрытьДепозитарныйСчетДляОбмена КАК ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена,
		|	_ОбъектыУчетнойСистемы.ЗаявкаПайщика КАК Ссылка,
		|	_ОбъектыУчетнойСистемы.Пайщик КАК Пайщик,
		|	_ОбъектыУчетнойСистемы.Пиф КАК ПаевойИнвестиционныйФонд,
		|	_ОбъектыУчетнойСистемы.ПифДляОбмена КАК ПаевойИнвестиционныйФондДляОбменаПаев,
		|	_ДанныеБанковскихСчетов.Ссылка КАК РасчетныйСчет,
		|	_ДанныеБанковскихСчетов.ЮрФизЛицо КАК ВладелецСчета,
		|	_ДанныеБанковскихСчетов.Бик КАК БИК,
		|	_ДанныеБанковскихСчетов.КоррСчет КАК КоррСчет,
		|	_ДанныеБанковскихСчетов.НомерСчета КАК НомерСчета,
		|	_ДанныеБанковскихСчетов.ПолучательПлатежа КАК ПолучательПлатежа,
		|	_ДанныеБанковскихСчетов.ИННПолучателя КАК ИННПолучателя,
		|	_ДанныеБанковскихСчетов.НазначениеПлатежа КАК НазначениеПлатежа,
		|	_ДанныеБанковскихСчетов.НаименованиеБанка КАК НаименованиеБанка,
		|	_ДепозитарныеСчета.Ссылка КАК ДепозитарныйСчет,
		|	_ДепозитарныеСчетаДляОбмена.Ссылка КАК ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена
		|ИЗ
		|	_ДанныеЗаявок КАК _ДанныеЗаявок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбъектыУчетнойСистемы КАК _ОбъектыУчетнойСистемы
		|		ПО _ДанныеЗаявок.Идентификатор = _ОбъектыУчетнойСистемы.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиОпределенияПифов КАК _ОшибкиОпределенияПифов
		|		ПО _ДанныеЗаявок.Идентификатор = _ОшибкиОпределенияПифов.ИдентификаторЗаявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеБанковскихСчетов КАК _ДанныеБанковскихСчетов
		|		ПО _ДанныеЗаявок.ИдентификаторРасчетногоСчета = _ДанныеБанковскихСчетов.Идентификатор
		|			И _ДанныеЗаявок.ИдентификаторПользователя = _ДанныеБанковскихСчетов.ИдентификаторПользователя
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиДублейЗаявок КАК _ОшибкиДублейЗаявок
		|		ПО _ДанныеЗаявок.ИдентификаторПользователя = _ОшибкиДублейЗаявок.ИдентификаторПользователя
		|			И _ДанныеЗаявок.ИдентификаторПифа = _ОшибкиДублейЗаявок.ИдентификаторПифа
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиОпределенияДепозитарныхСчетов КАК _ОшибкиОпределенияДепозитарныхСчетов
		|		ПО _ДанныеЗаявок.Идентификатор = _ОшибкиОпределенияДепозитарныхСчетов.ИдентификаторЗаявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _ДанныеЗаявок.Идентификатор = _ДепозитарныеСчета.Идентификатор
		|			И _ДанныеЗаявок.НомерСчетаДепо = _ДепозитарныеСчета.НомерСчета
		|			И _ДанныеЗаявок.ИдентификаторПользователя = _ДепозитарныеСчета.ИдентификаторПользователя
		|			И _ДанныеЗаявок.ИдентификаторПифа = _ДепозитарныеСчета.ИдентификаторПифа
		|			И (_ДанныеЗаявок.НомерСчетаДепо <> """")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчетаДляОбмена
		|		ПО _ДанныеЗаявок.Идентификатор = _ДепозитарныеСчетаДляОбмена.Идентификатор
		|			И _ДанныеЗаявок.НомерСчетаДепо = _ДепозитарныеСчетаДляОбмена.НомерСчета
		|			И _ДанныеЗаявок.ИдентификаторПользователя = _ДепозитарныеСчетаДляОбмена.ИдентификаторПользователя
		|			И _ДанныеЗаявок.ИдентификаторПифа = _ДепозитарныеСчетаДляОбмена.ИдентификаторПифа
		|			И (_ДанныеЗаявок.НомерСчетаДепоДляОбмена <> """")
		|ГДЕ
		|	НЕ _ДанныеЗаявок.ЕстьОшибкиДанных
		|	И _ОбъектыУчетнойСистемы.ЗаявкаПайщика ЕСТЬ NULL
		|	И _ОшибкиОпределенияПифов.ИдентификаторПифа ЕСТЬ NULL
		|	И _ОшибкиДублейЗаявок.ИдентификаторПользователя ЕСТЬ NULL
		|	И _ОшибкиОпределенияДепозитарныхСчетов.ИдентификаторЗаявки ЕСТЬ NULL";
#КонецОбласти

	ВыборкаЗаявок = Запрос.Выполнить().Выбрать();

	Пока ВыборкаЗаявок.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(ВыборкаЗаявок.Ссылка) Тогда
			
			СтрокаТаблицыЗаявок = ЗаявкиПайщиков.Найти(ВыборкаЗаявок.Идентификатор, "Идентификатор"); 
			
			Если СтрокаТаблицыЗаявок = Неопределено Тогда
				ЗафиксироватьСообщение("Не удалось сверить и обновить файлы к заявке [" + ВыборкаЗаявок.Идентификатор + "].");
			Иначе
				ЗагрузитьФайлыВХранилище(ВыборкаЗаявок.Ссылка, СтрокаТаблицыЗаявок.МассивФайлов, Истина);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		ДокЗаявка = Документы.ЗаявкаПайщика.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(ДокЗаявка, ВыборкаЗаявок);
		
		ДокЗаявка.Дата			= ВыборкаЗаявок.ДатаЗаявки;
		ДокЗаявка.Организация	= ЭтотОбъект.Организация;
		
		ДокЗаявка.ИсточникЗаявки = Перечисления.ИсточникиАнкетИЗаявок.Сайт;
		ДокЗаявка.ВидПайщика = Перечисления.ВидыПайщиков.Владелец;
		ДокЗаявка.СобственностьНаПаи = Перечисления.ВидыСобственности.НеДолеваяНеСовместная;
		
		Если Не ЗначениеЗаполнено(ДокЗаявка.Пайщик) Тогда
			
			СтрокаТаблицыПользователей = ДанныеПользователей.Найти(ВыборкаЗаявок.ИдентификаторПользователя, "Идентификатор");
				
			Если СтрокаТаблицыПользователей = Неопределено Тогда
				ЗафиксироватьСообщение("Не удалось импортировать заявку [" + ВыборкаЗаявок.Идентификатор + "]. Не удалось импортировать пользователя [id " + ВыборкаЗаявок.ИдентификаторПользователя + "].");
				Продолжить;
			Иначе
				ДокЗаявка.Пайщик = СтрокаТаблицыПользователей.Ссылка;
			КонецЕсли;
	
		КонецЕсли;
		
		ДокЗаявка.Владелец = ДокЗаявка.Пайщик;		
		
		Если ЗначениеЗаполнено(ДокЗаявка.РасчетныйСчет)
			И ВыборкаЗаявок.ВладелецСчета <> ДокЗаявка.Пайщик Тогда
			
			ДокЗаявка.РасчетныйСчет = Неопределено;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		ДокЗаявка.Записать(РежимЗаписиДокумента.Проведение);
		РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(ДокЗаявка.Ссылка,
			Справочники.ВнешниеСистемы.ЕсиаФинанс,
			Справочники.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков, ВыборкаЗаявок.Идентификатор);
			
		ЗафиксироватьСообщение("Загружен документ [" + ДокЗаявка + "]. Физ лицо " + ДокЗаявка.Пайщик, Ложь); 
				
		СтрокаТаблицыЗаявок = ЗаявкиПайщиков.Найти(ВыборкаЗаявок.Идентификатор, "Идентификатор"); 
			
		Если СтрокаТаблицыЗаявок = Неопределено Тогда
			ЗафиксироватьСообщение("Не удалось загрузить файлы к заявке [" + ВыборкаЗаявок.Идентификатор + "].");
		Иначе
			ЗагрузитьФайлыВХранилище(ДокЗаявка.Ссылка, СтрокаТаблицыЗаявок.МассивФайлов);
		КонецЕсли;
		
		//ОтменитьТранзакцию();
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
																
КонецПроцедуры 

Функция ПолучитьМассивФайлов(ВнешнниеДанные, ПараметрыПодключения)
	
	МассивФайлов = Новый Массив;
	
	Для Каждого СтрокаДанных Из ВнешнниеДанные Цикл 
		
		ТекстСообщения = "Не удалось получить Файл из системы ЕСИА.Финанс по id " + СтрокаДанных.id;
				
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос(
			"GET", 
			ПараметрыПодключения, 
			"/api/v1/back_office/attachments/" + СтрокаДанных.id,
			, 
			ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		ДвоичныеДанныеФайла = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("ПолноеИмя", СтрокаДанных.filename);
		ОписаниеФайла.Вставить("Хранение", ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла));
				
		МассивФайлов.Добавить(ОписаниеФайла);
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции 

Процедура ЗагрузитьФайлыВХранилище(Родитель, МассивФайлов, СверитьФайлы = Ложь)
	
	Если СверитьФайлы Тогда
		
		РанееЗагруженныеДанные = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(Родитель);
		
		Для Каждого ЭлементДанных Из РанееЗагруженныеДанные Цикл
			
			РанееЗагруженныйФайл = РаботаСФайловымХранилищем.ПолучитьФайл(ЭлементДанных.ИдентификаторФайла); 
			
			Для Инд = 0 По МассивФайлов.Количество() - 1 Цикл
				
				НовыйФайл = МассивФайлов[Инд];
				
				Если НовыйФайл.ПолноеИмя = РанееЗагруженныйФайл.Имя + "." + РанееЗагруженныйФайл.Расширение 
					И ПолучитьИзВременногоХранилища(НовыйФайл.Хранение) = ПолучитьИзВременногоХранилища(РанееЗагруженныйФайл.Адрес) Тогда
					
					МассивФайлов.Удалить(Инд);
					Прервать;
				КонецЕсли;
					
			КонецЦикла;
				
		КонецЦикла;
			
	КонецЕсли;
	
	//Что делать если в 1С есть файлы которых нет в Есиа.Финанс ?????
	
	Если МассивФайлов.Количество() > 0 Тогда 
		
		ДанныеВерсий = Обработки.РаботаСФайлами.ПрисоединитьФайл(Родитель, МассивФайлов);
		
		Если ДанныеВерсий.Количество() = 0 Тогда
			
			ЗафиксироватьСообщение("Не удалось загрузить файлы к объекту [" + СокрЛП(Родитель) + "]");
			
		Иначе
			
			Для Каждого ЗаписьВерсии Из ДанныеВерсий Цикл
				
				Если ЗаписьВерсии.Свойство("ТекстОшибки") Тогда
					ЗафиксироватьСообщение(ЗаписьВерсии.ТекстОшибки);
				Иначе                                                                         
					
					ЗафиксироватьСообщение("К " + ?(ТипЗнч(Родитель) = Тип("ДокументСсылка.ЗаявкаПайщика"), "документу", "анкете") + " [" + Родитель + "] загружен файл [" + ЗаписьВерсии.ПолноеИмя + "]", Ложь);
					
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры

Процедура УстановитьСтатус(ЗаявкаПайщика, НовыйСтатус, Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК КодЗаявки
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков)
		|				И Объект = &ЗаявкаПайщика) КАК КодыВоВнешнихСистемахСрезПоследних";
	Запрос.УстановитьПараметр("ЗаявкаПайщика", ЗаявкаПайщика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		ПараметрыПодключения = ПолучитьПараметрыПодключения(); 
		
		ТекстСообщения = "Не удалось установить статус [" + ПолучитьСтатусЗаявки(НовыйСтатус) + "] завке " + ЗаявкаПайщика;
		
		ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("status", НовыйСтатус)); 
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PATCH", ПараметрыПодключения, "/api/v1/back_office/claims/" + Выборка.КодЗаявки, ТелоЗапроса, ТекстСообщения);
	
		Если HTTPОтвет = Неопределено Тогда
			ЗафиксироватьСообщение(ТекстСообщения,, Отказ);	
		Иначе	
			ЗафиксироватьСообщение("Операции [" + ЗаявкаПайщика + "] установлен статус [" + ПолучитьСтатусЗаявки(НовыйСтатус) + "]", Ложь);	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПрочитатьАдресФИАС(ДанныеЕсиа) 
	
	ИменаПолейАдреса = Новый Соответствие;	
	ИменаПолейАдреса.Вставить("Страна", "country");	
	ИменаПолейАдреса.Вставить("Индекс", "index");	
	ИменаПолейАдреса.Вставить("Регион", "region");		
	ИменаПолейАдреса.Вставить("Район", "district");	
	ИменаПолейАдреса.Вставить("НаселенныйПункт", "city");	
	ИменаПолейАдреса.Вставить("Улица", "street");
	ИменаПолейАдреса.Вставить("Дом", "house");	
	ИменаПолейАдреса.Вставить("Корпус", "corps");	
	ИменаПолейАдреса.Вставить("Квартира", "flat");

	Страна = ДанныеЕсиа[ИменаПолейАдреса.Получить("Страна")];
	Индекс = ДанныеЕсиа[ИменаПолейАдреса.Получить("Индекс")];
	Регион = ДанныеЕсиа[ИменаПолейАдреса.Получить("Регион")];
	Район  = ДанныеЕсиа[ИменаПолейАдреса.Получить("Район")];
	Город  = ДанныеЕсиа[ИменаПолейАдреса.Получить("НаселенныйПункт")];
	Улица  = ДанныеЕсиа[ИменаПолейАдреса.Получить("Улица")];
	
	Дом      = ДанныеЕсиа[ИменаПолейАдреса.Получить("Дом")];
	
	Дом = СтрЗаменить(Дом, "дом", "");
	Дом = СтрЗаменить(Дом, "д.", "");
	Дом = СокрЛП(СтрЗаменить(Дом, "д", ""));

	Корпус   = ДанныеЕсиа[ИменаПолейАдреса.Получить("Корпус")];
	Квартира = ДанныеЕсиа[ИменаПолейАдреса.Получить("Квартира")];	
		
	ПредставлениеАдреса = "";
	ДополнитьПредставлениеАдреса(Страна, ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(Индекс, ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(Регион, ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(Район,  ", ", ПредставлениеАдреса, Истина);
	ДополнитьПредставлениеАдреса(Город,  ", ", ПредставлениеАдреса, Истина);
	
	ДополнитьПредставлениеАдреса(Улица,    ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(?(ПустаяСтрока(Дом), "", "дом " + Дом),           ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(?(ПустаяСтрока(Корпус), "", "корп. " + Корпус),   ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(?(ПустаяСтрока(Квартира), "", "кв. " + Квартира), ", ", ПредставлениеАдреса);
	
	ПространствоИмен = "http://www.v8.1c.ru/ssl/contactinfo";
	
	РезультатXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
	РезультатXDTO.Состав = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "Адрес"));
	РезультатXDTO.Представление = ПредставлениеАдреса;
	
	Адрес = РезультатXDTO.Состав;
		
	Если ЗначениеЗаполнено(Страна) И Страна <> "Российская Федерация" Тогда
		
		Адрес.Страна = Страна;
		Адрес.Состав = ПредставлениеАдреса;
		
	Иначе
		Адрес.Страна = "РОССИЯ";
		АдресРФ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "АдресРФ"));
		
		Если ЗначениеЗаполнено(Индекс) Тогда
			ЭлементИндекс = СоздатьДопАдрЭлемента(АдресРФ);
			ЭлементИндекс.ТипАдрЭл = "10100000";
			ЭлементИндекс.Значение = Индекс;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Регион) Тогда
			АдресРФ.СубъектРФ = Регион;
		КонецЕсли;
				
		Если ЗначениеЗаполнено(Район) Тогда
			АдресРФ.СвРайМО = ФабрикаXDTO.Создать(АдресРФ.Тип().Свойства.Получить("СвРайМО").Тип);
			АдресРФ.СвРайМО.Район = Район;

		КонецЕсли;
		
		Если ЗначениеЗаполнено(Город) Тогда
			АдресРФ.Город = Город;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Улица) Тогда
			АдресРФ.Улица = Улица;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Дом) Тогда
			ЭлементДом = СоздатьНомерДопАдрЭлемента(АдресРФ);
			ЭлементДом.Тип = "1010";
			ЭлементДом.Значение = Дом;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Корпус) Тогда
			ЭлементКорпус = СоздатьНомерДопАдрЭлемента(АдресРФ);
			ЭлементКорпус.Тип = "1050";
			ЭлементКорпус.Значение = Корпус;

		КонецЕсли;
				
		Если ЗначениеЗаполнено(Квартира) Тогда
			ЭлементКвартира = СоздатьНомерДопАдрЭлемента(АдресРФ);
			ЭлементКвартира.Тип = "2010";
			ЭлементКвартира.Значение = Квартира;
		КонецЕсли;
		
		Адрес.Состав = АдресРФ;
	КонецЕсли;
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиXML(, , Ложь, Ложь, ""));
	
	ФабрикаXDTO.ЗаписатьXML(Запись, РезультатXDTO);
	
	РезультатXDTO = СтрЗаменить(Запись.Закрыть(), Символы.ПС, "&#10;");
	
	Возврат РезультатXDTO;
	
КонецФункции 

Процедура ДополнитьПредставлениеАдреса(Дополнение, СтрокаКонкатенации, Представление, ПропускатьНайденныйТекст = Ложь)
	
	Если ПропускатьНайденныйТекст и СтрНайти(Представление, СтрокаКонкатенации + Дополнение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Дополнение <> "" Тогда
		Представление = Представление + ?(ПустаяСтрока(Представление), "", СтрокаКонкатенации) + Дополнение;
	КонецЕсли;
	
КонецПроцедуры 

Функция СоздатьНомерДопАдрЭлемента(АдресРФ) Экспорт 
	ДопАдрЭл = СоздатьДопАдрЭлемента(АдресРФ);
	ДопАдрЭл.Номер = ФабрикаXDTO.Создать(ДопАдрЭл.Тип().Свойства.Получить("Номер").Тип);
	Возврат ДопАдрЭл.Номер;
КонецФункции

Функция СоздатьДопАдрЭлемента(АдресРФ) Экспорт
	СвойствоДопАдрЭлемента = АдресРФ.ДопАдрЭл.ВладеющееСвойство;
	ДопАдрЭлемента = ФабрикаXDTO.Создать(СвойствоДопАдрЭлемента.Тип);
	АдресРФ.ДопАдрЭл.Добавить(ДопАдрЭлемента);
	Возврат ДопАдрЭлемента;
КонецФункции

Функция ПрочитатьАдрес(ДанныеЕсиа)
	
	ИменаПолейАдреса = Новый Соответствие;	
	ИменаПолейАдреса.Вставить("Страна", "country");	
	ИменаПолейАдреса.Вставить("Индекс", "index");	
	ИменаПолейАдреса.Вставить("Регион", "region");		
	ИменаПолейАдреса.Вставить("Район", "district");	
	ИменаПолейАдреса.Вставить("НаселенныйПункт", "city");	
	ИменаПолейАдреса.Вставить("Улица", "street");
	ИменаПолейАдреса.Вставить("Дом", "house");	
	ИменаПолейАдреса.Вставить("Корпус", "corps");		
	ИменаПолейАдреса.Вставить("Квартира", "flat");

	Страна = ДанныеЕсиа[ИменаПолейАдреса.Получить("Страна")];
	Индекс = ДанныеЕсиа[ИменаПолейАдреса.Получить("Индекс")];
	Регион = ДанныеЕсиа[ИменаПолейАдреса.Получить("Регион")];
	Район  = ДанныеЕсиа[ИменаПолейАдреса.Получить("Район")];
	Город  = ДанныеЕсиа[ИменаПолейАдреса.Получить("НаселенныйПункт")];
	Улица  = ДанныеЕсиа[ИменаПолейАдреса.Получить("Улица")];
	
	Дом      = ДанныеЕсиа[ИменаПолейАдреса.Получить("Дом")];
	Корпус   = ДанныеЕсиа[ИменаПолейАдреса.Получить("Корпус")];
	Квартира = ДанныеЕсиа[ИменаПолейАдреса.Получить("Квартира")];
		
	ПредставлениеАдреса = "";
	ДополнитьПредставлениеАдреса(Страна,   ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(Индекс,   ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(Регион,   ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(Район,    ", ", ПредставлениеАдреса, Истина);
	ДополнитьПредставлениеАдреса(Город,    ", ", ПредставлениеАдреса, Истина);
	
	ДополнитьПредставлениеАдреса(Улица,    ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(?(ПустаяСтрока(Дом), "", "дом " + Дом),            ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(?(ПустаяСтрока(Корпус), "", "корп. " + Корпус),    ", ", ПредставлениеАдреса);
	ДополнитьПредставлениеАдреса(?(ПустаяСтрока(Квартира), "", "кв. " + Квартира),  ", ", ПредставлениеАдреса);
	
	Возврат ПредставлениеАдреса;
	
КонецФункции

Функция ПолучитьЗначенияРеквизитовАнкетыПользователя(ДанныеЕсиа, ПараметрыПодключения) 
	
	ДанныеДляОпределенияСсылок = Новый Структура();
	АнкетныеДанные = Новый Структура;
			
	Если Не ДанныеЕсиа.Свойство("person_info") Тогда
		ЗафиксироватьСообщение("Не удалось получить данные физ. лица по идентификатору ЕСИА.Финанс [" + ДанныеЕсиа.id + "]");
		Возврат Неопределено;
	КонецЕсли; 
	
	Если Не (ДанныеЕсиа.Свойство("fill_stage") И (ДанныеЕсиа.fill_stage = "active" Или ДанныеЕсиа.fill_stage = "filled" Или ДанныеЕсиа.fill_stage = "claim")) Тогда
		ЗафиксироватьСообщение("Текущий статус пользователя ЕСИА.Финанс [" + ?(ДанныеЕсиа.Свойство("fill_stage"), ДанныеЕсиа.fill_stage, "нет статуса") + "], [id пользователя " + ДанныеЕсиа.id + "]. Анкета не будет загружена.");
		Возврат Неопределено;	
	КонецЕсли;
	// по умолчанию идентификация происходит по СМЭВ
	Если Не (ДанныеЕсиа.Свойство("identification_type") И ДанныеЕсиа.identification_type = "smev") Тогда
		ЗафиксироватьСообщение("Данные пользователя ЕСИА.Финанс не прошли первичную идентификацию [identification_type = " 
			+ ?(ДанныеЕсиа.Свойство("identification_type"), ДанныеЕсиа.identification_type, "отсутствует значение") + "], [id пользователя " + ДанныеЕсиа.id + "]. Анкета не будет загружена.");
		Возврат Неопределено;	
	КонецЕсли;
	
	ФизЛицо = ДанныеЕсиа.person_info; 
	
	Если Не (ФизЛицо.Свойство("is_actual") И ФизЛицо.is_actual) Тогда
		ЗафиксироватьСообщение("Данные пользователя ЕСИА.Финанс не актуальны [id пользователя " + ДанныеЕсиа.id + "]. Анкета не будет загружена.");
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Не (ФизЛицо.Свойство("actuality_updated_at") И ЗначениеЗаполнено(ФизЛицо.actuality_updated_at)) Тогда 
		ЗафиксироватьСообщение("В данных пользователя ЕСИА.Финанс [id пользователя " + ДанныеЕсиа.id + "] отсутствует дата актуальности. Анкета не будет загружена.");
		Возврат Неопределено;
	КонецЕсли;
				
	Если Не ФизЛицо.Свойство("document") Тогда
		ЗафиксироватьСообщение("Не удалось получить данные удостоверения личности физ. лица [id пользователя ЕСИА.Финанс " + ДанныеЕсиа.id + "]");
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ДанныеЕсиа.Свойство("checks") Тогда
		ЗафиксироватьСообщение("Анкета пользователя не прошла проверку на стороне ЕСИА.Финанс [id пользователя " + ДанныеЕсиа.id + "]. Данные не будут загружены.");
		Возврат Неопределено;
	КонецЕсли; 
	
	РезультатыПроверок = ДанныеЕсиа.checks; 
	
	Если Не РезультатыПроверок.Свойство("is_valid_info") Или Не РезультатыПроверок.is_valid_info Тогда
		ЗафиксироватьСообщение("Данные пользователя не подтверждены менеджером [id пользователя ЕСИА.Финанс " + ДанныеЕсиа.id + "]. Анкета не будет загружена.");
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Не (РезультатыПроверок.Свойство("no_pi_change_claim") И РезультатыПроверок.no_pi_change_claim) Тогда
		ЗафиксироватьСообщение("У пользователя есть неподтвержденные заявки на изменение личных данных [id пользователя ЕСИА.Финанс " + ДанныеЕсиа.id + "]. Анкета не будет загружена.");
		Возврат Неопределено;	
	КонецЕсли;
		
	//проверяем подписи анкет
	Если ФизЛицо.Свойство("attachments") Тогда 
		
		Для Каждого ТекВложение Из ФизЛицо.attachments Цикл
			
			Если ТекВложение.kind = "anket_data" И ТекВложение.Свойство("client_sign") Тогда
				
				Если ПодписьВалидна(ТекВложение.client_sign) Тогда 
					
					Если СтрНачинаетсяС(ТекВложение.description, "Согласие ОПД") Тогда
				    	АнкетныеДанные.Вставить("СогласиеНаПередачуИнформации", Истина);
				    КонецЕсли;
				
				Иначе
					
					ЗафиксироватьСообщение("Не удалось получить данные физ. лица по идентификатору ЕСИА.Финанс [" + ДанныеЕсиа.id + "]."
						+ "Отсутствует подпись документа [" + ТекВложение.description + "]");
					Возврат Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		АнкетныеДанные.Вставить("МассивФайлов", ПолучитьМассивФайлов(ФизЛицо.attachments, ПараметрыПодключения));
		
	КонецЕсли;
	
	ДанныеДляОпределенияСсылок.Вставить("ДатаАктуальности", ПолучитьДату(ФизЛицо.actuality_updated_at));
	ДанныеДляОпределенияСсылок.Вставить("Фамилия", ФизЛицо.surname);
	ДанныеДляОпределенияСсылок.Вставить("Имя", ФизЛицо.name);
    ДанныеДляОпределенияСсылок.Вставить("Отчество", ФизЛицо.patronymic);
	ДанныеДляОпределенияСсылок.Вставить("ИНН", ФизЛицо.inn);
	СНИЛС = ФизЛицо.snils;
	
	Если СтрДлина(СНИЛС) = 11 Тогда
		СНИЛС = Лев(СНИЛС, 3) + "-" + Сред(СНИЛС, 4, 3) + "-" + Сред(СНИЛС, 7, 3) + " " + Прав(СНИЛС, 2);
	КонецЕсли;
	
	ДанныеДляОпределенияСсылок.Вставить("СНИЛС", СНИЛС);
	ДанныеДляОпределенияСсылок.Вставить("ДатаРождения", ПолучитьДату(ФизЛицо.birthday));
	ДанныеДляОпределенияСсылок.Вставить("ГражданствоСтр", ВРег(ФизЛицо.nationality));
	
	АнкетныеДанные.Вставить("МестоРождения", ФизЛицо.birth_place);
	АнкетныеДанные.Вставить("Пол", ?(ФизЛицо.male, Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский));
	АнкетныеДанные.Вставить("РезидентРФ", ФизЛицо.Свойство("is_rf_resident") И ФизЛицо.is_rf_resident);

	//Заполним позже одним запросом для всех клиентов
	//АнкетныеДанные.Вставить("Гражданство", Неопределено);
	АнкетныеДанные.Вставить("ВтороеГражданство", Новый Массив);
	АнкетныеДанные.Вставить("НалоговыйРезидентИностранногоГосударстваГосударство", Новый Массив);
	АнкетныеДанные.Вставить("ИностранныйНалогоплательщикГосударство", Новый Массив); 
	//------------------------------------------------

	Если ФизЛицо.is_additional_nationatilies Тогда
		
		ДанныеДляОпределенияСсылок.Вставить("ДопГражданстваСтр", "");
		
		Для Каждого ДопГражданство Из ФизЛицо.additional_nationatilies_items Цикл
			ДанныеДляОпределенияСсылок.ДопГражданстваСтр = ДанныеДляОпределенияСсылок.ДопГражданстваСтр + ВРег(ДопГражданство.country);	
		КонецЦикла;
		
	КонецЕсли;
	
	Если ФизЛицо.Свойство("tax_status_in_foreign") И ФизЛицо.tax_status_in_foreign Тогда
		
		ДанныеДляОпределенияСсылок.Вставить("РезиденстваСтр", "");
		
		Для Каждого Резиденство Из ФизЛицо.tax_status_foreign_items Цикл
			ДанныеДляОпределенияСсылок.РезиденстваСтр = ДанныеДляОпределенияСсылок.РезиденстваСтр + ВРег(Резиденство.country);	
		КонецЦикла;	
		
		АнкетныеДанные.Вставить("НалоговыйРезидентИностранногоГосударства", Истина); 
		
	КонецЕсли;
		
	ДокументФизЛица = ФизЛицо.document;
	
	ДанныеДляОпределенияСсылок.Вставить("ВидДокументаСтр", ДокументФизЛица.kind); 
	ДанныеДляОпределенияСсылок.Вставить("КодСтраныВыдачиДокумента", ВРег(ДокументФизЛица.country_code)); 
	//Заполним позже одним запросом для всех клиентов
	//АнкетныеДанные.Вставить("ВидУдостоверенияЛичности", Неопределено);
	//АнкетныеДанные.Вставить("СтранаВыдачиДокумента", Неопределено);
	//-----------------------------------------------
	//Реквизиты.КодАнкеты = СокрЛП(ДокументФизЛица.series) + " " + ДокументФизЛица.number;
	ДанныеДляОпределенияСсылок.Вставить("СерияУдостоверенияЛичности", ДокументФизЛица.series);
	ДанныеДляОпределенияСсылок.Вставить("НомерУдостоверенияЛичности", ДокументФизЛица.number);
	АнкетныеДанные.Вставить("ДатаВыдачиУдостоверенияЛичности", ПолучитьДату(ДокументФизЛица.issue_date));
	АнкетныеДанные.Вставить("ДатаОкончанияДействияУдостоверенияЛичности", ПолучитьДату(ДокументФизЛица.expiration_date));
	АнкетныеДанные.Вставить("ОрганВыдавшийУдостоверениеЛичности", ДокументФизЛица.issuer);
    АнкетныеДанные.Вставить("КодОрганаВыдавшегоУдостоверениеЛичности", ДокументФизЛица.issuer_code);
		
	Если РезультатыПроверок.Свойство("expired_passports") 
		И РезультатыПроверок.expired_passports <> Неопределено И РезультатыПроверок.expired_passports.status = "Пройдена успешно" Тогда 
		
		АнкетныеДанные.Вставить("СтатусПроверки", Перечисления.СтатусыПроверкиУдостоверенияЛичности.Действителен);
		
	Иначе
		АнкетныеДанные.Вставить("СтатусПроверки", Перечисления.СтатусыПроверкиУдостоверенияЛичности.НеПроверен);	
	КонецЕсли;
	
	АнкетныеДанные.Вставить("ПроверенПоПеречнюТеррористов", 
						(РезультатыПроверок.Свойство("possible_terrorists") И РезультатыПроверок.possible_terrorists <> Неопределено
						И РезультатыПроверок.possible_terrorists.status = "Пройдена успешно"));

	АнкетныеДанные.Вставить("ПроверенПоПеречнюСБООН", 
						(РезультатыПроверок.Свойство("uns") И РезультатыПроверок.uns <> Неопределено
						И РезультатыПроверок.uns.status = "Пройдена успешно"));

	АнкетныеДанные.Вставить("ПроверенПоСпискамРешенийМВК", 
						(РезультатыПроверок.Свойство("frozen_assets") И РезультатыПроверок.frozen_assets <> Неопределено
						И РезультатыПроверок.frozen_assets.status = "Пройдена успешно"));
						
	АнкетныеДанные.Вставить("ПроверенПоБазеОтказовПо764П", 
						(РезультатыПроверок.Свойство("operation_cancels") И РезультатыПроверок.operation_cancels <> Неопределено
						И РезультатыПроверок.operation_cancels.status = "Пройдена успешно"));					
				
	АнкетныеДанные.Вставить("ВысокийУровеньРиска", ДанныеЕсиа.Свойство("risk_level") И ДанныеЕсиа.risk_level = "high");
	
	// Для низкого уровня риска добавляем пояснение
	Если Не АнкетныеДанные.ВысокийУровеньРиска Тогда
		АнкетныеДанные.Вставить("ОбоснованиеУровняРиска", "факторы высокого уровня риска не установлены");
	КонецЕсли;
	
	Если ФизЛицо.Свойство("addresses") Тогда 
		
		Адреса = ФизЛицо.addresses;
		
		АдресРегистрации = "";
		
		Если Адреса.Свойство("main") И Адреса.main.Свойство("full") Тогда
			АдресРегистрации = ПрочитатьАдрес(Адреса.main);
			АдресРегистрацииФИАС = ПрочитатьАдресФИАС(Адреса.main);
		Конецесли;
		
		АнкетныеДанные.Вставить("АдресРегистрации", АдресРегистрации);
		АнкетныеДанные.Вставить("АдресРегистрацииФИАС", АдресРегистрацииФИАС);
		
		Если Адреса.Свойство("residential") И Адреса.residential.Свойство("is_active") И Адреса.residential.is_active Тогда
			АнкетныеДанные.Вставить("АдресМестаЖительства", ПрочитатьАдрес(Адреса.residential));
			АнкетныеДанные.Вставить("АдресМестаЖительстваФИАС", ПрочитатьАдресФИАС(Адреса.residential));
		Иначе
			АнкетныеДанные.Вставить("АдресМестаЖительства", АдресРегистрации);
			АнкетныеДанные.Вставить("АдресМестаЖительстваФИАС", АдресРегистрацииФИАС);
		Конецесли;
		
		Если Адреса.Свойство("for_corresp") И Адреса.for_corresp.Свойство("is_active") И Адреса.for_corresp.is_active Тогда
			АнкетныеДанные.Вставить("ПочтовыйАдрес", ПрочитатьАдрес(Адреса.for_corresp));
			АнкетныеДанные.Вставить("ПочтовыйАдресФИАС", ПрочитатьАдресФИАС(Адреса.for_corresp));
		КонецЕсли;
		
	КонецЕсли; 
	
	АнкетныеДанные.Вставить("EMail", ФизЛицо.contact_email); 
		
	// В ближайшем релизе ЕСИА.Финанс появится новое поле main_phone_full_str
	Если ФизЛицо.Свойство("main_phone_full_str") Тогда
		АнкетныеДанные.Вставить("Телефоны",				ФизЛицо.main_phone_full_str);
		АнкетныеДанные.Вставить("ТелефонДляОповещения",	ФизЛицо.main_phone_full_str);
	Иначе	
		// Код страны телефона пока отсутствует - хардкод
		АнкетныеДанные.Вставить("Телефоны",				"7" + ФизЛицо.main_phone);
		АнкетныеДанные.Вставить("ТелефонДляОповещения",	"7" + ФизЛицо.main_phone);
	КонецЕсли;		
	
	ОписаниеПубличногоЛица = "";
	
	Если ФизЛицо.Свойство("is_russian_pub_person") И ФизЛицо.is_russian_pub_person Тогда	
		ОписаниеПубличногоЛица = ПолучиьОписаниеПубличногоЛица(ФизЛицо.irpp_name_organization, ФизЛицо.irpp_your_position, ФизЛицо.irpp_employer_address);	
	ИначеЕсли ФизЛицо.Свойство("is_person_of_intercity_organizations") И ФизЛицо.is_person_of_intercity_organizations Тогда
        ОписаниеПубличногоЛица = ПолучиьОписаниеПубличногоЛица(ФизЛицо.ipio_name_organization, ФизЛицо.ipio_your_position, ФизЛицо.ipio_employer_address);
	ИначеЕсли ФизЛицо.Свойство("is_foreign_pub_person") И ФизЛицо.is_foreign_pub_person Тогда
        ОписаниеПубличногоЛица = ПолучиьОписаниеПубличногоЛица(ФизЛицо.ifpp_name_organization, ФизЛицо.ifpp_your_position, ФизЛицо.ifpp_employer_address);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеПубличногоЛица) Тогда
		АнкетныеДанные.Вставить("ЯвляетсяПубличнымДолжностнымЛицом", Истина);
		АнкетныеДанные.Вставить("ЯвляетсяПубличнымДолжностнымЛицомОписание", ОписаниеПубличногоЛица); 
	КонецЕсли; 
	
	Если ФизЛицо.Свойство("is_bound_with_pub_person") И ФизЛицо.is_bound_with_pub_person Тогда
		АнкетныеДанные.Вставить("ЯвляетсяРодственникомПубличногоДолжностногоЛица", Истина);
		АнкетныеДанные.Вставить("ЯвляетсяРодственникомПубличногоДолжностногоЛицаОписание", ФизЛицо.kinship_status); 	
	КонецЕсли;
	
	Если ФизЛицо.Свойство("purpose_of_business") Тогда
		
		ОписаниеДругое = "";
		
		Для Каждого ТекЦель Из ФизЛицо.purpose_of_business Цикл
			
			Если ТекЦель = "pif_services" Тогда
				АнкетныеДанные.Вставить("ЦельПриобретениеПаев", Истина);	
			ИначеЕсли ТекЦель = "du_services" Тогда
				АнкетныеДанные.Вставить("ЦельДоверительноеУправление", Истина);
			ИначеЕсли ТекЦель = "bo_services" Тогда 
				ОписаниеДругое = ОписаниеДругое + ?(ЗначениеЗаполнено(ОписаниеДругое), ", ", "") + "брокерские услуги";
			ИначеЕсли ТекЦель = "depos_services" Тогда
				ОписаниеДругое = ОписаниеДругое + ?(ЗначениеЗаполнено(ОписаниеДругое), ", ", "") + "депозитарные услуги";
			//ИначеЕсли ТекЦель = "du_services" Тогда
			//	
			//	ОписаниеДругое = ОписаниеДругое + ?(ЗначениеЗаполнено(ОписаниеДругое), ", ", "") + 
			//		"услуги доверительного управления ценными бумагами, 
			//		|денежными средствами, предназначенными для совершения сделок с ценными бумагами 
			//		|и (или) заключения договоров, являющихся производными финансовыми инструментами";

			КонецЕсли;	
				
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОписаниеДругое) Тогда
			АнкетныеДанные.Вставить("ЦельДругое", Истина);
			АнкетныеДанные.Вставить("ЦельДругоеОписание", ОписаниеДругое);
		КонецЕсли;
	
	КонецЕсли;
	
	АнкетныеДанные.Вставить("ЦелиДеятельности", ФизЛицо.purpose_of_activity_str);
	АнкетныеДанные.Вставить("ПоложительноеФинансовоеПоложение",  ФизЛицо.Свойство("financial_position") И ФизЛицо.financial_position = "positive");
	АнкетныеДанные.Вставить("ДеловаяРепутацияПоложительная",  ФизЛицо.Свойство("customer_reputation") И ФизЛицо.customer_reputation = "positive"); 
	АнкетныеДанные.Вставить("ИсточникиПроисхожденияДенежныхСредств", ФизЛицо.source_of_money_income_str);
	
	АнкетныеДанные.Вставить("РаспространениеЗаконодательстваСША", (ФизЛицо.Свойство("tax_status") И ФизЛицо.tax_status = "resident")); 
	
	Если ФизЛицо.Свойство("foreign_address") Тогда
		
		Если ФизЛицо.foreign_address = "usa" Тогда  
			АнкетныеДанные.Вставить("АдресФактическогоПроживанияВИностранномГосударстве", ФизЛицо.foreign_usa_address); 	
		ИначеЕсли  ФизЛицо.foreign_address = "foreign " Тогда	
			АнкетныеДанные.Вставить("АдресФактическогоПроживанияВИностранномГосударстве", ФизЛицо.foreign_address_foreign_items_str);	
		КонецЕсли;	
			
	КонецЕсли; 
	
	Если ФизЛицо.Свойство("source_of_money_income") Тогда
		
		ИсточникСтр = ""; 
		
		Для Каждого ИсточникДС Из ФизЛицо.source_of_money_income Цикл
			
			Если ИсточникДС = "personal" Тогда
				
				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + "личные сбережения";
				
			ИначеЕсли ИсточникДС = "nrd_papers" Тогда
				
				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + 
					"доход от операций с ценными бумагами и (или) иностранными финансовыми инструментами, не квалифицированными в соответствии с законодательством РФ в качестве ценных бумаг";	
				
			ИначеЕсли ИсточникДС = "bussiness" Тогда
				
				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + 
					"доход от осуществления предпринимательской деятельности и (или) от участия в уставном (складочном) капитале коммерческой организации";
	
			ИначеЕсли ИсточникДС = "financial_instruments" Тогда
				
				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + 
					"доход от операций с производными финансовыми инструментами"; 
				
			ИначеЕсли ИсточникДС = "inheritance" Тогда

				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + 
					"получение наследства или активов по договору дарения";
				
			ИначеЕсли ИсточникДС = "credit" Тогда
				
				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + "заем, кредит";
				
			ИначеЕсли ИсточникДС = "job" Тогда
				
				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + 
					"доход по основному месту работы (включая доход от работы по совместительству)";
			ИначеЕсли ИсточникДС = "else" Тогда
				
				ИсточникСтр = ИсточникСтр + ?(ЗначениеЗаполнено(ИсточникСтр), ", ", "") + "иное";
				
			КонецЕсли;
			
		КонецЦикла;
		
		АнкетныеДанные.Вставить("ИсточникиПроисхожденияДенежныхСредств", ИсточникСтр);
	
	КонецЕсли;
			
	Возврат Новый Структура("АнкетныеДанные, ДанныеДляОпределенияСсылок", АнкетныеДанные, ДанныеДляОпределенияСсылок);
	
КонецФункции 

Функция ПолучитьЗначенияБанковскихРеквизитов(Приемник, ДанныеЕсиа)
	
	Приемник.Идентификатор = ДанныеЕсиа.id;
	Приемник.ИдентификаторПользователя = ДанныеЕсиа.owner_id;
	Приемник.Бик = ДанныеЕсиа.bik;
	Приемник.КоррСчет = ДанныеЕсиа.corr_account;
	Приемник.НомерСчета = ДанныеЕсиа.payment_account;
	
	Приемник.ПолучательПлатежа = ДанныеЕсиа.recipient;
	Приемник.ИННПолучателя = ДанныеЕсиа.inn;
	Приемник.НазначениеПлатежа = ДанныеЕсиа.notation;
	Приемник.НаименованиеБанка = ДанныеЕсиа.bank_name;
	Приемник.Валюта = Врег(ДанныеЕсиа.valuta);
		
КонецФункции

Функция ПолучитьДату(ДатаСтр)
	
	Если Не ЗначениеЗаполнено(ДатаСтр) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//10.06.2021 -> 20210610
	ЧастиТекДаты = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДатаСтр, ".", Истина, Истина);

	ТекДата = "";
	
	Для Инд = 1 - ЧастиТекДаты.Количество() По 0 Цикл	
		ТекДата = ТекДата + ЧастиТекДаты[-Инд];	
	КонецЦикла;
		
	Возврат Дата(ТекДата);
	
КонецФункции

Функция ПолучитьВидДокумента(ДокументЕсиа, Страна)
	
	Если ДокументЕсиа = "passport" Тогда
		
		Если Страна = Справочники.СтраныМира.Россия Тогда
			Возврат Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
		Иначе
			Возврат Справочники.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина;	
		Конецесли;
		
	ИначеЕсли ДокументЕсиа = "driver_license" Тогда
		Возврат Справочники.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение;	
	ИначеЕсли ДокументЕсиа = "residence_permit" Тогда
		Возврат Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство; 
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
		
КонецФункции
	
Функция ПолучиьОписаниеПубличногоЛица(Организация, Должность, Адрес)
	
	Описание = ?(ЗначениеЗаполнено(Организация), "Наимнование организации " + Организация, "");
	Описание = Описание + ?(ЗначениеЗаполнено(Должность), "должность " + Должность, "");
	Описание = Описание + ?(ЗначениеЗаполнено(Адрес), "адрес организации " + Адрес, "");
	
КонецФункции

Функция ПолучитьВидЗаявки(ВидЗаявкиЕсиа)
	
	Если ВидЗаявкиЕсиа = "pifs_purchase" Тогда
		Возврат Перечисления.ВидыЗаявокПайщиков.Зачисление;	
	ИначеЕсли ВидЗаявкиЕсиа = "pifs_selling" Тогда
		Возврат Перечисления.ВидыЗаявокПайщиков.Погашение;
	ИначеЕсли ВидЗаявкиЕсиа = "pifs_exchange" Тогда
		Возврат Перечисления.ВидыЗаявокПайщиков.Обмен;	
	Иначе
		ЗафиксироватьСообщение("Не удалось определить вид заявки пайщика по значению [" + ВидЗаявкиЕсиа + "]");
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьСтатусЗаявки(СтатусЕсиа) 
	
	СтатусыЗаявок = Новый Соответствие;
	СтатусыЗаявок.Вставить("draft", "Черновик");
	СтатусыЗаявок.Вставить("order_draft", "Черновик Винвестор");
	СтатусыЗаявок.Вставить("in_queue", "Новая");
	СтатусыЗаявок.Вставить("in_process", "В работе");
	СтатусыЗаявок.Вставить("elaboration", "Необходимы уточнения");
	СтатусыЗаявок.Вставить("wait_for_sign", "Требуется подпись");
	СтатусыЗаявок.Вставить("done", "Исполнена");
	СтатусыЗаявок.Вставить("rejected", "Отклонена");
	СтатусыЗаявок.Вставить("wrong", "Ошибочная");
	СтатусыЗаявок.Вставить("cancel", "Отменена");
	
	Статус = СтатусыЗаявок.Получить(СтатусЕсиа);
	
	Если Статус = Неопределено Тогда 	
		ЗафиксироватьСообщение("Не удалось определить статус заявки пайщика по значению [" + СтатусЕсиа + "]");
		Возврат Неопределено;
	Иначе
		Возврат Статус + " (" + СтатусЕсиа + ")"; 
	КонецЕсли;
		
КонецФункции

Функция ПолучитьПараметрыПодключения(ContentType = "application/json") Экспорт
	
	Возврат РаботаСВнешнимиСистемами.ЕСИА_Финанс_ПараметрыПодключения(ЭтотОбъект.Организация, ContentType);
	
КонецФункции

Процедура ЗафиксироватьСообщение(ТекстСообщения, Ошибка = Истина, Отказ = Ложь)
	
	Если Ошибка Тогда
	
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
			ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстСообщения);	
		Иначе
			ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", РаботаСКоллекциями.ЗначениеВМассив(ТекстСообщения));	
		КонецЕсли;
		
		Отказ = Истина;
		
	Иначе
		ЭтотОбъект.Результат.ДобавитьСтроку(ТекстСообщения);	
	КонецЕсли;
		
КонецПроцедуры

Процедура ОповеститьОбОшибках(ТекстОшибки = Неопределено) Экспорт
	
	Если ТекстОшибки <> Неопределено Тогда
		ЗафиксироватьСообщение(ТекстОшибки);	
	КонецЕсли;
		
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС); 
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	
КонецПроцедуры

Функция ПолучитьСтрокуJSON(Данные, ПараметрыЗаписи = Неопределено)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
    Если ПараметрыЗаписи = Неопределено Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	Иначе
		ПараметрыЗаписиJSON = ПараметрыЗаписи;	
	КонецЕсли;
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные,,);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция ДесериализоватьСтрокуJSON(СтрокаJSON, ИзменитьЧисловыеКлючи = Ложь)
	
	Если ИзменитьЧисловыеКлючи Тогда
		СтрокаJSON = СтрЗаменить(СтрокаJSON, """0"":", """НольСтр"":");
		СтрокаJSON = СтрЗаменить(СтрокаJSON, """1"":", """ОдинСтр"":");
		СтрокаJSON = СтрЗаменить(СтрокаJSON, """2"":", """ДваСтр"":");
	    СтрокаJSON = СтрЗаменить(СтрокаJSON, """3"":", """ТриСтр"":");
	    СтрокаJSON = СтрЗаменить(СтрокаJSON, """4"":", """ЧетыреСтр"":");
		СтрокаJSON = СтрЗаменить(СтрокаJSON, """5"":", """ПатьСтр"":");
	    СтрокаJSON = СтрЗаменить(СтрокаJSON, """6"":", """ШестьСтр"":");
	    СтрокаJSON = СтрЗаменить(СтрокаJSON, """7"":", """СемьСтр"":");
	    СтрокаJSON = СтрЗаменить(СтрокаJSON, """8"":", """ВосемьСтр"":");
		СтрокаJSON = СтрЗаменить(СтрокаJSON, """9"":", """ДевятьСтр"":");
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

Процедура ИмпортироватьАнкеты() Экспорт
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения();
		
	ТекстСообщения = "Не удалось получить данные пользователей из системы ЕСИА.Финанс"; 
	
	//1 получаем коды вновь созданных пользователей
	//2 получаем коды пользователей с измененными данными
	ПараметрыЗапроса = РаботаСКоллекциями.ЗначенияВМассив("created_at", "updated_at");
	
	МассивИдентификаторов = Новый Массив;

	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
	
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, "/api/v1/back_office/users?filter%5B" + ТекПараметр + "%5D%5Bgt%5D=" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"),, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ДанныеЕсиа = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
			
		Если Не (ТипЗнч(ДанныеЕсиа) = Тип("Структура") И ДанныеЕсиа.Свойство("success") И ДанныеЕсиа.success И ДанныеЕсиа.Свойство("users")) Тогда			
			ЗафиксироватьСообщение(ТекстСообщения);	
		    Возврат;	
		КонецЕсли;
		
		Для Каждого ТекПользователь Из ДанныеЕсиа.users Цикл		
			
			Если МассивИдентификаторов.Найти(ТекПользователь.id) = Неопределено Тогда 
				МассивИдентификаторов.Добавить(Строка(ТекПользователь.id));
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЦикла;
	
	//ФильтрСтр = "?filter%5Bstatus%5D=in_queue&filter%5Bkind%5D=person_info_change&filter%5Bcreated_at%5D%5Bgt%5D=" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy");  
	
	Если МассивИдентификаторов.Количество() = 0 Тогда
		ЗафиксироватьСообщение("Отсутствуют данные для загрузки.", Ложь);
		Возврат;
	КонецЕсли;
	
	//Если по коду ЕСИА найдено физ.лицо - не загружаем анкету.	
	Запрос = Новый Запрос;

#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыВоВнешнихСистемах
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица))) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыПайщиков.Объект КАК Ссылка,
		|	_КодыПайщиков.Код КАК ИдентификаторПользователя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК АнкетаСсылка,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Период КАК ДатаАнкетныхДанных 
		|ИЗ
		|	_КодыВоВнешнихСистемах КАК _КодыПайщиков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаКонецДня,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							_КодыПайщиков.Объект
		|						ИЗ
		|							_КодыВоВнешнихСистемах КАК _КодыПайщиков)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _КодыПайщиков.Объект = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо";
		//|ГДЕ
		//|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор ЕСТЬ NULL";
		//|	РАЗНОСТЬДАТ(РеквизитыФизическихЛицАнкетныеСрезПоследних.Период, &ДатаНачалоДня, ДЕНЬ) > 0 
		
#КонецОбласти
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачалоДня", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКонецДня", КонецДня(ЭтотОбъект.Дата));
	
	ТаблицаАнкет = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекКод Из МассивИдентификаторов Цикл 
		
		СтрокаТаблицы = ТаблицаАнкет.Найти(ТекКод, "ИдентификаторПользователя");
		
		Если СтрокаТаблицы = Неопределено Тогда
			
			НоваяСтрока = ТаблицаАнкет.Добавить();
			НоваяСтрока.ИдентификаторПользователя = ТекКод;
			
		КонецЕсли;
			
	КонецЦикла;
				
	Если ТаблицаАнкет.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ДанныеПользователей = ДесериализоватьДанныеПользователейЕсиа(ТаблицаАнкет, ПараметрыПодключения);
	
	Если ДанныеПользователей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	БанковскиеСчета = ДесериализоватьДанныеБанковскихСчетовЕсиа(ДанныеПользователей, ПараметрыПодключения);

	СформироватьИЗагрузитьАнкеты(ДанныеПользователей, БанковскиеСчета, Новый МенеджерВременныхТаблиц, ПараметрыПодключения); 
		
КонецПроцедуры

Функция ДесериализоватьДанныеЗаявокЕсиа(ОтветЕсиа, ПараметрыПодключения)
	
	ЗаявкиПайщиков = СформироватьТаблицуПриемник("ЗаявкиПайщиков");	
		
	Для Каждого ТекЗаявка Из ОтветЕсиа.claims Цикл
				
		Если ТекЗаявка.status <> "in_queue" Тогда
			Продолжить;
		КонецЕсли;
				
		Если Не (ТекЗаявка.Свойство("owner_type") И ТекЗаявка.owner_type = "Fund") Тогда
			Продолжить;	
		Конецесли;
		
		ТекДатаЗаявки = Дата(Лев(РаботаСоСтрокамиКлиентСервер.ОставитьТолькоЦифрыВСтроке(ТекЗаявка.created_at), 14));
		
		Если ЭтотОбъект.Дата <> НачалоДня(ТекДатаЗаявки) Тогда
			Продолжить;
		КонецЕсли; 
		
		//устанавливаем фонду код (portfolio_code) такой-же как и идентификатор
		ТекстСообщения = "Не удалось получить данные фонда из системы ЕСИА.Финанс по id " + ТекЗаявка.owner_id;
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, "/api/v1/back_office/funds/" + ТекЗаявка.owner_id,, ТекстСообщения);
	
		Если HTTPОтвет = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		Иначе
			
			ДанныеФонда = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), Истина);
			
			Если Не (ТипЗнч(ДанныеФонда) = Тип("Структура") И ДанныеФонда.Свойство("success") И ДанныеФонда.success) 
				Или Не ДанныеФонда.Свойство("fund") Тогда
				
				ЗафиксироватьСообщение("Не удалось получить данные фонда из системы ЕСИА.Финанс по id " + ТекЗаявка.owner_id);
				Продолжить;
				
			ИначеЕсли Строка(ТекЗаявка.owner_id) <> ДанныеФонда.fund.portfolio_code Тогда 
					
				ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("portfolio_code", ТекЗаявка.owner_id)); 
				
				ТекстСообщения = "Не удалось установить portfolio_code для фонда id " + ТекЗаявка.owner_id;
				
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, "/api/v1/back_office/funds/" + ТекЗаявка.owner_id, ТелоЗапроса, ТекстСообщения);
				
				Если HTTPОтвет = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Продолжить;
				КонецЕсли;
				
				ОтветНаЗапрос = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
		
				Если Не (ТипЗнч(ОтветНаЗапрос) = Тип("Структура") И ОтветНаЗапрос.Свойство("success") И ОтветНаЗапрос.success) Тогда
					
					ЗафиксироватьСообщение("Не удалось установить portfolio_code для фонда id " + ТекЗаявка.owner_id);
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;

		НоваяЗапись = ЗаявкиПайщиков.Добавить();
		
		НоваяЗапись.Идентификатор = ТекЗаявка.id;
		НоваяЗапись.ВидЗаявки = ПолучитьВидЗаявки(ТекЗаявка.kind);
		НоваяЗапись.Статус = ПолучитьСтатусЗаявки(ТекЗаявка.status);
		НоваяЗапись.ИдентификаторПользователя = ТекЗаявка.user_id;
		НоваяЗапись.НомерЗаявки = ТекЗаявка.inner_code;
		НоваяЗапись.ДатаЗаявки = ТекДатаЗаявки;
		
		НоваяЗапись.ИдентификаторПифа = ТекЗаявка.owner_id; 
		
		Если ТекЗаявка.Свойство("data") Тогда
			
			НоваяЗапись.Сумма = ?(ТекЗаявка.data.Свойство("amount"), ТекЗаявка.data.amount, 0);
			
			Если ТекЗаявка.data.Свойство("account_number") Тогда
				НоваяЗапись.НомерСчетаДепо = ТекЗаявка.data.account_number;
			Иначе
				
				Если ТекЗаявка.metadata.Свойство("is_with_open") И ТекЗаявка.metadata.is_with_open И ТекЗаявка.kind = "pifs_purchase" Тогда  
					
					НоваяЗапись.ОткрытьЗакрытьДепозитарныйСчет = Истина;
					
				Иначе
					ЗафиксироватьСообщение("При импорте заявки не удалось определить депозитарный счет, код ЕСИА.Финанс [" + ТекЗаявка.id + "].");
					НоваяЗапись.ЕстьОшибкиДанных = Истина;
				КонецЕсли;
				
			КонецЕсли; 
						
			Если ТекЗаявка.kind = "pifs_purchase" Тогда	
				
				НоваяЗапись.Количество = ?(ТекЗаявка.data.Свойство("pieces_amount"), ТекЗаявка.data.pieces_amount, 0); 
				
				НоваяЗапись.Многократная = (НоваяЗапись.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление) И Не ТекЗаявка.data.Свойство("amount");

			ИначеЕсли ТекЗаявка.kind = "pifs_selling" Или ТекЗаявка.kind = "pifs_exchange" Тогда
			   
				Если ТекЗаявка.data.Свойство("count") Тогда
					НоваяЗапись.Количество = ТекЗаявка.data.count;
				Иначе
					ЗафиксироватьСообщение("При импорте заявки не удалось определить количество паев, код ЕСИА.Финанс [" + ТекЗаявка.id + "].");
					НоваяЗапись.ЕстьОшибкиДанных = Истина;
				КонецЕсли;
				
			КонецЕсли; 
			
			Если ТекЗаявка.kind = "pifs_exchange" Тогда
				
				НоваяЗапись.ИдентификаторПифаДляОбмена = ТекЗаявка.data.fund_to_id;
				
				Если ТекЗаявка.data.Свойство("account_number_to") Тогда
					НоваяЗапись.НомерСчетаДепоДляОбмена = ТекЗаявка.data.account_number_to;
				Иначе
					
					Если ТекЗаявка.metadata.Свойство("is_with_open") И ТекЗаявка.metadata.is_with_open Тогда 
						НоваяЗапись.ОткрытьДепозитарныйСчетДляОбмена = Истина;
					Иначе
						ЗафиксироватьСообщение("При импорте заявки [идентификатор ЕСИА.Финанс " + ТекЗаявка.id + "] не удалось определить депозитарный счет для обмена.");
						НоваяЗапись.ЕстьОшибкиДанных = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
									
			Если ТекЗаявка.data.Свойство("requisite_id") Тогда 
				НоваяЗапись.ИдентификаторРасчетногоСчета = ТекЗаявка.data.requisite_id;				
			Иначе
				ЗафиксироватьСообщение("Не удалось получить банковские реквизиты из заявки, код ЕСИА.Финанс [" + ТекЗаявка.id + "]");
				НоваяЗапись.ЕстьОшибкиДанных = Истина;
	            Продолжить;
			КонецЕсли;
			
			//получаем подпись
			//устанавливаем фонду код (portfolio_code) такой-же как и идентификатор
			ТекстСообщения = "Не удалось получить данные подписи заявки пайщика из системы ЕСИА.Финанс по id " + ТекЗаявка.id;
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, "/api/v1/back_office/claims/" + ТекЗаявка.id,, ТекстСообщения);
		
			Если HTTPОтвет = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				НоваяЗапись.ЕстьОшибкиДанных = Истина;
				Продолжить;
			Иначе
				
				ОтветНаЗапрос = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
				
				Если Не ОтветНаЗапрос.Свойство("Claim") Тогда
					ЗафиксироватьСообщение("Не удалось получить данные подписи заявки пайщика, код ЕСИА.Финанс [" + ТекЗаявка.id + "]");
					НоваяЗапись.ЕстьОшибкиДанных = Истина;
	            	Продолжить;
				КонецЕсли;
				
				ПолныеДанныеЗаявки = ОтветНаЗапрос.Claim;
				
				Если Не ПолныеДанныеЗаявки.Свойство("attachments") Тогда
					ЗафиксироватьСообщение("Не удалось получить данные подписи заявки пайщика, код ЕСИА.Финанс [" + ТекЗаявка.id + "]");
					НоваяЗапись.ЕстьОшибкиДанных = Истина;
	            	Продолжить;
				Конецесли; 
				
				//Из заявки получаем файлы для дальнейшей привязки к заявке пайщика
				НоваяЗапись.МассивФайлов = ПолучитьМассивФайлов(ПолныеДанныеЗаявки.attachments, ПараметрыПодключения);
				
				Для Каждого ТекВложение Из ПолныеДанныеЗаявки.attachments Цикл
										
					Если Не ((ТекВложение.kind = "pifs_purchase_with_account" Или ТекВложение.kind = "pifs_purchase" 
							Или ТекВложение.kind = "pifs_exchange" Или ТекВложение.kind = "pifs_selling") И СтрНачинаетсяС(ТекВложение.description, "Заявка")) Тогда
						Продолжить;		
					КонецЕсли;
					
					Если Не ТекВложение.Свойство("client_sign") Тогда 
						ЗафиксироватьСообщение("Не удалось получить данные подписи заявки пайщика, код ЕСИА.Финанс [" + ТекЗаявка.id + "]");
						НоваяЗапись.ЕстьОшибкиДанных = Истина;
	            		Продолжить;
					КонецЕсли;
					
					СтруктураПодписи = ТекВложение.client_sign;
					
					Если ПодписьВалидна(СтруктураПодписи) Тогда 
					
						МассивТелефонКод = СтрРазделить(СтруктураПодписи.identifier, "/");
						
						Телефон = МассивТелефонКод[0];
						
						НоваяЗапись.ПЭП_НомерТелефона = ?(СтрНайти(Телефон, "+") > 0, "+", "") + РаботаСоСтрокамиКлиентСервер.ОставитьТолькоЦифрыВСтроке(Телефон);
						НоваяЗапись.ПЭП_Код = СокрЛП(МассивТелефонКод[1]);
						НоваяЗапись.ПЭП_ДатаВремяПодписи = Дата(Лев(РаботаСоСтрокамиКлиентСервер.ОставитьТолькоЦифрыВСтроке(СтруктураПодписи.signed_at), 14));
						
						Прервать;
					Иначе
						ЗафиксироватьСообщение("Не удалось получить данные подписи заявки пайщика, код ЕСИА.Финанс [" + ТекЗаявка.id + "]");
						НоваяЗапись.ЕстьОшибкиДанных = Истина;
	            		Продолжить;	
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ЗначениеЗаполнено(НоваяЗапись.ПЭП_Код) Тогда
					ЗафиксироватьСообщение("Не удалось получить данные подписи заявки пайщика, код ЕСИА.Финанс [" + ТекЗаявка.id + "]");
					НоваяЗапись.ЕстьОшибкиДанных = Истина;	
				КонецЕсли;
						
			КонецЕсли;
			
		КонецЕсли;
								
	КонецЦикла;
	
	Возврат ЗаявкиПайщиков;
	
КонецФункции 

Функция ДесериализоватьДанныеПользователейЕсиа(ТаблицаАнкет, ПараметрыПодключения)
	
	ПользователиЕсиа = СформироватьТаблицуПриемник("ПользователиЕсиа");
									
	Для Каждого ТекЗапись Из ТаблицаАнкет Цикл
		
		СтрокаТаблицыПользователей = ПользователиЕсиа.Найти(ТекЗапись.ИдентификаторПользователя, "Идентификатор"); 
		
		Если СтрокаТаблицыПользователей <> Неопределено Тогда  //если у пользователя несколько заявок
			Продолжить;	
		КонецЕсли;
		
		ТекстСообщения = "Не удалось получить данные пользователя из системы ЕСИА.Финанс по id " + ТекЗапись.ИдентификаторПользователя;
		
		//1. получаем данные пользователя по идентификатору
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, "/api/v1/back_office/users/" + ТекЗапись.ИдентификаторПользователя,, ТекстСообщения);
	
		Если HTTPОтвет = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		Иначе
			
			ДанныеЕсиа = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
			
			Если Не (ТипЗнч(ДанныеЕсиа) = Тип("Структура") И ДанныеЕсиа.Свойство("success") И ДанныеЕсиа.success)
				Или Не ДанныеЕсиа.Свойство("user") Тогда
				
				ЗафиксироватьСообщение("Не удалось получить данные пользователя из системы ЕСИА.Финанс по id " + ТекЗапись.ИдентификаторПользователя);
				Продолжить;	
				
			КонецЕсли; 
			
			ДанныеПользователяЕсиа = ДанныеЕсиа.user;
						
			ЗначенияРеквизитовАнкеты = ПолучитьЗначенияРеквизитовАнкетыПользователя(ДанныеПользователяЕсиа, ПараметрыПодключения);
			
			Если ЗначенияРеквизитовАнкеты = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			//проверяем дату актульности анкетных данных
			Если ЗначениеЗаполнено(ТекЗапись.ДатаАнкетныхДанных) И ЗначенияРеквизитовАнкеты.ДанныеДляОпределенияСсылок.ДатаАктуальности <= ТекЗапись.ДатаАнкетныхДанных Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = ПользователиЕсиа.Добавить();
			НоваяЗапись.Ссылка = ТекЗапись.Ссылка;
			НоваяЗапись.ЕстьКодЕсиа = ЗначениеЗаполнено(ТекЗапись.Ссылка);	
			НоваяЗапись.АнкетаСсылка = ТекЗапись.АнкетаСсылка;
			НоваяЗапись.Идентификатор = ДанныеПользователяЕсиа.id; 
			НоваяЗапись.ЗаписатьКодПайщика = (Строка(ДанныеПользователяЕсиа.id) <> ДанныеПользователяЕсиа.pifs_portfolio_code);
			НоваяЗапись.АнкетныеДанные = ЗначенияРеквизитовАнкеты.АнкетныеДанные; 
						
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗначенияРеквизитовАнкеты.ДанныеДляОпределенияСсылок); 
																								
		КонецЕсли;

	КонецЦикла;
	
	Возврат ПользователиЕсиа;

	////2. получаем данные вновь созданных пользователей
	//ТекстСообщения = "Не удалось получить данные новых пользователей из системы ЕСИА.Финанс";
	//HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, "/api/v1/back_office/users?filter%5Bcreated_at%5D%5Bgt%5D=" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"),, ТекстСообщения);
	//
	//Если HTTPОтвет = Неопределено Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//Иначе
	//	
	//	ДанныеЕсиа = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
	//		
	//	Если Не (ТипЗнч(ДанныеЕсиа) = Тип("Структура") И ДанныеЕсиа.Свойство("success") И ДанныеЕсиа.success)
	//		Или Не ДанныеЕсиа.Свойство("users") Тогда
	//			
	//		ЗафиксироватьСообщение(ТекстСообщения);	
	//		
	//	Иначе
	//		
	//		Для Каждого ТекПользователь Из ДанныеЕсиа.users Цикл 
	//			
	//			СтрокаТаблицыПользователей = ПользователиЕсиа.Найти(ТекПользователь.id, "Идентификатор"); 
	//	
	//			Если СтрокаТаблицыПользователей <> Неопределено Тогда  //возможно пользователь уже есть из заявок
	//				Продолжить;	
	//			КонецЕсли;
	//			
	//			//3. получаем данные пользователя по идентификатору
	//			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, "/api/v1/back_office/users/" + ТекПользователь.id,, ТекстСообщения + ТекПользователь.id);
	//		
	//			Если HTTPОтвет = Неопределено Тогда
	//				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//				Продолжить;
	//			Иначе
	//				
	//				ДанныеПользователя = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
	//				
	//				Если Не (ТипЗнч(ДанныеПользователя) = Тип("Структура") И ДанныеПользователя.Свойство("success") И ДанныеПользователя.success)
	//					Или Не ДанныеПользователя.Свойство("user") Тогда
	//					
	//					ЗафиксироватьСообщение("Не удалось получить данные пользователя из системы ЕСИА.Финанс по id " + ТекПользователь.id);
	//					Продолжить;	
	//					
	//				КонецЕсли;
	//				
	//				НоваяЗапись = ПользователиЕсиа.Добавить();
	//				//НоваяЗапись.Ссылка = Выборка.Ссылка;
	//				//НоваяЗапись.ЕстьКодЕсиа = ЗначениеЗаполнено(Выборка.Ссылка);
	//				//
	//				//НоваяЗапись.АнкетаСсылка = Выборка.АнкетаСсылка;
	//				НоваяЗапись.СверитьАнкету = Истина;
	//				
	//				ДанныеПользователяЕсиа = ДанныеПользователя.user;
	//				
	//				НоваяЗапись.Идентификатор = ТекПользователь.id; 
	//				НоваяЗапись.ЗаписатьКодПайщика = (Строка(ДанныеПользователяЕсиа.id) <> ДанныеПользователяЕсиа.pifs_portfolio_code);
	//									
	//				ЗаполнитьЗначенияСвойств(НоваяЗапись, ПолучитьЗначенияРеквизитовАнкетыПользователя(ДанныеПользователяЕсиа, ПараметрыПодключения));
	//																					
	//			КонецЕсли;
	//
	//		КонецЦикла;
	//			
	//	КонецЕсли;
	//		
	//КонецЕсли;

	//Возврат ПользователиЕсиа;
	
КонецФункции 

Функция ДесериализоватьДанныеБанковскихСчетовЕсиа(ДанныеПользователей, ПараметрыПодключения) 
	
	ТаблицаБанковскихСчетов = СформироватьТаблицуПриемник("БанковскиеСчета");
	
	Для Каждого ТекПользователь Из ДанныеПользователей Цикл 
		
		ТекстСообщения = "Не удалось получить данные расчетных счетов пользователя из системы ЕСИА.Финанс по id пользователя " + ТекПользователь.Идентификатор;
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос(
			"GET", 
			ПараметрыПодключения, 
			"/api/v1/back_office/requisites?requisite_owner_type=User&requisite_owner_id=" + ТекПользователь.Идентификатор,
			, 
			ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		Иначе
			
			ДанныеЕсиа = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
			
			Если Не (ТипЗнч(ДанныеЕсиа) = Тип("Структура") И ДанныеЕсиа.Свойство("success") И ДанныеЕсиа.success)
				Или Не ДанныеЕсиа.Свойство("requisites") Тогда
				
				ЗафиксироватьСообщение("Не удалось получить данные счетов пользователя из системы ЕСИА.Финанс по id " + ТекПользователь.Идентификатор);
				Продолжить;	
				
			КонецЕсли;
			
			Для Каждого ТекСчет Из ДанныеЕсиа.requisites Цикл
				
				СтрокиТаблицыСчетов = ТаблицаБанковскихСчетов.НайтиСтроки(Новый Структура("ИдентификаторПользователя, НомерСчета", ТекПользователь.Идентификатор, ТекСчет.payment_account));
				
				Если СтрокиТаблицыСчетов.Количество() = 0 Тогда 
					
					НовыйСчет = ТаблицаБанковскихСчетов.Добавить();
					ПолучитьЗначенияБанковскихРеквизитов(НовыйСчет, ТекСчет);
	
				КонецЕсли;
		
			КонецЦикла;
				
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ТаблицаБанковскихСчетов; 
		
КонецФункции

Функция СформироватьТаблицуПриемник(ИмяТаблицы) 
	
	ТекТаблица = Новый ТаблицаЗначений;
	
	Если ИмяТаблицы = "ЗаявкиПайщиков" Тогда 
		
		ТекТаблица.Колонки.Добавить("Идентификатор",					Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
		ТекТаблица.Колонки.Добавить("ВидЗаявки",						Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗаявокПайщиков"));
		ТекТаблица.Колонки.Добавить("Статус",							Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
		ТекТаблица.Колонки.Добавить("ИдентификаторПользователя",		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
		ТекТаблица.Колонки.Добавить("НомерЗаявки",						Метаданные.Документы.ЗаявкаПайщика.Реквизиты.НомерЗаявки.Тип);
		ТекТаблица.Колонки.Добавить("ДатаЗаявки",						Новый ОписаниеТипов("Дата"));
		ТекТаблица.Колонки.Добавить("ИдентификаторПифа",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
		ТекТаблица.Колонки.Добавить("ИдентификаторПифаДляОбмена",		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
		ТекТаблица.Колонки.Добавить("Сумма",							Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		ТекТаблица.Колонки.Добавить("ИдентификаторРасчетногоСчета",		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
	    ТекТаблица.Колонки.Добавить("Количество",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		ТекТаблица.Колонки.Добавить("Многократная",						Новый ОписаниеТипов("Булево"));
		ТекТаблица.Колонки.Добавить("НомерСчетаДепо",					Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(25)));
		ТекТаблица.Колонки.Добавить("НомерСчетаДепоДляОбмена",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(25)));
		ТекТаблица.Колонки.Добавить("ОткрытьЗакрытьДепозитарныйСчет",	Новый ОписаниеТипов("Булево"));
		ТекТаблица.Колонки.Добавить("ОткрытьДепозитарныйСчетДляОбмена",	Новый ОписаниеТипов("Булево"));
		ТекТаблица.Колонки.Добавить("ПЭП_НомерТелефона",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(12)));
		ТекТаблица.Колонки.Добавить("ПЭП_Код",							Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(10)));
		ТекТаблица.Колонки.Добавить("ПЭП_ДатаВремяПодписи",				Новый ОписаниеТипов("Дата"));
		ТекТаблица.Колонки.Добавить("ЕстьОшибкиДанных",					Новый ОписаниеТипов("Булево"));
		ТекТаблица.Колонки.Добавить("МассивФайлов",						Новый ОписаниеТипов("Массив"));
	
	ИначеЕсли ИмяТаблицы = "БанковскиеСчета" Тогда 
		
		ТекТаблица.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
		ТекТаблица.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
		ТекТаблица.Колонки.Добавить("ИдентификаторПользователя", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
		ТекТаблица.Колонки.Добавить("Бик", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
		ТекТаблица.Колонки.Добавить("КоррСчет", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20)));
		ТекТаблица.Колонки.Добавить("НомерСчета", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20)));
		ТекТаблица.Колонки.Добавить("ПолучательПлатежа", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТекТаблица.Колонки.Добавить("ИННПолучателя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12)));
		ТекТаблица.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТекТаблица.Колонки.Добавить("НаименованиеБанка", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТекТаблица.Колонки.Добавить("Валюта", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(3)));
	
	ИначеЕсли ИмяТаблицы = "ПользователиЕсиа" Тогда 
		
		ТекТаблица.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
		ТекТаблица.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(55)));
		
		ТекТаблица.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТекТаблица.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
    	ТекТаблица.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТекТаблица.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата"));
		
		ТекТаблица.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12)));
		ТекТаблица.Колонки.Добавить("СНИЛС", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(14)));
		
		ТекТаблица.Колонки.Добавить("ВидУдостоверенияЛичности", Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовФизическихЛиц"));
		ТекТаблица.Колонки.Добавить("СтранаВыдачиДокумента", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
		ТекТаблица.Колонки.Добавить("СерияУдостоверенияЛичности", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
		ТекТаблица.Колонки.Добавить("НомерУдостоверенияЛичности", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
		ТекТаблица.Колонки.Добавить("Гражданство", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
		
		ТекТаблица.Колонки.Добавить("АнкетныеДанные", Новый ОписаниеТипов("Структура"));
		ТекТаблица.Колонки.Добавить("ГражданствоСтр", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	    ТекТаблица.Колонки.Добавить("ДопГражданстваСтр", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1000)));
		ТекТаблица.Колонки.Добавить("РезиденстваСтр", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1000)));
		ТекТаблица.Колонки.Добавить("КодСтраныВыдачиДокумента", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(2)));
		ТекТаблица.Колонки.Добавить("ВидДокументаСтр", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
		
		ТекТаблица.Колонки.Добавить("АнкетаСсылка", Новый ОписаниеТипов("ДокументСсылка.АнкетаФизическогоЛица")); 
		ТекТаблица.Колонки.Добавить("ДатаАктуальности", Новый ОписаниеТипов("Дата"));
		ТекТаблица.Колонки.Добавить("ЕстьКодЕсиа", Новый ОписаниеТипов("Булево"));
		//ТекТаблица.Колонки.Добавить("СверитьАнкету", Новый ОписаниеТипов("Булево"));
		ТекТаблица.Колонки.Добавить("ЗаписатьКодПайщика", Новый ОписаниеТипов("Булево"));
		ТекТаблица.Колонки.Добавить("МассивФайлов", Новый ОписаниеТипов("Массив"));	
		
	КонецЕсли;
	
	Возврат ТекТаблица;	
	
КонецФункции

Процедура СформироватьИЗагрузитьАнкеты(ДанныеПользователей, БанковскиеСчета, МВТ, ПараметрыПодключения) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПользователей.Ссылка КАК Ссылка,
		|	ДанныеПользователей.Идентификатор КАК Идентификатор,
		|	ДанныеПользователей.Фамилия КАК Фамилия,
		|	ДанныеПользователей.Имя КАК Имя,
		|	ДанныеПользователей.Отчество КАК Отчество,
		|	ДанныеПользователей.ДатаРождения КАК ДатаРождения,
		|	ДанныеПользователей.ИНН КАК ИНН,
		|	ДанныеПользователей.СНИЛС КАК СНИЛС,
		|	ДанныеПользователей.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	ДанныеПользователей.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	ДанныеПользователей.ГражданствоСтр КАК ГражданствоСтр,
		|	ДанныеПользователей.ДопГражданстваСтр КАК ДопГражданстваСтр,
		|	ДанныеПользователей.РезиденстваСтр КАК РезиденстваСтр,
		|	ДанныеПользователей.КодСтраныВыдачиДокумента КАК КодСтраныВыдачиДокумента,
		|	ДанныеПользователей.ВидДокументаСтр КАК ВидДокументаСтр,
		|	ДанныеПользователей.АнкетаСсылка КАК АнкетаСсылка,
		|	ДанныеПользователей.ДатаАктуальности КАК ДатаАктуальности
		|ПОМЕСТИТЬ _ДанныеПользователей
		|ИЗ
		|	&ДанныеПользователей КАК ДанныеПользователей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Идентификатор КАК Идентификатор,
		|	БанковскиеСчета.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	БанковскиеСчета.Бик КАК Бик,
		|	БанковскиеСчета.КоррСчет КАК КоррСчет,
		|	БанковскиеСчета.НомерСчета КАК НомерСчета,
		|	БанковскиеСчета.ПолучательПлатежа КАК ПолучательПлатежа,
		|	БанковскиеСчета.ИННПолучателя КАК ИННПолучателя,
		|	БанковскиеСчета.НазначениеПлатежа КАК НазначениеПлатежа,
		|	БанковскиеСчета.НаименованиеБанка КАК НаименованиеБанка,
		|	БанковскиеСчета.Валюта КАК Валюта
		|ПОМЕСТИТЬ _БанковскиеСчетаЕсиа
		|ИЗ
		|	&БанковскиеСчета КАК БанковскиеСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(БанковскиеСчета.Ссылка, НЕОПРЕДЕЛЕНО) КАК Ссылка,
		|	ЕСТЬNULL(БанковскиеСчета.ЮрФизЛицо, НЕОПРЕДЕЛЕНО) КАК ЮрФизЛицо,
		|	_БанковскиеСчетаЕсиа.Идентификатор КАК Идентификатор,
		|	_БанковскиеСчетаЕсиа.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|	_БанковскиеСчетаЕсиа.Бик КАК Бик,
		|	_БанковскиеСчетаЕсиа.КоррСчет КАК КоррСчет,
		|	_БанковскиеСчетаЕсиа.НомерСчета КАК НомерСчета,
		|	_БанковскиеСчетаЕсиа.ПолучательПлатежа КАК ПолучательПлатежа,
		|	_БанковскиеСчетаЕсиа.ИННПолучателя КАК ИННПолучателя,
		|	_БанковскиеСчетаЕсиа.НазначениеПлатежа КАК НазначениеПлатежа,
		|	_БанковскиеСчетаЕсиа.НаименованиеБанка КАК НаименованиеБанка,
		|	_БанковскиеСчетаЕсиа.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ДанныеБанковскихСчетов
		|ИЗ
		|	_БанковскиеСчетаЕсиа КАК _БанковскиеСчетаЕсиа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО _БанковскиеСчетаЕсиа.НомерСчета = БанковскиеСчета.НомерСчета
		|			И _БанковскиеСчетаЕсиа.Бик = БанковскиеСчета.Банк.Код
		|			И (БанковскиеСчета.Организация = &Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СНИЛС КАК СНИЛС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности
		|ПОМЕСТИТЬ _ДанныеФизЛицИзУчетнойСистемы
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&ДатаКонецДня,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПользователей.Идентификатор КАК Идентификатор,
		|	ВЫБОР
		|		КОГДА _ДанныеПользователей.Ссылка = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(_СверкаПоУдостоверению.ЮрФизЛицо, ЕСТЬNULL(_СверкаПоИНН.ЮрФизЛицо, ЕСТЬNULL(_СверкаПоСНИЛС.ЮрФизЛицо, _СверкаПоФИО.ЮрФизЛицо)))
		|		ИНАЧЕ _ДанныеПользователей.Ссылка
		|	КОНЕЦ КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА _ДанныеПользователей.Ссылка <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА 1
		|		КОГДА НЕ _СверкаПоУдостоверению.ЮрФизЛицо ЕСТЬ NULL
		|			ТОГДА 2
		|		КОГДА НЕ _СверкаПоИНН.ЮрФизЛицо ЕСТЬ NULL
		|			ТОГДА 3
		|		КОГДА НЕ _СверкаПоСНИЛС.ЮрФизЛицо ЕСТЬ NULL
		|			ТОГДА 4
		|		КОГДА НЕ _СверкаПоФИО.ЮрФизЛицо ЕСТЬ NULL
		|			ТОГДА 5
		|		ИНАЧЕ 10
		|	КОНЕЦ КАК Класс
		|ПОМЕСТИТЬ _КлассификацияОпределенияФизЛицПользователей
		|ИЗ
		|	_ДанныеПользователей КАК _ДанныеПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеФизЛицИзУчетнойСистемы КАК _СверкаПоУдостоверению
		|		ПО _ДанныеПользователей.СерияУдостоверенияЛичности = _СверкаПоУдостоверению.СерияУдостоверенияЛичности
		|			И _ДанныеПользователей.НомерУдостоверенияЛичности = _СверкаПоУдостоверению.НомерУдостоверенияЛичности
		|			И _ДанныеПользователей.ДатаРождения = _СверкаПоУдостоверению.ДатаРождения
		|			И (_ДанныеПользователей.Ссылка = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеФизЛицИзУчетнойСистемы КАК _СверкаПоИНН
		|		ПО _ДанныеПользователей.ИНН = _СверкаПоИНН.ИНН
		|			И _ДанныеПользователей.ДатаРождения = _СверкаПоИНН.ДатаРождения
		|			И (_ДанныеПользователей.Ссылка = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеФизЛицИзУчетнойСистемы КАК _СверкаПоСНИЛС
		|		ПО _ДанныеПользователей.СНИЛС = _СверкаПоСНИЛС.СНИЛС
		|			И _ДанныеПользователей.ДатаРождения = _СверкаПоСНИЛС.ДатаРождения
		|			И (_ДанныеПользователей.Ссылка = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеФизЛицИзУчетнойСистемы КАК _СверкаПоФИО
		|		ПО _ДанныеПользователей.Фамилия = _СверкаПоФИО.Фамилия
		|			И _ДанныеПользователей.Имя = _СверкаПоФИО.Имя
		|			И _ДанныеПользователей.Отчество = _СверкаПоФИО.Отчество
		|			И _ДанныеПользователей.ДатаРождения = _СверкаПоФИО.ДатаРождения
		|			И (_ДанныеПользователей.Ссылка = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлассификацияОпределенияФизЛицПользователей.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ _НеопределенныеФизЛица
		|ИЗ
		|	_КлассификацияОпределенияФизЛицПользователей КАК _КлассификацияОпределенияФизЛицПользователей
		|ГДЕ
		|	_КлассификацияОпределенияФизЛицПользователей.Класс > &КлассОпределенияЮрЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлассификацияОпределенияФизЛицПользователей.Идентификатор КАК Идентификатор,
		|	_КлассификацияОпределенияФизЛицПользователей.ФизЛицо КАК Ссылка
		|ПОМЕСТИТЬ _ОпределенныеФизЛица
		|ИЗ
		|	_КлассификацияОпределенияФизЛицПользователей КАК _КлассификацияОпределенияФизЛицПользователей
		|ГДЕ
		|	_КлассификацияОпределенияФизЛицПользователей.Класс <= &КлассОпределенияЮрЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПользователей.Идентификатор КАК Идентификатор,
		|	_ДанныеПользователей.ГражданствоСтр = ВРЕГ(СтраныМира.НаименованиеПолное) КАК СтранаГражданства,
		|	СТРНАЙТИ(СтраныМира.Наименование, _ДанныеПользователей.ДопГражданстваСтр) > 0 КАК СтранаДопГражданства,
		|	СТРНАЙТИ(СтраныМира.Наименование, _ДанныеПользователей.РезиденстваСтр) > 0 КАК СтранаРезиденства,
		|	_ДанныеПользователей.КодСтраныВыдачиДокумента КАК КодСтраныВыдачиДокумента,
		|	_ДанныеПользователей.КодСтраныВыдачиДокумента = СтраныМира.КодАльфа2 КАК СтранаВыдачиДокумента,
		|	ВЫБОР
		|		КОГДА _ДанныеПользователей.КодСтраныВыдачиДокумента = СтраныМира.КодАльфа2
		|			ТОГДА ВЫБОР
		|					КОГДА _ДанныеПользователей.ВидДокументаСтр = ""passport""
		|						ТОГДА ВЫБОР
		|								КОГДА СтраныМира.Ссылка = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|									ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
		|								ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина)
		|							КОНЕЦ
		|					КОГДА _ДанныеПользователей.ВидДокументаСтр = ""driver_license""
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение)
		|					КОГДА _ДанныеПользователей.ВидДокументаСтр = ""residence_permit""
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВидНаЖительство)
		|				КОНЕЦ
		|	КОНЕЦ КАК ВидДокумента,
		|	_ДанныеПользователей.ВидДокументаСтр КАК ВидДокументаСтр,
		|	СтраныМира.Ссылка КАК СтранаСсылка
		|ИЗ
		|	_ДанныеПользователей КАК _ДанныеПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|		ПО (_ДанныеПользователей.ГражданствоСтр = ВРЕГ(СтраныМира.НаименованиеПолное)
		|				ИЛИ _ДанныеПользователей.КодСтраныВыдачиДокумента = СтраныМира.КодАльфа2
		|				ИЛИ СТРНАЙТИ(СтраныМира.Наименование, _ДанныеПользователей.ДопГражданстваСтр + _ДанныеПользователей.РезиденстваСтр) > 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор";
#КонецОбласти

	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаКонецДня", КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДанныеПользователей", ДанныеПользователей);
	Запрос.УстановитьПараметр("БанковскиеСчета", БанковскиеСчета);
	Запрос.УстановитьПараметр("КлассОпределенияЮрЛица", 4);

	Выборка = Запрос.Выполнить().Выбрать();
	
	//Дополняем анкетные данные ссылками на справочник "СтраныМира"		
	СтрокаТаблицы = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если СтрокаТаблицы = Неопределено 
			Или СтрокаТаблицы.Идентификатор <> Выборка.Идентификатор Тогда 
			
			СтрокаТаблицы = ДанныеПользователей.Найти(Выборка.Идентификатор, "Идентификатор");
			
			Если СтрокаТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Выборка.СтранаГражданства Тогда
			СтрокаТаблицы.Гражданство = Выборка.СтранаСсылка;
		КонецЕсли;
		
		Если Выборка.СтранаДопГражданства Тогда
			СтрокаТаблицы.АнкетныеДанные.ВтороеГражданство.Добавить(Выборка.СтранаСсылка);
		КонецЕсли;
		
		Если Выборка.СтранаВыдачиДокумента Тогда
			
			СтрокаТаблицы.ВидУдостоверенияЛичности = Выборка.ВидДокумента;
			СтрокаТаблицы.СтранаВыдачиДокумента = Выборка.СтранаСсылка;
			
			Если Не ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
				ЗафиксироватьСообщение("Не удалось определить вид документа [" + Выборка.ВидДокументаСтр + "] физ. лица [идентификатор ЕСИА.Финанс " + Выборка.Идентификатор + "]");
				Продолжить;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если Выборка.СтранаРезиденства Тогда
			СтрокаТаблицы.АнкетныеДанные.НалоговыйРезидентИностранногоГосударстваГосударство.Добавить(Выборка.СтранаСсылка);
		//	СтрокаТаблицы.АнкетныеДанные.ИностранныйНалогоплательщикГосударство.Добавить(ТекСтрока.СтранаСсылка);
		КонецЕсли;
					
	КонецЦикла;
	
	//ищем физ лицо в матрикс
	ВыборкаНеопределенныхФизЛиц = МВТ.Таблицы["_НеопределенныеФизЛица"].ПолучитьДанные().Выбрать();
		
	Если ВыборкаНеопределенныхФизЛиц.Количество() > 0 Тогда
		
		ИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
		ИмпортНСИ.ГруппаПравил                     = "Матрих";
		ИмпортНСИ.ГруппаОбъектов                   = Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица;
		ИмпортНСИ.Организация                      = ЭтотОбъект.Организация;
		ИмпортНСИ.Подразделение                    = Справочники.Подразделения.ГруппаКомпаний;
		ИмпортНСИ.Язык                             = Справочники.Языки.Русский;
		ИмпортНСИ.НеСообщатьОСозданииНовыхОбъектов = Истина;
		ИмпортНСИ.НеСообщатьОбОтсутствииИзменений  = Истина;
		
		Пока ВыборкаНеопределенныхФизЛиц.Следующий() Цикл 
			
			СтрокаТаблицыПользователей = ДанныеПользователей.Найти(ВыборкаНеопределенныхФизЛиц.Идентификатор, "Идентификатор");
				
			Если СтрокаТаблицыПользователей = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПоиска = "";
			
			Если ЗначениеЗаполнено(СтрокаТаблицыПользователей.ИНН) Тогда
				СтрокаПоиска = СтрокаТаблицыПользователей.ИНН;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыПользователей.Фамилия) Тогда
				
				СтрокаПоиска = СтрокаТаблицыПользователей.Фамилия;
				ЗафиксироватьСообщение("В системе ЕСИА.Финанс у пользователя [id " + СтрокаТаблицыПользователей.Идентификатор + "] отсутствует ИНН. Поиск юр. лица осуществлен по фамилии.", Ложь);
				
			Иначе
				ЗафиксироватьСообщение("В системе ЕСИА.Финанс у пользователя [id " + СтрокаТаблицыПользователей.Идентификатор + "] отсутствует номер ИНН и Фамилия. Анкета не будет загружена.");
				Продолжить;
			КонецЕсли;
			
			ДанныеМатрих = ИмпортНСИ.ПолучитьДанныеДляВыбора(СтрокаПоиска);
			
			Если ДанныеМатрих.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
						
			Для Каждого ТекФизЛицо Из  ДанныеМатрих Цикл 
				
				Если ТекФизЛицо.Имя = СтрокаТаблицыПользователей.Имя 
					И ТекФизЛицо.Отчество = СтрокаТаблицыПользователей.Отчество
					И СтрНайти(ТекФизЛицо.Представление, СтрокаТаблицыПользователей.Фамилия) > 0
					//если ИНН заполнен (или в матрикс или в ЕСИА) включаем его в сверку
					И (Не (ЗначениеЗаполнено(СтрокаТаблицыПользователей.ИНН) Или ЗначениеЗаполнено(ТекФизЛицо.ИНН)) Или СтрокаТаблицыПользователей.ИНН = ТекФизЛицо.ИНН) Тогда 
												
					СтрокаИмпортируемыйОбъект = ИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
					СтрокаИмпортируемыйОбъект.КодВоВнешнейСистеме = ТекФизЛицо.Идентификатор;
					ЗагруженныйОбъект = ИмпортНСИ.ИмпортироватьДанные(); 
					
					Если ЗагруженныйОбъект = Неопределено Тогда
						ЗафиксироватьСообщение("Ну удалось загрузить физ лицо по коду [" + ТекФизЛицо.Идентификатор + "]!");
					ИначеЕсли ЗагруженныйОбъект.Количество() = 1 Тогда
	                	СтрокаТаблицыПользователей.Ссылка = ЗагруженныйОбъект[0].Ссылка;
					КонецЕсли;
												
				КонецЕсли;
					
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МассивКодовПайщиков = Новый Массив;
	КодыСтр = "";
	
	ДанныеБанковскихСчетов = МВТ.Таблицы["_ДанныеБанковскихСчетов"].ПолучитьДанные().Выгрузить();
	ОпределенныеФизЛица = МВТ.Таблицы["_ОпределенныеФизЛица"].ПолучитьДанные().Выгрузить();
	
	Для Каждого СтрокаДанных Из ДанныеПользователей Цикл
				
		Если СтрокаДанных.ЗаписатьКодПайщика Тогда
			МассивКодовПайщиков.Добавить(Новый Структура("id, pifs_portfolio_code", СтрокаДанных.Идентификатор, СтрокаДанных.Идентификатор));
			КодыСтр = КодыСтр + ?(КодыСтр = "", "", ", ") + СтрокаДанных.Идентификатор;
		КонецЕсли;
					
		ДокументОбъект = Документы.АнкетаФизическогоЛица.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДанных);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДанных.АнкетныеДанные);
		
		ТекДата = ТекущаяДатаСеанса();
		
		Если НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекДата) Тогда
			ДокументОбъект.Дата = ТекДата;
		ИначеЕсли НачалоДня(ЭтотОбъект.Дата) > СтрокаДанных.ДатаАктуальности Тогда 
			ДокументОбъект.Дата = ЭтотОбъект.Дата;
		Иначе
			ДокументОбъект.Дата = СтрокаДанных.ДатаАктуальности;	
		КонецЕсли;
		
		ДокументОбъект.Организация = ЭтотОбъект.Организация;
		
		Если ЗначениеЗаполнено(СтрокаДанных.Ссылка) Тогда
			
			ДокументОбъект.ЮрФизЛицо = СтрокаДанных.Ссылка;
			
		Иначе
			
			СтрокаОпределенныхФизЛиц = ОпределенныеФизЛица.Найти(СтрокаДанных.Идентификатор, "Идентификатор");
				
			Если СтрокаОпределенныхФизЛиц <> Неопределено Тогда
				ДокументОбъект.ЮрФизЛицо = СтрокаОпределенныхФизЛиц.Ссылка;
			КонецЕсли;
	
		КонецЕсли;
		
		ДокументОбъект.РезидентПо173ФЗ = Истина;
		ДокументОбъект.ИсточникАнкеты = Перечисления.ИсточникиАнкетИЗаявок.Сайт;
		ДокументОбъект.УпрощеннаяИдентификация = Ложь;
		ДокументОбъект.ВыгодоприобретательКлиент = Истина;
		ДокументОбъект.БенефициарныйВладелецКлиент = Истина; 
		
		Для Каждого ТекГражданство Из СтрокаДанных.АнкетныеДанные.ВтороеГражданство Цикл
			ДокументОбъект.ВтороеГражданство = ТекГражданство;
			Прервать;
		КонецЦикла;
		
		Для Каждого ТекРезиденство Из СтрокаДанных.АнкетныеДанные.НалоговыйРезидентИностранногоГосударстваГосударство Цикл
			ДокументОбъект.НалоговыйРезидентИностранногоГосударстваГосударство = ТекРезиденство;
			Прервать;
		КонецЦикла;
		
		БанковскиеСчетаПользователя = ДанныеБанковскихСчетов.НайтиСтроки(Новый Структура("ИдентификаторПользователя", СтрокаДанных.Идентификатор));
		
		Для Каждого ТекСчет Из БанковскиеСчетаПользователя Цикл
			
			НоваяЗапись = ДокументОбъект.БанковскиеРеквизиты.Добавить();
			НоваяЗапись.РасчетныйСчет = ТекСчет.Ссылка; 
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСчет); 
			
		КонецЦикла;
		
		НачатьТранзакцию();
	
		ДокументОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаДанныхВАнкету", Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(ДокументОбъект.Ссылка,
			Справочники.ВнешниеСистемы.ЕсиаФинанс,
			Справочники.ГруппыИмпортируемыхОбъектов.АнкетыФизическихЛиц, СтрокаДанных.Идентификатор,,, ?(ЗначениеЗаполнено(СтрокаДанных.АнкетаСсылка), ДокументОбъект.Дата, Дата('19800101')));
				
		Если Не СтрокаДанных.ЕстьКодЕсиа Тогда	
			РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(ДокументОбъект.ЮрФизЛицо,
				Справочники.ВнешниеСистемы.ЕсиаФинанс,
				Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица, СтрокаДанных.Идентификатор);
		КонецЕсли;
			
		СтрокаДанных.Ссылка = ДокументОбъект.ЮрФизЛицо;	
				
		ЗагрузитьФайлыВХранилище(ДокументОбъект.Ссылка, СтрокаДанных.АнкетныеДанные.МассивФайлов);
		
		ЗафиксироватьСообщение("Загружена анкета физ лица [" + ДокументОбъект.Ссылка + "]", Ложь);
		
		ЗафиксироватьТранзакцию();
					
	КонецЦикла;
	
	Если МассивКодовПайщиков.Количество() > 0 Тогда
		
		ТекстСообщения = "Не удалось загрузить коды пользователей [pifs_portfolio_code] в систему ЕСИА.Финанс. " + КодыСтр; 
		
		ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("users", МассивКодовПайщиков));
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/v1/back_office/users/import", ТелоЗапроса, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ЗафиксироватьСообщение(ТекстСообщения);
		КонецЕсли;
			
	КонецЕсли;	
		
КонецПроцедуры

Функция ПодписьВалидна(СтруктураПодписи)
	
	Возврат (СтруктураПодписи.Свойство("kind") 
				И СтруктураПодписи.kind = "ses" //simple electronic signature 
				И СтруктураПодписи.Свойство("is_valid_signature") 
				И СтруктураПодписи.is_valid_signature);  
		
КонецФункции

Функция ПоследняяСтоимостьПаяИСЧАЛКК(КодПИФВЕсиаФинанс, ДатаСтоимости = Неопределено, Отказ = Ложь) Экспорт
	
	ДанныеПоПИФ = Новый Структура("СтоимостьПая, СЧА", -1, -1);
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(); 
	
	ТекстОшибки = "Не удалось получить данные по ПИФ из системы ЕСИА.Финанс"; 
		
	ТекстЗапроса = "/api/v1/back_office/funds/" + КодПИФВЕсиаФинанс;
	
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, ТекстЗапроса,, ТекстОшибки);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗафиксироватьСообщение(ТекстОшибки);
		Отказ = Истина;
		Возврат ДанныеПоПИФ;
	КонецЕсли;

	ДанныеЕсиа = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), Истина);
		
	Если Не (ТипЗнч(ДанныеЕсиа) = Тип("Структура") И ДанныеЕсиа.Свойство("success") И ДанныеЕсиа.success)
		Или Не ДанныеЕсиа.Свойство("fund") Тогда
		
		ЗафиксироватьСообщение("Не удалось получить данные по ПИФ из системы ЕСИА.Финанс");
		Отказ = Истина;
		Возврат ДанныеПоПИФ;
		
	КонецЕсли;
	
	// Проверяем дату, если нужно
	Если ДатаСтоимости <> Неопределено
		И ДатаСтоимости <> XMLЗначение(Тип("Дата"), ДанныеЕсиа.fund.last_price.date) Тогда
		Отказ = Истина;
		Возврат ДанныеПоПИФ;
	КонецЕсли;	
		
	ДанныеПоПИФ.Вставить("СтоимостьПая",	ДанныеЕсиа.fund.last_price.value);
	ДанныеПоПИФ.Вставить("СЧА",				ДанныеЕсиа.fund.last_price.scha_value);
	
	Возврат ДанныеПоПИФ;
	
КонецФункции
	        
ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
