
&НаСервере
Процедура ПроверитьАктивностьЦенныхБумагНаСервере()
	
	ЭтаФорма.ОтчетHTML = РеквизитФормыВЗначение("Объект").СформироватьОтчетОЦенныхБумагахНеИмеющихАктивногоРынка();
	
	Если ЭтаФорма.ОтправлятьОповещенияПоЕМэйл Тогда
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста",
			Объект.ПолучателиОповещения,
			"Облигации, не имеющие активного рынка на " + Формат(Объект.Период, "ДФ=dd.MM.yyyy"),
			ЭтаФорма.ОтчетHTML,
			"HTML");
	
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьАктивностьЦенныхБумагНаСервере


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период      = ТекущаяДата() - 86400;
		
	Объект.ГлубинаПериодаПроверки              = 90;
	Объект.МинимальноеКоличествоСделокЗаПериод = 10;
	Объект.МинимальнаяСуммаСделокЗаПериод      = 500000;
	Объект.МинимальноеКоличествоКотировокЗаПериодНаВнебирже = 10;
	Объект.ПериодПроверкиВТорговыхДнях = Истина;
	Объект.ВключатьВОтчетТолькоОблигации = Истина;
	
	НоваяСтрокаКлиентыДоверительногоУправления = Объект.КлиентыДоверительногоУправления.Добавить();
	НоваяСтрокаКлиентыДоверительногоУправления.КлиентДоверительногоУправления = Справочники.ЮрФизЛица.НайтиПоНаименованию("Российский Инвестиционный фонд Информационно-коммуникационных Технологий");
	
	Объект.ПолучателиОповещения = "seina@region.ru; kulik@region.ru; pimenova@region.ru; sindyashkin@region.ru; sorokinev@region.ru; balagurov@region.ru"; // "krivonosov@region.ru";
	
	ЭтаФорма.ИнтервалПроверки.Вариант    = ВариантСтандартногоПериода.Вчера;
	ЭтаФорма.ОтправлятьОповещенияПоЕМэйл = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтправлятьОповещенияПоЕМэйлПриИзменении(Неопределено);
	ПроверкаЗаИнтервалПриИзменении(Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправлятьОповещенияПоЕМэйлПриИзменении(Элемент)
	
	Элементы.ПолучателиОповещения.Видимость = ЭтаФорма.ОтправлятьОповещенияПоЕМэйл;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаИнтервалПриИзменении(Элемент)
	
	Если      ЭтаФорма.ПроверкаЗаИнтервал = 0 Тогда
		Элементы.ИнтервалПроверки.Видимость = Ложь;
		Элементы.Период.Видимость           = Истина;
		
		Элементы.ОтправлятьОповещенияПоЕМэйл.ТолькоПросмотр = Ложь;
				
	ИначеЕсли ЭтаФорма.ПроверкаЗаИнтервал = 1 Тогда
		Элементы.ИнтервалПроверки.Видимость = Истина;
		Элементы.Период.Видимость           = Ложь;
		
		ЭтаФорма.ОтправлятьОповещенияПоЕМэйл = Истина;
		
		ОтправлятьОповещенияПоЕМэйлПриИзменении(Неопределено);
		
		Элементы.ОтправлятьОповещенияПоЕМэйл.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыполнитьПроверку(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВыполнитьПроверку");
	ВыполнитьПроверку();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверку()
	
	Если      ЭтаФорма.ПроверкаЗаИнтервал = 1 Тогда
		Объект.Период = ЭтаФорма.ИнтервалПроверки.ДатаОкончания;
		
		Пока Объект.Период >= ЭтаФорма.ИнтервалПроверки.ДатаНачала Цикл
			ПроверитьАктивностьЦенныхБумагНаСервере();
			Объект.Период = Объект.Период - 86400;
		КонецЦикла;
		
	ИначеЕсли ЭтаФорма.ПроверкаЗаИнтервал = 0 Тогда
		ПроверитьАктивностьЦенныхБумагНаСервере();
		
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтчетHTML;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКлиентовПИФНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК КлиентДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаПроверки, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	(СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ИЛИ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов))
		|	И (СчетаДоверительногоУправления.ДатаРасторжения > &ДатаПроверки
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И СчетаДоверительногоУправления.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаПроверки", ЭтаФорма.ИнтервалПроверки.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	
	Объект.КлиентыДоверительногоУправления.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКлиентовПИФ(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ДобавитьКлиентовПИФ");
	ДобавитьКлиентовПИФНаСервере();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
