Перем МассивОшибок;
Перем ОтчетФормируетсяАвтоматически;

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о результатах доверительного управления",
		"2.02",
		"",
		Истина
	);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	ОтчетФормируетсяАвтоматически = Истина;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ДатаПервогоВвода = ПолучитьДатуПервогоВводаПоСчетуДУ(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период);
	
	Если ДатаПервогоВвода = Неопределено ИЛИ ДатаПервогоВвода > ЭтотОбъект.Период.ДатаОкончания Тогда
		ВызватьИсключение  СтрШаблон("По счету доверительного управления %1 на %2 не зарегистрировано ни одного ввода.", ЭтотОбъект.СчетДоверительногоУправления, Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	Если ДатаПервогоВвода > ЭтотОбъект.Период.ДатаНачала Тогда
		ЭтотОбъект.Период.ДатаНачала = ДатаПервогоВвода;
	КонецЕсли;		
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ПриКомпоновкеРезультата(ДокументРезультат, Неопределено, Ложь);
	
	Если МассивОшибок.Количество() Тогда
		ВызватьИсключение СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("АвтоматическаяОтправка");
	Настройки.Добавить("АдресЭлектроннойПочты");
	Настройки.Добавить("АдресОтправителя");
	Настройки.Добавить("СНачалаУправления");
	Возврат Настройки;

КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Период.ДатаОкончания < ЭтотОбъект.Период.ДатаНачала Тогда
		ЗарегистрироватьОшибку("Некорректно задан период расчета", МассивОшибок, Отказ);
		
	ИначеЕсли Год(ЭтотОбъект.Период.ДатаНачала) <> Год(ЭтотОбъект.Период.ДатаОкончания) Тогда
		ЗарегистрироватьОшибку("Даты начала и окончания периода расчета должны быть в одном году", МассивОшибок, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)	
	
	Отказ = Ложь;
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,КлючТекущегоВарианта,ВалютаОтчета");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Организация_РЭМ	= ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
	
	Если Организация = Организация_РЭМ Тогда
		Логотип = ПолучитьОбщийМакет("ЛоготипРЭМ");
	Иначе
		Логотип = Неопределено;
	КонецЕсли;
	
	ВалютаУчета		= ЭтотОбъект.Организация.ВалютаУчета;
	ОтчетВВалюте	= ЗначениеЗаполнено(ЭтотОбъект.ВалютаОтчета) И (ЭтотОбъект.ВалютаОтчета <> ВалютаУчета);
	ПостфиксОбласти	= ?(ОтчетВВалюте, "Валюта", "");
	
	ПараметрыРасчетаДоходности = Новый Структура;
	ПараметрыРасчетаДоходности.Вставить("Организация",					ЭтотОбъект.Организация);
	ПараметрыРасчетаДоходности.Вставить("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыРасчетаДоходности.Вставить("ДатаНачала",					ЭтотОбъект.Период.ДатаНачала);
	ПараметрыРасчетаДоходности.Вставить("ДатаОкончания",				ЭтотОбъект.Период.ДатаОкончания);
	ПараметрыРасчетаДоходности.Вставить("УчитыватьНДФЛПоНачислению",	Истина);
	ПараметрыРасчетаДоходности.Вставить("РасшифровкаРасчета",			Истина);
	ПараметрыРасчетаДоходности.Вставить("МассивОшибок",					МассивОшибок);
	ПараметрыРасчетаДоходности.Вставить("ВалютаРасчета",				Справочники.Валюты.ПустаяСсылка());
	
	Если ЭтотОбъект.ИсключитьАктивыИзРасчетаДоходности Тогда
		ПараметрыРасчетаДоходности.Вставить("СписокАктивовДляИсключенияИзРасчетаДоходности", ЭтотОбъект.СписокАктивовДляИсключенияИзРасчетаДоходности);
    КонецЕсли;

	НаименованияКлиента = РаботаСОтчетами.ПолноеИКраткоеНаименованиеКлиентаДляДокументов(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
	
	#Область Текст_запроса
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДУ,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДУ,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент,
		|	СтратегииИндивидуальногоИнвестирования.Стратегия КАК Стратегия
		|ПОМЕСТИТЬ КлиентыДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправления
		|		ПО (КлиентыДоверительногоУправления.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК СтратегииИндивидуальногоИнвестирования
		|		ПО (СтратегииИндивидуальногоИнвестирования.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу
		|ПОМЕСТИТЬ РеквизитыОрганизации
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&КонецПериода,
		|			ЮрФизЛицо = &ЮрФизЛицоОрганизации
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ПолноеНаименованиеКлиента КАК ПолноеНаименованиеКлиента
		|ПОМЕСТИТЬ РеквизитыКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Значение
		|ПОМЕСТИТЬ КурсВалютыОтчета
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Валюта = &ВалютаОтчета
		|	И КурсыВалют.Период = &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|			ТОГДА ""Еврооблигации""
		|		ИНАЧЕ СтоимостьПереоценки.Рынок
		|	КОНЕЦ КАК Рынок,
		|	СУММА(СтоимостьПереоценки.Количество) - ЕСТЬNULL(КоличествоЦБКупленныхПоРЕПО.Количество, 0) КАК Количество,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) - ЕСТЬNULL(СтоимостьЦБКупленныхПоРЕПО.Стоимость, 0) КАК Стоимость
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|			СУММА(ЗадолженностиПоВторойЧастиРЕПО.КоличествоОстаток) КАК Количество
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|					&КонецПериодаКонецДняГраница,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И &НеУчитыватьЦБКупленныеПоРЕПО
		|						И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоВторойЧастиРЕПО
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага) КАК КоличествоЦБКупленныхПоРЕПО
		|		ПО (КоличествоЦБКупленныхПоРЕПО.ЦеннаяБумага = СтоимостьПереоценки.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АктивыНеЦБ.СубъектАналитики КАК ЦеннаяБумага,
		|			-СУММА(АктивыНеЦБ.СуммаРынокВВалютеУчета) КАК Стоимость
		|		ИЗ
		|			РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК АктивыНеЦБ
		|		ГДЕ
		|			АктивыНеЦБ.Организация = &Организация
		|			И АктивыНеЦБ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			И АктивыНеЦБ.Период = &КонецПериода
		|			И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|			И АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			И АктивыНеЦБ.СубъектАналитики <> НЕОПРЕДЕЛЕНО
		|		
		|		СГРУППИРОВАТЬ ПО
		|			АктивыНеЦБ.СубъектАналитики) КАК СтоимостьЦБКупленныхПоРЕПО
		|		ПО (СтоимостьЦБКупленныхПоРЕПО.ЦеннаяБумага = СтоимостьПереоценки.ЦеннаяБумага)
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.Период = &КонецПериода
		|	И НЕ СтоимостьПереоценки.ЦеннаяБумага В (&СписокАктивовДляИсключенияИзРасчетаДоходности)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|			ТОГДА ""Еврооблигации""
		|		ИНАЧЕ СтоимостьПереоценки.Рынок
		|	КОНЕЦ,
		|	КоличествоЦБКупленныхПоРЕПО.Количество,
		|	СтоимостьЦБКупленныхПоРЕПО.Стоимость
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СтоимостьПереоценки.Количество) <> ЕСТЬNULL(КоличествоЦБКупленныхПоРЕПО.Количество, 0)
		|		ИЛИ СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) <> ЕСТЬNULL(СтоимостьЦБКупленныхПоРЕПО.Стоимость, 0))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктивыНеЦБ.СубъектАналитики,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|			ТОГДА ""Евроблигации принятые по РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации принятые по РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акции принятые по РЕПО""
		|		ИНАЧЕ ""Иные бумаги принятые по РЕПО""
		|	КОНЕЦ,
		|	ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.Количество, 0) + ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПО.Количество, 0),
		|	СУММА(АктивыНеЦБ.СуммаРынокВВалютеУчета)
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК АктивыНеЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|			СУММА(ЗадолженностиПоВторойЧастиРЕПО.КоличествоОстаток) КАК Количество
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|					&КонецПериодаКонецДняГраница,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоВторойЧастиРЕПО
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага) КАК ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО
		|		ПО (ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.ЦеннаяБумага = АктивыНеЦБ.СубъектАналитики)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|			СУММА(ЗадолженностиПоЦеннымБумагам.КоличествоОстаток) КАК Количество
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|					&КонецПериодаКонецДняГраница,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|						И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоЦеннымБумагам
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага) КАК ЗадолженностиПоЦБПроданныхВРЕПО
		|		ПО (ЗадолженностиПоЦБПроданныхВРЕПО.ЦеннаяБумага = АктивыНеЦБ.СубъектАналитики)
		|ГДЕ
		|	АктивыНеЦБ.Организация = &Организация
		|	И АктивыНеЦБ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И АктивыНеЦБ.Период = &КонецПериода
		|	И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|	И АктивыНеЦБ.СубъектАналитики <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.Количество, 0) + ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПО.Количество, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	АктивыНеЦБ.СубъектАналитики,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|			ТОГДА ""Евроблигации принятые по РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации принятые по РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акции принятые по РЕПО""
		|		ИНАЧЕ ""Иные бумаги принятые по РЕПО""
		|	КОНЕЦ,
		|	ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.Количество,
		|	ЗадолженностиПоЦБПроданныхВРЕПО.Количество
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктивыНеЦБ.СубъектАналитики,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|			ТОГДА ""Евроблигации переданные в РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации переданные в РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акции переданные в РЕПО""
		|		ИНАЧЕ ""Иные бумаги переданные в РЕПО""
		|	КОНЕЦ,
		|	ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.Количество, 0) + ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПО.Количество, 0),
		|	СУММА(АктивыНеЦБ.СуммаРынокВВалютеУчета)
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК АктивыНеЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|			СУММА(ЗадолженностиПоВторойЧастиРЕПО.КоличествоОстаток) КАК Количество
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|					&КонецПериодаКонецДняГраница,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)) КАК ЗадолженностиПоВторойЧастиРЕПО
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага) КАК ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО
		|		ПО (ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.ЦеннаяБумага = АктивыНеЦБ.СубъектАналитики)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|			СУММА(ЗадолженностиПоЦеннымБумагам.КоличествоОстаток) КАК Количество
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|					&КонецПериодаКонецДняГраница,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|						И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)) КАК ЗадолженностиПоЦеннымБумагам
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага) КАК ЗадолженностиПоЦБПроданныхВРЕПО
		|		ПО (ЗадолженностиПоЦБПроданныхВРЕПО.ЦеннаяБумага = АктивыНеЦБ.СубъектАналитики)
		|ГДЕ
		|	АктивыНеЦБ.Организация = &Организация
		|	И АктивыНеЦБ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И АктивыНеЦБ.Период = &КонецПериода
		|	И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|	И АктивыНеЦБ.СубъектАналитики <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.Количество, 0) + ЕСТЬNULL(ЗадолженностиПоЦБПроданныхВРЕПО.Количество, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	АктивыНеЦБ.СубъектАналитики,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|			ТОГДА ""Евроблигации переданные в РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации переданные в РЕПО""
		|		КОГДА АктивыНеЦБ.СубъектАналитики ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акции переданные в РЕПО""
		|		ИНАЧЕ ""Иные бумаги переданные в РЕПО""
		|	КОНЕЦ,
		|	ЗадолженностиПоЦБПроданныхВРЕПОПоВторойЧастиРЕПО.Количество,
		|	ЗадолженностиПоЦБПроданныхВРЕПО.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд
		|		ИНАЧЕ СтоимостьПереоценки.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент,
		|	ЕСТЬNULL(СтоимостьПереоценки.ЦеннаяБумага.НомерВыпуска, """") КАК НомерВыпуска,
		|	ЕСТЬNULL(СтоимостьПереоценки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, """") КАК ГосударственныйРегистрационныйномер,
		|	ISINы.Код КАК ISIN,
		|	ЕСТЬNULL(Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация), ЛОЖЬ) КАК Еврооблигация,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Привилегированная)
		|			ТОГДА ""прив.""
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Обыкновенная)
		|			ТОГДА ""обыкн.""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Тип
		|ПОМЕСТИТЬ РеквизитыЦБ
		|ИЗ
		|	_ЦенныеБумаги КАК СтоимостьПереоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО СтоимостьПереоценки.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК ISINы
		|		ПО СтоимостьПереоценки.ЦеннаяБумага = ISINы.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	АктивыНеЦБ.СубъектАналитики КАК ДепозитныйВклад,
		|	ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.Наименование КАК ПредставлениеБанка,
		|	ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.ДепозитныеВклады).ДатаРегистрации КАК ДатаЗаключения,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаОкончания,
		|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Ставка
		|ПОМЕСТИТЬ ЮрЛицаБанковДепозита
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК АктивыНеЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО АктивыНеЦБ.СубъектАналитики = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	АктивыНеЦБ.Организация = &Организация
		|	И АктивыНеЦБ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|	И АктивыНеЦБ.Период = &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДенежныеСредстваМНООстатки.МНО КАК МНО,
		|	ДенежныеСредстваМНООстатки.РасчетныйСчет КАК РасчетныйСчет,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток КАК СуммаОстаток,
		|	ДенежныеСредстваМНООстатки.РасчетныйСчет.Валюта КАК Валюта,
		|	ДокументМНО.Дата КАК ДатаЗаключения,
		|	ДокументМНО.ДатаВозврата КАК ДатаОкончания,
		|	ДокументМНО.Процент КАК Ставка
		|ПОМЕСТИТЬ _СуммыМНО
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|			&КонецПериодаКонецДняГраница,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокументМНО
		|		ПО ДенежныеСредстваМНООстатки.МНО = ДокументМНО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.Рынок КАК Рынок,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ЕСТЬNULL(РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда, """") + "", рег.номер "" + ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И РеквизитыЦБ.Еврооблигация
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА РеквизитыЦБ.НомерВыпуска = """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу
		|		ИНАЧЕ РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|	КОНЕЦ КАК Содержимое,
		|	РеквизитыЦБ.ГосударственныйРегистрационныйномер КАК ГосударственныйРегистрационныйНомер,
		|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
		|	СУММА(СтоимостьПереоценки.Стоимость) КАК Стоимость,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ЕСТЬNULL(РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда, """") + "", рег.номер "" + ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И РеквизитыЦБ.Еврооблигация
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА РеквизитыЦБ.НомерВыпуска = """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу
		|		ИНАЧЕ РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|	КОНЕЦ + "" "" + РеквизитыЦБ.ГосударственныйРегистрационныйномер КАК СодержимоеДляКонтроля,
		|	NULL КАК ДатаЗаключения,
		|	NULL КАК ДатаОкончания,
		|	NULL КАК Ставка
		|ПОМЕСТИТЬ _Портфель
		|ИЗ
		|	_ЦенныеБумаги КАК СтоимостьПереоценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыЦБ КАК РеквизитыЦБ
		|		ПО (РеквизитыЦБ.ЦеннаяБумага = СтоимостьПереоценки.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							РеквизитыЦБ.Эмитент
		|						ИЗ
		|							РеквизитыЦБ)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитента
		|		ПО (РеквизитыЭмитента.ЮрФизЛицо = РеквизитыЦБ.Эмитент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(
		|				&КонецПериода,
		|				ПаевойИнвестиционныйФонд В
		|					(ВЫБРАТЬ
		|						РеквизитыЦБ.Эмитент
		|					ИЗ
		|						РеквизитыЦБ)) КАК РеквизитыПИФСрезПоследних
		|		ПО (РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд = РеквизитыЦБ.Эмитент)
		|ГДЕ
		|	НЕ(СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
		|				И ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс))
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.Рынок,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ЕСТЬNULL(РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда, """") + "", рег.номер "" + ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И РеквизитыЦБ.Еврооблигация
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА РеквизитыЦБ.НомерВыпуска = """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу
		|		ИНАЧЕ РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|	КОНЕЦ,
		|	РеквизитыЦБ.ГосударственныйРегистрационныйномер,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ЕСТЬNULL(РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда, """") + "", рег.номер "" + ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И РеквизитыЦБ.НомерВыпуска <> """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + РеквизитыЦБ.Тип + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И РеквизитыЦБ.Еврооблигация
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", ISIN "" + РеквизитыЦБ.ISIN
		|		КОГДА РеквизитыЦБ.НомерВыпуска = """"
		|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу
		|		ИНАЧЕ РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", выпуск "" + РеквизитыЦБ.НомерВыпуска
		|	КОНЕЦ + "" "" + РеквизитыЦБ.ГосударственныйРегистрационныйномер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Фьючерсный контракт"",
		|	NULL,
		|	ВЫБОР
		|		КОГДА ФьючерсныеКонтракты.Количество > 0
		|			ТОГДА ФьючерсныеКонтракты.ЦеннаяБумага + "" (контракт на покупку)""
		|		ИНАЧЕ ФьючерсныеКонтракты.ЦеннаяБумага + "" (контракт на продажу)""
		|	КОНЕЦ,
		|	"""",
		|	ВЫБОР
		|		КОГДА ФьючерсныеКонтракты.Количество > 0
		|			ТОГДА ФьючерсныеКонтракты.Количество
		|		ИНАЧЕ -ФьючерсныеКонтракты.Количество
		|	КОНЕЦ,
		|	0,
		|	"""",
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		СтоимостьПереоценки.ЦеннаяБумага.Наименование КАК ЦеннаяБумага,
		|		СУММА(СтоимостьПереоценки.Количество) КАК Количество
		|	ИЗ
		|		_ЦенныеБумаги КАК СтоимостьПереоценки
		|	ГДЕ
		|		СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
		|		И ВЫРАЗИТЬ(СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СтоимостьПереоценки.ЦеннаяБумага.Наименование) КАК ФьючерсныеКонтракты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|			ТОГДА ""Денежные средства""
		|		КОГДА АктивыНеЦБ.Основание ССЫЛКА Документ.СделкаСВалютой
		|			ТОГДА ""Обязательства по сделке с валютой""
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|			ТОГДА ВЫБОР
		|					КОГДА АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|						ТОГДА ""Денежные средства в РЕПО в "" + АктивыНеЦБ.Валюта.Наименование
		|					ИНАЧЕ ""Денежные средства""
		|				КОНЕЦ
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|			ТОГДА ВЫБОР
		|					КОГДА АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|							И АктивыНеЦБ.СубъектАналитики = НЕОПРЕДЕЛЕНО
		|						ТОГДА ""Обязательства по исполнению второй части РЕПО в "" + АктивыНеЦБ.Валюта.Наименование
		|					ИНАЧЕ ""Денежные средства""
		|				КОНЕЦ
		|		ИНАЧЕ АктивыНеЦБ.ВидАктива
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА АктивыНеЦБ.СубъектАналитики
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА АктивыНеЦБ.СубъектАналитики
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) <> ТИП(Документ.МНО)
		|			ТОГДА ""Денежные средства в "" + АктивыНеЦБ.Валюта.Наименование
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ""Денежные средства на МНО, "" + АктивыНеЦБ.Валюта.Наименование
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ""Депозит "" + ЕСТЬNULL(РеквизитыБанкаДепозита.СокращенноеНаименование, ЮрЛицаБанковДепозита.ПредставлениеБанка)
		|		КОГДА АктивыНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
		|				И АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				И АктивыНеЦБ.СубъектАналитики <> НЕОПРЕДЕЛЕНО
		|			ТОГДА АктивыНеЦБ.СубъектАналитики
		|		ИНАЧЕ АктивыНеЦБ.ВидАктива
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА """"
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.ДепозитныеВклады).Наименование
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	СУММА(ВЫБОР
		|			КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|					И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|				ТОГДА 0
		|			ИНАЧЕ АктивыНеЦБ.СуммаРынок
		|		КОНЕЦ),
		|	СУММА(АктивыНеЦБ.СуммаРынокВВалютеУчета),
		|	"""",
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Документ.МНО).Дата
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ЮрЛицаБанковДепозита.ДатаЗаключения
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Документ.МНО).ДатаВозврата
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ЮрЛицаБанковДепозита.ДатаОкончания
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Документ.МНО).Процент
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ЮрЛицаБанковДепозита.Ставка
		|		ИНАЧЕ NULL
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК АктивыНеЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЮрЛицаБанковДепозита КАК ЮрЛицаБанковДепозита
		|		ПО (ЮрЛицаБанковДепозита.ДепозитныйВклад = АктивыНеЦБ.СубъектАналитики)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							ЮрЛицаБанковДепозита.ЮрФизЛицо
		|						ИЗ
		|							ЮрЛицаБанковДепозита)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыБанкаДепозита
		|		ПО (РеквизитыБанкаДепозита.ЮрФизЛицо = АктивыНеЦБ.СубъектАналитики)
		|ГДЕ
		|	АктивыНеЦБ.Организация = &Организация
		|	И АктивыНеЦБ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И АктивыНеЦБ.Период = &КонецПериода
		|	И НЕ(АктивыНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
		|				И АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				И АктивыНеЦБ.СубъектАналитики <> НЕОПРЕДЕЛЕНО)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|			ТОГДА ""Денежные средства""
		|		КОГДА АктивыНеЦБ.Основание ССЫЛКА Документ.СделкаСВалютой
		|			ТОГДА ""Обязательства по сделке с валютой""
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|			ТОГДА ВЫБОР
		|					КОГДА АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|						ТОГДА ""Денежные средства в РЕПО в "" + АктивыНеЦБ.Валюта.Наименование
		|					ИНАЧЕ ""Денежные средства""
		|				КОНЕЦ
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|			ТОГДА ВЫБОР
		|					КОГДА АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|							И АктивыНеЦБ.СубъектАналитики = НЕОПРЕДЕЛЕНО
		|						ТОГДА ""Обязательства по исполнению второй части РЕПО в "" + АктивыНеЦБ.Валюта.Наименование
		|					ИНАЧЕ ""Денежные средства""
		|				КОНЕЦ
		|		ИНАЧЕ АктивыНеЦБ.ВидАктива
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА АктивыНеЦБ.СубъектАналитики
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА АктивыНеЦБ.СубъектАналитики
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) <> ТИП(Документ.МНО)
		|			ТОГДА ""Денежные средства в "" + АктивыНеЦБ.Валюта.Наименование
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ""Денежные средства на МНО, "" + АктивыНеЦБ.Валюта.Наименование
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ""Депозит "" + ЕСТЬNULL(РеквизитыБанкаДепозита.СокращенноеНаименование, ЮрЛицаБанковДепозита.ПредставлениеБанка)
		|		КОГДА АктивыНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
		|				И АктивыНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				И АктивыНеЦБ.СубъектАналитики <> НЕОПРЕДЕЛЕНО
		|			ТОГДА АктивыНеЦБ.СубъектАналитики
		|		ИНАЧЕ АктивыНеЦБ.ВидАктива
		|	КОНЕЦ,
		|	АктивыНеЦБ.Валюта,
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Документ.МНО).Дата
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ЮрЛицаБанковДепозита.ДатаЗаключения
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Документ.МНО).ДатаВозврата
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ЮрЛицаБанковДепозита.ДатаОкончания
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Документ.МНО).Процент
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ЮрЛицаБанковДепозита.Ставка
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(АктивыНеЦБ.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА """"
		|		КОГДА &ДепозитыРазвернуто
		|				И АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА ВЫРАЗИТЬ(АктивыНеЦБ.СубъектАналитики КАК Справочник.ДепозитныеВклады).Наименование
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства"",
		|	NULL,
		|	""Денежные средства в "" + _СуммыМНО.Валюта.Наименование,
		|	"""",
		|	-СУММА(_СуммыМНО.СуммаОстаток),
		|	-СУММА(_СуммыМНО.СуммаОстаток),
		|	"""",
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	_СуммыМНО КАК _СуммыМНО
		|
		|СГРУППИРОВАТЬ ПО
		|	_СуммыМНО.Валюта,
		|	""Денежные средства в "" + _СуммыМНО.Валюта.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства"",
		|	_СуммыМНО.МНО,
		|	""Денежные средства на МНО, "" + _СуммыМНО.Валюта.Наименование,
		|	"""",
		|	_СуммыМНО.СуммаОстаток,
		|	_СуммыМНО.СуммаОстаток,
		|	"""",
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|			ТОГДА _СуммыМНО.ДатаЗаключения
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|			ТОГДА _СуммыМНО.ДатаОкончания
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ДепозитыРазвернуто
		|			ТОГДА _СуммыМНО.Ставка
		|		ИНАЧЕ NULL
		|	КОНЕЦ
		|ИЗ
		|	_СуммыМНО КАК _СуммыМНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Портфель.Рынок КАК Рынок,
		|	_Портфель.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Портфель.Содержимое КАК Содержимое,
		|	_Портфель.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	СУММА(_Портфель.Количество) КАК Количество,
		|	СУММА(_Портфель.Стоимость) КАК Стоимость,
		|	_Портфель.СодержимоеДляКонтроля КАК СодержимоеДляКонтроля,
		|	_Портфель.ДатаЗаключения КАК ДатаЗаключения,
		|	_Портфель.ДатаОкончания КАК ДатаОкончания,
		|	_Портфель.Ставка КАК Ставка
		|ПОМЕСТИТЬ Портфель
		|ИЗ
		|	_Портфель КАК _Портфель
		|
		|СГРУППИРОВАТЬ ПО
		|	_Портфель.Рынок,
		|	_Портфель.ЦеннаяБумага,
		|	_Портфель.Содержимое,
		|	_Портфель.ГосударственныйРегистрационныйНомер,
		|	_Портфель.СодержимоеДляКонтроля,
		|	_Портфель.ДатаЗаключения,
		|	_Портфель.ДатаОкончания,
		|	_Портфель.Ставка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(Портфель.Стоимость, 0)) КАК Стоимость
		|ПОМЕСТИТЬ ИтогиПоПортфелю
		|ИЗ
		|	Портфель КАК Портфель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.СодержимоеДляКонтроля КАК Содержимое,
		|	Портфель.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _КонтрольПредставленийБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		Портфель.СодержимоеДляКонтроля КАК СодержимоеДляКонтроля
		|	ИЗ
		|		Портфель КАК Портфель
		|	ГДЕ
		|		Портфель.ЦеннаяБумага ЕСТЬ НЕ NULL 
		|		И ТИПЗНАЧЕНИЯ(Портфель.ЦеннаяБумага) = ТИП(Перечисление.РынкиЦенныхБумаг)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Портфель.СодержимоеДляКонтроля
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(1) > 1) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Портфель КАК Портфель
		|		ПО ВложенныйЗапрос.СодержимоеДляКонтроля = Портфель.СодержимоеДляКонтроля
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Портфель.Рынок КАК Рынок,
		|	Портфель.Содержимое КАК Содержимое,
		|	Портфель.Количество КАК Количество,
		|	ЕСТЬNULL(Портфель.Стоимость, 0) КАК СтоимостьВВалютеУчета,
		|	ВЫБОР
		|		КОГДА &ВалютаОтчета = &ВалютаУчета
		|			ТОГДА ЕСТЬNULL(Портфель.Стоимость, 0)
		|		ИНАЧЕ ЕСТЬNULL(Портфель.Стоимость, 0) / КурсыВалют.Курс * КурсыВалют.Кратность
		|	КОНЕЦ КАК Стоимость,
		|	ВЫБОР
		|		КОГДА ИтогиПоПортфелю.Стоимость = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(Портфель.Стоимость, 0) / ИтогиПоПортфелю.Стоимость
		|	КОНЕЦ КАК ПроцентСтоимости,
		|	Портфель.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	Портфель.ДатаЗаключения КАК ДатаЗаключения,
		|	Портфель.ДатаОкончания КАК ДатаОкончания,
		|	Портфель.Ставка КАК Ставка
		|ИЗ
		|	Портфель КАК Портфель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Валюта = &ВалютаОтчета)
		|			И (КурсыВалют.Период = &КонецПериода)
		|		ПОЛНОЕ СОЕДИНЕНИЕ ИтогиПоПортфелю КАК ИтогиПоПортфелю
		|		ПО (ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА Портфель.Рынок = ""Денежные средства""
		|			ТОГДА 1
		|		КОГДА Портфель.Рынок = ""Обязательства по сделке с валютой""
		|			ТОГДА 2
		|		КОГДА Портфель.Рынок ПОДОБНО ""Денежные средства%""
		|			ТОГДА 3
		|		КОГДА Портфель.Рынок ПОДОБНО ""% в РЕПО""
		|			ТОГДА 5
		|		КОГДА Портфель.Рынок ПОДОБНО ""Обязательства по исполнению второй части РЕПО%""
		|			ТОГДА 6
		|		ИНАЧЕ 4
		|	КОНЕЦ,
		|	Портфель.Рынок,
		|	Портфель.ЦеннаяБумага.Наименование
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(СтоимостьВВалютеУчета),
		|	СУММА(Стоимость),
		|	СУММА(ПроцентСтоимости)
		|ПО
		|	ОБЩИЕ,
		|	Рынок";
		
	#КонецОбласти

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЭтотОбъект.РассчитыватьСЧАБезПослаблений Тогда
		ЗаменитьИсточникиДляСЧАБезПослаблений(ПараметрыРасчетаДоходности, Отказ);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("НачалоПериода",					ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",					НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериодаКонецДняГраница",	Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая)); 
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации",			ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВалютаУчета",					ВалютаУчета);
	Запрос.УстановитьПараметр("ВалютаОтчета",					?(ЗначениеЗаполнено(ЭтотОбъект.ВалютаОтчета), ЭтотОбъект.ВалютаОтчета, ВалютаУчета));
	Запрос.УстановитьПараметр("НеУчитыватьЦБКупленныеПоРЕПО",	ЭтотОбъект.НеУчитыватьЦБСделкиРЕПО);
	Запрос.УстановитьПараметр("ПолноеНаименованиеКлиента", 		НаименованияКлиента.ПолноеНаименование);
	Запрос.УстановитьПараметр("ДепозитыРазвернуто", 			ЭтотОбъект.ВыводитьДепозитыРазвернуто);
	
	Если ПараметрыРасчетаДоходности.Свойство("СписокАктивовДляИсключенияИзРасчетаДоходности") Тогда
		Запрос.УстановитьПараметр("СписокАктивовДляИсключенияИзРасчетаДоходности", ПараметрыРасчетаДоходности.СписокАктивовДляИсключенияИзРасчетаДоходности);
	Иначе     
		Запрос.УстановитьПараметр("СписокАктивовДляИсключенияИзРасчетаДоходности", Справочники.Облигации.ПустаяСсылка());	
	КонецЕсли;
	// Получаем данные
	
	РезультатЗапроса = Запрос.Выполнить();
	
#Область _КонтрольПредставленийБумаг
	
	КонтрольПредставленийБумаг = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КонтрольПредставленийБумаг").ПолучитьДанные().Выгрузить();
	КонтрольПредставленийБумаг.Сортировать("Содержимое");
	
	Для Каждого СтрокаКонтроля Из КонтрольПредставленийБумаг Цикл
		ЗарегистрироватьОшибку(СтрШаблон("Дублирование представления бумаги %1, Представление: %2", СтрокаКонтроля.ЦеннаяБумага, СтрокаКонтроля.Содержимое), МассивОшибок, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
		
	КонецЕсли;
	
#КонецОбласти	
	
	ПараметрыДоговора					= ПолучитьВременнуюТаблицуИзЗапроса(Запрос, "КлиентыДУ"							, Отказ).Выгрузить();
	РеквизитыОрганизации				= ПолучитьВременнуюТаблицуИзЗапроса(Запрос, "РеквизитыОрганизации"				, Отказ).Выгрузить();
	РеквизитыКлиента					= ПолучитьВременнуюТаблицуИзЗапроса(Запрос, "РеквизитыКлиента"					, Отказ).Выгрузить();
	КурсВалютыОтчета					= ПолучитьВременнуюТаблицуИзЗапроса(Запрос, "КурсВалютыОтчета"					, Отказ).Выгрузить();
	
	Если ПараметрыДоговора.Количество() > 0 Тогда
		ПараметрыДоговора = ПараметрыДоговора[0];
	Иначе
		
		ЗарегистрироватьОшибку(СтрШаблон("Ошибка получения данных по договору '%1'", ЭтотОбъект.СчетДоверительногоУправления), МассивОшибок, Отказ);
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
		
	КонецЕсли;
	
	Портфель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Заполняем настройки печати	
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), Ложь);
	
	// Формируем отчет
	
	МакетОтчета		= ПолучитьМакет("Макет" + ЭтотОбъект.КлючТекущегоВарианта);
	ПараметрыШапки	= Новый Структура;

	// Заголовок
	
	ПараметрыШапки.Вставить("Организация",			?(РеквизитыОрганизации.Количество() > 0 И ЗначениеЗаполнено(РеквизитыОрганизации[0].КраткоеНаименованиеПоУставу), РеквизитыОрганизации[0].КраткоеНаименованиеПоУставу, ЭтотОбъект.Организация));
	ПараметрыШапки.Вставить("НачалоПериода",		Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
	ПараметрыШапки.Вставить("КонецПериода",			Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	ПараметрыШапки.Вставить("ВалютаУчета",			ВалютаУчета);
	ПараметрыШапки.Вставить("ВалютаОтчета",			ЭтотОбъект.ВалютаОтчета);
	
	// Клиент
	
	ПараметрыШапки.Вставить("Клиент", ?(РеквизитыКлиента.Количество()>0 И ЗначениеЗаполнено(РеквизитыКлиента[0].ПолноеНаименованиеКлиента), РеквизитыКлиента[0].ПолноеНаименованиеКлиента, ЭтотОбъект.СчетДоверительногоУправления));
	ПараметрыШапки.Вставить("ДоговорКлиента", ПараметрыДоговора.НомерДоговора);
	ПараметрыШапки.Вставить("Стратегия", ПараметрыДоговора.Стратегия);	
	
	// Стоимости портфеля
	
	ПараметрыШапки.Вставить("ДнейВПериоде", Цел((ЭтотОбъект.Период.ДатаОкончания - ЭтотОбъект.Период.ДатаНачала) / 86400) + 1); // 86400 - количество секунд в сутках;
	
#Область РасчетДоходности
	ДеталиРасчета = Новый Структура;
	
	ПараметрыРасчетаДоходности.Вставить("ДатаНачала",		Дата(1,1,1));
	ДеталиРасчета.Вставить("СНачалаУправленияВВалютеУчета", Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьУправления(ПараметрыРасчетаДоходности, Отказ));

	ПараметрыРасчетаДоходности.Вставить("ДатаНачала",		ЭтотОбъект.Период.ДатаНачала);
	ДеталиРасчета.Вставить("ЗаПериодВВалютеУчета", Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьУправления(ПараметрыРасчетаДоходности, Отказ));
	
	Если ОтчетВВалюте Тогда
		ПараметрыРасчетаДоходности.Вставить("ВалютаРасчета",	ЭтотОбъект.ВалютаОтчета);
		
		ПараметрыРасчетаДоходности.Вставить("ДатаНачала",		Дата(1,1,1));
		ДеталиРасчета.Вставить("СНачалаУправления", Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьУправления(ПараметрыРасчетаДоходности, Отказ));

		ПараметрыРасчетаДоходности.Вставить("ДатаНачала",		ЭтотОбъект.Период.ДатаНачала);
		ДеталиРасчета.Вставить("ЗаПериод", Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьУправления(ПараметрыРасчетаДоходности, Отказ));
		
	Иначе	
		ДеталиРасчета.Вставить("СНачалаУправления",	ДеталиРасчета.СНачалаУправленияВВалютеУчета);
		ДеталиРасчета.Вставить("ЗаПериод",			ДеталиРасчета.ЗаПериодВВалютеУчета);
	КонецЕсли;
	
	Если Отказ ИЛИ ДеталиРасчета.СНачалаУправления.Количество() = 0 Тогда
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
		
	КонецЕсли;	
	
	ПараметрыШапки.Вставить("СуммаНаНачало", 				Формат(ДеталиРасчета.ЗаПериод.СтоимостьАктивовНаНачало + ДеталиРасчета.ЗаПериод.ЗадолженностьПоНДФЛНаНачало, "ЧДЦ=2; ЧН="));
	ПараметрыШапки.Вставить("СуммаНаНачалоВВалютеУчета",	Формат(ДеталиРасчета.ЗаПериодВВалютеУчета.СтоимостьАктивовНаНачало + ДеталиРасчета.ЗаПериодВВалютеУчета.ЗадолженностьПоНДФЛНаНачало, "ЧДЦ=2; ЧН="));
	
	ПараметрыШапки.Вставить("СуммаНаКонец", 			Формат(ДеталиРасчета.ЗаПериод.СтоимостьАктивовНаКонец + ДеталиРасчета.ЗаПериод.ЗадолженностьПоНДФЛНаКонец, "ЧДЦ=2; ЧН="));
	ПараметрыШапки.Вставить("СуммаНаКонецВВалютеУчета", Формат(ДеталиРасчета.ЗаПериодВВалютеУчета.СтоимостьАктивовНаКонец + ДеталиРасчета.ЗаПериодВВалютеУчета.ЗадолженностьПоНДФЛНаКонец, "ЧДЦ=2; ЧН="));
	
	ПараметрыШапки.Вставить("СуммаИнвестирования", 				Формат(ДеталиРасчета.СНачалаУправления.СуммаОпераций, "ЧДЦ=2; ЧН="));
	ПараметрыШапки.Вставить("СуммаИнвестированияВВалютеУчета",	Формат(ДеталиРасчета.СНачалаУправленияВВалютеУчета.СуммаОпераций, "ЧДЦ=2; ЧН="));
	
	ПараметрыШапки.Вставить("СуммаВводов",				Формат(ДеталиРасчета.СНачалаУправления.СуммаВводов, "ЧДЦ=2; ЧН="));
	ПараметрыШапки.Вставить("СуммаВводовВВалютеУчета",	Формат(ДеталиРасчета.СНачалаУправленияВВалютеУчета.СуммаВводов, "ЧДЦ=2; ЧН="));
	
	ПараметрыШапки.Вставить("СуммаВыводов",				Формат(ДеталиРасчета.СНачалаУправления.СуммаВыводов, "ЧДЦ=2; ЧН="));
	ПараметрыШапки.Вставить("СуммаВыводовВВалютеУчета", Формат(ДеталиРасчета.СНачалаУправленияВВалютеУчета.СуммаВыводов, "ЧДЦ=2; ЧН="));

	ПараметрыШапки.Вставить("СуммаВводовЗаПериод",				Формат(ДеталиРасчета.ЗаПериод.СуммаВводов, "ЧДЦ=2; ЧН="));
	ПараметрыШапки.Вставить("СуммаВводовВВалютеУчетаЗаПериод",	Формат(ДеталиРасчета.ЗаПериодВВалютеУчета.СуммаВводов, "ЧДЦ=2; ЧН="));
	
	ПараметрыШапки.Вставить("СуммаВыводовЗаПериод",				Формат(ДеталиРасчета.ЗаПериод.СуммаВыводов, "ЧДЦ=2; ЧН="));
	ПараметрыШапки.Вставить("СуммаВыводовВВалютеУчетаЗаПериод", Формат(ДеталиРасчета.ЗаПериодВВалютеУчета.СуммаВыводов, "ЧДЦ=2; ЧН="));
	
	ПараметрыШапки.Вставить("ЗадолженностьПоНДФЛНеучтеннаяВСЧАНаНачалоПериода",				ДеталиРасчета.ЗаПериод.ЗадолженностьПоНДФЛНаНачало);	
	ПараметрыШапки.Вставить("ЗадолженностьПоНДФЛНеучтеннаяВСЧАНаКонецПериода",				ДеталиРасчета.ЗаПериод.ЗадолженностьПоНДФЛНаКонец);	
	ПараметрыШапки.Вставить("ЗадолженностьПоНДФЛНеучтеннаяВСЧАНаНачалоПериодаВВалютеУчета",	ДеталиРасчета.ЗаПериодВВалютеУчета.ЗадолженностьПоНДФЛНаНачало);	
	ПараметрыШапки.Вставить("ЗадолженностьПоНДФЛНеучтеннаяВСЧАНаКонецПериодаВВалютеУчета",	ДеталиРасчета.ЗаПериодВВалютеУчета.ЗадолженностьПоНДФЛНаКонец);	
	
	
	// Результаты инвестирования
	
	РезультатыИнвестирования = Новый Структура("ФинансовыйРезультат, ФинансовыйРезультатЗаПериод, Доходность, ЭффективнаяДоходность, ДоходностьЗаПериод, ЭффективнаяДоходностьЗаПериод, ФинансовыйРезультатВВалютеУчета, ФинансовыйРезультатЗаПериодВВалютеУчета, ДоходностьВВалютеУчета, ДоходностьЗаПериодВВалютеУчета, ЭффективнаяДоходностьЗаПериодВВалютеУчета");
	РезультатыИнвестирования.Вставить("ФинансовыйРезультат",						Формат(ДеталиРасчета.СНачалаУправления.ФинансовыйРезультат, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ФинансовыйРезультатВВалютеУчета",			Формат(ДеталиРасчета.СНачалаУправленияВВалютеУчета.ФинансовыйРезультат, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ФинансовыйРезультатЗаПериод",				Формат(ДеталиРасчета.ЗаПериод.ФинансовыйРезультат, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ФинансовыйРезультатЗаПериодВВалютеУчета",	Формат(ДеталиРасчета.ЗаПериодВВалютеУчета.ФинансовыйРезультат, "ЧДЦ=2; ЧН=")); 
	
	РезультатыИнвестирования.Вставить("Доходность",						Формат(ДеталиРасчета.СНачалаУправления.Доходность, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ДоходностьВВалютеУчета",			Формат(ДеталиРасчета.СНачалаУправленияВВалютеУчета.Доходность, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ДоходностьЗаПериод",				Формат(ДеталиРасчета.ЗаПериод.Доходность, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ДоходностьЗаПериодВВалютеУчета",	Формат(ДеталиРасчета.ЗаПериодВВалютеУчета.Доходность, "ЧДЦ=2; ЧН=")); 
	
	РезультатыИнвестирования.Вставить("ЭффективнаяДоходность",						Формат(ДеталиРасчета.СНачалаУправления.ЭффективнаяДоходность, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ЭффективнаяДоходностьВВалютеУчета",			Формат(ДеталиРасчета.СНачалаУправленияВВалютеУчета.ЭффективнаяДоходность, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ЭффективнаяДоходностьЗаПериод",				Формат(ДеталиРасчета.ЗаПериод.ЭффективнаяДоходность, "ЧДЦ=2; ЧН=")); 
	РезультатыИнвестирования.Вставить("ЭффективнаяДоходностьЗаПериодВВалютеУчета",	Формат(ДеталиРасчета.ЗаПериодВВалютеУчета.ЭффективнаяДоходность, "ЧДЦ=2; ЧН=")); 
	
#КонецОбласти	

	Если КурсВалютыОтчета.Количество() Тогда
		ПараметрыШапки.Вставить("КурсНаДатуОтчета", КурсВалютыОтчета[0].Значение);
	КонецЕсли;
	
	// Проверка, что зарегистрированный СЧА и сумма портфеля совпадают
	
	Если Портфель.Следующий() 
	   И ДеталиРасчета.ЗаПериодВВалютеУчета.СтоимостьАктивовНаКонец + ДеталиРасчета.ЗаПериодВВалютеУчета.ЗадолженностьПоНДФЛНаКонец <> Портфель.СтоимостьВВалютеУчета Тогда
	   
		ЗарегистрироватьОшибку("ОШИБКА: зарегистрированное на " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ='dd.MM.yyyy'' г.'''") + " значение показателя ""Стоимость чистых активов (рынок)"" (" + Строка(ДеталиРасчета.ЗаПериод.СтоимостьАктивовНаКонец + ДеталиРасчета.ЗаПериод.ЗадолженностьПоНДФЛНаКонец) + ") отличается от расчетной стоимости портфеля (" + Строка(Портфель.СтоимостьВВалютеУчета) + ")!", МассивОшибок, Отказ);
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
		
	КонецЕсли;	
	Портфель.Сбросить();	
	
	Если МассивОшибок.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивОшибок, Символы.ПС),,,, Отказ);
	КонецЕсли;
	
	Если ПараметрыРасчетаДоходности.МассивОшибок.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(ПараметрыРасчетаДоходности.МассивОшибок, Символы.ПС),,,, Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	// Шапка		
	ОбластьШапка_Шапка = МакетОтчета.ПолучитьОбласть("Шапка_Шапка"+ПостфиксОбласти);
	ОбластьШапка_Шапка.Параметры.Заполнить(ПараметрыШапки);
	Если ЭтотОбъект.КлючТекущегоВарианта <> "СДиаграммой" И Логотип <> Неопределено Тогда
		ОбластьШапка_Шапка.Рисунки["Логотип" + ПостфиксОбласти].Картинка = Новый Картинка(Логотип, Истина);
	КонецЕсли;
	ДокументРезультат.Вывести(ОбластьШапка_Шапка);
	
	Если ЗначениеЗаполнено(ПараметрыШапки.Стратегия) Тогда
		ОбластьШапка_Стратегия = МакетОтчета.ПолучитьОбласть("Шапка_Стратегия" + ПостфиксОбласти);
		ОбластьШапка_Стратегия.Параметры.Заполнить(ПараметрыШапки);	
		ДокументРезультат.Вывести(ОбластьШапка_Стратегия);
	КонецЕсли;
	
	// Отчетный период
	
	ОбластьШапка_ОтчетныйПериод = МакетОтчета.ПолучитьОбласть("Шапка_ОтчетныйПериод" + ПостфиксОбласти);
	ОбластьШапка_ОтчетныйПериод.Параметры.Заполнить(ПараметрыШапки);
	ДокументРезультат.Вывести(ОбластьШапка_ОтчетныйПериод);
	
	// Сумма инвестирования
	
	Если ЭтотОбъект.СНачалаУправления Тогда
		ОбластьШапка_ВводыВыводыСНачалаИнвестирования = МакетОтчета.ПолучитьОбласть("Шапка_ВводыВыводыСНачалаИнвестирования" + ПостфиксОбласти);
		ОбластьШапка_ВводыВыводыСНачалаИнвестирования.Параметры.Заполнить(ПараметрыШапки);	
		ДокументРезультат.Вывести(ОбластьШапка_ВводыВыводыСНачалаИнвестирования);
	КонецЕсли;
	
	// Стоимость портфеля
	Если ПараметрыДоговора.ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет
	 ИЛИ ПараметрыДоговора.ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица Тогда
	    ОбластьШапка_СтоимостьПортфеля = МакетОтчета.ПолучитьОбласть("Шапка_СтоимостьПортфеля_ФЛ" + ПостфиксОбласти);	
	Иначе
		ОбластьШапка_СтоимостьПортфеля = МакетОтчета.ПолучитьОбласть("Шапка_СтоимостьПортфеля" + ПостфиксОбласти);	
	КонецЕсли;
	
	ОбластьШапка_СтоимостьПортфеля.Параметры.Заполнить(ПараметрыШапки);
	ДокументРезультат.Вывести(ОбластьШапка_СтоимостьПортфеля);
	
	ОбластьРезультатыИнвестирования_Шапка = МакетОтчета.ПолучитьОбласть("РезультатыИнвестирования_Шапка"+ПостфиксОбласти);
	ОбластьРезультатыИнвестирования_Шапка.Параметры.Заполнить(ПараметрыШапки);	
	ДокументРезультат.Вывести(ОбластьРезультатыИнвестирования_Шапка);
	
	Если ЭтотОбъект.СНачалаУправления Тогда
		ОбластьРезультатыИнвестирования_СНачала = МакетОтчета.ПолучитьОбласть("РезультатыИнвестирования_СНачала" + ПостфиксОбласти);
		ОбластьРезультатыИнвестирования_СНачала.Параметры.Заполнить(РезультатыИнвестирования);
		ДокументРезультат.Вывести(ОбластьРезультатыИнвестирования_СНачала);
	КонецЕсли;
		
	ОбластьРезультатыИнвестирования_ЗаПериод = МакетОтчета.ПолучитьОбласть("РезультатыИнвестирования_ЗаПериод" + ПостфиксОбласти);
	ОбластьРезультатыИнвестирования_ЗаПериод.Параметры.Заполнить(РезультатыИнвестирования);
	ДокументРезультат.Вывести(ОбластьРезультатыИнвестирования_ЗаПериод);
	
	// Портфель
	
	ОбластьШапкаПортфеля = МакетОтчета.ПолучитьОбласть("ШапкаПортфеля" + ПостфиксОбласти + "|Основная" + ПостфиксОбласти);
	ОбластьШапкаПортфеля.Параметры.Заполнить(ПараметрыШапки);
	ДокументРезультат.Вывести(ОбластьШапкаПортфеля);         
	Если ЭтотОбъект.ВыводитьДепозитыРазвернуто Тогда
		ОбластьШапкаПортфеляДоп = МакетОтчета.ПолучитьОбласть("ШапкаПортфеля" + ПостфиксОбласти + "|Дополнительная");
		ДокументРезультат.Присоединить(ОбластьШапкаПортфеляДоп);
	КонецЕсли;
	
	// Диаграмма структуры портфеля
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "СДиаграммой" Тогда
		ОбластьДиаграммы = МакетОтчета.ПолучитьОбласть("ДиаграммаПортфеля");
		
		Диаграмма = ОбластьДиаграммы.Рисунки[0].Объект;
	    Диаграмма.Обновление = Ложь;
	    Диаграмма.Очистить();
		
		Точка = Диаграмма.Точки.Добавить("");
		Пока Портфель.Следующий() Цикл 
			РынокПортфеля = Портфель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока РынокПортфеля.Следующий() Цикл 
				Серия = Диаграмма.Серии.Добавить(Строка(РынокПортфеля.Рынок)+"                                                     "); // Не смог по-другому избавиться от вывода серий в нескольких столбцах
				Диаграмма.УстановитьЗначение(Точка, Серия, РынокПортфеля.ПроцентСтоимости, , Строка(РынокПортфеля.Рынок));
			КонецЦикла;
		КонецЦикла;	
	    Диаграмма.Обновление = Истина;
		
		ДокументРезультат.Вывести(ОбластьДиаграммы);
	КонецЕсли;
	
	// Структура портфеля
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "СДиаграммой" Тогда
		ОбластьШапкаПортфеля = МакетОтчета.ПолучитьОбласть("ШапкаСтруктурыПортфеля" + ПостфиксОбласти);
		ОбластьШапкаПортфеля.Параметры.Заполнить(ПараметрыШапки);
		ДокументРезультат.Вывести(ОбластьШапкаПортфеля);	
	КонецЕсли;
	
	Портфель.Сбросить();	
	Пока Портфель.Следующий() Цикл 
		РынокПортфеля = Портфель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока РынокПортфеля.Следующий() Цикл 
			ОбластьРынок = МакетОтчета.ПолучитьОбласть("РынокПортфеля" + ПостфиксОбласти + "|Основная" + ПостфиксОбласти);
			ОбластьРынок.Параметры.Заполнить(РынокПортфеля);
			
			ДокументРезультат.Вывести(ОбластьРынок);
			
			Если ЭтотОбъект.ВыводитьДепозитыРазвернуто Тогда
				ОбластьРынокДоп = МакетОтчета.ПолучитьОбласть("РынокПортфеля" + ПостфиксОбласти + "|Дополнительная");
				ДокументРезультат.Присоединить(ОбластьРынокДоп);
			КонецЕсли;
			
			// Денежные средства не расшифровываем
			// "Свободные денежные средства" переименованы в "Денежные средтва". Условие <> добавил, чтобы строка расшифровывалась
			Если (СтрНачинаетсяС(РынокПортфеля.Рынок, "Денежные средства") И РынокПортфеля.Рынок <> "Денежные средства")
				ИЛИ СтрНачинаетсяС(РынокПортфеля.Рынок, "Обязательства по исполнению второй части РЕПО")
			Тогда
				Продолжить;		
			КонецЕсли;
			
			// ЦБ портфеля
			СодержимоеПортфеля = РынокПортфеля.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			Пока СодержимоеПортфеля.Следующий() Цикл 
				ОбластьСтрокаПортфеля = МакетОтчета.ПолучитьОбласть("СтрокаПортфеля" + ПостфиксОбласти + "|Основная" + ПостфиксОбласти);
				ОбластьСтрокаПортфеля.Параметры.Заполнить(СодержимоеПортфеля);
				
				ДокументРезультат.Вывести(ОбластьСтрокаПортфеля);  
				
				Если ЭтотОбъект.ВыводитьДепозитыРазвернуто Тогда
					ОбластьСтрокаПортфеляДоп = МакетОтчета.ПолучитьОбласть("СтрокаПортфеля" + ПостфиксОбласти + "|Дополнительная"); 
					ОбластьСтрокаПортфеляДоп.Параметры.Заполнить(СодержимоеПортфеля);
					ДокументРезультат.Присоединить(ОбластьСтрокаПортфеляДоп);
				КонецЕсли;
				
			КонецЦикла;		
		КонецЦикла;
		
		// Итоги портфеля
		ОбластьИтогиПортфеля = МакетОтчета.ПолучитьОбласть("ИтогиПортфеля" + ПостфиксОбласти + "|Основная" + ПостфиксОбласти);
		ОбластьИтогиПортфеля.Параметры.Заполнить(Портфель);
		
		ДокументРезультат.Вывести(ОбластьИтогиПортфеля);
		Если ЭтотОбъект.ВыводитьДепозитыРазвернуто Тогда
			ОбластьИтогиПортфеляДоп = МакетОтчета.ПолучитьОбласть("ИтогиПортфеля" + ПостфиксОбласти + "|Дополнительная");
			ДокументРезультат.Присоединить(ОбластьИтогиПортфеляДоп);
		КонецЕсли;
		
	КонецЦикла;
	
	// Подвал
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "СДиаграммой" Тогда
		ОбластьПодвал		= МакетОтчета.ПолучитьОбласть("Подвал" + ПостфиксОбласти);
		ОбластьНаполнитель	= МакетОтчета.ПолучитьОбласть("ПустаяСтрока");
		
		Если ЭтотОбъект.КлючТекущегоВарианта = "СДиаграммой" Тогда
			
			Если Логотип <> Неопределено Тогда
				ОбластьПодвал.Рисунки["Логотип" + ПостфиксОбласти].Картинка = Новый Картинка(Логотип, Истина);
			КонецЕсли;
					
			ОбластьПодвал.Параметры.КонтактнаяИнформация = ?(Организация = Организация_РЭМ, КонтактнаяИнФормацияУК(), ""); 
				
		КонецЕсли;
		
		// Если подвал сразу не умещается, то печатаем его на новой странице
		Если Не ДокументРезультат.ПроверитьВывод(ОбластьПодвал) Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();				
		КонецЕсли;		
		
		// Подвал опускаем вниз страницы
		Если ДокументРезультат.ПроверитьВывод(ОбластьПодвал) Тогда	
			МассивОбластей = Новый Массив;
			МассивОбластей.Добавить(ОбластьНаполнитель);
			МассивОбластей.Добавить(ОбластьПодвал);
			
			Пока ДокументРезультат.ПроверитьВывод(МассивОбластей) Цикл
				ДокументРезультат.Вывести(ОбластьНаполнитель);		
			КонецЦикла;
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьПодвал);
	КонецЕсли;
	
	Если ЭтотОбъект.ИсключитьАктивыИзРасчетаДоходности И ЭтотОбъект.СписокАктивовДляИсключенияИзРасчетаДоходности.Количество() > 0 Тогда
		ДокументРезультат.Вывести(МакетОтчета.ПолучитьОбласть("ШапкаИсключеныЦенныеБумаги"));
		Для Каждого АктивДляИсключенияИзРасчетаДоходности Из ЭтотОбъект.СписокАктивовДляИсключенияИзРасчетаДоходности Цикл
			Область_СтрокаИсключеныЦенныеБумаги = МакетОтчета.ПолучитьОбласть("СтрокаИсключеныЦенныеБумаги");
			Область_СтрокаИсключеныЦенныеБумаги.Параметры.Заполнить(АктивДляИсключенияИзРасчетаДоходности);
			ДокументРезультат.Вывести(Область_СтрокаИсключеныЦенныеБумаги);
		КонецЦикла;
	КонецЕсли;
		
	//Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры
		
Функция ПолучитьВременнуюТаблицуИзЗапроса(Запрос, ИмяВременнойТаблицы, Отказ)

	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицы) <> Неопределено Тогда
		Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицы).ПолучитьДанные();
	Иначе
		ЗарегистрироватьОшибку("В запросе не обнаружена временная таблица: " + ИмяВременнойТаблицы, МассивОшибок, Отказ);
	
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;

КонецФункции

Функция ПолучитьДатуПервогоВводаПоСчетуДУ(ВхОрганизация, ВхСчетДоверительногоУправления, ВхПериодОтчета) Экспорт
	
	Перем ДатаПервогоВвода;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НАЧАЛОПЕРИОДА(ВводыВыводы.Период, ДЕНЬ) КАК НачалоПериода
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводы
		|ГДЕ
		|	ВводыВыводы.Организация = &Организация
		|	И ВводыВыводы.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВводыВыводы.Период";
	
	Запрос.УстановитьПараметр("Организация", ВхОрганизация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ВхСчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ДатаПервогоВвода = РезультатЗапроса.Выгрузить()[0].НачалоПериода;
	КонецЕсли;
	
	Если ДатаПервогоВвода = Неопределено и ВхСчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица и 
		ВхСчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет тогда
		ДатаПервогоВвода = НачалоГода(ВхПериодОтчета.ДатаНачала);
	КонецЕсли;
	
	Возврат ДатаПервогоВвода;
	
КонецФункции

Процедура ЗаменитьИсточникиДляСЧАБезПослаблений(ПараметрыРасчетаДоходности, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыРасчетаДоходности.Вставить("Показатель", "Даты СЧА");
	
	Документы.РегистрацияСтоимостиАктивов.ЗаполнитьДатыСЧАДляРасчетаДоходности(Запрос, ПараметрыРасчетаДоходности, Отказ);
	
	ПараметрыРасчетаДоходности.Удалить("Показатель");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыСЧА.Организация КАК Организация,
		|	ДатыСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДатыСЧА.ДатаСЧА КАК ДатаСЧА,
		|	ДатаНачалаРасчетаПоПисьмуЦБ0185316.Значение ЕСТЬ НЕ NULL 
		|		И ДатаНачалаРасчетаПоПисьмуЦБ0185316.Значение <> ДАТАВРЕМЯ(1, 1, 1)
		|		И ДатаНачалаРасчетаПоПисьмуЦБ0185316.Значение <= ДатыСЧА.ДатаСЧА
		|		И (ДатаОкончанияРасчетаПоПисьмуЦБ0185316.Значение ЕСТЬ NULL
		|			ИЛИ ДатаОкончанияРасчетаПоПисьмуЦБ0185316.Значение = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДатаОкончанияРасчетаПоПисьмуЦБ0185316.Значение >= ДатыСЧА.ДатаСЧА) КАК ПересчитатьСЧА
		|ПОМЕСТИТЬ _ДатыСЧА
		|ИЗ
		|	(ВЫБРАТЬ
		|		&Организация КАК Организация,
		|		&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		&ДатаСЧАНачала КАК ДатаСЧА
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&Организация,
		|		&СчетДоверительногоУправления,
		|		&ДатаСЧАОкончания) КАК ДатыСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДатаНачалаРасчетаПоПисьмуЦБ0185316
		|		ПО ДатыСЧА.СчетДоверительногоУправления = ДатаНачалаРасчетаПоПисьмуЦБ0185316.Объект
		|			И (ДатаНачалаРасчетаПоПисьмуЦБ0185316.Свойство.Ключ = ""ДатаНачалаРасчетаПоПисьмуЦБ0185316"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДатаОкончанияРасчетаПоПисьмуЦБ0185316
		|		ПО ДатыСЧА.СчетДоверительногоУправления = ДатаОкончанияРасчетаПоПисьмуЦБ0185316.Объект
		|			И (ДатаОкончанияРасчетаПоПисьмуЦБ0185316.Свойство.Ключ = ""ДатаОкончанияРасчетаПоПисьмуЦБ0185316"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период КАК Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Регистратор КАК Регистратор,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.НомерСтроки КАК НомерСтроки,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность КАК Активность,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация КАК Организация,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент КАК Контрагент,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Основание,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынок КАК СуммаРынок,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.УровеньОценки КАК УровеньОценки
		|ПОМЕСТИТЬ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО _ДатыСЧА.Организация = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация
		|			И _ДатыСЧА.СчетДоверительногоУправления = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И _ДатыСЧА.ДатаСЧА = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период
		|			И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|			И (НЕ _ДатыСЧА.ПересчитатьСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинансовыеПоказатели.Период КАК Период,
		|	ФинансовыеПоказатели.Регистратор КАК Регистратор,
		|	ФинансовыеПоказатели.НомерСтроки КАК НомерСтроки,
		|	ФинансовыеПоказатели.Активность КАК Активность,
		|	ФинансовыеПоказатели.Организация КАК Организация,
		|	ФинансовыеПоказатели.СубъектАналитики КАК СубъектАналитики,
		|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
		|	ФинансовыеПоказатели.Значение КАК Значение
		|ПОМЕСТИТЬ _ФинансовыеПоказатели
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО _ДатыСЧА.Организация = ФинансовыеПоказатели.Организация
		|			И _ДатыСЧА.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
		|			И _ДатыСЧА.ДатаСЧА = ФинансовыеПоказатели.Период
		|			И (ФинансовыеПоказатели.Активность)
		|			И (НЕ _ДатыСЧА.ПересчитатьСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтоимостьПереоценки.Период КАК Период,
		|	СтоимостьПереоценки.Регистратор КАК Регистратор,
		|	СтоимостьПереоценки.НомерСтроки КАК НомерСтроки,
		|	СтоимостьПереоценки.Активность КАК Активность,
		|	СтоимостьПереоценки.Организация КАК Организация,
		|	СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьПереоценки.ЦельРасчета КАК ЦельРасчета,
		|	СтоимостьПереоценки.ВидЦеныОценки КАК ВидЦеныОценки,
		|	СтоимостьПереоценки.Рынок КАК Рынок,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.Партия КАК Партия,
		|	СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,
		|	СтоимостьПереоценки.ВидУчета КАК ВидУчета,
		|	СтоимостьПереоценки.Цена КАК Цена,
		|	СтоимостьПереоценки.Сумма КАК Сумма,
		|	СтоимостьПереоценки.ЦенаКупона КАК ЦенаКупона,
		|	СтоимостьПереоценки.Количество КАК Количество,
		|	СтоимостьПереоценки.СуммаКупона КАК СуммаКупона,
		|	СтоимостьПереоценки.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
		|	СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки,
		|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
		|	СтоимостьПереоценки.Источник КАК Источник,
		|	СтоимостьПереоценки.РучнойВвод КАК РучнойВвод,
		|	СтоимостьПереоценки.ЦенаКотировки КАК ЦенаКотировки,
		|	СтоимостьПереоценки.ВалютаКотировки КАК ВалютаКотировки,
		|	СтоимостьПереоценки.ЦенаКотировкиКупона КАК ЦенаКотировкиКупона,
		|	СтоимостьПереоценки.ВалютаКотировкиКупона КАК ВалютаКотировкиКупона,
		|	СтоимостьПереоценки.Примечание КАК Примечание,
		|	СтоимостьПереоценки.КурсВалютыНоминала КАК КурсВалютыНоминала,
		|	СтоимостьПереоценки.ДатаЦеныКупона КАК ДатаЦеныКупона
		|ПОМЕСТИТЬ _СтоимостьПереоценки
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ПО _ДатыСЧА.Организация = СтоимостьПереоценки.Организация
		|			И _ДатыСЧА.СчетДоверительногоУправления = СтоимостьПереоценки.СчетДоверительногоУправления
		|			И _ДатыСЧА.ДатаСЧА = СтоимостьПереоценки.Период
		|			И (НЕ _ДатыСЧА.ПересчитатьСЧА
		|				И СтоимостьПереоценки.Активность)";

	
	Запрос.Выполнить();
	
	Таблица_ДатыСЧА = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДатыСЧА").ПолучитьДанные().Выгрузить();
	
	ПараметрыПоиска = Новый Структура("ПересчитатьСЧА", Истина);
	НайденныеСтроки = Таблица_ДатыСЧА.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() Тогда
		
		Таблица_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам").ПолучитьДанные().Выгрузить();
		Таблица_ФинансовыеПоказатели = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ФинансовыеПоказатели").ПолучитьДанные().Выгрузить();
		Таблица_СтоимостьПереоценки = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СтоимостьПереоценки").ПолучитьДанные().Выгрузить();
		
		//Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ = ВнешниеОтчеты.Создать("\\ap69\Developers\Рома\Epf\_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.erf");
		Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ"); 
		Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.Организация					= ЭтотОбъект.Организация;
		Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;
		
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
			Если ЗначениеЗаполнено(СтрокаДанных.ДатаСЧА) Тогда
				Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.Период = СтрокаДанных.ДатаСЧА;
				
				Попытка
					РСА = Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.ПолучитьРегистрациюСтоимостиАктивовБезРасчетаПоПисьму(Ложь);
					
					Для Каждого СтрокаАктивы Из РСА.АктивыНеОтносящиесяКЦеннымБумагам Цикл
						НоваяСтрокаАктивы = Таблица_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаАктивы, РСА);
						ЗаполнитьЗначенияСвойств(НоваяСтрокаАктивы, СтрокаАктивы);
						НоваяСтрокаАктивы.Период		= СтрокаДанных.ДатаСЧА;
						НоваяСтрокаАктивы.Регистратор	= РСА.Ссылка;
						НоваяСтрокаАктивы.Активность	= Истина;
					КонецЦикла;
					
					СтрокаФинПоказатели = Таблица_ФинансовыеПоказатели.Добавить();
					СтрокаФинПоказатели.Активность		 = Истина;
					СтрокаФинПоказатели.Период			 = СтрокаДанных.ДатаСЧА;
					СтрокаФинПоказатели.Организация		 = РСА.Организация;
					СтрокаФинПоказатели.СубъектАналитики = РСА.СчетДоверительногоУправления;
					СтрокаФинПоказатели.ВидПоказателя	 = Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок;
					СтрокаФинПоказатели.Значение		 = РСА.СЧАРынок;
					
					СтрокаФинПоказатели = Таблица_ФинансовыеПоказатели.Добавить();
					СтрокаФинПоказатели.Активность		 = Истина;
					СтрокаФинПоказатели.Период			 = СтрокаДанных.ДатаСЧА;
					СтрокаФинПоказатели.Организация		 = РСА.Организация;
					СтрокаФинПоказатели.СубъектАналитики = РСА.СчетДоверительногоУправления;
					СтрокаФинПоказатели.ВидПоказателя	 = Справочники.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов;
					СтрокаФинПоказатели.Значение		 = РСА.РСА;
					
					СтоимостиПереоценки = РСА.ДополнительныеСвойства.РегистрацияСтоимости.СтоимостиПереоценки;
					
					Если РСА.ДополнительныеСвойства.Свойство("РегистрацияСтоимости") Тогда
						Для Каждого СтрокаПереоценки Из РСА.ДополнительныеСвойства.РегистрацияСтоимости.СтоимостиПереоценки Цикл
							
							НоваяСтрокаПереоценки = Таблица_СтоимостьПереоценки.Добавить();
							НоваяСтрокаПереоценки.Активность = Истина;
							
							ЗаполнитьЗначенияСвойств(НоваяСтрокаПереоценки, РСА.ДополнительныеСвойства.РегистрацияСтоимости);
							ЗаполнитьЗначенияСвойств(НоваяСтрокаПереоценки, СтрокаПереоценки);
							
							НоваяСтрокаПереоценки.Период		= СтрокаДанных.ДатаСЧА;
							НоваяСтрокаПереоценки.ВидЦеныОценки	= Перечисления.ВидыЦенОценки.ЦенаОценки;
					
					    КонецЦикла;
					КонецЕсли;
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыРасчетаДоходности.Вставить("СтоимостьАктивовНеОтносящихсяКЦеннымБумагам", Таблица_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам);
		ПараметрыРасчетаДоходности.Вставить("ФинансовыеПоказатели", Таблица_ФинансовыеПоказатели);
		ПараметрыРасчетаДоходности.Вставить("СтоимостьПереоценки", Таблица_СтоимостьПереоценки);
	
	КонецЕсли;
	
КонецПроцедуры

Функция КонтактнаяИнФормацияУК()
		
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименование,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮридическийАдрес КАК Адрес,
		|	СтатусыЛицензийСрезПоследних.Лицензия.Серия + СтатусыЛицензийСрезПоследних.Лицензия.Номер КАК НомерЛицензии,
		|	СтатусыЛицензийСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаВыдачиЛицензии,
		|	СтатусыЛицензийСрезПоследних.Лицензия.ОрганВыдавшийЛицензию КАК ЛицензияОрганВыдавшийЛицензию,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ВебСтраница КАК ВебСтраница,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма КАК ОрганизационноПравоваяФорма
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицоОрганизации
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(&Период, Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)) КАК СтатусыЛицензийСрезПоследних
		|		ПО РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = СтатусыЛицензийСрезПоследних.Лицензия.ЮрФизЛицо
		|			И (СтатусыЛицензийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует))");
			
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Период", 				Период.ДатаОкончания);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат СтрШаблон("Услуги по доверительному управлению ценными бумагами предоставляются %1%2 (%3).
			|Адрес: %4
			|Телефон: %5
			|Адрес сайта в сети Интернет: %6
			|Лицензия профессионального участника рынка ценных бумаг на осуществление деятельности по управлению ценными бумагами № %7, выданная ФСФР России %8%9.",
		    ПредставлениеОПФ(Выборка.ОрганизационноПравоваяФорма),
			НаименованиеБезОПФ(Выборка.ПолноеНаименование, Выборка.ОрганизационноПравоваяФорма),
			Выборка.КраткоеНаименование,
			Выборка.Адрес,
			Выборка.Телефоны,
			Выборка.ВебСтраница,
			Выборка.НомерЛицензии,
			Формат(Выборка.ДатаВыдачиЛицензии, "ДФ='dd MMMM yyyy ''года'''"),
		    ", без ограничения срока действия", "");
	КонецЕсли;	
	
	Возврат "";
		
КонецФункции

Функция ПредставлениеОПФ(ОрганизационноПравоваяФорма)
	
	Если ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.ОбществоСОграниченнойОтветственностью Тогда
		Возврат "Обществом с ограниченной ответственностью";
	ИначеЕсли ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.НепубличноеАкционерноеОбщество Тогда
	    Возврат "Акционерным обществом";
	Иначе 
		ВызватьИсключение "Не получено представление для ОПФ " + СокрЛП(ОрганизационноПравоваяФорма);
	КонецЕсли;	
	          	
КонецФункции

Функция НаименованиеБезОПФ(ПолноеНаименование, ОрганизационноПравоваяФорма)
	
	Возврат СтрЗаменить(ПолноеНаименование, 
						?(ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.НепубличноеАкционерноеОбщество,
				        		"Акционерное общество",
								СокрЛП(ОрганизационноПравоваяФорма)),
					 	"");
	
КонецФункции

#Область РаботаСОшибками

Процедура ЗарегистрироватьОшибку(ТекстОшибки, ВходящийМассивОшибок, Отказ)
	
	Если ОтчетФормируетсяАвтоматически = Истина Тогда
		Если ВходящийМассивОшибок.Найти(ТекстОшибки) = Неопределено Тогда
			ВходящийМассивОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
		Отказ = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

МассивОшибок = Новый Массив;
