
&НаСервереБезКонтекста
Функция ПолучитьКлиентаДоверительногоУправления(Период, СчетДоверительногоУправления)
	
	Возврат Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период);
	
КонецФункции // ПолучитьЮрФизЛицоКлиентаДоверительногоУправления

&НаСервереБезКонтекста
Функция ПолучитьКлючОсновногоРегистратор(Период, СчетДоверительногоУправления)
	
	Возврат Формат(Период, "ДФ=ггггММдд") + "/" + СчетДоверительногоУправления.КодСчета;
	
КонецФункции // ПолучитьКлючОсновногоРегистратор

&НаСервереБезКонтекста
Функция ПолучитьОсновнойРегистратор(Период, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КодыВоВнешнихСистемах.Объект
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах КАК КодыВоВнешнихСистемах
		|ГДЕ
		|	КодыВоВнешнихСистемах.Период = ДАТАВРЕМЯ(1980, 1, 1)
		|	И КодыВоВнешнихСистемах.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Фенси)
		|	И КодыВоВнешнихСистемах.ГруппаОбъектов = &ГруппаОбъектов
		|	И КодыВоВнешнихСистемах.Код = &Код
		|	И КодыВоВнешнихСистемах.Объект.ПометкаУдаления = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("ГруппаОбъектов", Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Ручные вводы денежных средств", Истина, Ложь));
	Запрос.УстановитьПараметр("Код",            ПолучитьКлючОсновногоРегистратор(Период, СчетДоверительногоУправления));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект;
	КонецЕсли;
	
	Возврат Документы.КорректировкаРегистров.ПустаяСсылка();
	
КонецФункции // ПолучитьОсновнойРегистратор

&НаСервереБезКонтекста
Функция ЕстьПрочиеРегистраторы(Период, СчетДоверительногоУправления, Организация, ОсновнойРегистратор)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.Регистратор <> &ОсновнойРегистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОстаткиПрочихАктивов.Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиПрочихАктивов КАК ОстаткиПрочихАктивов
		|ГДЕ
		|	ОстаткиПрочихАктивов.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ОстаткиПрочихАктивов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиПрочихАктивов.Организация = &Организация
		|	И ОстаткиПрочихАктивов.Регистратор <> &ОсновнойРегистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДенежныеСредстваВКредитныхИнструментах.Регистратор
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
		|ГДЕ
		|	ДенежныеСредстваВКредитныхИнструментах.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ДенежныеСредстваВКредитныхИнструментах.Организация = &Организация
		|	И ДенежныеСредстваВКредитныхИнструментах.Регистратор <> &ОсновнойРегистратор
		|	И ДенежныеСредстваВКредитныхИнструментах.ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)";
		
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",                  Организация);
	//Запрос.УстановитьПараметр("ОсновнойРегистратор",          ОсновнойРегистратор);
		
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ПроверитьНаличиеПрочихРегистраторов

&НаКлиенте
Процедура ПроверитьДатуЗапретаРедактирования()
		
	Если НЕ ПроверитьДатыЗапретаРедактированияНаСервере() Тогда 		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя импортировать остатки - редактирование запрещено (см. дату запрета редактирования)");
		ЭтаФорма.Элементы.ФормаКомандаСохранить.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ФормаКомандаСохранить.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьДатыЗапретаРедактированияНаСервере()
	
	ГруппыЗапретаРедактирования = Новый Массив();
	ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.Партии);	
	ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.БэкОфис);
	ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.Проводки);            
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования) КАК ДатаЗапретаРедактирования
		|ИЗ
		|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|ГДЕ
		|	ДатыЗапретаРедактирования.Организация = &Организация
		|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ДатыЗапретаРедактирования.ГруппаЗапрета В(&ГруппаЗапрета)
		|	И ДатыЗапретаРедактирования.ВидУчета = &ВидУчета
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования) >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)";

	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("ГруппаЗапрета",                ГруппыЗапретаРедактирования);
	Запрос.УстановитьПараметр("ВидУчета",                	  Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);   
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь; 
	Иначе
		Возврат Истина;
	КонецЕсли;   
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОстаткиДенежныхСредствНаСервере(ФиксироватьСтатистику = Истина)
	
	Если ФиксироватьСтатистику Тогда
		
		ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтаФорма, "Период, Организация, СчетДоверительногоУправления, ПредПериод, ПредСчетДоверительногоУправления"); 
		Механизм			= "_ВводОстатковАктивовСтраховыхКомпаний.Форма.ЗаполнитьОстаткиДенежныхСредствНаСервере()";
		Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
		
	КонецЕсли;
	
	ДополнительноеСвойствоКассы = ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "ПрочиеАктивы.Кассы.Собственник");
	
	Если Не ЗначениеЗаполнено(ДополнительноеСвойствоКассы) Тогда
		Сообщить("Не найдено дополнительное свойство прочего актива по ключу 'ПрочиеАктивы.Кассы.Собственник'");
	КонецЕсли;
	
	ЭтаФорма.ОстаткиДенежныхСредств.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеАктивы.ВидАктива КАК ВидАктива,
		|	ДенежныеАктивы.Актив КАК Актив,
		|	ДенежныеАктивы.Валюта КАК Валюта,
		|	ДенежныеАктивы.МестоХранения КАК МестоХранения,
		|	ДенежныеАктивы.ВходящийОстаток КАК ВходящийОстаток,
		|	ДенежныеАктивы.Сумма КАК Сумма,
		|	ДенежныеАктивы.ИсходящийОстаток КАК ИсходящийОстаток,
		|	ДенежныеАктивы.Сумма КАК ИсходнаяСумма,
		|	ДенежныеАктивы.Основание КАК Основание,
		|	ДенежныеАктивы.Основание КАК ИсходноеОснование
		|ИЗ
		|	(ВЫБРАТЬ
		|		""Расчетные счета, "" + ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта.Наименование КАК ВидАктива,
		|		ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет, ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет) КАК Актив,
		|		ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения, ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)) КАК МестоХранения,
		|		ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта КАК Валюта,
		|		ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток КАК ВходящийОстаток,
		|		ОстаткиДенежныхСредствОстаткиИОбороты.СуммаОборот КАК Сумма,
		|		ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток КАК ИсходящийОстаток,
		|		ОснованияДляДвижений.Основание КАК Основание
		|	ИЗ
		|		РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|					НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|					КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|					,
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстаткиИОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание КАК Основание,
		|					ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
		|					ОстаткиДенежныхСредств.Валюта КАК Валюта
		|				ИЗ
		|					РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияОперацийСАктивамиСтраховыхКомпаний КАК ОснованияОперацийСАктивамиСтраховыхКомпаний
		|							ПО КорректировкаРегистров.Ссылка = ОснованияОперацийСАктивамиСтраховыхКомпаний.Операция
		|						ПО ОстаткиДенежныхСредств.Регистратор = КорректировкаРегистров.Ссылка
		|				ГДЕ
		|					ОстаткиДенежныхСредств.Организация = &Организация
		|					И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ОстаткиДенежныхСредств.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ОстаткиДенежныхСредств.РасчетныйСчет,
		|					ОстаткиДенежныхСредств.Валюта,
		|					ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание) КАК ОснованияДляДвижений
		|				ПО ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = ОснованияДляДвижений.РасчетныйСчет
		|					И (ОснованияДляДвижений.Валюта = ОстаткиДенежныхСредствОстаткиИОбороты.Валюта)
		|			ПО ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет
		|	ГДЕ
		|		ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""Депозитные вклады"",
		|		ДепозитныеВклады.Ссылка,
		|		ДепозитныеВклады.БанковскийСчет,
		|		ДепозитныеВклады.БанковскийСчет.Валюта,
		|		ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаНачальныйОстаток,
		|		ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаОборот,
		|		ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаКонечныйОстаток,
		|		ОснованияДляДвижений.Основание
		|	ИЗ
		|		Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|					НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|					КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|					,
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ВЫРАЗИТЬ(КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.ЮрФизЛицо В
		|							(ВЫБРАТЬ
		|								КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|							ИЗ
		|								РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|			ПО ДепозитныеВклады.Ссылка = ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание КАК Основание,
		|				ОстаткиДенежныхСредств.КредитныйИнструмент КАК ДепозитныйВклад
		|			ИЗ
		|				РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ОстаткиДенежныхСредств
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияОперацийСАктивамиСтраховыхКомпаний КАК ОснованияОперацийСАктивамиСтраховыхКомпаний
		|						ПО КорректировкаРегистров.Ссылка = ОснованияОперацийСАктивамиСтраховыхКомпаний.Операция
		|					ПО ОстаткиДенежныхСредств.Регистратор = КорректировкаРегистров.Ссылка
		|			ГДЕ
		|				ОстаткиДенежныхСредств.Организация = &Организация
		|				И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ОстаткиДенежныхСредств.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание,
		|				ОстаткиДенежныхСредств.КредитныйИнструмент) КАК ОснованияДляДвижений
		|			ПО (ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = ОснованияДляДвижений.ДепозитныйВклад)
		|	ГДЕ
		|		ДепозитныеВклады.БанковскийСчет.ЮрФизЛицо В
		|				(ВЫБРАТЬ
		|					КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|				ИЗ
		|					РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""Кассы"",
		|		ЕСТЬNULL(ЗначенияДополнительныхСведений.Объект, ОстаткиПрочихАктивовОстаткиИОбороты.Актив),
		|		НЕОПРЕДЕЛЕНО,
		|		ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.Валюта, Организации.ВалютаУчета),
		|		ОстаткиПрочихАктивовОстаткиИОбороты.СуммаНачальныйОстаток,
		|		ОстаткиПрочихАктивовОстаткиИОбороты.СуммаОборот,
		|		ОстаткиПрочихАктивовОстаткиИОбороты.СуммаКонечныйОстаток,
		|		ОснованияДвижений.Основание
		|	ИЗ
		|		РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПрочихАктивов.ОстаткиИОбороты(
		|					НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|					КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|					,
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиПрочихАктивовОстаткиИОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ОстаткиПрочихАктивов.Актив КАК Актив,
		|					ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание КАК Основание
		|				ИЗ
		|					РегистрНакопления.ОстаткиПрочихАктивов КАК ОстаткиПрочихАктивов
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияОперацийСАктивамиСтраховыхКомпаний КАК ОснованияОперацийСАктивамиСтраховыхКомпаний
		|							ПО КорректировкаРегистров.Ссылка = ОснованияОперацийСАктивамиСтраховыхКомпаний.Операция
		|						ПО ОстаткиПрочихАктивов.Регистратор = КорректировкаРегистров.Ссылка
		|				ГДЕ
		|					ОстаткиПрочихАктивов.Организация = &Организация
		|					И ОстаткиПрочихАктивов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ОстаткиПрочихАктивов.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ОстаткиПрочихАктивов.Актив,
		|					ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание) КАК ОснованияДвижений
		|				ПО ОстаткиПрочихАктивовОстаткиИОбороты.Актив = ОснованияДвижений.Актив
		|			ПО ЗначенияДополнительныхСведений.Объект = ОстаткиПрочихАктивовОстаткиИОбороты.Актив,
		|		Справочник.Организации КАК Организации
		|	ГДЕ
		|		ЗначенияДополнительныхСведений.Свойство = &ДополнительноеСвойствоКассы
		|		И ЗначенияДополнительныхСведений.Значение = &СчетДоверительногоУправления
		|		И Организации.Ссылка = &Организация
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВидыПрочихАктивов.Наименование,
		|		ПрочиеАктивы.Ссылка,
		|		НЕОПРЕДЕЛЕНО,
		|		ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.Валюта, Организации.ВалютаУчета),
		|		ОстаткиПрочихАктивовОстаткиИОбороты.СуммаНачальныйОстаток,
		|		ОстаткиПрочихАктивовОстаткиИОбороты.СуммаОборот,
		|		ОстаткиПрочихАктивовОстаткиИОбороты.СуммаКонечныйОстаток,
		|		ОснованияДвижений.Основание
		|	ИЗ
		|		Справочник.ПрочиеАктивы КАК ПрочиеАктивы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыПрочихАктивов КАК ВидыПрочихАктивов
		|			ПО ПрочиеАктивы.ВидПрочегоАктива = ВидыПрочихАктивов.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПрочихАктивов.ОстаткиИОбороты(
		|					НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|					КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|					,
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиПрочихАктивовОстаткиИОбороты
		|			ПО ПрочиеАктивы.Ссылка = ОстаткиПрочихАктивовОстаткиИОбороты.Актив
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО (Организации.Ссылка = &Организация)
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ОстаткиПрочихАктивов.Актив КАК Актив,
		|				ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание КАК Основание
		|			ИЗ
		|				РегистрНакопления.ОстаткиПрочихАктивов КАК ОстаткиПрочихАктивов
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияОперацийСАктивамиСтраховыхКомпаний КАК ОснованияОперацийСАктивамиСтраховыхКомпаний
		|						ПО КорректировкаРегистров.Ссылка = ОснованияОперацийСАктивамиСтраховыхКомпаний.Операция
		|					ПО ОстаткиПрочихАктивов.Регистратор = КорректировкаРегистров.Ссылка
		|			ГДЕ
		|				ОстаткиПрочихАктивов.Организация = &Организация
		|				И ОстаткиПрочихАктивов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ОстаткиПрочихАктивов.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ОстаткиПрочихАктивов.Актив,
		|				ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание) КАК ОснованияДвижений
		|			ПО (ОстаткиПрочихАктивовОстаткиИОбороты.Актив = ОснованияДвижений.Актив)
		|	ГДЕ
		|		ПрочиеАктивы.ВидПрочегоАктива <> ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.ДолиПерестраховщиков)) КАК ДенежныеАктивы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДенежныеАктивы.ВидАктива,
		|	ДенежныеАктивы.Актив
		|ИТОГИ ПО
		|	ВидАктива";
		
	Запрос.УстановитьПараметр("Период",                       ЭтаФорма.Период);
	Запрос.УстановитьПараметр("Организация",                  ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       ЭтаФорма.Период);
	Запрос.УстановитьПараметр("ДополнительноеСвойствоКассы",  ДополнительноеСвойствоКассы);
	
	ВыборкаВидАктива = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Ключ = 1;
	
	Пока ВыборкаВидАктива.Следующий() Цикл
		
		НоваяСтрокаВидАктива = ЭтаФорма.ОстаткиДенежныхСредств.ПолучитьЭлементы().Добавить();
		НоваяСтрокаВидАктива.ВидАктива = ВыборкаВидАктива.ВидАктива;
		НоваяСтрокаВидАктива.Ключ      = Ключ; 
		
		Ключ = Ключ + 1;
		
		ВыборкаОстатки = ВыборкаВидАктива.Выбрать();
		
		Пока ВыборкаОстатки.Следующий() Цикл
			
			НоваяСтрокаАктив = НоваяСтрокаВидАктива.ПолучитьЭлементы().Добавить();
			НоваяСтрокаАктив.Ключ = Ключ;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаАктив, ВыборкаОстатки);
			
			//НоваяСтрокаАктив.Регистратор = ПолучитьРегистраторАктива(ЭтаФорма.Период, СчетДоверительногоУправления, Организация,    ВыборкаОстатки.Актив);
			
			Ключ = Ключ + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//ЭтаФорма.ОсновнойРегистратор = ПолучитьОсновнойРегистратор(ЭтаФорма.Период, ЭтаФорма.СчетДоверительногоУправления);
	
	//Если ЕстьПрочиеРегистраторы(ЭтаФорма.Период, ЭтаФорма.СчетДоверительногоУправления, ЭтаФорма.Организация, ЭтаФорма.ОсновнойРегистратор) Тогда
	//	Элементы.КомандаПрочиеРегистраторы.Заголовок = "Прочие вводы денежных средств";
	//Иначе
	//	Элементы.КомандаПрочиеРегистраторы.Заголовок = "Прочие вводы денежных средств (отсутствуют)";
	//КонецЕсли;
	
	ЭтаФорма.Модифицированность = Ложь;
	
	Если ФиксироватьСтатистику Тогда
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтаФорма, "Период, Организация, СчетДоверительногоУправления, ПредПериод, ПредСчетДоверительногоУправления"); 
	Механизм			= "_ВводОстатковАктивовСтраховыхКомпаний.Форма.СохранитьИзмененияНаСервере()";
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
	
	НачатьТранзакцию();
	
	Для каждого СтрокаВидАктива Из ЭтаФорма.ОстаткиДенежныхСредств.ПолучитьЭлементы() Цикл
		
		Для каждого СтрокаАктив Из СтрокаВидАктива.ПолучитьЭлементы() Цикл
			
			Если СтрокаАктив.ИсходнаяСумма <> СтрокаАктив.Сумма или СтрокаАктив.ИсходноеОснование <> СтрокаАктив.Основание Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	ВсеАктивы.Период КАК Период,
				               |	ВсеАктивы.Актив КАК Актив,
				               |	ВсеАктивы.Регистратор КАК Регистратор,
				               |	ВсеАктивы.Валюта КАК Валюта
				               |ИЗ
				               |	(ВЫБРАТЬ
				               |		ОстаткиДенежныхСредств.Период КАК Период,
				               |		ОстаткиДенежныхСредств.РасчетныйСчет КАК Актив,
				               |		ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
				               |		ОстаткиДенежныхСредств.Валюта КАК Валюта,
				               |		NULL КАК ДепозитныйВкладБанковскийСчетВалюта
				               |	ИЗ
				               |		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
				               |	
				               |	ОБЪЕДИНИТЬ ВСЕ
				               |	
				               |	ВЫБРАТЬ
				               |		ДенежныеСредстваВКредитныхИнструментах.Период,
				               |		ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент,
				               |		ДенежныеСредстваВКредитныхИнструментах.Регистратор,
				               |		NULL,
				               |		ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта
				               |	ИЗ
				               |		РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
				               |	ГДЕ
				               |		ДенежныеСредстваВКредитныхИнструментах.ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)
				               |	
				               |	ОБЪЕДИНИТЬ ВСЕ
				               |	
				               |	ВЫБРАТЬ
				               |		ОстаткиПрочихАктивов.Период,
				               |		ОстаткиПрочихАктивов.Актив,
				               |		ОстаткиПрочихАктивов.Регистратор,
				               |		ОстаткиПрочихАктивов.Валюта,
				               |		NULL
				               |	ИЗ
				               |		РегистрНакопления.ОстаткиПрочихАктивов КАК ОстаткиПрочихАктивов
				               |	
				               |	ОБЪЕДИНИТЬ ВСЕ
				               |	
				               |	ВЫБРАТЬ
				               |		НоминалыКредитныхИнструментов.Период,
				               |		НоминалыКредитныхИнструментов.КредитныйИнструмент,
				               |		НоминалыКредитныхИнструментов.Регистратор,
				               |		NULL,
				               |		ВЫРАЗИТЬ(НоминалыКредитныхИнструментов.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта
				               |	ИЗ
				               |		РегистрСведений.НоминалыКредитныхИнструментов КАК НоминалыКредитныхИнструментов
				               |	ГДЕ
				               |		ТИПЗНАЧЕНИЯ(НоминалыКредитныхИнструментов.КредитныйИнструмент) = ТИП(Справочник.ДепозитныеВклады)) КАК ВсеАктивы
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК КорректировкаРегистров
				               |		ПО ВсеАктивы.Регистратор = КорректировкаРегистров.Ссылка
				               |ГДЕ
				               |	ВсеАктивы.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
				               |	И ВсеАктивы.Актив = &Актив
				               |	И КорректировкаРегистров.Организация = &Организация
				               |	И КорректировкаРегистров.СчетДоверительногоУправления = &СчетДоверительногоУправления
				               |	И ВсеАктивы.Валюта = &Валюта";
							   
				Запрос.УстановитьПараметр("Период", ЭтаФорма.Период);				
				Запрос.УстановитьПараметр("Актив", СтрокаАктив.Актив);			
				Запрос.УстановитьПараметр("Валюта", СтрокаАктив.Валюта);
				Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);  
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	
				Выборка = Запрос.Выполнить().Выбрать();				
				
				Пока Выборка.Следующий() Цикл
					
					НаборОстаткиДенежныхСредств = РегистрыНакопления.ОстаткиДенежныхСредств.СоздатьНаборЗаписей();
					НаборОстаткиДенежныхСредств.Отбор.Регистратор.Установить(Выборка.Регистратор);
					НаборОстаткиДенежныхСредств.Прочитать();
					ВсегоЗаписей = НаборОстаткиДенежныхСредств.Количество();
					
					Для НомерЗаписи = 1 По ВсегоЗаписей Цикл
						
					    ТекущаяЗапись = НаборОстаткиДенежныхСредств[ВсегоЗаписей - НомерЗаписи];
						Если ТекущаяЗапись.РасчетныйСчет = Выборка.Актив Тогда					   
							 НаборОстаткиДенежныхСредств.Удалить(ТекущаяЗапись);
							 НаборОстаткиДенежныхСредств.Записать();
						КонецЕсли;

					КонецЦикла;
					
					НаборОстаткиНаДепозитныхВкладах = РегистрыНакопления.ДенежныеСредстваВКредитныхИнструментах.СоздатьНаборЗаписей();
					НаборОстаткиНаДепозитныхВкладах.Отбор.Регистратор.Установить(Выборка.Регистратор);
					НаборОстаткиНаДепозитныхВкладах.Прочитать();
					ВсегоЗаписей = НаборОстаткиНаДепозитныхВкладах.Количество();
					
					Для НомерЗаписи = 1 По ВсегоЗаписей Цикл
						
					    ТекущаяЗапись = НаборОстаткиНаДепозитныхВкладах[ВсегоЗаписей - НомерЗаписи];
						Если ТекущаяЗапись.КредитныйИнструмент = Выборка.Актив Тогда					   
							 НаборОстаткиНаДепозитныхВкладах.Удалить(ТекущаяЗапись);
							 НаборОстаткиНаДепозитныхВкладах.Записать();
						КонецЕсли;

					КонецЦикла;
					
					НаборНоминалыКредитныхИнструментов = РегистрыСведений.НоминалыКредитныхИнструментов.СоздатьНаборЗаписей();
					НаборНоминалыКредитныхИнструментов.Отбор.Регистратор.Установить(Выборка.Регистратор);
					НаборНоминалыКредитныхИнструментов.Прочитать();
					ВсегоЗаписей = НаборНоминалыКредитныхИнструментов.Количество();
					
					
					Для НомерЗаписи = 1 По ВсегоЗаписей Цикл
						
					    ТекущаяЗапись = НаборНоминалыКредитныхИнструментов[ВсегоЗаписей - НомерЗаписи];
						Если ТекущаяЗапись.КредитныйИнструмент = Выборка.Актив Тогда					   
							 НаборНоминалыКредитныхИнструментов.Удалить(ТекущаяЗапись);
							 НаборНоминалыКредитныхИнструментов.Записать();
						КонецЕсли;

					КонецЦикла;

					НаборОстаткиПрочихАктивови = РегистрыНакопления.ОстаткиПрочихАктивов.СоздатьНаборЗаписей();
					НаборОстаткиПрочихАктивови.Отбор.Регистратор.Установить(Выборка.Регистратор);
					НаборОстаткиПрочихАктивови.Прочитать();
					ВсегоЗаписей = НаборОстаткиПрочихАктивови.Количество();
					
					Для НомерЗаписи = 1 По ВсегоЗаписей Цикл
						
					    ТекущаяЗапись = НаборОстаткиПрочихАктивови[ВсегоЗаписей - НомерЗаписи];
						Если ТекущаяЗапись.Актив = Выборка.Актив и ТекущаяЗапись.Валюта = Выборка.Валюта Тогда					   
							 НаборОстаткиПрочихАктивови.Удалить(ТекущаяЗапись);
							 НаборОстаткиПрочихАктивови.Записать(); 
							 Прервать;
						КонецЕсли;

					КонецЦикла;					
					
				КонецЦикла;
				
				Если СтрокаАктив.Сумма <> 0 Тогда
					Запрос = Новый Запрос;
					
					Регистратор = Документы.КорректировкаРегистров.ПустаяСсылка();
					
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					               |	ЕСТЬNULL(ОснованияОперацийСАктивамиСтраховыхКомпаний.Операция, КорректировкаРегистров.Ссылка) КАК Операция
					               |ИЗ
					               |	Документ.КорректировкаРегистров КАК КорректировкаРегистров
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияОперацийСАктивамиСтраховыхКомпаний КАК ОснованияОперацийСАктивамиСтраховыхКомпаний
					               |		ПО (ОснованияОперацийСАктивамиСтраховыхКомпаний.Операция = КорректировкаРегистров.Ссылка)
					               |ГДЕ
					               |	КорректировкаРегистров.Организация = &Организация
					               |	И (ОснованияОперацийСАктивамиСтраховыхКомпаний.Основание = &Основание
					               |			ИЛИ &Основание = ЗНАЧЕНИЕ(Документ.ВходящийДокумент.ПустаяСсылка)
					               |				И ОснованияОперацийСАктивамиСтраховыхКомпаний.Операция ЕСТЬ NULL )
					               |	И КорректировкаРегистров.СчетДоверительногоУправления = &СчетДоверительногоУправления
					               |	И КорректировкаРегистров.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)";
								   
			
					Запрос.УстановитьПараметр("Основание", СтрокаАктив.Основание);
					Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
					Запрос.УстановитьПараметр("Период", ЭтаФорма.Период);		
					Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	   
					Выборка = Запрос.Выполнить().Выбрать();				
					
					Если Выборка.Следующий() Тогда
						Регистратор = Выборка.Операция;
						Регистратор = Регистратор.ПолучитьОбъект();
					Иначе
						Регистратор = Документы.КорректировкаРегистров.СоздатьДокумент();
						Регистратор.Дата                         = ЭтаФорма.Период + 10 * 60 * 60 + 2; // помещаем по время 10:00:02
						Регистратор.Организация                  = ЭтаФорма.Организация;
						Регистратор.СчетДоверительногоУправления = ЭтаФорма.СчетДоверительногоУправления;
						Регистратор.Ответственный                = РаботаСПользователями.ТекущийПользователь();
						Регистратор.Комментарий                  = "Ручной ввод остатков на основании документа " + СтрокаАктив.Основание.НомерВходящегоДокумента + " От " + СтрокаАктив.Основание.ДатаВходящегоДокумента;

		                Регистратор.ТаблицаРегистров.Очистить();
						Регистратор.ТаблицаРегистров.Добавить();
						Регистратор.ТаблицаРегистров.Добавить();
						Регистратор.ТаблицаРегистров.Добавить();
						                                        						Регистратор.ТаблицаРегистров.Добавить();

						Регистратор.ТаблицаРегистров.ЗагрузитьКолонку(
							РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("ОстаткиДенежныхСредств, ОстаткиПрочихАктивов, ДенежныеСредстваВКредитныхИнструментах, НоминалыКредитныхИнструментов", ",", Истина, Истина),
							"Имя");

						Регистратор.Записать();
						
						Если ЗначениеЗаполнено(СтрокаАктив.Основание) Тогда
						
							ДокументОснование = СтрокаАктив.Основание.ПолучитьОбъект();				
							НоваяОперация = ДокументОснование.Операции.Добавить();
							НоваяОперация.Операция = Регистратор.Ссылка;
							ДокументОснование.Записать(РежимЗаписиДокумента.Проведение);
							
						КонецЕсли;
						
					КонецЕсли;
						
					НаборОстаткиДенежныхСредств = РегистрыНакопления.ОстаткиДенежныхСредств.СоздатьНаборЗаписей();
					НаборОстаткиДенежныхСредств.Отбор.Регистратор.Установить(Регистратор.Ссылка);
					НаборОстаткиДенежныхСредств.Прочитать(); 
					
					НаборОстаткиПрочихАктивов = РегистрыНакопления.ОстаткиПрочихАктивов.СоздатьНаборЗаписей();
					НаборОстаткиПрочихАктивов.Отбор.Регистратор.Установить(Регистратор.Ссылка);
					НаборОстаткиПрочихАктивов.Прочитать(); 		
					
					НаборДенежныеСредстваВКредитныхИнструментах = РегистрыНакопления.ДенежныеСредстваВКредитныхИнструментах.СоздатьНаборЗаписей();
					НаборДенежныеСредстваВКредитныхИнструментах.Отбор.Регистратор.Установить(Регистратор.Ссылка);
					НаборДенежныеСредстваВКредитныхИнструментах.Прочитать(); 
					
					НаборНоминалыКредитныхИнструментов = РегистрыСведений.НоминалыКредитныхИнструментов.СоздатьНаборЗаписей();
					НаборНоминалыКредитныхИнструментов.Отбор.Регистратор.Установить(Регистратор.Ссылка);
					НаборНоминалыКредитныхИнструментов.Прочитать();

					Если      Найти(СтрокаАктив.ВидАктива, "Расчетные счета") = 1 Тогда 
					
						Запись = НаборОстаткиДенежныхСредств.Добавить();
						Запись.РасчетныйСчет = СтрокаАктив.Актив;
							
						Если СтрокаАктив.Сумма < 0 Тогда
								Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВыводДенежныхСредств;
							Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы;
						Иначе
							Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств;
							Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы;
						КонецЕсли;
						
					ИначеЕсли Найти(СтрокаАктив.ВидАктива, "Брокерские счета") = 1 Тогда
						
						Запись = НаборОстаткиДенежныхСредств.Добавить();
						Запись.Брокер = СтрокаАктив.Актив;
						
						Если СтрокаАктив.Сумма < 0 Тогда
							Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВыводДенежныхСредств;
							Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы;
						Иначе
							Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств;
							Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы;
						КонецЕсли;
						
					ИначеЕсли Найти(СтрокаАктив.ВидАктива, "Депозитные вклады") = 1 Тогда
						
						Запись = НаборДенежныеСредстваВКредитныхИнструментах.Добавить();
						Запись.КредитныйИнструмент = СтрокаАктив.Актив;
						Запись.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный;
						Запись.ТипКредитногоИнструмента = Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад;
						
						ЗаписьНД =  НаборНоминалыКредитныхИнструментов.Добавить();
						ЗаписьНД.КредитныйИнструмент = СтрокаАктив.Актив;
						ЗаписьНД.Период                       = Регистратор.Дата;
						ЗаписьНД.Организация                  = Регистратор.Организация; 
					
						ЗаполнитьЗначенияСвойств(ЗаписьНД, СтрокаАктив);

					ИначеЕсли Найти(СтрокаАктив.ВидАктива, "ДолиПерестраховщиков") = 0  Тогда
						
						Запись = НаборОстаткиПрочихАктивов.Добавить();
						
					КонецЕсли;
					
					Запись.Период                       = Регистратор.Дата;
					Запись.Организация                  = Регистратор.Организация;
					Запись.СчетДоверительногоУправления = Регистратор.СчетДоверительногоУправления;
					
					ЗаполнитьЗначенияСвойств(Запись, СтрокаАктив);
					
					Запись.ВидДвижения = ?(Запись.Сумма < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
					Запись.Сумма       = ?(Запись.Сумма < 0, -Запись.Сумма, Запись.Сумма);

					НаборОстаткиДенежныхСредств.Записать();
					НаборОстаткиПрочихАктивов.Записать();
					НаборДенежныеСредстваВКредитныхИнструментах.Записать(); 
					НаборНоминалыКредитныхИнструментов.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = "";
		 
		 	
	ЗафиксироватьТранзакцию();
	
	ЗаполнитьОстаткиДенежныхСредствНаСервере(Ложь);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

// deprecated
&НаСервере
Процедура СохранитьСуммыНаСервере()
	
	НачатьТранзакцию();
	
	//Если ЗначениеЗаполнено(ЭтаФорма.ОсновнойРегистратор) Тогда
	//	
	//	Регистратор = ЭтаФорма.ОсновнойРегистратор;
	//	
	//Иначе	
		
		Регистратор = Документы.КорректировкаРегистров.СоздатьДокумент();
		Регистратор.Дата                         = ЭтаФорма.Период + 10 * 60 * 60 + 2; // помещаем по время 10:00:02
		Регистратор.Организация                  = ЭтаФорма.Организация;
		Регистратор.СчетДоверительногоУправления = ЭтаФорма.СчетДоверительногоУправления;
		Регистратор.Ответственный                = РаботаСПользователями.ТекущийПользователь();
		Регистратор.Комментарий                  = "Ввод денежных средств";
		
		Регистратор.ТаблицаРегистров.Добавить();
		Регистратор.ТаблицаРегистров.Добавить();
		Регистратор.ТаблицаРегистров.Добавить();
		
		Регистратор.ТаблицаРегистров.ЗагрузитьКолонку(
			РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("ОстаткиДенежныхСредств, ОстаткиПрочихАктивов, ДенежныеСредстваВКредитныхИнструментах", ",", Истина, Истина),
			"Имя");
		
		Регистратор.Записать();
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЗаписьКодыВоВнешнихСистемах = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьМенеджерЗаписи();
		ЗаписьКодыВоВнешнихСистемах.Период         = Дата(1980, 1, 1); 
		ЗаписьКодыВоВнешнихСистемах.ВнешняяСистема = Справочники.ВнешниеСистемы.Фенси;
		ЗаписьКодыВоВнешнихСистемах.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Ручные вводы денежных средств", Истина, Ложь);
		ЗаписьКодыВоВнешнихСистемах.Код            = ПолучитьКлючОсновногоРегистратор(Период, СчетДоверительногоУправления);
		ЗаписьКодыВоВнешнихСистемах.Объект         = Регистратор.Ссылка;
		ЗаписьКодыВоВнешнихСистемах.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Регистратор = Регистратор.Ссылка;
		
	//КонецЕсли;
	
	НаборОстаткиДенежныхСредств = РегистрыНакопления.ОстаткиДенежныхСредств.СоздатьНаборЗаписей();
	НаборОстаткиДенежныхСредств.Отбор.Регистратор.Установить(Регистратор);
	НаборОстаткиДенежныхСредств.Прочитать();
	НаборОстаткиДенежныхСредств.Очистить();
	
	НаборОстаткиПрочихАктивов = РегистрыНакопления.ОстаткиПрочихАктивов.СоздатьНаборЗаписей();
	НаборОстаткиПрочихАктивов.Отбор.Регистратор.Установить(Регистратор);
	НаборОстаткиПрочихАктивов.Прочитать();
	НаборОстаткиПрочихАктивов.Очистить();
	
	НаборДенежныеСредстваВКредитныхИнструментах = РегистрыНакопления.ДенежныеСредстваВКредитныхИнструментах.СоздатьНаборЗаписей();
	НаборДенежныеСредстваВКредитныхИнструментах.Отбор.Регистратор.Установить(Регистратор);
	НаборДенежныеСредстваВКредитныхИнструментах.Прочитать();
	НаборДенежныеСредстваВКредитныхИнструментах.Очистить();
	
	Для каждого СтрокаВидАктива Из ЭтаФорма.ОстаткиДенежныхСредств.ПолучитьЭлементы() Цикл
		
		Для каждого СтрокаАктив Из СтрокаВидАктива.ПолучитьЭлементы() Цикл
			
			Если СтрокаАктив.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если      Найти(СтрокаАктив.ВидАктива, "Расчетные счета") = 1 Тогда 
				
				Запись = НаборОстаткиДенежныхСредств.Добавить();
				Запись.РасчетныйСчет = СтрокаАктив.Актив;
				
				Если СтрокаАктив.Сумма < 0 Тогда
					Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВыводДенежныхСредств;
					Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы;
				Иначе
					Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств;
					Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы;
				КонецЕсли;
				
			ИначеЕсли Найти(СтрокаАктив.ВидАктива, "Брокерские счета") = 1 Тогда
				
				Запись = НаборОстаткиДенежныхСредств.Добавить();
				Запись.Брокер = СтрокаАктив.Актив;
				
				Если СтрокаАктив.Сумма < 0 Тогда
					Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВыводДенежныхСредств;
					Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы;
				Иначе
					Запись.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств;
					Запись.ВариантДвиженияДенежныхСредств = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы;
				КонецЕсли;
				
			ИначеЕсли Найти(СтрокаАктив.ВидАктива, "Депозитные вклады") = 1 Тогда
				
				Запись = НаборДенежныеСредстваВКредитныхИнструментах.Добавить();
				Запись.КредитныйИнструмент = СтрокаАктив.Актив;
				Запись.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный;
				Запись.ТипКредитногоИнструмента = Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад;
				
			ИначеЕсли Найти(СтрокаАктив.ВидАктива, "ДолиПерестраховщиков") = 0 Тогда
				
				Запись = НаборОстаткиПрочихАктивов.Добавить();
				
			КонецЕсли;
			
			Запись.Период                       = Регистратор.Дата;
			Запись.Организация                  = Регистратор.Организация;
			Запись.СчетДоверительногоУправления = Регистратор.СчетДоверительногоУправления;
			
			ЗаполнитьЗначенияСвойств(Запись, СтрокаАктив);
			
			Запись.ВидДвижения = ?(Запись.Сумма < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			Запись.Сумма       = ?(Запись.Сумма < 0, -Запись.Сумма, Запись.Сумма);
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборОстаткиДенежныхСредств.Записать();
	НаборОстаткиПрочихАктивов.Записать();
	НаборДенежныеСредстваВКредитныхИнструментах.Записать();
	
	ЗафиксироватьТранзакцию();
	
	ЗаполнитьОстаткиДенежныхСредствНаСервере();
	
КонецПроцедуры // СохранитьСуммыНаСервере

&НаКлиенте
Процедура ЗаполнитьОстаткиОстаткиДенежныхСредств()
	
	Перем КлючиРазвернутыхСтрок;
	
	Если ЭтаФорма.Модифицированность
		И Вопрос("Внесенные изменения будут безвозвратно утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
	
		ЭтаФорма.Период                       = ЭтаФорма.ПредПериод;
		ЭтаФорма.СчетДоверительногоУправления = ЭтаФорма.ПредСчетДоверительногоУправления;
	
		Возврат;
		
	КонецЕсли;
	
	РаботаСФормамиКлиент.ПолучитьКлючиРазвернутыхСтрокДерева(ЭтаФорма.ОстаткиДенежныхСредств, Элементы.ОстаткиДенежныхСредств, "Ключ", КлючиРазвернутыхСтрок);
	КлючТекущейСтроки = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ОстаткиДенежныхСредств, "Ключ");
	
	ЭтаФорма.ПредПериод                       = ЭтаФорма.Период;
	ЭтаФорма.ПредСчетДоверительногоУправления = ЭтаФорма.СчетДоверительногоУправления;
	
	ЗаполнитьОстаткиДенежныхСредствНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ЭтаФорма.ОстаткиДенежныхСредств, Элементы.ОстаткиДенежныхСредств, "Ключ", КлючиРазвернутыхСтрок);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ОстаткиДенежныхСредств, Элементы.ОстаткиДенежныхСредств, "Ключ", КлючТекущейСтроки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаКоманды.Видимость = Ложь; // временно, т.к. текущая отработка сложна
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Период      = ТекущаяДата();
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ПредПериод                       = ЭтаФорма.Период;
	ЭтаФорма.ПредСчетДоверительногоУправления = ЭтаФорма.СчетДоверительногоУправления;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Период) И ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		ЗаполнитьОстаткиОстаткиДенежныхСредств();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "_ВводДенежныхСредствСтраховыхКомпаний.НовыйРасчетныйСчет" Тогда
		
		НовыйРасчетныйСчет = Параметр;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗаполнитьОстаткиОстаткиДенежныхСредств();
	ПроверитьДатуЗапретаРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ЗаполнитьОстаткиОстаткиДенежныхСредств();
	ПроверитьДатуЗапретаРедактирования(); 	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОстаткиДенежныхСредств.ТекущиеДанные;
	
	ТекущиеДанные.ИсходящийОстаток = ТекущиеДанные.ВходящийОстаток + ТекущиеДанные.Сумма;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствИсходящийОстатокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОстаткиДенежныхСредств.ТекущиеДанные;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.ИсходящийОстаток - ТекущиеДанные.ВходящийОстаток;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ЗаполнитьОстаткиОстаткиДенежныхСредств();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьСуммы(Команда)
	
		Перем КлючиРазвернутыхСтрок;

	Если НЕ ПроверитьДатыЗапретаРедактированияНаСервере() Тогда 		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя импортировать остатки - редактирование запрещено (см. дату запрета редактирования)");
		ЭтаФорма.Элементы.ФормаКомандаСохранить.Доступность = Ложь;
		Возврат;	
	КонецЕсли;
	                         	
	РаботаСФормамиКлиент.ПолучитьКлючиРазвернутыхСтрокДерева(ЭтаФорма.ОстаткиДенежныхСредств, Элементы.ОстаткиДенежныхСредств, 
	"Ключ", КлючиРазвернутыхСтрок);
	КлючТекущейСтроки = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ОстаткиДенежныхСредств, "Ключ");

	//СохранитьСуммыНаСервере();
	СохранитьИзмененияНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ЭтаФорма.ОстаткиДенежныхСредств, Элементы.ОстаткиДенежныхСредств,
	"Ключ", КлючиРазвернутыхСтрок);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ОстаткиДенежныхСредств, Элементы.ОстаткиДенежныхСредств, "Ключ", КлючТекущейСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНовыйРасчетныйСчет(Команда)
	
	ЗначенияЗаполнения = Новый Структура("ЮрФизЛицо",
		ПолучитьКлиентаДоверительногоУправления(ЭтаФорма.Период, ЭтаФорма.СчетДоверительногоУправления));
	
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНовыйДепозитныйВклад(Команда)
	
	ЗначенияЗаполнения = Новый Структура("Владелец",
		ПолучитьКлиентаДоверительногоУправления(ЭтаФорма.Период, ЭтаФорма.СчетДоверительногоУправления));
	
	ОткрытьФорму("Справочник.ДепозитныеВклады.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрочиеРегистраторы(Команда)
	
	Отбор = Новый Структура("СчетДоверительногоУправления",
		ЭтаФорма.СчетДоверительногоУправления);
	
	ОткрытьФорму("Документ.КорректировкаРегистров.ФормаСписка", Новый Структура("Отбор", Отбор), ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСчетДУОснованияСовпадаетСДокументом(Организация, СчетДоверительногоУправления, Основание)
	
	Запрос = Новый Запрос;
    Запрос.Текст =
    	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
    	|	ВходящийДокумент.Ссылка КАК Ссылка
    	|ИЗ
    	|	Документ.ВходящийДокумент КАК ВходящийДокумент
    	|ГДЕ
    	|	ВходящийДокумент.Договоры.Договор = &СчетДоверительногоУправления
    	|	И ВходящийДокумент.Организация = &Организация
    	|	И ВходящийДокумент.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Основание);    
	
	Если Запрос.Выполнить().Выбрать().Следующий() тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	 	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствПолеДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ПроверитьСчетДУОснованияСовпадаетСДокументом( Организация, СчетДоверительногоУправления, ВыбранноеЗначение) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя выбрать документ в качестве основания. Не совпадают счета ДУ.");
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;             	
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствПолеДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ПараметрыОтбора = Новый Структура
		("ФильтрПоСчетуДоверительногоУправления, ФильтрПоДатеДокумента, ФильтрПоОрганизации", 
			СчетДоверительногоУправления, ЭтаФорма.Период, ЭтаФорма.Организация);
    ОткрытьФорму("Документ.ВходящийДокумент.Форма.ФормаВыбораДатаСчетДУ", ПараметрыОтбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствПолеДокументОснованиеПриИзменении(Элемент)
	
	// После выбора Основания для операции для всех позиций с известной суммой и тем же типом актива
	// нужно проставить то же основание
	ТекущиеДанные = Элементы.ОстаткиДенежныхСредств.ТекущиеДанные;

	Если ЗначениеЗаполнено(ТекущиеДанные.Основание) Тогда	
		
		Для Каждого Группа Из ОстаткиДенежныхСредств.ПолучитьЭлементы() Цикл
			Для Каждого Строка из Группа.ПолучитьЭлементы() Цикл
				Если Не ЗначениеЗаполнено(Строка.Основание) И 
					Строка.ВидАктива = ТекущиеДанные.ВидАктива
					И ЗначениеЗаполнено(Строка.Сумма) Тогда
					Строка.Основание = ТекущиеДанные.Основание;	
				КонецЕсли;		
			КонецЦикла;  
		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры

