// По переданным массивам определяет добавленные и удаленные элементы массива ВидыАктивовТекущие и относительно ВидыАктивовНаНачало
// и возвращает структуру со свойствами типа Массив ДобавленныеВидыАктивов, УдаленныеВидыАктивов
//	
// Параметры:
//		- ВидыАктивовНаНачало - Массив видов активов до изменения
//		- ВидыАктивовТекущие - Массив видов активов после изменения
//
Функция СформироватьСтруктуруИзмененийСоставаВидовАктивов(ВидыАктивовНаНачало, ВидыАктивовТекущие) Экспорт
	
	УдаленныеВидыАктивов	= Новый Массив;
	ДобавленныеВидыАктивов	= Новый Массив;
	
	Для Каждого ВидАктиваНаНачало Из ВидыАктивовНаНачало Цикл		
		Если ВидыАктивовТекущие.Найти(ВидАктиваНаНачало) = Неопределено Тогда
			УдаленныеВидыАктивов.Добавить(ВидАктиваНаНачало);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ВидАктиваТекущий Из ВидыАктивовТекущие Цикл		
		Если ВидыАктивовНаНачало.Найти(ВидАктиваТекущий) = Неопределено Тогда
			ДобавленныеВидыАктивов.Добавить(ВидАктиваТекущий);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ДобавленныеВидыАктивов,УдаленныеВидыАктивов", ДобавленныеВидыАктивов, УдаленныеВидыАктивов);
	
КонецФункции

// Возвращает результат запроса по действующим видам активов квал. инвестора
// 
//	Параметры:
//		Организация - Организация
//		Объект - ЮрФизЛицо - квал. инвестор
//		ЗначениеГраницы - Дата или МоментВремени() - момент среза
//		ВключаяГраницу - Булево - признак включения ЗначениеГраницы в срез
//
Функция РезультатЗапросаПоВидамАктивов(Организация, Объект, ЗначениеГраницы, ВключаяГраницу = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.ВидАктива КАК ВидАктива
		|ИЗ
		|	РегистрСведений.ОснованияВнесенияВПеречень.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Объект = &Объект
		|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы)) КАК ОснованияВнесенияВПереченьСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнесениеИзмененийВоВнутреннийПеречень.ВидыАктивовКвалифицированныхИнвесторов КАК ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов
		|		ПО ОснованияВнесенияВПереченьСрезПоследних.Основание = ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка
		|			И (ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка.ВидИзменения <> ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение))
		|ГДЕ
		|	НЕ ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.ВидАктива ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Объект", 		Объект);
	Запрос.УстановитьПараметр("Дата", 			Новый Граница(ЗначениеГраницы, ?(ВключаяГраницу, ВидГраницы.Включая, ВидГраницы.Исключая)));
	
	Возврат Запрос.Выполнить();
	
КонецФункции
