
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Параметры.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Параметры.УстановитьЗначениеПараметра("Период", ЭтотОбъект.Дата); 
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,,);
	

КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Остатки активов СК для сверки с данными DEPONET.",
		"1.32",
		"",
		Истина);
		           
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
    
	// Объявить команду для регламентного исполнения.
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "Экспортировать остатки активов", "Сверка активов",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;

	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт

	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	// Отчет на предыдущий рабочий день
	// ЭтотОбъект.Период		= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ТекущаяДата() - 60 * 60 * 24); 
	// Нужен отчет на любой ПРЕДЫДУЩИЙ день ( неважно, рабочий/нерабочий )
	
	//ЭтотОбъект.Период = ТекущаяДата() - 60 * 60 * 24;
	// -3 дня назад теперь требуется 

	ЭтотОбъект.Организация	= ПараметрыКоманды.Организация; 
	КаталогСохранения		= ПараметрыКоманды.КаталогСохранения;	         
	ДатаРабочихДнейНазад	= ПараметрыКоманды.ДатаРабочихДнейНазад + 1;	
	 	
	ЭтотОбъект.Дата = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -1*ДатаРабочихДнейНазад); 
	ЭтотОбъект.Дата = КонецДня(ЭтотОбъект.Дата);	
	
	Результат = Новый ТабличныйДокумент;
	ПриКомпоновкеРезультата(Результат, NULL, Ложь);
	Расширение =  ".xls";   	
	ИмяФайла = КаталогСохранения + "/Портфель СК " + Формат(ЭтотОбъект.Дата,"ДФ=""дд.ММ.гггг""");
	Версия = 0;
	
	ИмяФайлаСВерсией = ИмяФайла + Расширение;
	
	ПроверяемыйФайл = Новый Файл(ИмяФайлаСВерсией);      
	
	Пока ПроверяемыйФайл.Существует() Цикл 
		Версия = Версия + 1;              
		ИмяФайлаСВерсией = ИмяФайла + "-" + Строка(Версия) +Расширение; 	
		ПроверяемыйФайл = Новый Файл(ИмяФайлаСВерсией);
	КонецЦикла;

	
	Результат.Записать(ИмяФайлаСВерсией, ТипФайлаТабличногоДокумента.XLS); 
	 	
КонецПроцедуры // ВыполнитьКоманду
