
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Процедура ПроверкаНаСервере(ПараметрыСессии)
	
	НачисленияДивидендов.Очистить();
		
	ДанныеПроверки = РеквизитФормыВЗначение("Объект").Проверка();
	Статус = ДанныеПроверки.Статус;
	Данные = ДанныеПроверки.Данные;
	Если Данные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Статус);
		ДобавитьТекстОшибки(ПараметрыСессии, Статус);
		Возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаДанных из Данные Цикл 
		
		НоваяСтрока = НачисленияДивидендов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Проверка");
	Попытка
		ПроверкаНаСервере(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ПроверитьИЗаписатьИзмененияПоДивидендам(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗаполнить");
	Попытка
		КомандаЗаполнитьНаСервере(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
