&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	ЭтаФорма.Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Отчет.Период      = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ЕдиницаИзмерения) Тогда 
		ЭтаФорма.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		ЭтаФорма.ТочностьЕдиницыИзмерения = 2;	
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	Настройка = Новый Структура;
	Настройка.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	Настройка.Вставить("ТочностьЕдиницыИзмерения", ТочностьЕдиницыИзмерения);
		
	РеквизитФормыВЗначение("Отчет").Сформировать(Результат, Расшифровка, Настройка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;	
	
	КомандаСформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТочностьЕдиницыИзмеренияПриИзмененииНаСервере()
	Если ЕдиницаИзмерения  = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда
		Если ТочностьЕдиницыИзмерения > 2 Тогда 
			ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;	
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда 
		Если ТочностьЕдиницыИзмерения > 3 Тогда 
			ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;			
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		Если ТочностьЕдиницыИзмерения > 6 Тогда 
			ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;					
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении(Элемент)
	ТочностьЕдиницыИзмеренияПриИзмененииНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЕдиницаИзмеренияПриИзмененииНаСервере()
	Если ЕдиницаИзмерения  = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда
		ТочностьЕдиницыИзмерения = 2;
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда 
		ТочностьЕдиницыИзмерения = 0;
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		ТочностьЕдиницыИзмерения = 0;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	ЕдиницаИзмеренияПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	Если Элемент.Имя = "ПодписантРуководитель" Тогда 
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ПодписантРуководитель) Тогда
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", Неопределено);	
		КонецЕсли;	
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ПодписантГлавбух) Тогда
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", Неопределено);	
		КонецЕсли;	
	ИначеЕсли Элемент.Имя = "ПодписантОтКлиента" Тогда
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ПодписантОтКлиента) Тогда
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантОтКлиента", Неопределено);	
		КонецЕсли;					
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = "ПодписантРуководитель" Тогда 
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, ПодписантРуководитель));		
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, ПодписантГлавбух));	
	КонецЕсли;	
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;	
	
	Если Элемент.Имя = "ПодписантРуководитель" Тогда 
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", СтруктураДанныхКонтактногоЛица);	
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", СтруктураДанныхКонтактногоЛица);	
	ИначеЕсли Элемент.Имя = "ПодписантОтКлиента" Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантОтКлиента", СтруктураДанныхКонтактногоЛица);					
	КонецЕсли;	
		
КонецПроцедуры


&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	Если ЭтаФорма.НастройкиОтчета.Свойство("КлючТекущегоВарианта") Тогда 
		Вариант = ЭтаФорма.НастройкиОтчета.КлючТекущегоВарианта;
	Иначе
	    Вариант = "Вариант1";
	КонецЕсли;	
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", Отчет.Организация);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтаФорма.НастройкиОтчета.ПодписантРуководитель);
	СтруктураДанныхРуководитель = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтаФорма.НастройкиОтчета.ПодписантГлавбух);
	СтруктураДанныхГлавбух = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);	
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтаФорма.НастройкиОтчета.ПодписантОтКлиента);
	СтруктураДанныхПодписантОтКлиента = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ЭтаФорма.НастройкиОтчета.ПодписантОтКлиента);
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", СтруктураДанныхРуководитель);
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", СтруктураДанныхГлавбух);
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", СтруктураДанныхПодписантОтКлиента);
		
	КомандаСформироватьНаСервере();
	
	Если НастройкиОтчета.ПечатьАкта Тогда 
		РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Акт);
	Иначе 	
		РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	Конецесли;	
	
КонецПроцедуры

