
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НастройкиОтбора = Новый Структура;
	НастройкиОтбора.Вставить("Организация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	НастройкиОтбора.Вставить("Субъект", ПараметрКоманды);

	ПараметрыФормы = Новый Структура("Отбор", НастройкиОтбора);

	ОткрытьФорму("Справочник.СертификатыКлючейЭЦП.ФормаСписка",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	
КонецПроцедуры
