
Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	Если НЕ ЭтотОбъект.ОтложенноеИсполнение Тогда
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
		
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("Брокер",                       	ЭтотОбъект.Брокер);
		ЭлементБлокировкиДанных.УстановитьЗначение("МестоХранения",                 ЭтотОбъект.МестоХранения);
		
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет", ЭтотОбъект.РасчетныйСчетКонтрвалюты);
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет", ЭтотОбъект.РасчетныйСчет);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ТипСделки = Перечисления.ТипыСделокСВалютой.Конверсионная
		И ЗначениеЗаполнено(ЭтотОбъект.Основание)
		И ЭтотОбъект.Основание.ТипСделки = Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
		
		// задолженность по д/с
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствам");
		ЭлементБлокировкиДанных.УстановитьЗначение("Основание",        ЭтотОбъект.Основание);
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности", Справочники.ВидыЗадолженности.ПоФорвардуПоставки);
		
	КонецЕсли;
	
	Если БлокировкаДанных.Количество() > 0 Тогда
		БлокировкаДанных.Заблокировать();
	КонецЕсли;
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиДенежныхСредств.Записывать           	= Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать	= Истина;
	Движения.РасходыПоСделке.Записывать						= Истина;
	Движения.УсловияСделокСВалютой.Записывать				= Истина;
	
	Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		РасчетныйСчетОткуда = ЭтотОбъект.РасчетныйСчетКонтрвалюты;
		РасчетныйСчетКуда   = ЭтотОбъект.РасчетныйСчет;
		ВалютаОткуда        = ЭтотОбъект.Контрвалюта;
		ВалютаКуда          = ЭтотОбъект.Валюта;
		СуммаРасхода        = ЭтотОбъект.СуммаКонтрвалюты;
		СуммаПрихода        = ЭтотОбъект.Сумма;
	ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		РасчетныйСчетОткуда = ЭтотОбъект.РасчетныйСчет;
		РасчетныйСчетКуда   = ЭтотОбъект.РасчетныйСчетКонтрвалюты;
		ВалютаОткуда        = ЭтотОбъект.Валюта;
		ВалютаКуда          = ЭтотОбъект.Контрвалюта;
		СуммаРасхода        = ЭтотОбъект.Сумма;
		СуммаПрихода        = ЭтотОбъект.СуммаКонтрвалюты;
	КонецЕсли;
	
	// Задолженности по ДС по форвардным сделкам
	Если ТипСделки = Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
		// задолженности по д/с
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
		Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоФорвардуПоставки;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Контрагент                   = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
		Движение.Валюта                       = ВалютаОткуда;
		Движение.Сумма                        = СуммаРасхода;
		
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
		Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоФорвардуПоставки;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Контрагент                   = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
		Движение.Валюта                       = ВалютаКуда;
		Движение.Сумма                        = СуммаПрихода;
		
	ИначеЕсли ТипСделки = Перечисления.ТипыСделокСВалютой.Конверсионная
		И ЗначениеЗаполнено(Основание)
		И Основание.ТипСделки = Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
		
		// задолженности по д/с
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Основание;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
		Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоФорвардуПоставки;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Контрагент                   = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
		Движение.Валюта                       = ВалютаОткуда;
		Движение.Сумма                        = СуммаРасхода;
		
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Основание;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
		Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоФорвардуПоставки;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Контрагент                   = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
		Движение.Валюта                       = ВалютаКуда;
		Движение.Сумма                        = СуммаПрихода;
	КонецЕсли;
	
	// Задолженность по комиссии добавляем всегда, но для неотложенного исполнения тут же гасим ее (1F: 184326)
	Если ЭтотОбъект.СуммаКомиссии > 0 Тогда
		
		ЗадолженностьПоКомиссии = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		ЗадолженностьПоКомиссии.Период                       = ЭтотОбъект.Дата;
		ЗадолженностьПоКомиссии.Основание                    = ЭтотОбъект.Ссылка;
		ЗадолженностьПоКомиссии.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
		Если ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда
			ВидЗадолженностиПоКомиссии = Справочники.ВидыЗадолженности.КомиссияБанкаБанкКлиентИРКО;
			ЗадолженностьПоКомиссии.ВидЗадолженности = ВидЗадолженностиПоКомиссии;
			ЗадолженностьПоКомиссии.Контрагент       = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
		Иначе
			ВидЗадолженностиПоКомиссии = Справочники.ВидыЗадолженности.ПоТорговойКомиссии;
			ЗадолженностьПоКомиссии.ВидЗадолженности = ВидЗадолженностиПоКомиссии;
			ЗадолженностьПоКомиссии.Контрагент		  = ЭтотОбъект.Брокер.ЮрФизЛицо;
		КонецЕсли; 
		ЗадолженностьПоКомиссии.Организация                  = ЭтотОбъект.Организация;
		ЗадолженностьПоКомиссии.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		ЗадолженностьПоКомиссии.Валюта                       = ЭтотОбъект.ВалютаКомиссии;
		ЗадолженностьПоКомиссии.Сумма                        = ЭтотОбъект.СуммаКомиссии;
		
		
		// комиссия
		Если НЕ ЭтотОбъект.ОтложеннаяОплатаКомиссии Тогда
			Движение = Движения.ОстаткиДенежныхСредств.ДобавитьРасход();
			Движение.Период                         = ЭтотОбъект.Дата;
			Движение.Организация                    = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления   = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Брокер                         = ЭтотОбъект.Брокер;
			Движение.МестоХранения                  = ЭтотОбъект.МестоХранения;
			Движение.РасчетныйСчет                  = РасчетныйСчетОткуда;
			Движение.Валюта                         = ЭтотОбъект.ВалютаКомиссии;
			Движение.Сумма                          = ЭтотОбъект.СуммаКомиссии;
			Движение.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.Оплата;
			Движение.ВариантДвиженияДенежныхСредств = ВидЗадолженностиПоКомиссии;
			
			// Для неотложенного исполнения гасим задолженность (1F: 184326)
			ЗаполнитьЗначенияСвойств(Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход(), ЗадолженностьПоКомиссии, , "ВидДвижения");
		КонецЕсли;
		
		//Считаем что торговая комиссия у ПИФ проходит по прочим резервам
		ПрочиеРезервыПИФНачисляетсяВУчете = БухгалтерскийУчет.РезервПИФНачисляетсяВУчете(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.Резервы.ПрочиеВозмещаемыеРасходыУправляющего);
		Если ПрочиеРезервыПИФНачисляетсяВУчете и ЭтотОбъект.СуммаКомиссии>0 Тогда 

			АналитикаКомисии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
				Дата, 
				Организация, 
				СчетДоверительногоУправления,
				ВидЗадолженностиПоКомиссии,
				Перечисления.ВидыУчета.БухгалтерскийУчет,
				"Аналитика");
				
			Если ЗначениеЗаполнено(АналитикаКомисии) Тогда	
					
				РезервПоРасходу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АналитикаКомисии, "Резерв");
				Если ЗначениеЗаполнено(РезервПоРасходу) Тогда		
					Движение = Движения.РезервыПИФ.ДобавитьРасход();
					
					Движение.Период      = ЭтотОбъект.Дата;
					Движение.Организация = ЭтотОбъект.Организация;
					Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
					Движение.Резерв = РезервПоРасходу;
					
					ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета");
					Если ЭтотОбъект.ВалютаКомиссии <> ВалютаУчета Тогда 
						СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКомиссии, ЭтотОбъект.ВалютаКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
						Движение.Валюта = ВалютаУчета;
					Иначе
					    СуммаОперации = ЭтотОбъект.СуммаКомиссии;
						Движение.Валюта = ЭтотОбъект.ВалютаКомиссии;
					КонецЕсли;
								
					Движение.Сумма  = СуммаОперации;
										
				КонецЕсли;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана аналитика торговой комиссии по бухучету! Списание резервов невозможно!", ЭтотОбъект.Ссылка,,, Отказ);
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Не ОтложенноеИсполнение Тогда
		// остатки д/с
		Движение = Движения.ОстаткиДенежныхСредств.ДобавитьРасход();
		Движение.Период                         = ЭтотОбъект.Дата;
		Движение.Организация                    = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления   = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Брокер                         = ЭтотОбъект.Брокер;
		Движение.МестоХранения                  = ЭтотОбъект.МестоХранения;
		Движение.РасчетныйСчет                  = РасчетныйСчетОткуда;
		Движение.Валюта                         = ВалютаОткуда;
		Движение.Сумма                          = СуммаРасхода;
		Движение.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.Оплата;
		Движение.ВариантДвиженияДенежныхСредств = Справочники.ВидыЗадолженности.ПоСделке;
		
		Движение = Движения.ОстаткиДенежныхСредств.ДобавитьПриход();
		Движение.Период                         = ЭтотОбъект.Дата;
		Движение.Организация                    = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления   = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Брокер                         = ЭтотОбъект.Брокер;
		Движение.МестоХранения                  = ЭтотОбъект.МестоХранения;
		Движение.РасчетныйСчет                  = РасчетныйСчетКуда;
		Движение.Валюта                         = ВалютаКуда;
		Движение.Сумма                          = СуммаПрихода;
		Движение.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.Оплата;
		Движение.ВариантДвиженияДенежныхСредств = Справочники.ВидыЗадолженности.ПоСделке;
		
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредств(ЭтотОбъект, Отказ);
		
	Иначе
		
		Если ТипСделки <> Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
			// задолженности по д/с
			Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Основание                    = ЭтотОбъект.Ссылка;
			Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоСделке;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Контрагент                   = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
			Движение.Валюта                       = ВалютаОткуда;
			Движение.Сумма                        = СуммаРасхода;
			
			Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Основание                    = ЭтотОбъект.Ссылка;
			Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоСделке;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Контрагент                   = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
			Движение.Валюта                       = ВалютаКуда;
			Движение.Сумма                        = СуммаПрихода;
		КонецЕсли;
		
	КонецЕсли;
	
	//Расходы по сделке
	Если ЭтотОбъект.СуммаКомиссии > 0 Тогда
		Движение = Движения.РасходыПоСделке.Добавить();
		Движение.Период							= ЭтотОбъект.Дата;
		Движение.Организация					= ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Сделка							= ЭтотОбъект.Ссылка;
		Движение.ВидЗадолженности				= ?(ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок, Справочники.ВидыЗадолженности.ПоБанковскойКомиссии, Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
		Движение.Валюта							= ЭтотОбъект.ВалютаКомиссии;
		Движение.Сумма							= ЭтотОбъект.СуммаКомиссии;
	КонецЕсли;
	
	Движение = Движения.УсловияСделокСВалютой.Добавить();
	Движение.Период 						= ЭтотОбъект.Дата;
	Движение.Организация 					= ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
	Движение.СделкаСВалютой 				= ЭтотОбъект.Ссылка;
	Движение.Отменено 						= Ложь;
	Движение.РасчетныйСчет 					= ЭтотОбъект.РасчетныйСчет;
	Движение.РасчетныйСчетКонтрвалюты 		= ЭтотОбъект.РасчетныйСчетКонтрвалюты;
	Движение.Валюта 						= ЭтотОбъект.Валюта;
	Движение.Контрвалюта 					= ЭтотОбъект.Контрвалюта;
	Движение.Курс 							= ЭтотОбъект.Курс;
	Движение.Сумма 							= ЭтотОбъект.Сумма;
	Движение.СуммаКонтрвалюты 				= ЭтотОбъект.СуммаКонтрвалюты;
	Движение.ДатаИсполнения 				= ЭтотОбъект.ДатаИсполнения;
	
	РегистрыСведений.ПлановыеДатыОплат.СформироватьДвижения(ЭтотОбъект);
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Если ТипСделки = Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета");
	
	Если ЭтотОбъект.Валюта <> ВалютаУчета
		И ЭтотОбъект.Контрвалюта <> ВалютаУчета Тогда // Валюта за валюту
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Покупка валюты за валюту не реализована!",ЭтотОбъект.Ссылка,,,Отказ);
		Возврат;
	
	КонецЕсли;
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
		Контрагент = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;	
	Иначе
		Контрагент = ЭтотОбъект.Брокер.ЮрФизЛицо;
	КонецЕсли;
	КонтрагентЯвляетсяРезидентом = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Контрагент, ЭтотОбъект.Организация);	
	
	Если ЭтотОбъект.Валюта = ВалютаУчета Тогда
		
		СуммаСделки = ЭтотОбъект.СуммаКонтрвалюты;
		СуммаСделкиВВалютеУчета = ЭтотОбъект.Сумма;
		СуммаПокрытия = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКонтрвалюты, ЭтотОбъект.Контрвалюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
	ИначеЕсли ЭтотОбъект.Контрвалюта = ВалютаУчета Тогда
		
		СуммаСделки = ЭтотОбъект.Сумма;
		СуммаСделкиВВалютеУчета = ЭтотОбъект.СуммаКонтрвалюты;
		СуммаПокрытия = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
	КонецЕсли;
	
	Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
		
		СчетДС = ПланыСчетов.Единый.РасчетныеСчета01;
		Если НЕ Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк, Дата) Тогда
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		
		ВидСубконтоВалюты = ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета;
		СубконтоВалюты = ЭтотОбъект.РасчетныйСчет;
		
		ВидСубконтоКонтрВалюты = ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета;
		СубконтоКонтрВалюты = ЭтотОбъект.РасчетныйСчетКонтрвалюты;
		
	Иначе
		
		СчетДС = ПланыСчетов.Единый.РасчетыСБрокерами02;
		
		ВидСубконтоВалюты = ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
		СубконтоВалюты = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
		
		ВидСубконтоКонтрВалюты = ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
		СубконтоКонтрВалюты = СубконтоВалюты;
		
	КонецЕсли;
	
	// комиссия
	Если НЕ ЭтотОбъект.ОтложеннаяОплатаКомиссии И ЭтотОбъект.СуммаКомиссии <> 0 Тогда
		
		СчетРасходов = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;
		АналитикаРасходов = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53105");
		
		ГФУ = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления,
			Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
			Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
			"Аналитика",
			Ложь);
			
		Если ГФУ <> Неопределено Тогда
			
			Если СокрЛП(ГФУ.НомерСчетаБухгалтерскогоУчета) = "71512" Тогда
			
				СчетРасходов = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
				
				Если ЭтотОбъект.Валюта = ВалютаУчета Тогда
					АналитикаРасходов = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(ПланыСчетов.Единый.ДоходыРасходыОтОпераций12, ЭтотОбъект.Контрвалюта, Истина);
				Иначе
					АналитикаРасходов = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(ПланыСчетов.Единый.ДоходыРасходыОтОпераций12, ЭтотОбъект.Валюта, Истина);
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;			
		
		СуммаКомиссииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКомиссии, ЭтотОбъект.ВалютаКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаКомиссииВВалютеУчета, "Списание комиссии");
		
		Проводка.СчетДт 											= СчетРасходов;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов 	= АналитикаРасходов;
		
		Проводка.СчетКт 									= СчетДС;
		
		Проводка.СубконтоКт[ВидСубконтоВалюты] = СубконтоВалюты;
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка;
		Иначе
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа;
		КонецЕсли;
		
		Проводка.ВалютаКт  			= ЭтотОбъект.ВалютаКомиссии;
		Проводка.ВалютнаяСуммаКт 	= ЭтотОбъект.СуммаКомиссии;
		
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаКомиссииВВалютеУчета, "Закрытие расходов");
			
			Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
			
			Проводка.СчетКт 											= СчетРасходов;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов 	= АналитикаРасходов;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтложенноеИсполнение Тогда
		
		Если (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка И ЭтотОбъект.Контрвалюта = ВалютаУчета) // купили за рубли валюту
			ИЛИ (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа И ЭтотОбъект.Валюта = ВалютаУчета)	// продали за валюту рубли
			Тогда
			
			// Требование по поставке валюты
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета, "Отражены требования по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
			
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаДт        = ЭтотОбъект.Валюта;
			Иначе
			    Проводка.ВалютаДт        = ЭтотОбъект.Контрвалюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаДт = СуммаСделки;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			
			// Обязательство по поставке рублей
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета, "Отражены обязательства по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			
			// кредит
			Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
			Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
			
			Проводка.ВалютаКт = ВалютаУчета;
			Проводка.ВалютнаяСуммаКт = СуммаСделкиВВалютеУчета;
			
			Если СуммаПокрытия > СуммаСделкиВВалютеУчета Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаПокрытия - СуммаСделкиВВалютеУчета, "Отражены требования по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
				
				Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
				
				Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
					Проводка.ВалютаДт        = ЭтотОбъект.Валюта;
				Иначе
				    Проводка.ВалютаДт        = ЭтотОбъект.Контрвалюта;
				КонецЕсли;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
			ИначеЕсли СуммаПокрытия < СуммаСделкиВВалютеУчета Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета - СуммаПокрытия, "Отражены требования по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
				// кредит
				Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
				
				Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
				
				Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
					Проводка.ВалютаКт        = ЭтотОбъект.Валюта;
				Иначе
				    Проводка.ВалютаКт        = ЭтотОбъект.Контрвалюта;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа И ЭтотОбъект.Контрвалюта = ВалютаУчета) // продали за рубли валюту
			ИЛИ (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка И ЭтотОбъект.Валюта = ВалютаУчета)	// купли за валюту рубли
			Тогда 
			
			// Требование по поставке рублей
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета, "Отражены требования по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
			
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			
			Проводка.ВалютаДт        = ВалютаУчета;
			Проводка.ВалютнаяСуммаДт = СуммаСделкиВВалютеУчета;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			
			
			// Обязательство по поставке валюты
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета, "Отражены обязательства по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			
			// кредит
			Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
			Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
			
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаКт        = ЭтотОбъект.Контрвалюта;
			Иначе
			    Проводка.ВалютаКт        = ЭтотОбъект.Валюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаКт = СуммаСделки;
			
			Если СуммаПокрытия > СуммаСделкиВВалютеУчета Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаПокрытия - СуммаСделкиВВалютеУчета, "Отражены обязательства по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				// кредит
				Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
				Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
				
				Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
					Проводка.ВалютаКт        = ЭтотОбъект.Контрвалюта;
				Иначе
				    Проводка.ВалютаКт        = ЭтотОбъект.Валюта;
				КонецЕсли;
				
			ИначеЕсли СуммаПокрытия < СуммаСделкиВВалютеУчета Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета - СуммаПокрытия, "Отражены обязательства по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
				Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
				
				Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
					Проводка.ВалютаДт        = ЭтотОбъект.Контрвалюта;
				Иначе
				    Проводка.ВалютаДт        = ЭтотОбъект.Валюта;
				КонецЕсли;
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета, "Сделка с валютой");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоДт.Контрагенты = Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.ВалютаДт = ЭтотОбъект.Валюта;
			Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		Иначе
			Проводка.ВалютаДт = ЭтотОбъект.Контрвалюта;
			Проводка.ВалютнаяСуммаДт = ЭтотОбъект.СуммаКонтрвалюты;
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.ВалютаКт = ЭтотОбъект.Контрвалюта;
			Проводка.ВалютнаяСуммаКт = ЭтотОбъект.СуммаКонтрвалюты;
		Иначе
			Проводка.ВалютаКт = ЭтотОбъект.Валюта;
			Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
		КонецЕсли;
		
		Если (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка И ЭтотОбъект.Контрвалюта = ВалютаУчета) // купили за рубли валюту
			ИЛИ (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа И ЭтотОбъект.Валюта = ВалютаУчета)	// продали за валюту рубли
			Тогда
			
			// проводка поступления валюты
			// Дт - СчетДС (30602 брокер или 20501 банк) Кт 47408 Сумма по курсу - СуммаПокрытия
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаПокрытия, "Сделка с валютой");
			
			Проводка.СчетДт = СчетДС;
			Проводка.СубконтоДт[ВидСубконтоВалюты] = СубконтоВалюты;
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаДт        = ЭтотОбъект.Валюта;
			Иначе
			    Проводка.ВалютаДт        = ЭтотОбъект.Контрвалюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаДт = СуммаСделки;
			
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаКт = ЭтотОбъект.Валюта;
			Иначе
				Проводка.ВалютаКт = ЭтотОбъект.Контрвалюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаКт = СуммаСделки;
			
			// проводка ухода рублей
			// Дт 47407 Кт - СчетДС (30602 брокер или 20501 банк) Сумма по сделке - СуммаСделкиВВалютеУчета
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета, "Сделка с валютой");
			
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаДт = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаДт = ЭтотОбъект.Валюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаДт = СуммаСделкиВВалютеУчета;
			
			Проводка.СчетКт = СчетДС;
			Проводка.СубконтоКт[ВидСубконтоВалюты] = СубконтоВалюты;
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			    Проводка.ВалютаКт        = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаКт        = ЭтотОбъект.Валюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаКт = СуммаСделкиВВалютеУчета;
			
			СуммаДохода = СуммаПокрытия - СуммаСделкиВВалютеУчета;
			СчетРасчетов = ПланыСчетов.Единый.Расчеты08;
			
		ИначеЕсли (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа И ЭтотОбъект.Контрвалюта = ВалютаУчета) // продали за рубли валюту
			ИЛИ (ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка И ЭтотОбъект.Валюта = ВалютаУчета)	// купли за валюту рубли
			Тогда 
			
			// проводка поступления рублей
			// Дт - СчетДС (30602 брокер или 20501 банк) Кт 47408 Сумма по курсу - СуммаСделкиВВалютеУчета
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиВВалютеУчета, "Сделка с валютой");
			
			Проводка.СчетДт = СчетДС;
			Проводка.СубконтоДт[ВидСубконтоВалюты] = СубконтоВалюты;
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаДт        = ЭтотОбъект.Валюта;
			Иначе
			    Проводка.ВалютаДт        = ЭтотОбъект.Контрвалюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаДт = СуммаСделкиВВалютеУчета;
			
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаКт = ЭтотОбъект.Валюта;
			Иначе
				Проводка.ВалютаКт = ЭтотОбъект.Контрвалюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаКт = СуммаСделкиВВалютеУчета;
			
			
			// проводка ухода валюты
			// Дт 47407 Кт - СчетДС (30602 брокер или 20501 банк) Сумма по сделке - СуммаПокрытия
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаПокрытия, "Сделка с валютой");
			
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.ВалютаДт = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаДт = ЭтотОбъект.Валюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаДт = СуммаСделки;
			
			Проводка.СчетКт = СчетДС;
			Проводка.СубконтоКт[ВидСубконтоВалюты] = СубконтоВалюты;
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			    Проводка.ВалютаКт        = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаКт        = ЭтотОбъект.Валюта;
			КонецЕсли;
			Проводка.ВалютнаяСуммаКт = СуммаСделки;
			
			СуммаДохода = СуммаСделкиВВалютеУчета - СуммаПокрытия;
			СчетРасчетов = ПланыСчетов.Единый.Расчеты07;
			
		КонецЕсли;
		
		
		Если СуммаДохода > 0 Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаДохода, "Сделка с валютой");
			
			
			Проводка.СчетДт = СчетРасчетов;
			
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			
			Если ЭтотОбъект.Валюта = ВалютаУчета Тогда
				Проводка.ВалютаДт = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаДт = ЭтотОбъект.Валюта;
			КонецЕсли;
			
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			
			ГФУДоходовРасходов = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(ПланыСчетов.Единый.ДоходыРасходыОтОпераций11, Проводка.ВалютаДт, Истина);
			
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУДоходовРасходов;
			
			
			Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
			
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаДохода, "Закрытие доходов");
				
				Проводка.СчетДт 											= ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов 	= ГФУДоходовРасходов;
				
				Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоКт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
				
			КонецЕсли;
			
		ИначеЕсли СуммаДохода < 0 Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -СуммаДохода, "Сделка с валютой");
			
			
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			
			
			Проводка.СчетКт = СчетРасчетов;
			
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			
			Если ЭтотОбъект.Валюта = ВалютаУчета Тогда
				Проводка.ВалютаКт = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаКт = ЭтотОбъект.Валюта;
			КонецЕсли;
			
			ГФУДоходовРасходов = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(ПланыСчетов.Единый.ДоходыРасходыОтОпераций12, Проводка.ВалютаКт, Истина);
			
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУДоходовРасходов;
			
			
			Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
			
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -СуммаДохода, "Закрытие расходов");
				
				Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоДт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
				
				Проводка.СчетКт 											= ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов 	= ГФУДоходовРасходов;
				
			КонецЕсли;
			
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.ПереоценитьВалютныеАктивы(ЭтотОбъект, Отказ);
		//#309798 - нет парных по валютной сделке, не нужно ничего закрывать
		//БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ТипСделки = Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ОтложенноеИсполнение Тогда 
		
		НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);	
		
		СубконтоДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
		
		СчетУчетаВалюты = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.Валюта,
		ЭтотОбъект.Брокер);
		
		СчетУчетаКонтрВалюты = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.Контрвалюта,
		ЭтотОбъект.Брокер);
		
		ОстатокНаСчетеВПути = 0;
		
		ПараметрыПереоценкиВалюты = Новый Структура("УчетныйРегистр", УчетныйРегистр);
		ПараметрыПереоценкиВалюты.Вставить("Счет", 		СчетУчетаВалюты);
		ПараметрыПереоценкиВалюты.Вставить("Валюта", 	ЭтотОбъект.Валюта);
		
		ПараметрыПереоценкиКонтрвалюты = Новый Структура("УчетныйРегистр", УчетныйРегистр);
		ПараметрыПереоценкиКонтрвалюты.Вставить("Счет", 	СчетУчетаКонтрВалюты);
		ПараметрыПереоценкиКонтрвалюты.Вставить("Валюта", 	ЭтотОбъект.Контрвалюта);
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			
			// ----------- ПРИХОД -----------
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				СуммаОперации = ЭтотОбъект.Сумма;
			Иначе
				СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаОперации, "Сделка с валютой");
			
			// дебет	
			Проводка.СчетДт = СчетУчетаВалюты;
			
			Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
				Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда 
					Проводка.СубконтоДт.БанковскиеСчета                 = ЭтотОбъект.РасчетныйСчет;
					ПараметрыПереоценкиВалюты.Вставить("БанковскиеСчета", Проводка.СубконтоДт.БанковскиеСчета);
				КонецЕсли;	
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
				Проводка.СубконтоДт.БрокерскиеКомпании              = ЭтотОбъект.Брокер;
				ПараметрыПереоценкиВалюты.Вставить("БрокерскиеКомпании", Проводка.СубконтоДт.БрокерскиеКомпании);
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				ПараметрыПереоценкиВалюты.Вставить("ДоговорыБрокерскогоОбслуживания", Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания);
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
				Проводка.СубконтоДт.ВидДвиженияДенежныхСредств              = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
				ПараметрыПереоценкиВалюты.Вставить("ВидДвиженияДенежныхСредств", Проводка.СубконтоДт.ВидДвиженияДенежныхСредств);
			КонецЕсли;
						
			Если ЭтотОбъект.Валюта <> ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаДт        = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
			КонецЕсли;
			
			// кредит	
			Проводка.СчетКт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаКт  = ЭтотОбъект.Контрвалюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.СуммаКонтрвалюты;
			Иначе
				Проводка.ВалютаКт  = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
			КонецЕсли;
			
			ОстатокНаСчетеВПути = ОстатокНаСчетеВПути - СуммаОперации;
			
			// ----------- РАСХОД -----------
			Если ЭтотОбъект.Контрвалюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				СуммаОперации = ЭтотОбъект.СуммаКонтрвалюты;
			Иначе
				СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКонтрвалюты, ЭтотОбъект.Контрвалюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаОперации, "Сделка с валютой");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаДт  = ЭтотОбъект.Контрвалюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.СуммаКонтрвалюты;
			Иначе
				Проводка.ВалютаДт  = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
			КонецЕсли;
			
			// кредит	
			Проводка.СчетКт = СчетУчетаКонтрВалюты;
			
			Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда 
					Проводка.СубконтоКт.БанковскиеСчета                 = ЭтотОбъект.РасчетныйСчетКонтрвалюты;
					ПараметрыПереоценкиКонтрвалюты.Вставить("БанковскиеСчета", Проводка.СубконтоКт.БанковскиеСчета);
				КонецЕсли;	
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
				Проводка.СубконтоКт.БрокерскиеКомпании              = ЭтотОбъект.Брокер;
				ПараметрыПереоценкиКонтрвалюты.Вставить("БрокерскиеКомпании", Проводка.СубконтоКт.БрокерскиеКомпании);
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				ПараметрыПереоценкиКонтрвалюты.Вставить("ДоговорыБрокерскогоОбслуживания", Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания);
			КонецЕсли;
			
			Если ЭтотОбъект.Контрвалюта <> ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаКт        = ЭтотОбъект.Контрвалюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.СуммаКонтрвалюты;
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств              = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
				ПараметрыПереоценкиКонтрвалюты.Вставить("ВидДвиженияДенежныхСредств", Проводка.СубконтоКт.ВидДвиженияДенежныхСредств);
			КонецЕсли;
			
			ОстатокНаСчетеВПути = ОстатокНаСчетеВПути + СуммаОперации;
			
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			// ----------- ПРИХОД -----------
			Если ЭтотОбъект.Контрвалюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				СуммаОперации = ЭтотОбъект.СуммаКонтрвалюты;
			Иначе
				СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКонтрвалюты, ЭтотОбъект.Контрвалюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаОперации, "Сделка с валютой");
			
			// дебет	
			Проводка.СчетДт = СчетУчетаКонтрВалюты;
			
			Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
				Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
					Проводка.СубконтоДт.БанковскиеСчета                 = ЭтотОбъект.РасчетныйСчетКонтрвалюты;
					ПараметрыПереоценкиКонтрвалюты.Вставить("БанковскиеСчета", Проводка.СубконтоДт.БанковскиеСчета);
				КонецЕсли;	
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
				Проводка.СубконтоДт.БрокерскиеКомпании              = ЭтотОбъект.Брокер;
				ПараметрыПереоценкиКонтрвалюты.Вставить("БрокерскиеКомпании", Проводка.СубконтоДт.БрокерскиеКомпании);
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				ПараметрыПереоценкиКонтрвалюты.Вставить("ДоговорыБрокерскогоОбслуживания", Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания);
			КонецЕсли;			
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
				Проводка.СубконтоДт.ВидДвиженияДенежныхСредств              = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
				ПараметрыПереоценкиКонтрвалюты.Вставить("ВидДвиженияДенежныхСредств", Проводка.СубконтоДт.ВидДвиженияДенежныхСредств);
			КонецЕсли;			
			
			Если ЭтотОбъект.Контрвалюта <> ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаДт        = ЭтотОбъект.Контрвалюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.СуммаКонтрвалюты;
			КонецЕсли;
			
			// кредит	
			Проводка.СчетКт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаКт  = ЭтотОбъект.Контрвалюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.СуммаКонтрвалюты;
			Иначе
				Проводка.ВалютаКт  = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
			КонецЕсли;
			
			ОстатокНаСчетеВПути = ОстатокНаСчетеВПути - СуммаОперации;
			
			
			// ----------- РАСХОД -----------
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				СуммаОперации = ЭтотОбъект.Сумма;
			Иначе
				СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаОперации, "Сделка с валютой");
			
			// дебет	
			Проводка.СчетДт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаДт  = ЭтотОбъект.Контрвалюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.СуммаКонтрвалюты;
			Иначе
				Проводка.ВалютаДт  = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
			КонецЕсли;
			
			// кредит	
			Проводка.СчетКт = СчетУчетаВалюты;
			
			Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
					Проводка.СубконтоКт.БанковскиеСчета                 = ЭтотОбъект.РасчетныйСчет;
					ПараметрыПереоценкиВалюты.Вставить("БанковскиеСчета", Проводка.СубконтоКт.БанковскиеСчета);
				КонецЕсли;	
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
				Проводка.СубконтоКт.БрокерскиеКомпании              = ЭтотОбъект.Брокер;
				ПараметрыПереоценкиВалюты.Вставить("БрокерскиеКомпании", Проводка.СубконтоКт.БрокерскиеКомпании);
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				ПараметрыПереоценкиВалюты.Вставить("ДоговорыБрокерскогоОбслуживания", Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания);
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств              = Справочники.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация;
				ПараметрыПереоценкиВалюты.Вставить("ВидДвиженияДенежныхСредств", Проводка.СубконтоКт.ВидДвиженияДенежныхСредств);
			КонецЕсли;	
						
			Если ЭтотОбъект.Валюта <> ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаКт        = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
			КонецЕсли;
			
			ОстатокНаСчетеВПути = ОстатокНаСчетеВПути + СуммаОперации;
			
		КонецЕсли;
		
		Если ЭтотОбъект.Валюта <> ЭтотОбъект.Организация.ВалютаУчета Тогда
			БухгалтерскийУчет.ПереоценитьВалютныйСчет(ЭтотОбъект, ПараметрыПереоценкиВалюты, ВидГраницы.Исключая, НастройкиУчетаОбщие, УчетныйРегистр, Отказ);	
		КонецЕсли;
		
		Если ЭтотОбъект.Контрвалюта <> ЭтотОбъект.Организация.ВалютаУчета Тогда
			БухгалтерскийУчет.ПереоценитьВалютныйСчет(ЭтотОбъект, ПараметрыПереоценкиКонтрвалюты, ВидГраницы.Исключая, НастройкиУчетаОбщие, УчетныйРегистр, Отказ);	
		КонецЕсли;
		
		Если ОстатокНаСчетеВПути < 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], -ОстатокНаСчетеВПути, "Курсовая разница");
			
			Проводка.СчетДт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаДт = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаДт = ЭтотОбъект.Валюта;
			КонецЕсли;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Если ЗначениеЗаполнено(ЭтотОбъект.Брокер) Тогда
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаОбщие.АналитикаПерекурсовкиСделокСВалютойЧерезБрокера;
			Иначе
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаОбщие.АналитикаПерекурсовкиСделокСВалютой;
			КонецЕсли;
			
		Иначе
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ОстатокНаСчетеВПути, "Курсовая разница");
			
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Если ЗначениеЗаполнено(ЭтотОбъект.Брокер) Тогда
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаОбщие.АналитикаПерекурсовкиСделокСВалютойЧерезБрокера;
			Иначе
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаОбщие.АналитикаПерекурсовкиСделокСВалютой;
			КонецЕсли;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
			Если ЭтотОбъект.Валюта = ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютаКт = ЭтотОбъект.Контрвалюта;
			Иначе
				Проводка.ВалютаКт = ЭтотОбъект.Валюта;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;  // НЕ ОтложенноеИсполнение
	
	//РаботаСРегистрамиБухгалтерии.ЗаполнитьСуммуПроводкиВВалютеУчета(Проводка, Перечисления.ДебетКредит.Дебет, Отказ);
	
	// ТОРГОВАЯ КОМИССИЯ
	Если ЭтотОбъект.СуммаКомиссии <> 0 Тогда
		
		// проводки по торговой комиссии
		СчетУчетаКомиссии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления,
			Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
			УчетныйРегистр,
			"СчетУчета");
			
		АналитикаУслуг = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления,
			Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
			УчетныйРегистр,
			"Аналитика");
			
		СуммаТорговойКомиссииВал = ЭтотОбъект.СуммаКомиссии;
		Если ЭтотОбъект.ВалютаКомиссии = ЭтотОбъект.Организация.ВалютаУчета Тогда
			СуммаТорговойКомиссии = ЭтотОбъект.СуммаКомиссии;
		Иначе
			СуммаТорговойКомиссии = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКомиссии, ЭтотОбъект.ВалютаКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		КонецЕсли;
		

		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаТорговойКомиссии, "Поступление услуг");
		
		БухгалтерскийУчет.ЗаполнитьАналитикуРасходов(
			ЭтотОбъект, 
			Проводка.СчетДт, 
			Проводка.СубконтоДт, 
			ПланыСчетов.Основной.ПрочиеРасходы, 
			АналитикаУслуг); 
		
		ЕстьСубконтоКонтрагентыПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);						
		ЕстьСубконтоДоговорыБрокерскогоОбслуживанияПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено);
		ЕстьСубконтоСделка = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено);						
		
		СубконтоДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
		
		Проводка.СчетКт = СчетУчетаКомиссии;
		
		Если СчетУчетаКомиссии.Валютный Тогда
			Проводка.ВалютаКт = ЭтотОбъект.ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт = СуммаТорговойКомиссииВал;
		КонецЕсли;
		
		Если ЕстьСубконтоКонтрагентыПоКомиссии Тогда
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Брокер.ЮрФизЛицо;
		КонецЕсли;
		Если ЕстьСубконтоДоговорыБрокерскогоОбслуживанияПоКомиссии Тогда
			Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
		КонецЕсли;
		Если ЕстьСубконтоСделка Тогда
			Проводка.СубконтоКт.Сделка = ЭтотОбъект.Ссылка;
		КонецЕсли;
		
		Если Не ЭтотОбъект.ОтложеннаяОплатаКомиссии Тогда
			
			// Оплата комиссии
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаТорговойКомиссии, "Списание торговой комиссии");
			
			Проводка.СчетДт = СчетУчетаКомиссии;
			
			Если СчетУчетаКомиссии.Валютный Тогда
				Проводка.ВалютаДт = ЭтотОбъект.ВалютаКомиссии;
				Проводка.ВалютнаяСуммаДт = СуммаТорговойКомиссииВал;
			КонецЕсли;
			
			Если ЕстьСубконтоКонтрагентыПоКомиссии Тогда
				Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Брокер.ЮрФизЛицо;
			КонецЕсли;
			Если ЕстьСубконтоДоговорыБрокерскогоОбслуживанияПоКомиссии Тогда
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
			КонецЕсли;
			Если ЕстьСубконтоСделка Тогда
				Проводка.СубконтоДт.Сделка = ЭтотОбъект.Ссылка;
			КонецЕсли;
			
			СчетУчетаОплатыКомиссии = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
				ЭтотОбъект.Дата,
				ЭтотОбъект.Организация,
				ЭтотОбъект.СчетДоверительногоУправления,
				ЭтотОбъект.ВалютаКомиссии,
				ЭтотОбъект.Брокер);

			Проводка.СчетКт = СчетУчетаОплатыКомиссии;
			
			Если СчетУчетаОплатыКомиссии.Валютный Тогда
				Проводка.ВалютаКт = ЭтотОбъект.ВалютаКомиссии;
				Проводка.ВалютнаяСуммаКт = СуммаТорговойКомиссииВал;
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
				Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
				Проводка.СубконтоКт.БрокерскиеКомпании              = ЭтотОбъект.Брокер;
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
				Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
					ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка;
				Иначе
					ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа;
				КонецЕсли;				
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств              = ВидДвиженияДенежныхСредств;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	БухгалтерскийУчет.ПереоценитьВалютныеАктивы(ЭтотОбъект,УчетныйРегистр, Перечисления.ВидыУчета[УчетныйРегистр], НастройкиУчетаОбщие, Отказ);
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "НомерСделки, НомерПодтверждения");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТипСделки = Перечисления.ТипыСделокСВалютой.СвопВтораяЧасть Тогда
		ПроверяемыеРеквизиты.Добавить("Основание");
	КонецЕсли;
	
	Если ЭтотОбъект.ОтложенноеИсполнение Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаИсполнения");
	КонецЕсли;
	
	Если ЭтотОбъект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок") Тогда
		ПроверяемыеРеквизиты.Добавить("НомерСделки");
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.НомерСделки) Тогда
			РаботаСДокументами.ПроверитьУникальностьНомераСделки(ЭтотОбъект, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.НомерСделки) И ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Номер сделки"" заполняется только для биржевых сделок", ЭтотОбъект, "НомерСделки",, Отказ);		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИсполнения) И (НачалоДня(ЭтотОбъект.Дата) > ЭтотОбъект.ДатаИсполнения) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата исполнения по валютной сделке меньше даты сделки", ЭтотОбъект, "ДатаИсполнения",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание)
			И ЭтотОбъект.ТипСделки <> Перечисления.ТипыСделокСВалютой.СвопВтораяЧасть
			И ЭтотОбъект.ТипСделки <> Перечисления.ТипыСделокСВалютой.Конверсионная Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнение основания допустимо только для 2-й части свопа или для исполнения форварда", ЭтотОбъект, "ТипСделки",, Отказ);
		КонецЕсли;
		
		ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(ЭтотОбъект);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ДетализацияПоРасчетномуСчету", ДетализацияПоРасчетномуСчету);
		
		Если ДетализацияПоРасчетномуСчету Тогда
			
			Если Не ЗначениеЗаполнено(РасчетныйСчет) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Расчетный счёт"" не заполнено", ЭтотОбъект, "РасчетныйСчет",, Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(РасчетныйСчетКонтрвалюты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Расчетный счёт контрвалюты"" не заполнено", ЭтотОбъект, "РасчетныйСчетКонтрвалюты",, Отказ);
			КонецЕсли;

			Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.Валюта Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета отличается от валюты сделки", ЭтотОбъект, "РасчетныйСчет",, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.РасчетныйСчетКонтрвалюты.Валюта <> ЭтотОбъект.Контрвалюта Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета контрвалюты отличается от контрвалюты", ЭтотОбъект, "РасчетныйСчетКонтрвалюты",, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтотОбъект.СуммаКомиссии <> 0 Тогда
			Если Не ЗначениеЗаполнено(ВалютаКомиссии) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма комиссии задана, а валюта комиссии не указана", ЭтотОбъект, "ВалютаКомиссии",, Отказ);					
			КонецЕсли;
		КонецЕсли; 
		
		Если НЕ ЭтотОбъект.ОтложенноеИсполнение И ЭтотОбъект.ТипСделки = Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для форварда поставочного обязательно отложенное исполнение", ЭтотОбъект, "ОтложенноеИсполнение",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ТипСделки = Перечисления.ТипыСделокСВалютой.Конверсионная И ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
			
			Если ЭтотОбъект.Основание.ТипСделки <> Перечисления.ТипыСделокСВалютой.ФорвардПоставочный Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основанием для конверсионной сделки может быть только форвард поставочный", ЭтотОбъект, "Дата",, Отказ);
			КонецЕсли;
				
			Если ЭтотОбъект.Основание.ДатаИсполнения <> НачалоДня(ЭтотОбъект.Дата) 
				//ТехническийДолг - #296253 - Изменения по форварду
				И ЭтотОбъект.Основание.Номер <> "РПИ-180919/65-9" 
				Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа (" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + ") не соответствует дате исполнения форварда (" + Формат(ЭтотОбъект.Основание.ДатаИсполнения, "ДФ=dd.MM.yyyy") + ")", ЭтотОбъект, "Дата",, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтотОбъект.ТипСделки = Перечисления.ТипыСделокСВалютой.СвопВтораяЧасть И ЗначениеЗаполнено(ЭтотОбъект.Основание)
			И ЭтотОбъект.Основание.ТипСделки <> Перечисления.ТипыСделокСВалютой.СвопПерваяЧасть Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основанием для сделки - второй части свопа может быть только сделка - первая часть свопа", ЭтотОбъект, "Дата",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);	
	
КонецПроцедуры

#КонецОбласти
