
&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
		
	Если Запись.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
		ЭтаФорма.Элементы.ДоговорБрокерскогоОбслуживания.АвтоОтметкаНезаполненного = Ложь;	
	КонецЕсли;

КонецПроцедуры // ПриСозданииЧтенииНаСервере

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СчетаДоверительногоУправления.Обновить", Запись.СчетДоверительногоУправления);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РеквизитФормыВЗначение("Запись").Выбран() Тогда
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

