&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтотОбъект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтотОбъект.Дата = НачалоДня(ТекущаяДата()) - 24 * 60 * 60;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭСПИДенежныйПотокДляОблигации(Облигация, ДанныеПереоценки, ДанныеПокупки) Экспорт

	РассчитыватьЭСПДо = БухгалтерскийУчет.ОпределитьНастройкуУчета(ДанныеПереоценки.Дата, ДанныеПереоценки.Организация, ДанныеПереоценки.СчетДоверительногоУправления, "РассчитыватьЭСПДо");
	
	ДоПогашения = (РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения);
	
	ПараметрыДенежногоПотока = Новый Структура;
	ПараметрыДенежногоПотока.Вставить("ДоДатыПогашения", ДоПогашения);
	ПараметрыДенежногоПотока.Вставить("Дата",			 НачалоДня(ДанныеПереоценки.Дата));
	ПараметрыДенежногоПотока.Вставить("ДатаПереоценки",	 НачалоДня(ДанныеПереоценки.Дата));
	
	ДенежныйПоток = Справочники.Облигации.ПолучитьДенежныйПоток(Облигация, ПараметрыДенежногоПотока, ДанныеПереоценки.СчетДоверительногоУправления);
	
	ДоходностьДюрация = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
							Облигация,
							ДоПогашения,
							ДанныеПокупки.ДатаПокупки,
							ДанныеПокупки.ЦенаПокупки,
							ДанныеПереоценки.СчетДоверительногоУправления,
							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа,
							ЭтаФорма.Дата,
							Истина,
							,
							0.0000000001);
							
	ЭСП = 0;
	Если ТипЗнч(ДоходностьДюрация) = Тип("Структура") Тогда
		ЭСП = ДоходностьДюрация.Доходность;
	КонецЕсли; 

	Возврат Новый Структура("ЭСП, Поток", ЭСП, РаботаСКоллекциями.ТаблицаЗначений_В_МассивСтруктур(ДенежныйПоток, "Дата, Поток"));
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСделкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДУ
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫРАЗИТЬ(РасходыПоСделкеОбороты.СуммаОборот * ЕСТЬNULL(КурсВалютыКомиссия.Курс, 1) / ЕСТЬNULL(КурсВалютыКомиссия.Кратность, 1) * ЕСТЬNULL(КурсВалютыСделка.Кратность, 1) / ЕСТЬNULL(КурсВалютыСделка.Курс, 1) КАК ЧИСЛО(19, 2))) КАК Комиссия,
		|	РасходыПоСделкеОбороты.Сделка КАК Сделка,
		|	РасходыПоСделкеОбороты.ВидЗадолженности КАК ВидЗадолженности
		|ПОМЕСТИТЬ _Комиссии
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			&НачалоВзятияСделокИКомиссий,
		|			&ОкончаниеПериода,
		|			Период,
		|			Организация = &Организация
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И ТИПЗНАЧЕНИЯ(Сделка) = ТИП(Документ.Сделка)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДУ
		|					ИЗ
		|						_СчетаДУ)) КАК РасходыПоСделкеОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыКомиссия
		|		ПО РасходыПоСделкеОбороты.Валюта = КурсВалютыКомиссия.Валюта
		|			И (КурсВалютыКомиссия.Период = &НачалоПериода)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСделка
		|		ПО РасходыПоСделкеОбороты.Сделка.ВалютаСделки = КурсВалютыСделка.Валюта
		|			И (КурсВалютыСделка.Период = &НачалоПериода)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходыПоСделкеОбороты.Сделка,
		|	РасходыПоСделкеОбороты.ВидЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СделкаЦенныеБумаги.Ссылка КАК Сделка,
		|	СделкаЦенныеБумаги.Ссылка.РежимБиржевыхТоргов КАК РежимБиржевыхТоргов,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА РаспределенияАктивовЕПС.УчетныйАктивЕПС ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА НЕ РаспределенияАктивовЕПС.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(_КомиссииТорговые.Комиссия, 0)
		|	КОНЕЦ КАК ТорговаяКомиссия,
		|	ВЫБОР
		|		КОГДА РаспределенияАктивовЕПС.УчетныйАктивЕПС ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА НЕ РаспределенияАктивовЕПС.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(_КомиссииБрокера.Комиссия, 0)
		|	КОНЕЦ КАК КомиссияБрокера,
		|	СделкаЦенныеБумаги.СуммаКупона КАК СуммаКупона,
		|	СделкаЦенныеБумаги.Ссылка.НомерСделки КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.ОтложенноеИсполнение
		|			ТОГДА ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|		ИНАЧЕ СделкаЦенныеБумаги.Ссылка
		|	КОНЕЦ КАК Исполнение,
		|	ЕСТЬNULL(ИсполнениеОбязательствПоСделкеЦенныеБумаги.СтрокаПартии, СделкаЦенныеБумаги.СтрокаПартии) КАК СтрокаПартии,
		|	ЕСТЬNULL(РаспределенияАктивовЕПС.УчетныйАктивЕПС, ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)) КАК УчетныйАктивЕПС
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|		ПО СделкаЦенныеБумаги.Ссылка = РаспределенияАктивовЕПС.Сделка
		|			И СделкаЦенныеБумаги.ЦеннаяБумага = РаспределенияАктивовЕПС.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Комиссии КАК _КомиссииТорговые
		|		ПО СделкаЦенныеБумаги.Ссылка = _КомиссииТорговые.Сделка
		|			И (_КомиссииТорговые.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Комиссии КАК _КомиссииБрокера
		|		ПО СделкаЦенныеБумаги.Ссылка = _КомиссииБрокера.Сделка
		|			И (_КомиссииБрокера.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО СделкаЦенныеБумаги.Ссылка = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Основание
		|			И СделкаЦенныеБумаги.СтрокаПартии = ИсполнениеОбязательствПоСделкеЦенныеБумаги.СтрокаПартии
		|			И (НЕ ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.ПометкаУдаления)
		|ГДЕ
		|	(НЕ СделкаЦенныеБумаги.Ссылка.ОтложенноеИсполнение
		|				И (СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ИЛИ СделкаЦенныеБумаги.Ссылка.ОтложенноеИсполнение
		|				И СделкаЦенныеБумаги.Ссылка.ДатаИсполнения = &НачалоПериода)
		|	И СделкаЦенныеБумаги.ЦеннаяБумага = &ЦеннаяБумага
		|	И СделкаЦенныеБумаги.Ссылка.Проведен
		|	И СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДУ.СчетДУ
		|			ИЗ
		|				_СчетаДУ)";
	
	Запрос.УстановитьПараметр("НачалоВзятияСделокИКомиссий", НачалоДня(ЭтаФорма.Дата) - 10 * 24 * 60 * 60);
	Запрос.УстановитьПараметр("Клиент", ЭтаФорма.Клиент);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтаФорма.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтаФорма.Дата));
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтаФорма.Облигация);
	
	ЭтаФорма.Сделки.Загрузить(Запрос.Выполнить().Выгрузить());

	ДанныеПереоценки = Новый Структура("Дата, Организация", ЭтаФорма.Дата, ЭтаФорма.Организация);
	ДанныеПокупки = Новый Структура("ДатаПокупки", ЭтаФорма.Дата);
	
	Для каждого СтрокаСделки Из ЭтаФорма.Сделки Цикл
		
		Если СтрокаСделки.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
			СтрокаСделки.УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ЭтаФорма.Дата, Перечисления.РынкиЦенныхБумаг.Облигации, ЭтаФорма.Облигация, СтрокаСделки.СчетДоверительногоУправления);
		КонецЕсли;
		
		ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СтрокаСделки.СчетДоверительногоУправления);
		
		СтрокаСделки.Итого = СтрокаСделки.Сумма + СтрокаСделки.СуммаКупона + СтрокаСделки.ТорговаяКомиссия + СтрокаСделки.КомиссияБрокера;
		СтрокаСделки.Цена = СтрокаСделки.Итого / СтрокаСделки.Количество;
		
		ЦенаБезКупона = (СтрокаСделки.Сумма + СтрокаСделки.ТорговаяКомиссия + СтрокаСделки.КомиссияБрокера) / СтрокаСделки.Количество;
		ЦенаПокупкиКупона = СтрокаСделки.СуммаКупона / СтрокаСделки.Количество;
		
		ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаБезКупона);
		ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
		
		ЭСППоток = ПолучитьЭСПИДенежныйПотокДляОблигации(ЭтаФорма.Облигация, ДанныеПереоценки, ДанныеПокупки);
			
		СтрокаСделки.ЭСП1с = ЭСППоток.ЭСП;
		
		
		СтрокаСделки.РазрядностьОкругленияЭСП = БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтаФорма.Дата, ЭтаФорма.Организация, СтрокаСделки.СчетДоверительногоУправления, "РазрядностьОкругленияЭСП");
		Если СтрокаСделки.РазрядностьОкругленияЭСП > 0 Тогда
			СтрокаСделки.ЭСП1с = Окр(СтрокаСделки.ЭСП1с, СтрокаСделки.РазрядностьОкругленияЭСП);
		КонецЕсли;
		
		СтрокаСделки.Потоки = Новый ХранилищеЗначения(ЭСППоток.Поток, Новый СжатиеДанных(9));
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(КомандаИмя)
	
	// Фиксируем запуск процедуры
	Механизм = "_РасшифровкаРасчетаЭСП." + КомандаИмя;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Отчет,"", Новый Структура("Дата, Организация, Клиент, Облигация", ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.Клиент, ЭтаФорма.Облигация));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Если КомандаИмя = "ЗаполнитьСделки" Тогда
		ЗаполнитьСделкиНаСервере();
	ИначеЕсли КомандаИмя = "СформироватьОбновитьРегистрации" Тогда
		СформироватьОбновитьРегистрацииНаСервере();
	КонецЕсли;
 
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСделки(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Клиент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен клиент");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Облигация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена облигация");
		Возврат;
	КонецЕсли;
	
	ВыполнитьКомандуНаСервере("ЗаполнитьСделки");
		
КонецПроцедуры

&НаСервере
Функция ИзвлечьПотокиИзХранилища(Хранилище)

	Возврат Хранилище.Получить();

КонецФункции

&НаКлиенте
Процедура ВывестиВExcel(Команда)
	
	ExcelApp = Новый COMОбъект("Excel.Application");
	
	ExcelApp.Application.Workbooks.Add();
	ExcelApp.Sheets.Add();
	
	xlBook = ExcelApp.Application.ActiveWorkbook;
	xlSheet = ExcelApp.Application.ActiveWorkbook.Sheets(1);
	xlSheet.Name = "Данные расчета";
	
	xlSheetR = ExcelApp.Application.ActiveWorkbook.Sheets(2);
	xlSheetR.Name = "Расчеты";
	
	xlSheet.Cells(2, 2).Value = "Счет д/у";
	xlSheet.Cells(2, 3).Value = "Сделка";
	xlSheet.Cells(2, 4).Value = "Режим торгов";
	xlSheet.Cells(2, 5).Value = "Номер сделки";
	xlSheet.Cells(2, 6).Value = "Количество";
	xlSheet.Cells(2, 7).Value = "Торговая комиссия";
	xlSheet.Cells(2, 8).Value = "Комиссия брокера";
	xlSheet.Cells(2, 9).Value = "Сумма";
	xlSheet.Cells(2, 10).Value = "Сумма НКД";
	xlSheet.Cells(2, 11).Value = "Итого";
	xlSheet.Cells(2, 12).Value = "Цена";
	xlSheet.Cells(2, 13).Value = "ЭСП 1с";
	xlSheet.Cells(2, 14).Value = "ЭСП Excel";
	xlSheet.Cells(2, 15).Value = "расхождение";
	
	Инд = 3;
	Для каждого СтрокаСделки Из ЭтаФорма.Сделки Цикл
		
		xlSheet.Cells(Инд, 2).Value = Строка(СтрокаСделки.СчетДоверительногоУправления);
		xlSheet.Cells(Инд, 3).Value = Строка(СтрокаСделки.Сделка);
		xlSheet.Cells(Инд, 4).Value = Строка(СтрокаСделки.РежимБиржевыхТоргов);
		xlSheet.Cells(Инд, 5).Value = СтрокаСделки.НомерСделки;
		xlSheet.Cells(Инд, 6).Value = СтрокаСделки.Количество;
		xlSheet.Cells(Инд, 7).Value = СтрокаСделки.ТорговаяКомиссия;
		xlSheet.Cells(Инд, 8).Value = СтрокаСделки.КомиссияБрокера;
		xlSheet.Cells(Инд, 9).Value = СтрокаСделки.Сумма;
		xlSheet.Cells(Инд, 10).Value = СтрокаСделки.СуммаКупона;
		xlSheet.Cells(Инд, 11).Value = СтрокаСделки.Итого;
		xlSheet.Cells(Инд, 12).Value = СтрокаСделки.Цена;
		xlSheet.Cells(Инд, 13).Value = СтрокаСделки.ЭСП1с / 100;
		xlSheet.Range(xlSheet.Cells(Инд, 13), xlSheet.Cells(Инд, 13)).NumberFormat = "0,0000000000%";
		
		Поток = ИзвлечьПотокиИзХранилища(СтрокаСделки.Потоки);
		
		СмКол = Инд * 3;
		
		xlSheetR.Cells(1, СмКол).Value = "ЭСП:";
		
		xlSheetR.Cells(2, СмКол).Value = "Дата";
		xlSheetR.Cells(2, СмКол + 1).Value = "Сумма";
		
		xlSheetR.Cells(3, СмКол).Value = ЭтаФорма.Дата;
		xlSheetR.Cells(3, СмКол + 1).Value = -СтрокаСделки.Итого;
		
		ИндР = 4;
		Для каждого СтрокаПотока Из Поток Цикл
			xlSheetR.Cells(ИндР, СмКол).Value = СтрокаПотока.Дата;
			xlSheetR.Cells(ИндР, СмКол + 1).Value = СтрокаПотока.Поток * СтрокаСделки.Количество;
			
			ИндР = ИндР + 1;
		КонецЦикла;
		
		КолСумм = СокрЛП(Формат(СмКол + 1, "ЧГ="));
		КолДат = СокрЛП(Формат(СмКол, "ЧГ="));
		СтрПосл = СокрЛП(Формат(ИндР - 2, "ЧГ="));
		
		xlSheetR.Range(xlSheetR.Cells(1, СмКол + 1), xlSheetR.Cells(1, СмКол + 1)).FormulaLocal = "=ЧИСТВНДОХ(R[2]C:R[" + СтрПосл + "]C;R[2]C[-1]:R[" + СтрПосл + "]C[-1])";
		xlSheetR.Range(xlSheetR.Cells(1, СмКол + 1), xlSheetR.Cells(1, СмКол + 1)).NumberFormat = "0,0000000000%";
		
		СтрП = СокрЛП(Формат(Инд, "ЧГ="));
		
		xlSheet.Range(xlSheet.Cells(Инд, 14), xlSheet.Cells(Инд, 14)).FormulaLocal = "=Расчеты!R1C" + КолСумм;
		xlSheet.Range(xlSheet.Cells(Инд, 14), xlSheet.Cells(Инд, 14)).NumberFormat = "0,0000000000%";
		
		xlSheet.Range(xlSheet.Cells(Инд, 15), xlSheet.Cells(Инд, 15)).FormulaLocal = "=ЕСЛИ(RC[-2]=RC[-1];""-"";RC[-2]-RC[-1])";
		xlSheet.Range(xlSheet.Cells(Инд, 15), xlSheet.Cells(Инд, 15)).NumberFormat = "0,0000000000%";
		
		СтрокаСделки.ЭСПExcel = xlSheet.Cells(Инд, 14).Value * 100;
		
		Если СтрокаСделки.РазрядностьОкругленияЭСП > 0 Тогда
			СтрокаСделки.ЭСПExcel = Окр(СтрокаСделки.ЭСПExcel, СтрокаСделки.РазрядностьОкругленияЭСП);
		КонецЕсли;
		
		Инд = Инд + 1;
	КонецЦикла;
	
	xlSheet.Range("B2:O2").Font.Bold = True;
	xlSheet.Columns("B:O").EntireColumn.AutoFit();
	
	ExcelApp.Application.Visible = True;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОбновитьРегистрацииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	Сделки.Исполнение КАК Исполнение,
		|	Сделки.СтрокаПартии КАК СтрокаПартии,
		|	Сделки.ЭСПExcel КАК ЭСПExcel
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	&Сделки КАК Сделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.Ссылка КАК Ссылка,
		|	РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.Партия КАК Партия,
		|	РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.СтрокаПартии КАК СтрокаПартии,
		|	РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.ЭСП КАК ЭСП
		|ПОМЕСТИТЬ _Регистрации
		|ИЗ
		|	Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ЭСП КАК РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.Ссылка.Дата, ДЕНЬ) = &Дата
		|	И НЕ РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.Ссылка.ПометкаУдаления
		|	И РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.Ссылка.Организация = &Организация
		|	И РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.Ссылка.Клиент = &Клиент
		|	И РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагахЭСП.Ссылка.ЦеннаяБумага = &ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _Регистрации.Ссылка ЕСТЬ NULL
		|			ТОГДА 3
		|		КОГДА _Сделки.Исполнение ЕСТЬ NULL
		|			ТОГДА 1
		|		КОГДА _Регистрации.ЭСП <> _Сделки.ЭСПExcel
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Действие,
		|	_Регистрации.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(_Регистрации.УчетныйАктивЕПС, _Сделки.УчетныйАктивЕПС) КАК УчетныйАктивЕПС,
		|	ЕСТЬNULL(_Регистрации.Партия, _Сделки.Исполнение) КАК Партия,
		|	ЕСТЬNULL(_Регистрации.СтрокаПартии, _Сделки.СтрокаПартии) КАК СтрокаПартии,
		|	_Сделки.ЭСПExcel КАК ЭСП
		|ПОМЕСТИТЬ _Объединение
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Регистрации КАК _Регистрации
		|		ПО _Сделки.Исполнение = _Регистрации.Партия
		|			И _Сделки.СтрокаПартии = _Регистрации.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Объединение.Действие КАК Действие,
		|	_Объединение.Ссылка КАК Ссылка,
		|	_Объединение.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_Объединение.Партия КАК Партия,
		|	_Объединение.СтрокаПартии КАК СтрокаПартии,
		|	_Объединение.ЭСП КАК ЭСП,
		|	Истина КАК Используется
		|ИЗ
		|	_Объединение КАК _Объединение
		|ГДЕ
		|	_Объединение.Действие <> 0";
	
	Запрос.УстановитьПараметр("Сделки", ЭтотОбъект.Сделки.Выгрузить());
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Клиент", ЭтотОбъект.Клиент);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.Облигация);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекДокумент = Неопределено;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Действие = 1 Тогда // удалить
		
			ТекДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			СтрокиЭСП = ТекДокумент.ЭСП.НайтиСтроки(Новый Структура("Партия, СтрокаПартии", ВыборкаДетальныеЗаписи.Партия, ВыборкаДетальныеЗаписи.СтрокаПартии));
			Для каждого СтрокаЭСП Из СтрокиЭСП Цикл
				ТекДокумент.ЭСП.Удалить(СтрокаЭСП);
			КонецЦикла;
			
			Попытка
				ТекДокумент.Записать(РежимЗаписиДокумента.Проведение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Из " + Строка(ТекДокумент) + " удалили " + Строка(ВыборкаДетальныеЗаписи.Партия) + "/" + Строка(ВыборкаДетальныеЗаписи.СтрокаПартии));
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ регистрации ЭСП");
			КонецПопытки;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Действие = 2 Тогда // изменить
			
			ТекДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			СтрокиЭСП = ТекДокумент.ЭСП.НайтиСтроки(Новый Структура("Партия, СтрокаПартии", ВыборкаДетальныеЗаписи.Партия, ВыборкаДетальныеЗаписи.СтрокаПартии));
			Для каждого СтрокаЭСП Из СтрокиЭСП Цикл
				СтрокаЭСП.Используется = Истина;
				СтрокаЭСП.ЭСП = ВыборкаДетальныеЗаписи.ЭСП;
			КонецЦикла;
			
			Попытка
				ТекДокумент.Записать(РежимЗаписиДокумента.Проведение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В " + Строка(ТекДокумент) + " для " + Строка(ВыборкаДетальныеЗаписи.Партия) + "/" + Строка(ВыборкаДетальныеЗаписи.СтрокаПартии) + " ЭСП изменился на " + Строка(ВыборкаДетальныеЗаписи.ЭСП));
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ регистрации ЭСП");
			КонецПопытки;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Действие = 3 Тогда // добавить
			
			Если ТекДокумент = Неопределено Тогда
			
				ТекДокумент = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.СоздатьДокумент();
				ТекДокумент.Дата = ЭтотОбъект.Дата + 9 * 60 * 60 + 30 * 60;
				ТекДокумент.ДатаНачалаДействия = ЭтотОбъект.Дата + 24 * 60 * 60;
				ТекДокумент.Клиент = ЭтотОбъект.Клиент;
				ТекДокумент.Организация = ЭтотОбъект.Организация;
				ТекДокумент.Ответственный =  ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");
				ТекДокумент.ТипСведений = "ЭСП";
				ТекДокумент.ЦеннаяБумага = ЭтотОбъект.Облигация;
				
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ТекДокумент.ЭСП.Добавить(), ВыборкаДетальныеЗаписи, "УчетныйАктивЕПС, Партия, СтрокаПартии, ЭСП, Используется");
			
			Попытка
				ТекДокумент.Записать(РежимЗаписиДокумента.Проведение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Добавили " + Строка(ТекДокумент) + ": " + Строка(ВыборкаДетальныеЗаписи.Партия) + "/" + Строка(ВыборкаДетальныеЗаписи.СтрокаПартии) + ", ЭСП: " + Строка(ВыборкаДетальныеЗаписи.ЭСП));
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ регистрации ЭСП");
			КонецПопытки;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОбновитьРегистрации(Команда)
	
	ВыполнитьКомандуНаСервере("СформироватьОбновитьРегистрации");

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЭтаФорма.Клиент = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
	КлиентПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ЭтаФорма.Облигация = ПредопределенноеЗначение("Справочник.Облигации.ПустаяСсылка");
	ОблигацияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОблигацияПриИзменении(Элемент)
	
	ЭтаФорма.Сделки.Очистить();	
	
КонецПроцедуры
