Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Расчёт сценарного анализа",
		"0.6.9",
		"",
		Истина
	);
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
КонецФункции


// Возвращает параметры выполняемой по регламентному заданию команды для подключения к механизму регистрации работы
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды  
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ИдентификаторКоманды, ПараметрыКоманды)
	
	ПараметрыОтчета = Новый Соответствие();
	ПараметрыОтчета.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	ПараметрыОтчета.Вставить("Период", ЭтотОбъект.Период);

	Если ПараметрыКоманды.Свойство("Организация") Тогда
		ПараметрыОтчета.Вставить("Организация", ПараметрыКоманды.Организация);
	КонецЕсли;
	
	Если ПараметрыКоманды.Свойство("ПолучателиОповещения") Тогда
		ПараметрыОтчета.Вставить("ПолучателиОповещения", ПараметрыКоманды.ПолучателиОповещения);
	КонецЕсли;
	
	Описание = "";
	Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		Описание = Описание + ПараметрОтчета.Ключ + ": " + ПараметрОтчета.Значение + Символы.ПС;		
	КонецЦикла;
	Описание = Лев(Описание, СтрДлина(Описание) - СтрДлина(Символы.ПС));	
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета);
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Процедура УстановитьПараметрыСоединенияСSQL() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	// Получение параметров соединения
	ПараметрыСоединения = ВнешниеИсточникиДанных.RiskControl.ПолучитьОбщиеПараметрыСоединения();
	// Изменение строки соединения
	Если ЭтотОбъект.ИспользуемаяБазаДанных = "Рабочая" Тогда
		ПараметрыСоединения.СтрокаСоединения = "Driver={SQL Server};Server=AP18.G1.LAN;Database=ais_warehouse;SCHEMA=AM;";
	ИначеЕсли ЭтотОбъект.ИспользуемаяБазаДанных = "Тестовая" Тогда
		ПараметрыСоединения.СтрокаСоединения = "Driver={SQL Server};Server=AP18.G1.LAN;Database=ais_warehouse_dev;SCHEMA=AM;";
	Иначе
		ВызватьИсключение "Неизвестный вариант используемой базы данных";
	КонецЕсли;
	// Сохранение параметров соединения
	ВнешниеИсточникиДанных.RiskControl.УстановитьПараметрыСоединенияСеанса(ПараметрыСоединения);
	ВнешниеИсточникиДанных.RiskControl.УстановитьСоединение();
КонецПроцедуры

Процедура НачатьСессию() Экспорт
	НоваяСессия = ВнешниеИсточникиДанных.RiskControl.Таблицы.T_Sessions.СоздатьОбъект();
	НоваяСессия.Source = "1С: Внешняя обработка ""Расчёт сценарного анализа""";
	НоваяСессия.Username = ПараметрыСеанса.ТекущийПользователь.Наименование;
	НоваяСессия.Записать();
	ЭтотОбъект.ИдентификаторСессии = НоваяСессия.ID;
КонецПроцедуры

Процедура ЗагрузитьВидыКлиентов() Экспорт
	// Заполнение списка видов клиентов
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	VW_Clients.ClientType КАК Наименование
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.VW_Clients КАК VW_Clients
		|ГДЕ
		|	VW_Clients.ClientType <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	VW_Clients.ClientType
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	#КонецОбласти
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.ВидыКлиентов.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.ВидыКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьКлиентов(СохранятьВыбранные = Истина) Экспорт
	// Сохранение выбранных строк
	ВыбранныеСтроки = Новый Соответствие; // Соответствие(Строка (Ключ таблицы), Истина)
	Если СохранятьВыбранные Тогда
		Для Каждого СтрокаКлиенты Из ЭтотОбъект.Клиенты Цикл
			Если СтрокаКлиенты.Выбрано Тогда
				ВыбранныеСтроки.Вставить(СтрокаКлиенты.Код, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Заполнение списка клиентов
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	VW_Clients.ClientCode КАК Код,
		|	МАКСИМУМ(VW_Clients.ClientName) КАК Наименование,
		|	МАКСИМУМ(VW_Clients.ClientType) КАК Вид
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.VW_Clients КАК VW_Clients
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.RiskControl.Таблица.VW_Assets1C8 КАК VW_Assets1C8
		|		ПО VW_Assets1C8.AssetDate = &AssetDate
		|			И VW_Clients.ClientCode = VW_Assets1C8.ClientCode
		|
		|СГРУППИРОВАТЬ ПО
		|	VW_Clients.ClientCode
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	#КонецОбласти
	Запрос.УстановитьПараметр("AssetDate", ЭтотОбъект.ДатаРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.Клиенты.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.Клиенты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если ВыбранныеСтроки.Получить(Выборка.Код) <> Неопределено Тогда
			НоваяСтрока.Выбрано = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьГруппыСценариев() Экспорт
	// Заполнение групп сценариев
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	T_Scenario_Groups.Ссылка КАК Ссылка,
		|	T_Scenario_Groups.ID КАК Идентификатор,
		|	T_Scenario_Groups.Name КАК Наименование,
		|	T_Scenario_Groups.Description КАК Описание
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Groups КАК T_Scenario_Groups
		|ГДЕ
		|	НЕ T_Scenario_Groups.IsDeleted
		|
		|УПОРЯДОЧИТЬ ПО
		|	ID";
	#КонецОбласти
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.ГруппыСценариев.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.ГруппыСценариев.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьИспользуемуюГруппуСценариев() Экспорт
	ЭтотОбъект.ГруппаСценариев = ПолучитьГруппуСценариев(ЭтотОбъект.ДатаРасчета, ЭтотОбъект.НомерРасчета);
КонецПроцедуры

// Запускается только после "ЗагрузитьИспользуемуюГруппуСценариев"
Процедура ЗагрузитьСценарии() Экспорт
	// Заполнение используемых сценариев по группе сценариев
	ПолученныеСценарии = ПолучитьСценарии(ЭтотОбъект.ГруппаСценариев);
	ОтфильтрованныеСценарии = ОтфильтроватьСценарииПоИспользуемым(ПолученныеСценарии, ЭтотОбъект.ДатаРасчета, ЭтотОбъект.НомерРасчета);
	ЭтотОбъект.Сценарии.Очистить();
	Для Каждого ТекущийСценарий Из ОтфильтрованныеСценарии Цикл
		НоваяСтрока = ЭтотОбъект.Сценарии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийСценарий);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьСценарныеИндексы() Экспорт
	// Заполнение сценарных индексов
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	T_Scenario_Indexes.ID КАК Идентификатор,
		|	МАКСИМУМ(T_Scenario_Indexes.Name) КАК Наименование,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ T_Scenario_Model_Yields.DurationYears) > 1
		|				ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ T_Scenario_Indexes_Values.DurationYears) > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьРазрезПоДюрации
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes КАК T_Scenario_Indexes
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes_Values КАК T_Scenario_Indexes_Values
		|		ПО T_Scenario_Indexes.ID = T_Scenario_Indexes_Values.IndexID
		|			И (T_Scenario_Indexes_Values.AssetDate = &AssetDate)
		|			И (T_Scenario_Indexes_Values.CalcID = &CalcID)
		|			И (НЕ T_Scenario_Indexes_Values.DurationYears ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Model_Yields КАК T_Scenario_Model_Yields
		|		ПО T_Scenario_Indexes.ID = T_Scenario_Model_Yields.IndexID
		|			И (T_Scenario_Model_Yields.AssetDate = &AssetDate)
		|			И (T_Scenario_Model_Yields.CalcID = &CalcID)
		|			И (НЕ T_Scenario_Model_Yields.DurationYears ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	T_Scenario_Indexes.ID
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор";
	Запрос.УстановитьПараметр("AssetDate", ЭтотОбъект.ДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", ЭтотОбъект.НомерРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.СценарныеИндексы.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.СценарныеИндексы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьДюрации() Экспорт
	// Заполнение значений дюрации по сценарным индексам
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	T_Scenario_Indexes_Values.IndexID КАК СценарныйИндекс,
		|	T_Scenario_Indexes_Values.DurationYears КАК Дюрация
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes_Values КАК T_Scenario_Indexes_Values
		|ГДЕ
		|	T_Scenario_Indexes_Values.AssetDate = &AssetDate
		|	И T_Scenario_Indexes_Values.CalcID = &CalcID
		|	И НЕ T_Scenario_Indexes_Values.DurationYears ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	T_Scenario_Model_Yields.IndexID,
		|	T_Scenario_Model_Yields.DurationYears
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Model_Yields КАК T_Scenario_Model_Yields
		|ГДЕ
		|	T_Scenario_Model_Yields.AssetDate = &AssetDate
		|	И T_Scenario_Model_Yields.CalcID = &CalcID
		|	И НЕ T_Scenario_Model_Yields.DurationYears ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	СценарныйИндекс,
		|	Дюрация";
	#КонецОбласти
	Запрос.УстановитьПараметр("AssetDate", ЭтотОбъект.ДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", ЭтотОбъект.НомерРасчета);
	ЭтотОбъект.Дюрации.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.Дюрации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьРеперныеДаты() Экспорт
	Если Не ЗначениеЗаполнено(КалендарьТорговыхДней) Тогда
		Сообщить("Не найден календарь торговых дней (""Котировки"") в справочнике ""Календари"".");
		Возврат;
	КонецЕсли;
	
	// Заполнение реперных точек по данным значений сценарных индексов
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	T_Scenario_Indexes_Values.IndexID КАК СценарныйИндекс,
		|	T_Scenario_Indexes_Values.Date КАК РепернаяДата
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes_Values КАК T_Scenario_Indexes_Values
		|ГДЕ
		|	T_Scenario_Indexes_Values.AssetDate = &AssetDate
		|	И T_Scenario_Indexes_Values.CalcID = &CalcID
		|
		|УПОРЯДОЧИТЬ ПО
		|	СценарныйИндекс,
		|	РепернаяДата";
	#КонецОбласти
	Запрос.УстановитьПараметр("AssetDate", ЭтотОбъект.ДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", ЭтотОбъект.НомерРасчета);
	ЭтотОбъект.РеперныеДаты.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРеперныхДат = ЭтотОбъект.РеперныеДаты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРеперныхДат, Выборка);
		СтрокаРеперныхДат.ДнейСНачала = (Выборка.РепернаяДата - ЭтотОбъект.ДатаРасчета) / (60 * 60 * 24);
	КонецЦикла;
	// Расчёт количества торговых дней
	КлючиКоличестваРабочихДней = Новый Соответствие; // Соответствие(Строка ("<ДатаНачала>|<ДатаОкончания>"), Число (Количество рабочих дней))
	МаксимальнаяДата = ЭтотОбъект.ДатаРасчета;
	КалендарьНедозаполнен = Ложь; // Истина - не удалось рассчитать количество рабочих дней через календарь
	Для Каждого СтрокаРеперныхДат Из ЭтотОбъект.РеперныеДаты Цикл
		ТорговыеДниРассчитаны = Ложь;
		// На дату расчёта ни одного дня ещё не прошло
		Если СтрокаРеперныхДат.РепернаяДата = ЭтотОбъект.ДатаРасчета Тогда
			СтрокаРеперныхДат.ТорговыхДнейСНачала = 0;
			ТорговыеДниРассчитаны = Истина;
		КонецЕсли;
		// Расчёт по календарю
		Если Не ТорговыеДниРассчитаны Тогда
			ДатаОкончания = НачалоДня(СтрокаРеперныхДат.РепернаяДата - 1);
			ТекущийКлюч = Формат(ЭтотОбъект.ДатаРасчета, "ДФ=yyyy-MM-dd") + "|" + Формат(ДатаОкончания, "ДФ=yyyy-MM-dd");
			Если МаксимальнаяДата < ДатаОкончания Тогда
				МаксимальнаяДата = ДатаОкончания;
			КонецЕсли;
			НайденноеКоличествоТорговыхДней = КлючиКоличестваРабочихДней.Получить(ТекущийКлюч);
			Если НайденноеКоличествоТорговыхДней <> Неопределено Тогда
				СтрокаРеперныхДат.ТорговыхДнейСНачала = НайденноеКоличествоТорговыхДней;
				ТорговыеДниРассчитаны = Истина;
			ИначеЕсли ЗначениеЗаполнено(КалендарьТорговыхДней) Тогда
				Попытка
					СтрокаРеперныхДат.ТорговыхДнейСНачала = Справочники.Календари.КоличествоРабочихДней(
						КалендарьТорговыхДней, ЭтотОбъект.ДатаРасчета, ДатаОкончания);
					КлючиКоличестваРабочихДней.Вставить(ТекущийКлюч, СтрокаРеперныхДат.ТорговыхДнейСНачала);
					ТорговыеДниРассчитаны = Истина;
				Исключение
					КалендарьНедозаполнен = Истина;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если Не ТорговыеДниРассчитаны Тогда
			КалендарьНедозаполнен = Истина;
		КонецЕсли;
		// Приблизительный расчёт
		Если Не ТорговыеДниРассчитаны Тогда
			// Учитывается рассчитанное значение для прошлой реперной точки в разрезе измерений.
			//	Строки уже отсортированы по измерениям и реперным датам.
			ПрошлаяСтрокаПоИзмерениям = Неопределено;
			Если СтрокаРеперныхДат.НомерСтроки > 1 Тогда
				ПрошлаяСтрокаПоИзмерениям = ЭтотОбъект.РеперныеДаты[СтрокаРеперныхДат.НомерСтроки - 2]; // Прошлая строка
				Если ПрошлаяСтрокаПоИзмерениям.СценарныйИндекс <> СтрокаРеперныхДат.СценарныйИндекс Тогда
					ПрошлаяСтрокаПоИзмерениям = Неопределено;
				КонецЕсли;
			КонецЕсли;
			Если ПрошлаяСтрокаПоИзмерениям <> Неопределено Тогда
				СтрокаРеперныхДат.ТорговыхДнейСНачала = ПрошлаяСтрокаПоИзмерениям.ТорговыхДнейСНачала
					+ Цел((СтрокаРеперныхДат.ДнейСНачала - ПрошлаяСтрокаПоИзмерениям.ДнейСНачала) * 5 / 7);
			Иначе
				СтрокаРеперныхДат.ТорговыхДнейСНачала = Цел(СтрокаРеперныхДат.ДнейСНачала * 5 / 7);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если КалендарьНедозаполнен Тогда
		Сообщить("Не удалось рассчитать количество торговых дней в периоде с "
				+ Формат(ЭтотОбъект.ДатаРасчета, "ДФ=dd.MM.yyyy") + " по " + Формат(МаксимальнаяДата, "ДФ=dd.MM.yyyy") + Символы.ПС
			+ "Количество торговых дней между реперными датами, для которых не удалось рассчитать их через календарь, будет рассчитано приблизительно.");
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьПриращенияДоходности() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	T_Scenario_Indexes_Values.ScenarioID КАК Сценарий,
		|	T_Scenario_Indexes_Values.IndexID КАК СценарныйИндекс,
		|	T_Scenario_Indexes_Values.DurationYears КАК Дюрация,
		|	T_Scenario_Indexes_Values.Date КАК РепернаяДата,
		|	T_Scenario_Indexes_Values.DeltaValue КАК ПриращениеДоходности,
		|	T_Scenario_Indexes_Values.Formula КАК Формула
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes_Values КАК T_Scenario_Indexes_Values
		|ГДЕ
		|	T_Scenario_Indexes_Values.AssetDate = &AssetDate
		|	И T_Scenario_Indexes_Values.CalcID = &CalcID
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сценарий,
		|	СценарныйИндекс,
		|	Дюрация,
		|	РепернаяДата";
	#КонецОбласти
	Запрос.УстановитьПараметр("AssetDate", ЭтотОбъект.ДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", ЭтотОбъект.НомерРасчета);
	ЭтотОбъект.ПриращенияДоходности.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.ПриращенияДоходности.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьМодельныеДоходностиИДюрации() Экспорт
	// Заполнение модельных доходностей/дюраций:
	//	Пока что только для рублёвых ценных бумаг, но смысла в этом нет,
	//	т.к. у нас для иностранных валют есть свои сценарные индексы (IndexID).
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	T_Scenario_Model_Yields.IndexID КАК СценарныйИндекс,
		|	T_Scenario_Model_Yields.DurationYears КАК Дюрация,
		|	T_Scenario_Model_Yields.ModelDurationYears КАК МодельнаяДюрация,
		|	T_Scenario_Model_Yields.YTM КАК МодельнаяДоходность,
		|	T_Scenario_Model_Yields.Formula КАК Формула
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Model_Yields КАК T_Scenario_Model_Yields
		|ГДЕ
		|	T_Scenario_Model_Yields.AssetDate = &AssetDate
		|	И T_Scenario_Model_Yields.CalcID = &CalcID
		|	И T_Scenario_Model_Yields.CurrencyCode = ""RUB""
		|
		|УПОРЯДОЧИТЬ ПО
		|	СценарныйИндекс,
		|	Дюрация";
	#КонецОбласти
	Запрос.УстановитьПараметр("AssetDate", ЭтотОбъект.ДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", ЭтотОбъект.НомерРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.МодельныеДоходностиИДюрации.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.МодельныеДоходностиИДюрации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьЗамещенияСценарныхИндексов() Экспорт
	// Заполнение замещений сценарных индексов
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	T_Scenario_Indexes_Reinvestment_Replacement.Ссылка КАК Ссылка,
		|	T_Scenario_Indexes_Reinvestment_Replacement.ID КАК Идентификатор,
		|	T_Scenario_Indexes_Reinvestment_Replacement.AssetType КАК ТипАктива,
		|	T_Scenario_Indexes_Reinvestment_Replacement.CurrencyCode КАК КодВалюты,
		|	T_Scenario_Indexes_Reinvestment_Replacement.IndexID КАК СценарныйИндекс,
		|	T_Scenario_Indexes_Reinvestment_Replacement.ReinvestmentIndexID КАК ЗамещающийСценарныйИндекс
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes_Reinvestment_Replacement КАК T_Scenario_Indexes_Reinvestment_Replacement
		|ГДЕ
		|	T_Scenario_Indexes_Reinvestment_Replacement.AssetDate = &AssetDate
		|	И T_Scenario_Indexes_Reinvestment_Replacement.CalcID = &CalcID
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипАктива,
		|	КодВалюты,
		|	СценарныйИндекс";
	#КонецОбласти
	Запрос.УстановитьПараметр("AssetDate", ЭтотОбъект.ДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", ЭтотОбъект.НомерРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.ЗамещенияСценарныхИндексов.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.ЗамещенияСценарныхИндексов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьГруппуСценариев(ДатаРасчета, НомерРасчета) Экспорт
	// Заполнение используемой группы сценариев по данным используемых сценариев
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	T_Scenario_Groups.ID КАК ID
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes_Values КАК T_Scenario_Indexes_Values
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenarios КАК T_Scenarios
		|		ПО T_Scenario_Indexes_Values.ScenarioID = T_Scenarios.ID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Groups КАК T_Scenario_Groups
		|		ПО T_Scenarios.ScenarioGroupID = T_Scenario_Groups.ID
		|ГДЕ
		|	T_Scenario_Indexes_Values.AssetDate = &AssetDate
		|	И T_Scenario_Indexes_Values.CalcID = &CalcID
		|УПОРЯДОЧИТЬ ПО
		|	T_Scenario_Groups.ID";
	Запрос.УстановитьПараметр("AssetDate", ДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", НомерРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 1 Тогда
		Сообщить("Используемые в расчёте сценарии принадлежат разным группам сценариев. Будет выбрана первая группа сценариев из найденных.");
	КонецЕсли;
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ID;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Получение сценариев по идентификатору группы сценариев
//
// Параметры:
//	ГруппаСценариев - Число - ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Groups.ID
//
// Возвращаемое значение:
//	Массив(Структура(
//		Идентификатор - Число,
//		ГруппаСценариев - Число,
//		Порядок - Число,
//		Наименование - Строка
//	))
Функция ПолучитьСценарии(ГруппаСценариев) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	T_Scenarios.ID КАК Идентификатор,
		|	T_Scenarios.ScenarioGroupID КАК ГруппаСценариев,
		|	T_Scenarios.OrderNumber КАК Порядок,
		|	T_Scenarios.Name КАК Наименование
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenarios КАК T_Scenarios
		|ГДЕ
		|	T_Scenarios.ScenarioGroupID = &ScenarioGroupID
		|	И НЕ T_Scenarios.IsDeleted
		|
		|УПОРЯДОЧИТЬ ПО
		|	OrderNumber";
	Запрос.УстановитьПараметр("ScenarioGroupID", ГруппаСценариев);
	Выборка = Запрос.Выполнить().Выбрать();
	ПолученныеСценарии = Новый Массив; // Возвращаемое значение
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Новый Структура("Идентификатор, ГруппаСценариев, Порядок, Наименование");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ПолученныеСценарии.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат ПолученныеСценарии;
КонецФункции

Функция ОтфильтроватьСценарииПоИспользуемым(ФильтруемыеСценарии, ПроверяемаяДатаРасчета, ПроверяемыйНомерРасчета) Экспорт
	// Получение активных сценариев
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	T_Scenario_Indexes_Values.ScenarioID КАК Идентификатор
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenarios КАК T_Scenarios,
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Scenario_Indexes_Values КАК T_Scenario_Indexes_Values
		|ГДЕ
		|	T_Scenario_Indexes_Values.AssetDate = &AssetDate
		|	И T_Scenario_Indexes_Values.CalcID = &CalcID";
	Запрос.УстановитьПараметр("AssetDate", ПроверяемаяДатаРасчета);
	Запрос.УстановитьПараметр("CalcID", ПроверяемыйНомерРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	УникальныеАктивныеСценарии = Новый Соответствие; // Соответствие(Число (Идентификатор сценария))
	Пока Выборка.Следующий() Цикл
		УникальныеАктивныеСценарии.Вставить(Выборка.Идентификатор, Истина);
	КонецЦикла;
	
	Итератор = ФильтруемыеСценарии.Количество() - 1;
	Пока Итератор >= 0 Цикл
		ПолученныйСценарий = ФильтруемыеСценарии[Итератор];
		// Пропуск сценариев без наличия приращений доходности
		Если УникальныеАктивныеСценарии.Получить(ПолученныйСценарий.Идентификатор) = Неопределено Тогда
			ФильтруемыеСценарии.Удалить(Итератор);
		КонецЕсли;
		Итератор = Итератор - 1;
	КонецЦикла;
	
	Возврат ФильтруемыеСценарии;
КонецФункции

// Получение нового информационного текста и пометка его, как прочитанного
//
// Возвращаемое значение:
//	Массив(Структура(
//		"Идентификатор": Число,
//		"Описание": Строка,
//		"ОписаниеОшибки": Строка
//	)
Функция ПолучитьМассивНовогоИнформационныйТекста()
	// Получение ещё не прочитанных логов
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	T_Log.Ссылка КАК Ссылка,
		|	T_Log.ID КАК Идентификатор,
		|	T_Log.Comments КАК Описание,
		|	T_Log.ErrMessage КАК ОписаниеОшибки
		|ИЗ
		|	ВнешнийИсточникДанных.RiskControl.Таблица.T_Log КАК T_Log
		|ГДЕ
		|	T_Log.SessionID = &ИдентификаторСессии
		|	И НЕ T_Log.IsRead
		|
		|УПОРЯДОЧИТЬ ПО
		|	T_Log.ID";
	Запрос.УстановитьПараметр("ИдентификаторСессии", ЭтотОбъект.ИдентификаторСессии);
	Выборка = Запрос.Выполнить().Выбрать();
	// Пометка полученных непрочитанных логов
	Результат = Новый Массив; // Возвращаемое значение
	ТекущаяДатаСОформлением = "[" + Формат(ТекущаяДата(), "ДФ=HH:mm:ss") + "] ";
	ВнешниеИсточникиДанных.RiskControl.НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл //НовыйИнформационныйТекст
			Если Не ПустаяСтрока(Выборка.Описание) Тогда
				Результат.Добавить(ТекущаяДатаСОформлением + Выборка.Описание);
			КонецЕсли;
			Если Не ПустаяСтрока(Выборка.ОписаниеОшибки) Тогда
				Результат.Добавить(ТекущаяДатаСОформлением + Выборка.ОписаниеОшибки);
			КонецЕсли;
			ОбъектЛога = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектЛога.IsRead = Истина;
			ОбъектЛога.Записать();
		КонецЦикла;
		ВнешниеИсточникиДанных.RiskControl.ЗафиксироватьТранзакцию();
	Исключение
		Сообщить(ОписаниеОшибки());
		ВнешниеИсточникиДанных.RiskControl.ОтменитьТранзакцию();
		Результат.Очистить();
	КонецПопытки;
	Возврат Результат;
КонецФункции

Процедура ПолучитьИВывестиИнформационныйТекст(ТакжеСообщить = Ложь) Экспорт
	МассивНовогоИнформационныйТекста = ПолучитьМассивНовогоИнформационныйТекста();
	Для Каждого СтрокаНовогоИнформационногоТекста Из МассивНовогоИнформационныйТекста Цикл
		ДобавляемыйТекст = СтрЗаменить(СтрокаНовогоИнформационногоТекста, Символы.ПС, Символы.ПС + Символы.Таб);
		ЭтотОбъект.ИнформационныйТекст = ЭтотОбъект.ИнформационныйТекст + Символы.ПС + ДобавляемыйТекст;
		Если ТакжеСообщить Тогда
			Сообщить(ДобавляемыйТекст);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОчиститьОписаниеОшибкиSQL(Знач ОписаниеОшибки) Экспорт
	ИндексДляОчистки = СтрНайти(ОписаниеОшибки, "[Microsoft][ODBC SQL Server Driver][SQL Server]");
	Если ИндексДляОчистки <> 0 Тогда
		ОписаниеОшибки = Прав(ОписаниеОшибки, СтрДлина(ОписаниеОшибки) - ИндексДляОчистки + 1);
	КонецЕсли;
	ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "[Microsoft][ODBC SQL Server Driver][SQL Server]", "Ошибка SQL: ");
	Возврат ОписаниеОшибки;
КонецФункции

// Формирование и возврат таблицы, полученной в результате выполнения указанной функции SQL внешних источников данных.
//
// Параметры:
//	МетаданныеТабличнойФункции - ВнешнийИсточникДанныхТаблицаМенеджер.<Имя внешнего источника>.<Имя таблицы внешнего источника данных>
//	ПараметрыТабличнойФункции - Массив
Функция ВыполнитьТабличнуюФункциюВнешнегоИсточникаДанных(МетаданныеТабличнойФункции, ПараметрыТабличнойФункции = Неопределено) Экспорт
	Если Метаданные.НайтиПоПолномуИмени(МетаданныеТабличнойФункции.ПолноеИмя()) = Неопределено Тогда
		Возврат Неопределено; // Метаданные некорректны (нужно проверить на тип метаданных)
	ИначеЕсли МетаданныеТабличнойФункции.ВидТаблицы <> Метаданные.СвойстваОбъектов.ВидТаблицыВнешнегоИсточникаДанных.Выражение Тогда
		Возврат Неопределено; // Это не табличная функция или табличная функция без параметров
	ИначеЕсли МетаданныеТабличнойФункции.Поля.Количество() = 0 Тогда
		Возврат Неопределено; // Нет полей в таблице
	КонецЕсли;
	Если ПараметрыТабличнойФункции = Неопределено Тогда
		ПараметрыТабличнойФункции = Новый Массив;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	<ПоляТаблицыРезультата>
		|ИЗ
		|	<ПолноеИмяТабличнойФункции><(>
		|		<ЗначенияПараметровТабличнойФункции>
		|	<)>
		|";
	// Поля таблицы результата
	ПоляТаблицыРезультата = "";
	Для Каждого ДанныеПоляТаблицы Из МетаданныеТабличнойФункции.Поля Цикл
		ПоляТаблицыРезультата = ПоляТаблицыРезультата + ДанныеПоляТаблицы.Имя + ", ";
	КонецЦикла;
	ПоляТаблицыРезультата = Лев(ПоляТаблицыРезультата, СтрДлина(ПоляТаблицыРезультата) - 2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ПоляТаблицыРезультата>", ПоляТаблицыРезультата);
	// Параметры табличной функции
	ЗначенияПараметровТабличнойФункции = "";
	ЕстьПараметрыТабличнойФункции = ПараметрыТабличнойФункции.Количество() > 0;
	Для Итератор = 1 По ПараметрыТабличнойФункции.Количество() Цикл
		ЗначенияПараметровТабличнойФункции = ЗначенияПараметровТабличнойФункции + "&Параметр" + Строка(Итератор) + ", ";
	КонецЦикла;
	ЗначенияПараметровТабличнойФункции = Лев(ЗначенияПараметровТабличнойФункции, СтрДлина(ЗначенияПараметровТабличнойФункции) - 2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ЗначенияПараметровТабличнойФункции>", ЗначенияПараметровТабличнойФункции);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<(>", ?(ЕстьПараметрыТабличнойФункции, "(", ""));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<)>", ?(ЕстьПараметрыТабличнойФункции, ")", ""));
	// Прочее
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ПолноеИмяТабличнойФункции>", МетаданныеТабличнойФункции.ПолноеИмя());
	Для Итератор = 1 По ПараметрыТабличнойФункции.Количество() Цикл
		Запрос.УстановитьПараметр("Параметр" + Строка(Итератор), ПараметрыТабличнойФункции[Итератор - 1]);
	КонецЦикла;
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

// Не думаю, что это будет работать
Функция ВыполнитьПроцедуруВнешнегоИсточникаДанных(ВнешнийИсточникДанных, МетаданныеПроцедуры, ПараметрыПроцедуры = Неопределено) Экспорт
	Если Метаданные.НайтиПоПолномуИмени(МетаданныеПроцедуры.ПолноеИмя()) = Неопределено Тогда
		Возврат Ложь; // Метаданные некорректны (нужно проверить на тип метаданных)
	ИначеЕсли МетаданныеПроцедуры.ВозвращаетЗначение Тогда
		Возврат Ложь; // Это не процедура
	КонецЕсли;
	Если ПараметрыПроцедуры = Неопределено Тогда
		ПараметрыПроцедуры = Новый Массив;
	КонецЕсли;
	ТекстЗапроса = "
		|
		|";
	Возврат Истина;
КонецФункции
