
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперациинаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьОстаткиЦенныхБумаг(Команда)
	
	// проверим заполнение ключевых полей
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Счет доверительного управления"" не заполнено.",,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Коэффициент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Коэффициент"" не заполнено.",,,, Отказ);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Ценная бумага"" не заполнено.",,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// получим подтверждение
	Если Объект.ЦенныеБумаги.Количество() > 0
		И Вопрос("Количества ценных бумаг будут перезаполнены текущими остатками на депозитарных счетах. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		Возврат;
	КонецЕсли;

	КомандаЗаполнитьОстаткиЦенныхБумагНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	
	Если Объект.Коэффициент > 0 И Объект.ЦенныеБумаги.Количество() > 0
		И Вопрос("Пересчитать новое количество ценных бумаг?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаЦенныеБумаги Из Объект.ЦенныеБумаги Цикл
		СтрокаЦенныеБумаги.КоличествоНовое = СтрокаЦенныеБумаги.Количество * Объект.Коэффициент;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	ТекущиеДанные.КоличествоНовое = ТекущиеДанные.Количество * Объект.Коэффициент;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Элементы.ЦеннаяБумага.ОграничениеТипа      = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	Элементы.ЦеннаяБумагаНовая.ОграничениеТипа = Элементы.ЦеннаяБумага.ОграничениеТипа;
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура КомандаЗаполнитьОстаткиЦенныхБумагНаСервере()
	
	Объект.ЦенныеБумаги.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток * &Коэффициент КАК КоличествоНовое
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки";
		
	Запрос.УстановитьПараметр("Период",                       ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, КонецДня(Объект.Дата))); // если документ не записан, то время, с высокой долей вероятности, будет изменено
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Рынок",                        Объект.Рынок);
	Запрос.УстановитьПараметр("ЦеннаяБумага",                 Объект.ЦеннаяБумага);
	Запрос.УстановитьПараметр("Коэффициент",                  Объект.Коэффициент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ЦенныеБумаги.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // КомандаЗаполнитьОстаткиЦенныхБумагНаСервере

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

&НаКлиенте
Процедура РынокПриИзменении(Элемент)
	
	Если Объект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Акции")  Тогда 
		Объект.Рынок = "";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Другие рынки кроме Акций в документе не отработаны",,"Рынок");
	КонецЕсли;	
			
КонецПроцедуры
