
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.Устранимо И ЭтаФорма.ЗаданСрокУстранения И Не ЗначениеЗаполнено(Объект.СрокУстранения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Срок устранения' не заполнено",,, "Объект.СрокУстранения", Отказ); 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.Устранимо Или Не ЭтаФорма.ЗаданСрокУстранения Тогда
		ТекущийОбъект.СрокУстранения = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура УстранимоПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаданСрокУстраненияПриИзменении(Элемент)
	
	Элементы.СрокУстранения.АвтоОтметкаНезаполненного = ЭтаФорма.ЗаданСрокУстранения;
	УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ОпределитьИсходящийДокументНаСервере();	
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.ЗаданСрокУстранения = (Объект.Устранимо И ЗначениеЗаполнено(Объект.СрокУстранения));
	КонецЕсли; 
	
	УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИсходящийДокументНаСервере()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсходящийДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИсходящийДокумент КАК ИсходящийДокумент
		|ГДЕ
		|	ИсходящийДокумент.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	ИсходящиеДокументы = Запрос.Выполнить().Выбрать();
	
	Если ИсходящиеДокументы.Следующий() Тогда
		 
		//ЗначениеВРеквизитФормы(ИсходящиеДокументы.Ссылка, "УведомлениеОНарушении");
		УведомлениеОНарушении =  ИсходящиеДокументы.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма)

	ЭтаФорма.Элементы.ЗаданСрокУстранения.Видимость = ЭтаФорма.Объект.Устранимо;
	ЭтаФорма.Элементы.СрокУстранения.Видимость = (ЭтаФорма.Объект.Устранимо И ЭтаФорма.ЗаданСрокУстранения);

КонецПроцедуры

#КонецОбласти 


