&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, ЭтаФорма.Параметры, "Организация, Дата");
	
	
	Запрос = Новый Запрос;  
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА НачислениеДивидендов.ЦеннаяБумага ЕСТЬ NULL
	|			ТОГДА ""Оплата налога по расчету НДФЛ""
	|		ИНАЧЕ ""Оплата налога с дивидендов""
	|	КОНЕЦ КАК ВидСобытия,
	|	НачислениеДивидендов.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КодыВоВнешнихСистемахСрезПоследних.Код КАК ИдСобытия
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(&ПериодНачало, &ПериодКонец, Регистратор, ) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ПО ОстаткиДенежныхСредств.Регистратор = ЗадолженностиПоДенежнымСредствамОбороты.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
	|		ПО (НачислениеЗадолженностиОснования.Ссылка = ЗадолженностиПоДенежнымСредствамОбороты.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛ.Основания КАК РасчетНДФЛОснования
	|		ПО (РасчетНДФЛОснования.Ссылка = НачислениеЗадолженностиОснования.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаДивидендовОснования
	|		ПО (ОплатаДивидендовОснования.Ссылка = РасчетНДФЛОснования.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
	|		ПО (&СтруктураЗависимости2025
	|					И ОплатаДивидендовОснования.Основание = НачислениеДивидендов.Ссылка
	|				ИЛИ НЕ &СтруктураЗависимости2025
	|					И ЗадолженностиПоДенежнымСредствамОбороты.Основание = НачислениеДивидендов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
	|				&ПериодКонец,
	|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.НРД)
	|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.КорпоративноеСобытиеПоВыплатеДивидендов)) КАК КодыВоВнешнихСистемахСрезПоследних
	|		ПО (НачислениеДивидендов.Ссылка = КодыВоВнешнихСистемахСрезПоследних.Объект)
	|ГДЕ
	|	ОстаткиДенежныхСредств.Организация = &Организация
	|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль))
	|	И ОстаткиДенежныхСредств.Период МЕЖДУ &ПериодНачало И &ПериодКонец"; 
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПериодНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(Объект.Дата));   
	Если Объект.Дата < Дата(2025, 1, 1) Тогда                        
	// Начисление Дивидендов
	//  |_ Оплата Дивидендов
	//  |_ Начисление задолженности по НДФЛ
	//  |_ Оплата НДФЛ

		Запрос.УстановитьПараметр("СтруктураЗависимости2025", Ложь);  
	Иначе  
	// новая структура подчиненности с 2025 г.  
	// Начисление Дивидендов
	//  |_ Оплата Дивидендов
	//    |_ Расчет НДФЛ
	//      |_ Начисление задолженности по НДФЛ
	//        |_ Оплата НДФЛ           

		Запрос.УстановитьПараметр("СтруктураЗависимости2025", Истина);  
	КонецЕсли;	
	
	ЭтаФорма.ПараметрыСобытия.Загрузить(Запрос.Выполнить().Выгрузить());	
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда				
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ВозращаемыеДанные(ИсточникДанных)
	
	Результат = Новый Структура("ЦеннаяБумага, ВидСобытия, ИдСобытия");
	ЗаполнитьЗначенияСвойств(Результат, ИсточникДанных);
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ВыбратьСобытие(Команда)
	
	ТекущиеПараметры = ВозращаемыеДанные(ЭтаФорма.Элементы.ПараметрыСобытия.ТекущиеДанные);
	ЭтаФорма.Закрыть(ТекущиеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ПараметрыСобытия.Количество() = 1 Тогда 
		Отказ = Истина;
		ТекущиеПараметры = ВозращаемыеДанные(ЭтаФорма.ПараметрыСобытия[0]);		
		ЭтаФорма.Закрыть(ТекущиеПараметры);
	ИначеЕсли ЭтаФорма.ПараметрыСобытия.Количество() = 0 Тогда  
		// нет начислений
		Отказ = Истина;
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСобытияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьСобытие(Команды.Найти("ВыбратьСобытие"));
КонецПроцедуры
