
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Проверка начисленных резервов",
		"1.07",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьСуществующийДокументМСФО9(Организация, СчетДоверительногоУправления, Дата, ЦельРасчета)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеСписаниеРезервов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НачислениеСписаниеРезервов КАК НачислениеСписаниеРезервов
		|ГДЕ
		|	НачислениеСписаниеРезервов.Организация = &Организация
		|	И НачислениеСписаниеРезервов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НачислениеСписаниеРезервов.Дата МЕЖДУ &НачальнаяДата И &КонечнаяДата
		|	И НачислениеСписаниеРезервов.Проведен
		|	И НачислениеСписаниеРезервов.ПереходНаМСФО9
		|	И НачислениеСписаниеРезервов.ЦельРасчета = &ЦельРасчета");

	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачальнаяДата",					НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонечнаяДата",					КонецДня(Дата));
	Запрос.УстановитьПараметр("ЦельРасчета",					ЦельРасчета);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);

КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Организуем сбор статистики
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюКомпоновкиСКД(ЭтотОбъект, ПолноеИмяОтчета);	
	
	СтандартнаяОбработка = Ложь;
	
	ДатаПроверки = НачалоДня(ТекущаяДата());
	ДатаОкончания = НачалоДня(ТекущаяДата());
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОтчета");
	Если Параметр <> Неопределено  Тогда
		Элемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если Элемент <> Неопределено И Элемент.Использование Тогда
			ЗначениеПериод = Элемент.Значение;
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипЗнч(ЗначениеПериод) = Тип("СтандартнаяДатаНачала") Тогда
		ДатаПроверки = НачалоДня(ЗначениеПериод.Дата);	
		ДатаОкончания = ДатаПроверки;
	ИначеЕсли ТипЗнч(ЗначениеПериод) = Тип("СтандартныйПериод") Тогда	
		ДатаПроверки = НачалоДня(ЗначениеПериод.ДатаНачала);	
		ДатаОкончания = НачалоДня(ЗначениеПериод.ДатаОкончания);
	ИначеЕсли ТипЗнч(ЗначениеПериод) = Тип("Дата") Тогда	
		ДатаПроверки = НачалоДня(ЗначениеПериод);	
		ДатаОкончания = ДатаПроверки;
	КонецЕсли;	
	
	ПереходНаМСФО9 = Ложь;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПереходНаМСФО9");
	Если Параметр <> Неопределено  Тогда
		Элемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если Элемент <> Неопределено И Элемент.Использование Тогда
			ПереходНаМСФО9 = Элемент.Значение;
		КонецЕсли;
	КонецЕсли;	
	
	СчетаДУ = Неопределено;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетаДУ");
	Если Параметр <> Неопределено  Тогда
		Элемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если Элемент <> Неопределено И Элемент.Использование Тогда
			СчетаДУ = Элемент.Значение;
		КонецЕсли;
	КонецЕсли;	
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаРезультата.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаРезультата.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаРезультата.Колонки.Добавить("Актив", Метаданные.ОпределяемыеТипы.СубъектыАналитики.Тип);
	ТаблицаРезультата.Колонки.Добавить("Партия", Метаданные.ОпределяемыеТипы.Партия.Тип);
	ТаблицаРезультата.Колонки.Добавить("СтрокаПартии", Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
	ТаблицаРезультата.Колонки.Добавить("СуммаРезерваПартии", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТаблицаРезультата.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	ТаблицаРезультата.Колонки.Добавить("АналитикаРезерва", Новый ОписаниеТипов("СправочникСсылка.Резервы"));
	ТаблицаРезультата.Колонки.Добавить("СтадияОбесценения", Новый ОписаниеТипов("ПеречислениеСсылка.СтадииОбесценения"));
	ТаблицаРезультата.Колонки.Добавить("СуммаРезерваПартииСтарый", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТаблицаРезультата.Колонки.Добавить("КоличествоСтарый", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	ТаблицаРезультата.Колонки.Добавить("АналитикаРезерваСтарый", Новый ОписаниеТипов("СправочникСсылка.Резервы"));
	ТаблицаРезультата.Колонки.Добавить("СтадияОбесцененияСтарый", Новый ОписаниеТипов("ПеречислениеСсылка.СтадииОбесценения"));
	
	Пока ДатаПроверки <= ДатаОкончания Цикл 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НастройкиУчетаОбщиеСрезПоследних.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&ДатаПроверки, ) КАК НастройкиУчетаОбщиеСрезПоследних
		|ГДЕ
		|	НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = ЗНАЧЕНИЕ(Перечисление.СтандартыФинансовойОтчетности.МСФО9)
		|	И (НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения >= &ДатаПроверки
		|			ИЛИ НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|	И ВЫБОР
		|			КОГДА &ОтборПоСчетамДУ
		|				ТОГДА НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления В ИЕРАРХИИ (&СчетаДоверительногоУправления)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
		Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДУ);
		Запрос.УстановитьПараметр("ОтборПоСчетамДУ", ЗначениеЗаполнено(СчетаДУ));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НастройкиУчета 				= БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПроверки, ВыборкаДетальныеЗаписи.Организация, ВыборкаДетальныеЗаписи.СчетДоверительногоУправления);
			НастройкиФормированияСЧА 	= РегистрыСведений.НастройкиФормированияСЧА.ОпределитьНастройки(ДатаПроверки, ВыборкаДетальныеЗаписи.Организация, ВыборкаДетальныеЗаписи.СчетДоверительногоУправления);
			
			Если Не ПереходНаМСФО9 Тогда
				ДокументНачисленияРезервовСтарый = Документы.НачислениеСписаниеРезервов.ПолучитьСуществующийДокумент(ВыборкаДетальныеЗаписи.Организация, ВыборкаДетальныеЗаписи.СчетДоверительногоУправления, ДатаПроверки, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
			Иначе
				ДокументНачисленияРезервовСтарый = ПолучитьСуществующийДокументМСФО9(ВыборкаДетальныеЗаписи.Организация, ВыборкаДетальныеЗаписи.СчетДоверительногоУправления, ДатаПроверки, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
			КонецЕсли;	
			
			Если НастройкиФормированияСЧА <> Неопределено Тогда
				
				НужноНачислениеРезервов	= НастройкиУчета.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = Перечисления.СтандартыФинансовойОтчетности.МСФО9 
				И БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(НастройкиФормированияСЧА.ПериодичностьНачисленияРезервов, ДатаПроверки);
				
				Если ПереходНаМСФО9 Тогда
					ТолькоПоступившиеАктивы = Ложь;	
					НужноНачислениеРезервов = Истина;
				Иначе	
					ТолькоПоступившиеАктивы = (НЕ НужноНачислениеРезервов И НастройкиФормированияСЧА.ПериодичностьНачисленияРезервов <> Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать)
					И НастройкиУчета.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = Перечисления.СтандартыФинансовойОтчетности.МСФО9;
				КонецЕсли;	
				
				Если НужноНачислениеРезервов ИЛИ ТолькоПоступившиеАктивы Тогда
					
					ДокументНачисленияРезервов = Документы.НачислениеСписаниеРезервов.СоздатьДокумент();
					Если ПереходНаМСФО9 Тогда
						ДокументНачисленияРезервов.Дата = ДатаПроверки + 1;
					Иначе
						ДокументНачисленияРезервов.Дата = РаботаСДокументами.ПолучитьВремяДокумента(ДатаПроверки, ДокументНачисленияРезервов.Ссылка);
					КонецЕсли;	
					ДокументНачисленияРезервов.Организация = ВыборкаДетальныеЗаписи.Организация;
					ДокументНачисленияРезервов.СчетДоверительногоУправления = ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
					ДокументНачисленияРезервов.Ответственный = РаботаСПользователями.ТекущийПользователь();
					ДокументНачисленияРезервов.ПереходНаМСФО9 = ПереходНаМСФО9;
					ДокументНачисленияРезервов.ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов;
					
					Отказ = Ложь;
					
					ДокументНачисленияРезервов.ЗаполнитьРезервы(Отказ, , ТолькоПоступившиеАктивы);
					
					Партии = ДокументНачисленияРезервов.Партии.Выгрузить();
					
					ЗапросПроверки = Новый Запрос;
					ЗапросПроверки.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ПартииНовыеПредварительно.Партия КАК Партия,
					|	ПартииНовыеПредварительно.СтрокаПартии КАК СтрокаПартии,
					|	ПартииНовыеПредварительно.СуммаРезерваПартии КАК СуммаРезерваПартии,
					|	ПартииНовыеПредварительно.Количество КАК Количество,
					|	ПартииНовыеПредварительно.Актив КАК Актив,
					|	ПартииНовыеПредварительно.АналитикаРезерва КАК АналитикаРезерва,
					|	ПартииНовыеПредварительно.СтадияОбесценения КАК СтадияОбесценения
					|ПОМЕСТИТЬ _ПартииНовыеПредварительно
					|ИЗ
					|	&ПартииНовые КАК ПартииНовыеПредварительно
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	_ПартииНовыеПредварительно.Партия КАК Партия,
					|	_ПартииНовыеПредварительно.СтрокаПартии КАК СтрокаПартии,
					|	СУММА(_ПартииНовыеПредварительно.СуммаРезерваПартии) КАК СуммаРезерваПартии,
					|	СУММА(_ПартииНовыеПредварительно.Количество) КАК Количество,
					|	_ПартииНовыеПредварительно.Актив КАК Актив,
					|	_ПартииНовыеПредварительно.АналитикаРезерва КАК АналитикаРезерва,
					|	_ПартииНовыеПредварительно.СтадияОбесценения КАК СтадияОбесценения
					|ПОМЕСТИТЬ _ПартииНовые
					|ИЗ
					|	_ПартииНовыеПредварительно КАК _ПартииНовыеПредварительно
					|
					|СГРУППИРОВАТЬ ПО
					|	_ПартииНовыеПредварительно.Партия,
					|	_ПартииНовыеПредварительно.СтрокаПартии,
					|	_ПартииНовыеПредварительно.Актив,
					|	_ПартииНовыеПредварительно.АналитикаРезерва,
					|	_ПартииНовыеПредварительно.СтадияОбесценения
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	НачислениеСписаниеРезервовПартии.Партия КАК Партия,
					|	НачислениеСписаниеРезервовПартии.СтрокаПартии КАК СтрокаПартии,
					|	СУММА(НачислениеСписаниеРезервовПартии.СуммаРезерваПартии) КАК СуммаРезерваПартии,
					|	СУММА(НачислениеСписаниеРезервовПартии.Количество) КАК Количество,
					|	НачислениеСписаниеРезервовПартии.Актив КАК Актив,
					|	НачислениеСписаниеРезервовПартии.АналитикаРезерва КАК АналитикаРезерва,
					|	НачислениеСписаниеРезервовПартии.СтадияОбесценения КАК СтадияОбесценения
					|ПОМЕСТИТЬ _ПартииСтарые
					|ИЗ
					|	Документ.НачислениеСписаниеРезервов.Партии КАК НачислениеСписаниеРезервовПартии
					|ГДЕ
					|	НачислениеСписаниеРезервовПартии.Ссылка = &Ссылка
					|
					|СГРУППИРОВАТЬ ПО
					|	НачислениеСписаниеРезервовПартии.Партия,
					|	НачислениеСписаниеРезервовПартии.СтрокаПартии,
					|	НачислениеСписаниеРезервовПартии.Актив,
					|	НачислениеСписаниеРезервовПартии.АналитикаРезерва,
					|	НачислениеСписаниеРезервовПартии.СтадияОбесценения
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(_ПартииНовые.Актив, _ПартииСтарые.Актив) КАК Актив,
					|	ЕСТЬNULL(_ПартииНовые.Партия, _ПартииСтарые.Партия) КАК Партия,
					|	ЕСТЬNULL(_ПартииНовые.СтрокаПартии, _ПартииСтарые.СтрокаПартии) КАК СтрокаПартии,
					|	ЕСТЬNULL(_ПартииНовые.СуммаРезерваПартии, 0) КАК СуммаРезерваПартии,
					|	ЕСТЬNULL(_ПартииНовые.Количество, 0) КАК Количество,
					|	_ПартииНовые.АналитикаРезерва КАК АналитикаРезерва,
					|	_ПартииНовые.СтадияОбесценения КАК СтадияОбесценения,
					|	ЕСТЬNULL(_ПартииСтарые.СуммаРезерваПартии, 0) КАК СуммаРезерваПартииСтарый,
					|	ЕСТЬNULL(_ПартииСтарые.Количество, 0) КАК КоличествоСтарый,
					|	_ПартииСтарые.АналитикаРезерва КАК АналитикаРезерваСтарый,
					|	_ПартииСтарые.СтадияОбесценения КАК СтадияОбесцененияСтарый
					|ИЗ
					|	_ПартииНовые КАК _ПартииНовые
					|		ПОЛНОЕ СОЕДИНЕНИЕ _ПартииСтарые КАК _ПартииСтарые
					|		ПО _ПартииНовые.Актив = _ПартииСтарые.Актив
					|			И (ТИПЗНАЧЕНИЯ(_ПартииНовые.Актив) <> ТИП(Справочник.Облигации)
					|				ИЛИ _ПартииНовые.Партия = _ПартииСтарые.Партия
					|					И _ПартииНовые.СтрокаПартии = _ПартииСтарые.СтрокаПартии)
					|ГДЕ
					|	(ЕСТЬNULL(_ПартииНовые.СуммаРезерваПартии, 0) <> ЕСТЬNULL(_ПартииСтарые.СуммаРезерваПартии, 0)
					|			ИЛИ ЕСТЬNULL(_ПартииНовые.Количество, 0) <> ЕСТЬNULL(_ПартииСтарые.Количество, 0)
					|			ИЛИ _ПартииНовые.АналитикаРезерва <> _ПартииСтарые.АналитикаРезерва
					|			ИЛИ _ПартииНовые.СтадияОбесценения <> _ПартииСтарые.СтадияОбесценения
					|			ИЛИ _ПартииНовые.Актив ЕСТЬ NULL
					|				И ЕСТЬNULL(_ПартииСтарые.СуммаРезерваПартии, 0) <> 0
					|			ИЛИ _ПартииСтарые.Актив ЕСТЬ NULL
					|				И ЕСТЬNULL(_ПартииНовые.СуммаРезерваПартии, 0) <> 0)";
					
					ЗапросПроверки.УстановитьПараметр("ПартииНовые", Партии);
					ЗапросПроверки.УстановитьПараметр("Ссылка", ДокументНачисленияРезервовСтарый);
					
					РезультатЗапросаПроверки = ЗапросПроверки.Выполнить();
					
					ВыборкаДетальныеЗаписиПроверки = РезультатЗапросаПроверки.Выбрать();
					
					Пока ВыборкаДетальныеЗаписиПроверки.Следующий() Цикл
						НоваяСтрокаТаблицаРезультата = ТаблицаРезультата.Добавить();
						НоваяСтрокаТаблицаРезультата.Дата = ДатаПроверки;
						НоваяСтрокаТаблицаРезультата.Организация = ВыборкаДетальныеЗаписи.Организация;
						НоваяСтрокаТаблицаРезультата.СчетДоверительногоУправления = ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
						ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицаРезультата, ВыборкаДетальныеЗаписиПроверки);
					КонецЦикла;
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
		
		ДатаПроверки = НачалоДня(ДатаПроверки + 60*60*24);
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаСравненияРезервов", ТаблицаРезультата);	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());	
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
КонецПроцедуры
