
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Отчет.ВидыЗадолженности.ТипЗначения						= Новый ОписаниеТипов("СправочникСсылка.ВидыЗадолженности"); 
	Отчет.ВидыДоговоровДоверительногоУправления.ТипЗначения = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления"); 
	
	ЗаполнитьСписокВыбораПечатныхФорма();
	
КонецПроцедуры

Функция ЗаполнитьСписокВыбораПечатныхФорма()
	
	Для Каждого Макет Из РеквизитФормыВЗначение("Отчет").Метаданные().Макеты Цикл
		Элементы.ПечатнаяФорма.СписокВыбора.Добавить(Макет.Имя, Макет.Синоним);
	КонецЦикла;	

КонецФункции

&НаКлиенте
Процедура СоздатьПисьмо(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.ПечатнаяФорма) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана печатная форма!");
		Возврат;
	КонецЕсли;
	
	Если Результат.ВысотаТаблицы = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед отправкой необходимо сформировать отчёт!");
		Возврат;
	КонецЕсли;
	
	Попытка
		Outlook = Новый COMОбъект("Outlook.Application");
	Исключение
	КонецПопытки;
	
	ИмяВременногоФайла = КаталогВременныхФайлов() + "/" + Отчет.ПечатнаяФорма + ".xlsx";
	
	Результат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Письмо = Outlook.CreateItem(0);
	Письмо.Subject = Элементы.ПечатнаяФорма.ТекстРедактирования;
	
	Письмо.Attachments.Add(ИмяВременногоФайла);
	Письмо.Display();	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = тип("Массив") И Расшифровка.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Количество() = 1 Тогда
			ОткрытьЗначение(Расшифровка[0]);
		Иначе
			СписокВыбора = Новый СписокЗначений;
			СписокВыбора.ЗагрузитьЗначения(Расшифровка);
			
			ВыбранныйЭлемент = СписокВыбора.ВыбратьЭлемент("Выбрать основание");
			Если ВыбранныйЭлемент <> Неопределено Тогда
				ОткрытьЗначение(ВыбранныйЭлемент.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.СкомпоноватьРезультат(Результат);
	
	Если НачалоДня(ТекущаяДата()) = НачалоДня(Отчет.Период)
		И Отчет.ОтборСравненияОстаткаНаРС
		И НЕ Отчет.ОстатокМеньшеЗадолженности Тогда
		Элементы.ФормаСоздатьОплаты.Видимость = Истина;
	Иначе
		Элементы.ФормаСоздатьОплаты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОплаты(Команда)
	
	ОтчетОбъект = ОткрытьФормуМодально("ВнешнийОтчет._ЗадолженностиИОстатокДС.Форма.СозданиеОплат", Новый Структура("Отчет", Отчет));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСравненияОстаткаНаРСПриИзменении(Элемент)
	
	Если НЕ Отчет.ОтборСравненияОстаткаНаРС Тогда
		Элементы.ФормаСоздатьОплаты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокМеньшеЗадолженностиПриИзменении(Элемент)
	
	Если Отчет.ОстатокМеньшеЗадолженности Тогда
		Элементы.ФормаСоздатьОплаты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если НачалоДня(ТекущаяДата()) <> НачалоДня(Отчет.Период) Тогда
		Элементы.ФормаСоздатьОплаты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
