
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	Элементы.БрокерскаяКомпания.Видимость   = Запись.Брокерская;
	Элементы.ДепозитарнаяКомпания.Видимость = Запись.Депозитарная;
	Элементы.УправляющаяКомпания.Видимость  = Запись.Управляющая;
	
КонецПроцедуры // НастроитьВидимостьДоступность

#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииЧтенииНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура БрокерскаяПриИзменении(Элемент)
	
	Если Не Запись.Брокерская Тогда
		Запись.БрокерскаяКомпания = Неопределено;
	КонецЕсли;
	
	Элементы.БрокерскаяКомпания.Видимость = Запись.Брокерская;
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитарнаяПриИзменении(Элемент)
	
	Если Не Запись.Депозитарная Тогда
		Запись.ДепозитарнаяКомпания = Неопределено;
	КонецЕсли;
	
	Элементы.ДепозитарнаяКомпания.Видимость = Запись.Депозитарная;
	
КонецПроцедуры

&НаКлиенте
Процедура УправляющаяПриИзменении(Элемент)
	
	Если Не Запись.Управляющая Тогда
		Запись.УправляющаяКомпания = Неопределено;
	КонецЕсли;
	
	Элементы.УправляющаяКомпания.Видимость = Запись.Управляющая;
	
КонецПроцедуры

#КонецОбласти
