
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	ЭтотОбъект.Период = ТекущаяДатаСеанса();
		
 КонецПроцедуры 

&НаСервере
Процедура ОбновитьНаСервере() 
	
	ЭтотОбъект.Клиенты.Очистить();

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыФормирования = Новый Структура;
	
	Если ЭтаФорма.ЭкспортВсехОпераций Тогда
		ПараметрыФормирования.Вставить("НачалоПериода", Дата(1, 1, 1));	
	Иначе
		ПараметрыФормирования.Вставить("НачалоПериода", ЭтотОбъект.Период - 24 * 60 * 60);
    КонецЕсли;

	ПараметрыФормирования.Вставить("КонецПериода", ЭтотОбъект.Период);
	ПараметрыФормирования.Вставить("Организация", ЭтотОбъект.Организация);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Пиф) Тогда	
		ПараметрыФормирования.Вставить("Пиф", ЭтотОбъект.Пиф);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Клиент) Тогда	
		ПараметрыФормирования.Вставить("Клиенты", РаботаСКоллекциями.ЗначениеВМассив(ЭтотОбъект.Клиент));
	КонецЕсли;
		
	ДанныеДляЭкспорта = ОбработкаОбъект.СформироватьДанныеДляЭкспорта(ПараметрыФормирования);
	
	Если ДанныеДляЭкспорта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ДанныеДляЭкспорта.ТаблицаКлиентов Цикл
		
		НоваяСтрока = ЭтотОбъект.Клиенты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				
		Для Каждого СтрокаКонтактов Из СтрокаДанных.Контакты Цикл
			
			НоваяСтрокаКонтактов = НоваяСтрока.КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаКонтактов, СтрокаКонтактов);
			
		КонецЦикла;
		
		БанковскиеРеквизитыКлиента = ДанныеДляЭкспорта.БанковскиеРеквизиты.НайтиСтроки(Новый Структура("Клиент", СтрокаДанных.Ссылка));
		
		Для Каждого СтрокаРеквизитов Из БанковскиеРеквизитыКлиента Цикл
			
			НоваяСтрокаРеквизитов = НоваяСтрока.БанковскиеРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизитов, СтрокаРеквизитов);
			
		КонецЦикла; 
		
		ПродуктыКлиента = ДанныеДляЭкспорта.Продукты.НайтиСтроки(Новый Структура("Клиент", СтрокаДанных.Ссылка));
		
		Для Каждого СтрокаПродуктов Из ПродуктыКлиента Цикл
			
			НоваяСтрокаПродуктов = НоваяСтрока.Продукты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПродуктов, СтрокаПродуктов);
			
		КонецЦикла;
		
		ОперацииКлиента = ДанныеДляЭкспорта.Операции.НайтиСтроки(Новый Структура("Клиент", СтрокаДанных.Ссылка));
		
		Для Каждого СтрокаОпераций Из ОперацииКлиента Цикл
			
			НоваяСтрокаОпераций = НоваяСтрока.Операции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаОпераций, СтрокаОпераций);
			
		КонецЦикла; 
	
		ЗавкиКлиента = ДанныеДляЭкспорта.Заявки.НайтиСтроки(Новый Структура("Клиент", СтрокаДанных.Ссылка));
		
		Для Каждого СтрокаЗаявок Из ЗавкиКлиента Цикл
			
			НоваяСтрокаЗаявок = НоваяСтрока.Заявки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗаявок, СтрокаЗаявок);
			
		КонецЦикла;
		
		ПортфельКлиента = ДанныеДляЭкспорта.Портфель.НайтиСтроки(Новый Структура("Клиент", СтрокаДанных.Ссылка));
		
		Для Каждого СтрокаПортфеля Из ПортфельКлиента Цикл
			
			НоваяСтрокаПортфеля = НоваяСтрока.Портфель.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПортфеля, СтрокаПортфеля);
			
		КонецЦикла;
				
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортироватьНаСервере()
	
	СтрокаСвойств = "ТаблицаКлиентов,БанковскиеРеквизиты"; //по умолчанию обновляем анкетные данные 
	
	Если Этаформа.Операции Тогда
		СтрокаСвойств = СтрокаСвойств + ?(ЗначениеЗаполнено(СтрокаСвойств), ",", "") + "Операции";	
	КонецЕсли;
	
	Если Этаформа.Продукты Тогда
		СтрокаСвойств = СтрокаСвойств + ?(ЗначениеЗаполнено(СтрокаСвойств), ",", "") + "Продукты";	
	КонецЕсли;
	
	Если Этаформа.Портфель Тогда
		СтрокаСвойств = СтрокаСвойств +?(ЗначениеЗаполнено(СтрокаСвойств), ",", "") + "Портфель";	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаСвойств) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках укажите данные для экспорта.");
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеДляЭкспорта = ОбработкаОбъект.СформироватьСтруктуруДанных(СтрокаСвойств);
	
	Для Каждого ТекКлиент Из Клиенты Цикл
		
		Если Не ТекКлиент.Флажок Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ДанныеДляЭкспорта.Свойство("ТаблицаКлиентов") Тогда
							
			СтрокаПриемник = ДанныеДляЭкспорта.ТаблицаКлиентов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПриемник, ТекКлиент);
			
			Для Каждого ТекКонтактнаяИнформация Из ТекКлиент.КонтактнаяИнформация Цикл 	
				СтрокаПриемник.Контакты.Добавить(Новый Структура("ТипСвязи, АдресНомер", ТекКонтактнаяИнформация.ТипСвязи, ТекКонтактнаяИнформация.АдресНомер));
			КонецЦикла;
				
		КонецЕсли; 
		
		Если ДанныеДляЭкспорта.Свойство("БанковскиеРеквизиты") Тогда 
			
			Для Каждого ТекБанковскиеРеквизиты Из ТекКлиент.БанковскиеРеквизиты Цикл 	
				СтрокаРеквизитовПриемник = ДанныеДляЭкспорта.БанковскиеРеквизиты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРеквизитовПриемник, ТекБанковскиеРеквизиты);
				СтрокаРеквизитовПриемник.Клиент = ТекКлиент.Ссылка;
				СтрокаРеквизитовПриемник.КодКлиента1Ф = ТекКлиент.Код1Ф;
			КонецЦикла;
	
		КонецЕсли;
		
		Если ДанныеДляЭкспорта.Свойство("Продукты") Тогда

			Для Каждого ТекПродукты Из ТекКлиент.Продукты Цикл 	
				СтрокаПродуктовПриемник = ДанныеДляЭкспорта.Продукты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПродуктовПриемник, ТекПродукты);
				СтрокаПродуктовПриемник.Клиент = ТекКлиент.Ссылка;
				СтрокаПродуктовПриемник.КодКлиента1Ф = ТекКлиент.Код1Ф;
			КонецЦикла;
			
		КонецЕсли; 
				
		Если ДанныеДляЭкспорта.Свойство("Операции") Тогда
		
			Для Каждого ТекОперации Из ТекКлиент.Операции Цикл 	
				СтрокаОперацийПриемник = ДанныеДляЭкспорта.Операции.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОперацийПриемник, ТекОперации);
				СтрокаОперацийПриемник.Клиент = ТекКлиент.Ссылка;
				СтрокаОперацийПриемник.КодКлиента1Ф = ТекКлиент.Код1Ф;
			КонецЦикла; 
			
		КонецЕсли;
		
		Если ДанныеДляЭкспорта.Свойство("Портфель") Тогда
		
			Для Каждого ТекПродукт Из ТекКлиент.Портфель Цикл 	
				СтрокаПортфеляПриемник = ДанныеДляЭкспорта.Портфель.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПортфеляПриемник, ТекПродукт);
				СтрокаПортфеляПриемник.Клиент = ТекКлиент.Ссылка;
				СтрокаПортфеляПриемник.КодКлиента1Ф = ТекКлиент.Код1Ф;
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Для Каждого ТаблицаДанныхДляЭкспорта Из ДанныеДляЭкспорта Цикл
		
		Если ТаблицаДанныхДляЭкспорта.Значение.Количество() > 0 Тогда	
			
			ОбработкаОбъект.Экспортировать(ДанныеДляЭкспорта);
			ОбновитьНаСервере();
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура Экспортировать(Команда)
	
	ЭкспортироватьНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура ЭкспортВсехДанныхНаСервере() 
	
	ВремяСтарта = ТекущаяДатаСеанса();
	
	СтруктураПараметров = Новый Структура; 
	
	СтруктураПараметров.Вставить("НачалоПериода", Дата(1, 1, 1));	
	СтруктураПараметров.Вставить("КонецПериода", ТекущаяДатаСеанса());
	СтруктураПараметров.Вставить("Организация", ЭтотОбъект.Организация);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Клиент) Тогда
		СтруктураПараметров.Вставить("Клиенты", РаботаСКоллекциями.ЗначениеВМассив(ЭтотОбъект.Клиент));
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьИЭкспортироватьДанные(СтруктураПараметров);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время выгрузки данных составило: " + РассчитатьВремя(ВремяСтарта));

КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьВремя(ВремяСтарта)
	
	ВремяСек = ТекущаяДатаСеанса() - ВремяСтарта; 
	ВремяМин = Цел((ВремяСек) / 60);
	
	Возврат Строка(ВремяСек) + " сек."  + ?(ВремяМин > 0, " (" + Строка(ВремяМин) + " м. " + Строка(ВремяСек - ВремяМин * 60) + " с.)","");
	
КонецФункции

&НаКлиенте
Процедура ЭкспортВсехДанных(Команда) 
	
	ЭкспортВсехДанныхНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьЗначениеФлажков(Истина);

КонецПроцедуры 

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьЗначениеФлажков(Ложь);	
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗначениеФлажков(Значение)
	
	Для Каждого ТекКлиент Из ЭтаФорма.Клиенты Цикл	
		ТекКлиент.Флажок = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьОсновныеАнкетныеДанныеКлиента", 0.1, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьОсновныеАнкетныеДанныеКлиента()
	
	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРеквизитов = "Фамилия,Имя,Отчество,Пол,ДатаРождения,СерияДокумента,НомерДокумента,ОрганВыдавшийДокумент,"
						+ "КодПодразделения,ДатаВыдачиДокумента,ДатаОкончанияДействияДокумента,ИНН,СНИЛС";
	
	МассивРеквизитов = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРеквизитов);
	
	Для Каждого ИмяРеквизита Из МассивРеквизитов Цикл	
		ЭтаФорма[ИмяРеквизита] = ТекущиеДанные[ИмяРеквизита];	
	КонецЦикла;
	
	ЭтаФорма.Элементы.ГруппаПользователь.Заголовок = 
			ТекущиеДанные.Фамилия + " " + 
			ТекущиеДанные.Имя + 
			?(ЗначениеЗаполнено(ТекущиеДанные.Отчество), " " + ТекущиеДанные.Отчество, "") +
			?(ЗначениеЗаполнено(ТекущиеДанные.Код1Ф), " (id " + ТекущиеДанные.Код1Ф + ")", "");
		
КонецПроцедуры 

&НаСервере
Процедура ЭкспортВсехПортфелейНаСервере()

	ВремяСтарта = ТекущаяДатаСеанса();
	
	СтруктураПараметров = Новый Структура; 
	
	СтруктураПараметров.Вставить("Дата", ТекущаяДатаСеанса());
	СтруктураПараметров.Вставить("Организация", ЭтотОбъект.Организация);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Клиент) Тогда
		СтруктураПараметров.Вставить("Клиенты", РаботаСКоллекциями.ЗначениеВМассив(ЭтотОбъект.Клиент));
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЭкспортироватьВсеПортфели(СтруктураПараметров); 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время выгрузки данных составило: " + РассчитатьВремя(ВремяСтарта));
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортВсехПортфелей(Команда)
	
	ЭкспортВсехПортфелейНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтоимостьАктивовНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", ЭтотОбъект.Период);
	СтруктураПараметров.Вставить("Организация", ЭтотОбъект.Организация);

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьСтоимостиАктивов(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтоимостьАктивов(Команда)
	
	ОбновитьСтоимостьАктивовНаСервере(); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьКодыНаСервере() 
	
	Если ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейРегистра = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.ВнешняяСистема.Установить(Справочники.ВнешниеСистемы.ПерваяФормаКоллЦентра);
    НаборЗаписейРегистра.Прочитать(); 
	
	Если НаборЗаписейРегистра.Количество() > 0 Тогда
		НаборЗаписейРегистра.Очистить();
	    НаборЗаписейРегистра.Записать();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКоды(Команда) 
	
	УдалитьКодыНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура КомандаТестВыгрузкиНаСервере()
	
	Если ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза Тогда
		Возврат;
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	
	МассивКлиентов = Новый Массив;
	
	Для Каждого ТекКлиент Из ЭтотОбъект.Клиенты Цикл
		
		Если Не ТекКлиент.Флажок Тогда
			Продолжить;
		КонецЕсли; 
		
		МассивКлиентов.Добавить(ТекКлиент.Ссылка);
				
	КонецЦикла; 
	
	Если МассивКлиентов.Количество() > 0 Тогда
		ОбработкаОбъект.ЭкспортироватьДанныеКлиентовПослеАктивацииЛКК(ЭтотОбъект.Организация, МассивКлиентов);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура КомандаТестВыгрузки(Команда)
	КомандаТестВыгрузкиНаСервере();
КонецПроцедуры

