
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	ЭтаФорма.НКД = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ЭтаФорма.Облигация, ЭтаФорма.Дата, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
	//ВалютаНоминала = ЭтаФорма.Облигация.ВалютаНоминала;
	ЭтаФорма.НКДф = Справочники.Облигации.ПолучитьКупон(ЭтаФорма.Облигация, ЭтаФорма.Дата, Справочники.СчетаДоверительногоУправления.ПустаяСсылка(), , , Истина);
КонецПроцедуры
