
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период      = ТекущаяДата() - 86400;
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ОсновнойВариант = КлючТекущегоВарианта = "Основной";
	Элементы.СчетДоверительногоУправления.Видимость = Не ОсновнойВариант;
	Элементы.ЮрФизЛицо.Видимость = ОсновнойВариант;
	Отчет.КлючТекущегоВарианта = КлючТекущегоВарианта;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
