
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Наименование, НомерДела");

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
		// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);

#Область КонтрольУникальностиПоНомеру

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	СудебныеДела.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СудебныеДела КАК СудебныеДела
			|ГДЕ
			|	СудебныеДела.Организация = &Организация
			|	И СудебныеДела.НомерДела = &НомерДела
			|	И СудебныеДела.Ссылка <> &Ссылка
			|	И НЕ СудебныеДела.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("НомерДела",		ЭтотОбъект.НомерДела);
		Запрос.УстановитьПараметр("Ссылка",			ЭтотОбъект.Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Судебное дело с такими номером уже было создано", ЭтотОбъект, "НомерДела",, Отказ);
		КонецЕсли;
		
#КонецОбласти		
		
	КонецЕсли;
		
КонецПроцедуры

