
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормаИсточник = ПараметрыВыполненияКоманды.Источник; 
	
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(ФормаИсточник, "Объект")
		И ОбщегоНазначенияКлиентСервер.ПолеСуществует(ФормаИсточник.Объект, "Ссылка")		
		И ТипЗнч(ФормаИсточник.Объект.Ссылка) = Тип("ДокументСсылка.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах")
	Тогда
		
		// Вызвано из формы объекта
		
		РеквизитыДокумента	= ФормаИсточник.Объект;	
		РежимОткрытияОкна	= РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		Если Не РеквизитыДокумента.Проведен Тогда
			ПоказатьПредупреждение(Неопределено, "Перед формированием отчета необходимо провести документ.");
			Возврат;
		КонецЕсли;
		
	Иначе
		
		// Вызвано из списка по ссылке
		
		РеквизитыДокумента	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрКоманды, "Проведен, Клиент, Организация, ДатаНачалаДействия, ЦеннаяБумага");
		РежимОткрытияОкна	= РежимОткрытияОкнаФормы.Независимый;
		
	КонецЕсли;
	
	СпециализированныйДепозитарий	= ПолучитьСпециализированныйДепозитарийКлиента(РеквизитыДокумента.Клиент, РеквизитыДокумента.Организация, РеквизитыДокумента.ДатаНачалаДействия);	
	Подписант						= РаботаСОтчетами.ПолучитьПодписантаПоУмолчанию(ПредопределенноеЗначение("Справочник.Отчеты.БэкОфис"), РеквизитыДокумента.Организация);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация",	РеквизитыДокумента.Организация);
	Отбор.Вставить("Клиент",		РеквизитыДокумента.Клиент);
	Отбор.Вставить("Период",		РеквизитыДокумента.ДатаНачалаДействия);
	Отбор.Вставить("ЦеннаяБумага",	РеквизитыДокумента.ЦеннаяБумага);
	Отбор.Вставить("Получатель",	СпециализированныйДепозитарий);
	Отбор.Вставить("Подписант",		?(ЗначениеЗаполнено(Подписант), РаботаСОтчетами.ПолучитьКонтактноеЛицо(Подписант), Неопределено));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",					Отбор);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",	Истина);
	
	ОткрытьФорму("Обработка.ПечатьСпискаАналогичныхЦенныхБумаг.Форма.Форма", ПараметрыФормы, ФормаИсточник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, , РежимОткрытияОкна);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСпециализированныйДепозитарийКлиента(Клиент, Организация, Период)
	
	СпециализированныйДепозитарий = РегистрыСведений.КлиентыДоверительногоУправления.СпециализированныйДепозитарийКлиента(Клиент, Организация, Период);
	
	Если СпециализированныйДепозитарий = Неопределено Тогда
		ЮрЛицоДепозитария = Неопределено;	
	Иначе
		ЮрЛицоДепозитария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпециализированныйДепозитарий, "ЮрФизЛицо");
	КонецЕсли;
	
	Возврат ЮрЛицоДепозитария;	
	
КонецФункции