
Процедура ЗаполнитьЮрФизЛицо() Экспорт
	
	КодМатрих = РаботаСВнешнимиСистемами.ПолучитьКодМатрихФизическогоЛица(ЭтотОбъект);
	Если КодМатрих <> Неопределено Тогда
		
		ВнешняяСистема  = Справочники.ВнешниеСистемы.Матрих;
		ГруппаОбъектов  = Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемах.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах КАК КодыВоВнешнихСистемах
		|ГДЕ
		|	КодыВоВнешнихСистемах.ВнешняяСистема = &ВнешняяСистема
		|	И КодыВоВнешнихСистемах.ГруппаОбъектов = &ГруппаОбъектов
		|	И КодыВоВнешнихСистемах.Код = &Код");
		
		Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
		Запрос.УстановитьПараметр("ГруппаОбъектов", ГруппаОбъектов);
		Запрос.УстановитьПараметр("Код", КодМатрих);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЮрФизЛицо = Выборка.Объект;
			
		Иначе
			
			Если ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза Тогда
				
				ИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
				ИмпортНСИ.ГруппаПравил                     = "Матрих";
				ИмпортНСИ.ГруппаОбъектов                   = Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица;
				ИмпортНСИ.Организация                      = Организация;
				ИмпортНСИ.Подразделение                    = Справочники.Подразделения.ГруппаКомпаний;
				ИмпортНСИ.Язык                             = Справочники.Языки.Русский;
				ИмпортНСИ.НеСообщатьОСозданииНовыхОбъектов = Истина;
				ИмпортНСИ.НеСообщатьОбОтсутствииИзменений  = Истина;
				
				СтрокаТабЧасти = ИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
				СтрокаТабЧасти.КодВоВнешнейСистеме = КодМатрих;
				ИмпортНСИ.ИмпортироватьДанные();
				
				ЮрФизЛицо = РаботаСВнешнимиСистемами.НайтиЗначениеПоКодуВнешнейСистемы(Справочники.ВнешниеСистемы.Матрих, ИмпортНСИ.ГруппаОбъектов, КодМатрих);
				
			Иначе
				
				ЮрФизЛицоОбъект = Справочники.ЮрФизЛица.СоздатьЭлемент();
				ЮрФизЛицоОбъект.Родитель     = Справочники.ЮрФизЛица.ФизическиеЛица;
				ЮрФизЛицоОбъект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо;
				ЮрФизЛицоОбъект.Наименование = Фамилия + " " + Лев(Имя, 1) + "." + ?(ПустаяСтрока(Отчество), "", " " + Лев(Отчество, 1) + ".");
				ЮрФизЛицоОбъект.УстановитьНовыйКод();
				
				ЮрФизЛицоОбъект.ДополнительныеСвойства.Вставить("ИмпортИзВнешнейСистемы");
				
				ЮрФизЛицоОбъект.Записать();
				
				ЮрФизЛицо = ЮрФизЛицоОбъект.Ссылка;
				
				РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(ЮрФизЛицо, ВнешняяСистема, ГруппаОбъектов, КодМатрих); 
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ВызватьИсключение "Не удалось создать Юр/физ лицо";
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		и ДанныеЗаполнения.Свойство("ЮрФизЛицо") Тогда
		
		ДанныеЗаполнения.Свойство("ЮрФизЛицо", ЮрФизЛицо);
		ДанныеЗаполнения.Свойство("Организация", Организация);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = &Язык) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = &Язык) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних");
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);
		Запрос.УстановитьПараметр("Язык", Справочники.Языки.Русский);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка.Регистратор,,"Дата,Номер,Проведен,ПометкаУдаления,УпрощеннаяИдентификация,ИсточникАнкеты,Ответственный,Комментарий");
			ПредставителиВыгодоприобретатели.Загрузить(Выборка.Регистратор.ПредставителиВыгодоприобретатели.Выгрузить());
			
		КонецЕсли;		
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ НалоговыйРезидентИностранногоГосударства
		И ПроверяемыеРеквизиты.Найти("НалоговыйРезидентИностранногоГосударстваГосударство") <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НалоговыйРезидентИностранногоГосударстваГосударство"));
	КонецЕсли;
	
	Если НЕ ИностранныйНалогоплательщик Тогда
		
		Если ПроверяемыеРеквизиты.Найти("ИностранныйНалогоплательщикГосударство") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИностранныйНалогоплательщикГосударство"));
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("ИностранныйНалогоплательщикОснования") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИностранныйНалогоплательщикОснования"));
		КонецЕсли;
		
	КонецЕсли;
	
	// Часть проверок при упрощенной идентификации делать не требуется
	Если УпрощеннаяИдентификация Тогда

		Если ПроверяемыеРеквизиты.Найти("Гражданство") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Гражданство"));
		КонецЕсли;
		
	Иначе
		
		Если Не (ЦельПриобретениеПаев ИЛИ ЦельДоверительноеУправление ИЛИ ЦельДругое) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны цели установления отношений", Ссылка, "ЦельДругое", "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Отбор = Новый Структура("ВидУчастника", Перечисления.ВидыУчастниковАнкет.БенефициарныйВладелецУстановленныйКомпанией);
	БенефициарныеВладельцыУстановленныеКомпанией = ЭтотОбъект.ПредставителиВыгодоприобретатели.НайтиСтроки(Отбор);
	
	Если БенефициарныеВладельцыУстановленныеКомпанией.Количество() = 0 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БенефициарныйВладелецОбоснование"));
	КонецЕсли;
	
	Если РаботаСДокументами.ОрганизацияРаботаетСРозницейПИФ(ЭтотОбъект.Организация, ЭтотОбъект.Дата) Тогда
		ПроверяемыеРеквизиты.Добавить("СпособУведомленияОбОперацияхПоЛицевомуСчету");	
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если Не ЗначениеЗаполнено(ЮрФизЛицо) Тогда
			ЗаполнитьЮрФизЛицо();
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(ЮрФизЛицо) Тогда
			Для каждого СтрокаТабличнойЧасти из БанковскиеРеквизиты Цикл
				Справочники.БанковскиеСчета.СоздатьПолучитьРасчетныйСчет(
					СтрокаТабличнойЧасти.РасчетныйСчет, 
					ЭтотОбъект.Организация, 
					СтрокаТабличнойЧасти.БИК, 
					СтрокаТабличнойЧасти.НомерСчета, 
					ЭтотОбъект.ЮрФизЛицо, 
					ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЛицевойСчет),, 
					Отказ);
			КонецЦикла;
		КонецЕсли;
		
		#Область СверкаСоСписками
		
		Если ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
			// выполняем сверку только при выполнении следующих условий:
			// - это последняя анкета по данному физику
			// - был изменен как минимум один из значимых для проверки реквизитов
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	АнкетаФизическогоЛица.Фамилия КАК Фамилия,
				|	АнкетаФизическогоЛица.Имя КАК Имя,
				|	АнкетаФизическогоЛица.Отчество КАК Отчество,
				|	АнкетаФизическогоЛица.ДатаРождения КАК ДатаРождения,
				|	АнкетаФизическогоЛица.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
				|	АнкетаФизическогоЛица.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
				|	АнкетаФизическогоЛица.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
				|	АнкетаФизическогоЛица.ИНН КАК ИНН,
				|	АнкетаФизическогоЛица.СНИЛС КАК СНИЛС,
				|	АнкетаФизическогоЛица.EMail КАК EMail,
				|	АнкетаФизическогоЛица.ТелефонДляОповещения КАК ТелефонДляОповещения,
				|	АнкетаФизическогоЛица.Проведен КАК Проведен,
				|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор
				|ИЗ
				|	Документ.АнкетаФизическогоЛица КАК АнкетаФизическогоЛица
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|				,
				|				Организация = &Организация
				|					И ЮрФизЛицо = &ЮрФизЛицо
				|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
				|		ПО (РеквизитыФизическихЛицАнкетныеСрезПоследних.Период > &Дата)
				|ГДЕ
				|	АнкетаФизическогоЛица.Ссылка = &Ссылка";

			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
			Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.ЮрФизЛицо);

			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() И Выборка.Проведен Тогда
				
				Если Выборка.Регистратор = Неопределено Тогда
					// это последний регистратор - проверяем реквизиты
					
					ПоказателиСверкиСоСпискомОтказников					= РегистрыСведений.ЖурналСверкиСоСписками.ПоказателиСверкиСоСпискомОтказников(Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);
					ПоказателиСверкиСоСпискомОбщие						= РегистрыСведений.ЖурналСверкиСоСписками.ПоказателиСверкиСоСпискомОбщие(Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);
					ПоказателиЭкспортаКонтактнойИнформацииВБухгалтерию	= ПоказателиЭкспортаКонтактнойИнформацииВБухгалтерию();
					ПоказателиСверкиСоСпискомНедействительныхПаспортов	= РегистрыСведений.ЖурналСверкиСоСписками.ПоказателиСверкиСоСпискомНедействительныхПаспортов(Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);
					ПоказателиСверкиСоСпискомДисквалифицированныхЛиц	= РегистрыСведений.ЖурналСверкиСоСписками.ПоказателиСверкиСоСпискомДисквалифицированныхЛиц(Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);
					
					Для Каждого Показатель Из ПоказателиСверкиСоСпискомОтказников Цикл
						Если Выборка[Показатель] <> ЭтотОбъект[Показатель] Тогда
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомОтказников");
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
					Для Каждого Показатель Из ПоказателиСверкиСоСпискомНедействительныхПаспортов Цикл
						Если Выборка[Показатель] <> ЭтотОбъект[Показатель] Тогда
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомНедействительныхПаспортов");
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
					Для Каждого Показатель Из ПоказателиСверкиСоСпискомОбщие Цикл
						Если Выборка[Показатель] <> ЭтотОбъект[Показатель] Тогда
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомТеррористов");
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомРешенийМВК");
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомФРОМУ");
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьССанкционнымСписком");
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьССанкционнымСпискомНедружественныхГосударств");
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
					Для Каждого Показатель Из ПоказателиЭкспортаКонтактнойИнформацииВБухгалтерию Цикл
						Если Выборка[Показатель] <> ЭтотОбъект[Показатель] Тогда
							ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭкспортироватьКонтактнуюИнформациюВБухгалтерию");
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
					Для Каждого Показатель Из ПоказателиСверкиСоСпискомДисквалифицированныхЛиц Цикл
						Если Выборка[Показатель] <> ЭтотОбъект[Показатель] Тогда
							ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомДисквалифицированныхЛиц");
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
				КонецЕсли; 
			Иначе
				// документ новый - проверяем в любом случае
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьССанкционнымСписком");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомОтказников");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомНедействительныхПаспортов");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомТеррористов");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомРешенийМВК");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомФРОМУ");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭкспортироватьКонтактнуюИнформациюВБухгалтерию");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьСоСпискомДисквалифицированныхЛиц");
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СверитьССанкционнымСпискомНедружественныхГосударств");
			КонецЕсли; 
			
		КонецЕсли; 
		
		#КонецОбласти 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтотОбъект.Дата > КонецДня(ТекущаяДата()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя проводить документ '" + Метаданные().Представление() + "' будущей датой!",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Движения.РеквизитыФизическихЛицАнкетные.Очистить();
	
	Запись = Движения.РеквизитыФизическихЛицАнкетные.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект);
	
	Запись.Период     = Дата;
	Запись.Активность = Истина;
	Запись.Язык       = Справочники.Языки.Русский;
	
	
	Для Каждого СтрокаРеквизитыНаИностранныхЯзыках Из ЭтотОбъект.РеквизитыНаИностранныхЯзыках Цикл
		
		Если ЗначениеЗаполнено(СтрокаРеквизитыНаИностранныхЯзыках.Фамилия) Тогда 
			
			Запись = Движения.РеквизитыФизическихЛицАнкетные.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект, "Организация,ЮрФизЛицо,РезидентРФ");
			ЗаполнитьЗначенияСвойств(Запись, СтрокаРеквизитыНаИностранныхЯзыках);
						
			Запись.Период     = Дата;
			Запись.Активность = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.РеквизитыФизическихЛицАнкетные.Записать(Истина);		
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьССанкционнымСписком") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СанкционныйСписок, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЭтотОбъект.ЮрФизЛицо));
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьСоСпискомОтказников") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомОтказников(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо,, ЭтотОбъект.Дата,,, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты, ДатаПоследнейСверки", ЭтотОбъект.ЮрФизЛицо, ЭтотОбъект.Дата));
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьСоСпискомНедействительныхПаспортов") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомНедействительныхПаспортов(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо,,, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЭтотОбъект.ЮрФизЛицо));
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьСоСпискомТеррористов") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СписокТеррористов, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЭтотОбъект.ЮрФизЛицо));
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьСоСпискомРешенийМВК") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СписокРешенийМВК, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЭтотОбъект.ЮрФизЛицо));
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьСоСпискомФРОМУ") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СписокФРОМУ, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЭтотОбъект.ЮрФизЛицо));
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭкспортироватьКонтактнуюИнформациюВБухгалтерию") Тогда
		ЭкспортКонтактнойИнформацииФизЛицВБухгалтерию();
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьСоСпискомДисквалифицированныхЛиц") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо, ЭтотОбъект.Дата,,, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты, ДатаПоследнейСверки", ЭтотОбъект.ЮрФизЛицо, ЭтотОбъект.Дата));
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СверитьССанкционнымСпискомНедружественныхГосударств") Тогда
		РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком(ЭтотОбъект.Организация, ЭтотОбъект.ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СанкционныйСписокНедружественныхГосударств, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЭтотОбъект.ЮрФизЛицо));
	КонецЕсли;
	
		
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти 

Процедура ЭкспортКонтактнойИнформацииФизЛицВБухгалтерию()
	
	ПараметрыЭкспортаКонтактнойИнформации = Новый Структура;
	ПараметрыЭкспортаКонтактнойИнформации.Вставить("АнкетаФизическогоЛица", ЭтотОбъект.Ссылка);
	
	РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(
		Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "_ЭкспортКонтактнойИнформацииФизЛицВБухгалтерию"),
		"ЭкспортКонтактнойИнформации",
		ПараметрыЭкспортаКонтактнойИнформации);
	
КонецПроцедуры

Функция ПоказателиЭкспортаКонтактнойИнформацииВБухгалтерию() Экспорт
	
	Показатели = Новый Массив;
	Показатели.Добавить("EMail");
	Показатели.Добавить("ТелефонДляОповещения");
		
	Возврат Показатели;
	
КонецФункции

