
Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, "Дата, Организация, СчетДоверительногоУправления");
	
	Если (ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров")
			Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.РегистрацияСтоимостиПереоценки")
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "ЦельРасчета") = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении)
		И (РеквизитыДокумента.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
			Или РеквизитыДокумента.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")) Тогда
			
		Запрос = Новый Запрос;
		
#Область Текст_Запроса
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НАЧАЛОПЕРИОДА(СтоимостьПереоценки.Период, ДЕНЬ) КАК Дата,
			|	СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СтоимостьПереоценки.Организация КАК Организация
			|ПОМЕСТИТЬ _НаборДанныхДоИзменения
			|ИЗ
			|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
			|ГДЕ
			|	СтоимостьПереоценки.Регистратор = &Регистратор
			|	И СтоимостьПереоценки.Организация = &Организация
			|	И СтоимостьПереоценки.Активность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НАЧАЛОПЕРИОДА(НовыйНаборДанных.Период, ДЕНЬ) КАК Дата,
			|	НовыйНаборДанных.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НовыйНаборДанных.Организация КАК Организация,
			|	НовыйНаборДанных.Активность КАК Активность
			|ПОМЕСТИТЬ _НовыйНаборДанных
			|ИЗ
			|	&НовыйНаборДанных КАК НовыйНаборДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_НаборДанныхДоИзменения.Дата КАК Дата,
			|	_НаборДанныхДоИзменения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_НаборДанныхДоИзменения.Организация КАК Организация
			|ИЗ
			|	_НаборДанныхДоИзменения КАК _НаборДанныхДоИзменения
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	_НовыйНаборДанных.Дата,
			|	_НовыйНаборДанных.СчетДоверительногоУправления,
			|	_НовыйНаборДанных.Организация
			|ИЗ
			|	_НовыйНаборДанных КАК _НовыйНаборДанных
			|ГДЕ
			|	_НовыйНаборДанных.Активность";
#КонецОбласти
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.УстановитьПараметр("Организация", РеквизитыДокумента.Организация);
		Запрос.УстановитьПараметр("НовыйНаборДанных", ЭтотОбъект.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПараметрыОтложенногоЗаданияВыгрузкиДанныхВAssets", РезультатЗапроса.Выгрузить());
		КонецЕсли;
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьОтложенноеЗаданиеВыгрузкиДанныхВАссетс()
	
	ТекДатаСеанса = ТекущаяДатаСеанса();
	
	Выходной = Не Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекДатаСеанса);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_ЭкспортДанныхДляРисков");
		
	Если ОбработкаСсылка = Неопределено Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("В справочнике дополнительных отчетов и обработок отсутствует обработка с именем [_ЭкспортДанныхДляРисков]", "Экспорт данных для рисков");
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПараметров Из ЭтотОбъект.ДополнительныеСвойства.ПараметрыОтложенногоЗаданияВыгрузкиДанныхВAssets Цикл
		
		//Не создаем фоновые задания, пока в текущем дне не запускалось регламентное задание (по расписанию в 15:00).
		Если СтрокаПараметров.Дата >= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекДатаСеанса, ?(Выходной , -1, -2)) И (Час(ТекДатаСеанса) < 15 Или Выходной) Тогда
			Продолжить;		
		КонецЕсли;
		
		ПараметрыОбработки = Новый Структура("Дата, Организация, СчетДоверительногоУправления, ИсточникОшибки",,,, "Экспорт данных для рисков");
		ЗаполнитьЗначенияСвойств(ПараметрыОбработки, СтрокаПараметров); 
			
		ДатаЗапуска = ?(Час(ТекДатаСеанса) < 16 И Минута(ТекДатаСеанса) < 15, ТекДатаСеанса + 15 * 60, Неопределено);
		
		РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ОбработкаСсылка, "ЭкспортДанныхВ_Assets1C8", ПараметрыОбработки, 15, Истина, ДатаЗапуска);
							
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ПараметрыОтложенногоЗаданияВыгрузкиДанныхВAssets") Тогда
		СоздатьОтложенноеЗаданиеВыгрузкиДанныхВАссетс();
	КонецЕсли;
	
КонецПроцедуры
 