
// Проверяет, контролируются ли необходимые расходы по клиенту и виду договора
//
//	Параметры:
//		- СчетДоверительногоУправления 	- счет доверительного управления
//		- Период 						- дата
//
Функция НеобходимыеРасходыКонтролируютсяПоКлиентуИВидуДоговора(Организация, СчетДоверительногоУправления, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);	
	
	ДатаНачала = ДатаНачалаПримененияКонтроляНеобходимыхРасходовПоКлиентуИВидуДоговора();
	Запрос.УстановитьПараметр("ДатаНачала", 					ДатаНачала);
	
	// Сначала проверим дату последней записи по этому счету ДУ в регистре
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.УсловияДоговоровДоверительногоУправления.СрезПоследних(
		|			&ДатаНачала,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияДоговоровДоверительногоУправленияСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДатаПроверки = ?(Выборка.Следующий(), ?(Выборка.Период > Период, Период, ДатаНачала), Период);				
		
	ПоместитьДоговорыСКонтролемНеобходимыхРасходовПоКлиентуИВидуДоговораВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, Организация, ДатаПроверки);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУСКонтролемПоКлиентуИВидуДоговора.Ссылка КАК Ссылка
		|ИЗ
		|	_СчетаДУСКонтролемПоКлиентуИВидуДоговора КАК _СчетаДУСКонтролемПоКлиентуИВидуДоговора
		|ГДЕ
		|	_СчетаДУСКонтролемПоКлиентуИВидуДоговора.Ссылка = &СчетДоверительногоУправления";	
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Помещает счета доверительного управления, неодходимые расходы у которых контролируются в целом по клиенту и виду договора, в менеджер временных таблиц 
// 
// 	Параметры:
//		- МенеджерВременныхТаблиц 	- менеджер временных таблиц
//		- Организация				- организация
// 		- Период					- дата
//		- ИмяВременнойТаблицы		- имя временной таблицы, в которую помещается результат
//
Процедура ПоместитьДоговорыСКонтролемНеобходимыхРасходовПоКлиентуИВидуДоговораВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, Организация, Период, ИмяВременнойТаблицы = "_СчетаДУСКонтролемПоКлиентуИВидуДоговора") Экспорт
		
	Если Период >= ДатаНачалаПримененияКонтроляНеобходимыхРасходовПоКлиентуИВидуДоговора() Тогда
		
		Отбор = Новый Структура("Организация, Клиент, ВидДоговораДоверительногоУправления", Организация, Кэширование.КлиентыГруппыБудущее(), Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
		Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, Период, Отбор, ИмяВременнойТаблицы);
		
	Иначе
		
		ТаблицаКомиссий = Новый ТаблицаЗначений;
		ТаблицаКомиссий.Колонки.Добавить("Ссылка",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
				
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаКомиссий, ИмяВременнойТаблицы, МенеджерВременныхТаблиц); 

	КонецЕсли;
	
КонецПроцедуры

Функция ДатаНачалаПримененияКонтроляНеобходимыхРасходовПоКлиентуИВидуДоговора()
	
	// С 01.01.2024 необходимые расходы по договорам ПН группы Будущее 
	// контролируются не по каждому договору, а по клиенту и виду договора в целом	
	Возврат '20240101';
	
КонецФункции

// Обпределяет, начисляется ли вознаграждение управляющего в базе собственной бухгалтерии (т. е. за счет собственных средств клиента)
//
//	Параметры:
//		- Организация 					- организация
//		- СчетДоверительногоУправления 	- проверяемый счет ДУ
//		- Дата 							- дата проверки
//		- Отказ							- признак отказа
//
Функция ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Организация, СчетДоверительногоУправления, Дата, Отказ) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента КАК ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента
		|ИЗ
		|	РегистрСведений.УсловияДоговоровДоверительногоУправления.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияДоговоровДоверительногоУправленияСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Дата", 							Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента;		
	Иначе
					
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для счета ДУ %1 в организации %2 отсутствуют настройки в регистре 'Условия договоров доверительного управления' на дату %3",
																СчетДоверительногоУправления, Организация, Формат(Дата, "ДФ=dd.MM.yyyy")), СчетДоверительногоУправления,,, Отказ); 
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Для вида договора доверительного управления определяет, может ли быть в условиях договора предусмотрена 
// возможность оплаты вознаграждения управляющего и расходов спецдепозитария за счет собственных средств клиента
//
Функция ДляВидаДоговораДУВозможнаОплатаВознагражденияУправляющегоИРасходовСпецдепозитарияИзСобственныхСредствКлиента(ВидДоговораДоверительногоУправления) Экспорт
	
	МассивВидовДоговоров = Новый Массив;
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
	
	Возврат МассивВидовДоговоров.Найти(ВидДоговораДоверительногоУправления) <> Неопределено;
	
КонецФункции
