
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет 
			И НЕ ЗначениеЗаполнено(Запись.ТипИнвестиционногоНалоговогоВычета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В условиях Счета ДУ """ + Запись.СчетДоверительногоУправления + """ не указан ""Тип инвестиционного налогового вычета""",,,,Отказ);
		КонецЕсли;
		
		Если (Запись.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ
				Или Запись.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
			И НЕ ЗначениеЗаполнено(Запись.НеобходимыеРасходы) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В условиях Счета ДУ """ + Запись.СчетДоверительногоУправления + """ не заполнен предельный процент необходимых расходов",,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьВСоставеСчетаДоверительногоУправления")
		И НЕ УниверсальныеМеханизмы.УдалениеНабораЗаписейРегистраВСоставеВедущегоИзмерения(ЭтотОбъект) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение условий доворов ДУ производится через форму счёта внутреннего учёта",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// Проверим, разрешен ли флажок оплаты вознаграждений и расходов спец. депа за счет средств клиента	
	Если ЕстьОшибкиЗаполненияФлагаОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "СчетДоверительногоУправления");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		УниверсальныеМеханизмы.ПроверкаЗаполненияИзмеренияИлиРесурса(ЭтотОбъект, Запись, "ВариантСрокаПролонгации", Отказ, Запись.АвтоматическаяПролонгация);
		
		Если Запись.ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоЛетСрокаПролонгации
		 ИЛИ Запись.ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоДнейСрокаПролонгации Тогда
			УниверсальныеМеханизмы.ПроверкаЗаполненияИзмеренияИлиРесурса(ЭтотОбъект, Запись, "СрокПролонгации", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьОшибкиЗаполненияФлагаОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Отказ)
		
	Если ЭтотОбъект.Количество() > 0 Тогда
	
		ТаблицаНабораЗаписей = ЭтотОбъект.Выгрузить();
		
		СтрокиСФлагом = ТаблицаНабораЗаписей.НайтиСтроки(Новый Структура("ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента", Истина));
		      	
		Если СтрокиСФлагом.Количество() > 0 Тогда
			МассивСчетовДУ = Новый Массив;
			Для Каждого ТекСтрока Из СтрокиСФлагом Цикл
				РаботаСКоллекциями.ДополнитьМассив(МассивСчетовДУ, ТекСтрока.СчетДоверительногоУправления, Истина);
			КонецЦикла;
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
				|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
				|ИЗ
				|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|ГДЕ
				|	СчетаДоверительногоУправления.Ссылка В(&МассивСчетовДУ)
				|ИТОГИ ПО
				|	ВидДоговораДоверительногоУправления");
			
			Запрос.УстановитьПараметр("МассивСчетовДУ", МассивСчетовДУ);
			
			ТекстСообщения = "";
			ВыборкаВидДоговора = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидДоговора.Следующий() Цикл 
				
				Если РегистрыСведений.УсловияДоговоровДоверительногоУправления.ДляВидаДоговораДУВозможнаОплатаВознагражденияУправляющегоИРасходовСпецдепозитарияИзСобственныхСредствКлиента(ВыборкаВидДоговора.ВидДоговораДоверительногоУправления) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстСообщения = СтрШаблон("Для вида договора %1 не разрешена установка флага 'Оплата вознаграждения управляющего и расходов спецдепозитария за счет собственных средств клиента'. Счета ДУ этого вида:%2", ВыборкаВидДоговора.ВидДоговораДоверительногоУправления, Символы.ПС);
				ВыборкаСчетаДУ = ВыборкаВидДоговора.Выбрать();
				Пока ВыборкаСчетаДУ.Следующий() Цикл
					ТекстСообщения = ТекстСообщения + СтрШаблон("%1 - %2%3", Символы.Таб, ВыборкаСчетаДУ.СчетДоверительногоУправления, Символы.ПС);
				КонецЦикла;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
								
			КонецЦикла;
			
			Если Не ПустаяСтрока(ТекстСообщения) Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли; 
				
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции