
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.Переключатель = ЗначениеПереключателяБрокер() Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.ПереключательПолучатель = ЗначениеПереключателяБрокер() Тогда
		ПроверяемыеРеквизиты.Добавить("БрокерПолучатель");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;

	Если ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчетПолучатель");
	КонецЕсли;
	
	Если ЭтаФорма.ПоЗаявкеПайщика Тогда
		ПроверяемыеРеквизиты.Добавить("Основание");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("БанковкиеВыписки.Обновить");
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") И ИсточникВыбора.ИмяФормы = "Документ.СтрокаБанковскойВыписки.Форма.БанковкиеВыписки" Тогда
		Если ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыписки" Тогда
			Объект.СтрокаБанковскойВыписки   = ВыбранноеЗначение;
			ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
		ИначеЕсли ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыпискиПолучатель" Тогда
			Объект.СтрокаБанковскойВыпискиПолучатель   = ВыбранноеЗначение;
			ЭтаФорма.СтрокаБанковскойВыпискиПолучатель = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыпискиПолучатель);
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РеквизитыИсполнителя = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет");
	
	// проверим актуальность р/счета
	
	ИмяРегистраИсполнителей = "ИсполнителиПоДенежнымСредствам" + ?(ЭтаФорма.Переключатель = ЗначениеПереключателяБрокер(), "Брокерские", "Собственные");
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(ИмяРегистраИсполнителей, РеквизитыИсполнителя) Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	// проверим актуальность р/счета-получателя
	
	РеквизитыИсполнителя.Брокер        = Объект.БрокерПолучатель;
	РеквизитыИсполнителя.РасчетныйСчет = Объект.РасчетныйСчетПолучатель;
	
	ИмяРегистраИсполнителейПолучатель = "ИсполнителиПоДенежнымСредствам" + ?(ЭтаФорма.ПереключательПолучатель = ЗначениеПереключателяБрокер(), "Брокерские", "Собственные");
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(ИмяРегистраИсполнителейПолучатель, РеквизитыИсполнителя) Тогда
		Объект.РасчетныйСчетПолучатель = Неопределено;
	КонецЕсли;
	
	НастроитьПараметрыОтбораОснования();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	Если Элемент = Элементы.Брокер Тогда
		
		Если ЗначениеЗаполнено(Объект.Брокер) И ЗначениеЗаполнено(Объект.БрокерПолучатель) И Объект.Брокер <> Объект.БрокерПолучатель Тогда
			Объект.БрокерПолучатель = Объект.Брокер;	
		КонецЕсли;
		
		ЭтаФорма.КонтрольПереводовСчетДУ = ЭтаФорма.КонтрольПереводовСчетДУ // #Техдолг
			И РаботаСДокументами.НеобходимКонтрольПереводовБрокера(
				?(ЗначениеЗаполнено(Объект.Брокер), Объект.Брокер, Объект.БрокерПолучатель));
					
		МестоХраненияПриИзменении(Элемент);
		
		Объект.РасчетныйСчет = Неопределено;
		
	КонецЕсли;
	
	ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов("Брокер"); // не передаю элемент, т.к. вызываем еще из ПереключательОтправителяПриИзменении
	
	Если ЭтаФорма.Переключатель <> ЗначениеПереключателяБиржа() И МестоХраненияПолучателяОпределяетсяБрокеромОтправителем(ЭтаФорма, Объект) Тогда
		Объект.МестоХраненияПолучатель = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");
	КонецЕсли;
	
	Если Не ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель Тогда
		Объект.РасчетныйСчетПолучатель = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПолучательПриИзменении(Элемент)
	
	Если Элемент = Элементы.БрокерПолучатель Тогда
		
		ЭтаФорма.КонтрольПереводовСчетДУ = ЭтаФорма.КонтрольПереводовСчетДУ // #Техдолг
			И РаботаСДокументами.НеобходимКонтрольПереводовБрокера(
				?(ЗначениеЗаполнено(Объект.БрокерПолучатель), Объект.БрокерПолучатель, Объект.Брокер));		
				
		Объект.РасчетныйСчетПолучатель = Неопределено;
				
	КонецЕсли;				
					
	ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов("БрокерПолучатель"); // не передаю элемент, т.к. вызываем еще из ПереключательПолучателяПриИзменении
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
			
	Если ЗначениеЗаполнено(Объект.Брокер) И ВыбранноеЗначение <> Объект.Брокер Тогда
			
		Если Вопрос("Выбранное значение брокера получателя [" + ВыбранноеЗначение + "] не соответствует значению брокера отправителя [" + Объект.Брокер + "]. Переводы между брокерами запрещены. Для брокера получателя будет установлено значение [" + Объект.Брокер + "]. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ВыбранноеЗначение = Объект.Брокер;			
		Иначе
			ВыбранноеЗначение = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	
	ПриИзмененииПереключателя("");
	
	БрокерПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПолучательПриИзменении(Элемент)
	
	ПриИзмененииПереключателя("Получатель");
	
	БрокерПолучательПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
	
		Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ВалютаРасчетногоСчета Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта " + Объект.Валюта + " на " + ВалютаРасчетногоСчета + " из расчетного счета.");
						
		КонецЕсли;
		
		Объект.Валюта = ВалютаРасчетногоСчета;
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВалютаВыбранногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Валюта");
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
		ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");
			
		Если ВалютаРасчетногоСчетаПолучателя <> ВалютаВыбранногоСчета Тогда
			
			Если Вопрос("Валюта " + ВалютаРасчетногоСчетаПолучателя + " расчетного счета КУДА не соответствует валюте " + ВалютаВыбранногоСчета + " расчетного счёта " + ВыбранноеЗначение + ". Расчетный счёт КУДА будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.РасчетныйСчетПолучатель = Неопределено;			
			Иначе
				ВыбранноеЗначение = Объект.РасчетныйСчет;			
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПолучательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
		ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");
		
		Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
			
			ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
			
			Если ВалютаРасчетногоСчетаПолучателя <> ВалютаРасчетногоСчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта " + ВалютаРасчетногоСчетаПолучателя + " расчетного счета " + Объект.РасчетныйСчетПолучатель + " отличается от валюты " + ВалютаРасчетногоСчета + " расчетного счета ОТКУДА.",,, "Объект.РасчетныйСчетПолучатель");
				Объект.РасчетныйСчетПолучатель = Неопределено;
			КонецЕсли;
			
		Иначе
				
			Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ВалютаРасчетногоСчетаПолучателя Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта " + Объект.Валюта + " на " + ВалютаРасчетногоСчетаПолучателя + " из расчетного счета.");
							
			КонецЕсли;
			
			Объект.Валюта = ВалютаРасчетногоСчетаПолучателя;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Объект.МестоХранения             = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");
	Объект.МестоХраненияПолучатель   = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");
	ЭтаФорма.КонтрольПереводовСчетДУ = РаботаСДокументами.ДействуетКонтрольПрямыхПереводНаСчетаБиржи(Объект.СчетДоверительногоУправления); // #Техдолг
	
	НастроитьПараметрыОтбораОснования();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	
	Если ПолучательОпределяетсяБрокеромОтправителем(ЭтаФорма, Объект) Тогда
		
		ЭтаФорма.ФлагБрокерПолучатель	 = Истина;
		ЭтаФорма.ПереключательПолучатель = ЗначениеПереключателяБрокер();
		
		Объект.БрокерПолучатель			 = Объект.Брокер;
		Объект.РасчетныйСчетПолучатель	 = Неопределено;
	
		ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов("БрокерПолучатель");
		
	КонецЕсли;
	
	Если Элемент = Элементы.МестоХранения Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	НастроитьВидимостьИДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПоЗаявкеПайщикаПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ПоЗаявкеПайщика Тогда
		Объект.Основание = ПредопределенноеЗначение("Документ.ПоручениеНаПереводДенежныхСредств.ПустаяСсылка");
	Иначе
		Объект.Основание = ПредопределенноеЗначение("Документ.ЗаявкаПайщика.ПустаяСсылка");
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ВариантПереводаПриИзменении(Элемент)
	
	Если Объект.ВариантПеревода = ПредопределенноеЗначение("Перечисление.ВариантыПереводаДенежныхСредств.ПереводИзПути") Тогда
		
		Объект.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная");
		Объект.МестоХранения        = Неопределено;
		Объект.Брокер               = Неопределено;
		Объект.РасчетныйСчет        = Неопределено;
		Объект.Касса                = Неопределено;
		
		ЭтаФорма.Переключатель					= ЗначениеПереключателяБанк();
		ЭтаФорма.ФлагБрокер                   	= Ложь;
		ЭтаФорма.ДетализацияПоРасчетномуСчету	= Истина;
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаДенежныхСредствПриИзменении(Элемент)
	
	ПриИзмененииФормыДенежныхСредств("");
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаДенежныхСредствПолучательПриИзменении(Элемент)
	
	ПриИзмененииФормыДенежныхСредств("Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНажатие(Элемент, СтандартнаяОбработка)
	
	СтруктураОтбора = ПолучитьСтруктуруОтбора(Объект.Организация, Объект.РасчетныйСчет, Объект.РасчетныйСчетПолучатель, ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход"));
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, ВидДвижения, Сумма, Контрагент, РасчетныйСчетКонтрагента",
			Объект.Дата,
			Объект.Организация,
			СтруктураОтбора.РасчетныйСчет,
			СтруктураОтбора.ВидДвижения,
			Объект.Сумма,
			СтруктураОтбора.Контрагент,
			СтруктураОтбора.РасчетныйСчетПолучатель),
		"СтрокаБанковскойВыписки",
		ЭтаФорма,
		СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиПолучательНажатие(Элемент, СтандартнаяОбработка)
	
	СтруктураОтбора = ПолучитьСтруктуруОтбора(Объект.Организация, Объект.РасчетныйСчет, Объект.РасчетныйСчетПолучатель, ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход"));
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, ВидДвижения, Сумма, Контрагент, РасчетныйСчетКонтрагента",
			Объект.Дата,
			Объект.Организация,
			СтруктураОтбора.РасчетныйСчетПолучатель,
			СтруктураОтбора.ВидДвижения,
			Объект.Сумма,
			СтруктураОтбора.Контрагент,
			СтруктураОтбора.РасчетныйСчет),
		"СтрокаБанковскойВыпискиПолучатель",
		ЭтаФорма,
		СтандартнаяОбработка);

КонецПроцедуры
	
&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчет);
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчетПолучатель);

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	ВыборИсполнителя(Команда.Имя);
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) И ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");
		
		Если ВалютаРасчетногоСчета <> ВалютаРасчетногоСчетаПолучателя Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет КУДА был очищен, т.к. валюта " + ВалютаРасчетногоСчетаПолучателя + " отличается от валюты " + ВалютаРасчетногоСчета + " расчетного счета ОТКУДА.",,, "Объект.РасчетныйСчетПолучатель");
			Объект.РасчетныйСчетПолучатель = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РасчетныйСчетПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель(Команда)
	
	ВыборИсполнителя(Команда.Имя);
	РасчетныйСчетПолучательПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте 
Процедура ВыборИсполнителя(ИмяКоманды)
	
	Если ИмяКоманды = "КомандаВыбратьИсполнителяПоДенежнымСредствам" Тогда
		
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.ФлагБрокер);
		
	ИначеЕсли ИмяКоманды = "КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель" Тогда
		
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.ФлагБрокерПолучатель,
			Новый Структура("Брокер, РасчетныйСчет, СчетДоверительногоУправления", "БрокерПолучатель", "РасчетныйСчетПолучатель", "СчетДоверительногоУправления"));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
		
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОтправительЯвляетсяБиржей	= (Форма.Переключатель = ЗначениеПереключателяБиржа());
	ОтправительЯвляетсяБрокером	= (Форма.Переключатель = ЗначениеПереключателяБрокер());
	ОтправительЯвляетсяБанком	= (Форма.Переключатель = ЗначениеПереключателяБанк());
	
	ПолучательЯвляетсяБиржей	= (Форма.ПереключательПолучатель = ЗначениеПереключателяБиржа());
	ПолучательЯвляетсяБрокером	= (Форма.ПереключательПолучатель = ЗначениеПереключателяБрокер());
	ПолучательЯвляетсяБанком	= (Форма.ПереключательПолучатель = ЗначениеПереключателяБанк());
	
	Элементы.Брокер.Видимость 	      	= ОтправительЯвляетсяБрокером;
	Элементы.БрокерПолучатель.Видимость = ПолучательЯвляетсяБрокером;
	
	Элементы.МестоХранения.Доступность 	         = ЗначениеЗаполнено(Объект.Брокер);
	Элементы.МестоХраненияПолучатель.Доступность = ЗначениеЗаполнено(Объект.БрокерПолучатель) И Не МестоХраненияПолучателяОпределяетсяБрокеромОтправителем(Форма, Объект);  
	
	Элементы.СтрокаБанковскойВыписки.Видимость			 = ОтправительЯвляетсяБанком;
	Элементы.СтрокаБанковскойВыпискиПолучатель.Видимость = ПолучательЯвляетсяБанком;
		
	Элементы.ГруппаБезналичныеДенежныеСредства.Видимость = (Объект.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная"));
	Элементы.Касса.Видимость                             = (Объект.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Наличная"));
	
	Элементы.ГруппаБезналичныеДенежныеСредстваПолучатель.Видимость = (Объект.ФормаДенежныхСредствПолучатель = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная"));
	Элементы.КассаПолучатель.Видимость                             = (Объект.ФормаДенежныхСредствПолучатель = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Наличная"));
	
	Если Объект.ВариантПеревода = ПредопределенноеЗначение("Перечисление.ВариантыПереводаДенежныхСредств.ПереводИзПути") Тогда
		Элементы.ГруппаОткуда.Видимость = Ложь;
		Элементы.ГруппаКуда.Видимость   = Истина;
	Иначе
		Элементы.ГруппаОткуда.Видимость = Истина;
		Элементы.ГруппаКуда.Видимость   = Истина;
	КонецЕсли;
	
	Элементы.ГруппаВыборПолучателя.Доступность = Не ПолучательОпределяетсяБрокеромОтправителем(Форма, Объект);
	
	// Если мы сбрасываем АвтоОтметкаНезаполненного, то ОтметкаНезаполненного автоматически не меняется
	
	Элементы.Основание.ОтметкаНезаполненного = Ложь;
	Элементы.Основание.АвтоОтметкаНезаполненного = ДляПереводаНеобходимоОснование(Объект.СчетДоверительногоУправления, Объект.РасчетныйСчет, Объект.Дата);
	
	// При переводе денежных средств с собственного расчетного счета на счет брокера нам нужна детализация по расчетному счету для печати поручения,
	// при отсутствии детализации по расчетному счету в настройках брокера в движения этот расчетный счет попадать не должен
	
	Если Не Форма.ДетализацияПоРасчетномуСчетуПолучатель
		И ЗначениеЗаполнено(Объект.БрокерПолучатель)
		И Не ЗначениеЗаполнено(Объект.Брокер)
	Тогда
		Форма.ДетализацияПоРасчетномуСчетуПолучатель = Истина; // #Техдолг
	КонецЕсли; 

	// Элементы, зависящие от детализации по р/с
	
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствам.Видимость = Форма.ДетализацияПоРасчетномуСчету И Не ОтправительЯвляетсяБиржей;
	Элементы.РасчетныйСчет.Видимость                                = Форма.ДетализацияПоРасчетномуСчету ИЛИ ОтправительЯвляетсяБиржей;
	
	Элементы.РасчетныйСчет.ОтметкаНезаполненного 		= Ложь;	
	Элементы.РасчетныйСчет.АвтоОтметкаНезаполненного	= Не ОтправительЯвляетсяБиржей;	
	
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель.Видимость = Форма.ДетализацияПоРасчетномуСчетуПолучатель И Не ПолучательЯвляетсяБиржей;
	Элементы.РасчетныйСчетПолучатель.Видимость                                = Форма.ДетализацияПоРасчетномуСчетуПолучатель ИЛИ ПолучательЯвляетсяБиржей;
	
	Элементы.РасчетныйСчетПолучатель.ОтметкаНезаполненного 		= Ложь;	
	Элементы.РасчетныйСчетПолучатель.АвтоОтметкаНезаполненного 	= Не ПолучательЯвляетсяБиржей;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДляПереводаНеобходимоОснование(СчетДоверительногоУправления, РасчетныйСчет, Дата)
	
	КлиентДУ = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата);
	Условие = (ТипЗнч(КлиентДУ) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") И РасчетныйСчет.ТранзитныйПИФ);
	Возврат ?(Условие, Условие, Неопределено);

КонецФункции

&НаСервере
Процедура НастроитьПараметрыОтбораОснования()
	
	КлиентУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
	
	ЭтаФорма.КлиентЯвляетсяПИФ = (ТипЗнч(КлиентУправления) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды"));
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПаевойИнвестиционныйФонд", КлиентУправления));
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидЗаявки", Перечисления.ВидыЗаявокПайщиков.Зачисление));
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));
	
	Элементы.Основание.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруОтбора(Организация, РасчетныйСчет, РасчетныйСчетПолучатель, ВидДвижения)

	Результат = Новый Структура;
	
	ЮрФизЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо");
	
	Если ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
		
		ЮрФизЛицоРасчетногоСчетаПолучателя	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчетПолучатель, "ЮрФизЛицо");
		ЮрФизЛицоБанкаПолучателя			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РасчетныйСчетПолучатель, Новый Структура("ЮрЛицо", "Банк.ЮрФизЛицо")).ЮрЛицо;			
		
		Контрагент = ?(ЮрФизЛицоОрганизации = ЮрФизЛицоРасчетногоСчетаПолучателя, ЮрФизЛицоРасчетногоСчетаПолучателя, ЮрФизЛицоБанкаПолучателя);  
	
		Результат.Вставить("ВидДвижения", Перечисления.ВидыДвижений.Расход);
		Результат.Вставить("Контрагент", Контрагент);
		Результат.Вставить("РасчетныйСчет", РасчетныйСчет);
		Результат.Вставить("РасчетныйСчетПолучатель", РасчетныйСчетПолучатель);
		
	Иначе
		
		ЮрФизЛицоРасчетногоСчета			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчет, "ЮрФизЛицо");
		ЮрФизЛицоБанка						= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РасчетныйСчет, Новый Структура("ЮрЛицо", "Банк.ЮрФизЛицо")).ЮрЛицо;	
		
		Контрагент = ?(ЮрФизЛицоОрганизации = ЮрФизЛицоРасчетногоСчета, ЮрФизЛицоРасчетногоСчета, ЮрФизЛицоБанка);  
		
		Результат.Вставить("ВидДвижения", Перечисления.ВидыДвижений.Приход);
		Результат.Вставить("Контрагент", Контрагент);
		Результат.Вставить("РасчетныйСчет", РасчетныйСчет);
		Результат.Вставить("РасчетныйСчетПолучатель", РасчетныйСчетПолучатель);
	
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.ДетализацияПоРасчетномуСчету 			= РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект, "БрокерПолучатель");
	
	ЭтаФорма.Переключатель			 = ОпределитьЗначениеПереключателя(Объект.Брокер,			Объект.МестоХранения);
	ЭтаФорма.ПереключательПолучатель = ОпределитьЗначениеПереключателя(Объект.БрокерПолучатель, Объект.МестоХраненияПолучатель);

	ЭтаФорма.ФлагБрокер           = (ЭтаФорма.Переключатель = ЗначениеПереключателяБрокер());
	ЭтаФорма.ФлагБрокерПолучатель = (ЭтаФорма.ПереключательПолучатель = ЗначениеПереключателяБрокер());
	
	ЭтаФорма.КонтрольПереводовСчетДУ =
		РаботаСДокументами.ДействуетКонтрольПрямыхПереводНаСчетаБиржи(Объект.СчетДоверительногоУправления) 
			И РаботаСДокументами.НеобходимКонтрольПереводовБрокера(
				?(ЗначениеЗаполнено(Объект.Брокер), Объект.Брокер, Объект.БрокерПолучатель));
	
	ЭтаФорма.ПоЗаявкеПайщика = ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика");
	
	Если (Не ЭтаФорма.ПоЗаявкеПайщика) И (Не ЗначениеЗаполнено(Объект.Основание)) Тогда
		Объект.Основание = ПредопределенноеЗначение("Документ.ПоручениеНаПереводДенежныхСредств.ПустаяСсылка");
	КонецЕсли;
	
	ЭтаФорма.СтрокаБанковскойВыписки			= РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	ЭтаФорма.СтрокаБанковскойВыпискиПолучатель	= РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыпискиПолучатель);
	
	ПроверитьАкцептованиеНаСервере();
	
	НастроитьПараметрыОтбораОснования();
	НастроитьВидимостьИДоступность(ЭтаФорма);
		
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАкцептованиеНаСервере()

	// Акцептуются только переводы с брокерского счета на расчетный
	// и валютные переводы с транзитного счета на расчетный.
	// Сделаем отдельными запросами, т. к. разные условия и разные виды акцептов.
	Элементы.ДекорацияАкцептовано.Видимость = Ложь;
		
	Если ЗначениеЗаполнено(Объект.Ссылка) 
		И ЗначениеЗаполнено(Объект.Брокер) 
		И ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель)
		И Не ЗначениеЗаполнено(Объект.БрокерПолучатель) Тогда
		
		// Перевод с брокерского на расчетный
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АкцептованиеОперацийСрезПоследних.Акцептант КАК Акцептант,
		|	АкцептованиеОперацийСрезПоследних.Период КАК ДатаАкцепта,
		|	АкцептованиеОперацийСрезПоследних.Представитель КАК Представитель,
		|	АкцептованиеОперацийСрезПоследних.Примечание КАК Примечание
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПереводСброкерскогоСчетаНаРасчетный)
		|				И Регистратор.СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК АкцептованиеОперацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО (АкцептованиеОперацийСрезПоследних.Операция = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания)";
		
		Запрос.УстановитьПараметр("Период", 						Объект.Дата);
		Запрос.УстановитьПараметр("Организация", 					Объект.Организация);
		Запрос.УстановитьПараметр("Брокер", 	 					Объект.Брокер);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	Объект.СчетДоверительногоУправления);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Элементы.ДекорацияАкцептовано.Видимость	= Истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.СтрокаБанковскойВыписки) 
		И ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		// Должны быть акцептованы любые переводы с расчетного счета
					
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АкцептованиеОпераций.Акцептант,
		|	АкцептованиеОпераций.Период КАК ДатаАкцепта,
		|	АкцептованиеОпераций.Представитель,
		|	АкцептованиеОпераций.Примечание
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций КАК АкцептованиеОпераций
		|ГДЕ
		|	АкцептованиеОпераций.Организация = &Организация
		|	И АкцептованиеОпераций.Операция = &Операция";
		
		Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
		Запрос.УстановитьПараметр("Операция",		Объект.СтрокаБанковскойВыписки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Элементы.ДекорацияАкцептовано.Видимость	= Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ИмяЭлемента) 
	
	СвязанныеРеквизиты = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, Брокер, БрокерПолучатель");
	
	Если      ИмяЭлемента = "Дата" Или ИмяЭлемента = "Организация" Тогда
		ЭтаФорма.ДетализацияПоРасчетномуСчету 			= РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты);	
		ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты, "БрокерПолучатель");	
	ИначеЕсли ИмяЭлемента = "Брокер" Тогда
		ЭтаФорма.ДетализацияПоРасчетномуСчету 			= РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты);	
		ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты, "БрокерПолучатель");
	ИначеЕсли ИмяЭлемента = "БрокерПолучатель" Тогда
		ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты, "БрокерПолучатель");
	КонецЕсли;
	
КонецПроцедуры // ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучательОпределяетсяБрокеромОтправителем(ЭтаФорма, Объект)
	
	Возврат ЭтаФорма.КонтрольПереводовСчетДУ
		И ЗначениеЗаполнено(Объект.МестоХранения)
		И Объект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок")
		И Объект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МестоХраненияПолучателяОпределяетсяБрокеромОтправителем(ЭтаФорма, Объект)
	
	Возврат ЭтаФорма.КонтрольПереводовСчетДУ И Не ЗначениеЗаполнено(Объект.Брокер);
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииФормыДенежныхСредств(СуффиксКорреспондента)
	
	Если Объект["ФормаДенежныхСредств" + СуффиксКорреспондента] = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная") Тогда
		
		Объект["Касса" + СуффиксКорреспондента] = Неопределено;
		
	ИначеЕсли Объект["ФормаДенежныхСредств" + СуффиксКорреспондента] = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Наличная") Тогда
		
		Объект["Брокер" + СуффиксКорреспондента]					= Неопределено;
		Объект["МестоХранения" + СуффиксКорреспондента]				= Неопределено;
		Объект["РасчетныйСчет" + СуффиксКорреспондента]				= Неопределено;
		Объект["СтрокаБанковскойВыписки" + СуффиксКорреспондента]	= Неопределено;
		
		ЭтаФорма["ФлагБрокер" + СуффиксКорреспондента]				= Ложь;
		ЭтаФорма["Переключатель" + СуффиксКорреспондента]			= ЗначениеПереключателяБанк();
		
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПереключателя(СуффиксКорреспондента)
	
	Объект["Брокер" + СуффиксКорреспондента]		= Неопределено;
	Объект["РасчетныйСчет" + СуффиксКорреспондента]	= Неопределено;
	
	Если ЭтаФорма["Переключатель" + СуффиксКорреспондента] = ЗначениеПереключателяБрокер() Тогда
		
		ЭтаФорма["ФлагБрокер" + СуффиксКорреспондента]	= Истина;
		Объект["МестоХранения" + СуффиксКорреспондента]	= ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");		
		
	ИначеЕсли ЭтаФорма["Переключатель" + СуффиксКорреспондента] = ЗначениеПереключателяБиржа() Тогда	
		
		ЭтаФорма["ФлагБрокер" + СуффиксКорреспондента]	= Ложь;
		Объект["МестоХранения" + СуффиксКорреспондента]	= ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК");
		
	Иначе			
		
		ЭтаФорма["ФлагБрокер" + СуффиксКорреспондента]	= Ложь;
		Объект["МестоХранения" + СуффиксКорреспондента]	= ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");		
		
	КонецЕсли;
	
КонецПроцедуры

#Область Работа_с_переключателями_отправителя_и_получателя

&НаСервереБезКонтекста
Функция ОпределитьЗначениеПереключателя(Брокер, МестоХранения)

	Если ЗначениеЗаполнено(Брокер) Тогда
		Возврат ЗначениеПереключателяБрокер();
	ИначеЕсли МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК Тогда
		Возврат ЗначениеПереключателяБиржа();
	Иначе
		Возврат ЗначениеПереключателяБанк();
	КонецЕсли;

КонецФункции	
	
&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяБанк()
	Возврат 0;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяБрокер()
	Возврат 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяБиржа()
	Возврат 2;
КонецФункции

#КонецОбласти

#КонецОбласти
