
Функция БрокерскаяКомпанияПоЮрЛицуИлиРасчетномуСчету(Контрагент, Период, РасчетныйСчет) Экспорт
	
	Брокер = Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Контрагент, "БрокерскиеКомпании");
	
	Если ЗначениеЗаполнено(Брокер) Тогда 
		Возврат Брокер;		
	КонецЕсли;

	// такое бывает, когда брокер работает через р/счет, не принадлежащий брокеру
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.Брокер КАК Брокер
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.РасчетныйСчет = &РасчетныйСчет
		|	И (ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия >= &ДатаЗакрытия
		|			ИЛИ ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))";
		
	Запрос.УстановитьПараметр("РасчетныйСчет", РасчетныйСчет);
	Запрос.УстановитьПараметр("ДатаЗакрытия",  Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Брокер;
	КонецЕсли;
	
	Возврат Справочники.БрокерскиеКомпании.ПустаяСсылка();
	
КонецФункции

Функция МестоХраненияДляРасчетногоСчета(РасчетныйСчет) Экспорт
	
	НомерСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчет, "НомерСчета");
	Возврат ?(Лев(НомерСчета, 1) = "4", Справочники.МестаХранения.ВнебиржевойРынок, Справочники.МестаХранения.ПустаяСсылка());
	
КонецФункции

Функция СчетДоверительногоУправленияПоРасчетномуСчетуИИсполнителю(ДанныеПоРасчетномуСчетуИКонтрагенту) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет
		|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &ДатаЗакрытия
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))";
		
	Запрос.УстановитьПараметр("Организация",   ДанныеПоРасчетномуСчетуИКонтрагенту.Организация);
	Запрос.УстановитьПараметр("РасчетныйСчет", ДанныеПоРасчетномуСчетуИКонтрагенту.РасчетныйСчет);
	Запрос.УстановитьПараметр("ДатаЗакрытия",  ДанныеПоРасчетномуСчетуИКонтрагенту.Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		
		//Значит, исполнитель используется не у одного счета ДУ и использовать первый счет ДУ некорректно
		//Если это ввод, поищем по контрагенту платежки
		Если ДанныеПоРасчетномуСчетуИКонтрагенту.ВидДокумента = "ВводДенежныхСредств" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Клиент = &Контрагент) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
			|ГДЕ
			|	(СчетаДоверительногоУправления.ДатаРасторжения >= &Период
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))";
			
			Запрос.УстановитьПараметр("Контрагент", ДанныеПоРасчетномуСчетуИКонтрагенту.Контрагент);
			Запрос.УстановитьПараметр("Период", 	ДанныеПоРасчетномуСчетуИКонтрагенту.Период);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 1 И ВыборкаДетальныеЗаписи.Следующий() Тогда 
				Возврат ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У контрагента " + ДанныеПоРасчетномуСчетуИКонтрагенту.Контрагент + " действует более одного счета ДУ, поэтому нельзя однозначно определить счет ДУ по контрагенту из п/п.");
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет " + ДанныеПоРасчетномуСчетуИКонтрагенту.РасчетныйСчет + " используется для более одного счета ДУ, поэтому нельзя однозначно определить счет ДУ.");
		КонецЕсли;
		
	ИначеЕсли Выборка.Следующий() Тогда 
		Возврат Выборка.СчетДоверительногоУправления;
	КонецЕсли;

	Возврат Справочники.СчетаДоверительногоУправления.ПустаяСсылка();
	
КонецФункции

Функция ВремяДокументаДвиженияДенежныхСредств(ДатаВыписки, ИспользуетсяПредварительнаяВыписка, ВидДвижения = "Расход") Экспорт
	
	ТекущаяДата			= ТекущаяДатаСеанса();                                  
	НачалоТекущейДаты	= НачалоДня(ТекущаяДата);
	НачалоДатыВыписки	= НачалоДня(ДатаВыписки);
	
	// Если в организации не используется загрузка предварительной выписки,
	// то поступления д/с на расчетый счет устанавливаем в 10-30
	Если Не ИспользуетсяПредварительнаяВыписка И ВидДвижения = "Приход" Тогда
		Возврат НачалоДатыВыписки + 10 * 60 * 60 + 30 * 60;
	Иначе	
		// При загрузке выписки день в день у новых документов устанавливаем текущее время, при загрузке на следующий день - 19-30	
		Возврат ?(НачалоДатыВыписки = НачалоТекущейДаты, 
								ТекущаяДата, 
								НачалоДатыВыписки + 19 * 60 * 60 + 30 * 60);
	КонецЕсли; 

КонецФункции

Функция ОрганизацияЗагружаетПредварительнуюВыписку(Организация) Экспорт
	
	Возврат Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
		Или Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
		
КонецФункции

#Область Загрузка_выписки

Процедура ЗаполнитьСтрокиВыпискиИзФайлаЗагрузки(Организация, ПутьКФайлу, ТаблицаВыписки, Отказ) Экспорт
	
    Текст = Новый ТекстовыйДокумент;
	
	Попытка
		Текст.Прочитать(ПутьКФайлу);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Заполнение табличной части не выполнено!
			|При чтении файла '" + ПутьКФайлу + "' произошла ошибка.
			|Ошибка:
			|" + ОписаниеОшибки(),,,, Отказ);
		Возврат;
	КонецПопытки;
	
	БлокДанных = "";
	
	Для НомСтр = 1 По Текст.КоличествоСтрок() Цикл
		
		СтрокаТекста = СокрЛП(Текст.ПолучитьСтроку(НомСтр));
		
		Если СокрЛП(СтрокаТекста) = "КонецДокумента" Тогда
			
			ДатаПоступило	= Неопределено;
			ДатаСписано		= Неопределено;
			
			НоваяСтрокаВыписки = ТаблицаВыписки.Добавить();
			
			НоваяСтрокаВыписки.Данные       = БлокДанных;
			НоваяСтрокаВыписки.ДанныеСсылка = "Открыть";
			НоваяСтрокаВыписки.Флажок       = Ложь;
			
			НоваяСтрокаВыписки.УказанБИКПолучателя	= Истина;
			НоваяСтрокаВыписки.УказанБИКПлательщика	= Истина;
			
			НоваяСтрокаВыписки.РеквизитыПолучателя  = Новый Структура;
			НоваяСтрокаВыписки.РеквизитыПлательщика = Новый Структура;
			
			НоваяСтрокаВыписки.РеквизитыПлательщика.Вставить("Наименование", "");
			НоваяСтрокаВыписки.РеквизитыПлательщика.Вставить("ИНН", "");
			НоваяСтрокаВыписки.РеквизитыПлательщика.Вставить("КПП", "");
			НоваяСтрокаВыписки.РеквизитыПолучателя.Вставить("Наименование", "");
			НоваяСтрокаВыписки.РеквизитыПолучателя.Вставить("ИНН", "");
			НоваяСтрокаВыписки.РеквизитыПолучателя.Вставить("КПП", "");
			
			Для Инд = 1 По СтрЧислоСтрок(БлокДанных) Цикл
				СтрокаДанных = СтрПолучитьСтроку(БлокДанных, Инд);
				
				ПозицияРавно = Найти(СтрокаДанных, "=");
				
				ИмяРеквизита = Лев(СтрокаДанных, ПозицияРавно - 1);
				ЗнчРеквизита = СокрЛП(Сред(СтрокаДанных, ПозицияРавно + 1));
				
				Если      ИмяРеквизита = "СекцияДокумент" Тогда
					Если      ЗнчРеквизита = "Платежное поручение" Тогда
						НоваяСтрокаВыписки.ВидПлатежногоДокумента = Перечисления.ВидыПлатежныхДокументов.ПлатежноеПоручение;
					ИначеЕсли ЗнчРеквизита = "Платежное требование" Тогда
						НоваяСтрокаВыписки.ВидПлатежногоДокумента = Перечисления.ВидыПлатежныхДокументов.ПлатежноеТребование;
					ИначеЕсли ЗнчРеквизита = "Банковский ордер" Или ЗнчРеквизита = "Платежный ордер" Тогда
						НоваяСтрокаВыписки.ВидПлатежногоДокумента = Перечисления.ВидыПлатежныхДокументов.БанковскийОрдер;
					ИначеЕсли ЗнчРеквизита = "Мемориальный ордер" Тогда
						НоваяСтрокаВыписки.ВидПлатежногоДокумента = Перечисления.ВидыПлатежныхДокументов.МемориальныйОрдер;
					Иначе
						Сообщить("Неизвестный вид исходного документа " + ЗнчРеквизита);
					КонецЕсли;
					
				ИначеЕсли ИмяРеквизита = "Дата" Тогда
					НоваяСтрокаВыписки.Дата                    = Дата(Прав(ЗнчРеквизита, 4), Сред(ЗнчРеквизита, 4, 2), Лев(ЗнчРеквизита, 2));
					НоваяСтрокаВыписки.ДатаПлатежногоДокумента = НоваяСтрокаВыписки.Дата 
					
				ИначеЕсли ИмяРеквизита = "ДатаПоступило" Тогда
					Если ЗнчРеквизита <> "" Тогда
						ДатаПоступило			= Дата(Прав(ЗнчРеквизита, 4), Сред(ЗнчРеквизита, 4, 2), Лев(ЗнчРеквизита, 2));
						НоваяСтрокаВыписки.Дата = Дата(Прав(ЗнчРеквизита, 4), Сред(ЗнчРеквизита, 4, 2), Лев(ЗнчРеквизита, 2));
					КонецЕсли;
					
				ИначеЕсли ИмяРеквизита = "ДатаСписано" Тогда
					Если ЗнчРеквизита <> "" Тогда
						ДатаСписано				= Дата(Прав(ЗнчРеквизита, 4), Сред(ЗнчРеквизита, 4, 2), Лев(ЗнчРеквизита, 2));
						НоваяСтрокаВыписки.Дата = Дата(Прав(ЗнчРеквизита, 4), Сред(ЗнчРеквизита, 4, 2), Лев(ЗнчРеквизита, 2));
					КонецЕсли;
					
				ИначеЕсли ИмяРеквизита = "Сумма" Тогда
					НоваяСтрокаВыписки.Сумма = Число(ЗнчРеквизита);
					
				ИначеЕсли ИмяРеквизита = "Получатель1" Или ИмяРеквизита = "Получатель" Тогда // у всех банк-клиентов Получатель1, а у АБСОЛЮТ-а Получатель
					НоваяСтрокаВыписки.РеквизитыПолучателя.Наименование = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "ПолучательИНН" Тогда
					НоваяСтрокаВыписки.РеквизитыПолучателя.ИНН = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "ПолучательКПП" Тогда
					НоваяСтрокаВыписки.РеквизитыПолучателя.КПП = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "ПолучательБИК" Тогда
					НоваяСтрокаВыписки.ПолучательБИК = ЗнчРеквизита;	
					
				ИначеЕсли ИмяРеквизита = "ПолучательСчет" Тогда
					
					//Банк подменяет реальный номер счета своим, выделим номер счета из данных получателя
					Если Лев(ЗнчРеквизита,1) = "3" Тогда
						ПозРасчетногоСчета = ПозицияРасчетногоСчета(НоваяСтрокаВыписки.РеквизитыПолучателя.Наименование);
						Если ПозРасчетногоСчета <> 0 Тогда
							ЗнчРеквизита = Сред(НоваяСтрокаВыписки.РеквизитыПолучателя.Наименование, ПозРасчетногоСчета + 4, 20);
							НоваяСтрокаВыписки.УказанБИКПолучателя = Ложь;
						КонецЕсли; 
					КонецЕсли;

					НоваяСтрокаВыписки.ПолучательНомерСчета = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "Плательщик1" Или ИмяРеквизита = "Плательщик" Тогда // у всех банк-клиентов Плательщик1, а у АБСОЛЮТ-а Плательщик
					НоваяСтрокаВыписки.РеквизитыПлательщика.Наименование = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "ПлательщикИНН" Тогда
					НоваяСтрокаВыписки.РеквизитыПлательщика.ИНН = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "ПлательщикКПП" Тогда
					НоваяСтрокаВыписки.РеквизитыПлательщика.КПП = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "ПлательщикБИК" Тогда					
					НоваяСтрокаВыписки.ПлательщикБИК = ЗнчРеквизита;
					
				ИначеЕсли ИмяРеквизита = "ПлательщикСчет" Тогда
					//Банк подменяет реальный номер счета своим, выделим номер счета из данных плательщика
					Если Лев(ЗнчРеквизита,1) = "3" Тогда
						ПозРасчетногоСчета = ПозицияРасчетногоСчета(НоваяСтрокаВыписки.РеквизитыПлательщика.Наименование);
						Если ПозРасчетногоСчета <> 0 Тогда
							ЗнчРеквизита = Сред(НоваяСтрокаВыписки.РеквизитыПлательщика.Наименование, ПозРасчетногоСчета + 4, 20);
							НоваяСтрокаВыписки.УказанБИКПлательщика = Ложь;
						КонецЕсли; 
					КонецЕсли; 
					
					НоваяСтрокаВыписки.ПлательщикНомерСчета = ЗнчРеквизита;
					
				Иначе
					Попытка
						НоваяСтрокаВыписки[ИмяРеквизита] = ЗнчРеквизита;
					Исключение
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ДатаПоступило) И ЗначениеЗаполнено(ДатаСписано) Тогда //одно и то же, но оставим чтобы было понятно, что если есть две даты, то это перемещение
				НоваяСтрокаВыписки.ВидДвижения = Перечисления.ВидыДвижений.Расход;
				
				ВтораяЧастьВыписки = ТаблицаВыписки.Добавить();
				
				ВтораяЧастьВыписки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
				ЗаполнитьЗначенияСвойств(ВтораяЧастьВыписки, НоваяСтрокаВыписки,, "ВидДвижения");
				
			ИначеЕсли ЗначениеЗаполнено(ДатаСписано) Тогда //одно и то же, но оставим чтобы было понятно
				НоваяСтрокаВыписки.ВидДвижения = Перечисления.ВидыДвижений.Расход;
			ИначеЕсли ЗначениеЗаполнено(ДатаПоступило) Тогда
				НоваяСтрокаВыписки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
			КонецЕсли;
			
		ИначеЕсли Найти(СтрокаТекста, "СекцияДокумент") > 0 Тогда
			БлокДанных = СтрокаТекста + Символы.ПС; // + Символы.ВК;
			
		ИначеЕсли БлокДанных <> "" Тогда
			БлокДанных = БлокДанных + СтрокаТекста  + Символы.ПС; // + Символы.ВК;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого СтрокаВыписки Из ТаблицаВыписки Цикл
		ЗаполнитьДанныеСтрокиВыписки(Организация, СтрокаВыписки);
	КонецЦикла;
	
	ТаблицаВыписки.Сортировать("Статус, ВидДвижения, Номер");
	
	// Удаляем лишние строки - у них статус 9
	СтрокиКУдалению = ТаблицаВыписки.НайтиСтроки(Новый Структура("Статус", 9));     
	
	КоличествоСтрокКУдалению 	= СтрокиКУдалению.Количество();
	ИндексПоследнейСтроки		= ТаблицаВыписки.Количество() - 1;	
	Если КоличествоСтрокКУдалению > 0 Тогда
		Для Сч = 0 По КоличествоСтрокКУдалению - 1 Цикл               	
			ТаблицаВыписки.Удалить(ИндексПоследнейСтроки - Сч);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЗаполнитьДанныеСтрокиВыписки(Организация, СтрокаВыписки) Экспорт

	Если Не ЗначениеЗаполнено(СтрокаВыписки.ПолучательСчет) Тогда // может быть заполнен вручную
		СтрокаВыписки.ПолучательСчет = ПолучитьБанковскийСчет(Организация, СтрокаВыписки.ПолучательНомерСчета, СтрокаВыписки.ПолучательБИК, СтрокаВыписки.РеквизитыПолучателя.ИНН, СтрокаВыписки.Дата, СтрокаВыписки.Получатель, СтрокаВыписки.УказанБИКПолучателя);		
		Если Не ЗначениеЗаполнено(СтрокаВыписки.Получатель) Тогда
			СтрокаВыписки.Получатель = ПолучитьЮрФизЛицо(СтрокаВыписки.РеквизитыПолучателя, СтрокаВыписки.Дата, Организация);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаВыписки.ПлательщикСчет) Тогда // может быть заполнен вручную
		СтрокаВыписки.ПлательщикСчет = ПолучитьБанковскийСчет(Организация, СтрокаВыписки.ПлательщикНомерСчета, СтрокаВыписки.ПлательщикБИК, СтрокаВыписки.РеквизитыПлательщика.ИНН, СтрокаВыписки.Дата, СтрокаВыписки.Плательщик, СтрокаВыписки.УказанБИКПлательщика);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаВыписки.Плательщик) Тогда // может быть заполнен вручную
		СтрокаВыписки.Плательщик = ПолучитьЮрФизЛицо(СтрокаВыписки.РеквизитыПлательщика, СтрокаВыписки.Дата, Организация);
	КонецЕсли;

	Если ТипЗнч(СтрокаВыписки.Получатель) = Тип("Строка") Или ТипЗнч(СтрокаВыписки.Плательщик) = Тип("Строка") Тогда
		СтрокаВыписки.Статус = 0;
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента = Новый Структура("Организация, ВидПлатежногоДокумента, НомерПлатежногоДокумента, ДатаПлатежногоДокумента, Сумма, НазначениеПлатежа, Ответственный, ИсходныеДанные",
		Организация, СтрокаВыписки.ВидПлатежногоДокумента, СтрокаВыписки.Номер, СтрокаВыписки.ДатаПлатежногоДокумента, СтрокаВыписки.Сумма, СтрокаВыписки.НазначениеПлатежа, РаботаСПользователями.ТекущийПользователь(), СтрокаВыписки.Данные);
		
	ЮрЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо");
		
	Если СтрокаВыписки.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда // мы - плательщик
		РеквизитыДокумента.Вставить("РасчетныйСчет",            СтрокаВыписки.ПлательщикСчет);
		РеквизитыДокумента.Вставить("Контрагент",               СтрокаВыписки.Получатель);
		РеквизитыДокумента.Вставить("РасчетныйСчетКонтрагента", СтрокаВыписки.ПолучательСчет);
		РеквизитыДокумента.Вставить("ВидДвижения",              СтрокаВыписки.ВидДвижения);
		
		// расчетный счет должен быть заполнен
		Если ТипЗнч(РеквизитыДокумента.РасчетныйСчет) = Тип("Строка") Тогда
			СтрокаВыписки.Статус = 0;
			Возврат;
		КонецЕсли;
		
		// расчетный счет контрагента должен быть заполнен только тогда, когда он задан
		Если Не ПустаяСтрока(СтрокаВыписки.ПолучательНомерСчета) И ТипЗнч(РеквизитыДокумента.РасчетныйСчетКонтрагента) = Тип("Строка") Тогда
			СтрокаВыписки.Статус = 0;
			Возврат;
		КонецЕсли;
		
	ИначеЕсли СтрокаВыписки.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда // мы - получатель
        РеквизитыДокумента.Вставить("РасчетныйСчет",            СтрокаВыписки.ПолучательСчет);
		РеквизитыДокумента.Вставить("Контрагент",               СтрокаВыписки.Плательщик);
		РеквизитыДокумента.Вставить("РасчетныйСчетКонтрагента", СтрокаВыписки.ПлательщикСчет);
		РеквизитыДокумента.Вставить("ВидДвижения",              СтрокаВыписки.ВидДвижения);
		
		// расчетный счет должен быть заполнен
		Если Не ЗначениеЗаполнено(РеквизитыДокумента.РасчетныйСчет) Тогда
			СтрокаВыписки.Статус = 0;
			Возврат;
		КонецЕсли;
		
		// расчетный счет контрагента должен быть заполнен только тогда, когда он задан
		Если Не ПустаяСтрока(СтрокаВыписки.ПлательщикНомерСчета) И ТипЗнч(РеквизитыДокумента.РасчетныйСчетКонтрагента) = Тип("Строка") Тогда
			СтрокаВыписки.Статус = 0;
			Возврат;
		КонецЕсли;
		
	Иначе 
		
		// не загружаем, регистрировать ошибку не нужно (банк выгружает неисполненные платежки)
		ТекстОшибки = "Не удалось определить направление движения документа " + СтрокаВыписки.ВидПлатежногоДокумента + " с номером " + СтрокаВыписки.Номер + " от " + Формат(СтрокаВыписки.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
		СтрокаВыписки.Статус = 0;
		Возврат;
		
	КонецЕсли;
	
	//Отсекаем движения по счетам депозитов (некоторые банки выгружают выписки по всем открытым счетам)
	// В таких строках устанавливаем статус 9	
	Если ТипЗнч(РеквизитыДокумента.РасчетныйСчет) = Тип("СправочникСсылка.БанковскиеСчета") 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.РасчетныйСчет, "ВидБанковскогоСчета") = Перечисления.ВидыБанковскихСчетов.ДепозитныйСчет Тогда
		СтрокаВыписки.Статус = 9;
		Возврат;
	КонецЕсли;
	
	СтрокаВыписки.Реквизиты = РеквизитыДокумента;
	
	ПлатежныеДокументы = ПолучитьПлатежныеДокументы(
			Организация,
			СтрокаВыписки.ДатаПлатежногоДокумента,
			СтрокаВыписки.Номер,
			РеквизитыДокумента.РасчетныйСчет,
			РеквизитыДокумента.РасчетныйСчетКонтрагента,
			РеквизитыДокумента.Сумма,
			РеквизитыДокумента.ВидДвижения);
			
	СтрокаВыписки.Ссылка 							= ПлатежныеДокументы.СтрокаБанковскойВыписки;
	СтрокаВыписки.ПлатежноеПоручение				= ПлатежныеДокументы.ПлатежноеПоручение;
	СтрокаВыписки.ДокументДвиженияДенежныхСредств	= ПлатежныеДокументы.ДокументДвиженияДенежныхСредств;
	
	Если ЗначениеЗаполнено(СтрокаВыписки.Ссылка) Тогда
		СтрокаВыписки.Статус = 2;
		СтрокаВыписки.Флажок = Ложь;
	Иначе
		СтрокаВыписки.Статус = 1;
		СтрокаВыписки.Флажок = Истина;
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьПлатежныеДокументы(Организация, ДатаПлатежногоДокумента, Номер, РасчетныйСчет, РасчетныйСчетКонтрагента, Сумма, ВидДвижения)
	
	Результат = Новый Структура("СтрокаБанковскойВыписки, ПлатежноеПоручение, ДокументДвиженияДенежныхСредств");
	
	// если р/счет и р/счет контрагента принадлежат организации, 
	// то определить, что это (приход или расход), практически не возможно; 
	// загружаем как повезет, а девочки, при необходимости, меняют счета местами
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СтрокаБанковскойВыписки.Ссылка КАК СтрокаБанковскойВыписки
	    |ПОМЕСТИТЬ _СтрокиВыписки
	    |ИЗ
	    |	Документ.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки
	    |ГДЕ
	    |	СтрокаБанковскойВыписки.Организация = &Организация
	    |	И СтрокаБанковскойВыписки.ДатаПлатежногоДокумента = &ДатаПлатежногоДокумента
	    |	И СтрокаБанковскойВыписки.НомерПлатежногоДокумента = &НомерПлатежногоДокументаСтр
	    |	И СтрокаБанковскойВыписки.ВидДвижения = &ВидДвижения
	    |	И СтрокаБанковскойВыписки.Сумма = &Сумма
	    |	И (СтрокаБанковскойВыписки.РасчетныйСчетКонтрагента = &РасчетныйСчетКонтрагента
	    |				И СтрокаБанковскойВыписки.РасчетныйСчет = &РасчетныйСчет
	    |			ИЛИ СтрокаБанковскойВыписки.РасчетныйСчетКонтрагента = &РасчетныйСчет
	    |				И СтрокаБанковскойВыписки.РасчетныйСчет = &РасчетныйСчетКонтрагента)
	    |	И НЕ СтрокаБанковскойВыписки.ПометкаУдаления
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ПлатежноеПоручениеИсходящее.Ссылка КАК Документ,
	    |	""ПлатежноеПоручение"" КАК ИмяРеквизита
	    |ИЗ
	    |	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
	    |ГДЕ
	    |	ПлатежноеПоручениеИсходящее.Организация = &Организация
	    |	И НАЧАЛОПЕРИОДА(ПлатежноеПоручениеИсходящее.Дата, ДЕНЬ) = &ДатаПлатежногоДокумента
	    |	И ПлатежноеПоручениеИсходящее.НомерПлатежногоПоручения = &НомерПлатежногоДокумента
	    |	И ПлатежноеПоручениеИсходящее.РасчетныйСчетКонтрагента = &РасчетныйСчетКонтрагента
	    |	И ПлатежноеПоручениеИсходящее.РасчетныйСчет = &РасчетныйСчет
	    |	И НЕ ПлатежноеПоручениеИсходящее.ПометкаУдаления
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	_СтрокиВыписки.СтрокаБанковскойВыписки,
	    |	""СтрокаБанковскойВыписки""
	    |ИЗ
	    |	_СтрокиВыписки КАК _СтрокиВыписки
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	РеестрПлатежей.ДвижениеДенежныхСредств,
	    |	""ДокументДвиженияДенежныхСредств""
	    |ИЗ
	    |	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СтрокиВыписки КАК _СтрокиВыписки
	    |		ПО РеестрПлатежей.СтрокаБанковскойВыписки = _СтрокиВыписки.СтрокаБанковскойВыписки";

	Запрос.УстановитьПараметр("Организация",              		Организация);
	Запрос.УстановитьПараметр("ДатаПлатежногоДокумента",  		ДатаПлатежногоДокумента);
	Запрос.УстановитьПараметр("НомерПлатежногоДокумента", 		Число(Номер));
	Запрос.УстановитьПараметр("НомерПлатежногоДокументаСтр",	Номер);
	Запрос.УстановитьПараметр("РасчетныйСчет",            		РасчетныйСчет);
	Запрос.УстановитьПараметр("РасчетныйСчетКонтрагента", 		РасчетныйСчетКонтрагента);
	Запрос.УстановитьПараметр("Сумма",                    		Сумма);
	Запрос.УстановитьПараметр("ВидДвижения",              		ВидДвижения);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат[Выборка.ИмяРеквизита] = Выборка.Документ;
		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции 

Функция ПолучитьЮрФизЛицо(Реквизиты, Период, Организация)
	
	Реквизиты.ИНН = ?(Реквизиты.ИНН = "0", "", Реквизиты.ИНН);
	Реквизиты.КПП = ?(Реквизиты.КПП = "0", "", Реквизиты.КПП);
	
	Если (ПустаяСтрока(Реквизиты.ИНН) Или Реквизиты.ИНН = "000000000000") И Не ПустаяСтрока(Реквизиты.Наименование) Тогда // для физиков-пайщиков очень часто ИНН не указывается
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
			|ГДЕ
			|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество = &Наименование
			|	И НЕ РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо.ПометкаУдаления";
			
		Запрос.УстановитьПараметр("Период",       Период);
		Запрос.УстановитьПараметр("Организация",  Организация);
		Запрос.УстановитьПараметр("Наименование", Реквизиты.Наименование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ЮрФизЛицо;
		КонецЕсли;
		
		Возврат "Не найден " + Реквизиты.Наименование;
	КонецЕсли;	
	
	Если      Реквизиты.ИНН = "7744001497" И Реквизиты.КПП = "775001001" Тогда // ГПБ
		Реквизиты.КПП = "997950001";
	ИначеЕсли Реквизиты.ИНН = "7730149408" Тогда // РЭМ
		Реквизиты.КПП = "770601001";
	ИначеЕсли Реквизиты.ИНН = "7729405872" Тогда // ЗЕНИТ
		Реквизиты.КПП = "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН = &ИНН
		|	И (РеквизитыЮридическихЛицСрезПоследних.КПП = &КПП
		|			ИЛИ &КПП = """")
		|	И НЕ РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо.Ссылка
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыФизическихЛицСрезПоследних.ИНН = &ИНН
		|	И НЕ РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо.ПометкаУдаления";

	Запрос.УстановитьПараметр("ИНН",    	 Реквизиты.ИНН);
	Запрос.УстановитьПараметр("КПП",    	 Реквизиты.КПП);
	Запрос.УстановитьПараметр("Период", 	 Период);
	Запрос.УстановитьПараметр("Организация", Организация);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат "Не найден " + Реквизиты.Наименование;

КонецФункции

Функция ПолучитьБанковскийСчет(Организация, НомерСчета, БИК, ИНН, Период, ЮрФизЛицо, ПроверятьБИК = Истина)

	Если ПустаяСтрока(НомерСчета) Тогда 
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеСчета.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА Банки.Код = &БИК
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НайденПоБИК
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|		ПО БанковскиеСчета.Банк = Банки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО БанковскиеСчета.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.Организация = &Организация
		|	И НЕ БанковскиеСчета.ПометкаУдаления
		|	И (НЕ Банки.ЭтоТерриториальныйОрганФедеральногоКазначейства
		|			ИЛИ ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, """") = &ИНН)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НайденПоБИК УБЫВ";

	// 1. При поиске достаточно найти банковский счет по номеру и БИК; 
	// 	  кроме того, банки, особенно ГПБ, очень часто вместо реального контрагента
	// 	  подставляют себя любимых, а в счетах контрагенты худо-бедно выверены
	// 2. Для бюджетных платежей номера счетов могут дублироваться, отличаем по ИНН
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("БИК", БИК);

	Выборка = Запрос.Выполнить().Выбрать();

	КоличествоСчетов = Выборка.Количество();
	БанковскийСчет = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если (Не ПроверятьБИК Или Выборка.НайденПоБИК)
				И БанковскийСчет = Неопределено Тогда
			ЮрФизЛицо = Выборка.ЮрФизЛицо;
			БанковскийСчет = Выборка.Ссылка;
			Продолжить;
		КонецЕсли;
		
		Если Не Выборка.НайденПоБИК И ПроверятьБИК Тогда
			КомментарийКОшибке = "Не найден по БИК " + БИК;
		Иначе	
			КомментарийКОшибке = "Имеются дубли по номеру счета " + НомерСчета;
		КонецЕсли;			
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Необходимо проверить счет %1: %2", Выборка.Ссылка, КомментарийКОшибке), Выборка.Ссылка);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат БанковскийСчет;
	ИначеЕсли КоличествоСчетов > 1 Тогда
		Возврат "Найдено несколько " + НомерСчета + ", у которых БИК не соответствует загружаемому " + БИК;
	Иначе
		Возврат "Не найден " + НомерСчета + ", БИК " + БИК;
	КонецЕсли;

КонецФункции // ПолучитьБанковскийСчет

Функция ПозицияРасчетногоСчета(Текст)
	
	// строка "р/с" может быть частично или полностью написана латиницей
	МассивВариантов = Новый Массив;
	МассивВариантов.Добавить("р/с");
	МассивВариантов.Добавить("p/c");
	МассивВариантов.Добавить("p/с");
	МассивВариантов.Добавить("р/c");	
	
	Для Каждого Вариант Из МассивВариантов Цикл
		НомерСимвола = СтрНайти(Текст, Вариант + " ");
		Если НомерСимвола > 0 Тогда
			Возврат НомерСимвола;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Процедура СформироватьДокументыПоСтрокамБанковскойВыписки(Организация, ТаблицаВыписки, ИспользуетсяПредварительнаяВыписка) Экспорт
	
	Для каждого СтрокаВыписки Из ТаблицаВыписки Цикл
		
		Если Не СтрокаВыписки.Флажок Тогда
			Продолжить;
		КонецЕсли;
				
		Если СтрокаВыписки.Ссылка = Документы.СтрокаБанковскойВыписки.ПустаяСсылка() Тогда
			Документ = Документы.СтрокаБанковскойВыписки.СоздатьДокумент();
			Документ.Дата = СтрокаВыписки.Дата;
		Иначе
			Документ = СтрокаВыписки.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Документ, СтрокаВыписки.Реквизиты);
		
		Если Не ЗначениеЗаполнено(Документ.ПлатежноеПоручение) Тогда
			Документ.ПлатежноеПоручение = СтрокаВыписки.ПлатежноеПоручение;
		КонецЕсли;
				
		Попытка 
			Документ.Записать();
		Исключение  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());			
			Продолжить;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(Документ.ПлатежноеПоручение) Тогда
			НачатьТранзакцию();
			РегистрыСведений.СтатусыИсходящихПлатежныхПоручений.УстановитьСтатусПлатежногоПоручения(Документ.Организация, Документ.ПлатежноеПоручение, Перечисления.СтатусыПлатежныхПоручений.Исполнено);			
			ЗафиксироватьТранзакцию();			
		КонецЕсли;
						
		// Создаем документы движения денежных средств
		Если ЗначениеЗаполнено(СтрокаВыписки.ПлатежноеПоручение) И Не ЗначениеЗаполнено(СтрокаВыписки.ДокументДвиженияДенежныхСредств) Тогда
			
			СтрокаВыписки.ДокументДвиженияДенежныхСредств = СформироватьДокументДвиженияДенежныхСредств(Документ.Ссылка, Документ.Дата, ИспользуетсяПредварительнаяВыписка, Организация, СтрокаВыписки.ПлатежноеПоручение);
						
			// Если в платежном поручении не заполнены основания, заполняем
			Если ЗначениеЗаполнено(СтрокаВыписки.ДокументДвиженияДенежныхСредств) И СтрокаВыписки.ПлатежноеПоручение.Основания.Количество() = 0 Тогда
				
				ПлатежноеПоручение				= СтрокаВыписки.ПлатежноеПоручение.ПолучитьОбъект();
				НоваяСтрокаОснования			= ПлатежноеПоручение.Основания.Добавить();
				НоваяСтрокаОснования.Основание	= СтрокаВыписки.ДокументДвиженияДенежныхСредств;
								
				Попытка 
					ПлатежноеПоручение.Записать();
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());					
					Продолжить; 				
				КонецПопытки;			
				
			КонецЕсли;			
			
		ИначеЕсли СтрокаВыписки.ВидДвижения = Перечисления.ВидыДвижений.Приход И Не ЗначениеЗаполнено(СтрокаВыписки.ДокументДвиженияДенежныхСредств) Тогда
			
			СтрокаВыписки.ДокументДвиженияДенежныхСредств = СформироватьДокументДвиженияДенежныхСредств(Документ.Ссылка, Документ.Дата, ИспользуетсяПредварительнаяВыписка, Организация);
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры	

Функция СформироватьДокументДвиженияДенежныхСредств(СтрокаБанковскойВыписки, ДатаВыписки, ИспользуетсяПредварительнаяВыписка, Организация, ПлатежноеПоручение = Неопределено)
	
	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	
	// Если нет платежного поручения, то это приход денежных средств
	Если ПлатежноеПоручение = Неопределено Тогда
		
		// Приход процентов МНО		
		// Закрытие депозитов с приходом процентов		
		// Погашение ЦБ и купонов                
		// Перевод денежных средств
		// Ввод денежных средств
		
		РеквизитыСтрокиБанковскойВыписки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаБанковскойВыписки, "НазначениеПлатежа, РасчетныйСчет, РасчетныйСчетКонтрагента, Сумма, Контрагент");
		
		НазначениеПлатежа = НРег(РеквизитыСтрокиБанковскойВыписки.НазначениеПлатежа);
		
		МассивСимволовНомера = Новый Массив;
		МассивСимволовНомера.Добавить("№");
		МассивСимволовНомера.Добавить("№ ");
		МассивСимволовНомера.Добавить("N");
		МассивСимволовНомера.Добавить("N ");	
		
		#Область Текст_запроса
		
		// Собираем данные по регистрам на конец дня, чтобы получить документы-основания
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""ПриходПроцентовМНО"" КАК ВидДокумента,
			|	ДенежныеСредстваМНООстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ДенежныеСредстваМНООстатки.МНО КАК Основание,
			|	ДенежныеСредстваМНООстатки.РасчетныйСчет КАК РасчетныйСчет,
			|	ДенежныеСредстваМНООстатки.МНО.РасчетныйСчет.ДоговорМНО.НомерДоговора КАК ОсновнойИдентификатор,
			|	ВЫБОР
			|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000001"" И ""000009""
			|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 6, 1)
			|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000010"" И ""000099""
			|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 5, 2)
			|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000100"" И ""000999""
			|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 4, 3)
			|		КОГДА НомераОбъектов.Номер МЕЖДУ ""001000"" И ""009999""
			|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 3, 4)
			|		КОГДА НомераОбъектов.Номер МЕЖДУ ""010000"" И ""099999""
			|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 2, 5)
			|		ИНАЧЕ НомераОбъектов.Номер
			|	КОНЕЦ КАК ДополнительныйИдентификатор,
			|	ДенежныеСредстваМНООстатки.СуммаОстаток КАК СуммаОстаток,
			|	0 КАК СуммаКупонаОстаток,
			|	NULL КАК Дата,
			|	ЛОЖЬ КАК ГенСоглашение,
			|	NULL КАК Контрагент,
			|	NULL КАК МестоХранения
			|ПОМЕСТИТЬ _Основания
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(
			|			&КонецПредыдущегоДняГраница,
			|			Организация = &Организация
			|				И РасчетныйСчет = &РасчетныйСчет
			|				И МНО.ДатаВозврата = &НачалоДня) КАК ДенежныеСредстваМНООстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
			|		ПО (НомераОбъектов.Организация = ДенежныеСредстваМНООстатки.Организация)
			|			И (НомераОбъектов.СчетДоверительногоУправления = ДенежныеСредстваМНООстатки.СчетДоверительногоУправления)
			|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
			|			И ДенежныеСредстваМНООстатки.МНО.Основание = НомераОбъектов.Объект
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""Оплата"",
			|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание,
			|	НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.РасчетныйСчет,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.ПогашениеКупона)
			|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеКупона).Облигация.ГосударственныйРегистрационныйНомер
			|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.НачислениеДивидендов)
			|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеДивидендов).ЦеннаяБумага.ГосударственныйРегистрационныйНомер
			|		ИНАЧЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага.ГосударственныйРегистрационныйНомер
			|	КОНЕЦ,
			|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.НачислениеДивидендов)
			|			ТОГДА &Сумма
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
			|	КОНЕЦ,
			|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток,
			|	NULL,
			|	ЛОЖЬ,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент,
			|	NULL
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&КонецДняГраница,
			|			Организация = &Организация
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции))) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаДоходовПоЦеннымБумагам.СрезПоследних(&КонецДняГраница, Организация = &Организация) КАК НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Организация = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Организация
			|			И ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.СчетДоверительногоУправления
			|			И ЗадолженностиПоДенежнымСредствамОстатки.Валюта = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Валюта
			|			И (НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.РасчетныйСчет = &РасчетныйСчет)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток >= &Сумма
			|			ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток = &Сумма
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток = &Сумма
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток = &Сумма
			|					ИЛИ ВЫБОР
			|						КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|							ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).Сумма + ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).СуммаКупона = &Сумма
			|						ИНАЧЕ ЛОЖЬ
			|					КОНЕЦ
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""ЗакрытиеКредитногоИнструмента"",
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент,
			|	РазмещениеКредитногоИнструмента.РасчетныйСчет,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент.БанковскийСчет.Договор.НомерДоговора,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент.НомерПодтверждения,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток,
			|	0,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент.ДатаПодтверждения,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент.БанковскийСчет.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам),
			|	NULL,
			|	NULL
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
			|			&КонецПредыдущегоДняГраница,
			|			Организация = &Организация
			|				И ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)
			|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
			|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = РазмещениеКредитногоИнструмента.КредитныйИнструмент
			|			И (РазмещениеКредитногоИнструмента.РасчетныйСчет = &РасчетныйСчет)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""ПереводДенежныхСредствПоПоручению"",
			|	СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления,
			|	СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств,
			|	СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.РасчетныйСчетПолучатель,
			|	ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора, """"),
			|	"""",
			|	СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.Сумма,
			|	0,
			|	СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.Дата,
			|	ЛОЖЬ,
			|	NULL,
			|	NULL
			|ИЗ
			|	РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств.СрезПоследних(
			|			&ТекущееВремяГраница,
			|			ПоручениеНаПереводДенежныхСредств.РасчетныйСчетПолучатель = &РасчетныйСчет
			|				И ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
			|				И ПоручениеНаПереводДенежныхСредств.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
			|				И ПоручениеНаПереводДенежныхСредств.Сумма = &Сумма) КАК СтатусыПорученийНаПереводДенежныхСредствСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
			|		ПО СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.Организация = ПереводДенежныхСредств.Организация
			|			И СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления = ПереводДенежныхСредств.СчетДоверительногоУправления
			|			И СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств = ПереводДенежныхСредств.Основание
			|			И (ПереводДенежныхСредств.СтрокаБанковскойВыпискиПолучатель <> ЗНАЧЕНИЕ(Документ.СтрокаБанковскойВыписки.ПустаяСсылка))
			|			И (НЕ ПереводДенежныхСредств.ПометкаУдаления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&КонецДняГраница, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		ПО СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.Организация = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация
			|			И СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
			|			И СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.Брокер = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер
			|ГДЕ
			|	ВЫБОР
			|			КОГДА СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|				ТОГДА СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.Отправлено)
			|			ИНАЧЕ СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.Исполнено)
			|		КОНЕЦ
			|	И СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Период МЕЖДУ &НачалоДня И &КонецДня
			|	И ПереводДенежныхСредств.Ссылка ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""ПереводДенежныхСредствБезПоручения"",
			|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления,
			|	NULL,
			|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет,
			|	ЕСТЬNULL(ВозможныеОтправители.НомерДоговора, """"),
			|	"""",
			|	0,
			|	0,
			|	NULL,
			|	ЛОЖЬ,
			|	NULL,
			|	ВозможныеОтправители.МестоХранения
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет,
			|			NULL КАК Брокер,
			|			ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Договор.НомерДоговора КАК НомерДоговора,
			|			ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок) КАК МестоХранения
			|		ИЗ
			|			РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
			|		ГДЕ
			|			ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
			|			И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчетКонтрагента
			|			И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
			|					ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &НачалоДня)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления,
			|			NULL,
			|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер,
			|			ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора, """"),
			|			ВЫБОР
			|				КОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = &Брокер_ГПБ
			|						И &Контрагент = &НКО_НКЦ
			|					ТОГДА ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|				КОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = &Брокер_БК
			|					ТОГДА &ММВБ_РТС_ТорговыйПлюс
			|				ИНАЧЕ &ММВБ_РТС
			|			КОНЕЦ
			|		ИЗ
			|			РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&КонецДняГраница, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		ГДЕ
			|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация = &Организация
			|			И (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = &Брокер_БК
			|						И &Контрагент В (&БК_Регион, &НКО_НКЦ)
			|					ИЛИ КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = &Брокер_ГПБ
			|						И &Контрагент В (&ГПБ, &НКО_НКЦ)
			|					ИЛИ КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = &Брокер_РСХБ
			|						И &Контрагент = &РСХБ)) КАК ВозможныеОтправители
			|		ПО ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = ВозможныеОтправители.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
			|		ПО ИсполнителиПоДенежнымСредствамСобственные.Организация = ПереводДенежныхСредств.Организация
			|			И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = ПереводДенежныхСредств.СчетДоверительногоУправления
			|			И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = ПереводДенежныхСредств.РасчетныйСчетПолучатель
			|			И (НЕ ПереводДенежныхСредств.ПометкаУдаления)
			|			И (ПереводДенежныхСредств.СтрокаБанковскойВыпискиПолучатель = &СтрокаБанковскойВыписки)
			|ГДЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
			|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет
			|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &НачалоДня)
			|	И ЕСТЬNULL(ВозможныеОтправители.НомерДоговора, """") <> """"
			|	И ПереводДенежныхСредств.Ссылка ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""ВводДенежныхСредств"",
			|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления,
			|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Основание, НЕОПРЕДЕЛЕНО),
			|	&РасчетныйСчет,
			|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления.НомерДоговора,
			|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Основание.НомерВходящегоДокумента, """"),
			|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток, 0),
			|	0,
			|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Основание.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1)),
			|	ЛОЖЬ,
			|	NULL,
			|	NULL
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиСоСчетомКонтрагента
			|		ПО ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = ИсполнителиСоСчетомКонтрагента.СчетДоверительногоУправления
			|			И (ИсполнителиСоСчетомКонтрагента.РасчетныйСчет = &РасчетныйСчетКонтрагента)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
			|				&ТекущееВремяГраница,
			|				Организация = &Организация
			|					И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|					И ВЫРАЗИТЬ(Основание КАК Документ.ПоручениеНаДвижениеДенежныхСредств).РасчетныйСчетПолучатель = &РасчетныйСчет
			|					И ВЫРАЗИТЬ(Основание КАК Документ.ПоручениеНаДвижениеДенежныхСредств).Сумма = &Сумма) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
			|		ПО ИсполнителиПоДенежнымСредствамСобственные.Организация = ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Организация
			|			И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств.СрезПоследних(
			|				&ТекущееВремяГраница,
			|				ПоручениеНаПереводДенежныхСредств.РасчетныйСчетПолучатель = &РасчетныйСчет
			|					И ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
			|					И ПоручениеНаПереводДенежныхСредств.Сумма = &Сумма) КАК СтатусыПорученийНаПереводДенежныхСредствСрезПоследних
			|		ПО (СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.Активно))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецДня, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ПО ИсполнителиПоДенежнымСредствамСобственные.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
			|			И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
			|ГДЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет
			|	И СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств ЕСТЬ NULL
			|	И ИсполнителиСоСчетомКонтрагента.РасчетныйСчет ЕСТЬ NULL
			|	И ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Основание ЕСТЬ NULL
			|				ТОГДА &ВНазначенииПлатежаНеУпоминаетсяБрокер
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И (КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Контрагент
			|			ИЛИ КлиентыДоверительногоУправленияСрезПоследних.Организация.ЮрФизЛицо = &Контрагент)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""ВводДенежныхСредств"",
			|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
			|	ДокументЗаявкаПайщика.Ссылка,
			|	&РасчетныйСчет,
			|	РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда,
			|	ДокументЗаявкаПайщика.НомерЗаявки,
			|	0,
			|	0,
			|	ДокументЗаявкаПайщика.Дата,
			|	NULL,
			|	ДокументЗаявкаПайщика.Пайщик,
			|	NULL
			|ИЗ
			|	РегистрСведений.СтатусыЗаявокПайщиков.СрезПоследних(&КонецДня, Организация = &Организация) КАК СтатусыЗаявокПайщиковСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаПайщика КАК ДокументЗаявкаПайщика
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецДня, ) КАК РеквизитыПИФСрезПоследних
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецДня, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
			|				ПО РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
			|			ПО ДокументЗаявкаПайщика.Организация.ЮрФизЛицо = РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
			|				И ДокументЗаявкаПайщика.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
			|				И (ДокументЗаявкаПайщика.РасчетныйСчет = &РасчетныйСчетКонтрагента)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|					&КонецДня,
			|					Организация = &Организация
			|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
			|			ПО ДокументЗаявкаПайщика.Организация = РеквизитыФизическихЛицАнкетныеСрезПоследних.Организация
			|				И ДокументЗаявкаПайщика.Пайщик = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
			|			ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
			|			ПО (ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) = ТИП(БизнесПроцесс.ЗачислениеПаев))
			|				И (ЗадачаИсполнителя.БизнесПроцесс.ЗаявкаПайщика = ДокументЗаявкаПайщика.Ссылка)
			|				И (ЗадачаИсполнителя.БизнесПроцесс.Стартован)
			|				И (НЕ ЗадачаИсполнителя.ПометкаУдаления)
			|		ПО СтатусыЗаявокПайщиковСрезПоследних.ЗаявкаПайщика = ДокументЗаявкаПайщика.Ссылка
			|			И (НЕ ДокументЗаявкаПайщика.ПометкаУдаления)
			|			И (ДокументЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление))
			|ГДЕ
			|	(&ТранзитныйСчетПИФ
			|				И &ВНазначенииПлатежаОплатаИнвестиционныхПаев
			|				И ДокументЗаявкаПайщика.Ссылка ЕСТЬ НЕ NULL 
			|				И ДокументЗаявкаПайщика.Многократная
			|			ИЛИ НЕ ДокументЗаявкаПайщика.Многократная
			|				И ЗадачаИсполнителя.Ссылка ЕСТЬ NULL)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	1 КАК Номер
			|ИЗ
			|	_Основания КАК _Основания
			|ГДЕ
			|	_Основания.ВидДокумента = ""Оплата""");
		
		#КонецОбласти
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// По МНО и депозитам нужно проверять конец предыдущего дня
		Запрос.УстановитьПараметр("КонецПредыдущегоДняГраница",	Новый Граница(НачалоДня(ДатаВыписки) - 1, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ТекущееВремяГраница",		Новый Граница(ТекущаяДатаСеанса(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонецДняГраница",			Новый Граница(КонецДня(ДатаВыписки), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("НачалоДня",					НачалоДня(ДатаВыписки));
		Запрос.УстановитьПараметр("КонецДня",					КонецДня(ДатаВыписки));
		Запрос.УстановитьПараметр("Организация",				Организация);
		Запрос.УстановитьПараметр("РасчетныйСчет",  			РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет);
		Запрос.УстановитьПараметр("РасчетныйСчетКонтрагента",  	РеквизитыСтрокиБанковскойВыписки.РасчетныйСчетКонтрагента);
		Запрос.УстановитьПараметр("Сумма",  					РеквизитыСтрокиБанковскойВыписки.Сумма);
		Запрос.УстановитьПараметр("ТранзитныйСчетПИФ",			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет, "ТранзитныйПИФ"));
		
		Запрос.УстановитьПараметр(
			"ВНазначенииПлатежаНеУпоминаетсяБрокер", 
			СтрНайти(ВРег(РеквизитыСтрокиБанковскойВыписки.НазначениеПлатежа), "БРОКЕР") = 0);
			
		Запрос.УстановитьПараметр(
			"ВНазначенииПлатежаОплатаИнвестиционныхПаев", 	
			СтрНайти(ВРег(РеквизитыСтрокиБанковскойВыписки.НазначениеПлатежа), "ПЕРЕЧИСЛЕНИЕ ДЕНЕЖНЫХ СРЕДСТВ В ОПЛАТУ ИНВЕСТИЦИОННЫХ ПАЕВ") > 0
			Или СтрНайти(ВРег(РеквизитыСтрокиБанковскойВыписки.НазначениеПлатежа), "ПЕРЕЧИСЛЕНИЕ ДЕНЕЖНЫХ СРЕДСТВ В ОПЛАТУ ПАЕВ") > 0
			Или СтрНайти(ВРег(РеквизитыСтрокиБанковскойВыписки.НазначениеПлатежа), "ОПЛАТА ПАЕВ") > 0);
			
		Запрос.УстановитьПараметр("Брокер_БК",					ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион"));
		Запрос.УстановитьПараметр("Брокер_ГПБ",					ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ"));
		Запрос.УстановитьПараметр("Брокер_РСХБ",				ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_РСХБ"));
		Запрос.УстановитьПараметр("ГПБ",						ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ"));
		Запрос.УстановитьПараметр("Контрагент",					РеквизитыСтрокиБанковскойВыписки.Контрагент);
		Запрос.УстановитьПараметр("НКО_НКЦ",					ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
		Запрос.УстановитьПараметр("РСХБ",						ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкРСХБ"));
		Запрос.УстановитьПараметр("СтрокаБанковскойВыписки",	СтрокаБанковскойВыписки);                                         
		Запрос.УстановитьПараметр("ММВБ_РТС",					ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС"));
		Запрос.УстановитьПараметр("ММВБ_РТС_ТорговыйПлюс",		ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ_Торговый+"));
		Запрос.УстановитьПараметр("БК_Регион",					ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_РЕГИОН_БК"));
				
		КоличествоСтрокОплаты = Запрос.Выполнить().Выбрать().Количество();
		
		СозданоОплат = 0;
		СимволДвойныеКавычки = Символ(34);
		Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы["_Основания"].ПолучитьДанные().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДополнительныйИдентификатор = ?(ТипЗнч(Выборка.ДополнительныйИдентификатор) = Тип("Число"), Формат(Выборка.ДополнительныйИдентификатор, "ЧН='""""'; ЧГ=0"), Выборка.ДополнительныйИдентификатор);
			
			// Пробуем найти в назначении платежа основной и дополнительный идентификатор
			Если Выборка.ВидДокумента <> "ЗакрытиеКредитногоИнструмента" 
				И (СтрНайти(НазначениеПлатежа, НРег(Выборка.ОсновнойИдентификатор)) > 0 
					Или СтрНайти(НазначениеПлатежа, СтрЗаменить(НРег(Выборка.ОсновнойИдентификатор), СимволДвойныеКавычки, "")) > 0) Тогда
								
				Если Выборка.ВидДокумента = "ПриходПроцентовМНО" И Не ПустаяСтрока(ДополнительныйИдентификатор) Тогда
					
					Для Каждого СимволНомера Из МассивСимволовНомера Цикл
						
						Если СтрНайти(НазначениеПлатежа, НРег(СимволНомера + ДополнительныйИдентификатор)) > 0 Тогда
							
							// Идентификация завершена, можно искать документ (он создается заранее в непроведенном виде)
							ДокументДДССсылка = НайтиДокументДвиженияДенежныхСредствПоЗначениюРеквизита("ПриходПроцентовМНО", "МНО", Выборка.Основание, ДатаВыписки, "НеПроведен");
							
							Если ДокументДДССсылка <> Неопределено Тогда
								
								ДокументДДС = ДокументДДССсылка.ПолучитьОбъект();
								ДокументДДС.СтрокаБанковскойВыписки = СтрокаБанковскойВыписки;
								
								Попытка 
									ДокументДДС.Записать(РежимЗаписиДокумента.Проведение);
									Возврат ДокументДДС.Ссылка;
								Исключение
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
								КонецПопытки;
								
							КонецЕсли;	
							
							Возврат Неопределено;
							
						КонецЕсли;
						
					КонецЦикла;
					
				ИначеЕсли Выборка.ВидДокумента = "Оплата" Тогда
					
					// Проверим, что вся сумма строки выписки еще не использована
					Если СтрокаБанковскиИспользуетсяВРеестреПлатежейВсейСуммой(СтрокаБанковскойВыписки, РеквизитыСтрокиБанковскойВыписки.Сумма) Тогда
						Возврат Неопределено;						
					КонецЕсли;
					
					ДокументДДС = Документы.Оплата.СоздатьДокумент();
										
					ДокументДДС.Заполнить(Выборка.Основание);
					ДокументДДС.Дата = Документы.СтрокаБанковскойВыписки.ВремяДокументаДвиженияДенежныхСредств(ДатаВыписки, ИспользуетсяПредварительнаяВыписка, "Приход");
					
					ДокументДДС.СтрокаБанковскойВыписки	= СтрокаБанковскойВыписки;
					
					ДокументДДС.РасчетныйСчет			= РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет;
					
					Если Не ЗначениеЗаполнено(ДокументДДС.ВидДвижения) Тогда
												
						ДокументДДС.ВидДвижения			= Перечисления.ВидыДвижений.Приход;											
						ДокументДДС.ВидЗадолженности	= Выборка.ДополнительныйИдентификатор; 
						ДокументДДС.Контрагент			= Выборка.Контрагент;
						ДокументДДС.ВалютаОплаты		= ВалютаУчета;
						
						СтрокаОснования				= ДокументДДС.Основания.Добавить();
						СтрокаОснования.Основание	= Выборка.Основание; 
						СтрокаОснования.Валюта		= ВалютаУчета;
						
						Если Выборка.СуммаОстаток > 0 Тогда
							СтрокаОснования.Сумма		= Выборка.СуммаОстаток;
							СтрокаОснования.СуммаОплаты	= Выборка.СуммаОстаток;
						ИначеЕсли Выборка.СуммаКупонаОстаток > 0 Тогда
							СтрокаОснования.СуммаКупона			= Выборка.СуммаКупонаОстаток;
							СтрокаОснования.СуммаОплатыКупона	= Выборка.СуммаКупонаОстаток;
						КонецЕсли;
						
					КонецЕсли;	
					
					Если ДокументДДС.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовАкции Тогда
						ДокументДДС.Основания[0].Сумма			= Выборка.СуммаОстаток;
						ДокументДДС.Основания[0].СуммаОплаты	= Выборка.СуммаОстаток;
					КонецЕсли;
					
					Если Не РаботаСДокументами.ЗаписатьПровестиДокумент(ДокументДДС) Тогда							
						Возврат Неопределено;
					КонецЕсли;
					
					СозданоОплат = СозданоОплат + 1;
					
					Если СозданоОплат = КоличествоСтрокОплаты Тогда
						Возврат ДокументДДС.Ссылка;
					Иначе
						Продолжить;
					КонецЕсли;
						
				ИначеЕсли Выборка.ВидДокумента = "ПереводДенежныхСредствПоПоручению" И РеквизитыСтрокиБанковскойВыписки.Сумма = Выборка.СуммаОстаток Тогда
										
					ДокументДДССсылка = НайтиДокументДвиженияДенежныхСредствПоЗначениюРеквизита("ПереводДенежныхСредств", "Основание", Выборка.Основание, ДатаВыписки, "НеИмеетЗначения");
					
					Если ДокументДДССсылка <> Неопределено Тогда						
						ДокументДДС = ДокументДДССсылка.ПолучитьОбъект();						
					Иначе
						ДокументДДС = Документы.ПереводДенежныхСредств.СоздатьДокумент();
						ДокументДДС.Заполнить(Выборка.Основание);
					КонецЕсли;
					
					ДокументДДС.Дата = Документы.СтрокаБанковскойВыписки.ВремяДокументаДвиженияДенежныхСредств(ДатаВыписки, ИспользуетсяПредварительнаяВыписка, "Приход");
					
					ДокументДДС.СтрокаБанковскойВыпискиПолучатель = СтрокаБанковскойВыписки;
					
					Если РаботаСДокументами.ЗаписатьПровестиДокумент(ДокументДДС) Тогда
						Возврат ДокументДДС.Ссылка;
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
					КонецЕсли;
										
					Возврат Неопределено;
										
				ИначеЕсли Выборка.ВидДокумента = "ПереводДенежныхСредствБезПоручения" Тогда
										
					ДокументДДС = Документы.ПереводДенежныхСредств.СоздатьДокумент();
					
					УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ДокументДДС);
					
					ЗаполнитьЗначенияСвойств(ДокументДДС, РеквизитыСтрокиБанковскойВыписки);                                                             
					
					ДокументДДС.РасчетныйСчет			= ?(Выборка.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок,
															РеквизитыСтрокиБанковскойВыписки.РасчетныйСчетКонтрагента,
															Справочники.БанковскиеСчета.ПустаяСсылка());
															
					ДокументДДС.РасчетныйСчетПолучатель	= РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет;
					
					ДокументДДС.ВариантПеревода	= Перечисления.ВариантыПереводаДенежныхСредств.Перевод;
					ДокументДДС.Валюта			= ВалютаУчета;
					
					ДокументДДС.МестоХранения			= Выборка.МестоХранения;
					ДокументДДС.МестоХраненияПолучатель	= Документы.СтрокаБанковскойВыписки.МестоХраненияДляРасчетногоСчета(ДокументДДС.РасчетныйСчетПолучатель);
					
					ДокументДДС.Брокер = Документы.СтрокаБанковскойВыписки.БрокерскаяКомпанияПоЮрЛицуИлиРасчетномуСчету(
											РеквизитыСтрокиБанковскойВыписки.Контрагент,
											ДатаВыписки,
											РеквизитыСтрокиБанковскойВыписки.РасчетныйСчетКонтрагента);
															
					ДокументДДС.СчетДоверительногоУправления = Документы.СтрокаБанковскойВыписки.СчетДоверительногоУправленияПоРасчетномуСчетуИИсполнителю(
																Новый Структура("Период, Организация, РасчетныйСчет, Контрагент, ВидДокумента", 
																		ДатаВыписки, 
																		Организация, 
																		РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет, 
																		РеквизитыСтрокиБанковскойВыписки.Контрагент, 
																		"ПереводДенежныхСредств"));
																		
					ДокументДДС.ФормаДенежныхСредств			= Перечисления.ФормыДенежныхСредств.Безналичная;
					ДокументДДС.ФормаДенежныхСредствПолучатель	= Перечисления.ФормыДенежныхСредств.Безналичная;
					
					ДокументДДС.Дата = Документы.СтрокаБанковскойВыписки.ВремяДокументаДвиженияДенежныхСредств(ДатаВыписки, ИспользуетсяПредварительнаяВыписка, "Приход");
					
					ДокументДДС.СтрокаБанковскойВыпискиПолучатель = СтрокаБанковскойВыписки;
					
					Если РаботаСДокументами.ЗаписатьПровестиДокумент(ДокументДДС) Тогда
						Возврат ДокументДДС.Ссылка;
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
					КонецЕсли;
										
					Возврат Неопределено;
					
				// Техдолг: у УКПИ много входящих платежей, не являющихся вводами, но ошибочно загружающихся как вводы; поэтому эта организация исключена, пока они не используют формирование исходящих платежных поручений
				ИначеЕсли Выборка.ВидДокумента = "ВводДенежныхСредств" И Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда	
														
					ДокументДДССсылка = НайтиДокументДвиженияДенежныхСредствПоЗначениюРеквизита("ВводДенежныхСредств", "СтрокаБанковскойВыписки", СтрокаБанковскойВыписки, ДатаВыписки, "Проведен");
					
					Если ДокументДДССсылка <> Неопределено Тогда						
						ДокументДДС = ДокументДДССсылка.ПолучитьОбъект();						
					Иначе
						
						ДокументДДС = Документы.ВводДенежныхСредств.СоздатьДокумент(); 
						
						ДокументДДС.Заполнить(Выборка.Основание); 
						
						ДокументДДС.Дата = Документы.СтрокаБанковскойВыписки.ВремяДокументаДвиженияДенежныхСредств(ДатаВыписки, ИспользуетсяПредварительнаяВыписка, "Приход");
						
						ДокументДДС.СтрокаБанковскойВыписки = СтрокаБанковскойВыписки;
					
						Если Не ЗначениеЗаполнено(Выборка.Основание) Или ТипЗнч(Выборка.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
							
							ДокументДДС.Контрагент = РеквизитыСтрокиБанковскойВыписки.Контрагент;
							ДокументДДС.НомерВходящегоДокумента = Выборка.ДополнительныйИдентификатор;
							ДокументДДС.ДатаВходящегоДокумента  = Выборка.Дата;
							ДокументДДС.РасчетныйСчетКонтрагента = РеквизитыСтрокиБанковскойВыписки.РасчетныйСчетКонтрагента;
							ДокументДДС.РасчетныйСчет = РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет;							
							ДокументДДС.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет, "Валюта");
							ДокументДДС.Сумма = РеквизитыСтрокиБанковскойВыписки.Сумма;
							ДокументДДС.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
																					
							ДокументДДС.КонтрагентДоговорТекстом = РаботаСДокументами.ПолучитьТекстКонтрагентаДляВводовВыводовДенежныхСредств(											
																		Организация,
																		ДокументДДС.Контрагент,
																		ДокументДДС.РасчетныйСчетКонтрагента,
																		Ложь,
																		ДокументДДС.Дата);
																		
							ДокументДДС.ДополнительныеСвойства.Вставить("ЗагрузкаБанковскойВыписки", Истина);																		
							
							Если Не ЗначениеЗаполнено(ДокументДДС.Основание) И ЗначениеЗаполнено(Выборка.Основание) Тогда
								ДокументДДС.Основание = Выборка.Основание;
							КонецЕсли;
							
						КонецЕсли;
						
						Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
								Выборка.СчетДоверительногоУправления,
								"ВидДоговораДоверительногоУправления") = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР Тогда
							ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР
						ИначеЕсли ТипЗнч(Выборка.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
							ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика;
						Иначе	
							ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление;
						КонецЕсли;
								
						ДокументДДС.КоррСчет = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(
													ДокументДДС.Дата,
													Организация,
													ДокументДДС.СчетДоверительногоУправления,
													ДокументДДС.ВидОперации);

						Если ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика Тогда
							ДокументДДС.Субконто1 = ДокументДДС.Контрагент;
						КонецЕсли;

					КонецЕсли;
					
					Если РаботаСДокументами.ЗаписатьПровестиДокумент(ДокументДДС) Тогда
						Возврат ДокументДДС.Ссылка;
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
					КонецЕсли;
										
					Возврат Неопределено;
					
				КонецЕсли;
				
			ИначеЕсли Выборка.ВидДокумента = "ЗакрытиеКредитногоИнструмента" Тогда
				
				// К закрытию кредитного инструмента прикрепляются две строки выписки (проценты и тело), назначение платежа у разных банков отличается:
				// 1. Содержится и ген. соглашение, и номер и дата подтверждения
				// 2. Содержится только номер и дата подтверждения
				// 3. Содержится номер договора депозита (если заключен не по ген. соглашению)
				// 4. Содержится только номер подтверждения (номер относительно длинный)
				//
				// В назначении платежа по выплате процентов содержится "процент"
								
				ДатаПодтверждения = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
				
				Если СтрНайти(НазначениеПлатежа, НРег(Выборка.ОсновнойИдентификатор)) > 0
					И (СтрНайти(НазначениеПлатежа, " " + НРег(ДополнительныйИдентификатор + " от " + ДатаПодтверждения)) > 0						
						Или (СтрНайти(НазначениеПлатежа, НРег(ДополнительныйИдентификатор)) > 0 И СтрДлина(ДополнительныйИдентификатор) > 6)) Тогда
					
					// Ищем или создаем документ
				    ДокументДДССсылка = НайтиДокументДвиженияДенежныхСредствПоЗначениюРеквизита("ЗакрытиеКредитногоИнструмента", "КредитныйИнструмент", Выборка.Основание, ДатаВыписки, "Проведен");
					
					Если ДокументДДССсылка = Неопределено Тогда
						
						МассивДокументов = Справочники.ДепозитныеВклады.СоздатьЗакрытияКредитныхИнструментов(Организация, НачалоДня(ДатаВыписки), Выборка.Основание);
						
						Если МассивДокументов = Неопределено Тогда
							Возврат Неопределено;	
						КонецЕсли;
						
						ДокументДДССсылка = МассивДокументов[0];
						
					КонецЕсли;
					
					ДокументДДС = ДокументДДССсылка.ПолучитьОбъект();
														
					Если СтрНайти(НазначениеПлатежа, "процент") > 0 Тогда
						ДокументДДС.СтрокаБанковскойВыпискиПроценты	= СтрокаБанковскойВыписки;
						ДокументДДС.СуммаПроцентов = СтрокаБанковскойВыписки.Сумма;
					Иначе	
						ДокументДДС.СтрокаБанковскойВыписки	= СтрокаБанковскойВыписки;
					КонецЕсли;
					
					ДокументДДС.РасчетныйСчет = РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет;
										
					Если РаботаСДокументами.ЗаписатьПровестиДокумент(ДокументДДС) Тогда
						Возврат ДокументДДС.Ссылка;
					Иначе
						Возврат Неопределено;
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
				
	Иначе
		
	    Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПлатежноеПоручениеИсходящееОснования.Основание КАК Основание,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ПлатежноеПоручениеИсходящееОснования.Основание) В (&ТипыОснований_Оплата)
			|			ТОГДА ""Оплата""
			|		КОГДА ТИПЗНАЧЕНИЯ(ПлатежноеПоручениеИсходящееОснования.Основание) В (&ТипыОснований_ВыводДенежныхСредств)
			|			ТОГДА ""ВыводДенежныхСредств""
			|		КОГДА ТИПЗНАЧЕНИЯ(ПлатежноеПоручениеИсходящееОснования.Основание) В (&ТипыОснований_ПереводДенежныхСредств)
			|			ТОГДА ""ПереводДенежныхСредств""
			|		КОГДА ТИПЗНАЧЕНИЯ(ПлатежноеПоручениеИсходящееОснования.Основание) В (&ТипыОснований_РазмещениеКредитногоИнструмента)
			|			ТОГДА ""РазмещениеКредитногоИнструмента""
			|	КОНЕЦ КАК ТипДокумента
			|ИЗ
			|	Документ.ПлатежноеПоручениеИсходящее.Основания КАК ПлатежноеПоручениеИсходящееОснования
			|ГДЕ
			|	ПлатежноеПоручениеИсходящееОснования.Ссылка = &Ссылка"); 
		
		Запрос.УстановитьПараметр("Ссылка", ПлатежноеПоручение);
		
		ТипыОснований_Оплата = Новый Массив;
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.НачислениеЗадолженности"));
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.Сделка"));
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.СделкаСНедвижимостью"));	
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.СделкаСМО"));
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.ОперацияНДС"));
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.Оплата"));
		ТипыОснований_Оплата.Добавить(Тип("ДокументСсылка.РасчетНДФЛПайщиков"));
		
		ТипыОснований_ВыводДенежныхСредств = Новый Массив;
		ТипыОснований_ВыводДенежныхСредств.Добавить(Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств"));
		ТипыОснований_ВыводДенежныхСредств.Добавить(Тип("ДокументСсылка.ПогашениеПаев"));
		
		ТипыОснований_ПереводДенежныхСредств = Новый Массив;
		ТипыОснований_ПереводДенежныхСредств.Добавить(Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств"));
		ТипыОснований_ПереводДенежныхСредств.Добавить(Тип("ДокументСсылка.ПереводДенежныхСредств"));
		ТипыОснований_ПереводДенежныхСредств.Добавить(Тип("ДокументСсылка.ВводДенежныхСредств"));
		
		ТипыОснований_РазмещениеКредитногоИнструмента = Новый Массив;
		ТипыОснований_РазмещениеКредитногоИнструмента.Добавить(Тип("ДокументСсылка.Распоряжение"));
		
		Запрос.УстановитьПараметр("ТипыОснований_Оплата",									ТипыОснований_Оплата);
		Запрос.УстановитьПараметр("ТипыОснований_ВыводДенежныхСредств",						ТипыОснований_ВыводДенежныхСредств);
		Запрос.УстановитьПараметр("ТипыОснований_ПереводДенежныхСредств",					ТипыОснований_ПереводДенежныхСредств);
		Запрос.УстановитьПараметр("ТипыОснований_РазмещениеКредитногоИнструмента",			ТипыОснований_РазмещениеКредитногоИнструмента);
			
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() > 0 Тогда
			
			Если ЗначениеЗаполнено(Результат[0].ТипДокумента) Тогда
				
				Если Результат[0].ТипДокумента = "Оплата" И Результат.Количество() > 1 Тогда
					
					// Доработаем позже
					Возврат Неопределено;
					
				ИначеЕсли Результат[0].ТипДокумента = "РазмещениеКредитногоИнструмента" Тогда	
					
					ДокументДДС = НайтиСоздатьРазмещениеДепозита(ПлатежноеПоручение, СтрокаБанковскойВыписки);
					
				ИначеЕсли ТипЗнч(Результат[0].Основание) = Тип("ДокументСсылка.ПереводДенежныхСредств")
					Или Результат[0].ТипДокумента = "Оплата" И ТипЗнч(Результат[0].Основание) = Тип("ДокументСсылка.Оплата") Тогда
					
					// Документ ДДС уже есть, осталось прикрепись к нему строку банковской выписки
					ДокументДДС = Результат[0].Основание.ПолучитьОбъект();
					
					ДокументДДС.СтрокаБанковскойВыписки = СтрокаБанковскойВыписки;
					
					Если Не РаботаСДокументами.ЗаписатьПровестиДокумент(ДокументДДС) Тогда
						Возврат Неопределено;
					КонецЕсли;
					
				Иначе			
						
					ДокументДДС = Документы[Результат[0].ТипДокумента].СоздатьДокумент();
					
					Если Результат[0].ТипДокумента = "Оплата" Тогда
						ДокументДДС.ДополнительныеСвойства.Вставить("ЗагрузкаБанковскойВыписки", Истина);
					КонецЕсли;  
					
					Если ЗначениеЗаполнено(ПлатежноеПоручение.СчетДоверительногоУправления) Тогда
						ДокументДДС.СчетДоверительногоУправления = ПлатежноеПоручение.СчетДоверительногоУправления;
					КонецЕсли;
										
					ДокументДДС.Заполнить(Результат[0].Основание);
					Если Результат[0].ТипДокумента = "Оплата" Тогда
						
						Если Не ЗначениеЗаполнено(ДокументДДС.ВидДвижения) Тогда
							ДокументДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(ДокументДДС.ВидЗадолженности) И Результат[0].Основание.Метаданные().Реквизиты.Найти("ВидЗадолженности") <> Неопределено Тогда
							ДокументДДС.ВидЗадолженности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат[0].Основание, "ВидЗадолженности");
						КонецЕсли;
						
						// При заполнении документа Оплата на основании документов начисления счет берется из документа начисления,
						// а нужно устанавливать фактический счет из выписки
						ДокументДДС.РасчетныйСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежноеПоручение, "РасчетныйСчет");
						
					КонецЕсли;
															
					ДокументДДС.Дата = Документы.СтрокаБанковскойВыписки.ВремяДокументаДвиженияДенежныхСредств(ДатаВыписки, ИспользуетсяПредварительнаяВыписка);
					
					Если Результат[0].ТипДокумента = "ВыводДенежныхСредств" Тогда
						
						// Заполняется в зависимости от вида договора
						
						ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументДДС.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
						
						Если ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР Тогда
							ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР;
						ИначеЕсли ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
							Если ТипЗнч(ДокументДДС.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") 
									И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументДДС.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен
								Или ТипЗнч(ДокументДДС.Основание) = Тип("ДокументСсылка.ПогашениеПаев") 
									И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументДДС.Основание.Заявка, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен
							Тогда
								ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствПриОбменеПаев;
							Иначе	
								ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику;
							КонецЕсли; 	
						ИначеЕсли ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов Тогда
							ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводУчредителюДоходаПолученногоОтРазмещения;
						Иначе
							ДокументДДС.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению;
						КонецЕсли;
						
						ДокументДДС.КоррСчет = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(ДокументДДС.Дата, Организация, ДокументДДС.СчетДоверительногоУправления, ДокументДДС.ВидОперации);							
													
						Если Не ЗначениеЗаполнено(ДокументДДС.РасчетныйСчет) Тогда
							ДокументДДС.РасчетныйСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежноеПоручение, "РасчетныйСчет");		
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(ДокументДДС.РасчетныйСчетКонтрагента) Тогда
							ДокументДДС.РасчетныйСчетКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежноеПоручение, "РасчетныйСчетКонтрагента");		
						КонецЕсли;
						
					ИначеЕсли Результат[0].ТипДокумента = "ПереводДенежныхСредств" И ТипЗнч(Результат[0].Основание) = Тип("ДокументСсылка.ВводДенежныхСредств") Тогда
						
						РеквизитыВводаДС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Результат[0].Основание, "СчетДоверительногоУправления, Основание");
						ЗаполнитьЗначенияСвойств(ДокументДДС, РеквизитыВводаДС);
						
						РеквизитыСтрокиВыписки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаБанковскойВыписки, "РасчетныйСчет, РасчетныйСчетКонтрагента, Сумма");
						ЗаполнитьЗначенияСвойств(ДокументДДС, РеквизитыСтрокиВыписки);
						ДокументДДС.РасчетныйСчетПолучатель = РеквизитыСтрокиВыписки.РасчетныйСчетКонтрагента;
						
						ДокументДДС.МестоХранения			= Справочники.МестаХранения.ВнебиржевойРынок;
						ДокументДДС.МестоХраненияПолучатель	= Справочники.МестаХранения.ВнебиржевойРынок;
						
						ДокументДДС.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументДДС.Организация, "ВалютаУчета");
						
					КонецЕсли;
						
					ДокументДДС.СтрокаБанковскойВыписки = СтрокаБанковскойВыписки;				
					
					// При отсутствии задолженности документ Оплата автоматически помечается на удаление, добавляется комментарий - выведем его 
					Если ДокументДДС.ПометкаУдаления Тогда
						
						ТекстСообщения = СтрШаблон("Не удалось создать документ '%1' по строке выписки '%2'", Результат[0].ТипДокумента, СтрокаБанковскойВыписки); 
						Если Не ПустаяСтрока(ДокументДДС.Комментарий) Тогда
							ТекстСообщения = ТекстСообщения + ", комментарий: " + СокрЛП(ДокументДДС.Комментарий);
						КонецЕсли;
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, СтрокаБанковскойВыписки);
						
						Возврат Неопределено;
										
					КонецЕсли; 
					
					Если Не РаботаСДокументами.ЗаписатьПровестиДокумент(ДокументДДС) Тогда
						Возврат Неопределено;				
					КонецЕсли;                     			
					
				КонецЕсли;	
							
				Возврат ?(ДокументДДС = Неопределено, Неопределено, ДокументДДС.Ссылка);
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не определен тип документа движения денежных средств для ввода на основании документа %1", Результат[0].Основание), Результат[0].Основание);   
				Возврат Неопределено;
			КонецЕсли;               		
					
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

Функция СтрокаБанковскиИспользуетсяВРеестреПлатежейВсейСуммой(СтрокаБанковскойВыписки, Сумма)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрПлатежей.ДвижениеДенежныхСредств КАК ДвижениеДенежныхСредств,
		|	СУММА(РеестрПлатежей.Сумма) КАК Сумма
		|ИЗ
		|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|ГДЕ
		|	РеестрПлатежей.СтрокаБанковскойВыписки = &СтрокаБанковскойВыписки
		|	И РеестрПлатежей.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	РеестрПлатежей.ДвижениеДенежныхСредств
		|
		|ИМЕЮЩИЕ
		|	СУММА(РеестрПлатежей.Сумма) = &Сумма");
	
	Запрос.УстановитьПараметр("СтрокаБанковскойВыписки",	СтрокаБанковскойВыписки);
	Запрос.УстановитьПараметр("Сумма",						Сумма);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции	

Функция НайтиДокументДвиженияДенежныхСредствПоЗначениюРеквизита(ВидДокумента, Реквизит, ЗначениеРеквизита, ДатаВыписки, СтатусПроведенияДокумента)
	
	Если СтатусПроведенияДокумента = "Проведен" Тогда
		УсловиеНаСостояниеДокумента = "Документ.Проведен";
	ИначеЕсли СтатусПроведенияДокумента = "НеПроведен" Тогда
		УсловиеНаСостояниеДокумента = "НЕ Документ.Проведен И НЕ Документ.ПометкаУдаления";
	Иначе	
		УсловиеНаСостояниеДокумента = "НЕ Документ.ПометкаУдаления";
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Ссылка
		|ИЗ
		|	&Документ КАК Документ
		|ГДЕ
		|	&УсловияНаДокумент");
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ." + ВидДокумента);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
						"&УсловияНаДокумент", 
						СтрШаблон("Документ.%1 = &ЗначениеРеквизита И %2 И Документ.Дата МЕЖДУ &НачалоДня И &КонецДня",
							Реквизит,
							УсловиеНаСостояниеДокумента));
	
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
	Запрос.УстановитьПараметр("НачалоДня", 		   НачалоДня(ДатаВыписки));
	Запрос.УстановитьПараметр("КонецДня", 		   КонецДня(ДатаВыписки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

Функция НайтиСоздатьРазмещениеДепозита(ПлатежноеПоручение, СтрокаБанковскойВыписки)
	
	// В платежном поручении по размещению кредитного инструмента в основаниях может быть только одно распоряжение,
	// поэтому смотрим только первую строку
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РазмещениеКредитногоИнструмента.Ссылка КАК РазмещениеКредитногоИнструмента,
		|	ДепозитныеВклады.Ссылка КАК ДепозитныйВклад,
		|	ДепозитныеВклады.Распоряжение КАК Распоряжение
		|ИЗ
		|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
		|		ПО ДепозитныеВклады.Ссылка = РазмещениеКредитногоИнструмента.КредитныйИнструмент
		|			И (НЕ РазмещениеКредитногоИнструмента.ПометкаУдаления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПлатежноеПоручениеОснования.Основание КАК Распоряжение
		|		ИЗ
		|			Документ.ПлатежноеПоручениеИсходящее.Основания КАК ПлатежноеПоручениеОснования
		|		ГДЕ
		|			ПлатежноеПоручениеОснования.Ссылка = &ПлатежноеПоручение
		|			И ПлатежноеПоручениеОснования.НомерСтроки = 1) КАК Распоряжения
		|		ПО ДепозитныеВклады.Распоряжение = Распоряжения.Распоряжение");
	
	Запрос.УстановитьПараметр("ПлатежноеПоручение", ПлатежноеПоручение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	 	
	Если Выборка.Следующий() Тогда
	
		Если ЗначениеЗаполнено(Выборка.РазмещениеКредитногоИнструмента) Тогда
			РазмещениеКредитногоИнструмента = Выборка.РазмещениеКредитногоИнструмента.ПолучитьОбъект();	
		Иначе
			РазмещениеКредитногоИнструмента = Документы.РазмещениеКредитногоИнструмента.СоздатьДокумент();
			
			РазмещениеКредитногоИнструмента.ДополнительныеСвойства.Вставить("ДепозитныйВклад", Выборка.ДепозитныйВклад);
			РазмещениеКредитногоИнструмента.Заполнить(Выборка.Распоряжение);
			
			РазмещениеКредитногоИнструмента.Дата = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаБанковскойВыписки, "Дата")) + 17 * 60 * 60 + 30 * 60;;
		КонецЕсли;
		
		РазмещениеКредитногоИнструмента.СтрокаБанковскойВыписки = СтрокаБанковскойВыписки;
		
		Если РаботаСДокументами.ЗаписатьПровестиДокумент(РазмещениеКредитногоИнструмента) Тогда		
			Возврат РазмещениеКредитногоИнструмента;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	
	Иначе
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден депозитный вклад для платежного поручения " + СокрЛП(ПлатежноеПоручение), ПлатежноеПоручение);
		Возврат Неопределено;	
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
