
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ИсходныеДанные = "Объект скопирован из " + ОбъектКопирования;
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// проверка на наличие в реестре платежей
	Если ЭтотОбъект.ПометкаУдаления И Не ЭтотОбъект.Ссылка.ПометкаУдаления Тогда
		СписокРегистраторов = РегистрыСведений.РеестрПлатежей.НайтиВРеестреПлатежей(ЭтотОбъект.Ссылка);
		Если ЗначениеЗаполнено(СписокРегистраторов) Тогда
			Для Каждого Регистратор Из СписокРегистраторов Цикл  
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ зарегистрирован в реестре платежей: " + Регистратор.Представление, Регистратор.Значение, , , Отказ);
			КонецЦикла;
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры


