
Функция СформироватьНаименование(РеквизитыДоговора, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "Контрагент, НомерДоговора, ДатаЗаключения, ОтветственноеХранение";
	
	Если РеквизитыДоговора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПустаяСтрока(РеквизитыДоговора.НомерДоговора) И ЗначениеЗаполнено(РеквизитыДоговора.Контрагент)
		Или ЗначениеЗаполнено(РеквизитыДоговора.ДатаЗаключения)
	Тогда
		Наименование = "" + РеквизитыДоговора.Контрагент + ", № " + РеквизитыДоговора.НомерДоговора + " от " + Формат(РеквизитыДоговора.ДатаЗаключения, "ДФ=dd.MM.yy");
		
		Если РеквизитыДоговора.ОтветственноеХранение Тогда
			Наименование = Наименование + " (отв. хран.)";
		КонецЕсли;
		
		Депозитарий = Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(РеквизитыДоговора.Контрагент, "ДепозитарныеКомпании");

		Если ЗначениеЗаполнено(Депозитарий) И Депозитарий.Регистратор Тогда
			Наименование = Наименование + " (на ведение реестра)";	
		КонецЕсли;

	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименование
