
&НаСервере
Процедура УстановитьПараметрыДинамическогоСпискаНаСервере()

	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("Организация",                  ЭтаФорма.Организация);
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("Период",                       ЭтаФорма.ОграничитьДатой);
	
	ЭтаФорма.Заголовок = "Последовательность по " + ЭтаФорма.СчетДоверительногоУправления;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, "Организация, СчетДоверительногоУправления, ОграничитьДатой");
	
	УстановитьПараметрыДинамическогоСпискаНаСервере();
	
	ЭтаФорма.ФлажокОграничитьДатой = ЗначениеЗаполнено(ЭтаФорма.ОграничитьДатой);
	Элементы.ОграничитьДатой.Видимость = ЭтаФорма.ФлажокОграничитьДатой;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	
	УстановитьПараметрыДинамическогоСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокОграничитьДатойПриИзменении(Элемент)
	
	Элементы.ОграничитьДатой.Видимость = ЭтаФорма.ФлажокОграничитьДатой;
	
	Если Не ЭтаФорма.ФлажокОграничитьДатой Тогда
		ЭтаФорма.ОграничитьДатой = Неопределено;
	КонецЕсли;
	
	УстановитьПараметрыДинамическогоСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоследовательностиПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДокументыПоследовательности.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если Элементы.ДокументыПоследовательности.ТекущийЭлемент = Элементы.ДокументыПоследовательностиРегистратор Тогда
		ОткрытьЗначение(ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры
