
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ОбъектНедвижимости = Неопределено;
		Если ДанныеЗаполнения.Свойство("ОбъектНедвижимости", ОбъектНедвижимости) Тогда
			
			ДобавитьОбъектНедвижимости(ОбъектНедвижимости);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РеквизитыОбъектовНедвижимости.Очистить();
	Движения.РеквизитыЗемельныхУчастков.Очистить();
	Движения.РеквизитыОбъектовНедвижимости.Записывать = Истина;
	Движения.РеквизитыЗемельныхУчастков.Записывать = Истина;
	
	Движения.РеквизитыОбъектовНедвижимости.Загрузить(ОбъектыНедвижимостиКромеЗемельныхУчастков.Выгрузить());
	Для Каждого Запись из Движения.РеквизитыОбъектовНедвижимости Цикл
		Запись.Период = ЭтотОбъект.Дата;
		Запись.Организация = ЭтотОбъект.Организация;
		Запись.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	КонецЦикла;
	
	Движения.РеквизитыЗемельныхУчастков.Загрузить(ЗемельныеУчастки.Выгрузить());
	Для Каждого Запись из Движения.РеквизитыЗемельныхУчастков Цикл
		Запись.Период = ЭтотОбъект.Дата;
		Запись.Организация = ЭтотОбъект.Организация;
		Запись.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОбъектНедвижимости(ОбъектНедвижимости) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОбъектыНедвижимости.Организация КАК Организация,
		|	ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
		|	РеквизитыЗемельныхУчастковСрезПоследних.КатегорияЗемельногоУчастка КАК КатегорияЗемельногоУчастка,
		|	ЕСТЬNULL(РеквизитыЗемельныхУчастковСрезПоследних.Адрес, РеквизитыОбъектовНедвижимостиСрезПоследних.Адрес) КАК Адрес,
		|	ЕСТЬNULL(РеквизитыЗемельныхУчастковСрезПоследних.Период, РеквизитыОбъектовНедвижимостиСрезПоследних.Период) КАК Период,
		|	РеквизитыЗемельныхУчастковСрезПоследних.Площадь КАК Площадь,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	РеквизитыЗемельныхУчастковСрезПоследних.ВидРазрешенногоИспользованияЗемельногоУчастка КАК ВидРазрешенногоИспользованияЗемельногоУчастка,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.НазначениеОбъектаНедвижимости КАК НазначениеОбъектаНедвижимости,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.СтроительствоЗавершено КАК СтроительствоЗавершено,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.НаименованиеЕГРН КАК НаименованиеЕГРН,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.ВидПомещения КАК ВидПомещения,
		|	ОбъектыНедвижимости.ВидОбъектаНедвижимости = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток) КАК ЭтоЗемельныйУчасток,
		|	ЕСТЬNULL(РеквизитыЗемельныхУчастковСрезПоследних.СчетДоверительногоУправления, РеквизитыОбъектовНедвижимостиСрезПоследних.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(РеквизитыЗемельныхУчастковСрезПоследних.КадастроваяСтоимость, РеквизитыОбъектовНедвижимостиСрезПоследних.КадастроваяСтоимость) КАК КадастроваяСтоимость,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.СтавкаНалогаНаИмущество КАК СтавкаНалогаНаИмущество,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.РасчетНалогаПоКадастровойСтоимости КАК РасчетНалогаПоКадастровойСтоимости
		|ИЗ
		|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЗемельныхУчастков.СрезПоследних(&ДатаДокумента, ОбъектНедвижимости = &ОбъектНедвижимости) КАК РеквизитыЗемельныхУчастковСрезПоследних
		|		ПО (РеквизитыЗемельныхУчастковСрезПоследних.ОбъектНедвижимости = ОбъектыНедвижимости.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(&ДатаДокумента, ОбъектНедвижимости = &ОбъектНедвижимости) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО ОбъектыНедвижимости.Ссылка = РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
		|ГДЕ
		|	ОбъектыНедвижимости.Ссылка = &ОбъектНедвижимости
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ОбъектНедвижимости", ОбъектНедвижимости);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.ЭтоЗемельныйУчасток Тогда
			ТабличнаяЧасть = "ЗемельныеУчастки";
		Иначе
			ТабличнаяЧасть = "ОбъектыНедвижимостиКромеЗемельныхУчастков";
		КонецЕсли;
		Строка = ЭтотОбъект[ТабличнаяЧасть].Найти(ОбъектНедвижимости,"ОбъектНедвижимости");
		Если Строка = Неопределено Тогда
			Строка = ЭтотОбъект[ТабличнаяЧасть].Добавить();
			Строка.ОбъектНедвижимости = ОбъектНедвижимости;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строка,ВыборкаДетальныеЗаписи,,"ОбъектНедвижимости");
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) Тогда
			ЭтотОбъект.СчетДоверительногоУправления = ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры
