
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустой()
		И Параметры.ЗначениеКопирования.Пустой()
		И НЕ (Параметры.ЗначенияЗаполнения.Свойство("Организация") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Организация)) Тогда
		
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	КонецЕсли;	
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, "Запись", "ИсходныйКлючЗаписи", Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)

	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	ГруппаОперацииОтчетностиЦБ = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ГруппаВидовОпераций, "Родитель") = ПредопределенноеЗначение("Справочник.ГруппыВидовОпераций.ОтчетностьЦБ"));
	
	Элементы.Основной.Видимость = НЕ ГруппаОперацииОтчетностиЦБ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Элементы.Основной.Видимость Тогда
		Запись.Основной = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
