Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Данные для 6-НДФЛ",
		"0.28",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
		
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период, Организация");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ТаблицаОтчета = Сформировать();
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаОтчета", ТаблицаОтчета);
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ДополнительныеПараметры = Новый Структура("РегистрацияСтатистики", Ложь);
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,,ВнешниеНаборыДанных, ДополнительныеПараметры);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

Функция ЗапросФЛ()
	
	// отчет строим за квартал, расчеты НДФЛ выбираем на отчетный и предыдущий
	
	// Ушедшие. ИИС перешедшие к другому профучастнику. 
	// так как они могут вернуться, то берем рачеты со статусом "перевод" и фильтруем по ним.  
	
	// _НОБ -  запрос к табличной части Расчетов НДФЛ. Определяем доходы и вычеты
	// _Расчеты НДФЛ - Запрос к документам
	// _РасчетНОБсИндексами - объединяем две таблицы. Некоторые Расчеты могут быть без табличной части, но они все равно должны попадать в отчет. 
	// поэтому результат получен через промежуточные запросы. Проиндексируем таблицу, так как нам надо в отчете показывать разницу между смежными документами
	// так как временную таблицу нелья сортировать, сделано через вложенный запрос ВЫБРАТЬ ПЕРВЫЕ
	// _Оплаты,  _Выводы - нужно для определения фактических дат получения дохода
	
	// Результат. Обхединяем _РасчетНОБсИндексами саму с собой и получаем разницу между двумя документами РасчетаНДФЛ 	
	
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ВидДоговора", 					Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(75)));
	Результат.Колонки.Добавить("СчетДоверительногоУправления", 	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	Результат.Колонки.Добавить("Клиент", 						Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	Результат.Колонки.Добавить("ДокументРасчет",				Новый ОписаниеТипов("ДокументСсылка.РасчетНДФЛ"));
	Результат.Колонки.Добавить("ДатаРасчета",					Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("НДФЛНачисленный",				Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ДоходОтчет",					Новый ОписаниеТипов("Число"));       //по обращаемым
	Результат.Колонки.Добавить("ВычетОтчет",					Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НОБОтчет",						Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ДоходОтчетНеобр",				Новый ОписаниеТипов("Число"));       //по необращаемым
	Результат.Колонки.Добавить("ВычетОтчетНеобр",				Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НОБОтчетНеобр",					Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("ДокументНачисление",			Новый ОписаниеТипов("ДокументСсылка.НачислениеЗадолженности"));
	Результат.Колонки.Добавить("ДокументОплата",				Новый ОписаниеТипов("ДокументСсылка.Оплата"));
	Результат.Колонки.Добавить("СуммаОплатыНалога",				Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("ДатаВыплатыДохода",				Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаОплатыФакт",				Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаОплаты",					Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("СтавкаНДФЛ",					Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДФЛ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РасчетНДФЛ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	РасчетНДФЛ.Ссылка КАК РасчетНДФЛ
	|ПОМЕСТИТЬ _Ушедшие
	|ИЗ
	|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
	|ГДЕ
	|	РасчетНДФЛ.Организация = &Организация
	|	И РасчетНДФЛ.ОснованиеРасчета В (ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику), ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода))
	|	И РасчетНДФЛ.ПометкаУдаления = ЛОЖЬ
	|	И РасчетНДФЛ.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетНДФЛНалоговаяБаза.Ссылка КАК ДокументРасчет,
	|	РасчетНДФЛНалоговаяБаза.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(РасчетНДФЛНалоговаяБаза.ВидДоходаВычета) = ТИП(Справочник.ВидыДоходовНДФЛ)
	|					И РасчетНДФЛНалоговаяБаза.ВидДоходаВычета.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается)
	|				ТОГДА РасчетНДФЛНалоговаяБаза.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Доход,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(РасчетНДФЛНалоговаяБаза.ВидДоходаВычета) = ТИП(Справочник.ВидыВычетовНДФЛ)
	|					И РасчетНДФЛНалоговаяБаза.ВидДоходаВычета.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается)
	|				ТОГДА -РасчетНДФЛНалоговаяБаза.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Вычет,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(РасчетНДФЛНалоговаяБаза.ВидДоходаВычета) = ТИП(Справочник.ВидыДоходовНДФЛ)
	|					И РасчетНДФЛНалоговаяБаза.ВидДоходаВычета.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.НеОбращается)
	|				ТОГДА РасчетНДФЛНалоговаяБаза.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоходНеобр,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(РасчетНДФЛНалоговаяБаза.ВидДоходаВычета) = ТИП(Справочник.ВидыВычетовНДФЛ)
	|					И РасчетНДФЛНалоговаяБаза.ВидДоходаВычета.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.НеОбращается)
	|				ТОГДА -РасчетНДФЛНалоговаяБаза.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВычетНеобр
	|ПОМЕСТИТЬ _НОБ
	|ИЗ
	|	Документ.РасчетНДФЛ.НалоговаяБаза КАК РасчетНДФЛНалоговаяБаза
	|ГДЕ
	|	РасчетНДФЛНалоговаяБаза.Ссылка.ДатаРасчета МЕЖДУ &ДатаНачалаРасчетов И &ДатаОкончанияРасчетов
	|	И РасчетНДФЛНалоговаяБаза.Ссылка.Организация = &Организация
	|	И РасчетНДФЛНалоговаяБаза.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НЕ РасчетНДФЛНалоговаяБаза.ВидДоходаВычета В (&Дивиденды)
	|	И НЕ РасчетНДФЛНалоговаяБаза.Ссылка В
	|				(ВЫБРАТЬ
	|					_Ушедшие.РасчетНДФЛ
	|				ИЗ
	|					_Ушедшие КАК _Ушедшие)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетНДФЛНалоговаяБаза.Ссылка,
	|	РасчетНДФЛНалоговаяБаза.СтавкаНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетНДФЛ.Ссылка КАК Ссылка,
	|	РасчетНДФЛ.ДатаРасчета КАК ДатаРасчета,
	|	РасчетНДФЛ.НДФЛНачисленный КАК НДФЛНачисленный,
	|	РасчетНДФЛ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13) КАК СтавкаНДФЛ
	|ПОМЕСТИТЬ _РасчетыНДФЛ
	|ИЗ
	|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
	|ГДЕ
	|	РасчетНДФЛ.ДатаРасчета МЕЖДУ &ДатаНачалаРасчетов И &ДатаОкончанияРасчетов
	|	И НЕ РасчетНДФЛ.Ссылка В
	|				(ВЫБРАТЬ
	|					_Ушедшие.РасчетНДФЛ
	|				ИЗ
	|					_Ушедшие КАК _Ушедшие)
	|	И РасчетНДФЛ.Организация = &Организация
	|	И РасчетНДФЛ.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_РасчетНОБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_РасчетНОБ.Ссылка КАК Ссылка,
	|	_РасчетНОБ.ДатаРасчета КАК ДатаРасчета,
	|	_РасчетНОБ.НДФЛНачисленный КАК НДФЛНачисленный,
	|	_РасчетНОБ.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	_РасчетНОБ.Доход КАК Доход,
	|	_РасчетНОБ.Вычет КАК Вычет,
	|	_РасчетНОБ.НОБ КАК НОБ,
	|	_РасчетНОБ.ДоходНеобр КАК ДоходНеобр,
	|	_РасчетНОБ.ВычетНеобр КАК ВычетНеобр,
	|	_РасчетНОБ.НОБНеобр КАК НОБНеобр,
	|	АВТОНОМЕРЗАПИСИ() КАК Индекс,
	|	_РасчетНОБ.Год КАК Год
	|ПОМЕСТИТЬ _РасчетНОБсИндексами
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		_РасчетыНДФЛ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|		_РасчетыНДФЛ.Ссылка КАК Ссылка,
	|		_РасчетыНДФЛ.ДатаРасчета КАК ДатаРасчета,
	|		_РасчетыНДФЛ.НДФЛНачисленный КАК НДФЛНачисленный,
	|		_НОБ.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|		ЕСТЬNULL(_НОБ.Доход, 0) КАК Доход,
	|		ЕСТЬNULL(_НОБ.Вычет, 0) КАК Вычет,
	|		ЕСТЬNULL(_НОБ.Доход, 0) - ЕСТЬNULL(_НОБ.Вычет, 0) КАК НОБ,
	|		ЕСТЬNULL(_НОБ.ДоходНеобр, 0) КАК ДоходНеобр,
	|		ЕСТЬNULL(_НОБ.ВычетНеобр, 0) КАК ВычетНеобр,
	|		ЕСТЬNULL(_НОБ.ДоходНеобр, 0) - ЕСТЬNULL(_НОБ.ВычетНеобр, 0) КАК НОБНеобр,
	|		ГОД(_РасчетыНДФЛ.ДатаРасчета) КАК Год
	|	ИЗ
	|		_РасчетыНДФЛ КАК _РасчетыНДФЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ _НОБ КАК _НОБ
	|			ПО _РасчетыНДФЛ.Ссылка = _НОБ.ДокументРасчет
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Год,
	|		СчетДоверительногоУправления,
	|		ДатаРасчета) КАК _РасчетНОБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Оплаты.Ссылка.Дата, ДЕНЬ) КАК ДатаОплатыФакт,
	|	Оплаты.Ссылка КАК ДокументОплата,
	|	Оплаты.Основание КАК ДокументНачисление,
	|	Начисления.Основание КАК ДокументРасчет,
	|	Оплаты.Сумма КАК Сумма
	|ПОМЕСТИТЬ _Оплаты
	|ИЗ
	|	Документ.Оплата.Основания КАК Оплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК Начисления
	|		ПО Оплаты.Основание = Начисления.Ссылка
	|ГДЕ
	|	Оплаты.Ссылка.Организация = &Организация
	|	И Оплаты.Ссылка.Проведен = ИСТИНА
	|	И Оплаты.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
	|	И Оплаты.Ссылка.Дата МЕЖДУ &ДатаНачалаРасчетов И &ДатаОкончания
	|	И Оплаты.Основание ССЫЛКА Документ.НачислениеЗадолженности
	|	И НЕ Оплаты.Основание В
	|				(ВЫБРАТЬ
	|					_Ушедшие.РасчетНДФЛ
	|				ИЗ
	|					_Ушедшие КАК _Ушедшие)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Оплаты.ДатаОплатыФакт КАК ДатаОплатыФакт,
	|	_Оплаты.ДокументОплата КАК ДокументОплата,
	|	_Оплаты.ДокументНачисление КАК ДокументНачисление,
	|	_Оплаты.ДокументРасчет КАК ДокументРасчет,
	|	_Оплаты.Сумма КАК Сумма
	|ПОМЕСТИТЬ _ОплатыПервые
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(_Оплаты.ДатаОплатыФакт) КАК ДатаОплатыФакт,
	|		_Оплаты.ДокументРасчет КАК ДокументРасчет
	|	ИЗ
	|		_Оплаты КАК _Оплаты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		_Оплаты.ДокументРасчет) КАК ПервыеОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Оплаты КАК _Оплаты
	|		ПО ПервыеОплаты.ДатаОплатыФакт = _Оплаты.ДатаОплатыФакт
	|			И ПервыеОплаты.ДокументРасчет = _Оплаты.ДокументРасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Оплаты.ДатаОплатыФакт КАК ДатаОплатыФакт,
	|	_Оплаты.ДокументОплата КАК ДокументОплата,
	|	_Оплаты.ДокументНачисление КАК ДокументНачисление,
	|	_Оплаты.ДокументРасчет КАК ДокументРасчет,
	|	_Оплаты.Сумма КАК Сумма
	|ПОМЕСТИТЬ _ОплатыПрочие
	|ИЗ
	|	_Оплаты КАК _Оплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатыПервые КАК _ОплатыПервые
	|		ПО _Оплаты.ДатаОплатыФакт = _ОплатыПервые.ДатаОплатыФакт
	|			И _Оплаты.ДокументОплата = _ОплатыПервые.ДокументОплата
	|			И _Оплаты.ДокументНачисление = _ОплатыПервые.ДокументНачисление
	|			И _Оплаты.ДокументРасчет = _ОплатыПервые.ДокументРасчет
	|ГДЕ
	|	_ОплатыПервые.ДатаОплатыФакт ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетНДФЛОснования.Ссылка КАК Ссылка,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(РасчетНДФЛОснования.Основание.Дата, ДЕНЬ)) КАК ОснованиеДата
	|ПОМЕСТИТЬ _Выводы
	|ИЗ
	|	Документ.РасчетНДФЛ.Основания КАК РасчетНДФЛОснования
	|ГДЕ
	|	РасчетНДФЛОснования.Ссылка.ДатаРасчета МЕЖДУ &ДатаНачалаРасчетов И &ДатаОкончанияРасчетов
	|	И РасчетНДФЛОснования.Ссылка.Организация = &Организация
	|	И НЕ РасчетНДФЛОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					_Ушедшие.РасчетНДФЛ
	|				ИЗ
	|					_Ушедшие КАК _Ушедшие)
	|	И РасчетНДФЛОснования.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетНДФЛОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПРЕДСТАВЛЕНИЕ(Настоящее.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления) КАК ВидДоговора,
	|	Настоящее.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	Настоящее.Ссылка КАК ДокументРасчет,
	|	Настоящее.ДатаРасчета КАК ДатаРасчета,
	|	Настоящее.НДФЛНачисленный КАК НДФЛНачисленный,
	|	Настоящее.Доход - ЕСТЬNULL(Прошлое.Доход, 0) КАК ДоходОтчет,
	|	Настоящее.Вычет - ЕСТЬNULL(Прошлое.Вычет, 0) КАК ВычетОтчет,
	|	Настоящее.НОБ - ЕСТЬNULL(Прошлое.НОБ, 0) КАК НОБОтчет,
	|	Настоящее.ДоходНеобр - ЕСТЬNULL(Прошлое.ДоходНеобр, 0) КАК ДоходОтчетНеобр,
	|	Настоящее.ВычетНеобр - ЕСТЬNULL(Прошлое.ВычетНеобр, 0) КАК ВычетОтчетНеобр,
	|	Настоящее.НОБНеобр - ЕСТЬNULL(Прошлое.НОБНеобр, 0) КАК НОБОтчетНеобр,
	|	_ОплатыПервые.ДокументНачисление КАК ДокументНачисление,
	|	_ОплатыПервые.ДокументОплата КАК ДокументОплата,
	|	_ОплатыПервые.Сумма КАК СуммаОплатыНалога,
	|	ЕСТЬNULL(_Выводы.ОснованиеДата, Настоящее.ДатаРасчета) КАК ДатаВыплатыДохода,
	|	_ОплатыПервые.ДатаОплатыФакт КАК ДатаОплатыФакт,
	|	ДОБАВИТЬКДАТЕ(Настоящее.ДатаРасчета, МЕСЯЦ, 1) КАК ДатаОплаты,
	|	Настоящее.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	Настоящее.Год КАК Год,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ИЗ
	|	_РасчетНОБсИндексами КАК Настоящее
	|		ЛЕВОЕ СОЕДИНЕНИЕ _РасчетНОБсИндексами КАК Прошлое
	|		ПО Настоящее.СчетДоверительногоУправления = Прошлое.СчетДоверительногоУправления
	|			И Настоящее.Год = Прошлое.Год
	|			И (Настоящее.Индекс - 1 = Прошлое.Индекс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатыПервые КАК _ОплатыПервые
	|		ПО Настоящее.Ссылка = _ОплатыПервые.ДокументРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Выводы КАК _Выводы
	|		ПО Настоящее.Ссылка = _Выводы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ПО Настоящее.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Настоящее.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления),
	|	Настоящее.СчетДоверительногоУправления,
	|	Настоящее.Ссылка,
	|	Настоящее.ДатаРасчета,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	_ОплатыПрочие.ДокументНачисление,
	|	_ОплатыПрочие.ДокументОплата,
	|	_ОплатыПрочие.Сумма,
	|	ЕСТЬNULL(_Выводы.ОснованиеДата, Настоящее.ДатаРасчета),
	|	_ОплатыПрочие.ДатаОплатыФакт,
	|	ДОБАВИТЬКДАТЕ(Настоящее.ДатаРасчета, МЕСЯЦ, 1),
	|	Настоящее.СтавкаНДФЛ,
	|	Настоящее.Год,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент
	|ИЗ
	|	_РасчетНОБсИндексами КАК Настоящее
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатыПрочие КАК _ОплатыПрочие
	|		ПО Настоящее.Ссылка = _ОплатыПрочие.ДокументРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Выводы КАК _Выводы
	|		ПО Настоящее.Ссылка = _Выводы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ПО Настоящее.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|ГДЕ
	|	НЕ _ОплатыПрочие.ДокументОплата ЕСТЬ NULL
	|ИТОГИ ПО
	|	СчетДоверительногоУправления,
	|	Год";
	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	//Запрос.УстановитьПараметр("ДатаНачалаРасчетов", НачалоКвартала(ДобавитьМесяц(Период.ДатаНачала, -1)));
	Запрос.УстановитьПараметр("ДатаНачалаРасчетов", НачалоГода(ДобавитьМесяц(Период.ДатаНачала, -1)));
	Запрос.УстановитьПараметр("ДатаОкончанияРасчетов", Период.ДатаОкончания+1);
	
	СписокДивиденды = Новый Массив;
	СписокДивиденды.Добавить(Справочники.ВидыДоходовНДФЛ.Код1010);
	СписокДивиденды.Добавить(Справочники.ВидыВычетовНДФЛ.Код601);
	
	Запрос.УстановитьПараметр("Дивиденды", СписокДивиденды);
	
	// так как не все так просто, нарастающий итог нужно вычислить по определнным правилам
	// НОБ не может быть отрицательным
	// Вычет не может быть больше дохода
	// Если НОБ отрицательный, в следующей записи надо это учесть
	// код не оптимальный, но зато понятный
	
	ВыборкаСчетДУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчетДУ.Следующий() Цикл 
		ВыборкаГод = ВыборкаСчетДУ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГод.Следующий() Цикл 
			Выборка = ВыборкаГод.Выбрать();
			
			Нераспределено = 0;  НераспределеноНеобр = 0;
			Пока Выборка.Следующий() Цикл 				
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НОБ = НоваяСтрока.НОБОтчет;
				//нераспределено - всегда отрицательнаая величина
				Если Нераспределено = 0 И НОБ <0 Тогда 
					НоваяСтрока.ВычетОтчет = НоваяСтрока.ДоходОтчет;
					НоваяСтрока.НОБОтчет = 0;
					Нераспределено = НОБ;				
				ИначеЕсли Нераспределено<0 И НОБ > 0 Тогда
					Если -Нераспределено < НОБ Тогда
						НоваяСтрока.ВычетОтчет = НоваяСтрока.ВычетОтчет - Нераспределено;
						НоваяСтрока.НОБОтчет = НоваяСтрока.НОБОтчет + Нераспределено;
						Нераспределено = 0;
					Иначе	
						НоваяСтрока.ВычетОтчет = НоваяСтрока.ДоходОтчет;
						НоваяСтрока.НОБОтчет = 0;
						Нераспределено = Нераспределено + НОБ;				
					КонецЕсли;	
				ИначеЕсли Нераспределено<0 И НОБ < 0 Тогда		
					НоваяСтрока.ВычетОтчет = НоваяСтрока.ДоходОтчет;
					НоваяСтрока.НОБОтчет = 0;
					Нераспределено = Нераспределено + НОБ;				
				КонецЕсли;	
				//и для необращаемых
				НОБНеобр = НоваяСтрока.НОБОтчетНеобр;
				Если НераспределеноНеобр = 0 И НОБНеобр <0 Тогда 
					НоваяСтрока.ВычетОтчетНеобр = НоваяСтрока.ДоходОтчетНеобр;
					НоваяСтрока.НОБОтчетНеобр = 0;
					НераспределеноНеобр = НОБНеобр;				
				ИначеЕсли НераспределеноНеобр<0 И НОБНеобр > 0 Тогда
					Если -НераспределеноНеобр < НОБНеобр Тогда
						НоваяСтрока.ВычетОтчетНеобр = НоваяСтрока.ВычетОтчетНеобр - НераспределеноНеобр;
						НоваяСтрока.НОБОтчетНеобр = НоваяСтрока.НОБОтчетНеобр + НераспределеноНеобр;
						НераспределеноНеобр = 0;
					Иначе	
						НоваяСтрока.ВычетОтчетНеобр = НоваяСтрока.ДоходОтчетНеобр;
						НоваяСтрока.НОБОтчетНеобр = 0;
						НераспределеноНеобр = НераспределеноНеобр + НОБНеобр;				
					КонецЕсли;	
				ИначеЕсли НераспределеноНеобр<0 И НОБНеобр < 0 Тогда		
					НоваяСтрока.ВычетОтчетНеобр = НоваяСтрока.ДоходОтчетНеобр;
					НоваяСтрока.НОБОтчетНеобр = 0;
					НераспределеноНеобр = НераспределеноНеобр + НОБНеобр;				
				КонецЕсли;		
				//эта процедура приводит к тому, что вычет не может быть больще дохода.
				//во второй части общий доход и вычет смело можно получить суммированием соотвествющих величин обращаемых и необращаемых
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
		
	Возврат Результат;
	
	
КонецФункции	

Функция Запрос2Часть(ИтоговаяТаблица)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИтоговаяТаблица", ИтоговаяТаблица);
	
	// _ИтоговаяТаблица - обработанная таблица из предыдущего запроса
	
	// _доходыПайщики, _НалогиПайщики, _Пайщики - НДФЛ пайщиков. 
	// Есть ряд нерешенных проблем, например, вычет для пайщиков. 
	// _Вывод - подготовим таблицу: 
	//   Ситуация 1 - Налог начислен в предыдущем квартале, оплачен в этом
	//   Ситуация 2 - Налог начислен и оплачен в текущем квартале
	//   Ситуация 3 - Налог начислен, но будет оплачен в следующем квартале
	//   Ситуация 0 - Налог начислен и уплачен в прошлые периоды. Нужно для того, чтобы клинтов считать с начала года 
	//   Объединяем ИтговуюТаблицу и Пайщиков
	//   _ВыводПроиндексированный - нужно для определния числа (_060) уникальных клиентов
	//   _УникальныеКлиенты - только те, которые втречаются в текущем квартале, прошлый не интересует.
	//   Результат = _ВыводПроиндексированный + _УникальныеКлиенты 
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) КАК ДатаДохода,
	|	ПРЕДСТАВЛЕНИЕ(ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления) КАК ВидДоговора,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход КАК СуммаДивидендов,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание,
	|	ЕСТЬNULL(КодыВоВнешнихСистемахСрезПоследних.Код, 0) КАК ИдСобытия,
	|	ЕСТЬNULL(ДивидендыПоАкциямСрезПоследних.Д1, 0) КАК Д1,
	|	ЕСТЬNULL(ДивидендыПоАкциямСрезПоследних.Д2, 0) КАК Д2,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _ОплатаДивидендов
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&ДатаНачалаДивиденды,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица))
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки))) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
	|				,
	|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.НРД)
	|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.КорпоративноеСобытиеПоВыплатеДивидендов)) КАК КодыВоВнешнихСистемахСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДивидендыПоАкциям.СрезПоследних КАК ДивидендыПоАкциямСрезПоследних
	|			ПО КодыВоВнешнихСистемахСрезПоследних.Код = ДивидендыПоАкциямСрезПоследних.ИдСобытияПоВыплатеДивидендов
	|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = КодыВоВнешнихСистемахСрезПоследних.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ПО ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|ГДЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) КАК ДатаОплаты,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход КАК СуммаНалог,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание
	|ПОМЕСТИТЬ _ОплатаНалога
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&ДатаНачалаДивиденды,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица))
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|ГДЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОплатаДивидендов.ДатаДохода КАК ДатаДохода,
	|	ОплатаНалога.ДатаОплаты КАК ДатаОплаты,
	|	ОплатаДивидендов.ВидДоговора КАК ВидДоговора,
	|	ОплатаДивидендов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ОплатаДивидендов.СуммаДивидендов КАК СуммаДивидендов,
	|	ОплатаНалога.СуммаНалог КАК СуммаНалог,
	|	ВЫБОР
	|		КОГДА ОплатаДивидендов.ИдСобытия <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ОплатаДивидендов.Д1 <> 0
	|						ТОГДА ВЫБОР
	|								КОГДА ОплатаДивидендов.Д2 < ОплатаДивидендов.Д1
	|									ТОГДА ВЫРАЗИТЬ(ОплатаДивидендов.СуммаДивидендов * ОплатаДивидендов.Д2 / ОплатаДивидендов.Д1 КАК ЧИСЛО(19, 2))
	|								ИНАЧЕ ОплатаДивидендов.СуммаДивидендов
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|	КОНЕЦ КАК Вычет,
	|	ОплатаДивидендов.Клиент КАК Клиент
	|ПОМЕСТИТЬ _Дивиденды
	|ИЗ
	|	_ОплатаДивидендов КАК ОплатаДивидендов
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатаНалога КАК ОплатаНалога
	|		ПО ОплатаДивидендов.Основание = ОплатаНалога.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговаяТаблица.ВидДоговора КАК ВидДоговора,
	|	ИтоговаяТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ИтоговаяТаблица.Клиент КАК Клиент,
	|	ИтоговаяТаблица.ДокументРасчет КАК ДокументРасчет,
	|	ИтоговаяТаблица.ДатаРасчета КАК ДатаРасчета,
	|	ИтоговаяТаблица.НДФЛНачисленный КАК НДФЛНачисленный,
	|	ИтоговаяТаблица.ДоходОтчет КАК ДоходОтчет,
	|	ИтоговаяТаблица.ВычетОтчет КАК ВычетОтчет,
	|	ИтоговаяТаблица.НОБОтчет КАК НОБОтчет,
	|	ИтоговаяТаблица.ДоходОтчетНеобр КАК ДоходОтчетНеобр,
	|	ИтоговаяТаблица.ВычетОтчетНеобр КАК ВычетОтчетНеобр,
	|	ИтоговаяТаблица.НОБОтчетНеобр КАК НОБОтчетНеобр,
	|	ИтоговаяТаблица.ДокументНачисление КАК ДокументНачисление,
	|	ИтоговаяТаблица.СуммаОплатыНалога КАК СуммаОплатыНалога,
	|	ИтоговаяТаблица.ДокументОплата КАК ДокументОплата,
	|	ИтоговаяТаблица.ДатаВыплатыДохода КАК ДатаВыплатыДохода,
	|	ИтоговаяТаблица.ДатаОплаты КАК ДатаОплаты,
	|	ИтоговаяТаблица.ДатаОплатыФакт КАК ДатаОплатыФакт,
	|	ИтоговаяТаблица.СтавкаНДФЛ КАК СтавкаНДФЛ
	|ПОМЕСТИТЬ _ИтоговаяТаблица
	|ИЗ
	|	&ИтоговаяТаблица КАК ИтоговаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОборотыДтКт.Регистратор.Заявка <> ЗНАЧЕНИЕ(Документ.Заявкапайщика.ПустаяСсылка)
	|			ТОГДА БухгалтерскийУчетОборотыДтКт.Регистратор.Заявка
	|		ИНАЧЕ БухгалтерскийУчетОборотыДтКт.Регистратор
	|	КОНЕЦ КАК РегистраторОснование,
	|	НАЧАЛОПЕРИОДА(БухгалтерскийУчетОборотыДтКт.Период, ДЕНЬ) КАК ДатаНачисленияДохода,
	|	БухгалтерскийУчетОборотыДтКт.Регистратор КАК Регистратор,
	|	БухгалтерскийУчетОборотыДтКт.СуммаОборот КАК СуммаДоход,
	|	ВЫБОР
	|		КОГДА ПогашениеПаев.Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
	|			ТОГДА ПогашениеПаев.Пайщик
	|		КОГДА ПогашениеПаев.Владелец.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
	|			ТОГДА ПогашениеПаев.Владелец
	|	КОНЕЦ КАК Клиент
	|ПОМЕСТИТЬ _ДоходыПайщики
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.ОборотыДтКт(&ДатаНачалаРасчетов, &ДатаОкончания, Регистратор, СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Основной.ЦелевоеФинансированиеИзБюджета), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами), , Организация = &Организация) КАК БухгалтерскийУчетОборотыДтКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
	|		ПО БухгалтерскийУчетОборотыДтКт.СубконтоДт1 = ЮрФизЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ПогашениеПаев
	|		ПО БухгалтерскийУчетОборотыДтКт.Регистратор = ПогашениеПаев.Ссылка
	|ГДЕ
	|	НЕ ВЫБОР
	|				КОГДА ПогашениеПаев.Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
	|					ТОГДА ПогашениеПаев.Пайщик
	|				КОГДА ПогашениеПаев.Владелец.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
	|					ТОГДА ПогашениеПаев.Владелец
	|			КОНЕЦ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухгалтерскийУчетОборотыДтКт.Регистратор.Основание КАК РегистраторОснование,
	|	НАЧАЛОПЕРИОДА(БухгалтерскийУчетОборотыДтКт.Период, ДЕНЬ) КАК ДатаВыплатыНалога,
	|	БухгалтерскийУчетОборотыДтКт.Регистратор КАК Регистратор,
	|	БухгалтерскийУчетОборотыДтКт.СуммаОборот КАК СуммаНалог,
	|	ЮрФизЛица.Ссылка КАК Клиент
	|ПОМЕСТИТЬ _НалогиПайщики
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.ОборотыДтКт(&ДатаНачалаРасчетов, &ДатаОкончания, Регистратор, , , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Основной.НДФЛ), , Организация = &Организация) КАК БухгалтерскийУчетОборотыДтКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
	|		ПО БухгалтерскийУчетОборотыДтКт.СубконтоДт1 = ЮрФизЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДоходыПайщики.Клиент КАК Клиент,
	|	СУММА(ЕСТЬNULL(_НалогиПайщики.СуммаНалог, 0)) КАК НДФЛНачисленный,
	|	СУММА(_ДоходыПайщики.СуммаДоход) КАК ДоходОтчет,
	|	0 КАК ВычетДоход,
	|	0 КАК НОБОтчет,
	|	_НалогиПайщики.ДатаВыплатыНалога КАК ДатаВыплатыДохода,
	|	ДОБАВИТЬКДАТЕ(_НалогиПайщики.ДатаВыплатыНалога, МЕСЯЦ, 1) КАК ДатаОплаты
	|ПОМЕСТИТЬ _Пайщики
	|ИЗ
	|	_ДоходыПайщики КАК _ДоходыПайщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НалогиПайщики КАК _НалогиПайщики
	|		ПО _ДоходыПайщики.РегистраторОснование = _НалогиПайщики.РегистраторОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	_ДоходыПайщики.Клиент,
	|	_ДоходыПайщики.ДатаНачисленияДохода,
	|	_НалогиПайщики.ДатаВыплатыНалога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""1. Доход получен в прошлом квартале, налог уплачен в текущем"" КАК Ситуация,
	|	_ИтоговаяТаблица.ВидДоговора КАК ВидДоговора,
	|	_ИтоговаяТаблица.Клиент КАК СчетДоверительногоУправления,
	|	0 КАК _020,
	|	0 КАК _025,
	|	0 КАК _030,
	|	0 КАК _040,
	|	0 КАК _045,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ДатаОплатыФакт < &ДатаНачала
	|			ТОГДА 0
	|		ИНАЧЕ _ИтоговаяТаблица.НДФЛНачисленный
	|	КОНЕЦ КАК _070,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода КАК _100,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.СуммаОплатыНалога > 0
	|			ТОГДА _ИтоговаяТаблица.ДатаОплатыФакт
	|		ИНАЧЕ _ИтоговаяТаблица.ДатаВыплатыДохода
	|	КОНЕЦ КАК _110,
	|	_ИтоговаяТаблица.ДатаОплаты КАК _120,
	|	_ИтоговаяТаблица.ДоходОтчет + _ИтоговаяТаблица.ДоходОтчетНеобр КАК _130,
	|	_ИтоговаяТаблица.СуммаОплатыНалога КАК _140,
	|	_ИтоговаяТаблица.СтавкаНДФЛ КАК _010,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода КАК ДатаВыплаты
	|ПОМЕСТИТЬ _Вывод
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	|ГДЕ
	|	_ИтоговаяТаблица.ДатаВыплатыДохода < &ДатаНачала
	|	И _ИтоговаяТаблица.ДатаОплаты >= &ДатаНачала
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2. Доход получен в текущем квартале, налог уплачен"",
	|	_ИтоговаяТаблица.ВидДоговора,
	|	_ИтоговаяТаблица.Клиент,
	|	_ИтоговаяТаблица.ДоходОтчет + _ИтоговаяТаблица.ДоходОтчетНеобр,
	|	0,
	|	_ИтоговаяТаблица.ВычетОтчет + _ИтоговаяТаблица.ВычетОтчетНеобр,
	|	_ИтоговаяТаблица.НДФЛНачисленный,
	|	0,
	|	_ИтоговаяТаблица.НДФЛНачисленный,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.СуммаОплатыНалога > 0
	|			ТОГДА _ИтоговаяТаблица.ДатаОплатыФакт
	|		ИНАЧЕ _ИтоговаяТаблица.ДатаВыплатыДохода
	|	КОНЕЦ,
	|	_ИтоговаяТаблица.ДатаОплаты,
	|	_ИтоговаяТаблица.ДоходОтчет + _ИтоговаяТаблица.ДоходОтчетНеобр,
	|	_ИтоговаяТаблица.СуммаОплатыНалога,
	|	_ИтоговаяТаблица.СтавкаНДФЛ,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	|ГДЕ
	|	_ИтоговаяТаблица.ДатаВыплатыДохода >= &ДатаНачала
	|	И _ИтоговаяТаблица.ДатаОплаты <= &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""3. Доход получен в текущем квартале, налог будет уплачен в следующем"",
	|	_ИтоговаяТаблица.ВидДоговора,
	|	_ИтоговаяТаблица.Клиент,
	|	_ИтоговаяТаблица.ДоходОтчет + _ИтоговаяТаблица.ДоходОтчетНеобр,
	|	0,
	|	_ИтоговаяТаблица.ВычетОтчет + _ИтоговаяТаблица.ВычетОтчетНеобр,
	|	_ИтоговаяТаблица.НДФЛНачисленный,
	|	0,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ДатаОплатыФакт = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА _ИтоговаяТаблица.ДатаОплатыФакт > &ДатаОкончания
	|			ТОГДА 0
	|		ИНАЧЕ _ИтоговаяТаблица.НДФЛНачисленный
	|	КОНЕЦ,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода,
	|	0,
	|	0,
	|	0,
	|	0,
	|	_ИтоговаяТаблица.СтавкаНДФЛ,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	|ГДЕ
	|	_ИтоговаяТаблица.ДатаВыплатыДохода >= &ДатаНачала
	|	И _ИтоговаяТаблица.ДатаОплаты > &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""0."",
	|	_ИтоговаяТаблица.ВидДоговора,
	|	_ИтоговаяТаблица.Клиент,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.СуммаОплатыНалога = 0
	|			ТОГДА _ИтоговаяТаблица.ДатаОплатыФакт
	|		ИНАЧЕ _ИтоговаяТаблица.ДатаВыплатыДохода
	|	КОНЕЦ,
	|	_ИтоговаяТаблица.ДатаОплаты,
	|	0,
	|	0,
	|	_ИтоговаяТаблица.СтавкаНДФЛ,
	|	_ИтоговаяТаблица.ДатаВыплатыДохода
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	|ГДЕ
	|	_ИтоговаяТаблица.ДатаВыплатыДохода < &ДатаНачала
	|	И _ИтоговаяТаблица.ДатаОплаты < &ДатаНачала
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""1. Доход получен в прошлом квартале, налог уплачен в текущем"",
	|	""Пайщики"",
	|	Пайщики.Клиент,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	Пайщики.ДатаВыплатыДохода,
	|	Пайщики.ДатаВыплатыДохода,
	|	Пайщики.ДатаОплаты,
	|	Пайщики.ДоходОтчет,
	|	Пайщики.НДФЛНачисленный,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	Пайщики.ДатаВыплатыДохода
	|ИЗ
	|	_Пайщики КАК Пайщики
	|ГДЕ
	|	Пайщики.ДатаВыплатыДохода < &ДатаНачала
	|	И Пайщики.ДатаОплаты >= &ДатаНачала
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2. Доход получен в текущем квартале, налог уплачен"",
	|	""Пайщики"",
	|	Пайщики.Клиент,
	|	Пайщики.ДоходОтчет,
	|	0,
	|	0,
	|	Пайщики.НДФЛНачисленный,
	|	0,
	|	Пайщики.НДФЛНачисленный,
	|	Пайщики.ДатаВыплатыДохода,
	|	Пайщики.ДатаВыплатыДохода,
	|	Пайщики.ДатаОплаты,
	|	Пайщики.ДоходОтчет,
	|	Пайщики.НДФЛНачисленный,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	Пайщики.ДатаВыплатыДохода
	|ИЗ
	|	_Пайщики КАК Пайщики
	|ГДЕ
	|	Пайщики.ДатаВыплатыДохода >= &ДатаНачала
	|	И Пайщики.ДатаОплаты <= &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""3. Доход получен в текущем квартале, налог будет уплачен в следующем"",
	|	""Пайщики"",
	|	Пайщики.Клиент,
	|	Пайщики.ДоходОтчет,
	|	0,
	|	0,
	|	Пайщики.НДФЛНачисленный,
	|	0,
	|	Пайщики.НДФЛНачисленный,
	|	Пайщики.ДатаВыплатыДохода,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	Пайщики.ДатаВыплатыДохода
	|ИЗ
	|	_Пайщики КАК Пайщики
	|ГДЕ
	|	Пайщики.ДатаВыплатыДохода >= &ДатаНачала
	|	И Пайщики.ДатаОплаты > &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""0."",
	|	""Пайщики"",
	|	Пайщики.Клиент,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	Пайщики.ДатаВыплатыДохода,
	|	Пайщики.ДатаВыплатыДохода,
	|	Пайщики.ДатаОплаты,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	Пайщики.ДатаВыплатыДохода
	|ИЗ
	|	_Пайщики КАК Пайщики
	|ГДЕ
	|	Пайщики.ДатаВыплатыДохода < &ДатаНачала
	|	И Пайщики.ДатаОплаты < &ДатаНачала
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""1. Доход получен в прошлом квартале, налог уплачен в текущем"",
	|	_Дивиденды.ВидДоговора,
	|	_Дивиденды.Клиент,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	_Дивиденды.ДатаДохода,
	|	_Дивиденды.ДатаОплаты,
	|	_Дивиденды.ДатаОплаты,
	|	_Дивиденды.СуммаДивидендов,
	|	_Дивиденды.СуммаНалог,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	_Дивиденды.ДатаДохода
	|ИЗ
	|	_Дивиденды КАК _Дивиденды
	|ГДЕ
	|	_Дивиденды.ДатаДохода < &ДатаНачала
	|	И _Дивиденды.ДатаОплаты >= &ДатаНачала
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2. Доход получен в текущем квартале, налог уплачен"",
	|	_Дивиденды.ВидДоговора,
	|	_Дивиденды.Клиент,
	|	_Дивиденды.СуммаДивидендов,
	|	_Дивиденды.СуммаДивидендов,
	|	_Дивиденды.Вычет,
	|	_Дивиденды.СуммаНалог,
	|	_Дивиденды.СуммаНалог,
	|	_Дивиденды.СуммаНалог,
	|	_Дивиденды.ДатаДохода,
	|	_Дивиденды.ДатаОплаты,
	|	_Дивиденды.ДатаОплаты,
	|	_Дивиденды.СуммаДивидендов,
	|	_Дивиденды.СуммаНалог,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	_Дивиденды.ДатаДохода
	|ИЗ
	|	_Дивиденды КАК _Дивиденды
	|ГДЕ
	|	_Дивиденды.ДатаДохода >= &ДатаНачала
	|	И _Дивиденды.ДатаОплаты <= &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""3. Доход получен в текущем квартале, налог будет уплачен в следующем"",
	|	_Дивиденды.ВидДоговора,
	|	_Дивиденды.Клиент,
	|	_Дивиденды.СуммаДивидендов,
	|	_Дивиденды.СуммаДивидендов,
	|	_Дивиденды.Вычет,
	|	_Дивиденды.СуммаНалог,
	|	_Дивиденды.СуммаНалог,
	|	0,
	|	_Дивиденды.ДатаДохода,
	|	_Дивиденды.ДатаОплаты,
	|	_Дивиденды.ДатаОплаты,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	_Дивиденды.ДатаДохода
	|ИЗ
	|	_Дивиденды КАК _Дивиденды
	|ГДЕ
	|	_Дивиденды.ДатаДохода >= &ДатаНачала
	|	И _Дивиденды.ДатаОплаты > &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""0."",
	|	_Дивиденды.ВидДоговора,
	|	_Дивиденды.Клиент,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	_Дивиденды.ДатаДохода,
	|	_Дивиденды.ДатаОплаты,
	|	_Дивиденды.ДатаОплаты,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13),
	|	_Дивиденды.ДатаДохода
	|ИЗ
	|	_Дивиденды КАК _Дивиденды
	|ГДЕ
	|	_Дивиденды.ДатаДохода < &ДатаНачала
	|	И _Дивиденды.ДатаОплаты < &ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Вывод.Ситуация КАК Ситуация,
	|	_Вывод.ВидДоговора КАК ВидДоговора,
	|	_Вывод.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_Вывод._020 КАК _020,
	|	_Вывод._030 КАК _030,
	|	_Вывод._040 КАК _040,
	|	_Вывод._070 КАК _070,
	|	_Вывод._100 КАК _100,
	|	_Вывод._110 КАК _110,
	|	_Вывод._120 КАК _120,
	|	_Вывод._130 КАК _130,
	|	_Вывод._140 КАК _140,
	|	_Вывод._010 КАК _010,
	|	_Вывод._025 КАК _025,
	|	_Вывод._045 КАК _045,
	|	_Вывод.ДатаВыплаты КАК ДатаВыплаты,
	|	АВТОНОМЕРЗАПИСИ() КАК Индекс
	|ПОМЕСТИТЬ _ВыводПроиндексированный
	|ИЗ
	|	_Вывод КАК _Вывод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВыводПроиндексированный.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	МИНИМУМ(_ВыводПроиндексированный.Индекс) КАК Индекс
	|ПОМЕСТИТЬ _УникальныеКлиенты
	|ИЗ
	|	_ВыводПроиндексированный КАК _ВыводПроиндексированный
	|ГДЕ
	|	_ВыводПроиндексированный._100 > НАЧАЛОПЕРИОДА(&ДатаНачала, ГОД)
	|
	|СГРУППИРОВАТЬ ПО
	|	_ВыводПроиндексированный.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВыводПроиндексированный.Ситуация КАК Ситуация,
	|	_ВыводПроиндексированный.ВидДоговора КАК ВидДоговора,
	|	_ВыводПроиндексированный.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ВыводПроиндексированный.ДатаВыплаты КАК ДатаВыплаты,
	|	_ВыводПроиндексированный._010 КАК _010,
	|	_ВыводПроиндексированный._020 КАК _020,
	|	_ВыводПроиндексированный._025 КАК _025,
	|	_ВыводПроиндексированный._030 КАК _030,
	|	_ВыводПроиндексированный._040 КАК _040,
	|	_ВыводПроиндексированный._045 КАК _045,
	|	ВЫБОР
	|		КОГДА _УникальныеКлиенты.Индекс ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА _ВыводПроиндексированный.Ситуация <> ""0.""
	|						И _ВыводПроиндексированный.Ситуация <> ""1. Доход получен в прошлом квартале, налог уплачен в текущем""
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК _060,
	|	_ВыводПроиндексированный._070 КАК _070,
	|	_ВыводПроиндексированный._100 КАК _100,
	|	_ВыводПроиндексированный._110 КАК _110,
	|	_ВыводПроиндексированный._120 КАК _120,
	|	_ВыводПроиндексированный._130 КАК _130,
	|	_ВыводПроиндексированный._140 КАК _140
	|ИЗ
	|	_ВыводПроиндексированный КАК _ВыводПроиндексированный
	|		ЛЕВОЕ СОЕДИНЕНИЕ _УникальныеКлиенты КАК _УникальныеКлиенты
	|		ПО _ВыводПроиндексированный.СчетДоверительногоУправления = _УникальныеКлиенты.СчетДоверительногоУправления
	|			И _ВыводПроиндексированный.Индекс = _УникальныеКлиенты.Индекс
	|ГДЕ
	|	_ВыводПроиндексированный.Ситуация <> ""0.""";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачалаРасчетов", НачалоКвартала(ДобавитьМесяц(Период.ДатаНачала, -1)));
	Запрос.УстановитьПараметр("ДатаНачалаДивиденды", НачалоКвартала(ДобавитьМесяц(Период.ДатаНачала, -1)));
	Запрос.УстановитьПараметр("ДатаОкончанияРасчетов", Период.ДатаОкончания+1);	
	
	ВидыДоговоров = Новый Массив();
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица);
	Запрос.УстановитьПараметр("ВидыДоговоровДоверительногоУправления", ВидыДоговоров);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции	

Функция  Сформировать()
	
	ИтоговаяТаблица = ЗапросФЛ();
	Результат = Запрос2Часть(ИтоговаяТаблица);
	
	Возврат Результат;	
	
КонецФункции