// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, "Уведомление о готовых к выгрузке платежных поручениях", "0.1", , Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомлениеОГотовыхКВыгрузкеПлатежныхПоручениях",	"Уведомление о готовых к выгрузке платежных поручениях (РЭМ)",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции 

Процедура ОтправитьУведомления(Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее.РасчетныйСчет.Банк КАК Банк,
		|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее КАК Ссылка,
		|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее.НомерПлатежногоПоручения КАК Номер,
		|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.СтатусыИсходящихПлатежныхПоручений.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ПлатежноеПоручениеИсходящее.Дата >= &НачалоДня) КАК СтатусыИсходящихПлатежныхПорученийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО (ЗначенияДополнительныхСведений.Объект = СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее.СчетДоверительногоУправления)
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ОтключитьВыгрузкуПлатежныхПорученийВЭДОВТБ"")
		|ГДЕ
		|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПлатежныхПоручений.Проверено)
		|	И (СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее.РасчетныйСчет.Банк <> &Банк_ГПБ
		|			ИЛИ ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, ЛОЖЬ) = ИСТИНА
		|			ИЛИ СтатусыИсходящихПлатежныхПорученийСрезПоследних.ПлатежноеПоручениеИсходящее.СчетДоверительногоУправления.СпециализированныйДепозитарий <> &Спецдеп_ВТБ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Банк,
		|	СчетДоверительногоУправления
		|ИТОГИ ПО
		|	Банк");
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);  			
	Запрос.УстановитьПараметр("Дата",			ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НачалоДня",		НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Спецдеп_ВТБ",	ОбщегоНазначения.ПолучитьИменованныйОбъект("СпецДепозитарий_ВТБ"));
	Запрос.УстановитьПараметр("Банк_ГПБ",		ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ГПБ"));
	
	ВыборкаБанка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаБанка.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Текст = "Платежные поручения готовы к выгрузке в клиент-банк" + Символы.ПС;
	
	Пока ВыборкаБанка.Следующий() Цикл
		
		Текст = Текст + "
			|" + СокрЛП(ВыборкаБанка.Банк) + ":
			|";
		
		ВыборкаДетальныеЗаписи = ВыборкаБанка.Выбрать();		
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Текст = Текст + СтрШаблон("	- %1, номер %2, сумма %3%4",
				ВыборкаДетальныеЗаписи.СчетДоверительногоУправления,
				ВыборкаДетальныеЗаписи.Номер,
				Формат(ВыборкаДетальныеЗаписи.Сумма, "ЧГ=3,0") + " руб.",
				Символы.ВК + Символы.ПС); 		
		КонецЦикла;
		
	КонецЦикла;
	
	РеквизитыОповещения = Новый Структура();
	РеквизитыОповещения.Вставить("Текст",							Текст);		
	РеквизитыОповещения.Вставить("Организация",						ЭтотОбъект.Организация);
			
	Справочники.Оповещения.СформироватьОповещения(ЭтотОбъект.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
КонецПроцедуры

#Область Работа_с_Регламентными_Заданиями

// Интерфейс для запуска обработки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	//Выполняем только в рабочие дни
	Если Не Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДата()) Тогда
		Возврат;
	КонецЕсли;
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "УведомлениеОГотовыхКВыгрузкеПлатежныхПоручениях") Тогда
				
		ЭтотОбъект.Организация	= ПараметрыКоманды.Организация;
				
#Область СборСтатистики_Начало

		Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
		
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
			ЭтотОбъект, 
			"Период,Организация", 
			Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));
		
		Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);

#КонецОбласти

		ОтправитьУведомления();

#Область СборСтатистики_Конец

		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

#КонецОбласти

	КонецЕсли;   	
	
КонецПроцедуры // ВыполнитьКоманду

#КонецОбласти

