&НаСервере
Функция СфомироватьДокументыСЭД(Организация, СчетДоверительногоУправления, Период, КаталогФайлов) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
		|	ФинансовыеПоказатели.Значение КАК Значение
		|ПОМЕСТИТЬ _Показатели
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО ФинансовыеПоказатели.СубъектАналитики = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	ФинансовыеПоказатели.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	И ФинансовыеПоказатели.Организация = &Организация
		|	И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|	И ФинансовыеПоказатели.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущихТрехЛет), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРВесьПериод))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	ДоходностьПФРПредыдущихТрехЛет.Значение КАК ДоходностьПФРПредыдущихТрехЛет,
		|	ДоходностьПФРТекущегоГода.Значение КАК ДоходностьПФРТекущегоГода,
		|	ДоходностьПФРПредыдущегоГода.Значение КАК ДоходностьПФРПредыдущегоГода,
		|	ДоходностьПФРВесьПериод.Значение КАК ДоходностьПФРВесьПериод,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеОрганизации,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИННОрганизации,
		|	ВложенныйЗапрос.КодПортфеля КАК КодПортфеля
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Показатели КАК ДоходностьПФРПредыдущихТрехЛет
		|		ПО (ДоходностьПФРПредыдущихТрехЛет.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			И (ДоходностьПФРПредыдущихТрехЛет.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущихТрехЛет))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Показатели КАК ДоходностьПФРТекущегоГода
		|		ПО (ДоходностьПФРТекущегоГода.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			И (ДоходностьПФРТекущегоГода.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Показатели КАК ДоходностьПФРПредыдущегоГода
		|		ПО (ДоходностьПФРПредыдущегоГода.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			И (ДоходностьПФРПредыдущегоГода.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Показатели КАК ДоходностьПФРВесьПериод
		|		ПО (ДоходностьПФРВесьПериод.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			И (ДоходностьПФРВесьПериод.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ДоходностьПФРВесьПериод))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО СчетаДоверительногоУправления.Организация.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо,
		|	(ВЫБРАТЬ
		|		ЗначенияДополнительныхСведений.Значение КАК КодПортфеля
		|	ИЗ
		|		РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|	ГДЕ
		|		ЗначенияДополнительныхСведений.Свойство.Ключ = ""ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.ИнвестСчет""
		|		И (ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления)) = &СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Период)";

	
	Запрос.УстановитьПараметр("Период", 					  Период);
	Запрос.УстановитьПараметр("Организация", 				  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ТекстОтчета = Новый ТекстовыйДокумент;

		Кавычки = """";
		ВремяXML = " 00:00:00";
		
		ТекстОтчета.ДобавитьСтроку("<?xml version=" + Кавычки + "1.0" + Кавычки + " encoding=" + Кавычки + "windows-1251" + Кавычки + " standalone=""yes""?>");
  		ТекстОтчета.ДобавитьСтроку("<EDO_ODKF923>");
  		ТекстОтчета.ДобавитьСтроку("<report_on_date>" + Формат(Период, "ДФ=dd.MM.yyyy") + ВремяXML + "</report_on_date>");
        ТекстОтчета.ДобавитьСтроку("<Quartal>" + СокрЛП(Месяц(Период) / 3) + "</Quartal>");
  		ТекстОтчета.ДобавитьСтроку("<Year>" + Формат(Период, "ДФ=yyyy") + "</Year>");
	  	ТекстОтчета.ДобавитьСтроку("<UKName>" + Выборка.ПолноеНаименованиеОрганизации + "</UKName>");
		ТекстОтчета.ДобавитьСтроку("<UKINN>" + Выборка.ИННОрганизации + "</UKINN>");
		ТекстОтчета.ДобавитьСтроку("<IDInvestcase>" + Выборка.КодПортфеля + "</IDInvestcase>");
		ТекстОтчета.ДобавитьСтроку("<DogovorNumber>" + Выборка.НомерДоговора + "</DogovorNumber>");
		ТекстОтчета.ДобавитьСтроку("<DogovorDate>" + Формат(Выборка.ДатаЗаключения, "ДФ=dd.MM.yyyy") + ВремяXML + "</DogovorDate>");
		ТекстОтчета.ДобавитьСтроку("<Profit1>" + Формат(Выборка.ДоходностьПФРТекущегоГода, "ЧРД=.; ЧГ=0") + "</Profit1>");
		ТекстОтчета.ДобавитьСтроку("<Profit2>" + Формат(Выборка.ДоходностьПФРПредыдущегоГода, "ЧРД=.; ЧГ=0") + "</Profit2>");
		ТекстОтчета.ДобавитьСтроку("<Profit3>" + Формат(Выборка.ДоходностьПФРПредыдущихТрехЛет, "ЧРД=.; ЧГ=0") + "</Profit3>");
		ТекстОтчета.ДобавитьСтроку("<MidProfit>" + Формат(Выборка.ДоходностьПФРВесьПериод, "ЧРД=.; ЧГ=0") + "</MidProfit>");
		ТекстОтчета.ДобавитьСтроку("</EDO_ODKF923>");
						
		// сформируем файл данных
		ПолноеИмяФайла = КаталогФайлов + ?(Прав(КаталогФайлов, 1) = "\", "", "\") + "F923_ПФР_" + Формат(Период, "ДФ=dd.MM.yyyy") + ".xml";
		
		Попытка
			ТекстОтчета.Записать(ПолноеИмяФайла, "windows-1251");		
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка выгрузки формы 923 по счету ДУ " + СокрЛП(СчетДоверительногоУправления) + " " + ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
			
КонецФункции