
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыОснований = Неопределено;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Проверка возможности использовать настройку для расчета планового ВУК
		
		Если Запись.ВидВознаграждения = Перечисления.ВидыВознагражденийУправляющего.ПлановоеВознаграждениеУправляющего Тогда
			НастройкуМожноИспользоватьДляПлановогоВознаграждения(Запись.НастройкаРасчета, Отказ);
		КонецЕсли;
		
		// Для ВУК ...
		
		Если Запись.ВидВознаграждения = Перечисления.ВидыВознагражденийУправляющего.ВознаграждениеУправляющего Тогда
			
			// ... должен быть заполнен шаблон расшифровки расчета
			
			Если Не ЗначениеЗаполнено(Запись.ШаблонРасшифровки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Шаблон расшифровки расчета""", , "ШаблонРасшифровки", "Запись", Отказ);
			КонецЕсли;
			
			// ... дата настроек должна совпадать с данными соглашения
			
			Если ЗначениеЗаполнено(Запись.Основание) Тогда
				
				Если РеквизитыОснований = Неопределено Тогда
					
					#Область Получение_дат_изменения_вознаграждений_из_оснований
					
					Запрос = Новый Запрос(
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	НаборЗаписей.Основание КАК Основание
						|ПОМЕСТИТЬ _НаборЗаписей
						|ИЗ
						|	&НаборЗаписей КАК НаборЗаписей
						|ГДЕ
						|	НаборЗаписей.ВидВознаграждения = ЗНАЧЕНИЕ(Перечисление.ВидыВознагражденийУправляющего.ВознаграждениеУправляющего)
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
						|	_НаборЗаписей.Основание КАК Основание,
						|	_НаборЗаписей.Основание.ДатаИзмененияВознаграждения КАК ДатаИзмененияВознаграждения
						|ИЗ
						|	_НаборЗаписей КАК _НаборЗаписей
						|ГДЕ
						|	_НаборЗаписей.Основание.ДатаИзмененияВознаграждения ЕСТЬ НЕ NULL");
					
					Запрос.УстановитьПараметр("НаборЗаписей", ЭтотОбъект);
					
					РеквизитыОснований = Запрос.Выполнить().Выгрузить();
					РеквизитыОснований.Индексы.Добавить("Основание");
					
					#КонецОбласти
					
				КонецЕсли;
				
				НайденныеСтроки		= РеквизитыОснований.НайтиСтроки(Новый Структура("Основание", Запись.Основание)); 
				РеквизитыОснования	= ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0], Неопределено); 
				
				Если РеквизитыОснования <> Неопределено И Запись.Период <> РеквизитыОснования.ДатаИзмененияВознаграждения Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата изменения вознаграждения, указанная в соглашении, должна совпадать с датой настроек", , "Основание", "Запись", Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Блокирующие проверки
	
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Подготовка данных к записи
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Очистим неиспользуемые поля
		
		Если Запись.ВидВознаграждения <> Перечисления.ВидыВознагражденийУправляющего.ВознаграждениеУправляющего Тогда
			
			Запись.ШаблонРасшифровки	= Неопределено;
			Запись.ШаблонАкта			= Неопределено;
			Запись.Основание			= Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НастройкуМожноИспользоватьДляПлановогоВознаграждения(НастройкаРасчета, Отказ)
	
	Если НастройкаРасчета.Составляющие.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка " + НастройкаРасчета + " не может быть использована для расчёта плановой доходности: количество составляющих больше одного.",,,, Отказ);
	КонецЕсли;
	
	БазыРасчета = РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего.БазыРасчетаПлановойДоходности();
	
	Для Каждого СтрокаСоставляющие Из НастройкаРасчета.Составляющие Цикл
		Если БазыРасчета.Найти(СтрокаСоставляющие.БазаРасчета) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для расчёта плановой доходности не может быть использована база расчёта: " + СтрокаСоставляющие.БазаРасчета,,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
