
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	            
	АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ПолучитьМакетНаСервере("ОтчетОПроведенииРасследования", АдресВХранилище);
	
	ШаблонОтчета = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ИмяФайлаШаблонаОтчета = ПолучитьИмяВременногоФайла("docx");
	ШаблонОтчета.Записать(ИмяФайлаШаблонаОтчета);
	
	УдалитьИзВременногоХранилища(АдресВХранилище);
	
	Видимость = Ложь;
	Отказ = Ложь;
	
	WordApp = Неопределено;
	
	СтатусНаРассмотрении = ПредопределенноеЗначение("Перечисление.СтатусыСлужебныхРасследований.НаРассмотрении");
	
	Если Не Отказ Тогда
		
		МассивОтчетов = ПолучитьМассивОтчетовДляПечати(ПараметрКоманды);
		
		Для каждого Отчет из МассивОтчетов Цикл
			
			Если Отчет.РеквизитыДокумента.Проведен И Отчет.РеквизитыДокумента.РезультатРасследования <> СтатусНаРассмотрении Тогда
				
				Если WordApp = Неопределено Тогда
				
					Попытка
						// создадим документ MS Word на основании сохраненного шаблона
						WordApp = Новый COMОбъект("Word.Application");
						WordApp.Application.Visible = Видимость;
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,, Отказ);	
						Прервать;
					КонецПопытки;
				
				КонецЕсли; 
				
				NewDoc = WordApp.Application.Documents.Add(ИмяФайлаШаблонаОтчета, Ложь, , Видимость);
				
				WordVars = NewDoc.Variables;
				Для Каждого РеквизитОтчета Из Отчет.РеквизитыДокумента Цикл
					WordVars.Item(РеквизитОтчета.Ключ).Value = Строка(РеквизитОтчета.Значение);
				КонецЦикла;
				
				NewDoc.Fields.Update();
				
			Иначе
				
				ТекстОшибки = СтрШаблон("Документ %1 не распечатан. Сначала необходимо завершить расследование и првоести документ.", Отчет.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			КонецЕсли; 
			
		КонецЦикла;
		
		Если Не WordApp = Неопределено Тогда
		
			WordApp.Application.Visible = Истина;
			WordApp.Application.Activate();	
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	Попытка
		УдалитьФайлы(ИмяФайлаШаблонаОтчета);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОтчетовДляПечати(ПараметрКоманды)
	Возврат Документы.СлужебноеРасследование.ПолучитьМассивОтчетовДляПечати(ПараметрКоманды);
КонецФункции

&НаСервере
Процедура ПолучитьМакетНаСервере(ИмяМакета, АдресВХранилище)
	
	ПоместитьВоВременноеХранилище(Документы.СлужебноеРасследование.ПолучитьМакет(ИмяМакета), АдресВХранилище);
	
КонецПроцедуры
