
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекРегистратор = "";
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// автоматическое дозаполнение полей
		Если      Запись.ЧастьСделкиРЕПО = 1 Тогда
			Запись.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО;
		ИначеЕсли Запись.ЧастьСделкиРЕПО = 2 Тогда
			Запись.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.СчетДоверительногоУправления) Тогда
			Запись.СчетДоверительногоУправления = Запись.СделкаРЕПО.СчетДоверительногоУправления;
		КонецЕсли;

		Если Запись.Период > Дата(2019,01,20) Тогда
			
			// проверка соответствия дат исполнения, оплаты и поставки
			ТекстСообщения = "";
					
			Если Не Запись.ОтложенноеИсполнение И Не (НачалоДня(?(Запись.ЧастьСделкиРЕПО = 1, Запись.Период, Запись.ДатаВторойЧастиРЕПО)) = Запись.ДатаИсполнения 			
				И Запись.ДатаИсполнения = Запись.ДатаОплаты И Запись.ДатаИсполнения = Запись.ДатаПоставки) Тогда
				ТекстСообщения = "При исполнении в момент сделки даты оплаты, поставки и исполнения должны совпадать с датой сделки!";
			КонецЕсли;	
			
			Если Запись.ОтложенноеИсполнение И Не Запись.РаздельноеИсполнение И Не (Запись.ДатаИсполнения <> '00010101'
				И Запись.ДатаОплаты = Запись.ДатаИсполнения И Запись.ДатаОплаты = Запись.ДатаИсполнения) Тогда
				ТекстСообщения = "При отложенном исполнении сделки дата исполнения, дата оплаты и дата поставки должны совпадать!";
			КонецЕсли;
			
			Если Запись.РаздельноеИсполнение И Не Запись.ОтложенноеИсполнение Тогда
				ТекстСообщения = "При установленном флажке 'Раздельное исполнение' также должен быть установлен флажок 'Отложенное исполнение'!";
			КонецЕсли;
			
			Если Запись.ОтложенноеИсполнение И Запись.РаздельноеИсполнение И Не (Запись.ДатаИсполнения = '00010101'
				И Запись.ДатаОплаты >= НачалоДня(Запись.Период) И Запись.ДатаПоставки >= НачалоДня(?(Запись.ЧастьСделкиРЕПО = 1, Запись.Период, Запись.ДатаВторойЧастиРЕПО))) Тогда
				ТекстСообщения = "При раздельном исполнении сделки дата исполнения должна быть пустой, а даты оплаты и поставки - не ранее даты сделки!";
			КонецЕсли;
			
			Если ТекстСообщения <> "" И ТекРегистратор <> Запись.Регистратор Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения + ?(Запись.Регистратор = Неопределено, "", " Документ " + СокрЛП(Запись.Регистратор)), Запись.Регистратор,,, Отказ);
				ТекРегистратор = Запись.Регистратор;
			КонецЕсли;
			
		КонецЕсли;
		
		Справочники.ДепозитарныеСчета.КонтрольВладельцаСчетаДепо(Запись.ДепозитарныйСчет, Запись.Организация, Отказ); 
		
	КонецЦикла;

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;

	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
КонецПроцедуры
