#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	// Подпись на обновление при изменении текущей организации происходит автоматически
	//	при наличии клиентской экспортной процедуры "ПриСменеТекущейОрганизации"
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	// Добавление возможности сохранения настроек формы
	АдресПриЗагрузкеДанныхИзНастроекНаСервере = Неопределено;
	Если Параметры.Свойство("АдресПриЗагрузкеДанныхИзНастроекНаСервере", АдресПриЗагрузкеДанныхИзНастроекНаСервере) Тогда
		ПоместитьВоВременноеХранилище(Истина, АдресПриЗагрузкеДанныхИзНастроекНаСервере);
	КонецЕсли;
	
	// Календарь торговых дней
	Попытка
		Объект.КалендарьТорговыхДней = Справочники.Календари.НайтиПоНаименованию("Котировки");
	Исключение
	КонецПопытки;
	Если Не ЗначениеЗаполнено(Объект.КалендарьТорговыхДней) Тогда
		Сообщить("Не найден календарь торговых дней (""Котировки"") в справочнике ""Календари"".");
	КонецЕсли;
	
	#Область ПоляПоУмолчанию
	// "Объект.Организации" по умолчанию
	Если Объект.Организации.Количество() = 0 Тогда
		// АО "РЕГИОН Траст"
		НоваяСтрока = Объект.Организации.Добавить();
		НоваяСтрока.Код = 220007;
		НоваяСтрока.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"); // РЕГИОН Траст
		// АО "РЕГИОН ЭсМ"
		НоваяСтрока = Объект.Организации.Добавить();
		НоваяСтрока.Код = 227027;
		НоваяСтрока.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"); // РЕГИОН ЭсМ
		// ООО УК "МД Траст"
		НоваяСтрока = Объект.Организации.Добавить();
		НоваяСтрока.Код = 232012;
		НоваяСтрока.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст"); // МД ТРАСТ
	КонецЕсли;
	// "Объект.ИспользуемаяБазаДанных" по умолчанию
	Если Не ЗначениеЗаполнено(Объект.ИспользуемаяБазаДанных)
		Или Элементы.ИспользуемаяБазаДанных.СписокВыбора.НайтиПоЗначению(Объект.ИспользуемаяБазаДанных) = Неопределено
	Тогда
		Если ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
			Объект.ИспользуемаяБазаДанных = "Рабочая";
		Иначе
			Объект.ИспользуемаяБазаДанных = "Тестовая";
		КонецЕсли;
	КонецЕсли;
	// "ВключатьАмортизируемыеОблигацииРыночногоVaR" по умолчанию
	ВключатьАмортизируемыеОблигацииРыночногоVaR = Ложь;
	// "ВидКлиентовРыночногоVaR" по умолчанию
	Если Не ЗначениеЗаполнено(ВидКлиентовРыночногоVaR)
		Или Элементы.ВидКлиентовРыночногоVaR.СписокВыбора.НайтиПоЗначению(ВидКлиентовРыночногоVaR) = Неопределено
	Тогда
		ВидКлиентовРыночногоVaR = "Индивидуальные";
	КонецЕсли;
	// "ИспользуемыеПоказатели" по умолчанию
	Если Не ЗначениеЗаполнено(ИспользуемыеПоказатели)
		Или Элементы.ИспользуемыеПоказатели.СписокВыбора.НайтиПоЗначению(ИспользуемыеПоказатели) = Неопределено
	Тогда
		ИспользуемыеПоказатели = "Учетные";
	КонецЕсли;
	// "ПоведениеРасчета" по умолчанию
	Если Не ЗначениеЗаполнено(ПоведениеРасчета)
		Или Элементы.ПоведениеРасчета.СписокВыбора.НайтиПоЗначению(ПоведениеРасчета) = Неопределено
	Тогда
		ПоведениеРасчета = "Быстрый";
	КонецЕсли;
	// "ПорядокКлиентов" по умолчанию
	Если Не ЗначениеЗаполнено(ПорядокКлиентов)
		Или Элементы.ПорядокКлиентов.СписокВыбора.НайтиПоЗначению(ПорядокКлиентов) = Неопределено
	Тогда
		ПорядокКлиентов = "Наименование";
	КонецЕсли;
	// "КоличествоИтерацийДляКредитногоVaR" по умолчанию
	Если Не ЗначениеЗаполнено(КоличествоИтерацийДляКредитногоVaR) Тогда
		КоличествоИтерацийДляКредитногоVaR = 10000;
	КонецЕсли;
	#КонецОбласти
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИдентификаторСессииПриИзменении(Неопределено);
	НестандартнаяДатаОкончанияКредитногоVaRПриИзменении(Неопределено);
	НестандартнаяДатаОкончанияСценарногоАнализаПриИзменении(Неопределено);
	КоличествоИтерацийДляКредитногоVaRРегулирование();
	ВключитьАмортизируемыеОблигацииПриИзменении(Неопределено);
	КомандаВидыКлиентовВыделитьВсе(Неопределено);
	ФильтрованныеКлиентыПослеИзмененияПометки();
	ПорядокКлиентовПриИзменении(Неопределено);
	
	// Обновление полей нужно производить после загрузки сохранённых настроек, чтобы не происходило повторного обновления параметров
	ИспользуемаяБазаДанныхПриИзмененииНаСервере(); // ДатаРасчетаПриИзмененииНаСервере() включена внутрь
	// Удаление лишнего переноса строки в начале информационного текста
	Объект.ИнформационныйТекст = СокрЛ(Объект.ИнформационныйТекст);
КонецПроцедуры

// В этой процедуре неверный формат простителен, т.к. может подтягиваться от старых версий обработки, поэтому ошибки загрузки надо обрабатывать.
//	После загрузки настроек обновление параметров формы происходит в процедуре "ПриОткрытии".
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	// При ошибке в этой процедуре кладётся весь клиент, поэтому нужно обработать
	Попытка
		Если Настройки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		ОшибкиЗагрузкиДанныхИзНастроек = Новый Соответствие; // Соответствие(Строка (Ключ), Строка (Описание))
		Маршрутизация = ПолучитьМаршрутизациюДанныхИзНастроек();
		Для Каждого СтрокаМаршрутизации Из Маршрутизация Цикл
			СохраненныйРеквизит = Настройки.Получить(СтрокаМаршрутизации.Ключ);
			// Проверка наличия сохранённого значения реквизита:
			//	Не нужно выводить ошибку, потому что реквизиты в новых версиях могут переименовываться.
			Если СохраненныйРеквизит = Неопределено Тогда
				//ОшибкиЗагрузкиДанныхИзНастроек.Вставить(СтрокаМаршрутизации.Реквизит, "Значение реквизита отсутствует в последнем сохранении.");
				Продолжить;
			КонецЕсли;
			// Проверка существования реквизита, для которого сохранено значение
			Попытка
				НачалоИменКолонок = СтрНайти(СтрокаМаршрутизации.Реквизит, "(");
				Если НачалоИменКолонок <> 0 Тогда
					Реквизит = Лев(СтрокаМаршрутизации.Реквизит, НачалоИменКолонок - 1);
					ТекущийРеквизит = СтрокаМаршрутизации.Объект[Реквизит];
				Иначе
					ТекущийРеквизит = СтрокаМаршрутизации.Объект[СтрокаМаршрутизации.Реквизит];
				КонецЕсли;
			Исключение
				ОшибкиЗагрузкиДанныхИзНастроек.Вставить(СтрокаМаршрутизации.Реквизит, "Реквизит, для которого сохранено значение, отсутствует или переименован.");
				Продолжить;
			КонецПопытки;
			// Проверка совместимости типов данных реквизита и его сохранённого значения
			Если ТипЗнч(ТекущийРеквизит) <> ТипЗнч(СохраненныйРеквизит) И ТипЗнч(ТекущийРеквизит) <> Тип("ДанныеФормыКоллекция") Тогда
				ОшибкиЗагрузкиДанныхИзНастроек.Вставить(СтрокаМаршрутизации.Реквизит,
					"Сохранённый реквизит имеет другой тип данных - """ + ТипЗнч(СохраненныйРеквизит) + """. Требуется тип """ + ТипЗнч(ТекущийРеквизит) + """.");
				Продолжить;
			КонецЕсли;
			// Установка значения реквизита
			Если ТипЗнч(ТекущийРеквизит) = Тип("ДанныеФормыКоллекция") Тогда
				Если СохраненныйРеквизит.Количество() > 0 Тогда
					ТекущийРеквизит.Очистить();
				КонецЕсли;
				Для Каждого СохраненнаяСтрокаКоллекции Из СохраненныйРеквизит Цикл
					НоваяСтрока = ТекущийРеквизит.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СохраненнаяСтрокаКоллекции);
				КонецЦикла;
			Иначе
				СтрокаМаршрутизации.Объект[СтрокаМаршрутизации.Реквизит] = СохраненныйРеквизит;
			КонецЕсли;
		КонецЦикла;
		Если ОшибкиЗагрузкиДанныхИзНастроек.Количество() > 0 Тогда
			ТекстУведомления = "Произошли следующий ошибки при загрузке данных из сохранённых настроек:" + Символы.ПС;
			Для Каждого ТекущаяОшибка Из ОшибкиЗагрузкиДанныхИзНастроек Цикл
				ТекстУведомления = ТекстУведомления + Символы.Таб + """" + ТекущаяОшибка.Ключ + """: " + ТекущаяОшибка.Значение + Символы.ПС;
			КонецЦикла;
			Сообщить(СокрП(ТекстУведомления));
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	// При ошибке в этой процедуре кладётся весь клиент, поэтому нужно обработать
	Попытка
		Маршрутизация = ПолучитьМаршрутизациюДанныхИзНастроек();
		Для Каждого СтрокаМаршрутизации Из Маршрутизация Цикл
			// Поиск реквизита по маршрутизации
			НачалоИменКолонок = СтрНайти(СтрокаМаршрутизации.Реквизит, "(");
			Если НачалоИменКолонок <> 0 Тогда
				Реквизит = Лев(СтрокаМаршрутизации.Реквизит, НачалоИменКолонок - 1);
				СохраняемыйРеквизит = СтрокаМаршрутизации.Объект[Реквизит];
			Иначе
				СохраняемыйРеквизит = СтрокаМаршрутизации.Объект[СтрокаМаршрутизации.Реквизит];
			КонецЕсли;
			// Сохранение значения реквизита
			Если ТипЗнч(СохраняемыйРеквизит) = Тип("ДанныеФормыКоллекция") Тогда
				КонецИменКолонок = СтрНайти(СтрокаМаршрутизации.Реквизит, ")");
				Если НачалоИменКолонок > 0 И КонецИменКолонок > НачалоИменКолонок Тогда
					Реквизит = Лев(СтрокаМаршрутизации.Реквизит, НачалоИменКолонок - 1);
					ИменаКолонок = Сред(СтрокаМаршрутизации.Реквизит, НачалоИменКолонок + 1, КонецИменКолонок - НачалоИменКолонок - 1);
				Иначе
					Сообщить("Неверно указана маршрутизация реквизита """ + СтрокаМаршрутизации.Ключ + """.");
					Продолжить;
				КонецЕсли;
				СохраняемыйМассив = Новый Массив; // Массив(Структура(...))
				Для Каждого СохраняемаяСтрокаКоллекции Из СохраняемыйРеквизит Цикл
					СохраняемаяСтруктура = Новый Структура(ИменаКолонок);
					ЗаполнитьЗначенияСвойств(СохраняемаяСтруктура, СохраняемаяСтрокаКоллекции);
					СохраняемыйМассив.Добавить(СохраняемаяСтруктура);
				КонецЦикла;
				Настройки.Вставить(СтрокаМаршрутизации.Ключ, СохраняемыйМассив);
			Иначе
				Настройки.Вставить(СтрокаМаршрутизации.Ключ, СохраняемыйРеквизит);
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользуемаяБазаДанныхПриИзменении(Элемент)
	ИспользуемаяБазаДанныхПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользуемаяБазаДанныхПриИзмененииНаСервере()
	// Окончание текущей сессии
	Объект.ИдентификаторСессии = 0;
	ИдентификаторСессииПриИзмененииНаСервере();
	
	// Изменение параметров соединения с SQL
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.УстановитьПараметрыСоединенияСSQL();
	
	// Старт новой сессии
	НачатьСессиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторСессииПриИзменении(Элемент)
	ЕстьИдентификаторСессии = Объект.ИдентификаторСессии <> 0;
	Элементы.ГруппаКнопкиРасчета.Доступность = ЕстьИдентификаторСессии;
	Элементы.ФильтрованныеКлиенты.Доступность = ЕстьИдентификаторСессии;
КонецПроцедуры

// Копия процедуры "ИдентификаторСессииПриИзменении" на сервере
&НаСервере
Процедура ИдентификаторСессииПриИзмененииНаСервере()
	ЕстьИдентификаторСессии = Объект.ИдентификаторСессии <> 0;
	Элементы.ГруппаКнопкиРасчета.Доступность = ЕстьИдентификаторСессии;
	Элементы.ФильтрованныеКлиенты.Доступность = ЕстьИдентификаторСессии;
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
	Если Объект.ИдентификаторСессии = 0 Тогда
		Возврат;
	КонецЕсли;
	ДатаРасчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаРасчетаПриИзмененииНаСервере()
	// Копия проверок из процедуры "ДатаРасчетаПриИзменении"
	Если Объект.ИдентификаторСессии = 0 Тогда
		Возврат;
	КонецЕсли;
	ШаблонЗаголовкаСпискаКлиентов = "Список клиентов на <ДатаРасчета>";
	Элементы.ФильтрованныеКлиенты.Заголовок = СтрЗаменить(ШаблонЗаголовкаСпискаКлиентов,
		"<ДатаРасчета>", Формат(Объект.ДатаРасчета, "ДФ=dd.MM.yyyy"));
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗагрузитьВидыКлиентов();
	ОбъектЗначение.ЗагрузитьКлиентов();
	ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
	ОбъектВидыКлиентовПриИзмененииСоставаНаСервере();
	ОбъектКлиентыПриИзмененииСоставаНаСервере();
	
	Элементы.ДекорацияСтандартнаяДатаОкончанияКредитногоVaR.Заголовок =
		СтрЗаменить("Дата окончания: <ДатаОкончания>", "<ДатаОкончания>", Формат(ДобавитьМесяц(Объект.ДатаРасчета, 12), "ДФ=dd.MM.yyyy"));
КонецПроцедуры

&НаКлиенте
Процедура НестандартнаяДатаОкончанияКредитногоVaRПриИзменении(Элемент)
	Элементы.ДатаОкончанияКредитногоVaR.Видимость = ИспользоватьНестандартнуюДатуОкончанияКредитногоVaR;
	Элементы.ДекорацияСтандартнаяДатаОкончанияКредитногоVaR.Видимость = Не ИспользоватьНестандартнуюДатуОкончанияКредитногоVaR;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоИтерацийДляКредитногоVaRРегулирование(Элемент = Неопределено, Направление = 0, СтандартнаяОбработка = Истина)
	СтандартнаяОбработка = Ложь;
	КоличествоИтерацийДляКредитногоVaR = КоличествоИтерацийДляКредитногоVaR + Направление * 1000;
	Если КоличествоИтерацийДляКредитногоVaR > Элементы.КоличествоИтерацийДляКредитногоVaR.МаксимальноеЗначение Тогда
		КоличествоИтерацийДляКредитногоVaR = Элементы.КоличествоИтерацийДляКредитногоVaR.МаксимальноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьАмортизируемыеОблигацииПриИзменении(Элемент)
	Элементы.ВключатьАмортизируемыеОблигацииСценарногоАнализа.Заголовок = ?(ВключатьАмортизируемыеОблигацииСценарногоАнализа,
		"Аморт. обл.", "Включать в расчёт амортизируемые облигации");
	Элементы.ВключатьАмортизируемыеОблигацииСценарногоАнализа.ПоложениеЗаголовка = ?(ВключатьАмортизируемыеОблигацииСценарногоАнализа,
		ПоложениеЗаголовкаЭлементаФормы.Лево, ПоложениеЗаголовкаЭлементаФормы.Право);
	Элементы.ИспользуемыеПоказатели.Видимость = ВключатьАмортизируемыеОблигацииСценарногоАнализа;
КонецПроцедуры

&НаКлиенте
Процедура НестандартнаяДатаОкончанияСценарногоАнализаПриИзменении(Элемент)
	Элементы.ДатаОкончанияСценарногоАнализа.Видимость = ИспользоватьНестандартнуюДатуОкончанияСценарногоАнализа;
	Элементы.ДекорацияСтандартнаяДатаОкончанияСценарногоАнализа.Видимость = Не ИспользоватьНестандартнуюДатуОкончанияСценарногоАнализа;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВидыКлиентовВыбраноПриИзменении(Элемент)
	// Применение фильтров на обновлённый список клиентов
	ВыбранныеВидыКлиентов = Новый Соответствие; // Соответствие(Строка (Вид клиента), Истина)
	Для Каждого СтрокаФильтрВидыКлиентов Из ФильтрВидыКлиентов Цикл
		Если СтрокаФильтрВидыКлиентов.Выбрано Тогда
			ВыбранныеВидыКлиентов.Вставить(СтрокаФильтрВидыКлиентов.Наименование, Истина);
		КонецЕсли;
	КонецЦикла;
	ФильтрованныеКлиенты.Очистить();
	Для Каждого ТекущийКлиент Из Объект.Клиенты Цикл
		Если ВыбранныеВидыКлиентов.Получить(ТекущийКлиент.Вид) <> Неопределено Тогда
			НоваяСтрока = ФильтрованныеКлиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийКлиент);
			НоваяСтрока.ИдентификаторОригинальнойСтроки = ТекущийКлиент.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	ПорядокКлиентовПриИзменении(Неопределено);
КонецПроцедуры

// Копия процедуры "ФильтрВидыКлиентовВыбраноПриИзменении" на сервере
&НаСервере
Процедура ФильтрВидыКлиентовВыбраноПриИзмененииНаСервере()
	// Применение фильтров на обновлённый список клиентов
	ВыбранныеВидыКлиентов = Новый Соответствие; // Соответствие(Строка (Вид клиента), Истина)
	Для Каждого СтрокаФильтрВидыКлиентов Из ФильтрВидыКлиентов Цикл
		Если СтрокаФильтрВидыКлиентов.Выбрано Тогда
			ВыбранныеВидыКлиентов.Вставить(СтрокаФильтрВидыКлиентов.Наименование, Истина);
		КонецЕсли;
	КонецЦикла;
	ФильтрованныеКлиенты.Очистить();
	Для Каждого ТекущийКлиент Из Объект.Клиенты Цикл
		Если ВыбранныеВидыКлиентов.Получить(ТекущийКлиент.Вид) <> Неопределено Тогда
			НоваяСтрока = ФильтрованныеКлиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийКлиент);
			НоваяСтрока.ИдентификаторОригинальнойСтроки = ТекущийКлиент.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	ПорядокКлиентовПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВидыКлиентовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВидыКлиентовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПорядокКлиентовПриИзменении(Элемент)
	Для Каждого СтрокаФильтрованныеКлиенты Из ФильтрованныеКлиенты Цикл
		Если ПорядокКлиентов = "Наименование" Тогда
			СтрокаФильтрованныеКлиенты.ГибридноеНаименование =
				СтрокаФильтрованныеКлиенты.Наименование + " (" + СтрокаФильтрованныеКлиенты.Код + ")";
		ИначеЕсли ПорядокКлиентов = "КодКлиента" Тогда
			СтрокаФильтрованныеКлиенты.ГибридноеНаименование =
				СтрокаФильтрованныеКлиенты.Код + " (" + СтрокаФильтрованныеКлиенты.Наименование + ")";
		КонецЕсли;
	КонецЦикла;
	ФильтрованныеКлиенты.Сортировать("ГибридноеНаименование");
КонецПроцедуры

// Копия процедуры "ПорядокКлиентовПриИзменении" на сервере
&НаСервере
Процедура ПорядокКлиентовПриИзмененииНаСервере()
	Для Каждого СтрокаФильтрованныеКлиенты Из ФильтрованныеКлиенты Цикл
		Если ПорядокКлиентов = "Наименование" Тогда
			СтрокаФильтрованныеКлиенты.ГибридноеНаименование =
				СтрокаФильтрованныеКлиенты.Наименование + " (" + СтрокаФильтрованныеКлиенты.Код + ")";
		ИначеЕсли ПорядокКлиентов = "КодКлиента" Тогда
			СтрокаФильтрованныеКлиенты.ГибридноеНаименование =
				СтрокаФильтрованныеКлиенты.Код + " (" + СтрокаФильтрованныеКлиенты.Наименование + ")";
		КонецЕсли;
	КонецЦикла;
	ФильтрованныеКлиенты.Сортировать("ГибридноеНаименование");
КонецПроцедуры

&НаКлиенте
Процедура ФильтрованныеКлиентыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрованныеКлиентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрованныеКлиентыВыбраноПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ФильтрованныеКлиенты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ФильтрованныеКлиентыПриИзмененииПометки(ТекущиеДанные);
	ФильтрованныеКлиентыПослеИзмененияПометки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОрганизации(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОрганизации");
	Попытка
		ВыполнитьКомандаОрганизации();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаОрганизации()
	ОписаниеОповещенияОЗакрытииДочернейФормы = Новый ОписаниеОповещения("ОгранизацииПриЗакрытии", ЭтаФорма);
	ПараметрыФормы = Новый Структура("Объект", Объект);
	ОткрытьФорму("ВнешняяОбработка._РасчетСценарногоАнализа.Форма.Организации",
		ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещенияОЗакрытииДочернейФормы);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗначенияСценарныхИндексов(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗначенияСценарныхИндексов");
	Попытка
		ВыполнитьКомандаЗначенияСценарныхИндексов();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаЗначенияСценарныхИндексов()
	ОписаниеОповещенияОЗакрытииДочернейФормы = Новый ОписаниеОповещения("ЗначенияСценарныхИндексовПриЗакрытии", ЭтаФорма);
	ПараметрыФормы = Новый Структура("Объект", Объект);
	ОткрытьФорму("ВнешняяОбработка._РасчетСценарногоАнализа.Форма.ЗначенияСценарныхИндексов",
		ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещенияОЗакрытииДочернейФормы);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПортфель(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗаполнитьПортфель");
	Попытка
		ВыполнитьКомандаЗаполнитьПортфель(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаЗаполнитьПортфель(ПараметрыСессии)
	КодыКлиентов = ПолучитьСтрокуКодовВыбранныхКлиентов();
	Если ПустаяСтрока(КодыКлиентов) Тогда
		ТекстОшибки = "Не выбрано ни одного клиента.";
		Предупреждение(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	ПринудительныйРасчет = (ПоведениеРасчета = "Принудительный");
	ОписаниеОшибки = "";
	КомандаЗаполнитьПортфельНаСервере(
		Объект.ДатаРасчета,
		КодыКлиентов,
		Объект.ИдентификаторСессии,
		ПринудительныйРасчет,
		ОписаниеОшибки);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Предупреждение(ОписаниеОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ПолучитьИВывестиИнформационныйТекст();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьПортфельНаСервере(ДатаРасчета, КодыКлиентов, ИдентификаторСессии, ПринудительныйРасчет, ОписаниеОшибки = "")
	Попытка
		// Описание процедуры P_Scenario_Fill_Portfolio:
		//	@AssetDate DATE,			-- Дата расчёта
		//	@ClientCodes NVARCHAR(MAX),	-- Коды клиентов (через запятую)
		//	@SessionID INT = 0,			-- Идентификатор сессии расчётов
		//	@ForceExecute BIT = 0		-- Нужно ли делать перерасчёт
		ВнешниеИсточникиДанных.RiskControl.P_Scenario_Fill_Portfolio(
			ДатаРасчета, КодыКлиентов, ИдентификаторСессии, ПринудительныйРасчет);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбъектЗначение = РеквизитФормыВЗначение("Объект");
		ОписаниеОшибки = ОбъектЗначение.ОчиститьОписаниеОшибкиSQL(ОписаниеОшибки);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьГрафикиДляОтчета(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаРассчитатьГрафикиДляОтчета");
	Попытка
		ВыполнитьКомандаРассчитатьГрафикиДляОтчета(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаРассчитатьГрафикиДляОтчета(ПараметрыСессии)
	КодыКлиентов = ПолучитьСтрокуКодовВыбранныхКлиентов();
	Если ПустаяСтрока(КодыКлиентов) Тогда
		ТекстОшибки = "Не выбрано ни одного клиента.";
		Предупреждение(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	ПринудительныйРасчет = (ПоведениеРасчета = "Принудительный");
	ОписаниеОшибки = "";
	КомандаРассчитатьГрафикиДляОтчетаНаСервере(
		Объект.ДатаРасчета,
		КодыКлиентов,
		Объект.ИдентификаторСессии,
		ПринудительныйРасчет,
		ОписаниеОшибки);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Предупреждение(ОписаниеОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ПолучитьИВывестиИнформационныйТекст();
КонецПроцедуры

&НаСервере
Процедура КомандаРассчитатьГрафикиДляОтчетаНаСервере(ДатаРасчета, КодыКлиентов, ИдентификаторСессии, ПринудительныйРасчет, ОписаниеОшибки = "")
	Попытка
		// Описание процедуры P_Scenario_Data_For_Report:
		//	@AssetDate DATE,			-- Дата расчёта
		//	@ClientCodes NVARCHAR(MAX),	-- Коды клиентов (через запятую)
		//	@SessionID INT = 0,			-- Идентификатор сессии расчётов
		//	@ForceExecute BIT = 0		-- Нужно ли делать перерасчёт
		ВнешниеИсточникиДанных.RiskControl.P_Scenario_Data_For_Report(
			ДатаРасчета, КодыКлиентов, ИдентификаторСессии, ПринудительныйРасчет);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбъектЗначение = РеквизитФормыВЗначение("Объект");
		ОписаниеОшибки = ОбъектЗначение.ОчиститьОписаниеОшибкиSQL(ОписаниеОшибки);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьКредитныйVaR(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаРассчитатьКредитныйVaR");
	Попытка
		ВыполнитьКомандаРассчитатьКредитныйVaR(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаРассчитатьКредитныйVaR(ПараметрыСессии)
	КодыКлиентов = ПолучитьСтрокуКодовВыбранныхКлиентов();
	Если ПустаяСтрока(КодыКлиентов) Тогда
		ТекстОшибки = "Не выбрано ни одного клиента.";
		Предупреждение(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	Если КоличествоИтерацийДляКредитногоVaR = 0 Тогда
		ТекстОшибки = "Количество итераций должно быть больше нуля.";
		Предупреждение(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	ПринудительныйРасчет = (ПоведениеРасчета = "Принудительный");
	ДатаОкончанияКредитногоVaRДляSQL = ?(ИспользоватьНестандартнуюДатуОкончанияКредитногоVaR, ДатаОкончанияКредитногоVaR, NULL);
	ОписаниеОшибки = "";
	КомандаРассчитатьКредитныйVaRНаСервере(
		Объект.ДатаРасчета,
		КодыКлиентов,
		ДатаОкончанияКредитногоVaRДляSQL,
		КоличествоИтерацийДляКредитногоVaR,
		Объект.ИдентификаторСессии,
		ПринудительныйРасчет,
		ОписаниеОшибки);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Предупреждение(ОписаниеОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ПолучитьИВывестиИнформационныйТекст();
КонецПроцедуры

&НаСервере
Процедура КомандаРассчитатьКредитныйVaRНаСервере(ДатаРасчета, КодыКлиентов, ДатаОкончания, КоличествоИтераций, ИдентификаторСессии, ПринудительныйРасчет, ОписаниеОшибки = "")
	Попытка
		// Описание процедуры P_Scenario_Credit_VaR:
		//	@AssetDate DATE,			-- Дата расчёта
		//	@ClientCodes NVARCHAR(MAX),	-- Коды клиентов (через запятую)
		//	@EndDate DATE = NULL,		-- Окончание периода расчёта (по умолчанию - через год после @AssetDate) (!!!: Пока что не используется)
		//	@NumberOfRolls INT = 10000,	-- Количество итераций симуляций для метода Монте-Карло
		//	@SessionID INT = 0,			-- Идентификатор сессии расчётов
		//	@ForceExecute BIT = 0		-- Нужно ли делать перерасчёт
		ВнешниеИсточникиДанных.RiskControl.P_Scenario_Credit_VaR(
			ДатаРасчета, КодыКлиентов, ДатаОкончания, КоличествоИтераций, ИдентификаторСессии, ПринудительныйРасчет);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбъектЗначение = РеквизитФормыВЗначение("Объект");
		ОписаниеОшибки = ОбъектЗначение.ОчиститьОписаниеОшибкиSQL(ОписаниеОшибки);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьРыночныйКраткосрочныйVaR(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаРассчитатьРыночныйКраткосрочныйVaR");
	Попытка
		ВыполнитьКомандаРассчитатьРыночныйКраткосрочныйVaR(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаРассчитатьРыночныйКраткосрочныйVaR(ПараметрыСессии)
	КодыКлиентов = NULL;
	ПоГруппамКлиентов = (ВидКлиентовРыночногоVaR = "ГруппыКлиентов");
	Если Не ПоГруппамКлиентов Тогда
		КодыКлиентов = ПолучитьСтрокуКодовВыбранныхКлиентов();
		Если ПустаяСтрока(КодыКлиентов) Тогда
			ТекстОшибки = "Не выбрано ни одного клиента.";
			Предупреждение(ТекстОшибки);
			ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	РыночныеЗначенияДляАмортизируемыхОблигаций = (ИспользуемыеПоказатели = "Рыночные");
	ПринудительныйРасчет = (ПоведениеРасчета = "Принудительный");
	ОписаниеОшибки = "";
	КомандаРассчитатьРыночныйКраткосрочныйVaRНаСервере(
		Объект.ДатаРасчета,
		КодыКлиентов,
		ВключатьАмортизируемыеОблигацииРыночногоVaR,
		ПоГруппамКлиентов,
		Объект.ИдентификаторСессии,
		ПринудительныйРасчет,
		ОписаниеОшибки);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Предупреждение(ОписаниеОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ПолучитьИВывестиИнформационныйТекст();
КонецПроцедуры

&НаСервере
Процедура КомандаРассчитатьРыночныйКраткосрочныйVaRНаСервере(ДатаРасчета, КодыКлиентов, ВключатьАмортизируемыеОблигации,
		ПоГруппамКлиентов, ИдентификаторСессии, ПринудительныйРасчет, ОписаниеОшибки = "")
	Попытка
		// Описание процедуры P_Scenario_Credit_VaR:
		//	@AssetDate DATE,						-- Дата расчёта
		//	@ClientCodes NVARCHAR(MAX),				-- Коды клиентов (через запятую)
		//	@IncludeHTMAndAmortBonds BIT	= 0,	-- Нужно ли включать облигации: до погашения (класс 3), и амортизируемые (класс 4)
		//	@MarketForHTMAndAmortBonds BIT	= 1,	-- Нужно ли использовать рыночные значения (сценарные индексы, доходности, дюрацию)
		//											--	вместо оценочных для облигаций: до погашения (класс 3), и амортизируемых (класс 4)
		//	@IsClientGroups BIT = 0,				-- Рассчитать субпортфели по группам клиентов вместо индивидуальных клиентов. Возможные значения:
		//											--		0 - Рассчитать субпортфели по обычным клиентам (по умолчанию)
		//											--		1 - Рассчитать субпортфели по группам клиентов
		//	@SessionID INT = 0,						-- Идентификатор сессии расчётов
		//	@ForceExecute BIT = 0					-- Нужно ли делать перерасчёт
		ВнешниеИсточникиДанных.RiskControl.P_Scenario_Market_VaR(
			ДатаРасчета, КодыКлиентов, ВключатьАмортизируемыеОблигации,
			Истина, ПоГруппамКлиентов, ИдентификаторСессии, ПринудительныйРасчет);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбъектЗначение = РеквизитФормыВЗначение("Объект");
		ОписаниеОшибки = ОбъектЗначение.ОчиститьОписаниеОшибкиSQL(ОписаниеОшибки);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьВалютныйVaR(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаРассчитатьВалютныйVaR");
	Попытка
		ВыполнитьКомандаРассчитатьВалютныйVaR(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаРассчитатьВалютныйVaR(ПараметрыСессии)
	ПринудительныйРасчет = (ПоведениеРасчета = "Принудительный");
	ОписаниеОшибки = "";
	КомандаРассчитатьВалютныйVaRНаСервере(
		Объект.ДатаРасчета,
		Объект.ИдентификаторСессии,
		ПринудительныйРасчет,
		ОписаниеОшибки);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Предупреждение(ОписаниеОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ПолучитьИВывестиИнформационныйТекст();
КонецПроцедуры

&НаСервере
Процедура КомандаРассчитатьВалютныйVaRНаСервере(ДатаРасчета, ИдентификаторСессии, ПринудительныйРасчет, ОписаниеОшибки = "")
	Попытка
		// Описание процедуры P_Scenario_Currency_VaR:
		//	@Date DATE,					-- Дата расчёта
		//	@CurrencyID INT = NULL,		-- Идентификатор валюты
		//	@SessionID INT = 0,			-- Идентификатор сессии расчётов
		//	@ForceExecute BIT = 0		-- Нужно ли делать перерасчёт
		ВнешниеИсточникиДанных.RiskControl.P_Scenario_Currency_VaR(
			ДатаРасчета, NULL, ИдентификаторСессии, ПринудительныйРасчет);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбъектЗначение = РеквизитФормыВЗначение("Объект");
		ОписаниеОшибки = ОбъектЗначение.ОчиститьОписаниеОшибкиSQL(ОписаниеОшибки);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПостроитьСценарныйАнализ(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПостроитьСценарныйАнализ");
	Попытка
		ВыполнитьКомандаПостроитьСценарныйАнализ(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаПостроитьСценарныйАнализ(ПараметрыСессии)
	КодыКлиентов = ПолучитьСтрокуКодовВыбранныхКлиентов();
	Если ПустаяСтрока(КодыКлиентов) Тогда
		ТекстОшибки = "Не выбрано ни одного клиента.";
		Предупреждение(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	Если КоличествоИтерацийДляКредитногоVaR = 0 Тогда
		ТекстОшибки = "Количество итераций должно быть больше нуля.";
		Предупреждение(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	РыночныеЗначенияДляАмортизируемыхОблигаций = (ИспользуемыеПоказатели = "Рыночные");
	ДатаОкончанияСценарногоАнализаДляSQL = ?(ИспользоватьНестандартнуюДатуОкончанияСценарногоАнализа, ДатаОкончанияСценарногоАнализа, NULL);
	ПринудительныйРасчет = (ПоведениеРасчета = "Принудительный");
	ОписаниеОшибки = "";
	КомандаПостроитьСценарныйАнализНаСервере(
		Объект.ДатаРасчета,
		Объект.НомерРасчета,
		КодыКлиентов,
		ДатаОкончанияСценарногоАнализаДляSQL,
		ВключатьАмортизируемыеОблигацииСценарногоАнализа,
		РыночныеЗначенияДляАмортизируемыхОблигаций,
		Объект.ИдентификаторСессии,
		ПринудительныйРасчет,
		ОписаниеОшибки);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Предупреждение(ОписаниеОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ПолучитьИВывестиИнформационныйТекст();
КонецПроцедуры

&НаСервере
Процедура КомандаПостроитьСценарныйАнализНаСервере(ДатаРасчета, НомерРасчета, КодыКлиентов, ДатаОкончания, ВключатьАмортизируемыеОблигации,
		РыночныеЗначенияДляАмортизируемыхОблигаций, ИдентификаторСессии, ПринудительныйРасчет, ОписаниеОшибки = "")
	Попытка
		// Описание процедуры P_Scenario_Full_Calculate:
		//	@AssetDate DATE,						-- Дата расчёта
		//	@CalcID INT,							-- Номер расчёта
		//	@ClientCodes NVARCHAR(MAX),				-- Коды клиентов (через запятую)
		//	@EndDate DATE					= NULL,	-- Дата окончания расчёта сценарного анализа
		//	@IncludeHTMAndAmortBonds BIT	= 1,	-- Нужно ли включать облигации: до погашения (класс 3), и амортизируемые (класс 4)
		//	@MarketForHTMAndAmortBonds BIT	= 0,	-- Нужно ли использовать рыночные значения (сценарные индексы, доходности, дюрацию)
		//											--	вместо оценочных для облигаций: до погашения (класс 3), и амортизируемых (класс 4)
		//	@SessionID INT = 0,						-- Идентификатор сессии расчётов
		//	@ForceExecute BIT = 0					-- Нужно ли делать перерасчёт
		ВнешниеИсточникиДанных.RiskControl.P_Scenario_Full_Calculate(
			ДатаРасчета, НомерРасчета, КодыКлиентов, ДатаОкончания, ВключатьАмортизируемыеОблигации,
			РыночныеЗначенияДляАмортизируемыхОблигаций, ИдентификаторСессии, ПринудительныйРасчет);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбъектЗначение = РеквизитФормыВЗначение("Объект");
		ОписаниеОшибки = ОбъектЗначение.ОчиститьОписаниеОшибкиSQL(ОписаниеОшибки);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидыКлиентовВыделитьВсе(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВидыКлиентовВыделитьВсе");
	Попытка
		ВыполнитьКомандаВидыКлиентовВыделитьВсе();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаВидыКлиентовВыделитьВсе()
	Для Каждого СтрокаФильтрВидыКлиентов Из ФильтрВидыКлиентов Цикл
		СтрокаФильтрВидыКлиентов.Выбрано = Истина;
	КонецЦикла;
	ФильтрВидыКлиентовВыбраноПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидыКлиентовУбратьВыделение(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВидыКлиентовУбратьВыделение");
	Попытка
		ВыполнитьКомандаВидыКлиентовУбратьВыделение();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаВидыКлиентовУбратьВыделение()
	Для Каждого СтрокаФильтрВидыКлиентов Из ФильтрВидыКлиентов Цикл
		СтрокаФильтрВидыКлиентов.Выбрано = Ложь;
	КонецЦикла;
	ФильтрВидыКлиентовВыбраноПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаФильтрованныеКлиентыВыделитьВсе(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаФильтрованныеКлиентыВыделитьВсе");
	Попытка
		ВыполнитьКомандаФильтрованныеКлиентыВыделитьВсе();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаФильтрованныеКлиентыВыделитьВсе()
	Для Каждого СтрокаФильтрованныеКлиенты Из ФильтрованныеКлиенты Цикл
		СтрокаФильтрованныеКлиенты.Выбрано = Истина;
		ФильтрованныеКлиентыПриИзмененииПометки(СтрокаФильтрованныеКлиенты);
	КонецЦикла;
	ФильтрованныеКлиентыПослеИзмененияПометки();
КонецПроцедуры

&НаКлиенте
Процедура КомандаФильтрованныеКлиентыУбратьВыделение(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаФильтрованныеКлиентыУбратьВыделение");
	Попытка
		ВыполнитьКомандаФильтрованныеКлиентыУбратьВыделение();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаФильтрованныеКлиентыУбратьВыделение()
	Для Каждого СтрокаФильтрованныеКлиенты Из ФильтрованныеКлиенты Цикл
		СтрокаФильтрованныеКлиенты.Выбрано = Ложь;
		ФильтрованныеКлиентыПриИзмененииПометки(СтрокаФильтрованныеКлиенты);
	КонецЦикла;
	ФильтрованныеКлиентыПослеИзмененияПометки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачатьСессиюНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.НачатьСессию();
	ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
	ИдентификаторСессииПриИзмененииНаСервере();
	ДобавитьИнформационныйТекстНаСервере("Начата новая сессия #" + Формат(Объект.ИдентификаторСессии, "ЧГ=") + " в "
		+ ?(Объект.ИспользуемаяБазаДанных = "Рабочая", "рабочей",
			?(Объект.ИспользуемаяБазаДанных = "Тестовая", "тестовой", "?")) + " базе.");
	ДатаРасчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьМаршрутизациюДанныхИзНастроек()
	// Маршрутизация загрузки данных из настроек:
	//	Для реквизитов-коллекций используются массивы структур, а после
	//	названия реквизита в скобках указываются сохраняемые колонки через запятую.
	Маршрутизация = Новый Массив; // Массив(Структура("Ключ": Строка, "Объект": Произвольный, "Реквизит": Строка))
	Ключи = "Ключ, Объект, Реквизит";
	Маршрутизация.Добавить(Новый Структура(Ключи, "ИспользуемаяБазаДанных", Объект, "ИспользуемаяБазаДанных"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "ДатаРасчета", Объект, "ДатаРасчета"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "НомерРасчета", Объект, "НомерРасчета"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "ПоведениеРасчета", ЭтаФорма, "ПоведениеРасчета"));
	// Кредитный VaR
	Маршрутизация.Добавить(Новый Структура(Ключи, "ИспользоватьНестандартнуюДатуОкончанияКредитногоVaR", ЭтаФорма, "ИспользоватьНестандартнуюДатуОкончанияКредитногоVaR"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "ДатаОкончанияКредитногоVaR", ЭтаФорма, "ДатаОкончанияКредитногоVaR"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "КоличествоИтерацийДляКредитногоVaR", ЭтаФорма, "КоличествоИтерацийДляКредитногоVaR"));
	// Рыночный VaR
	Маршрутизация.Добавить(Новый Структура(Ключи, "ВключатьАмортизируемыеОблигацииРыночногоVaR", ЭтаФорма, "ВключатьАмортизируемыеОблигацииРыночногоVaR"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "ВидКлиентовРыночногоVaR", ЭтаФорма, "ВидКлиентовРыночногоVaR"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "ВключатьАмортизируемыеОблигацииСценарногоАнализа", ЭтаФорма, "ВключатьАмортизируемыеОблигацииСценарногоАнализа"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "ИспользуемыеПоказатели", ЭтаФорма, "ИспользуемыеПоказатели"));
	// Сценарный VaR
	Маршрутизация.Добавить(Новый Структура(Ключи, "ИспользоватьНестандартнуюДатуОкончанияСценарногоАнализа", ЭтаФорма, "ИспользоватьНестандартнуюДатуОкончанияСценарногоАнализа"));
	Маршрутизация.Добавить(Новый Структура(Ключи, "ДатаОкончанияСценарногоАнализа", ЭтаФорма, "ДатаОкончанияСценарногоАнализа"));
	// Организации будут настраиваться хардкодом, чтобы не подтягивались старые настройки при изменении кодов организаций
	//Маршрутизация.Добавить(Новый Структура(Ключи, "Организации", Объект, "Организации(Код, Организация)"));
	Возврат Маршрутизация;
КонецФункции

&НаСервере
Процедура ПолучитьИВывестиИнформационныйТекст()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ПолучитьИВывестиИнформационныйТекст();
	ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИнформационныйТекст(ДобавляемыйТекст, НоваяСтрока = Истина)
	ТекущаяДатаСОформлением = "[" + Формат(ТекущаяДата(), "ДФ=HH:mm:ss") + "] ";
	Объект.ИнформационныйТекст = Объект.ИнформационныйТекст + ?(НоваяСтрока, Символы.ПС + ТекущаяДатаСОформлением, "")
		+ СтрЗаменить(ДобавляемыйТекст, Символы.ПС, Символы.ПС + Символы.Таб);
КонецПроцедуры

// Копия процедуры "ДобавитьИнформационныйТекст" на сервере
&НаСервере
Процедура ДобавитьИнформационныйТекстНаСервере(ДобавляемыйТекст, НоваяСтрока = Истина)
	ТекущаяДатаСОформлением = "[" + Формат(ТекущаяДата(), "ДФ=HH:mm:ss") + "] ";
	Объект.ИнформационныйТекст = Объект.ИнформационныйТекст + ?(НоваяСтрока, Символы.ПС + ТекущаяДатаСОформлением, "")
		+ СтрЗаменить(ДобавляемыйТекст, Символы.ПС, Символы.ПС + Символы.Таб);
КонецПроцедуры

// Т.к. фильтрованные клиенты не обязательно содержат весь текущий список клиентов,
//		то и пометки мы узнать не сможем, если список клиентов был обновлён.
//	При обновлении списка клиентов у объекта пометки автоматически переносятся.
//	Всё, что нам остаётся, - обновить список выбранных клиентов.
//
// Счётчик фильтрованных клиентов здесь не изменяется, - для этого есть обработчик "ФильтрованныеКлиентыПослеИзмененияПометки"
&НаСервере
Процедура ОбъектВидыКлиентовПриИзмененииСоставаНаСервере()
	// Перенос пометок со старых видов клиентов
	УникальныеВидыКлиентов = Новый Соответствие; // Соответствие(Строка (Вид клиента), Булево (Выбрано))
	Для Каждого СтрокаВидыКлиентов Из Объект.ВидыКлиентов Цикл
		УникальныеВидыКлиентов.Вставить(СтрокаВидыКлиентов.Наименование, Ложь);
	КонецЦикла;
	Для Каждого СтрокаФильтрВидыКлиентов Из ФильтрВидыКлиентов Цикл
		Если Не СтрокаФильтрВидыКлиентов.Выбрано Тогда
			Продолжить;
		КонецЕсли;
		Если УникальныеВидыКлиентов.Получить(СтрокаФильтрВидыКлиентов.Наименование) <> Неопределено Тогда
			УникальныеВидыКлиентов.Вставить(СтрокаФильтрВидыКлиентов.Наименование, Истина);
		КонецЕсли;
	КонецЦикла;
	
	// Добавление новых видов клиентов
	ФильтрВидыКлиентов.Очистить();
	Для Каждого КлючЗначение Из УникальныеВидыКлиентов Цикл
		НоваяСтрока = ФильтрВидыКлиентов.Добавить();
		НоваяСтрока.Наименование = КлючЗначение.Ключ;
		НоваяСтрока.Выбрано = КлючЗначение.Значение;
	КонецЦикла;
	ФильтрВидыКлиентов.Сортировать("Наименование");
	
	ФильтрВидыКлиентовВыбраноПриИзмененииНаСервере();
	ФильтрованныеКлиентыПослеИзмененияПометкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектКлиентыПриИзмененииСоставаНаСервере()
	// Расчёт количества клиентов по видам клиентов
	КоличествоКлиентовПоВидамКлиентов = Новый Соответствие; // Соответствие(Строка (Вид клиента), Число (Количество клиентов))
	Для Каждого СтрокаКлиенты Из Объект.Клиенты Цикл
		ТекущееЗначение = КоличествоКлиентовПоВидамКлиентов.Получить(СтрокаКлиенты.Вид);
		Если ТекущееЗначение = Неопределено Тогда
			КоличествоКлиентовПоВидамКлиентов.Вставить(СтрокаКлиенты.Вид, 1);
		Иначе
			КоличествоКлиентовПоВидамКлиентов.Вставить(СтрокаКлиенты.Вид, ТекущееЗначение + 1);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаФильтрВидыКлиентов из ФильтрВидыКлиентов Цикл
		НайденноеКоличество = КоличествоКлиентовПоВидамКлиентов.Получить(СтрокаФильтрВидыКлиентов.Наименование);
		Если НайденноеКоличество <> Неопределено Тогда
			СтрокаФильтрВидыКлиентов.КоличествоКлиентов = НайденноеКоличество;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуКодовВыбранныхКлиентов()
	КодыКлиентов = "";
	Для Каждого СтрокаКлиентов Из Объект.Клиенты Цикл
		Если Не СтрокаКлиентов.Выбрано Тогда
			Продолжить;
		КонецЕсли;
		КодыКлиентов = КодыКлиентов + ", " + СтрокаКлиентов.Код;
	КонецЦикла;
	Если СтрНачинаетсяС(КодыКлиентов, ", ") Тогда
		КодыКлиентов = Прав(КодыКлиентов, СтрДлина(КодыКлиентов) - 2);
	КонецЕсли;
	КодыКлиентов = СокрЛП(КодыКлиентов);
	Возврат КодыКлиентов;
КонецФункции

&НаКлиенте
Процедура ФильтрованныеКлиентыПриИзмененииПометки(СтрокаФильтрованныеКлиенты)
	Если СтрокаФильтрованныеКлиенты <> Неопределено Тогда
		СтрокаКлиенты = Объект.Клиенты.НайтиПоИдентификатору(СтрокаФильтрованныеКлиенты.ИдентификаторОригинальнойСтроки);
		СтрокаКлиенты.Выбрано = СтрокаФильтрованныеКлиенты.Выбрано;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрованныеКлиентыПослеИзмененияПометки()
	// Перерасчёт количества клиентов
	КоличествоКлиентов = 0;
	КоличествоВыбранныхКлиентов = 0;
	Для Каждого ТекущийКлиент Из Объект.Клиенты Цикл
		КоличествоКлиентов = КоличествоКлиентов + 1;
		Если ТекущийКлиент.Выбрано Тогда
			КоличествоВыбранныхКлиентов = КоличествоВыбранныхКлиентов + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Копия процедуры "ФильтрованныеКлиентыПослеИзмененияПометки" на сервере
&НаСервере
Процедура ФильтрованныеКлиентыПослеИзмененияПометкиНаСервере()
	// Перерасчёт количества клиентов
	КоличествоКлиентов = 0;
	КоличествоВыбранныхКлиентов = 0;
	Для Каждого ТекущийКлиент Из Объект.Клиенты Цикл
		КоличествоКлиентов = КоличествоКлиентов + 1;
		Если ТекущийКлиент.Выбрано Тогда
			КоличествоВыбранныхКлиентов = КоличествоВыбранныхКлиентов + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	ПриСменеТекущейОрганизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСменеТекущейОрганизацииНаСервере() Экспорт
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ДатаРасчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСценарныхИндексовПриЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	Если Не ЭтаФорма.Открыта() Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КопироватьДанныеФормы(Результат, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОгранизацииПриЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	Если Не ЭтаФорма.Открыта() Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КопироватьДанныеФормы(Результат, Объект);
	ПриСменеТекущейОрганизации();
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
 
 ОбъектОбработки = РеквизитФормыВЗначение("Объект");
 
 ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
 
 Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
 Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
  Механизм,
  ПараметрыВыполненияДляСбораСтатистики.Хранилище,
  ПараметрыВыполненияДляСбораСтатистики.Описание);
  
 ПараметрыСессии = Новый Структура;
 ПараметрыСессии.Вставить("Механизм",     Механизм);
 ПараметрыСессии.Вставить("Сессия",        Сессия);
 ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
 ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
  
 Возврат ПараметрыСессии;
 
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
 
 РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
  ПараметрыСессии.Механизм,
  ПараметрыСессии.Сессия,,
  ПараметрыСессии.ДопПараметры,
  ПараметрыСессии.ТекстОшибки);
 
КонецПроцедуры

#КонецОбласти
