// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Импорт рыночных рисков НКЦ",
		"0.03",
		"",
		Истина
	);
		
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ИмпортРыночныхРисковНКЦ", "Импорт рыночных рисков НКЦ",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	Если ИдентификаторКоманды = "ИмпортРыночныхРисковНКЦ" Тогда
		
		ЗаполнитьПериодИмпорта();
		ИмпортироватьРыночныеРискиНКЦ();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
	
	Если Метод = "ИмпортироватьРыночныеРискиНКЦ" Тогда
		
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(Метод);
		
		Попытка
			
		ЗаполнитьПериодИмпорта();
		
		КлючиЗапуска = Новый ТаблицаЗначений;

		КлючиЗапуска.Колонки.Добавить("ЦеннаяБумага",	Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
		КлючиЗапуска.Колонки.Добавить("Идентификатор",	Новый ОписаниеТипов("УникальныйИдентификатор"));
		
		// Фиксируем запуск.
		Для Каждого ТекЭкземпляр Из Экземпляры Цикл
			
			НовыйКлюч = КлючиЗапуска.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовыйКлюч, ТекЭкземпляр.Параметры);
			НовыйКлюч.Идентификатор = ТекЭкземпляр.Идентификатор;
			
		КонецЦикла;
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КлючиЗапуска.ЦеннаяБумага КАК ЦеннаяБумага,
			|	КлючиЗапуска.Идентификатор КАК Идентификатор
			|ПОМЕСТИТЬ _КлючиЗапуска
			|ИЗ
			|	&КлючиЗапуска КАК КлючиЗапуска
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КлючиЗапуска.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_КлючиЗапуска.Идентификатор КАК Идентификатор
			|ИЗ
			|	_КлючиЗапуска КАК _КлючиЗапуска
			|ИТОГИ ПО
			|	ЦеннаяБумага";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("КлючиЗапуска", КлючиЗапуска);
		
		Результат = Запрос.Выполнить();
		ВыборкаЦеннаяБумага = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЦеннаяБумага.Следующий() Цикл
			
			ЭтотОбъект.ЦенныеБумаги.Очистить();
			ЭтотОбъект.ЦенныеБумаги.Добавить(ВыборкаЦеннаяБумага.ЦеннаяБумага);
			
			ВыполнитьИмпортироватьРыночныеРискиНКЦ(ПараметрыСессии);
			
			ВыборкаИдентификатор = ВыборкаЦеннаяБумага.Выбрать();
			Пока ВыборкаИдентификатор.Следующий() Цикл
				РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(ВыборкаИдентификатор.Идентификатор);
			КонецЦикла; 
		
		КонецЦикла;
		
		Исключение
			ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ИмпортироватьРыночныеРискиНКЦ() Экспорт
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ИмпортироватьРыночныеРискиНКЦ");
	Попытка
		ВыполнитьИмпортироватьРыночныеРискиНКЦ(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

Процедура ВыполнитьИмпортироватьРыночныеРискиНКЦ(ПараметрыСессии) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN
		|ПОМЕСТИТЬ _КодыЦенныхБумаг
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|			,
		|			&ОтборПоОбъекту
		|				И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних";
	
	Если ЭтотОбъект.ЦенныеБумаги.Количество() = 0 Тогда
		ОтборПоОбъекту = Истина;
	ИначеЕсли ЭтотОбъект.ЦенныеБумаги.Количество() = 1 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоОбъекту", "Объект = &ОтборПоОбъекту");
		ОтборПоОбъекту = ЭтотОбъект.ЦенныеБумаги[0].Значение;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоОбъекту", "Объект В (&ОтборПоОбъекту)");
		ОтборПоОбъекту = ЭтотОбъект.ЦенныеБумаги.ВыгрузитьЗначения();
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтборПоОбъекту", ОтборПоОбъекту);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
	
	КодыЦенныхБумаг = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_КодыЦенныхБумаг", , "ISIN", , "ISIN").Выгрузить();
	МассивКодов = КодыЦенныхБумаг.ВыгрузитьКолонку("ISIN");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	dbo_RiskParameters.isin КАК ISIN,
		|	dbo_RiskParameters.tradedate КАК ДатаРасчетов,
		|	dbo_RiskParameters.range КАК Диапазон,
		|	dbo_RiskParameters.discount КАК Дисконт,
		|	dbo_RiskParameters.range_start КАК ДиапазонНачало,
		|	dbo_RiskParameters.range_end КАК ДиапазонОкончание
		|ИЗ
		|	ВнешнийИсточникДанных.Externals.Таблица.dbo_RiskParameters КАК dbo_RiskParameters
		|ГДЕ
		|	dbo_RiskParameters.isin В(&МассивКодов)
		|	И dbo_RiskParameters.tradedate МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	Запрос.УстановитьПараметр("ДатаНачала", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЭтотОбъект.Период.ДатаОкончания);
	
	Запрос.УстановитьПараметр("РискПараметры", Запрос.Выполнить().Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РискПараметры.ISIN КАК ISIN,
		|	РискПараметры.ДатаРасчетов КАК ДатаРасчетов,
		|	РискПараметры.Диапазон КАК Диапазон,
		|	РискПараметры.Дисконт КАК Дисконт,
		|	РискПараметры.ДиапазонНачало КАК ДиапазонНачало,
		|	РискПараметры.ДиапазонОкончание КАК ДиапазонОкончание
		|ПОМЕСТИТЬ _РискПараметры
		|ИЗ
		|	&РискПараметры КАК РискПараметры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_РискПараметры.ДатаРасчетов КАК ДатаРасчетов,
		|	_РискПараметры.Диапазон КАК Диапазон,
		|	_РискПараметры.Дисконт КАК Дисконт,
		|	_РискПараметры.ДиапазонНачало КАК ДиапазонНачало,
		|	ВЫБОР
		|		КОГДА _РискПараметры.ДиапазонОкончание = 0
		|			ТОГДА 9999999999999999999
		|		ИНАЧЕ _РискПараметры.ДиапазонОкончание - 1
		|	КОНЕЦ КАК ДиапазонОкончание
		|ИЗ
		|	_РискПараметры КАК _РискПараметры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыЦенныхБумаг КАК _КодыЦенныхБумаг
		|		ПО (_КодыЦенныхБумаг.ISIN = _РискПараметры.ISIN)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диапазон
		|ИТОГИ ПО
		|	ДатаРасчетов,
		|	ЦеннаяБумага
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДатаРасчетов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДатаРасчетов.Следующий() Цикл
	
		ВыборкаЦеннаяБумага = ВыборкаДатаРасчетов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЦеннаяБумага.Следующий() Цикл
		
			НаборЗаписей = РегистрыСведений.РыночныеРискиНКЦ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДатаРасчетов.Установить(ВыборкаЦеннаяБумага.ДатаРасчетов);
			НаборЗаписей.Отбор.ЦеннаяБумага.Установить(ВыборкаЦеннаяБумага.ЦеннаяБумага);
			
			Выборка = ВыборкаЦеннаяБумага.Выбрать();
			
			Пока Выборка.Следующий() Цикл
			
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
			КонецЦикла;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
		        ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;

		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПериодИмпорта() Экспорт 

	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	Календари = Справочники.Календари;
	ЭтоРабочийДень = Календари.ЭтоРабочийДень(Календари.Общероссийский, ТекущаяДата);
		
	ЭтотОбъект.Период.ДатаНачала = Календари.ДобавитьКДатеРабочиеДни(Календари.Общероссийский, ТекущаяДата, ?(ЭтоРабочийДень, -2, -1));
	ЭтотОбъект.Период.ДатаОкончания = ТекущаяДата;
	
КонецПроцедуры  

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки) Экспорт

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",      Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
