&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, "Запись", "ИсходныйКлючЗаписи", Отказ) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущую запись?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Запись.ЮридическоеЛицо);
		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры