
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВыводДенежныхСредств) Тогда
		
		Объект.Организация = Параметры.ВыводДенежныхСредств.Организация;
		Объект.ЮрФизЛицо   = Параметры.ВыводДенежныхСредств.Контрагент;
		Объект.Дата        = Параметры.ВыводДенежныхСредств.Дата;
		
		СформироватьРасчетНаСервере();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРасчетНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(ДокументРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРасчет(Команда)
	
	СформироватьРасчетНаСервере();
	
КонецПроцедуры

