
Процедура УстановитьПараметрыВыбораДоговора(Форма, ИмяРеквизитаКлиент) Экспорт

	Если Форма.Элементы.Найти("ДоговорыДоговор") <> Неопределено Тогда
		
		МассивСчетов = РаботаСДокументооборотом.ПолучитьМассивДоговоровКлиента(НачалоДня(Форма.Объект.Дата), Форма.Объект[ИмяРеквизитаКлиент], Форма.Объект.Организация);
		
		ПараметрыВыбораСчетаДУ = Новый Массив;
		ПараметрыВыбораСчетаДУ.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивСчетов)));
		
		Форма.Элементы.ДоговорыДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораСчетаДУ)
		
	КонецЕсли; 

КонецПроцедуры 

Процедура ЗаполнитьЗаголовокГруппыДоговоров(Форма) Экспорт
	
	Если Форма.Объект.Договоры.Количество() > 0 Тогда
		
		Если Форма.Объект.Договоры.Количество() = 1 Тогда
			ЗаголовокГруппы = "Относится к договору";
		Иначе
			ЗаголовокГруппы = "Относится к договорам";
		КонецЕсли; 
		
		Если Форма.Объект.Договоры.Количество() <= 10 Тогда
			МассивДоговоров = Новый Массив;
			Для каждого СтрокаДоговоры Из Форма.Объект.Договоры Цикл
				МассивДоговоров.Добавить("№" + СокрЛП(СтрокаДоговоры.Номер) + " от " + Формат(СтрокаДоговоры.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
			КонецЦикла; 
			ЗаголовокГруппы = ЗаголовокГруппы + ": " + СтрСоединить(МассивДоговоров, "; ");
		КонецЕсли; 
		
		Форма.Элементы.ГруппаСписокДоговоров.Заголовок = ЗаголовокГруппы;
		
	Иначе
		Форма.Элементы.ГруппаСписокДоговоров.Заголовок = "Указать договоры";
	КонецЕсли;

КонецПроцедуры