
Функция ПолучитьТекстЗапросаДляКонтроляКоличестваРегистраторов() Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Регистратор КАК Регистратор,
		|	НАЧАЛОПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодНачало,
		|	КОНЕЦПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодКонец,
		|	НаборЗаписей.СубъектАналитики КАК СубъектАналитики,
		|	НаборЗаписей.Организация КАК Организация
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|ГДЕ
		|	НаборЗаписей.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ФинансовыеПоказатели.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаборЗаписей КАК _НаборЗаписей
		|		ПО (ФинансовыеПоказатели.Период МЕЖДУ _НаборЗаписей.ПериодНачало И _НаборЗаписей.ПериодКонец)
		|			И ФинансовыеПоказатели.Организация = _НаборЗаписей.Организация
		|			И ФинансовыеПоказатели.СубъектАналитики = _НаборЗаписей.СубъектАналитики
		|ГДЕ
		|	ФинансовыеПоказатели.Активность
		|	И ФинансовыеПоказатели.Регистратор <> _НаборЗаписей.Регистратор";
	
	Возврат ТекстЗапроса

КонецФункции

Функция РасчетнаяСтоимостьПаяНаДату(Организация, СчетДоверительногоУправления, Дата) Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Период = &Период
		|	И ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики = &СубъектАналитики
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая)");
	
	Запрос.УстановитьПараметр("Период",				НачалоДня(Дата));
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("СубъектАналитики",	СчетДоверительногоУправления);
	 
	Выборка   = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для счета ДУ '%1' отсутствует расчетная стоимость пая на %2", СокрЛП(СчетДоверительногоУправления), Формат(Дата, "ДФ=dd.MM.yyyy")));
		Возврат Неопределено;
	КонецЕсли;
	        	
КонецФункции
