
&НаКлиенте
Процедура ОбъектыНедвижимостиКромеЗемельныхУчастковПриАктивизацииПоля(Элемент)
	ТД = Элементы.ОбъектыНедвижимостиКромеЗемельныхУчастков.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.ВидОбъектаНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТД.ОбъектНедвижимости, "ВидОбъектаНедвижимости");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗемельныеУчасткиПриАктивизацииПоля(Элемент)
	ТД = Элементы.ЗемельныеУчастки.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.ВидОбъектаНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТД.ОбъектНедвижимости, "ВидОбъектаНедвижимости");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбъектНедвижимостиНаСервере(ОбъектНедвижимости)
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ДобавитьОбъектНедвижимости(ОбъектНедвижимости);// Вставить содержимое обработчика.
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиКромеЗемельныхУчастковПриИзменении(Элемент)
	Если Элемент.Имя = "ОбъектыНедвижимостиКромеЗемельныхУчастковОбъектНедвижимости" Тогда
		ТД = Элементы.ОбъектыНедвижимостиКромеЗемельныхУчастков.ТекущиеДанные;
		Если ТД <> Неопределено Тогда
			Если ЗначениеЗаполнено(ТД.ОбъектНедвижимости) Тогда
				ДобавитьОбъектНедвижимостиНаСервере(ТД.ОбъектНедвижимости);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗемельныеУчасткиОбъектНедвижимостиПриИзменении(Элемент)
	Если Элемент.Имя = "ЗемельныеУчасткиОбъектНедвижимости"
		Тогда
		ТД = Элементы.ЗемельныеУчастки.ТекущиеДанные;
		Если ТД <> Неопределено Тогда
			Если ЗначениеЗаполнено(ТД.ОбъектНедвижимости) Тогда
				ДобавитьОбъектНедвижимостиНаСервере(ТД.ОбъектНедвижимости);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьСтрокиЗемельныхУчастков()
	Возврат Объект.ЗемельныеУчастки.Количество() > 0;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЕстьСтрокиЗемельныхУчастков() Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.ГруппаЗемельныеУчастки;
	Иначе
		ЭтотОбъект.ТекущийЭлемент = Элементы.ГруппаОбъектыНедвижимостиКромеЗемельныхУчастков;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыНедвижимостиНаСервере(ВидОбъектаНедвижимости_Имя)
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.Активность КАК Активность1,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.НазначениеОбъектаНедвижимости КАК НазначениеОбъектаНедвижимости,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.СтроительствоЗавершено КАК СтроительствоЗавершено,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.НаименованиеЕГРН КАК НаименованиеЕГРН,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.Адрес КАК Адрес,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.Характеристика КАК Характеристика,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.ВидПомещения КАК ВидПомещения,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.КодОКТМО КАК КодОКТМО,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.СтавкаНалогаНаИмущество КАК СтавкаНалогаНаИмущество,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.РасчетНалогаПоКадастровойСтоимости КАК РасчетНалогаПоКадастровойСтоимости
		|ИЗ
		|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|				&ДатаДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ПО (ОбъектыНедвижимости.Ссылка = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&ДатаДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО (РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|ГДЕ
		|	ОбъектыНедвижимости.ВидОбъектаНедвижимости = &ВидОбъектаНедвижимости
		|	И НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидОбъектаНедвижимости", Перечисления.ВидыОбъектовНедвижимости[ВидОбъектаНедвижимости_Имя]);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ОбъектыНедвижимостиКромеЗемельныхУчастков.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбъектыНедвижимости(Команда)
	ЗаполнитьОбъектыНедвижимостиНаСервере(Сред(Команда.Имя, 11));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗемельныеУчасткиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
		|	РеквизитыЗемельныхУчастковСрезПоследних.КатегорияЗемельногоУчастка КАК КатегорияЗемельногоУчастка,
		|	РеквизитыЗемельныхУчастковСрезПоследних.Адрес КАК Адрес,
		|	РеквизитыЗемельныхУчастковСрезПоследних.Площадь КАК Площадь,
		|	РеквизитыЗемельныхУчастковСрезПоследних.ВидРазрешенногоИспользованияЗемельногоУчастка КАК ВидРазрешенногоИспользованияЗемельногоУчастка,
		|	РеквизитыЗемельныхУчастковСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость
		|ИЗ
		|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|				&ДатаДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ПО (ОбъектыНедвижимости.Ссылка = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЗемельныхУчастков.СрезПоследних(
		|				&ДатаДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыЗемельныхУчастковСрезПоследних
		|		ПО (РеквизитыЗемельныхУчастковСрезПоследних.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|ГДЕ
		|	ОбъектыНедвижимости.ВидОбъектаНедвижимости = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток)
		|	И НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ЗемельныеУчастки.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗемельныеУчастки(Команда)
	ЗаполнитьЗемельныеУчасткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандыЗаполненияОбъектовНедвижимости()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОбъектыНедвижимости.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости
		|ИЗ
		|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|				&ДатаДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ПО (ОбъектыНедвижимости.Ссылка = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|ГДЕ
		|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|	И ОбъектыНедвижимости.ВидОбъектаНедвижимости <> ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток)
		|";

	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	
	КомандыКУдалению = Новый Массив;
	Для Каждого КомандаФормы Из ЭтаФорма.Команды Цикл
		Если СтрНайти(КомандаФормы.Имя, "Заполнить_") = 1 Тогда
			КомандыКУдалению.Добавить(КомандаФормы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КомандаФормы Из КомандыКУдалению Цикл
		Элементы.Удалить(Элементы.Найти(КомандаФормы.Имя));
		ЭтаФорма.Команды.Удалить(КомандаФормы);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КомандаФормы = ЭтаФорма.Команды.Добавить("Заполнить_" + Метаданные.Перечисления.ВидыОбъектовНедвижимости.ЗначенияПеречисления[Перечисления.ВидыОбъектовНедвижимости.Индекс(Выборка.ВидОбъектаНедвижимости)].Имя);
		КомандаФормы.Действие = "ЗаполнитьОбъектыНедвижимости";
		КомандаФормы.Заголовок = Выборка.ВидОбъектаНедвижимости;
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
		Элемент = Элементы.Добавить(КомандаФормы.Имя, Тип("КнопкаФормы"), Элементы.ОбъектыНедвижимостиЗаполнить);
		Элемент.ИмяКоманды = КомандаФормы.Имя;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	КомандыЗаполненияОбъектовНедвижимости();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	КомандыЗаполненияОбъектовНедвижимости();
КонецПроцедуры
