#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Отчет.Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета)
		И ЭтаФорма.НастройкиОтчета.Свойство("ВариантОтчета")
		И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор")
	Тогда
		ЭтаФорма.КлючТекущегоВарианта = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
	КонецЕсли;
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);
	НастроитьВидимостьИДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
		ЭтаФорма.ВариантМодифицирован = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ВыгрузитьПриИзменении(Элемент)
	Элементы.КаталогВыгрузки.Видимость = Выгрузить;
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог            = КаталогВыгрузки;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок          = "Выберите каталог";
	
	Если Диалог.Выбрать() Тогда
		КаталогВыгрузки = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(КаталогВыгрузки + "\");
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаСервере
Процедура КомандаСформироватьНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Результат = ОтчетОбъект.СформироватьОтчет(СписокСчетовДУ.ВыгрузитьЗначения(), Выгрузить, КаталогВыгрузки);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	Если СписокСчетовДУ.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны счета доверительного управления");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Элементы.Период.Видимость Тогда
		ТекстСообщения = "";
		
		Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Ложь);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Если Выгрузить Тогда
		РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(КаталогВыгрузки, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		КомандаСформироватьНаСервере();
	КонецЕсли;
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат);
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)
	Элементы = ЭтаФорма.Элементы;
	
	ИмяПредопределенного	= РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтаФорма.Отчет);
	ПредставлениеВарианта	= РаботаСОтчетамиКлиентСервер.ПолучитьПредставлениеВариантаОтчета(ЭтаФорма.Отчет);
	ОтчетНаДату				= Не (СтрНачинаетсяС(ИмяПредопределенного, "СКДСделки") ИЛИ СтрНачинаетсяС(ИмяПредопределенного, "СКДДвиженияДС"));
	
	Элементы.Период.Видимость				= Не ОтчетНаДату;
	Элементы.ПериодДатаОкончания.Видимость	= ОтчетНаДату;
	
	Если ЗначениеЗаполнено(ПредставлениеВарианта) Тогда
		ЭтаФорма.Заголовок = ПредставлениеВарианта;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


