
Функция СкомпоноватьСведенияОСтрокеБанковскойВыписки(СтрокаБанковскойВыписки, ВидДвижения, Сумма, ВидДвиженияДенежныхСредств = Неопределено) Экспорт
	
	Возврат
		Новый Структура("СтрокаБанковскойВыписки, ВидДвижения, Сумма, ВидДвиженияДенежныхСредств",
			СтрокаБанковскойВыписки,
			ВидДвижения,
			Сумма,
			ВидДвиженияДенежныхСредств);
	
КонецФункции // СкомпоноватьСведенияОСтрокеБанковскойВыписки

Процедура ЗарегистрироватьПлатеж(РеквизитыДвиженияДС, СведенияОСтрокеБанковскойВыписки) Экспорт
	
	НаборЗаписей = РегистрыСведений.РеестрПлатежей.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Регистратор.Установить(РеквизитыДвиженияДС.Ссылка);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если ТипЗнч(СведенияОСтрокеБанковскойВыписки) = Тип("Массив") Тогда
		Для каждого ЭлементСведенияОСтрокеБанковскойВыписки Из СведенияОСтрокеБанковскойВыписки Цикл
			Если ЗначениеЗаполнено(ЭлементСведенияОСтрокеБанковскойВыписки.СтрокаБанковскойВыписки) Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ДвижениеДенежныхСредств      = РеквизитыДвиженияДС.Ссылка;
				НоваяЗапись.Организация                  = РеквизитыДвиженияДС.Организация;
				НоваяЗапись.СчетДоверительногоУправления = РеквизитыДвиженияДС.СчетДоверительногоУправления;
				НоваяЗапись.ДатаПлатежа                  = РеквизитыДвиженияДС.Дата;
				НоваяЗапись.СтрокаБанковскойВыписки      = ЭлементСведенияОСтрокеБанковскойВыписки.СтрокаБанковскойВыписки;
				НоваяЗапись.Сумма                        = ЭлементСведенияОСтрокеБанковскойВыписки.Сумма;
				НоваяЗапись.ВидДвижения                  = ЭлементСведенияОСтрокеБанковскойВыписки.ВидДвижения;
				НоваяЗапись.ВидДвиженияДенежныхСредств   = ЭлементСведенияОСтрокеБанковскойВыписки.ВидДвиженияДенежныхСредств;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОСтрокеБанковскойВыписки.СтрокаБанковскойВыписки) Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДвижениеДенежныхСредств      = РеквизитыДвиженияДС.Ссылка;
		НоваяЗапись.Организация                  = РеквизитыДвиженияДС.Организация;
		НоваяЗапись.СчетДоверительногоУправления = РеквизитыДвиженияДС.СчетДоверительногоУправления;
		НоваяЗапись.ДатаПлатежа                  = РеквизитыДвиженияДС.Дата;
		НоваяЗапись.СтрокаБанковскойВыписки      = СведенияОСтрокеБанковскойВыписки.СтрокаБанковскойВыписки;
		НоваяЗапись.Сумма                        = СведенияОСтрокеБанковскойВыписки.Сумма;
		НоваяЗапись.ВидДвижения                  = СведенияОСтрокеБанковскойВыписки.ВидДвижения;
		НоваяЗапись.ВидДвиженияДенежныхСредств   = СведенияОСтрокеБанковскойВыписки.ВидДвиженияДенежныхСредств;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	//Если какие-либо выписки уже были акцептованы, то надо изменить время у только что связанных с ними документов движения денежных средств
	Для каждого ЭлементНабораЗаписей Из НаборЗаписей Цикл
		ДатаАкцептования = РаботаСДокументами.ПолучитьДатуАкцептования(ЭлементНабораЗаписей.СтрокаБанковскойВыписки);
		Если (ДатаАкцептования <> Неопределено) и ЗначениеЗаполнено(ЭлементНабораЗаписей.ДвижениеДенежныхСредств) Тогда
			РаботаСДокументами.ИзменитьВремяДокументаСУчетомАкцептования(ЭлементНабораЗаписей.ДвижениеДенежныхСредств, ДатаАкцептования);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗарегистрироватьПлатеж

// Проверяет соотвествует ли сумма документа итоговой сумме из реестра платежей
Функция РазнесеныВсеПлатежи(Документ) Экспорт
	ЭтоСсылкаНаДокумент = СтрНачинаетсяС(XMLТипЗнч(Документ).ИмяТипа, "DocumentRef");
	
	Если ЭтоСсылкаНаДокумент Тогда
		Регистратор = Документ;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.Оплата") Тогда
			Запрос = Новый Запрос("
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕСТЬNULL(СУММА(Основания.СуммаОплаты + Основания.СуммаОплатыКупона), 0) КАК СуммаОплатыИтого
				|ИЗ
				|	Документ.Оплата.Основания КАК Основания
				|ГДЕ
				|	Основания.Ссылка = &Ссылка
				|");
			Запрос.УстановитьПараметр("Ссылка", Документ);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			СуммаДокумента = ?(РезультатЗапроса.Пустой(), 0, РезультатЗапроса.Выгрузить()[0].СуммаОплатыИтого);
			
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента") Тогда
			СуммыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Сумма, СуммаПроцентов");
			СуммаДокумента = СуммыДокумента.Сумма + СуммыДокумента.СуммаПроцентов;
			
		Иначе
			СуммаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Сумма");
		КонецЕсли;
		
	// Это объект
	Иначе
		Регистратор = Документ.Ссылка;
		
		Если ТипЗнч(Документ) = Тип("ДокументОбъект.Оплата") Тогда
			СуммаДокумента = Документ.Основания.Итог("СуммаОплаты") + Документ.Основания.Итог("СуммаОплатыКупона");
			
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ЗакрытиеКредитногоИнструмента") Тогда
			СуммаДокумента = Документ.Сумма + Документ.СуммаПроцентов;

		Иначе
			СуммаДокумента = Документ.Сумма;
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РеестрПлатежей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПереводДенежныхСредств") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда
		СуммаПриход = 0;
		СуммаРасход = 0;
		
		Для Каждого Платеж Из НаборЗаписей Цикл
			Если Платеж.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
				СуммаПриход = СуммаПриход + Платеж.Сумма;
			Иначе
				СуммаРасход = СуммаРасход + Платеж.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоСсылкаНаДокумент Тогда
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Брокер, БрокерПолучатель, МестоХранения, МестоХраненияПолучатель");
		Иначе
			РеквизитыДокумента = Документ;
		КонецЕсли;
		
		Брокер					= РеквизитыДокумента.Брокер;
		БрокерПолучатель		= РеквизитыДокумента.БрокерПолучатель;
		МестоХранения			= РеквизитыДокумента.МестоХранения;
		МестоХраненияПолучатель	= РеквизитыДокумента.МестоХраненияПолучатель;
		
		// При переводе на Биржу или Брокеру сверяем только расходную сумму,
		// при переводе с Биржи или от Брокера - только приходную
		
		РезультатФункции = 
			(ЗначениеЗаполнено(Брокер) ИЛИ МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК ИЛИ СуммаДокумента = СуммаРасход)
				И (ЗначениеЗаполнено(БрокерПолучатель) ИЛИ МестоХраненияПолучатель = Справочники.МестаХранения.ММВБ_ДепозитыСЦК ИЛИ СуммаДокумента = СуммаПриход);
	Иначе
		СуммаПлатежей = НаборЗаписей.Итог("Сумма");
	    РезультатФункции = (СуммаДокумента = СуммаПлатежей);
	КонецЕсли;
	
	Возврат РезультатФункции; 
КонецФункции

// Возвращает список регистраторов указанной выписки в реестре платежей
Функция НайтиВРеестреПлатежей(СтрокаБанковскойВыписки) Экспорт
	
	СписокРегистраторов = Новый СписокЗначений;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеестрПлатежей.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеестрПлатежей.Регистратор) КАК Представление
		|ИЗ
		|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|ГДЕ
		|	РеестрПлатежей.СтрокаБанковскойВыписки = &СтрокаБанковскойВыписки
		|	И РеестрПлатежей.Активность");
	
	Запрос.УстановитьПараметр("СтрокаБанковскойВыписки", СтрокаБанковскойВыписки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		СписокРегистраторов.Добавить(ВыборкаЗапроса.Регистратор, ВыборкаЗапроса.Представление);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СписокРегистраторов;

КонецФункции
