
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ПроверитьЗаполнение() Тогда
	
		Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	   
		Параметры.УстановитьЗначениеПараметра("НачалоПериода",                ЭтотОбъект.Период.ДатаНачала);
		Параметры.УстановитьЗначениеПараметра("КонецПериода",                 ЭтотОбъект.Период.ДатаОкончания);
		Параметры.УстановитьЗначениеПараметра("Организация",                  ЭтотОбъект.Организация);
		Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Параметры.УстановитьЗначениеПараметра("ЦеннаяБумага",                 ЭтотОбъект.ЦеннаяБумага);
		
		// Выполняем программную компоновку
		РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ЭтотОбъект.Период, Истина, Истина, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ); 	
	КонецЕсли;

КонецПроцедуры
