Перем мБиржаММВБ;
Перем мТипыЗаписейВОтчетеОРасхождениях_НетРасхождений;
Перем мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись;
Перем мТипыЗаписейВОтчетеОРасхождениях_ЗаписьУдалена;
Перем мТипыЗаписейВОтчетеОРасхождениях_ЗаписьИзменена;

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьРежимыТорговПоУмолчанию() Экспорт
	
	// ИсключаемыеРежимыТоргов
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "AUCT"); // Аукцион
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PACT"); // Аукцион: адресные заявки
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FSRP"); // Аукцион обр.РЕПО с ЦК 1 день
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FKRP"); // Аукцион с ЦК 1 день
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FKSW"); // Аукцион с ЦК 2 недели
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FROW"); // Аукцион РЕПО с ЦК 1 неделя
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FRSW"); // Аукцион РЕПО с ЦК 2 недели
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "SMAL"); // "Неполные лоты" = "Т+ Неполные лоты"
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "AUBB"); // Выкуп: Аукцион
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSBB"); // Выкуп: Адресные заявки
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSBE"); // Выкуп: Адресные заявки EUR
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSBU"); // Выкуп: Адресные заявки USD
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSBY"); // Выкуп: Адресные заявки CNY
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSAU"); // Размещение: Адресные заявки
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PAUS"); // Размещение:Адресные заявки USD
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PAEU"); // Размещение:Адресные заявки EUR
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PAGB"); // Размещение:Адресные заявки GBP
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PACY"); // Размещение:Адресные заявки CNY
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "TQDP"); // Крупные пакеты - Акции
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "TQDB"); // Крупные пакеты - Облигации
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQDP"); // Крупные пакеты
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "TQDP"); // Крупные пакеты-Облигации(ОФЗ)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQRP"); // РЕПО с ЦК 1 день
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQRD"); // РЕПО с ЦК 1 день (расч. в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQRE"); // РЕПО с ЦК 1 день (расч. в EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQRY"); // РЕПО с ЦК 1 день (расч. в CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQWD"); // РЕПО с ЦК 7 дн. (расч. в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQWE"); // РЕПО с ЦК 7 дн. (расч. в EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQWY"); // РЕПО с ЦК 7 дн. (расч. в CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQWP"); // РЕПО с ЦК 7 дн.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQMP"); // РЕПО с ЦК 1 мес.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQMD"); // РЕПО с ЦК 1 мес. (расч. в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQMY"); // РЕПО с ЦК 1 мес. (расч. в CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQTP"); // РЕПО с ЦК 3 мес.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "EQTY"); // РЕПО с ЦК 3 мес. (расч. в CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSRP"); // РЕПО с ЦК адресное
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSRD"); // РЕПО с ЦК адр. (расч. в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSRE"); // РЕПО с ЦК адр. (расч. в EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSRY"); // РЕПО с ЦК адр. (расч. в CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GCOM"); // РЕПО с ЦК с КСУ 1 месяц
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GCOW"); // РЕПО с ЦК с КСУ 7 дн.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GCRP"); // РЕПО с ЦК с КСУ 1 день.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GCSM"); // РЕПО с ЦК с КСУ 2 месяца
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GCSW"); // РЕПО с ЦК с КСУ 14 дн.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GCTM"); // РЕПО с ЦК с КСУ 3 месяца
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GCUM"); // РЕПО с ЦК с КСУ 6 мес.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSGC"); // РЕПО с ЦК с КСУ адресное
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FBFX"); // РЕПО с ЦБ РФ: фикс.ставка
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FFFX"); // РЕПО с ЦБ РФ: плавающая ставка
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FBCB"); // РЕПО с ЦБ РФ: Аукцион РЕПО
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FFCB"); // РЕПО с ЦБ РФ: Аукц.плав.ставки
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "LIQR"); // РЕПО с ЦК: Урегулирование
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "RPEO"); // РЕПО в ин. валюте: EUR
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "RPEU"); // РЕПО c облигациями в ин.валюте
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "RPMA"); // РЕПО c акциями и РДР
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "RPMO"); // РЕПО c облигациями
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "RPUO"); // РЕПО c облигациями(расч.в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "RPEY"); // РЕПО-М в ин. валюте (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "RPUA"); // РЕПО c акциями(расч.в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSDE"); // Акции Д - РПС
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSDB"); // Облигации Д - РПС
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "OTCB"); // Анонимный РПС
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "OTCU"); // Анонимный РПС (USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FBCU"); // USD РЕПО с ЦБ РФ: Аукцион РЕПО
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSEQ"); // РПС:А1-Акции, паи и РДР
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSES"); // РПС:А2-Акции и паи
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSOB"); // РПС:А1-Облигации
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSNL"); // РПС:Б-Акции и паи
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSNO"); // РПС:Б-Облигации
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSOV"); // РПС:В-Облигации
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSNE"); // РПС:Акции и паи внесписочные
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSEO"); // РПС:Облигации (расч.в EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSYO"); // РПС:Облигации (расч.в CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSNB"); // РПС:Облигации внесписочные
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSEU"); // РПС:Еврооблигации
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FSEQ"); // РПС: Ин.Акции
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSIF"); // РПС: Паи
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSTF"); // РПС: ETF
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSTD"); // РПС: ETF (расч. в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTOB"); // РПС с ЦК:А1-Облигации
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTEQ"); // РПС с ЦК:А1-Акции, паи и РДР
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTDE"); // РПС с ЦК:Акции Д
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FTEQ"); // РПС с ЦК: Ин.Акции и ДР
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTSD"); // РПС с ЦК: Ин.Акции и ДР (USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTIF"); // РПС с ЦК: Паи
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTOD"); // РПС с ЦК: Облигации (расч.USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTOE"); // РПС с ЦК: Облигации (расч.EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTOY"); // РПС с ЦК: Облигации (расч.CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTTF"); // РПС с ЦК: ETF
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTTE"); // РПС с ЦК: ETF (расч. в EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PSQI"); // Квал.Инвесторы-РПС
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PTQI"); // Квал.Инвесторы-РПС с ЦК
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "TQQI"); // КвалИнвесторы Т+
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "SPOB"); // Исполнение обязательств по СК
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "SPEQ"); // Исполнение обязательств по СК
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "LIQB"); // продажа обеспечения бирж.рынок
	
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FCTM"); // РЕПО с ЦК с КСУ пл. 3 мес.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "FATM"); // РЕПО с ЦК с КСУ пл КлСт 3 мес.
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GYRP"); // РЕПО с ЦК с КСУ 1 день (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GYOW"); // РЕПО с ЦК с КСУ 7 дней (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GYSW"); // РЕПО с ЦК с КСУ 14 дн. (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GYOM"); // РЕПО с ЦК с КСУ 1 мес. (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GYSM"); // РЕПО с ЦК с КСУ 2 мес. (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GYTM"); // РЕПО с ЦК с КСУ 3 мес. (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GYOY"); // РЕПО с ЦК с КСУ 1 год. (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "PYGC"); // РЕПО с ЦК с КСУ адресное (CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GBRP"); // РЕПО с ЦК с КСУ 1 день (BYN)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ИсключаемыеРежимыТоргов, "GKRP"); // РЕПО с ЦК с КСУ 1 день (KZT)

	// ДополнительныеРежимыТоргов
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "FRRP"); // Аукцион РЕПО с ЦК 1 день
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "FRFW"); // Аукцион РЕПО с ЦК 5 недель
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "TQBD"); // Т+ Ин.Акции и ДР (USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "TQIR"); // Т+ Облигации ПИР
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "SMAL"); // Т+ Неполные лоты (акции)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "TQOD"); // Т+ Облигации (расч.в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "TQOE"); // Т+ Облигации (расч.в EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "TQOY"); // Т+ Облигации (расч.в CNY)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "TQUD"); // Т+ Облигации Д (расч. в USD)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "TQTE"); // Т+ ETF (расч. в EUR)
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "EQEU"); // Еврооблигации
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "PSPI"); // РПС Акции ПИР
	ДобавитьКодРежимаТорговВТаблицу(ЭтотОбъект.ДополнительныеРежимыТоргов, "PTPI"); // РПС с ЦК Акции ПИР

КонецПроцедуры

Процедура ИмпортироватьКотировки(Отчет = Неопределено) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период, РежимИмпорта, ЦеннаяБумага, СкрыватьВОтчетеНовыеКотировки");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ИмпортироватьКотировки";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		 ЭтотОбъект.ДополнительныеСвойства.Ошибки.Очистить();
	КонецЕсли;
	 
	Если ЭтотОбъект.ИсключаемыеРежимыТоргов.Количество() = 0 Тогда // а при интерактивной работе они уже будут заполнены
		ЗаполнитьРежимыТорговПоУмолчанию();
	КонецЕсли;
	
	КодыФинансовыхИнструментов = ПолучитьКодыФинансовыхИнструментовНаММБВ();
	
	// Загрузка котировок из Матриха
	КотировкиТорговыхПлощадок = ПолучитьКотировкиММВБИзMatrix(КодыФинансовыхИнструментов);
	Если КотировкиТорговыхПлощадок = Неопределено Тогда
		ОповеститьОбОшибках();
		Возврат;
	КонецЕсли;
	
	// Рассчитаем котировки ценных бумаг
	КотировкиЦенныхБумаг = РассчитатьКотировкиЦенныхБумаг(КотировкиТорговыхПлощадок, КодыФинансовыхИнструментов);
	Если КотировкиЦенныхБумаг = Неопределено Тогда
		ОповеститьОбОшибках();
		Возврат;
	КонецЕсли;
	
	// Загрузка купонов выходного дня из Externals
	КупоныВыходногоДня = РассчитатьКупоныВыходногоДня(КодыФинансовыхИнструментов);
	Если КупоныВыходногоДня = Неопределено Тогда
		ОповеститьОбОшибках();
		Возврат;
	КонецЕсли;
	
	// Найдем расхождения
	НачатьТранзакцию();
	
	УстановитьБлокировки();
	
	ОтчетОСверкеКотировокТорговыхПлощадок = "";
	РасхожденияКотировкиТорговыхПлощадок = НайтиРасхожденияСРегистромКотировок("КотировкиТорговыхПлощадок", КотировкиТорговыхПлощадок, ОтчетОСверкеКотировокТорговыхПлощадок);
	
	ОтчетОСверкеКотировокЦенныхБумаг = "";
	РасхожденияКотировкиЦенныхБумаг = НайтиРасхожденияСРегистромКотировок("КотировкиЦенныхБумаг", КотировкиЦенныхБумаг, ОтчетОСверкеКотировокЦенныхБумаг);
	
	ОтчетОСверкеКупоновВыходногоДня = "";
	РасхожденияКупоновВыходногоДня = НайтиРасхожденияСРегистромКотировок("КупоныВыходногоДня", КупоныВыходногоДня, ОтчетОСверкеКупоновВыходногоДня);
	
	// Загрузим новые данные
	ТребуетсяИмпорт = Ложь;
	
	Если РасхожденияКотировкиТорговыхПлощадок.ЕстьРасхождения
		Или РасхожденияКотировкиЦенныхБумаг.ЕстьРасхождения
		Или РасхожденияКупоновВыходногоДня.ЕстьРасхождения
	Тогда
		
		Если ЭтотОбъект.РежимИмпорта = 1 Тогда // только импорт новых котировок
			
			Если РасхожденияКотировкиТорговыхПлощадок.ЗаписьУдалена > 0 Или РасхожденияКотировкиТорговыхПлощадок.ЗаписьИзменена > 0 Тогда
				ЗарегистрироватьОшибку("Импорт новых котировок невозможен, т.к. присутствуют расхождения в котировках торговых площадок.");
				ТребуетсяИмпорт = Ложь;
			ИначеЕсли РасхожденияКотировкиЦенныхБумаг.ЗаписьУдалена > 0 Или РасхожденияКотировкиЦенныхБумаг.ЗаписьИзменена > 0 Тогда
				ЗарегистрироватьОшибку("Импорт новых котировок невозможен, т.к. присутствуют расхождения в котировках ценных бумаг");
				ТребуетсяИмпорт = Ложь;
			ИначеЕсли РасхожденияКупоновВыходногоДня.ЗаписьУдалена > 0 Или РасхожденияКупоновВыходногоДня.ЗаписьИзменена > 0 Тогда
				ЗарегистрироватьОшибку("Импорт новых котировок невозможен, т.к. присутствуют расхождения в купонах выходного дня.");
				ТребуетсяИмпорт = Ложь;
			Иначе
				ТребуетсяИмпорт = РасхожденияКотировкиТорговыхПлощадок.НоваяЗапись > 0
					Или РасхожденияКотировкиЦенныхБумаг.НоваяЗапись > 0
					Или РасхожденияКупоновВыходногоДня.НоваяЗапись > 0;
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.РежимИмпорта = 2 Тогда
			
			ТребуетсяИмпорт = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТребуетсяИмпорт Тогда
		// Расхождения котировок торговых площадок
		Если РасхожденияКотировкиТорговыхПлощадок.ЕстьРасхождения Тогда
			ЗаписатьКотировкиВРегистр("КотировкиТорговыхПлощадок", КотировкиТорговыхПлощадок);
		КонецЕсли;
		// Расхождения котировок ценных бумаг
		Если РасхожденияКотировкиЦенныхБумаг.ЕстьРасхождения Тогда
			ЗаписатьКотировкиВРегистр("КотировкиЦенныхБумаг", КотировкиЦенныхБумаг);
		КонецЕсли;
		// Расхождения купонов выходного дня
		Если РасхожденияКупоновВыходногоДня.ЕстьРасхождения Тогда
			ЗаписатьКотировкиВРегистр("КупоныВыходногоДня", КупоныВыходногоДня);
		КонецЕсли;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	// Итоговый отчет
	Отчет =
		"<html>
		|<head>
		|	<style>
		|		.compare_records {font-size: 9pt; font-family: Verdana, Arial, Helvetica, sans-serif;}
		|		.new_record {color: green;}
		|		.del_record {color: blue;}
		|		.eq_values {color: gray;}
		|		.nq_values {color: red;}
		|	</style>
		|</head>
		|<body>
		|<h1>Отчет об импорте котировок ММВБ</h1>
		|<div>Период с &НачалоПериода по &ОкончаниеПериода</div>
		|<div>Отбор по ценной бумаге: &ОтборПоЦеннойБумаге</div>
		|<h2>Котировки торговых площадок</h2>
		|&ОтчетОСверкеКотировокТорговыхПлощадок
		|<h2>Котировки ценных бумаг</h2>
		|&ОтчетОСверкеКотировокЦенныхБумаг
		|<h2>Купоны выходного дня</h2>
		|&ОтчетОСверкеКупоновВыходногоДня
		|</body></html>";
	Отчет = СтрЗаменить(Отчет, "&НачалоПериода", Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
	Отчет = СтрЗаменить(Отчет, "&ОкончаниеПериода", Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	Отчет = СтрЗаменить(Отчет, "&ОтчетОСверкеКотировокТорговыхПлощадок", ОтчетОСверкеКотировокТорговыхПлощадок);
	Отчет = СтрЗаменить(Отчет, "&ОтчетОСверкеКотировокЦенныхБумаг", ОтчетОСверкеКотировокЦенныхБумаг);
	Отчет = СтрЗаменить(Отчет, "&ОтчетОСверкеКупоновВыходногоДня", ОтчетОСверкеКупоновВыходногоДня);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		Отчет = СтрЗаменить(Отчет, "&ОтборПоЦеннойБумаге", ЭтотОбъект.ЦеннаяБумага);
	Иначе
		Отчет = СтрЗаменить(Отчет, "&ОтборПоЦеннойБумаге", "не установен");
	КонецЕсли;
	
	ОповеститьОбОшибках();
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуДанныхССервераSQL(СтрокаСоединения, ТекстЗапроса, ТипыКолонок)
	
	ПараметрыПолученияДанныхАДОБД = Новый Структура(
		"ВозвращатьПустуюТаблицу, Источник",
		Истина,
		ЭтотОбъект.Метаданные().Представление());

	ТаблицаДанных = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок,, ПараметрыПолученияДанныхАДОБД);
	
	Если ПараметрыПолученияДанныхАДОБД.Свойство("Ошибки") Тогда
		Для каждого Ошибка Из ПараметрыПолученияДанныхАДОБД.Ошибки Цикл
			ЗарегистрироватьОшибку(Ошибка);
			Возврат Неопределено;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции // ПолучитьТаблицуДанныхССервераSQL

Процедура ДобавитьКодРежимаТорговВТаблицу(Таблица, КодРежимаТоргов)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Код = КодРежимаТоргов;
	
КонецПроцедуры // ДобавитьКодРежимаТорговВТаблицу

// Установка блокировок регистров котировок для запрета изменений записей, пока не будут сформированы записи в соответствующем сводном регистре
Процедура УстановитьБлокировки()
	БлокировкаДанных = Новый БлокировкаДанных;
	
	// Котировки торговых площадок
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.КотировкиТорговыхПлощадок");
	ЭлементБлокировкиДанных.УстановитьЗначение("Период", Новый Диапазон(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания));
	ЭлементБлокировкиДанных.УстановитьЗначение("Биржа", мБиржаММВБ);
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	
	// Котировки ценных бумаг
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.КотировкиЦенныхБумаг");
	ЭлементБлокировкиДанных.УстановитьЗначение("Период", Новый Диапазон(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания));
	ЭлементБлокировкиДанных.УстановитьЗначение("Биржа", мБиржаММВБ);
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
		ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	
	БлокировкаДанных.Заблокировать();
КонецПроцедуры

Процедура ПередатьРежимыТорговВЗапрос(Запрос)
	
	// в запросе уже должна быть временная таблица _Котировки
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РежимыБиржевыхТоргов.Ссылка КАК Ссылка,
		|	РежимыБиржевыхТоргов.Код КАК Код,
		|	РежимыБиржевыхТоргов.КотировкиНеНужны КАК КотировкиНеНужны
		|ПОМЕСТИТЬ _РежимыБиржевыхТоргов
		|ИЗ
		|	Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|ГДЕ
		|	РежимыБиржевыхТоргов.Биржа = &Биржа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Котировки.BOARDID КАК BOARDID,
		|	_Котировки.BOARDNAME КАК BOARDNAME
		|ИЗ
		|	_Котировки КАК _Котировки
		|ГДЕ
		|	НЕ _Котировки.BOARDID В
		|				(ВЫБРАТЬ
		|					_РежимыБиржевыхТоргов.Код
		|				ИЗ
		|					_РежимыБиржевыхТоргов)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		// получим наименования режимов торгов
		НаименованияРежимовТоргов = Новый Соответствие;
		
		Макет = ПолучитьМакет("НаименованияРежимовТоргов");
		Для НомСтр = 2 По Макет.ВысотаТаблицы Цикл	
			НаименованияРежимовТоргов.Вставить(СокрЛП(Макет.Область(НомСтр, 1).Текст), СокрЛП(Макет.Область(НомСтр, 2).Текст));
		КонецЦикла;	
		
		// создадим недостающие режимы торгов
		ТекстСообщения = "";
		
		Выборка = РезультатЗапроса.Выбрать();
		
		УстановитьПривилегированныйРежим(Истина); // т.к. импортировать котировки можно при импорте ц/б, при этом прав на изменение режимов торгов может и не быть
		
		Пока Выборка.Следующий() Цикл
			НовыйРежимТоргов = Справочники.РежимыБиржевыхТоргов.СоздатьЭлемент();
			НовыйРежимТоргов.Биржа 			          = мБиржаММВБ;
			НовыйРежимТоргов.Код 			          = Выборка.BOARDID;
			НовыйРежимТоргов.Наименование 	          = Выборка.BOARDNAME;
			НовыйРежимТоргов.НаименованиеРежимаТоргов = НаименованияРежимовТоргов.Получить(Выборка.BOARDID);
			НовыйРежимТоргов.Записать();
			
			//сообщим о новом режиме
			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + "При импорте котировок создан новый режим биржевых торгов с кодом '" + Выборка.BOARDID + "'. Настройте реквизиты справочника";
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗарегистрироватьОшибку(ТекстСообщения);
		
		// повторно передадим таблицу в запрос
		Запрос.Текст = 
			"УНИЧТОЖИТЬ _РежимыБиржевыхТоргов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РежимыБиржевыхТоргов.Ссылка КАК Ссылка,
			|	РежимыБиржевыхТоргов.Код КАК Код,
			|	РежимыБиржевыхТоргов.КотировкиНеНужны КАК КотировкиНеНужны
			|ПОМЕСТИТЬ _РежимыБиржевыхТоргов
			|ИЗ
			|	Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
			|ГДЕ
			|	РежимыБиржевыхТоргов.Биржа = &Биржа";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередатьВалютыВЗапрос(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Валюты.Ссылка КАК Ссылка,
		|	Валюты.Наименование КАК Наименование
		|ПОМЕСТИТЬ _Валюты
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Валюты.Ссылка,
		|	""SUR""
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Наименование = ""RUB""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Валюты.Ссылка,
		|	""RUR""
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Наименование = ""RUB""";
	
	Запрос.Выполнить();

КонецПроцедуры

Функция ВПериодПопалиНеторговыеКонцыМесяцев(ЗарегистрироватьОшибкуЕслиНайдены = Истина)
	
	Если (Не ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага)	Или ТипЗнч(ЭтотОбъект.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации"))
			И (ЭтотОбъект.Период.ДатаОкончания = КонецМесяца(ЭтотОбъект.Период.ДатаОкончания)
					Или НачалоМесяца(ЭтотОбъект.Период.ДатаНачала) <> НачалоМесяца(ЭтотОбъект.Период.ДатаОкончания))
	Тогда
		
		КалендарьКотировок = ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок");
		
		ПроверяемаяДата = КонецМесяца(ЭтотОбъект.Период.ДатаНачала);
		
		НеторговыеДатыУчетаНКД = Новый Массив;
		НеторговыеДатыУчетаНКДСтрокой = "";
		
		Пока ПроверяемаяДата <= ЭтотОбъект.Период.ДатаОкончания Цикл
			
			Если НЕ Справочники.Календари.ЭтоРабочийДень(КалендарьКотировок, НачалоДня(ПроверяемаяДата)) Тогда
				
				НеторговыеДатыУчетаНКД.Добавить(ПроверяемаяДата);
				НеторговыеДатыУчетаНКДСтрокой = ?(НеторговыеДатыУчетаНКДСтрокой = "", "", НеторговыеДатыУчетаНКДСтрокой + ", ") + Формат(ПроверяемаяДата, "ДФ=dd.MM.yyyy");
				
			КонецЕсли;
			
			ПроверяемаяДата = КонецМесяца(ПроверяемаяДата + 86400);
			
		КонецЦикла;
		
		Если НеторговыеДатыУчетаНКД.Количество() > 0 Тогда
			
			Если ЗарегистрироватьОшибкуЕслиНайдены Тогда
				ЗарегистрироватьОшибку("При загрузке котировок ММВБ за период с " + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy") + " попадают неторговые концы месяцев: " + НеторговыеДатыУчетаНКДСтрокой + ". Необходимо исключить эти даты из периода загрузки и отдельно загрузить по ним НКД с биржи");
			КонецЕсли;
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВПериодПопалиНеторговыеКонцыМесяцев

Функция ПолучитьСтруктуруТаблицыКотировок(ИмяРегистра)
	Котировки = Новый ТаблицаЗначений;
	Котировки.Колонки.Добавить("SECID",		  Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
	Котировки.Колонки.Добавить("BOARDID",	  Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
	Котировки.Колонки.Добавить("BOARDNAME",	  Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	Котировки.Колонки.Добавить("CURRENCYID",  Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(5)));
	
	// Измерения регистра
	Котировки.Колонки.Добавить("Период",	  Новый ОписаниеТипов("Дата"));
	Котировки.Колонки.Добавить("РежимТоргов", Новый ОписаниеТипов("СправочникСсылка.РежимыБиржевыхТоргов"));
	
	// Ресурсы регистра
	Для Каждого РесурсМД Из Метаданные.РегистрыСведений[ИмяРегистра].Ресурсы Цикл
		Котировки.Колонки.Добавить(РесурсМД.Имя, РесурсМД.Тип);
	КонецЦикла;
	Возврат Котировки;
КонецФункции

Процедура ЗаписатьКотировкиВРегистр(ИмяРегистра, Котировки)
	ДатаИнтервала = НачалоДня(ЭтотОбъект.Период.ДатаОкончания);
	
	Пока ДатаИнтервала >= ЭтотОбъект.Период.ДатаНачала Цикл
		НаборКотировок = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		
		НаборКотировок.Отбор.Период.Установить(ДатаИнтервала);
		НаборКотировок.Отбор.Биржа.Установить(мБиржаММВБ);
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда
			// Использование измерения "ЦеннаяБумага" допустимо только при его наличии в регистре
			Если Метаданные.РегистрыСведений.Найти(ИмяРегистра).Измерения.Найти("ЦеннаяБумага") <> Неопределено Тогда
				НаборКотировок.Отбор.ЦеннаяБумага.Установить(ЭтотОбъект.ЦеннаяБумага);
			КонецЕсли;
			// Использование измерения "Облигация" допустимо только при его наличии в регистре
			Если Метаданные.РегистрыСведений.Найти(ИмяРегистра).Измерения.Найти("Облигация") <> Неопределено
				И ТипЗнч(ЭтотОбъект.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации")
			Тогда
				НаборКотировок.Отбор.Облигация.Установить(ЭтотОбъект.ЦеннаяБумага);
			КонецЕсли;
		КонецЕсли;
		
		Если ДатаИнтервала > ЭтотОбъект.Период.ДатаНачала Тогда
			// Сводные котировки рассчитаем один раз, когда достигнем начальной даты
			НаборКотировок.ДополнительныеСвойства.Вставить("НеВыполнятьРасчетСводныхКотировок", Истина);
		Иначе
			НаборКотировок.ДополнительныеСвойства.Вставить("ВыполнитьПроверкуРасчетногоНКД", Истина);
			НаборКотировок.ДополнительныеСвойства.Вставить("ДатаНачалаПроверкиРасчетногоНКД", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
			НаборКотировок.ДополнительныеСвойства.Вставить("ДатаОкончанияПроверкиРасчетногоНКД", НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
		КонецЕсли;
		
		НаборКотировок.Загрузить(Котировки.Скопировать(Новый Структура("Период", ДатаИнтервала)));
		НаборКотировок.Записать();
		
		ДатаИнтервала = ДатаИнтервала - 86400;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьКодыФинансовыхИнструментовНаММБВ()
	
	КодыФинансовыхИнструментов = Новый Структура("ЦенныеБумаги, Деривативы");
	
	Запрос = Новый Запрос;
	
	// Ценные бумаги и 
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	""'"" + КодыВТорговыхСистемах.Код + ""'"" КАК Код,
		|	ТИПЗНАЧЕНИЯ(КодыВТорговыхСистемах.Объект) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты) КАК ЭтоДериватив
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах КАК КодыВТорговыхСистемах
		|ГДЕ
		|	КодыВТорговыхСистемах.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)
		|	И ТИПЗНАЧЕНИЯ(КодыВТорговыхСистемах.Объект) <> ТИП(Справочник.Товары)
		|	И (&Объект = НЕОПРЕДЕЛЕНО
		|			ИЛИ КодыВТорговыхСистемах.Объект = &Объект)";
		
	Запрос.УстановитьПараметр("Объект", ?(ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага), ЭтотОбъект.ЦеннаяБумага, Неопределено ));
	
	ТаблицаКодов = Запрос.Выполнить().Выгрузить(); 
	
	КодыФинансовыхИнструментов.ЦенныеБумаги = СтрСоединить(ТаблицаКодов.Скопировать(Новый Структура("ЭтоДериватив", Ложь), "Код").ВыгрузитьКолонку("Код"), ", ");
	КодыФинансовыхИнструментов.Деривативы = СтрСоединить(ТаблицаКодов.Скопировать(Новый Структура("ЭтоДериватив", Истина), "Код").ВыгрузитьКолонку("Код"), ", ");	
	
	Возврат КодыФинансовыхИнструментов;
КонецФункции

Функция ПолучитьКотировкиММВБИзMatrix(КодыФинансовыхИнструментов)
	
	Котировки = ПолучитьСтруктуруТаблицыКотировок("КотировкиТорговыхПлощадок");
	
	ТипыКолонок = Новый Структура;
	Для Каждого Колонка Из Котировки.Колонки Цикл
		ТипыКолонок.Вставить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	#Область ОсновныеКотировкиММВБ
	
	Если ЗначениеЗаполнено(КодыФинансовыхИнструментов.ЦенныеБумаги) Тогда
		
		СтрокаСоединенияССерверомSQL = РаботаСВнешнимиСистемами.СтрокаСоединенияСМатрихExternal();
		
		ТекстЗапросаSQL =
		#Область ТекстЗапроса
			"SELECT
			|	CAST(SEM21.TradeDate as DATETIME) as Период,
			|	SEM21.SecurityId	      as SECID,
			|	Boards.BoardName	      as BOARDNAME,
			|	SEM21.BoardID		      as BOARDID,
			|	SEM21.CurrencyId	      as CURRENCYID,
			|	CASE WHEN SEM21.TradeDate < '20210731' THEN CAST(SEM21.AccInt as decimal(19, 4))	ELSE CAST(SEM21.AccInt as decimal(&Length, &Decimal))	END	as ACCINT,
			|	SEM21.ADMITTEDQUOTE       as ADMITTEDQUOTE,
			|	SEM21.ADMITTEDVALUE       as ADMITTEDVALUE,
			|	SEM21.BID			      as BID,
			|	SEM21.[CLOSE]		      as [CLOSE],
			|	SEM21.CLOSEPERIOD         as CLOSEPERIOD,
			|	SEM21.CLOSEVAL            as CLOSEVAL,
			|	0                         as DAILYCAPITALIZATION,
			|	SEM21.DURATION            as DURATION,
			|	SEM21.HIGH			      as HIGH,
			|	SEM21.HIGHBID             as HIGHBID,
			|	SEM21.LEGALCLOSEPRICE	  as LEGALCLOSEPRICE,
			|	SEM21.LEGALOPENPRICE	  as LEGALOPENPRICE,
			|	SEM21.LOW			      as LOW,
			|	SEM21.LOWOFFER            as LOWOFFER,
			|	SEM21.MARKETPRICE         as MARKETPRICE,
			|	SEM21.MARKETPRICE2        as MARKETPRICE2,
			|	SEM21.MARKETPRICE3        as MARKETPRICE3,
			|	SEM21.MP3ValTrd		      as MARKETPRICE3TRADESVALUE,
			|	0                         as MONTHLYCAPITALIZATION,
			|	SEM21.MP2VALTRD           as MP2VALTRD,
			|	SEM21.MPVALTRD            as MPVALTRD,
			|	SEM21.NUMTRADES           as NUMTRADES,
			|	SEM21.OFFER               as OFFER,
			|	SEM21.[OPEN]		      as [OPEN],
			|	SEM21.OPENPERIOD          as OPENPERIOD,
			|	SEM21.OPENVAL             as OPENVAL,
			|	SEM21.PREV			      as PREV,
			|	SEM21.PREVLEGALCLOSEPRICE as PREVLEGALCLOSEPRICE,
			|	0						  as SETTLEPRICE,
			|	SEM21.TRENDCLOSE          as TRENDCLOSE,
			|	SEM21.TRENDCLSPR          as TRENDCLSPR,
			|	SEM21.TRENDWAP            as TRENDWAP,
			|	SEM21.TRENDWAPPR          as TRENDWAPPR,
			|	SEM21.VALUE               as VALUE,
			|	SEM21.VOLUME              as VOLUME,
			|	SEM21.WAPRICE             as WAPRICE,
			|	0                         as YIELD,
			|	SEM21.YIELDATWAP          as YIELDATWAP,
			|	SEM21.YIELDCLOSE          as YIELDCLOSE,
			|	SEM21.LISTNAME            as LISTNAME,
			|	SEM21.CloseAuction	      as CLOSEAUCTIONPRICE,
			|	SEM21.LASTPRICE	          as LASTPRICE,
			|	CASE WHEN SEM21.TradeDate BETWEEN '20200601' AND '20200621' THEN SEM21.BID       ELSE SEM21_MAIN.BID       END as BID_MAIN,
			|	CASE WHEN SEM21.TradeDate BETWEEN '20200601' AND '20200621' THEN SEM21.OFFER     ELSE SEM21_MAIN.OFFER     END as OFFER_MAIN,
			|	CASE WHEN SEM21.TradeDate BETWEEN '20200601' AND '20200621' THEN SEM21.NUMTRADES ELSE SEM21_MAIN.NUMTRADES END as NUMTRADES_MAIN,
			|	CASE WHEN SEM21.TradeDate BETWEEN '20200601' AND '20200621' THEN SEM21.VALUE     ELSE SEM21_MAIN.VALUE     END as VALUE_MAIN
			|
			|FROM
			|	[MatriX_External].[dbo].[MICEX_EDC_SEM21] as SEM21
			|
			|	LEFT JOIN [MatriX_External].[dbo].[MICEX_EDC_SEM21] as SEM21_MAIN
			|		ON SEM21.TradeDate = SEM21_MAIN.TradeDate
			|			AND SEM21.SecurityId = SEM21_MAIN.SecurityId
			|			AND SEM21.BoardId = SEM21_MAIN.BoardId
			|			AND SEM21.CurrencyId = SEM21_MAIN.CurrencyId
			|			AND SEM21_MAIN.SessionNo = 1
			|
			|	LEFT JOIN [MatriX_External].[dbo].[MICEX_EDC_SEM21_Boards] as Boards ON SEM21.BoardID = Boards.BoardID
			|
			|WHERE
			|	SEM21.TradeDate BETWEEN &BeginDate AND &EndDate
			|		AND SEM21.SecurityId IN(&Securities)
			|		AND (SEM21.SessionNo Is NULL or SEM21.SessionNo = 3)
			|
			|ORDER BY
			|	SEM21.TradeDate";
		#КонецОбласти
		// данные по биржевым секциям стали появляться начиная с '2020-06-22'
		// по задаче #323419 решили, что с '2020-06-01' по '2020-06-21' будем подставлять данные без секции,
		// т.к. это упростит получение котировок для методик
		
		// Легкий хардкод по бумаге, по которой было изменение кода на ММВБ, периодичности которой в Матрихе нет	
		Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) И ТипЗнч(ЭтотОбъект.ЦеннаяБумага) = Тип("СправочникСсылка.Акции") И ЭтотОбъект.ЦеннаяБумага.ГосударственныйРегистрационныйНомер = "1-02-65104-D" Тогда
			ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "AND SEM21.SecurityId IN(&Securities)", "AND SEM21.REGNUMBER = '1-02-65104-D'");
			ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "SEM21.SecurityId", "'UPRO'");
		КонецЕсли;
		
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&BeginDate",  "'" + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=yyyyMMdd") + "'");
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&EndDate",	  "'" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyyMMdd") + "'");
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Securities", КодыФинансовыхИнструментов.ЦенныеБумаги);
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Length",	  ТипыКолонок.Accint.КвалификаторыЧисла.Разрядность);
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Decimal",	  ТипыКолонок.Accint.КвалификаторыЧисла.РазрядностьДробнойЧасти);
	
		Котировки = ПолучитьТаблицуДанныхССервераSQL(СтрокаСоединенияССерверомSQL, ТекстЗапросаSQL, ТипыКолонок);
		Если Котировки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область КотировкиФОРТС
	
	Если ЗначениеЗаполнено(КодыФинансовыхИнструментов.Деривативы) Тогда
		
		СтрокаСоединенияССерверомSQL = РаботаСВнешнимиСистемами.СтрокаСоединенияСМатрих();
		
		ТекстЗапросаSQL =
			"SELECT
			|	CAST(Quotes.Date as DATETIME) Период,
			|	Quotes.SECID,
			|	Quotes.BOARDNAME,
			|	Quotes.BOARDID,
			|	Currencies.ISO_Code CURRENCYID,
			|	CAST(SUM(Quotes.SETTLEPRICE) AS decimal(19,5)) SETTLEPRICE,
			|	CAST(SUM(Quotes.[CLOSE]) AS decimal(19,5)) [CLOSE],
			|	SUM(Quotes.[OPEN]) [OPEN],
			|	SUM(Quotes.HIGH) HIGH,
			|	SUM(Quotes.LOW) LOW,
			|	SUM(Quotes.BID) BID,
			|	SUM(Quotes.WAP) WAPRICE,
			|	SUM(Quotes.VOLUME) VOLUME	
			|FROM	
			|	(SELECT
			|		SettlePrices.Date,
			|		Derivatives.Code SECID,
			|		'Расчетная цена ФОРТС' BOARDNAME,
			|		'FORTS' BOARDID,
			|		SettlePrices.Currency_ID Currency_ID,
			|		SettlePrices.Quote SETTLEPRICE,
			|		0 [CLOSE],
			|		0 [OPEN],
			|		0 HIGH,
			|		0 LOW,
			|		0 BID,
			|		0 WAP,
			|		0 VOLUME
			|	FROM 
			|		MatriX.dbo.vw_Securities_Quotes SettlePrices
			|		INNER JOIN MatriX.dbo.vw_Derivatives Derivatives
			|		ON SettlePrices.Security_ID = Derivatives.ID
			|			AND SettlePrices.Date BETWEEN &BeginDate AND &EndDate
			|			AND SettlePrices.Base_UID = 'FORTS.Settlement'
			|			AND Derivatives.Code IN (&Derivatives)
			|
			|	UNION ALL
			|
			|	SELECT
			|		TradeQuotes.Date,
			|		Derivatives.Code,
			|		CASE
			|			WHEN Derivatives.Type_UID = 'Securities.Type.Derivatives.Spot'
			|				THEN 'Системные сделки' 
			|				ELSE 'Расчетная цена ФОРТС'
			|		END,
			|		CASE
			|			WHEN Derivatives.Type_UID = 'Securities.Type.Derivatives.Spot'
			|				THEN 'CETS' 
			|				ELSE 'FORTS'
			|		END,
			|		TradeQuotes.Currency_ID,
			|		0,
			|		TradeQuotes.[Close],
			|		TradeQuotes.[Open],
			|		TradeQuotes.[High],
			|		TradeQuotes.[Low],
			|		TradeQuotes.[Bid],
			|		TradeQuotes.[wap],
			|		TradeQuotes.[Trade_Volume]
			|		FROM 
			|			MatriX.dbo.vw_Securities_Quotes TradeQuotes
			|			INNER JOIN MatriX.dbo.vw_Derivatives Derivatives
			|			ON TradeQuotes.Security_ID = Derivatives.ID
			|				AND TradeQuotes.Date BETWEEN &BeginDate AND &EndDate
			|				AND TradeQuotes.Base_UID = 'MICEX.Trade'
			|				AND Derivatives.Code IN (&Derivatives)) AS Quotes
			|	LEFT JOIN MatriX.dbo.Currencies AS Currencies 
			|	ON Quotes.Currency_ID = Currencies.ID 
			|GROUP BY
			|	Quotes.Date,
			|	Quotes.SECID,
			|	Quotes.BOARDNAME,
			|	Quotes.BOARDID,
			|	Currencies.ISO_Code
			|ORDER BY
			|	Quotes.Date";
		
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&BeginDate", "'" + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=yyyyMMdd") + "'");
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&EndDate", "'" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyyMMdd") + "'");
		ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Derivatives", КодыФинансовыхИнструментов.Деривативы);
		
		КотировкиДеривативов = ПолучитьТаблицуДанныхССервераSQL(СтрокаСоединенияССерверомSQL, ТекстЗапросаSQL, ТипыКолонок);
		
		Если КотировкиДеривативов = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
			
		Для Каждого СтрокаКотировкиДеривативов Из КотировкиДеривативов Цикл
			ЗаполнитьЗначенияСвойств(Котировки.Добавить(), СтрокаКотировкиДеривативов);
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	КотировкиТорговыхПлощадок = ДесериализоватьТаблицуКотировок(Котировки);
	ВыполнитьКорректировкуКупона(КотировкиТорговыхПлощадок);
	Возврат КотировкиТорговыхПлощадок;
КонецФункции

Функция РассчитатьКупоныВыходногоДня(КодыЦенныхБумагНаММВБ)
	Купоны = Новый ТаблицаЗначений;
	Купоны.Колонки.Добавить("TRADEDATE", Новый ОписаниеТипов("Дата"));
	Купоны.Колонки.Добавить("SECURITYID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
	Купоны.Колонки.Добавить("ACCINT", Метаданные.РегистрыСведений.КупоныВыходногоДня.Ресурсы.ACCINT.Тип);
	
	ТипыКолонок = Новый Структура;
	Для Каждого Колонка Из Купоны.Колонки Цикл
		ТипыКолонок.Вставить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	// Получение купонов с сервера
	СтрокаСоединенияССерверомSQL = РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	ТекстЗапросаSQL =
		"SELECT
		|	CAST(TradeDate AS DATETIME) AS TradeDate,
		|	SecurityID AS SecurityID,
		|	CASE WHEN TradeDate < '20210731' THEN CAST(Accint AS DECIMAL(19, 4)) ELSE CAST(Accint AS DECIMAL(&Length, &Decimal)) END AS Accint
		|FROM
		|	[Externals].[dbo].[Non_Trade_End_Month_Acc_Int]
		|WHERE
		|	TradeDate BETWEEN &BeginDate AND &EndDate
		|	AND NOT Accint IS NULL
		|	AND SecurityID IN (&Securities)";
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&BeginDate",	"'" + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=yyyyMMdd") + "'");
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&EndDate",		"'" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyyMMdd") + "'");
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Length",		Купоны.Колонки.ACCINT.ТипЗначения.КвалификаторыЧисла.Разрядность);
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Decimal",		Купоны.Колонки.ACCINT.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти);
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Securities",	?(ПустаяСтрока(КодыЦенныхБумагНаММВБ.ЦенныеБумаги), "''", КодыЦенныхБумагНаММВБ.ЦенныеБумаги));
	
	Купоны = ПолучитьТаблицуДанныхССервераSQL(СтрокаСоединенияССерверомSQL, ТекстЗапросаSQL, ТипыКолонок);
	Если Купоны = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Десериализуем и поместим в таблицу
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Купоны.TradeDate КАК TradeDate,
		|	Купоны.SecurityID КАК SecurityID,
		|	Купоны.Accint КАК Accint
		|ПОМЕСТИТЬ _Купоны
		|ИЗ
		|	&Купоны КАК Купоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ _РабочиеДни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = &КалендарьКотировок
		|	И НЕ(ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
		|				ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ), ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Купоны.TradeDate КАК Период,
		|	&Биржа КАК Биржа,
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК Облигация,
		|	Купоны.Accint КАК ACCINT
		|ИЗ
		|	_Купоны КАК Купоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО Купоны.SecurityID = КодыВТорговыхСистемахСрезПоследних.Код
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РабочиеДни КАК РабочиеДни
		|		ПО (НАЧАЛОПЕРИОДА(Купоны.TradeDate, ДЕНЬ) = РабочиеДни.Дата)
		|ГДЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.Облигации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	#КонецОбласти
	Запрос.УстановитьПараметр("Купоны", Купоны);
	Запрос.УстановитьПараметр("Период", НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Биржа", мБиржаММВБ);
	Запрос.УстановитьПараметр("КалендарьКотировок", Константы.ОсновнойКалендарьКотировок.Получить());
	
	Купоны = Запрос.Выполнить().Выгрузить();
	ВыполнитьКорректировкуКупона(Купоны);
	Возврат Купоны;
КонецФункции

Процедура ВыполнитьКорректировкуКупона(Котировки)

	// Облигация_ОткрытиеХолдинг: корректируем купон, т.к. ММВБ предоставляет неверные данные
	// Информация получена от ММВБ (см.: https://fs.moex.com/files/20213)
	ИмяКолонкиЦеннойБумаги = "ЦеннаяБумага";
	Если Котировки.Колонки.Найти("ЦеннаяБумага") = Неопределено И Котировки.Колонки.Найти("Облигация") <> Неопределено Тогда
		ИмяКолонкиЦеннойБумаги = "Облигация";
	КонецЕсли;
	
	Облигация_ОткрытиеХолдинг = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг");
	
	Если Облигация_ОткрытиеХолдинг <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_ОткрытиеХолдинг));
		
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			Если СтрокаКотировки.Период >= Дата(2020, 08, 18) Тогда
				СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
					СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Арчер Финанс: корректируем купон, т.к. ММВБ предоставляет неверные данные
	Облигация_АрчерФинанс = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс");
	
	Если Облигация_АрчерФинанс <> Неопределено Тогда
		
		НайдСтроки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_АрчерФинанс));
		Для Каждого ТекСтрока Из НайдСтроки Цикл
			Если ТекСтрока.Период < Дата(2020, 01, 30) Тогда // #305660
				ТекСтрока.ACCINT = РаботаСЦеннымиБумагами.РассчитатьКотировкуКупона_АрчерФинанс(ТекСтрока.Период);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Вейл Финанс: рассчитываем купон, т.к. ММВБ шлет 0
	Облигация_ВейлФинанс = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВейлФинанс");
	
	Если Облигация_ВейлФинанс <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_ВейлФинанс));
		
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
		КонецЦикла;
		
	КонецЕсли;
	
	// Финстандарт: корректируем купон, т.к. ММВБ предоставляет неверные данные. По 13-му купонному периоду нетиповой расчет купона.
	Облигация_Финстандарт = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстандарт");
	
	Если Облигация_Финстандарт <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_Финстандарт));
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК Курс,
			|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность
			|ИЗ
			|	Справочник.Облигации КАК Облигации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|		ПО Облигации.ВалютаНоминала = КурсыВалют.Валюта
			|			И (КурсыВалют.Период = &Дата)
			|ГДЕ
			|	Облигации.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Облигация_Финстандарт);
		
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			
			Запрос.УстановитьПараметр("Дата", СтрокаКотировки.Период);
			ВыборкаКурсов = Запрос.Выполнить().Выбрать();
			
			КурсВалютыНоминала = 1;
			Если ВыборкаКурсов.Следующий() Тогда
				КурсВалютыНоминала = ВыборкаКурсов.Курс / ВыборкаКурсов.Кратность;
			КонецЕсли;
			
			СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.РассчитатьКотировкуКупона_Финстандарт(СтрокаКотировки.Период, СтрокаКотировки.ACCINT, КурсВалютыНоминала);
			СтрокаКотировки.Валюта = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
			
		КонецЦикла;
	КонецЕсли;
	
	// Сбербанк ПАО, 4B027301481B001P, 1000.00 RUB: устанавливаем вручную котировку купона 0.67 только на 1 апреля 2019 г.
	Облигация_Сбербанк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Сбербанк");
	
	Если Облигация_Сбербанк <> Неопределено Тогда
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги + ", Период", Облигация_Сбербанк, '20190401'));
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			СтрокаКотировки.ACCINT = 0.67;
		КонецЦикла;
	КонецЕсли;
	
	// АКБ ПЕРЕСВЕТ ПАО, 40402110B, 329.00 RUB: рассчитываем купон, т.к. ММВБ шлет 0
	Облигация_Пересвет = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Пересвет");
	
	Если Облигация_Пересвет <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_Пересвет));
		
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
				СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
		КонецЦикла;
	КонецЕсли;
	
	// ДОМ.РФ АО, 4B02-03-00739-A-001P, 1000.00 RUB: рассчитываем купон, т.к. ММВБ шлет 0
	Облигация_ДОМРФ_003 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДОМ.РФ_003");
	
	Если Облигация_ДОМРФ_003 <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_ДОМРФ_003));
		
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			Если СтрокаКотировки.Период >= '20201002' И СтрокаКотировки.Период <= '20210402' Тогда
				СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
					СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// ДОМ.РФ АО, 4-25-00739-A, 1000.00 RUB: рассчитываем купон, т.к. ММВБ шлет 0
	Облигация_ДОМРФ_025 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДОМ.РФ_025");
	
	Если Облигация_ДОМРФ_025 <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_ДОМРФ_025));
		
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			Если СтрокаКотировки.Период >= '20201002' И СтрокаКотировки.Период <= '20210101' Тогда
				СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
					СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Открытие Холдинг АО, 4B02-04-14406-A, 1000.00 RUB: корректируем купон, т.к. с 09.04.2020 ММВБ шлет 0 (https://www.moex.com/n28006 и https://www.moex.com/n28045)
	Облигация_ОткрХолдинг_004 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрХолдинг_004");
	
	Если Облигация_ОткрХолдинг_004 <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_ОткрХолдинг_004));
		
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			Если СтрокаКотировки.Период >= '20200409' Тогда
				СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
					СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// CBOM Finance p.l.c., XS1601094755, 1000.00 USD: корректируем купон, т.к. с 10.05.2023 ММВБ шлет 0 (https://www.moex.com/n56057?utm_source=www.moex.com&utm_term=XS1601094755)
	Облигация_CBOM_Finance_XS1601094755 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_CBOM_Finance_XS1601094755");
	
	Если Облигация_CBOM_Finance_XS1601094755 <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_CBOM_Finance_XS1601094755));
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			Если СтрокаКотировки.Период >= '20230511' Тогда
				
				ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
					СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка(),, 4);
				ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКотировки[ИмяКолонкиЦеннойБумаги], "ВалютаНоминала");
				Если СтрокаКотировки.Валюта = ВалютаНоминала Тогда
					СтрокаКотировки.ACCINT = ACCINT;
				Иначе
					Отказ = Ложь;
					СтрокаКотировки.ACCINT = РаботаСВалютами.ПересчетСуммыВВалюте(
						ACCINT, ВалютаНоминала, СтрокаКотировки.Период, СтрокаКотировки.Валюта, СтрокаКотировки.Период, Отказ);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// По ГМК Норильский Никель ПАО, 4B02-07-40155-F-001P, 1000.00 RUB изменилось начало купонного периода, поэтому изменилась ставка (зависит от ставки рефинансирования)
	// Биржа купон не пересчитала за 20, 23, 24 июня 2025
	Облигация_НорильскийНикель007 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_НорильскийНикель_007");
	Если Облигация_НорильскийНикель007 <> Неопределено Тогда
		
		СтрокиКотировки = Котировки.НайтиСтроки(Новый Структура(ИмяКолонкиЦеннойБумаги, Облигация_НорильскийНикель007));
		Для Каждого СтрокаКотировки Из СтрокиКотировки Цикл
			Если СтрокаКотировки.Период = '20250620'
				Или СтрокаКотировки.Период = '20250623'
				Или СтрокаКотировки.Период = '20250624' Тогда
				
				СтрокаКотировки.ACCINT = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
					СтрокаКотировки[ИмяКолонкиЦеннойБумаги], СтрокаКотировки.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
								
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ДесериализоватьТаблицуКотировок(Котировки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Котировки", Котировки);
	Запрос.УстановитьПараметр("Биржа",     мБиржаММВБ);
	Запрос.УстановитьПараметр("Период",    ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Источник",  ЭтотОбъект.Метаданные().ПолноеИмя());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Котировки.*
		|ПОМЕСТИТЬ _Котировки
		|ИЗ
		|	&Котировки КАК Котировки";
	Запрос.Выполнить();
	
	ПередатьВалютыВЗапрос(Запрос);
	ПередатьРежимыТорговВЗапрос(Запрос);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Биржа КАК Биржа,
		|	&Источник КАК Источник,
		|	ВЫБОР
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.Акции
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.Облигации
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.Паи
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|					КОГДА ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|					КОГДА ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Спот)
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипБазовогоАктива = ЗНАЧЕНИЕ(Перечисление.ТипыБазовыхАктивов.ВалютнаяПара)
		|									ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары)
		|								КОГДА ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипБазовогоАктива = ЗНАЧЕНИЕ(Перечисление.ТипыБазовыхАктивов.ДрагоценныйМеталл)
		|									ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы)
		|							КОНЕЦ
		|				КОНЕЦ
		|	КОНЕЦ КАК Рынок,
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	_Валюты.Ссылка КАК Валюта,
		|	_РежимыБиржевыхТоргов.Ссылка КАК РежимТоргов,
		|	&КотировкиЗвездочка КАК КотировкиЗвездочка
		|ИЗ
		|	_Котировки КАК _Котировки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _Котировки.SECID = КодыВТорговыхСистемахСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Котировки.CURRENCYID = _Валюты.Наименование
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыБиржевыхТоргов КАК _РежимыБиржевыхТоргов
		|		ПО _Котировки.BOARDID = _РежимыБиржевыхТоргов.Код";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КотировкиЗвездочка КАК КотировкиЗвездочка", "_Котировки.*");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ДесериализоватьТаблицуКотировок

Функция РежимыТорговВСтроку(ВыборкаЦенныеБумаги)
	
	НаборРежимовТоргов = Новый Массив;
	
	Выборка = ВыборкаЦенныеБумаги.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборРежимовТоргов.Добавить(Выборка.BoardId);
	КонецЦикла;	
	
	Возврат СтрСоединить(НаборРежимовТоргов, ", ");
	
КонецФункции

Функция НайтиРасхожденияСРегистромКотировок(ИмяРегистра, НовыеКотировки, ОтчетОРасхождениях)
	
	ИсклПоля = "Рынок, Биржа, Источник, ДатаЗагрузки, Ответственный";
	ИсклПоля = СтрРазделить(НРег(СтрЗаменить(ИсклПоля, " ", "")), ",", Ложь);
	
	Измерения         = Новый Массив;
	РесурсыИРеквизиты = Новый Массив;
	
	ТекущиеИзмерения             = Новый Массив;
	НовыеИзмерения               = Новый Массив;
	СводныеИзмерения             = Новый Массив;
	СоединениеПоИзмерениям       = Новый Массив;
	ТекущиеРесурсыИРеквизиты     = Новый Массив;
	НовыеРесурсыИРеквизиты       = Новый Массив;
	СводныеРесурсыИРеквизиты     = Новый Массив;
	СравнениеРесурсовИРеквизитов = Новый Массив;
	
	РегистрМД = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Обработаем измерения
	Измерения.Добавить("Период");
	
	ТекущиеИзмерения.Добавить("ТекущиеЗначения.Период");
	НовыеИзмерения.Добавить("НовыеЗначения.Период");
	
	СводныеИзмерения.Добавить("ЕСТЬNULL(_ТекущиеЗначения.Период, _НовыеЗначения.Период) КАК Период");
	СоединениеПоИзмерениям.Добавить("_ТекущиеЗначения.Период = _НовыеЗначения.Период");
	
	Для Каждого ПолеМД Из РегистрМД.Измерения Цикл
		
		Если ИсклПоля.Найти(НРег(ПолеМД.Имя)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Измерения.Добавить(ПолеМД.Имя);
		
		ТекущиеИзмерения.Добавить("ТекущиеЗначения." + ПолеМД.Имя);
		НовыеИзмерения.Добавить("НовыеЗначения." + ПолеМД.Имя);
		
		СводныеИзмерения.Добавить("ЕСТЬNULL(_ТекущиеЗначения." + ПолеМД.Имя + ", _НовыеЗначения." + ПолеМД.Имя + ") КАК " + ПолеМД.Имя);
		СоединениеПоИзмерениям.Добавить("_ТекущиеЗначения." + ПолеМД.Имя + " = _НовыеЗначения." + ПолеМД.Имя);
		
	КонецЦикла;
	
	ТекущиеИзмерения       = СтрСоединить(ТекущиеИзмерения, "," + Символы.ПС + Символы.Таб);
	НовыеИзмерения         = СтрСоединить(НовыеИзмерения, "," + Символы.ПС + Символы.Таб);
	СводныеИзмерения       = СтрСоединить(СводныеИзмерения, "," + Символы.ПС + Символы.Таб);
	СоединениеПоИзмерениям = СтрСоединить(СоединениеПоИзмерениям, " И ");
	
	// Обработаем ресурсы и реквизиты
	ИменаНаборовПолей = Новый Массив;
	ИменаНаборовПолей.Добавить(РегистрМД.Ресурсы);
	ИменаНаборовПолей.Добавить(РегистрМД.Реквизиты);
	
	Для Каждого НаборПолейМД Из ИменаНаборовПолей Цикл
		Для Каждого ПолеМД Из НаборПолейМД Цикл
			
			Если ИсклПоля.Найти(НРег(ПолеМД.Имя)) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РесурсыИРеквизиты.Добавить(ПолеМД.Имя);
			
			ТекущиеРесурсыИРеквизиты.Добавить("ТекущиеЗначения." + ПолеМД.Имя + " КАК " + ПолеМД.Имя);
			НовыеРесурсыИРеквизиты.Добавить("НовыеЗначения." + ПолеМД.Имя + " КАК " + ПолеМД.Имя);
			
			СводныеРесурсыИРеквизиты.Добавить("_ТекущиеЗначения." + ПолеМД.Имя + " КАК _Тек_" + ПолеМД.Имя);
			СводныеРесурсыИРеквизиты.Добавить("_НовыеЗначения." + ПолеМД.Имя + " КАК _Нов_" + ПолеМД.Имя);
			
			СравнениеРесурсовИРеквизитов.Добавить("_ТекущиеЗначения." + ПолеМД.Имя + " <> _НовыеЗначения." + ПолеМД.Имя);
			
		КонецЦикла;
	КонецЦикла;
	
	ТекущиеРесурсыИРеквизиты     = СтрСоединить(ТекущиеРесурсыИРеквизиты, "," + Символы.ПС + Символы.Таб);
	НовыеРесурсыИРеквизиты       = СтрСоединить(НовыеРесурсыИРеквизиты, "," + Символы.ПС + Символы.Таб);
	СводныеРесурсыИРеквизиты     = СтрСоединить(СводныеРесурсыИРеквизиты, "," + Символы.ПС + Символы.Таб);
	СравнениеРесурсовИРеквизитов = СтрСоединить(СравнениеРесурсовИРеквизитов, " ИЛИ ");
	
	// Запрос
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала",    ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Биржа",         мБиржаММВБ);
	Запрос.УстановитьПараметр("НовыеЗначения", НовыеКотировки);
	Запрос.УстановитьПараметр("ЦеннаяБумага",  ЭтотОбъект.ЦеннаяБумага);
	
	Запрос.УстановитьПараметр("НетРасхождений", мТипыЗаписейВОтчетеОРасхождениях_НетРасхождений);
	Запрос.УстановитьПараметр("НоваяЗапись",    мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись);
	Запрос.УстановитьПараметр("ЗаписьУдалена",  мТипыЗаписейВОтчетеОРасхождениях_ЗаписьУдалена);
	Запрос.УстановитьПараметр("ЗаписьИзменена", мТипыЗаписейВОтчетеОРасхождениях_ЗаписьИзменена);
	
	// Сформируем текст запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ТекущиеИзмерения КАК ТекущиеИзмерения,
		|	&ТекущиеРесурсыИРеквизиты КАК ТекущиеРесурсыИРеквизиты
		|ПОМЕСТИТЬ _ТекущиеЗначения
		|ИЗ
		|	&ТекущиеЗначения КАК ТекущиеЗначения
		|ГДЕ
		|	ТекущиеЗначения.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТекущиеЗначения.Биржа = &Биржа
		|	И &ЕстьИзмерениеЦеннаяБумагаУсловие
		|	И &ЕстьИзмерениеОблигацияУсловие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&НовыеИзмерения КАК НовыеИзмерения,
		|	&НовыеРесурсыИРеквизиты КАК НовыеРесурсыИРеквизиты
		|ПОМЕСТИТЬ _НовыеЗначения
		|ИЗ
		|	&НовыеЗначения КАК НовыеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СводныеИзмерения КАК СводныеИзмерения,
		|	&СводныеРесурсыИРеквизиты КАК СводныеРесурсыИРеквизиты,
		|	ВЫБОР
		|		КОГДА &_ТекущиеЗначенияИзмерение0 ЕСТЬ NULL
		|			ТОГДА &НоваяЗапись
		|		КОГДА &_НовыеЗначенияИзмерение0 ЕСТЬ NULL
		|			ТОГДА &ЗаписьУдалена
		|		КОГДА &СравнениеРесурсовИРеквизитов
		|			ТОГДА &ЗаписьИзменена
		|		ИНАЧЕ &НетРасхождений
		|	КОНЕЦ КАК ВариантРасхождения
		|ИЗ
		|	_ТекущиеЗначения КАК _ТекущиеЗначения
		|		ПОЛНОЕ СОЕДИНЕНИЕ _НовыеЗначения КАК _НовыеЗначения
		|		ПО (&СоединениеПоИзмерениям)
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &_ТекущиеЗначенияИзмерение0 ЕСТЬ NULL
		|			ТОГДА &НоваяЗапись
		|		КОГДА &_НовыеЗначенияИзмерение0 ЕСТЬ NULL
		|			ТОГДА &ЗаписьУдалена
		|		КОГДА &СравнениеРесурсовИРеквизитов
		|			ТОГДА &ЗаписьИзменена
		|		ИНАЧЕ &НетРасхождений
		|	КОНЕЦ <> &НетРасхождений
		|
		|УПОРЯДОЧИТЬ ПО
		|	&УпорядочитьПериод,
		|	&ЕстьИзмерениеЦеннаяБумагаГруппировка,
		|	&ЕстьИзмерениеОблигацияГруппировка,
		|	&ЕстьИзмерениеРежимТорговГруппировка";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекущиеЗначения", "РегистрСведений." + ИмяРегистра);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекущиеИзмерения КАК ТекущиеИзмерения", ТекущиеИзмерения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекущиеРесурсыИРеквизиты КАК ТекущиеРесурсыИРеквизиты", ТекущиеРесурсыИРеквизиты);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НовыеИзмерения КАК НовыеИзмерения", НовыеИзмерения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НовыеРесурсыИРеквизиты КАК НовыеРесурсыИРеквизиты", НовыеРесурсыИРеквизиты);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СводныеИзмерения КАК СводныеИзмерения", СводныеИзмерения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СводныеРесурсыИРеквизиты КАК СводныеРесурсыИРеквизиты", СводныеРесурсыИРеквизиты);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СоединениеПоИзмерениям", СоединениеПоИзмерениям);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СравнениеРесурсовИРеквизитов", СравнениеРесурсовИРеквизитов);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&_ТекущиеЗначенияИзмерение0", "_ТекущиеЗначения." + Измерения[0]);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&_НовыеЗначенияИзмерение0", "_НовыеЗначения." + Измерения[0]);
	
	// Гарантированное, но неизвестное поле вызывает ошибку открытия редактора запроса
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УпорядочитьПериод", "ЕСТЬNULL(_ТекущиеЗначения.Период, _НовыеЗначения.Период)");
	
	// Использование измерения "РежимТоргов" допустимо только при его наличии в регистре
	Если Метаданные.РегистрыСведений.Найти(ИмяРегистра).Измерения.Найти("РежимТоргов") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеРежимТорговГруппировка", "ЕСТЬNULL(_ТекущиеЗначения.РежимТоргов, _НовыеЗначения.РежимТоргов)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеРежимТорговГруппировка", "ИСТИНА");
	КонецЕсли;
	
	// Использование измерения "ЦеннаяБумага" допустимо только при его наличии в регистре
	Если Метаданные.РегистрыСведений.Найти(ИмяРегистра).Измерения.Найти("ЦеннаяБумага") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеЦеннаяБумагаУсловие",
			?(ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага), "ТекущиеЗначения.ЦеннаяБумага = &ЦеннаяБумага", "ИСТИНА"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеЦеннаяБумагаГруппировка", "ЕСТЬNULL(_ТекущиеЗначения.ЦеннаяБумага, _НовыеЗначения.ЦеннаяБумага)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеЦеннаяБумагаУсловие", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеЦеннаяБумагаГруппировка", "ИСТИНА");
	КонецЕсли;
	
	// Использование измерения "Облигация" допустимо только при его наличии в регистре
	Если Метаданные.РегистрыСведений.Найти(ИмяРегистра).Измерения.Найти("Облигация") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеОблигацияУсловие",
			?(ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага), "ТекущиеЗначения.Облигация = &ЦеннаяБумага", "ИСТИНА"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеОблигацияГруппировка", "ЕСТЬNULL(_ТекущиеЗначения.Облигация, _НовыеЗначения.Облигация)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеОблигацияУсловие", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьИзмерениеОблигацияГруппировка", "ИСТИНА");
	КонецЕсли;
	
	Расхождения = Новый Структура("ЕстьРасхождения, Таблица, ВсегоЗаписей, НоваяЗапись, ЗаписьУдалена, ЗаписьИзменена");
	
	Расхождения.Таблица         = Запрос.Выполнить().Выгрузить();
	Расхождения.ЕстьРасхождения = (Расхождения.Таблица.Количество() > 0);
	
	Расхождения.НоваяЗапись    = 0;
	Расхождения.ЗаписьУдалена  = 0;
	Расхождения.ЗаписьИзменена = 0;
	
	Для Каждого СтрокаРасхождения Из Расхождения.Таблица Цикл
		Если      СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись Тогда
			Расхождения.НоваяЗапись = Расхождения.НоваяЗапись + 1;
		ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_ЗаписьУдалена Тогда
			Расхождения.ЗаписьУдалена = Расхождения.ЗаписьУдалена + 1;
		ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_ЗаписьИзменена Тогда
			Расхождения.ЗаписьИзменена = Расхождения.ЗаписьИзменена + 1;
		КонецЕсли;
	КонецЦикла;
	
	ОтчетОРасхождениях = ПодготовитьОтчетОРасхождениях(Расхождения, Измерения, РесурсыИРеквизиты);
	
	Возврат Расхождения;
	
КонецФункции // НайтиРасхожденияСРегистромКотировок

Функция ПодготовитьОтчетОРасхождениях(Расхождения, КлючевыеПоля, СравниваемыеПоля)
	МассивОтчетаHTML = Новый Массив; // Массив(Строка)
	
	Если Расхождения.ЕстьРасхождения = 0 Тогда
		МассивОтчетаHTML.Добавить("<h3 style=""color: green"">Нет расхождений</h3>");
	Иначе
		МассивОтчетаHTML.Добавить("<h3>Новых: " + Расхождения.НоваяЗапись + ", удалено: " + Расхождения.ЗаписьУдалена + ", изменено: " + Расхождения.ЗаписьИзменена + "</h3>");
	КонецЕсли;
	
	КолСравниваемыхПолейВЯчейке = 5;
	МассивОтчетаHTML.Добавить("<table class=""compare_records"">");
	Расхождения.Таблица.Сортировать("ВариантРасхождения УБЫВ");
	
	Для Каждого СтрокаРасхождения Из Расхождения.Таблица Цикл
		
		Если СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись
			И ЭтотОбъект.СкрыватьВОтчетеНовыеКотировки
		Тогда
			Продолжить;
		КонецЕсли;
		
		Если      СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись Тогда
			МассивОтчетаHTML.Добавить("<tr class=""new_record"">");
		ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_ЗаписьУдалена Тогда
			МассивОтчетаHTML.Добавить("<tr class=""del_record"">");
		Иначе
			МассивОтчетаHTML.Добавить("<tr>");
		КонецЕсли;
		
		Если      СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись Тогда
			ВариантРасхождения = "НОВ";
		ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_ЗаписьУдалена Тогда
			ВариантРасхождения = "УДЛ";
		ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_ЗаписьИзменена Тогда
			ВариантРасхождения = "ИЗМ";
		Иначе
			ВариантРасхождения = "";
		КонецЕсли;
		МассивОтчетаHTML.Добавить("<td>" + ВариантРасхождения + "</td>");
		
		// Ключевые поля
		Для Каждого Поле Из КлючевыеПоля Цикл
			МассивОтчетаHTML.Добавить("<td>" + СтрокаРасхождения[Поле] + "</td>");
		КонецЦикла;
		
		// Сравниваемые поля
		Для НомПоля = 1 По СравниваемыеПоля.Количество() Цикл
			Если (НомПоля - 1) % КолСравниваемыхПолейВЯчейке = 0 Тогда
				МассивОтчетаHTML.Добавить("<td>");
			Иначе
				МассивОтчетаHTML.Добавить("<br>");
			КонецЕсли;
			
			Поле = СравниваемыеПоля[НомПоля - 1];
			
			Если      СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_НетРасхождений Тогда
				МассивОтчетаHTML.Добавить(Поле + ": [" + СтрокаРасхождения["_Тек_" + Поле] + "]");
			ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись Тогда
				МассивОтчетаHTML.Добавить(Поле + ": [" + СтрокаРасхождения["_Нов_" + Поле] + "]");
			ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_ЗаписьУдалена Тогда
				МассивОтчетаHTML.Добавить(Поле + ": [" + СтрокаРасхождения["_Тек_" + Поле] + "]");
			ИначеЕсли СтрокаРасхождения.ВариантРасхождения = мТипыЗаписейВОтчетеОРасхождениях_ЗаписьИзменена Тогда
				Если СтрокаРасхождения["_Тек_" + Поле] = СтрокаРасхождения["_Нов_" + Поле] Тогда
					МассивОтчетаHTML.Добавить("<div class=""eq_values"">" + Поле + ": [" + СтрокаРасхождения["_Тек_" + Поле] + "]</div>");
				Иначе
					МассивОтчетаHTML.Добавить("<div class=""nq_values"">" + Поле + ": [" + СтрокаРасхождения["_Тек_" + Поле] + "] -> ["
						+ СтрокаРасхождения["_Нов_" + Поле] + "]</div>");
				КонецЕсли;
			КонецЕсли;
			
			Если НомПоля % КолСравниваемыхПолейВЯчейке = 0 Тогда
				МассивОтчетаHTML.Добавить("</td>");
			КонецЕсли;
		КонецЦикла;
		
		Если (НомПоля - 1) % КолСравниваемыхПолейВЯчейке > 0 Тогда
			МассивОтчетаHTML.Добавить("</td>");
		КонецЕсли;
		
		МассивОтчетаHTML.Добавить("</tr>");
	КонецЦикла;
	
	МассивОтчетаHTML.Добавить("</table>");
	
	Возврат СтрСоединить(МассивОтчетаHTML, "");
	
КонецФункции // ПодготовитьОтчетОРасхождениях

Функция ПолучитьКупоныПриходящиесяНаПоследнийНерабочийДеньМесяцаИзExternals(КодыЦенныхБумагНаММВБ)
	Купоны = Новый ТаблицаЗначений;
	Купоны.Колонки.Добавить("TRADEDATE",	Новый ОписаниеТипов("Дата"));
	Купоны.Колонки.Добавить("SECURITYID",	Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
	Купоны.Колонки.Добавить("ACCINT",		Метаданные.РегистрыСведений.КотировкиЦенныхБумаг.Ресурсы.ACCINT.Тип); // !!! При удалении регистра нужно будет изменить строку
	
	Если ПустаяСтрока(КодыЦенныхБумагНаММВБ) Тогда
		Возврат Купоны;
	КонецЕсли;
	
	ТипыКолонок = Новый Структура;
	
	Для Каждого Колонка Из Купоны.Колонки Цикл
		ТипыКолонок.Вставить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	// Получим купоны с сервера
	СтрокаСоединенияССерверомSQL = РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	ТекстЗапросаSQL =
		"SELECT
		|	CAST(TradeDate AS DATETIME) AS TradeDate,
		|	SecurityId AS SecurityId,
		|	CASE WHEN TradeDate < '20210731' THEN CAST(Accint as decimal(19, 4)) ELSE CAST(Accint as decimal(&Length, &Decimal)) END AS Accint
		|FROM
		|	[Externals].[dbo].[Non_Trade_End_Month_Acc_Int]
		|WHERE
		|	TradeDate BETWEEN &BeginDate AND &EndDate
		|	AND NOT Accint IS NULL
		|	AND SecurityID IN (&Securities)";
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&BeginDate",	"'" + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=yyyyMMdd") + "'");
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&EndDate",		"'" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyyMMdd") + "'");
	// С 31.07.2021 точность котировки купона повысили до 6 знаков, до этого была 4
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Length",		Купоны.Колонки.ACCINT.ТипЗначения.КвалификаторыЧисла.Разрядность);
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Decimal",		Купоны.Колонки.ACCINT.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти);
	ТекстЗапросаSQL = СтрЗаменить(ТекстЗапросаSQL, "&Securities",	КодыЦенныхБумагНаММВБ);
	
	Купоны = ПолучитьТаблицуДанныхССервераSQL(СтрокаСоединенияССерверомSQL, ТекстЗапросаSQL, ТипыКолонок);
	Если Купоны = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Десериализуем и поместим в таблицу
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Купоны.TradeDate КАК TradeDate,
		|	Купоны.SecurityId КАК SecurityId,
		|	Купоны.Accint КАК Accint
		|ПОМЕСТИТЬ _Купоны
		|ИЗ
		|	&Купоны КАК Купоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Купоны.TradeDate КАК Период,
		|	&Биржа КАК Биржа,
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации) КАК Рынок,
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.Облигации).ВалютаНоминала КАК Валюта,
		|	ЗНАЧЕНИЕ(Справочник.РежимыБиржевыхТоргов.) КАК РежимТоргов,
		|	_Купоны.Accint КАК ACCINT,
		|	&ПрочиеРесурсы КАК ПрочиеРесурсы
		|ИЗ
		|	_Купоны КАК _Купоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _Купоны.SecurityId = КодыВТорговыхСистемахСрезПоследних.Код";
	Запрос.УстановитьПараметр("Купоны", Купоны);
	Запрос.УстановитьПараметр("Период", НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Биржа",  мБиржаММВБ);
	
	// Чтобы не валились расхождения при сверке полей со значениями НЕОПРЕДЕЛЕНО И 0 (ноль),
	//	заполним недостающие поля нулевыми значениями
	ПрочиеРесурсы = "";
	Для Каждого РесурсМД Из Метаданные.РегистрыСведений.КотировкиЦенныхБумаг.Ресурсы Цикл
		Если РесурсМД.Имя <> "ACCINT" И РесурсМД.Имя <> "Валюта" Тогда
			ПрочиеРесурсы = ПрочиеРесурсы + ?(ПустаяСтрока(ПрочиеРесурсы), "", "," + Символы.ПС + Символы.Таб) + " 0 КАК " + РесурсМД.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПрочиеРесурсы КАК ПрочиеРесурсы", ПрочиеРесурсы);
	Купоны = Запрос.Выполнить().Выгрузить();
	ВыполнитьКорректировкуКупона(Купоны);
	Возврат Купоны;
КонецФункции

Функция РассчитатьКотировкиЦенныхБумаг(КотировкиТорговыхПлощадок, КодыФинансовыхИнструментов)
	
	КотировкиЦенныхБумаг = КотировкиТорговыхПлощадок.СкопироватьКолонки();
	
	// правила расчета:
	//  1. исключаем исключаемые режимы торгов
	//  2. все режимы торгов, не относящиеся к исключаемым и дополнительным, называем основными
	//	3. если остался один основной режим торгов - берем его
	//  4. если основных режимов торгов нет, но остался один дополнительный - берем его
	//  5. если основных или дополнительных (при отсутствии основных) режимов торгов большего одного
	//     - это ошибка (неоднозначный режим торгов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КотировкиТорговыхПлощадок.*
		|ПОМЕСТИТЬ _КотировкиТорговыхПлощадок
		|ИЗ
		|	&КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсключаемыеРежимыТоргов.Код КАК Код
		|ПОМЕСТИТЬ _ИсключаемыеРежимыТоргов
		|ИЗ
		|	&ИсключаемыеРежимыТоргов КАК ИсключаемыеРежимыТоргов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеРежимыТоргов.Код КАК Код
		|ПОМЕСТИТЬ _ДополнительныеРежимыТоргов
		|ИЗ
		|	&ДополнительныеРежимыТоргов КАК ДополнительныеРежимыТоргов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КотировкиТорговыхПлощадок.*,
		|	ВЫБОР
		|		КОГДА _ДополнительныеРежимыТоргов.Код ЕСТЬ NULL
		|				И _ИсключаемыеРежимыТоргов.Код ЕСТЬ NULL
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОсновнойРежим,
		|	ВЫБОР
		|		КОГДА _ДополнительныеРежимыТоргов.Код ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДополнительныйРежим,
		|	ВЫБОР
		|		КОГДА _ИсключаемыеРежимыТоргов.Код ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИсключаемыйРежим
		|ИЗ
		|	_КотировкиТорговыхПлощадок КАК _КотировкиТорговыхПлощадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДополнительныеРежимыТоргов КАК _ДополнительныеРежимыТоргов
		|		ПО _КотировкиТорговыхПлощадок.BOARDID = _ДополнительныеРежимыТоргов.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИсключаемыеРежимыТоргов КАК _ИсключаемыеРежимыТоргов
		|		ПО _КотировкиТорговыхПлощадок.BOARDID = _ИсключаемыеРежимыТоргов.Код
		|ГДЕ
		|	_ИсключаемыеРежимыТоргов.Код ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновнойРежим УБЫВ
		|ИТОГИ
		|	СУММА(ОсновнойРежим),
		|	СУММА(ДополнительныйРежим)
		|ПО
		|	Период,
		|	ЦеннаяБумага";
	
	Запрос.УстановитьПараметр("КотировкиТорговыхПлощадок",  КотировкиТорговыхПлощадок);
	Запрос.УстановитьПараметр("ИсключаемыеРежимыТоргов",    ЭтотОбъект.ИсключаемыеРежимыТоргов);
	Запрос.УстановитьПараметр("ДополнительныеРежимыТоргов", ЭтотОбъект.ДополнительныеРежимыТоргов);
	
	Ошибки = Новый Массив;
	
	ВыборкаПериоды = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериоды.Следующий() Цикл
		
		ВыборкаЦенныеБумаги = ВыборкаПериоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаЦенныеБумаги.Следующий() Цикл
			
			Если ВыборкаЦенныеБумаги.ОсновнойРежим = 0 И ВыборкаЦенныеБумаги.ДополнительныйРежим = 0 Тогда
				//данная ситуация ошибкой не является - ну не пришло нормальных режимов торгов, значит просто не судьба
				//Ошибки.Добавить("Не удалось рассчитать котировку ценной бумаги '" + ВыборкаЦенныеБумаги.ЦеннаяБумага + "'");
				Продолжить;
				
			ИначеЕсли ВыборкаЦенныеБумаги.ОсновнойРежим > 1 Тогда
				Ошибки.Добавить("Не удалось однозначно определить котировку ценной бумаги '" + ВыборкаЦенныеБумаги.ЦеннаяБумага
					+ "'. Присутствует несколько основных режимов торгов (" + РежимыТорговВСтроку(ВыборкаЦенныеБумаги)
					+ ") за " + Формат(ВыборкаПериоды.Период, "ДФ=dd.MM.yyyy"));
				Продолжить;
				
			ИначеЕсли ВыборкаЦенныеБумаги.ОсновнойРежим = 0 И ВыборкаЦенныеБумаги.ДополнительныйРежим > 1 Тогда
				Ошибки.Добавить("Не удалось однозначно определить котировку ценной бумаги '" + ВыборкаЦенныеБумаги.ЦеннаяБумага
					+ "'. Присутствует несколько дополнительных режимов торгов (" + РежимыТорговВСтроку(ВыборкаЦенныеБумаги)
					+ ") при отсутствии основных за " + Формат(ВыборкаПериоды.Период, "ДФ=dd.MM.yyyy"));
				Продолжить;
				
			КонецЕсли;
			
			Выборка = ВыборкаЦенныеБумаги.Выбрать();
			Выборка.Следующий(); // т.к. отсортированы по основному режиму по убыванию, то если он есть, то будет первым
			
			ЗаполнитьЗначенияСвойств(КотировкиЦенныхБумаг.Добавить(), Выборка);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		ЗарегистрироватьОшибку(СтрСоединить(Ошибки, Символы.ПС));
		// раньше наличие хотя бы одной нерассчитанной котировки ц/б исключало загрузку всех котировок,
		// с недавних это отключили
		//Возврат Неопределено;
	КонецЕсли;
	
#Область КупоныНеторговыхКонцовМесяцев

	Если ЗначениеЗаполнено(КодыФинансовыхИнструментов.ЦенныеБумаги) Тогда

		Купоны = ПолучитьКупоныПриходящиесяНаПоследнийНерабочийДеньМесяцаИзExternals(КодыФинансовыхИнструментов.ЦенныеБумаги);
		
		Если ЗначениеЗаполнено(Купоны) Тогда
			Для каждого СтрокаКупоны Из Купоны Цикл
				ЗаполнитьЗначенияСвойств(КотировкиЦенныхБумаг.Добавить(), СтрокаКупоны);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
#КонецОбласти

	// т.к. котировки ценных бумаг содержат наиболее полный список, проверим полноту заполениня здесь
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) Тогда // по одной ц/б котировок может и не быть
		ПроверитьНаличиеКотировокНаДаты(КотировкиЦенныхБумаг);
	КонецЕсли;

	Возврат КотировкиЦенныхБумаг;
	
КонецФункции // РассчитатьКотировкиЦенныхБумаг

Функция ПроверитьНаличиеКотировокНаДаты(Котировки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Котировки.Период КАК Период
		|ПОМЕСТИТЬ _ПериодыКотировок
		|ИЗ
		|	&Котировки КАК Котировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ОжидаемыеПериоды
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = &Календарь
		|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеКалендаря.Дата
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = &Календарь
		|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ДанныеКалендаря.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ), ДЕНЬ)
		|	И НЕ ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОжидаемыеПериоды.Дата КАК Дата
		|ИЗ
		|	_ОжидаемыеПериоды КАК _ОжидаемыеПериоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыКотировок КАК _ПериодыКотировок
		|		ПО _ОжидаемыеПериоды.Дата = _ПериодыКотировок.Период
		|ГДЕ
		|	_ПериодыКотировок.Период ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Котировки",     Котировки);
	Запрос.УстановитьПараметр("Календарь",     Константы.ОсновнойКалендарьКотировок.Получить());
	Запрос.УстановитьПараметр("ДатаНачала",    ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЭтотОбъект.Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстОшибки = "";
	
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", ", ") + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ЗарегистрироватьОшибку("Отсутствуют котировки за: " + ТекстОшибки);
	КонецЕсли;
	
	Возврат Не ПустаяСтрока(ТекстОшибки);
	
КонецФункции // ПроверитьНаличиеКотировокНаДаты

////////////////////////////////////////////////////////////////////////////////

мБиржаММВБ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");

мТипыЗаписейВОтчетеОРасхождениях_НетРасхождений = 0;
мТипыЗаписейВОтчетеОРасхождениях_НоваяЗапись    = 1;
мТипыЗаписейВОтчетеОРасхождениях_ЗаписьУдалена  = 2;
мТипыЗаписейВОтчетеОРасхождениях_ЗаписьИзменена = 3;

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
