&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если НЕ Диалог.Выбрать() Тогда 
		Возврат;
	КонецЕсли;
	
	МассивФайлов = ПолучитьМассивФайлов(ПараметрКоманды);
	
	Если МассивФайлов.Количество() > 1 Тогда
		Если Вопрос(СтрШаблон("Будет сохранено %1. Продолжить?", ЧислоПрописью(МассивФайлов.Количество(),, "файл, файла, файлов, с,,,,, 0" )), РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Каталог = Диалог.Каталог + "\";
	Версия = 0;
	
	Для Каждого Файл Из МассивФайлов Цикл
		Если ЗначениеЗаполнено(Файл.Данные) Тогда
			
			ЧастиИмениФайла = Новый Массив;
			ПолноеИмяФайла	= Каталог + Файл.ИмяФайла;
			
			ПроверяемыйФайл = Новый Файл(ПолноеИмяФайла);
			Пока ПроверяемыйФайл.Существует() Цикл
				Версия = Версия + 1;
				
				ЧастиИмениФайла = СтрРазделить(ПолноеИмяФайла, ".");
				ЧастиИмениФайла.Вставить(ЧастиИмениФайла.ВГраница(), " ver." + Строка(Версия));
				
				ПроверяемыйФайл = Новый Файл(СтрСоединить(ЧастиИмениФайла, "."));
			КонецЦикла;
			
			Если ЧастиИмениФайла.Количество() Тогда
				ПолноеИмяФайла = СтрСоединить(ЧастиИмениФайла, ".");
			КонецЕсли;
			
			Файл.Данные.Записать(ПолноеИмяФайла);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Файл %1 сохранён.", ПолноеИмяФайла));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Файл %1 повреждён или отсутствуют данные. Сохранение файла невозможно.", Файл.ИмяФайла));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивФайлов(ПараметрКоманды)
	
	МассивФайлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	dbo_Files.File_Name КАК ИмяФайла,
		|	dbo_Files.File_Data КАК Данные
		|ИЗ
		|	ВнешнийИсточникДанных.Externals.Таблица.dbo_Files КАК dbo_Files
		|ГДЕ
		|	dbo_Files.Ссылка В(&ПараметрКоманды)";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяФайла = Выборка.ИмяФайла;
		
		Если Найти(ИмяФайла, "/") > 0 Тогда
			ЧастиИмениФайла = СтрРазделить(ИмяФайла, "/");
			ИмяФайла = ЧастиИмениФайла[ЧастиИмениФайла.Количество() - 1];
		КонецЕсли;
		
		ИмяФайла = РаботаСФайламиКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
		
		Файл = Новый Структура("ИмяФайла,Данные", ИмяФайла, Выборка.Данные);
		МассивФайлов.Добавить(Файл);
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции