
Функция ТребуетсяДетализацияПоРасчетномуСчету(ДанныеДокумента, ИмяРеквизитаСБрокером = "Брокер") Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента[ИмяРеквизитаСБрокером]) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаБэкОфисаСрезПоследних.ДетализацияПоРасчетномуСчету
		|ИЗ
		|	РегистрСведений.НастройкиУчетаБэкОфиса.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК НастройкиУчетаБэкОфисаСрезПоследних";
		
	Запрос.УстановитьПараметр("Период",      ДанныеДокумента.Дата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("Брокер",      ДанныеДокумента[ИмяРеквизитаСБрокером]);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДетализацияПоРасчетномуСчету;
	Иначе
		Возврат Истина; // по-умолчанию требуется детализация
	КонецЕсли;
	
КонецФункции // ТребуетсяДетализацияПоРасчетномуСчету

Функция ПолучитьНастройкиОтраженияКомиссий(ДанныеДокумента, ИмяРеквизитаСБрокером = "Брокер") Экспорт
	
	Результат = Новый Структура("СписаниеТорговойКомиссииПриИсполнении, СписаниеКомиссииБрокераПриИсполнении", Ложь, Ложь);
	Если Не ЗначениеЗаполнено(ДанныеДокумента[ИмяРеквизитаСБрокером]) Тогда
		Возврат Результат;
	КонецЕсли; 
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаБэкОфисаСрезПоследних.СписаниеТорговойКомиссииПриИсполненииОтложеннойСделки КАК СписаниеТорговойКомиссииПриИсполнении,
		|	НастройкиУчетаБэкОфисаСрезПоследних.СписаниеКомиссииБрокераПриИсполненииОтложеннойСделки КАК СписаниеКомиссииБрокераПриИсполнении
		|ИЗ
		|	РегистрСведений.НастройкиУчетаБэкОфиса.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК НастройкиУчетаБэкОфисаСрезПоследних";
		
	Запрос.УстановитьПараметр("Период",      ДанныеДокумента.Дата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("Брокер",      ДанныеДокумента[ИмяРеквизитаСБрокером]);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции // ПолучитьНастройкиОтраженияКомиссий

Функция ОтложенноеИсполнениеСделки(Сделка) Экспорт
	
	Возврат ТипЗнч(Сделка) = Тип("ДокументСсылка.Сделка") и Сделка.ОтложенноеИсполнение;
	
КонецФункции

Функция ОтложенноеОтражениеКомиссий(НастройкиОтраженияКомиссий, Сделка, ВидЗадолженности) Экспорт
	
	Если ОтложенноеИсполнениеСделки(Сделка) Тогда
	
			Возврат ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии
				 	И НастройкиОтраженияКомиссий.СписаниеКомиссииБрокераПриИсполнении
				 или
				 	ВидЗадолженности = Справочники.ВидыЗадолженности.ПоТорговойКомиссии
				 	И НастройкиОтраженияКомиссий.СписаниеТорговойКомиссииПриИсполнении;
				
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции // ОтложенноеОтражениеКомиссий

Процедура ПроверитьЗаполнениеРасчетногоСчета(ДанныеДокумента, Отказ = Неопределено) Экспорт
	
	РасчетныйСчетЗаполнен = ЗначениеЗаполнено(ДанныеДокумента.РасчетныйСчет);
	
	Если РасчетныйСчетЗаполнен <> ТребуетсяДетализацияПоРасчетномуСчету(ДанныеДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(РасчетныйСчетЗаполнен, "Заполнение р/счета не требуется.", "Требуется заполнение р/счета."),
			ДанныеДокумента, "РасчетныйСчет",, Отказ);
	КонецЕсли;
		
	Если Не Отказ И РасчетныйСчетЗаполнен Тогда
		
		Если ТипЗнч(ДанныеДокумента) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") Тогда
			ИмяРеквизита = "ВалютаСделки";
		Иначе
			ИмяРеквизита = "ВалютаОплаты";
		КонецЕсли;
		
		Если ДанныеДокумента.РасчетныйСчет.Валюта <> ДанныеДокумента[ИмяРеквизита] Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта оплаты (" + ДанныеДокумента[ИмяРеквизита] + ") не соответствует валюте расчетного счета (" + ДанныеДокумента.РасчетныйСчет.Валюта + ").",
				ДанныеДокумента, ИмяРеквизита,, Отказ);
		КонецЕсли;
			
		Если ТипЗнч(ДанныеДокумента) = Тип("ДокументОбъект.СделкаРЕПО") И ДанныеДокумента.ЧастьСделкиРЕПО < 2
			И ДанныеДокумента.РасчетныйСчет.Валюта <> ДанныеДокумента.ВалютаОплатыВторойЧасти Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта оплаты второй части (" + ДанныеДокумента.ВалютаОплатыВторойЧасти + ") не соответствует валюте расчетного счета (" + ДанныеДокумента.РасчетныйСчет.Валюта + ").",
				ДанныеДокумента, "ВалютаОплатыВторойЧасти",, Отказ);
				
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьРынокЦенныхБумаг(ДанныеДокумента, Отказ) Экспорт
	
	ТипДокумента = ТипЗнч(ДанныеДокумента.Ссылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.ВводЦенныхБумаг") Или ТипДокумента = Тип("ДокументСсылка.ВыводЦенныхБумаг")
		Или ТипДокумента = Тип("ДокументСсылка.ПереводЦенныхБумаг") Или ТипДокумента = Тип("ДокументСсылка.СделкаРЕПО")
		Или ТипДокумента = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Или ТипДокумента = Тип("ДокументСсылка.ПоставкаЦенныхБумаг")
	Тогда
	
		Если ДанныеДокумента.Рынок = Перечисления.РынкиЦенныхБумаг.Закладные Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На текущий момент допускается только покупка закладных", ДанныеДокумента, "Рынок",, Отказ);
			Возврат Ложь;
		КонецЕсли;
	
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.Сделка") Тогда
	
		Если ДанныеДокумента.Рынок = Перечисления.РынкиЦенныхБумаг.Закладные
			И ДанныеДокумента.ВидСделки = Перечисления.ВидыСделок.Продажа
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На текущий момент допускается только покупка закладных", ДанныеДокумента, "Рынок",, Отказ);
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьМинимальнуюСуммуЗачисленияПИФ(ПаевойИнвестиционныйФонд, Период = Неопределено) Экспорт
	
	МинимальныеСуммыЗачисления = РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(
		?(Период = Неопределено, ТекущаяДатаСеанса(), Период),
		Новый Структура("ПаевойИнвестиционныйФонд", ПаевойИнвестиционныйФонд));
		
	Возврат ?(МинимальныеСуммыЗачисления.Количество() > 0, МинимальныеСуммыЗачисления[0].МинимальнаяСуммаЗачисления, Неопределено);
	
КонецФункции // КлиентДоверительногоУправления

Функция ПроверитьУникальностьНомераСделки(ДанныеДокумента, Отказ = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.НомерСделки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Сделка.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	НЕ Сделка.ПометкаУдаления
		|	И Сделка.Организация = &Организация
		|	И Сделка.ВидСделки = &ВидСделки
		|	И Сделка.НомерСделки = &НомерСделки
		|	И Сделка.Ссылка <> &Ссылка";
	
	Если ТипЗнч(ДанныеДокумента) = Тип("ДокументОбъект.СделкаРЕПО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделка", "СделкаРЕПО");
	ИначеЕсли ТипЗнч(ДанныеДокумента) = Тип("ДокументОбъект.СделкаСВалютой") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделка", "СделкаСВалютой");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСделки",   ДанныеДокумента.ВидСделки);
	Запрос.УстановитьПараметр("НомерСделки", ДанныеДокумента.НомерСделки);
	Запрос.УстановитьПараметр("Ссылка",      ДанныеДокумента.Ссылка);
	
	// группировка по организации также нужна, т.к. одна сделка может быть
	// отражена и у УК, и у СпецДепа
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номер сделки '" + ДанныеДокумента.НомерСделки + "' не уникален", ДанныеДокумента, "НомерСделки",, Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

#Область Акцептование_Операций

Функция ДокументАкцептован(ДокументСсылка, Организация) Экспорт
	
	Возврат ЗначениеЗаполнено(ПолучитьДатуАкцептования(ДокументСсылка, Организация));
	
КонецФункции

Функция ПолучитьДатуАкцептования(ДокументСсылка, Организация = Неопределено) Экспорт
		
	Если Не Метаданные.РегистрыСведений["АкцептованиеОпераций"].Измерения.Операция.Тип.СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АкцептованиеОпераций.Период КАК ДатаАкцепта
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций КАК АкцептованиеОпераций
		|ГДЕ
		|	АкцептованиеОпераций.Операция = &ДокументСсылка
		|	И АкцептованиеОпераций.Организация = &Организация
		|	И АкцептованиеОпераций.Активность";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
			
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаАкцепта;	
	КонецЕсли;
				
КонецФункции

Функция АкцептованныйДокументМожноЗаписать(ДанныеДокумента, Отказ = Неопределено) Экспорт
	
	Если РаботаСДокументами.ДокументАкцептован(ДанныеДокумента.Ссылка, ДанныеДокумента.Организация) Тогда
		Если РаботаСДокументами.ИзмененыРеквизитыШапкиДокумента(ДанныеДокумента, РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейШапкиДокумента(ДанныеДокумента.Метаданные().Имя), "Номер", Истина) Тогда
			// Пока ничего не сообщаем. Нужно переделать на интерактивную проверку с вопросом
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Изменен акцептованный документ", ДанныеДокумента,,,);		
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя изменять акцептованный документ!", ДанныеДокумента,,, Отказ);		
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Истина;
		
КонецФункции //АкцептованныйДокументМожноЗаписать

Процедура ИзменитьВремяДокументаСУчетомАкцептования(Документ, ДатаПодтверждения) Экспорт 
		
	Если НачалоДня(Документ.Дата) = НачалоДня(ДатаПодтверждения) Тогда

		Если Документ.Дата <= ДатаПодтверждения Тогда
			
			// Проблема: время документа изменяется, при этом время проводок (БУ, НУ, ЕПС) остается прежним
			// Отключаем автоматическое изменение времени в закрытом периоде, а также ранее последнего рабочего дня
			Если ЗапретРедактированияДокумента(Документ.Ссылка, Документ, Ложь, Ложь)  Тогда			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время документа раньше времени акцепта, и период закрыт. Необходимо обратиться к программистам.", Документ);				
			ИначеЕсли  НачалоДня(Документ.Дата) < Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2)	Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время документа раньше времени акцепта, а дата раньше последней даты проведения регламентных операций. Необходимо обратиться к программистам.", Документ);
			ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.Распоряжение") Тогда // для распоряжений так и должно быть -> (дата распоряжения <= дата акцепта)
				Возврат;
			Иначе
				
				Генератор = Новый ГенераторСлучайныхЧисел(Число(ТекущаяДата() - Дата(1, 1, 1)));
				
				ДокументОбъект = Документ.ПолучитьОбъект();
						
				ДокументОбъект.Дата = ДатаПодтверждения + Генератор.СлучайноеЧисло(20, 24) * 60 + Генератор.СлучайноеЧисло(0, 59);
				
				Если ДокументОбъект.Проведен Тогда
					// Пока так, чтобы движения гарантированно очистились и сформировались заново
					ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);				
				Иначе
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли НачалоДня(Документ.Дата) < НачалоДня(ДатаПодтверждения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа раньше даты акцепта, необходимо обратиться к программистам.", Документ);
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуетсяАкцептованиеДокумента(ДокументСсылка, Организация, СчетДоверительногоУправления, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда 
		
		РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Брокер, БрокерПолучатель");
		//интересуют только поручения на выводы со счетов брокера	
		Если ЗначениеЗаполнено(РеквизитыПоручения.БрокерПолучатель) Или Не ЗначениеЗаполнено(РеквизитыПоручения.Брокер) Тогда
			Возврат Ложь;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
	#Область Текст_Запроса 
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокПоручение.Дата КАК Дата,
			|	ДокПоручение.Ссылка КАК Ссылка,
			|	ДокПоручение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ДокПоручение.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ) КАК ЭтоФогф,
			|	ДокПоручение.Брокер КАК Брокер,
			|	ДокПоручение.Брокер.ЮрФизЛицо КАК БрокерЮрЛицо,
			|	ДокПоручение.РасчетныйСчетПолучатель.Банк.ЮрФизЛицо КАК БанкЮрЛицо,
			|	ЕСТЬNULL(СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.ОжидаетАкцепта) КАК ТребуетсяАкцепт
			|ПОМЕСТИТЬ ДанныеПоручения
			|ИЗ
			|	Документ.ПоручениеНаПереводДенежныхСредств КАК ДокПоручение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАкцептованияОпераций.СрезПоследних(
			|				&Дата,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный)) КАК НастройкиАкцептованияОперацийСрезПоследних
			|		ПО ДокПоручение.СчетДоверительногоУправления = НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления
			|			И (ДокПоручение.Организация = &Организация)
			|			И (ДокПоручение.Ссылка = &Поручение)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств.СрезПоследних(&Дата, ) КАК СтатусыПорученийНаПереводДенежныхСредствСрезПоследних
			|		ПО ДокПоручение.Ссылка = СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств
			|ГДЕ
			|	НастройкиАкцептованияОперацийСрезПоследних.ТребуетсяАкцептование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АкцептованиеОперацийСрезПоследних.Период КАК Период,
			|	АкцептованиеОперацийСрезПоследних.Операция КАК Операция,
			|	АкцептованиеОперацийСрезПоследних.Срок КАК Срок,
			|	ТИПЗНАЧЕНИЯ(АкцептованиеОперацийСрезПоследних.Операция) В (ТИП(Справочник.ДоговорыБрокерскогоОбслуживания), ТИП(Справочник.Договоры)) КАК АкцептНаДоговор
			|ПОМЕСТИТЬ _АкцептованиеОпераций
			|ИЗ
			|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И Операция В
			|					(ВЫБРАТЬ
			|						ДанныеПоручения.Ссылка КАК Операция
			|					ИЗ
			|						ДанныеПоручения КАК ДанныеПоручения
			|			
			|					ОБЪЕДИНИТЬ
			|			
			|					ВЫБРАТЬ
			|						КодыСчетов.ДоговорБрокерскогоОбслуживания
			|					ИЗ
			|						РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&Дата, Организация = &Организация
			|							И (СчетДоверительногоУправления, Брокер) В
			|								(ВЫБРАТЬ
			|									ДанныеПоручения.СчетДоверительногоУправления,
			|									ДанныеПоручения.Брокер
			|								ИЗ
			|									ДанныеПоручения КАК ДанныеПоручения)) КАК КодыСчетов)
			|				И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный)) КАК АкцептованиеОперацийСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.ЮрЛицо КАК ЮрЛицо,
			|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо КАК Ссылка
			|ПОМЕСТИТЬ _ГоловныеОрганизации
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ДанныеПоручения.БрокерЮрЛицо КАК ЮрЛицо
			|	ИЗ
			|		ДанныеПоручения КАК ДанныеПоручения
			|	ГДЕ
			|		НЕ ДанныеПоручения.ТребуетсяАкцепт
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ДанныеПоручения.БанкЮрЛицо
			|	ИЗ
			|		ДанныеПоручения КАК ДанныеПоручения
			|	ГДЕ
			|		НЕ ДанныеПоручения.ТребуетсяАкцепт) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
			|		ПО ВложенныйЗапрос.ЮрЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
			|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА &Дата >= &ДатаНачалаКонтроляАкцептов
			|			ТОГДА ВЫБОР
			|					КОГДА ДанныеПоручения.ТребуетсяАкцепт
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ДлинныйАкцепт.Операция ЕСТЬ NULL
			|								ТОГДА КороткийАкцепт.Операция ЕСТЬ NULL
			|							ИНАЧЕ ВЫБОР
			|									КОГДА ДанныеПоручения.ЭтоФогф
			|										ТОГДА ЛОЖЬ
			|									ИНАЧЕ ЕСТЬNULL(_БрокерГоловнаяОрганизация.Ссылка, _БрокерГоловнаяОрганизация.ЮрЛицо) <> ЕСТЬNULL(_БанкГоловнаяОрганизация.Ссылка, _БанкГоловнаяОрганизация.ЮрЛицо)
			|								КОНЕЦ
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ КороткийАкцепт.Операция ЕСТЬ NULL
			|	КОНЕЦ КАК ТребуетсяАкцепт
			|ИЗ
			|	ДанныеПоручения КАК ДанныеПоручения
			|		ЛЕВОЕ СОЕДИНЕНИЕ _АкцептованиеОпераций КАК КороткийАкцепт
			|		ПО ДанныеПоручения.Ссылка = КороткийАкцепт.Операция
			|		ЛЕВОЕ СОЕДИНЕНИЕ _АкцептованиеОпераций КАК ДлинныйАкцепт
			|		ПО (ДлинныйАкцепт.АкцептНаДоговор)
			|			И ДанныеПоручения.Дата >= ДлинныйАкцепт.Период
			|			И (ДлинныйАкцепт.Срок = ДАТАВРЕМЯ(1, 1, 1)
			|				ИЛИ ДанныеПоручения.Дата < ДлинныйАкцепт.Срок)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ГоловныеОрганизации КАК _БрокерГоловнаяОрганизация
			|		ПО ДанныеПоручения.БрокерЮрЛицо = _БрокерГоловнаяОрганизация.ЮрЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ГоловныеОрганизации КАК _БанкГоловнаяОрганизация
			|		ПО ДанныеПоручения.БанкЮрЛицо = _БанкГоловнаяОрганизация.ЮрЛицо";
	#КонецОбласти
		
		Запрос.УстановитьПараметр("ДатаНачалаКонтроляАкцептов", РаботаСДокументами.ДатаНачалаКонтроляАкцептов());
		Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Поручение" , ДокументСсылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
			
		Возврат (Выборка.Следующий() И Выборка.ТребуетсяАкцепт);
	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Распоряжение") Тогда  
		
		Запрос = Новый Запрос;
		
	#Область Текст_Запроса
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкиАкцептованияОперацийСрезПоследних.Организация КАК Организация,
			|	НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НастройкиАкцептованияОперацийСрезПоследних.ВидАкцепта КАК ВидАкцепта,
			|	ДокРаспоряжение.Ссылка КАК Распоряжение,
			|	ДокРаспоряжение.РасчетныйСчет КАК РасчетныйСчет
			|ПОМЕСТИТЬ _НастройкиАкцептования
			|ИЗ
			|	РегистрСведений.НастройкиАкцептованияОпераций.СрезПоследних(
			|			&Дата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидАкцепта В (ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНО), ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНОСрочный30Дней4ПроцентаУКПИ))) КАК НастройкиАкцептованияОперацийСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Распоряжение КАК ДокРаспоряжение
			|		ПО (ДокРаспоряжение.Организация = НастройкиАкцептованияОперацийСрезПоследних.Организация)
			|			И (ДокРаспоряжение.СчетДоверительногоУправления = НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления)
			|			И (ДокРаспоряжение.Ссылка = &Распоряжение)
			|ГДЕ
			|	НастройкиАкцептованияОперацийСрезПоследних.ТребуетсяАкцептование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АкцептованиеОперацийСрезПоследних.Операция ЕСТЬ NULL
			|		ИЛИ АкцептованиеОперацийСрезПоследних.Срок <> ДАТАВРЕМЯ(1, 1, 1)
			|			И АкцептованиеОперацийСрезПоследних.Срок <= &Дата КАК ТребуетсяАкцепт
			|ИЗ
			|	_НастройкиАкцептования КАК _НастройкиАкцептования
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцептованиеОпераций.СрезПоследних(
			|				&Дата,
			|				(Организация, ВидАкцепта) В
			|						(ВЫБРАТЬ
			|							_НастройкиАкцептования.Организация,
			|							_НастройкиАкцептования.ВидАкцепта
			|						ИЗ
			|							_НастройкиАкцептования КАК _НастройкиАкцептования)
			|					И Операция В
			|						(ВЫБРАТЬ
			|							_НастройкиАкцептования.Распоряжение
			|						ИЗ
			|							_НастройкиАкцептования КАК _НастройкиАкцептования
			|				
			|						ОБЪЕДИНИТЬ
			|				
			|						ВЫБРАТЬ
			|							_НастройкиАкцептования.РасчетныйСчет
			|						ИЗ
			|							_НастройкиАкцептования КАК _НастройкиАкцептования)) КАК АкцептованиеОперацийСрезПоследних
			|		ПО _НастройкиАкцептования.Организация = АкцептованиеОперацийСрезПоследних.Организация
			|			И _НастройкиАкцептования.ВидАкцепта = АкцептованиеОперацийСрезПоследних.ВидАкцепта";
	#КонецОбласти
		
		Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Распоряжение" , ДокументСсылка);

		Выборка = Запрос.Выполнить().Выбрать();
			
		Возврат (Выборка.Следующий() И Выборка.ТребуетсяАкцепт);
	
	КонецЕсли;
		
КонецФункции

// Проверяет, согласовано ли поручение на вывод активов
//
//	Параметры:
//		- ДокументСсылка - ПоручениеНаДвижениеДенежныхСредств, ПоручениеНаДвижениеЦенныхБумаг
//		- Дата - Дата проверки
//
Функция ПоручениеНаВыводАктивовСогласовано(ДокументСсылка, Дата) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АкцептованиеОперацийСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Операция = &Ссылка
		|				И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов)) КАК АкцептованиеОперацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Период",			Дата);
	Запрос.УстановитьПараметр("Организация", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Организация"));
	Запрос.УстановитьПараметр("Ссылка",			ДокументСсылка);
			                                    
	Выборка = Запрос.Выполнить().Выбрать();
		
	Возврат ?(Выборка.Следующий(), Истина, Ложь);
		
КонецФункции

#КонецОбласти

// Возвращает список значений, состоящий из документов движения денежных средств для данной строки банковской выписки
Функция ПолучитьДвиженияДенежныхСредствПоСтрокеБанковскойВыписки(СтрокаБанковскойВыписки) Экспорт
	
	Возврат РегистрыСведений.РеестрПлатежей.НайтиВРеестреПлатежей(СтрокаБанковскойВыписки);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Функция ЗаполнитьСтрокиПартии(ПартиобразующийДокумент, ИмяКорзиныЦенныхБумаг = "ЦенныеБумаги") Экспорт
	
	МаксСтрокаПартии = 0;
	
	// за первый проход определим макс. строку партии
	Для каждого СтрокаКорзиныЦенныхБумаг Из ПартиобразующийДокумент[ИмяКорзиныЦенныхБумаг] Цикл
		МаксСтрокаПартии = Макс(МаксСтрокаПартии, СтрокаКорзиныЦенныхБумаг.СтрокаПартии);
	КонецЦикла;
	
	МаксСтрокаПартии = МаксСтрокаПартии + 1;
	
	// за 2-й проход заполним незаполненные ранее строки партий
	Для каждого СтрокаКорзиныЦенныхБумаг Из ПартиобразующийДокумент[ИмяКорзиныЦенныхБумаг] Цикл
		Если СтрокаКорзиныЦенныхБумаг.СтрокаПартии = 0 Тогда
			СтрокаКорзиныЦенныхБумаг.СтрокаПартии = МаксСтрокаПартии;
			МаксСтрокаПартии = МаксСтрокаПартии + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ЗаполнитьСтрокиПартии

Функция ЗаполнитьИсполнениеПоЦеннымБумагамНаОсновании(Документ, Основание, ВидЗадолженности = Неопределено) Экспорт
	
	Документ.ЦенныеБумаги.Очистить();
	
	// заполним шапки реквизиты, общие для всех документов
	ЗаполнитьЗначенияСвойств(Документ, Основание, "Организация, Рынок, СчетДоверительногоУправления, ВалютаСделки");
	
	Если Не ЗначениеЗаполнено(Документ.Ссылка) Тогда // новый документ
		Документ.Основание        = Основание;
		Документ.ВидЗадолженности = ВидЗадолженности;
	КонецЕсли;
	
	ЧастныеРеквизитыШапки = Новый Структура("ВидДвижения", Основание.ВидСделки);
	ЗаполнитьЗначенияСвойств(Документ, ЧастныеРеквизитыШапки);
	
	// по возможности, определим тип и вид задолженности
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Период,
		|			Основание = &Основание
		|				И ВидЗадолженности = &ВидЗадолженности) КАК ЗадолженностиПоЦеннымБумагамОстатки";
		
	Если Не ЗначениеЗаполнено(ВидЗадолженности) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидЗадолженности = &ВидЗадолженности", "");
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Период",           ?(Не ЗначениеЗаполнено(Документ.Ссылка), Неопределено, Документ.МоментВремени()));
	Запрос.УстановитьПараметр("Основание",        Основание);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
		
	ВариантыЗаполнения = Запрос.Выполнить().Выгрузить();
	
	Если      ВариантыЗаполнения.Количество() = 0 Тогда
		// нет задолженности по документу
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Задолженность по ценным бумагам " + ?(ЗначениеЗаполнено(ВидЗадолженности), НРег(ВидЗадолженности), "по документу") + " " + Основание + " отсутствует");
		Возврат Неопределено;
		
	ИначеЕсли ВариантыЗаполнения.Количество() = 1 Тогда
		Документ.ВидЗадолженности = ВариантыЗаполнения[0].ВидЗадолженности;
		
		ЧастныеРеквизитыШапки.ВидДвижения = РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьВидДвиженияПоТипуЗадолженности(ВариантыЗаполнения[0].ТипЗадолженности);
		ЗаполнитьЗначенияСвойств(Документ, ЧастныеРеквизитыШапки);
		
	Иначе
		// когда вариантов более одного, при открытии формы нужно произведить подбор задолженности из соотв. общ. формы
		Возврат Ложь;
		
	КонецЕсли;
		
	// получим данные по ценным бумагам
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК Количество,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток КАК Сумма,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток КАК СуммаКупона
		|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Период,
		|			Основание = &Основание
		|				И ВидЗадолженности = &ВидЗадолженности) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЗадолженностьПоЦеннымБумагамОстатки.Количество КАК Количество,
		|	_ЗадолженностьПоЦеннымБумагамОстатки.Сумма КАК Сумма,
		|	_ЗадолженностьПоЦеннымБумагамОстатки.СуммаКупона КАК СуммаКупона,
		|	УсловияСделокСрезПоследних.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	УсловияСделокСрезПоследних.Цена КАК Цена,
		|	УсловияСделокСрезПоследних.ЦенаПроцент КАК ЦенаПроцент,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ПлановаяДатаПоставки,
		|	УсловияСделокСрезПоследних.ЦенаКупона КАК ЦенаКупона
		|ИЗ
		|	_ЗадолженностьПоЦеннымБумагамОстатки КАК _ЗадолженностьПоЦеннымБумагамОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&Период,
		|				НЕ Отменено
		|					И СделкаРЕПО = &Основание
		|					И ВидЗадолженности = &ВидЗадолженности) КАК УсловияСделокСрезПоследних
		|		ПО _ЗадолженностьПоЦеннымБумагамОстатки.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага";
		
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РЕПО", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидЗадолженности = &ВидЗадолженности", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",           ?(Не ЗначениеЗаполнено(Документ.Ссылка), Неопределено, Документ.МоментВремени()));
	Запрос.УстановитьПараметр("Основание",        Документ.Основание);
	Запрос.УстановитьПараметр("ВидЗадолженности", Документ.ВидЗадолженности);
	
 	РезультатЗапроса = Запрос.Выполнить();
	Документ.ЦенныеБумаги.Загрузить(РезультатЗапроса.Выгрузить());
	
	// если поставка проходит в ту же дату, что и изменение условий, то для нового документа установим
	// время позже, чем последнее изменение этих условий сделки
	Если НЕ ЗначениеЗаполнено(Документ.Ссылка) Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ПлановаяДатаПоставки = Выборка.ПлановаяДатаПоставки;
			
			Если ПлановаяДатаПоставки = НачалоДня(Документ.Основание.Дата) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	МАКСИМУМ(УсловияСделок.Период) КАК Период
					|ИЗ
					|	РегистрСведений.УсловияСделокРЕПО КАК УсловияСделок
					|ГДЕ
					|	УсловияСделок.Период <= &Период
					|	И УсловияСделок.СделкаРЕПО = &Основание";
				
				Если ТипЗнч(Основание) <> Тип("ДокументСсылка.СделкаРЕПО") Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "РЕПО", "");
				КонецЕсли;
				
				Запрос.УстановитьПараметр("Период",    КонецДня(ПлановаяДатаПоставки));
				Запрос.УстановитьПараметр("Основание", Документ.Основание);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					Если Выборка.Период + 1 > КонецДня(ПлановаяДатаПоставки) Тогда // чтобы случайно не перескочить на следующий день
						Документ.Дата = КонецДня(ПлановаяДатаПоставки)
					Иначе
						Документ.Дата = Выборка.Период + 1;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Документ.Дата = ПлановаяДатаПоставки;
				
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьИсполнениеПоЦеннымБумагамНаОсновании

////////////////////////////////////////////////////////////////////////////////

// Возвращает имя документа из метаданных. Актуально для вызова
// с клиента для последующей передачи в прочие объекты или структуры данных
// 
// Параметры:
//  Документ - ДокументСсылка или ДокументОбъект
// 
// Возвращаемое значение:
//  Имя документа, как оно задано в метаданных
//
Функция ПолучитьИмя(Документ) Экспорт
	
	Возврат Документ.Метаданные().Имя;
	
КонецФункции // ПолучитьИмя

// Возвращает момент времени переданного документа. Актуально для вызова
// с клиента для последующей передачи в прочие объекты или структуры данных
// 
// Параметры:
//  Документ - ДокументСсылка или ДокументОбъект
// 
// Возвращаемое значение:
//  Момент времени документа, если он был сохранен, или неопределено, в противном случае
//
Функция ПолучитьМоментВремени(Документ) Экспорт
	
	Если ЗначениеЗаполнено(Документ) Тогда
		Возврат Документ.МоментВремени();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьМоментВремени

////////////////////////////////////////////////////////////////////////////////

Функция ЭтоРежимПроведения(Документ, РежимЗаписи) Экспорт
	
	Возврат (РежимЗаписи = РежимЗаписиДокумента.Проведение) Или (РежимЗаписи = РежимЗаписиДокумента.Запись И Документ.Проведен);
	
КонецФункции // ЭтоРежимПроведения

// Проверяет возможность редактирования документа
//
// Параметры:
//	Документ			- ДокументСсылка				- ссылка на проверяемый документ
//	ДокументОбъект		- ДокументОбъект				- объект проверяемого документа
//	Отказ				- Булево						- выходной параметр, при запрете редактирования устанавливается в значение Истина
//	СообщатьОбОтказе	- Булево						- при Истина пользователю будет выведено сообщение об отказе, при Ложь будет заполнен параметр ТекстСообщения
//	ТекстСообщения		- Строка, ФорматированнаяСтрока	- выходной параметр, при СообщатьОбОтказе=Ложь будет заполнен текстом сообщения о причине запрета редактирования
//	РежимЗаписи			- РежимЗаписиДокумента			- режим записи документа
//
// Возвращаемое значение:
//	Булево - редактирование документа запрещено
//
Функция ЗапретРедактированияДокумента(Документ, ДокументОбъект, Отказ, СообщатьОбОтказе = Истина, ТекстСообщения = Неопределено, РежимЗаписи = Неопределено) Экспорт
	
	Запрет = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументМД = Документ.Метаданные();
	
	// Для проводимых документов проверку выполняем, только если документ уже проведен или проводится в данный момент
	
	Если ДокументМД.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
		И Не Документ.Проведен 
		И РежимЗаписи <> Неопределено 
		И РежимЗаписи <> РежимЗаписиДокумента.Проведение
	Тогда
		Запрет = Ложь; 
	КонецЕсли; 
	
	// Определяем счета д/у документа, у которых нужно проверить даты запрета реадактирования
	
	Если Запрет = Неопределено Тогда
	
		ЕстьРеквизитСчетДоверительногоУправления = (ДокументМД.Реквизиты.Найти("СчетДоверительногоУправления") <> Неопределено);
		
		Если ЕстьРеквизитСчетДоверительногоУправления Тогда
			СчетаДоверительногоУправления = Документ.СчетДоверительногоУправления;	
		ИначеЕсли РаботаСМетаданнымиПовтИсп.ДокументыСРегистрациейПоКлиенту().Получить(ДокументМД.Имя) <> Неопределено Тогда
			СчетаДоверительногоУправления = Документы[ДокументМД.Имя].ПолучитьСвязанныеСчетаДоверительногоУправления(Документ);
		ИначеЕсли ДокументМД.Имя = "РегистрацияФинансовыхПоказателей" Тогда
			Запрет = Документы.РегистрацияФинансовыхПоказателей.ЗапретРедактированияДокумента(Документ, Отказ, СообщатьОбОтказе, ТекстСообщения);
		Иначе
			Запрет = Ложь; // по организации пока не проверяем
		КонецЕсли;
		
	КонецЕсли;
	
	// Корректировку регистров проверим в наборе записей регистров
	
	Если Запрет = Неопределено И ДокументМД.Имя = "КорректировкаРегистров" Тогда
		Запрет = Ложь;
	КонецЕсли;
	
	// У документа рисковиков дату запрета не проверяем
	
	Если Запрет = Неопределено И ДокументМД.Имя = "РегистрацияСведенийОбОценкеИнвестиционныхРисков" Тогда
		Запрет = Ложь;
	КонецЕсли;
	
	// Для документов Акцепт у "МД Траст" не нужно проверять даты запрета, т.к. список акцептов за месяц получают только в середине следующего месяца
	// Также не проверяем акцепты на поручения на вывод активов
	
	Если Запрет = Неопределено
		И ДокументМД.Имя = "Акцепт" 
		И (Документ.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст") 
			Или Документ.ВидАкцепта = Перечисления.ВидыАкцептов.ПоручениеНаВыводАктивов)
	Тогда
		Запрет = Ложь;
	КонецЕсли;
	
	// Документы не относящиеся к бэк-офису или бухгалтерии:
	// пока по ним нет отдельных дат запрета, исключаем из проверки
	
	Если Запрет = Неопределено Тогда 
		
		ДокументыИсключения = Новый Структура();
		ДокументыИсключения.Вставить("Распоряжение");
		ДокументыИсключения.Вставить("Нарушение");
		ДокументыИсключения.Вставить("УстранениеНарушения");
		ДокументыИсключения.Вставить("ИсходящийДокумент");
		ДокументыИсключения.Вставить("СлужебноеРасследование");
		ДокументыИсключения.Вставить("НесоответствиеИнвестиционнойДекларации");
		ДокументыИсключения.Вставить("РегистрацияИнформацииОКонфликтеИнтересов");

		Если ДокументыИсключения.Свойство(ДокументМД.Имя) Тогда
			Запрет = Ложь;
		КонецЕсли;
		
	КонецЕсли; 
	
	// Входящий документ формирует движения только при типе "Входящий документ депозитарной компании",
	// в остальных случаях должны быть доступны для редактирования сам документ и реквизиты № и дата исходящего документа и результат рассмотрения.
	
	Если Запрет = Неопределено
		И ДокументМД.Имя = "ВходящийДокумент"
		И Документ.ТипВходящегоДокумента <> Перечисления.ТипыВходящихДокументов.ВходящийДокументДепозитарнойКомпании
	Тогда
		Запрет = Ложь;
	КонецЕсли;
	
	// Определяем виды учета и группы запрета и проверяем даты запрета по ним
	
	Если Запрет = Неопределено Тогда
		
		ЕстьРеквизитВидУчета = (ДокументМД.Реквизиты.Найти("ВидУчета") <> Неопределено);
		
		МассивИсключений = РаботаСМетаданнымиПовтИсп.ПолучитьИменаДокументовБезДвиженийПоБэкОфису();
		МассивИсключений.Добавить("ЗакрытиеБухгалтерскихСчетов");
		МассивИсключений.Добавить("ПоручениеНаПереоценку");
		
		ЭтоБухРезервы = (ДокументМД.Имя = "НачислениеСписаниеРезервов" И Документ.ЦельРасчета <> Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
		
		ДокументыСДвижениямиПоПартиям = Новый Массив;
		ДокументыСДвижениямиПоПартиям.Добавить("ПереоценкаЦенныхБумаг");
		ДокументыСДвижениямиПоПартиям.Добавить("КорректировкаПервоначальногоПризнания");
		ДокументыСДвижениямиПоПартиям.Добавить("ПереоценкаСрочныхКонтрактов");
		Если ЭтоБухРезервы Тогда
			ДокументыСДвижениямиПоПартиям.Добавить("НачислениеСписаниеРезервов");
		КонецЕсли;
		
		СтандартнаяОбработкаПроведения = (МассивИсключений.Найти(ДокументМД.Имя) = Неопределено И ДокументыСДвижениямиПоПартиям.Найти(ДокументМД.Имя) = Неопределено);
		
		Если ДокументМД.Имя = "РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах" Или ДокументМД.Имя = "РегистрацияСведенийОбОценкеИнвестиционныхРисков" Тогда
			// Пока считаем его чисто бэк-офисным
			ЭтоРегламентныйДокумент = Ложь;	
		ИначеЕсли ДокументОбъект = Неопределено Тогда
			// пришли сюда из ПриСозданииФормыНаСервере
			// параметры сеанса и доп. свойства объекта не смотрим, пока проверяем по реквизиту ВидУчета
			ЭтоРегламентныйДокумент = ЕстьРеквизитВидУчета ИЛИ (ДокументМД.Имя = "ПоручениеНаПереоценку") ИЛИ ЭтоБухРезервы;
		Иначе
			// пришли сюда из ПередЗаписью
			// если формируем проводки - параметр сеанса ФормированиеДвиженийПоРегистрамБэкОфиса установлен в Ложь
			// документы ПереоценкаЦенныхБумаг КорректировкаПервоначальногоПризнания также обрабатываем, как регламентные
			ЭтоБухРегистрацияСтоимостиПереоценки = ДокументМД.Имя = "РегистрацияСтоимостиПереоценки" И ЗначениеЗаполнено(Документ.ЦельРасчета) И Документ.ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(Документ.ВидУчета);
			ЭтоРегламентныйДокумент = Не ПараметрыСеанса.ФормированиеДвиженийПоРегистрамБэкОфиса Или Не СтандартнаяОбработкаПроведения Или ЭтоБухРегистрацияСтоимостиПереоценки;
		КонецЕсли; 
		
		ТаблицаПроверкиЗапретаРедактирования = Неопределено;
		
		ВидыУчетаДляПроведения = Новый Массив;
		
		Если ЭтоРегламентныйДокумент Тогда
			
			Если Не (ДокументОбъект = Неопределено Или ДокументОбъект.ДополнительныеСвойства.Свойство("ВидыУчетаДляПроведения", ВидыУчетаДляПроведения)) Тогда
				// помещаем массив видов учета из доп. свойства объекта в массив ВидыУчетаДляПроведения
				// доп. свойство может остуствовать при приведении документа, в котором реализован нестандартный обработчик проведения, например, ПереоценкаЦенныхБумаг
				ВидыУчетаДляПроведения = Новый Массив;
			КонецЕсли;
			
			Если ЕстьРеквизитВидУчета И ВидыУчетаДляПроведения.Найти(Документ.ВидУчета) = Неопределено Тогда
				// добавим реквизит ВидУчета из шапки документа
				ВидыУчетаДляПроведения.Добавить(Документ.ВидУчета);
			КонецЕсли; 
			
			// #ТехническийДолг в документе реквизит "ЦельРасчета" нужно удалить, а "ВидУчета" - добавить
			Если ДокументМД.Имя = "ПоручениеНаПереоценку" ИЛИ ДокументМД.Имя = "НачислениеСписаниеРезервов" Тогда
				ВидыУчетаДляПроведения.Добавить(Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
			КонецЕсли;
			
			Если ВидыУчетаДляПроведения.Количество() = 0 Тогда
				
				Запрет = Истина;
				
				ВидОперации	   = ?(РежимЗаписи = РежимЗаписиДокумента.Проведение, "Проведение", "Редактирование");
				ТекстСообщения = СтрШаблон("%1 документа запрещено, т.к. не удалось определить виды учета. Возможно, отсутствуют права на проведение документа", ВидОперации);
				
				Если СообщатьОбОтказе Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ);
				КонецЕсли;
				
			Иначе
				
				ГруппыЗапретаРедактирования = Новый Массив;
				ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.Проводки);
				
				Если Не ДокументыСДвижениямиПоПартиям.Найти(ДокументМД.Имя) = Неопределено Тогда
					ГруппыЗапретаРедактирования.Добавить(Перечисления.ГруппыЗапретаРедактирования.Партии);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ДокументМД.Имя = "РасчетНДФЛ" Тогда
				
				// Расчет НДФЛ не бэкофисный документ  
				
				ВидыУчетаДляПроведения.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
				ГруппыЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.Проводки;
				
			ИначеЕсли ДокументМД.Имя = "РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах" Тогда
				
				ТаблицаПроверкиЗапретаРедактирования = РаботаСМетаданнымиПовтИсп.МенеджерОбъектаМетаданных(ДокументМД.ПолноеИмя()).ПолучитьТаблицуПроверкиДатЗапретаРедактирования(Документ);
				
			Иначе
				
				ВидыУчетаДляПроведения.Добавить(Перечисления.ВидыУчета.ПустаяСсылка());
				ГруппыЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.БэкОфис;		
				
			КонецЕсли; 
			
		КонецЕсли;	

		Если Запрет = Неопределено Тогда
		
			// Если таблица проверки не переопределена, заполняем алгоритмом по умолчанию
			
			Если ТаблицаПроверкиЗапретаРедактирования = Неопределено Тогда
				
				ТаблицаПроверкиЗапретаРедактирования = РегистрыСведений.ДатыЗапретаРедактирования.СоздатьТаблицуПроверкиДатЗапретаРедактирования();
				
				Если ТипЗнч(СчетаДоверительногоУправления) <> Тип("Массив") Тогда
					СчетаДоверительногоУправления = РаботаСКоллекциями.ЗначениеВМассив(СчетаДоверительногоУправления);
				КонецЕсли;
				
				Если ТипЗнч(ГруппыЗапретаРедактирования) <> Тип("Массив") Тогда
					ГруппыЗапретаРедактирования = РаботаСКоллекциями.ЗначениеВМассив(ГруппыЗапретаРедактирования);
				КонецЕсли;
				
				Для Каждого СчетДоверительногоУправления Из СчетаДоверительногоУправления Цикл 
					Для Каждого ГруппаЗапрета Из ГруппыЗапретаРедактирования Цикл
						Если ГруппаЗапрета = Перечисления.ГруппыЗапретаРедактирования.БэкОфис Тогда
							РегистрыСведений.ДатыЗапретаРедактирования.ДобавитьСтрокуВТаблицуПроверкиДатЗапретаРедактирования(
								ТаблицаПроверкиЗапретаРедактирования, ГруппаЗапрета, , Документ.Организация, СчетДоверительногоУправления, Документ.Дата);
						Иначе
							Для Каждого ВидУчета Из ВидыУчетаДляПроведения Цикл
								РегистрыСведений.ДатыЗапретаРедактирования.ДобавитьСтрокуВТаблицуПроверкиДатЗапретаРедактирования(
									ТаблицаПроверкиЗапретаРедактирования, ГруппаЗапрета, ВидУчета, Документ.Организация, СчетДоверительногоУправления, Документ.Дата);
							КонецЦикла;
						КонецЕсли;	
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
			
			// Непосредственно проверка по таблице	
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТаблицаПроверки.Организация КАК Организация,
				|	ТаблицаПроверки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	ТаблицаПроверки.ГруппаЗапрета КАК ГруппаЗапрета,
				|	ТаблицаПроверки.ВидУчета КАК ВидУчета,
				|	ТаблицаПроверки.Период КАК Период
				|ПОМЕСТИТЬ _ТаблицаПроверки
				|ИЗ
				|	&ТаблицаПроверки КАК ТаблицаПроверки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	МАКСИМУМ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования) КАК ДатаЗапретаРедактирования
				|ИЗ
				|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаПроверки КАК _ТаблицаПроверки
				|		ПО (_ТаблицаПроверки.Организация = ДатыЗапретаРедактирования.Организация)
				|			И (_ТаблицаПроверки.СчетДоверительногоУправления = ДатыЗапретаРедактирования.СчетДоверительногоУправления)
				|			И (_ТаблицаПроверки.ГруппаЗапрета = ДатыЗапретаРедактирования.ГруппаЗапрета)
				|			И (_ТаблицаПроверки.ВидУчета = ДатыЗапретаРедактирования.ВидУчета)
				|			И (_ТаблицаПроверки.Период <= ДатыЗапретаРедактирования.ДатаЗапретаРедактирования)
				|
				|СГРУППИРОВАТЬ ПО
				|	ДатыЗапретаРедактирования.СчетДоверительногоУправления");

			Запрос.УстановитьПараметр("ТаблицаПроверки", ТаблицаПроверкиЗапретаРедактирования);	
			
			РезультатЗапроса = Запрос.Выполнить();
				
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Запрет = Истина; 
				
				ВсеСчетаДУ = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");
				
				ТекстСообщения = "Редактирование документа запрещено, т.к. его дата меньше либо равна дате запрета редактирования";
				
				Если СообщатьОбОтказе Тогда
					
					Если Не ЕстьРеквизитСчетДоверительногоУправления Тогда
						ТекстСообщения = ТекстСообщения + " " + СтрСоединить(ВсеСчетаДУ, ", ");		
					КонецЕсли;
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ, "Дата");
					
				Иначе
					
					НавигационныеСсылки = Новый Массив;
					
					Для Каждого СчетДУ Из ВсеСчетаДУ Цикл
						НавигационныеСсылки.Добавить(ПолучитьНавигационнуюСсылку(СчетДУ));		
					КонецЦикла;
					
					ТекстСообщения = Новый ФорматированнаяСтрока(ТекстСообщения, , , , СтрСоединить(НавигационныеСсылки, "|"));
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	// Итоговый результат
	
	Если Запрет = Истина Тогда
		
		Отказ = Истина;
		
		Если ДокументОбъект <> Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ОшибкаЗапретаРедактированияДокумента", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ?(Запрет = Истина, Истина, Ложь); // При Неопределено считаем, что запрета нет 
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Процедура ПередЗаписью(Документ) Экспорт
	
	ЗапомнитьТекущиеРеквизитыДокумента(Документ);
	
	УстановитьВремяНовогоДокумента(Документ);
	
КонецПроцедуры // ПередЗаписью

Функция ИзмененыРеквизитыШапкиДокумента(Документ, Знач РеквизитыШапки, ИсключаемыеПоляШапки = "", ЭтоАкцептование = Ложь) Экспорт
		
	Если Документ.ДополнительныеСвойства.Свойство("ПредЗначенияРеквизитовШапки") Тогда
		ПредЗначенияРеквизитовШапки = Документ.ДополнительныеСвойства.ПредЗначенияРеквизитовШапки;	
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для документа " + Документ + " нет возможности проверить изменялись ли реквизиты.", Документ,,,);		
		Возврат Ложь;
	КонецЕсли; 
	
	ИсключаемыеПоляШапки = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключаемыеПоляШапки,, Истина, Истина);	
	ИсключаемыеПоляШапки.Добавить("Ссылка");
	ИсключаемыеПоляШапки.Добавить("ВерсияДанных");
	ИсключаемыеПоляШапки.Добавить("Ответственный");
	ИсключаемыеПоляШапки.Добавить("Комментарий");
		
	// всегда сверяем статус проведения
	Если Документ.Проведен <> ПредЗначенияРеквизитовШапки.Проведен Тогда
		Возврат Истина;
	КонецЕсли;
	
	// проверяем прочие реквизиты
	Если ТипЗнч(РеквизитыШапки) <> Тип("Массив") Тогда
		РеквизитыШапки = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыШапки,, Истина, Истина);		
	КонецЕсли; 
	
	Для каждого Реквизит Из РеквизитыШапки Цикл
		Если ИсключаемыеПоляШапки.Найти(Реквизит) = Неопределено Тогда
			Если Документ[Реквизит] <> ПредЗначенияРеквизитовШапки[Реквизит] Тогда
				//Если это акцептование и время документа двинулось вперед внутри рабочего дня, то норм 
				Если ЭтоАкцептование и (Реквизит = "Дата") и (НачалоДня(Документ[Реквизит]) = НачалоДня(ПредЗначенияРеквизитовШапки[Реквизит]))
					и Документ[Реквизит] > ПредЗначенияРеквизитовШапки[Реквизит] Тогда
		                 Продолжить;
					КонецЕсли; 
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоПервыйВводАктивов(Документ)

	ТипДокумента = ТипЗнч(Документ);
	Если ТипДокумента <> Тип("ДокументОбъект.ВводДенежныхСредств")
		И ТипДокумента <> Тип("ДокументОбъект.ВводКредитногоИнструмента")
		И ТипДокумента <> Тип("ДокументОбъект.ВводЦенныхБумаг")
	Тогда
		Возврат Ложь;	
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВводыВыводыАктивовВВалютеУчета.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|ГДЕ
		|	ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Документ.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ЗапомнитьТекущиеРеквизитыДокумента(Документ)
	
	ЭтоНовыйДокумент = Документ.ЭтоНовый();
	
	Документ.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовыйДокумент);
	Документ.ДополнительныеСвойства.Вставить("ЭтоПервыйВводАктивов", ЭтоПервыйВводАктивов(Документ));

	Если ЭтоНовыйДокумент Тогда
		Возврат;
	КонецЕсли;
	
	ЗнчРеквизитовШапки = Новый Структура();
	
	ИсключаемыеПоляШапки = Новый Массив();
	ИсключаемыеПоляШапки.Добавить("Ссылка");
	ИсключаемыеПоляШапки.Добавить("ВерсияДанных");
	ИсключаемыеПоляШапки.Добавить("Ответственный");
	ИсключаемыеПоляШапки.Добавить("Комментарий");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШапкаДокумента.*
		|ИЗ
		|	" + Документ.Метаданные().ПолноеИмя() + " КАК ШапкаДокумента
		|ГДЕ
		|	ШапкаДокумента.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Если ИсключаемыеПоляШапки.Найти(Колонка.Имя) = Неопределено Тогда
				ЗнчРеквизитовШапки.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Документ.ДополнительныеСвойства.Вставить("ПредЗначенияРеквизитовШапки", ЗнчРеквизитовШапки);
	
КонецПроцедуры // ЗапомнитьТекущиеРеквизитыДокумента

// Новые документы, введенные раньше или позже границ дня 09:30—20:30:00
// автоматически приводятся к ближайшей границе
//
// Параметры:
//   Документ - ДокументОбъект
//
Процедура УстановитьВремяНовогоДокумента(Документ)
	
	Если Документ.ЭтоНовый() Тогда
		Документ.Дата = ПолучитьВремяДокумента(Документ.Дата, Документ.Ссылка);				
	КонецЕсли;
	
КонецПроцедуры // УстановитьВремяНовогоДокумента

// Возвращает период рабочего времени для документов бэк-офиса
Функция ПериодРабочегоВремениДня() Экспорт
	
	// 9:30 - 20:30
	Возврат Новый Структура("ВремяНачала, ВремяОкончания", 9.5 * 60 * 60, 20.5 * 60 * 60);
	
КонецФункции

// Используется и для контроля интерактивного изменения даты/времени документа.
// Границы рабочего времени: 09:30—20:30:00
Функция ПолучитьВремяДокумента(ДатаДокумента, ДокументСсылка) Экспорт
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	Если ПроверитьВидДокумента(ТипДокумента, "ВходящийДокумент")
		ИЛИ ПроверитьВидДокумента(ТипДокумента, "ИсходящийДокумент")
	Тогда
		Возврат ДатаДокумента;
	КонецЕсли; 
	
	// Если у документа установлено доп. сведение РазрешитьВремяДокументаЗаГраницамиРабочихЧасов = Истина,
	// его время не изменяем
	Если ЗначениеЗаполнено(ДокументСсылка) И ДляДокументаРазрешеноНерабочееВремя(ДокументСсылка) Тогда
		Возврат ДатаДокумента;
	КонецЕсли;
	
	РабочиеЧасы = ПериодРабочегоВремениДня();
	
	// Регламентные документы - в конец дня
	// У связанных документов "НачислениеРезервовПИФ" и "РегистрацияСтоимостиПереоценки" время берется
	// из документа "РегистрацияСтоимостиАктивов", отдельно их обрабатывать не нужно.
	
	Если ПроверитьВидДокумента(ТипДокумента, "РегистрацияСтоимостиАктивов") 
		ИЛИ ПроверитьВидДокумента(ТипДокумента, "РегистрацияФинансовыхПоказателей")
		ИЛИ ПроверитьВидДокумента(ТипДокумента, "ОперацияНДС")
	Тогда
	    Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяОкончания; // 20:30:00
	КонецЕсли;		

	Если ПроверитьВидДокумента(ТипДокумента, "НачислениеСписаниеРезервов") Тогда
	    Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяОкончания + 1; // 20:30:01 чтобы гарантированно был позднее всех переоценок
	КонецЕсли;		
	
	// Реклассификация при переходе на МСФО9 01.01.2025 00:00:00
	
	Если ПроверитьВидДокумента(ТипДокумента, "РеклассификацияАктивовЕПС") И НачалоДня(ДатаДокумента) = '20250101' Тогда
		Возврат НачалоДня(ДатаДокумента); // 00:00:00
	КонецЕсли;
	
	// Прочие должны попадать в границы рабочего времени 09:30 - 20:30
	
	Если ДатаДокумента < НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяНачала Тогда // 9:30
		
		Если ПроверитьВидДокумента(ТипДокумента, "Оплата")
			ИЛИ ПроверитьВидДокумента(ТипДокумента, "ВыводДенежныхСредств")
			ИЛИ ПроверитьВидДокумента(ТипДокумента, "ВыводЦенныхБумаг")
		Тогда
			Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяНачала + 1; // 9:30:01
		ИначеЕсли ПроверитьВидДокумента(ТипДокумента, "ПереоценкаВалютныхЦенностей") И ДатаДокумента >= '20240501'
		Тогда
		    Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяНачала - 60 * 60; // 8:30:00	
		Иначе
			Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяНачала; // 9:30:00
		КонецЕсли;	
		
	ИначеЕсли ДатаДокумента > НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяОкончания Тогда // 20:30:00
		
		Если ПроверитьВидДокумента(ТипДокумента, "НачислениеЗадолженности")
			ИЛИ ПроверитьВидДокумента(ТипДокумента, "ПоручениеНаДвижениеДенежныхСредств")
			ИЛИ ПроверитьВидДокумента(ТипДокумента, "ПоручениеНаДвижениеЦенныхБумаг")
		Тогда
			Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяОкончания - 1; // 20:29:59
		ИначеЕсли ПроверитьВидДокумента(ТипДокумента, "ПереоценкаВалютныхЦенностей") И ДатаДокумента >= '20240501' 
		Тогда
		    Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяОкончания + 60 * 60; // 21:30:00	
		Иначе
			Возврат НачалоДня(ДатаДокумента) + РабочиеЧасы.ВремяОкончания; // 20:30:00	
		КонецЕсли;		
		
	КонецЕсли; 
	
	Возврат ДатаДокумента;
	
КонецФункции

Функция ПроверитьВидДокумента(ТипЗначения, ВидДокумента)
	
	Возврат (ТипЗначения = Тип("ДокументСсылка." + ВидДокумента) ИЛИ ТипЗначения = Тип("ДокументОбъект." + ВидДокумента));	
	
КонецФункции

Функция ДляДокументаРазрешеноНерабочееВремя(ДокументСсылка) 
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект = &Объект
		|	И ЗначенияДополнительныхСведений.Свойство.Ключ = ""РазрешитьВремяДокументаЗаГраницамиРабочихЧасов""
		|	И ЗначенияДополнительныхСведений.Значение = ИСТИНА");
	
	Запрос.УстановитьПараметр("Объект", ДокументСсылка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Процедура СформироватьПроводки(Документ, Отказ) Экспорт
	Перем ВидыУчетаДляПроведения;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// виды учета должны быть либо заданы явно, либо установлен параметр сеанса "ФормированиеДвиженийПоРегистрамБухгалтерии"
	Если Не Документ.ДополнительныеСвойства.Свойство("ВидыУчетаДляПроведения", ВидыУчетаДляПроведения) Тогда
		ВидыУчетаДляПроведения = Новый Массив;
		Если ОбщегоНазначения.ЗначениеПараметраСеанса("ФормированиеДвиженийПоРегистрамБухгалтерии") Тогда
			Для каждого ВидУчета Из Перечисления.ВидыУчета Цикл
				ВидыУчетаДляПроведения.Добавить(ВидУчета);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидыУчетаДляПроведения.Количество() = 0 Тогда
		Если Не ОбщегоНазначения.ЗначениеПараметраСеанса("ФормированиеДвиженийПоРегистрамБэкОфиса") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен режим формирования движений при проведении документа '" + Документ + "'", Документ,,, Отказ);
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	// исключим те виды учета, по которым нет настроек
	Для Инд = -ВидыУчетаДляПроведения.ВГраница() По 0 Цикл
		Если Не РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(Документ.Дата, Документ.Организация, Документ.СчетДоверительногоУправления, ВидыУчетаДляПроведения[-Инд]) Тогда
			ВидыУчетаДляПроведения.Удалить(-Инд);
		КонецЕсли;
	КонецЦикла;
	
	// формирование проводок
	Для каждого ВидУчета Из ВидыУчетаДляПроведения Цикл
		
		Если ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			Документ.ПроведениеПоРегиструЕПС("ЕдиныйБухгалтерскийУчет", Отказ);
		Иначе
			Документ.ПроведениеПоРегиструБухгалтерии(РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидУчета), Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры // СформироватьПроводки

Процедура СформироватьДвиженияПоРегистрамБэкОфиса(Документ, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ФормированиеДвиженийПоРегистрамБэкОфиса") Тогда
		Документ.ПроведениеПоРегистрамБэкОфиса(Отказ);
	Иначе
		Если Не ОбщегоНазначения.ЗначениеПараметраСеанса("ФормированиеДвиженийПоРегистрамБухгалтерии") И Не Документ.ДополнительныеСвойства.Свойство("ВидыУчетаДляПроведения") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен режим формирования движений при проведении документа '" + Документ + "'", Документ,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СформироватьДвиженияПоРегистрамБэкОфиса

// Заполняет ответственного за регистрацию документа в соответствии с регистром ОтветственныеЗаОперации 
// Если это новый документ, проверяет текущего пользователя, может ли он быть ответственным за регистрацию операции,
// иначе - проверяет ранее установленного ответственного.		
//
// Параметры:
//   Документ - ДокументОбъект - Документ, у которого нужно заполнить реквизит "Ответственный"  
//   Отказ - Булево - Признак отказа от записи
//
Процедура УстановитьОтветственного(Документ, Отказ) Экспорт
	
	// Только для организаций, для которых требуется контроль ответственных за операции
	КонтрольОтветственныхЗаОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация, "КонтрольОтветственныхЗаОперации");
	Если Не КонтрольОтветственныхЗаОперации Тогда
		Возврат;
	КонецЕсли;
	
	ИмяДокумента			= ПолучитьИмя(Документ);
	ТекущийОтветственный	= ?(Документ.ЭтоНовый(), РаботаСПользователями.ТекущийПользователь(), Документ.Ответственный);
	
	Если РаботаСМетаданнымиПовтИсп.ЕстьРеквизитШапкиДокумента(ИмяДокумента, "ЦельРасчета") Тогда
		ЦельРасчета = Документ.ЦельРасчета;
	КонецЕсли;
	
	Если ИмяДокумента = "КорректировкаРегистров" Тогда
		// Для корректировок регистров определяем ответственного
		// только при изменении бек-офисных регистров
		ТребуетсяОпределениеОтветственного = Ложь;
		
		РегистрыБэкОфиса = РаботаСМетаданнымиПовтИсп.ПолучитьСписокРегистровБэкОфиса();
		Для Каждого СтрокаРегистра Из Документ.ТаблицаРегистров Цикл
			Если РегистрыБэкОфиса[СтрокаРегистра.Имя] <> Неопределено Тогда
				ТребуетсяОпределениеОтветственного = Истина;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
	Иначе
		ТребуетсяОпределениеОтветственного = Истина;
	КонецЕсли;
	
	Если ТребуетсяОпределениеОтветственного Тогда
		Ответственный = РегистрыСведений.ОтветственныеЗаОперации.ОпределитьОтветственного(Документ.Организация, ИмяДокумента, ЦельРасчета, Документ.Дата, ТекущийОтветственный);
	Иначе
		Ответственный = ТекущийОтветственный;
	КонецЕсли;	
	
	// Ответственного не удалось определить, но он должен был быть
	Если Ответственный = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить ответственного за регистрацию документов вида """ + ИмяДокумента + """ в " + Строка(Документ.Организация), Документ, , , Отказ);
		Возврат;	
	КонецЕсли;
	
	Документ.Ответственный = Ответственный;
	
КонецПроцедуры

Функция СделкаЧерезБрокера(Документ) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.Сделка") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.Сделка")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.СделкаРЕПО") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.СделкаРЕПО")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.СделкаСВалютой") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.СделкаСВалютой") Тогда
		
		ЭтоСсылкаНаДокумент = СтрНачинаетсяС(XMLТипЗнч(Документ).ИмяТипа, "DocumentRef");
	
		Брокер = ?(ЭтоСсылкаНаДокумент, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Брокер"), Документ.Брокер);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ИзменениеУсловийСделки")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") Тогда
		
		Брокер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Основание, "Брокер");
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ОтменаСделки") Тогда	
		
		Брокер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Сделка, "Брокер");

	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ИзменениеУсловийСделки")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")	
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ОтменаСделки") Тогда	
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документ.Основание.Брокер КАК Брокер
			|ИЗ
			|	Документ.ИзменениеУсловийСделки КАК Документ
			|ГДЕ
			|	Документ.Ссылка = &Ссылка
			|");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИзменениеУсловийСделки", РаботаСДокументами.ПолучитьИмя(Документ));
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ОтменаСделки") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Основание.", ".Сделка.");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Брокер = РезультатЗапроса.Выгрузить()[0].Брокер;
		
	Иначе
		
		Возврат Ложь;

	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Брокер);

Конецфункции

#Область Подтверждение_операций_внутреннего_учета

Процедура ЗаполнитьПодтверждениеОперации(Форма, ОсновнойРеквизит) Экспорт
	
	// Только подтверждаемые операции
	Если Не Метаданные.ОпределяемыеТипы.ПодтверждаемыеОперацииБэкОфиса.Тип.СодержитТип(ТипЗнч(ОсновнойРеквизит)) Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(ОсновнойРеквизит) = Тип("ДокументСсылка.РегистрацияСтоимостиАктивов") 
			И ОсновнойРеквизит.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
		Или ТипЗнч(ОсновнойРеквизит) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнойРеквизит, "СпособПередачи") = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема Тогда
			
		КнопкаПодтвердитьОперацию = Форма.Элементы.Найти("ФормаРегистрСведенийПодтверждениеОперацийБэкОфисаПодтвердитьОперацию");	
		
		Если КнопкаПодтвердитьОперацию <> Неопределено Тогда
			КнопкаПодтвердитьОперацию.Видимость = Ложь;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	ЭлементГруппаСостояниеДокумента	= Форма.Элементы.Найти("ГруппаСостояниеДокумента");
	Если ЭлементГруппаСостояниеДокумента = Неопределено Тогда
		ЭлементГруппаСостояниеДокумента = Форма.Элементы.Вставить("ГруппаСостояниеДокумента", Тип("ГруппаФормы"), , Форма.ПодчиненныеЭлементы[0]);
		ЭлементГруппаСостояниеДокумента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаСостояниеДокумента.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	ЭлементГруппаСостояниеДокумента.Видимость = Истина;	
	
	ОперацияПодтверждена			= Ложь;
	ТребуетсяПодтверждениеОперации	= Ложь; 
	
	Если ЗначениеЗаполнено(ОсновнойРеквизит) Тогда
		
		// Только для организаций, для которых требуется подтверждение операций
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновнойРеквизит, Новый Структура("КонтрольПодтвержденийОпераций", "Организация.КонтрольПодтвержденийОпераций"));
		Если РеквизитыОрганизации.КонтрольПодтвержденийОпераций Тогда
			ТребуетсяПодтверждениеОперации = Истина;
		КонецЕсли;
	
		// отображаем состояние подтверждения только для документов после 01.10.2017
		ТребуетсяПодтверждениеОперации = ТребуетсяПодтверждениеОперации И (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнойРеквизит, "Дата") >= '20171001');
		
		Если ТребуетсяПодтверждениеОперации Тогда
			СведенияОПодтвержденииОперации	= Неопределено;
			ОперацияПодтверждена			= РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ОперацияПодтверждена(ОсновнойРеквизит, СведенияОПодтвержденииОперации); 
			РасшифровкаЗаписиЖурнала		= "";
			
			Если ОперацияПодтверждена Тогда
				РасшифровкаЗаписиЖурнала	= Строка(СведенияОПодтвержденииОперации.Период) + ", основание: " + СведенияОПодтвержденииОперации.Основание;
				СостояниеДокумента			= Новый ФорматированнаяСтрока("Операция подтверждена " + РасшифровкаЗаписиЖурнала, , WebЦвета.Зеленый);
			Иначе
				СведенияОВнесенииОперации = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПервуюЗаписьЖурналаПодтверждений(ОсновнойРеквизит);
				Если СведенияОВнесенииОперации <> Неопределено Тогда
					РасшифровкаЗаписиЖурнала = ", время внесения " + СведенияОВнесенииОперации.Период + ?(ЗначениеЗаполнено(СведенияОВнесенииОперации.Основание), ", основание: " + СведенияОВнесенииОперации.Основание, "");  	
				КонецЕсли;
				СостояниеДокумента = Новый ФорматированнаяСтрока("Операция не подтверждена" + РасшифровкаЗаписиЖурнала, , WebЦвета.Красный);
			КонецЕсли;
			
			РаботаСДокументамиКлиентСервер.УстановитьСостояниеДокумента(Форма, СостояниеДокумента, "ПодтверждениеОперации");
		КонецЕсли;

	КонецЕсли;
	
	КнопкаПодтвердитьОперацию = Форма.Элементы.Найти("ФормаРегистрСведенийПодтверждениеОперацийБэкОфисаПодтвердитьОперацию");	
	Если КнопкаПодтвердитьОперацию = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.Переместить(КнопкаПодтвердитьОперацию, ЭлементГруппаСостояниеДокумента);
	
	КнопкаПодтвердитьОперацию.Видимость		= ОперацияПодтверждена ИЛИ (ТребуетсяПодтверждениеОперации И ЗначениеЗаполнено(ОсновнойРеквизит));		
	КнопкаПодтвердитьОперацию.Отображение	= ОтображениеКнопки.Текст;
	КнопкаПодтвердитьОперацию.Вид			= ВидКнопкиФормы.Гиперссылка;
	КнопкаПодтвердитьОперацию.Заголовок		= "Подробнее";
	
КонецПроцедуры

Функция ПолучитьКрайниеЗаписиЖурналаПодтверждений(Операция) Экспорт	
	КрайниеЗаписи = Новый Структура("ПерваяЗапись, ПоследняяЗапись");
	
	КрайниеЗаписи.ПерваяЗапись		= РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПервуюЗаписьЖурналаПодтверждений(Операция); 
	КрайниеЗаписи.ПоследняяЗапись	= РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПоследнююЗаписьЖурналаПодтверждений(Операция); 
	
	Возврат КрайниеЗаписи;
КонецФункции

Функция ПолучитьКлючЗаписиПодтвержденияОперации(Операция, Организация, Период) Экспорт
	Возврат РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьКлючЗаписи(Новый Структура("Операция, Организация, Период", Операция, Организация, Период)); 	
КонецФункции

Функция СледующийРабочийДень(ДеньОперации) Экспорт	
	Возврат Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, КонецДня(ДеньОперации) + 1, 1);
КонецФункции

#КонецОбласти

#Область Расшифровка_расчета_стоимости_ЦБ

// Выполняем запрос, заполняя расшифровку расчета
//
// Параметры:
//	РасшифровкаРасчета		- Структура					- расшифровка расчета или расшифровка операции
//	Запрос					- Запрос, РезультатЗапроса	- запрос для выполнения или его результат
//	ИмяОперации				- Строка					- имя добавляемой в расшифровку расчета операции, в которую будут помещены временные таблицы и результат запроса 
//							- Неопределено				- временные таблицы и результат запроса будут размещены на текущем уровне расшифровки расчета
//	ИмяРезультата			- Строка					- имя результата запроса (имеет смысл при ТипРезультатаЗапроса <> Неопределено)
//							- Неопределено				- результат не будет помещен в расшифровку расчета
//	ТипРезультатаЗапроса	- Строка					- тип возвращаемого результата (варианты "Выгрузка", "Выборка", "ВыборкаПоГруппировкам", "ВыгрузкаПоГруппировкам")
//							- Неопределено				- без возвращаемого результата
//	СписокТаблиц			- Строка					- строка разделенных запятыми временных таблиц, включаемых в расшифровку
//							- Неопределено				- все временные таблицы
//	ИсключаемыеТаблицы		- Строка					- строка разделенных запятыми временных таблиц, исключаемых из расшифровки
//							- Неопределено				- без исключения каких-либо временных таблиц
//	ВыводитьВСвернутомВиде	- Булево					- вывод добавляемой операции в свернутом виде (имеет смысл при ИмяОперации <> Неопределено)
//
// Возвращаемое значение:
//	ВыборкаИзРезультатаЗапроса, ТаблицаЗначений, Неопределено - результат запроса в соответствии с параметром ТипРезультатаЗапроса
//
Функция ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаРасчета, Запрос, ИмяОперации = Неопределено, ИмяРезультата = Неопределено, ТипРезультатаЗапроса = "Выгрузка", СписокТаблиц = Неопределено, ИсключаемыеТаблицы = Неопределено, ВыводитьВСвернутомВиде = Ложь) Экспорт
	
	ТребуетсяРасшифровка = (РасшифровкаРасчета <> Неопределено);
	
	Если ТребуетсяРасшифровка Тогда
		МенеджерВременныхТаблицБылИнициализирован = Истина;	
		Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда 
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			МенеджерВременныхТаблицБылИнициализирован = Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Запрос) = Тип("РезультатЗапроса") Тогда
		РезультатПоследнегоЗапроса = Запрос;	
	Иначе
		РезультатПоследнегоЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	Если ТипРезультатаЗапроса = "Выгрузка" Тогда
		ВозвращаемыйРезультат = РезультатПоследнегоЗапроса.Выгрузить();
	ИначеЕсли ТипРезультатаЗапроса = "Выборка" Тогда
		ВозвращаемыйРезультат = РезультатПоследнегоЗапроса.Выбрать();
	ИначеЕсли ТипРезультатаЗапроса = "ВыборкаПоГруппировкам" Тогда
		ВозвращаемыйРезультат = РезультатПоследнегоЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ИначеЕсли ТипРезультатаЗапроса = "ВыгрузкаПоГруппировкам" Тогда
		ВозвращаемыйРезультат = РезультатПоследнегоЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВозвращаемыйРезультат = Неопределено;
	КонецЕсли;
	
	Если ТребуетсяРасшифровка Тогда
		
		#Область Добавление_временных_таблиц_и_результата_запроса_в_расшифровку
		
		Если ИмяОперации = Неопределено Тогда
			РасшифровкаОперации = РасшифровкаРасчета;	
		Иначе
			РасшифровкаОперации = ДобавитьРасшифровкуОперации(РасшифровкаРасчета, ИмяОперации, , , ВыводитьВСвернутомВиде);
		КонецЕсли;
		
		// Если задан список таблиц или исключений, то оставляем в таблице только нужные
		
		Если СписокТаблиц <> Неопределено ИЛИ ИсключаемыеТаблицы <> Неопределено Тогда
			СписокТаблиц		= ?(СписокТаблиц = Неопределено, Неопределено, Новый Структура(СписокТаблиц));
			ИсключаемыеТаблицы	= ?(ИсключаемыеТаблицы = Неопределено, Неопределено, Новый Структура(ИсключаемыеТаблицы));
		КонецЕсли;
		
		// Параметры запроса
		
		Если ВключатьТаблицуВРасшифровку("ПараметрыЗапроса", СписокТаблиц, ИсключаемыеТаблицы) Тогда  	
			ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "ПараметрыЗапроса", Запрос.Параметры, "Параметры запроса", Истина, Истина);
		КонецЕсли;
			
		// Временные таблицы запроса
		
		Для Каждого ВременнаяТаблица Из Запрос.МенеджерВременныхТаблиц.Таблицы Цикл
			Если ВключатьТаблицуВРасшифровку(ВременнаяТаблица.ПолноеИмя, СписокТаблиц, ИсключаемыеТаблицы) Тогда
				ДобавитьРасшифровкуРезультатаОперации(
					РасшифровкаОперации,
					?(СтрНачинаетсяС(ВременнаяТаблица.ПолноеИмя, "_"), Сред(ВременнаяТаблица.ПолноеИмя, 2), ВременнаяТаблица.ПолноеИмя),
					ВременнаяТаблица.ПолучитьДанные().Выгрузить(), ,
					Ложь);
			КонецЕсли;
		КонецЦикла;
		
		// Полученные результаты запроса
		
		Если ВозвращаемыйРезультат <> Неопределено И ИмяРезультата <> Неопределено Тогда
		
			Если СтрНачинаетсяС(ТипРезультатаЗапроса, "Выборка") Тогда
				
				ТаблицаРезультат = Новый ТаблицаЗначений;
				Для Каждого Колонка Из РезультатПоследнегоЗапроса.Колонки Цикл
					ТаблицаРезультат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);	
				КонецЦикла;
				
				Пока ВозвращаемыйРезультат.Следующий() Цикл
				   ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(), ВозвращаемыйРезультат); 
				КонецЦикла;
				ВозвращаемыйРезультат.Сбросить();
				
			Иначе
				
				ТаблицаРезультат = ВозвращаемыйРезультат.Скопировать();	
				
			КонецЕсли;
			
			ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, ИмяРезультата, ТаблицаРезультат, , Ложь);
			
		КонецЕсли;
		
		Если Не МенеджерВременныхТаблицБылИнициализирован Тогда
			Запрос.МенеджерВременныхТаблиц = Неопределено;	
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	Возврат ВозвращаемыйРезультат;

КонецФункции

Функция ВключатьТаблицуВРасшифровку(ИмяТаблицы, СписокТаблиц, ИсключаемыеТаблицы)
	
	Если СписокТаблиц <> Неопределено И Не СписокТаблиц.Свойство(ИмяТаблицы) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Если ИсключаемыеТаблицы <> Неопределено И ИсключаемыеТаблицы.Свойство(ИмяТаблицы) Тогда
		Возврат Ложь;	
	КонецЕсли;			
	
	Возврат Истина;	
	
КонецФункции

// Добавляет расшифровку операции
//
// Параметры:
//   РасшифровкаРасчета - Структура - расшифровка расчета или расшифровка операции 
//   ИмяОперации - Строка, Неопределено - имя новой операции.
//										  Если параметр заполнен, то добавляется новая операция с результатом в расшифровку текущей операции,
//										  иначе результат добавляется в расшифровку текущей операции 
//   ИмяРезультата - Строка, Неопределено - имя результата операции 
//   Результат - Структура, ТаблицаЗначений, Неопределено - результат операции
//   ВыводитьОперациюВСвернутомВиде - Булево - операция будет выведена в отчете в свернутом виде
//   ВыводитьРезультатВСвернутомВиде - Булево - результат операции будет выведен в отчете в свернутом виде
//
Функция ДобавитьРасшифровкуОперации(РасшифровкаРасчета, ИмяОперации = Неопределено, ИмяРезультата = Неопределено, Результат = Неопределено, ВыводитьОперациюВСвернутомВиде = Ложь, ВыводитьРезультатВСвернутомВиде = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ИмяОперации) Тогда
		
		Операция = Новый Структура("Имя, Операции, ВыводитьВСвернутомВиде", ИмяОперации, Новый Массив, ВыводитьОперациюВСвернутомВиде);
		
		РасшифровкаРасчета.Операции.Добавить(Операция);
		
	Иначе
		
		Операция = РасшифровкаРасчета;
		
	КонецЕсли;
	
	// Добавляем результат при необходимости
	
	Если ЗначениеЗаполнено(ИмяРезультата) ИЛИ ЗначениеЗаполнено(Результат) Тогда
	
		ДобавитьРасшифровкуРезультатаОперации(Операция, ИмяРезультата, Результат, , ВыводитьРезультатВСвернутомВиде);
		
	КонецЕсли;		
		
	Возврат Операция;
	
КонецФункции

Функция ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, ИмяРезультата, Результат, ПредставлениеРезультата = Неопределено, ВыводитьВСвернутомВиде = Ложь, ТранспонироватьРезультат = Ложь) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		РезультатТаблица = Новый ТаблицаЗначений;
		Для Каждого ЭлементСтруктуры Из Результат Цикл
			РезультатТаблица.Колонки.Добавить(ЭлементСтруктуры.Ключ);		
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(РезультатТаблица.Добавить(), Результат);
	Иначе
		РезультатТаблица = Результат;
	КонецЕсли;
	
	Если ТранспонироватьРезультат Тогда
		
		#Область Транспонирование_таблицы_значений
		
		ОднаСтрока = (РезультатТаблица.Количество() = 1);
		
		ТранспонированнаяТаблица = Новый ТаблицаЗначений;
		ТранспонированнаяТаблица.Колонки.Добавить("Параметр");
		
		ПерваяКолонка = Истина;
		
		Для Каждого Колонка Из РезультатТаблица.Колонки Цикл
			
			СтрокаТранспонированная = ТранспонированнаяТаблица.Добавить();
			СтрокаТранспонированная.Параметр = ?(ЗначениеЗаполнено(Колонка.Заголовок), Колонка.Заголовок, Колонка.Имя);	
			
			НомерСтроки = 0;
			
			Для Каждого СтрокаТаблицы Из РезультатТаблица Цикл
				
				НомерСтроки = НомерСтроки + 1;
				
				Если ПерваяКолонка Тогда
					КолонкаТранспонированная = ТранспонированнаяТаблица.Колонки.Добавить("Значение" + НомерСтроки, , "Значение" + ?(ОднаСтрока, "", " " + НомерСтроки));
				КонецЕсли;
				
				СтрокаТранспонированная["Значение" + НомерСтроки] = СтрокаТаблицы[Колонка.Имя];
				
			КонецЦикла;			
			
			ПерваяКолонка = Ложь;
			
		КонецЦикла;
		
		РезультатТаблица = ТранспонированнаяТаблица;
		
		#КонецОбласти
		
	КонецЕсли;
	
	РезультатОперации = Новый Структура("Имя, Операции, ВыводитьВСвернутомВиде", ИмяРезультата, РезультатТаблица, ВыводитьВСвернутомВиде);
	Если ПредставлениеРезультата <> Неопределено Тогда
		РезультатОперации.Вставить("Представление", ПредставлениеРезультата);	
	КонецЕсли;
	
	Если ТипЗнч(РасшифровкаОперации.Операции) = Тип("ТаблицаЗначений") Тогда
		КопияОперации				 = РаботаСКоллекциями.СкопироватьСтруктуру(РасшифровкаОперации);
		РасшифровкаОперации.Операции = РаботаСКоллекциями.ЗначениеВМассив(КопияОперации);
	КонецЕсли;

	РасшифровкаОперации.Операции.Добавить(РезультатОперации);
	
	Возврат РезультатОперации;
	
КонецФункции

Процедура УстановитьПараметрыРасшифровкиРезультатаОперации(РасшифровкаРасчета, ИмяРезультата = Неопределено, Параметры) Экспорт
	
	Для Каждого РезультатОперации Из РасшифровкаРасчета.Операции Цикл
			
		Если РезультатОперации.Имя = ИмяРезультата ИЛИ ИмяРезультата = Неопределено Тогда
			РаботаСКоллекциями.ДополнитьСтруктуру(РезультатОперации, Параметры, Истина);	
		КонецЕсли;
		
		Если ТипЗнч(РезультатОперации.Операции) <> Тип("ТаблицаЗначений") Тогда
			УстановитьПараметрыРасшифровкиРезультатаОперации(РезультатОперации, ИмяРезультата, Параметры);	
		КонецЕсли;
			
	КонецЦикла;	
	
КонецПроцедуры

Функция НайтиОперациюРасшифровкиРасчета(РасшифровкаРасчета, ИмяОперации, ВключатьПодчиненные = Ложь) Экспорт
	
	Для Каждого РезультатОперации Из РасшифровкаРасчета.Операции Цикл
		
		Если РезультатОперации.Имя = ИмяОперации Тогда
			
			Возврат РезультатОперации;			
			
		ИначеЕсли ВключатьПодчиненные И ТипЗнч(РезультатОперации.Операции) <> Тип("ТаблицаЗначений") Тогда
			
			Возврат НайтиОперациюРасшифровкиРасчета(РезультатОперации, ИмяОперации, ВключатьПодчиненные);	
			
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Формирует расшифровку расчета справедливой стоимости ценной бумаги по методике клиента 
//
// Параметры:
//	Отчет					- ТабличныйДокумент										- выходной параметр, возвращает отчет с расшифровкой
//	ПараметрыПереоценки		- ДокументОбъект.РегистрацияСтоимостиПереоценки			- документ
//							- Структура												- в структуре передавать значения реквизитов документа РегистрацияСтоимостиПереоценки 
//	ЦеннаяБумага			- ОпределяемыйТип.ЦенныеБумаги							- 
//	ВариантРасчета			- СправочникСсылка.ВариантыРасчетаОценочнойСтоимости	- методика расчета справедливой стоимости
//	АдресТаблицыСтоимостей	- Строка, ТаблицаЗначений								- см. параметр
//	Ошибки					- Массив												- выходной параметр, возвращает массив ошибок, возникших при расшифровке
//
// Возвращаемое значение:
//	Булево - Истина, если удалось выполнить расшифровку, Ложь - в противном случае
//
Функция СформироватьРасшифровкуРасчетаСтоимостиЦеннойБумаги(Отчет, ПараметрыПереоценки, ЦеннаяБумага, ВариантРасчета, Знач АдресТаблицыСтоимостей = Неопределено, Ошибки = Неопределено) Экспорт
	
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	РасшифровкаРасчета = Новый Структура;
	РасшифровкаРасчета.Вставить("ЦеннаяБумага",	ЦеннаяБумага);
	РасшифровкаРасчета.Вставить("Операции",		Новый Массив);
	
	УстановитьПривилегированныйРежим(Истина); // временное решение, т.к. если у пользователя нет права на создание документа, то и расшифровка не сформируется
	
	РегистрацияСтоимостиПереоценки = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(РегистрацияСтоимостиПереоценки, ПараметрыПереоценки);

	ОценкаПрочихЦенныхБумаг = Ложь;
	ПараметрыПереоценки.Свойство("ОценкаПрочихЦенныхБумаг", ОценкаПрочихЦенныхБумаг);
	
	ОценкаПрочихЦенныхБумаг = ?(ОценкаПрочихЦенныхБумаг = Неопределено, Ложь, ОценкаПрочихЦенныхБумаг);
	
	РегистрацияСтоимостиПереоценки.ЗаполнитьСтоимостьПереоценки(Ложь, Ложь, Ложь, АдресТаблицыСтоимостей, Ложь, РасшифровкаРасчета,, ОценкаПрочихЦенныхБумаг);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РасшифровкаРасчета.Операции.Количество() = 0 Тогда
		Возврат Ложь;		
	КонецЕсли;	
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Вариант расчета справедливой стоимости: " + ВариантРасчета,,, Отчет);
	ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
	
	СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьРасшифровкуОперации(Операция, ПараметрыВывода) Экспорт
	
	ВыводитьВСвернутомВиде = Операция.Свойство("ВыводитьВСвернутомВиде") И Операция.ВыводитьВСвернутомВиде;
	
	Если Операция.Свойство("Имя") Тогда
		ПараметрыВывода.ЗаголовокТаблицы.Параметры.Поле = ?(Операция.Свойство("Представление"), Операция.Представление, Операция.Имя);			
		ПараметрыВывода.ДокументРезультат.Вывести(ПараметрыВывода.ЗаголовокТаблицы);
		ПараметрыВывода.ДокументРезультат.НачатьГруппуСтрок(, Не ВыводитьВСвернутомВиде);
		ПараметрыВывода.ДокументРезультат.Вывести(ПараметрыВывода.РазделительТаблиц);
	КонецЕсли;
	
	// Результаты операции
	
	Для Каждого РезультатОперации Из Операция.Операции Цикл
		
		Если ТипЗнч(РезультатОперации.Операции) = Тип("ТаблицаЗначений") Тогда
			
			ТаблицаЗначений = РезультатОперации.Операции;
			Если ТаблицаЗначений.Колонки.Найти("Период") <> Неопределено Тогда
				ТаблицаЗначений.Сортировать("Период");	
			КонецЕсли;
			
			РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
				ПараметрыВывода,
				ТаблицаЗначений,
				Неопределено,
				?(РезультатОперации.Свойство("Представление"), РезультатОперации.Представление, РезультатОперации.Имя),
				РезультатОперации.ВыводитьВСвернутомВиде,
				Истина);
			
		Иначе
			
			СформироватьРасшифровкуОперации(РезультатОперации, ПараметрыВывода);	
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если Операция.Свойство("Имя") Тогда
		ПараметрыВывода.ДокументРезультат.ЗакончитьГруппуСтрок();
		ПараметрыВывода.ДокументРезультат.Вывести(ПараметрыВывода.РазделительТаблиц);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

Функция ПолучитьСчетДляУчета(СчетДоверительногоУправления) Экспорт

	Возврат Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления);

КонецФункции
 
Функция ЗапрещенПрямойПереводНаСчетаБиржи(Объект, Отказ) Экспорт
	
	// Для клиентов ПФР и ГСК Югория нельзя переводить дс напрямую с расчетных счетов на биржевые секции если у брокера не доступна роль "Банк"
	// Все переводы с расчетных счетов на биржу и наоборот должны осуществляться через внебиржу брокера.
	Если Не ДействуетКонтрольПрямыхПереводНаСчетаБиржи(Объект.СчетДоверительногоУправления) Тогда
		Возврат Ложь;	
	КонецЕсли;
		
	Если Объект.Брокер <> Объект.БрокерПолучатель И (НеобходимКонтрольПереводовБрокера(Объект.Брокер) И Объект.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок 
		Или НеобходимКонтрольПереводовБрокера(Объект.БрокерПолучатель) И Объект.МестоХраненияПолучатель <> Справочники.МестаХранения.ВнебиржевойРынок) Тогда 
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета доверительного управления [" + Объект.СчетДоверительногоУправления + "] запрещены прямые вводы/выводы денежных средств с биржевых секций. Переводы должны осуществляться через внебиржевую секцию брокера!",,,, Отказ);
		Возврат Истина;
		
	Иначе
		Возврат Ложь;		
	КонецЕсли;
	
КонецФункции

Функция ДействуетКонтрольПрямыхПереводНаСчетаБиржи(СчетДоверительногоУправления) Экспорт
	
	Возврат ЗначениеЗаполнено(СчетДоверительногоУправления) И (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР
		Или СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ГСК_ЮГОРИЯ"));
	
КонецФункции
	
Функция НеобходимКонтрольПереводовБрокера(Брокер) Экспорт
	//Если Юрфиз лицу брокерской компании доступна роль банка - не нужно контролировать переводы с/на счета брокера
	Возврат (ЗначениеЗаполнено(Брокер) И Не ЗначениеЗаполнено(Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Брокер.ЮрФизЛицо, "Банки")));
	    
КонецФункции

// Проверяет обязательные реквизиты у поручений на движение ДС, вводов и выводов ДС по договорам НПФ
//	Параметры
//		Объект - ДокументОбъект - проверяемый документ
//		Отказ  - Булево
//
Процедура ПроверитьРеквизитыВводаВыводаДенежныхСредств(Объект, Отказ) Экспорт
	
	ТипДокумента = ТипЗнч(Объект);
	Если Не (ТипДокумента = Тип("ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств")
			Или ТипДокумента = Тип("ДокументОбъект.ВводДенежныхСредств")
			Или ТипДокумента = Тип("ДокументОбъект.ВыводДенежныхСредств")) Тогда
		Возврат;
	КонецЕсли;
	
	// Для портфелей НПФ не проводим без заполнения обязательных реквизитов
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	Если Объект.Дата >= ДатаНачалаПроверкиЗаполненияКонтрагентаВоВводахВыводахДенежныхСредствИЦенныхБумагКлиентовНПФ() 
			И (ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
			Или ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами
			Или ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов) Тогда
			
	    ТекстОшибки = "";
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ТекстОшибки = "Не указан контрагент";
		КонецЕсли;
		
		Если ПустаяСтрока(Объект.КонтрагентДоговорТекстом) Тогда
			ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Не заполнен текст контрагента";
		КонецЕсли;
		
		Если ТипДокумента = Тип("ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств") Тогда			
			Если Объект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская 
				И Не Объект.ПоручениеНаПереводМеждуСчетамиДУ 
				И Не ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
				ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Не заполнен расчетный счет контрагента";
			КонецЕсли;   			
		ИначеЕсли Не ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда
			ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Не заполнен расчетный счет контрагента";
		КонецЕсли;
		
		// Временно отключена проверка, т. к. допник не еще не подписан
		//Если ТипДокумента <> Тип("ДокументОбъект.ВыводДенежныхСредств") Тогда
		//	// Проверяем номер и дату входящего документа (в выводе этих реквизитов нет)
		//	Если ПустаяСтрока(Объект.НомерВходящегоДокумента) Тогда
		//		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Не указан номер входящего документа";
		//	КонецЕсли;	
		//	Если Объект.ДатаВходящегоДокумента = '00010101' Тогда
		//		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Не указана дата входящего документа";
		//	КонецЕсли;	                                                                  			
		//КонецЕсли;		
		
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка,,, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры	

Функция СчетДоверительногоУправленияПоЛицензииПоУправлениюЦеннымиБумагами(Дата, СчетДоверительногоУправления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",							Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ЕСТЬNULL(МАКСИМУМ(ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует), ЛОЖЬ) КАК НужнаПроверка
	    |ИЗ
	    |	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(
	    |			&Период,
	    |			СчетДоверительногоУправления = &СчетДоверительногоУправления
	    |				И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НужнаПроверка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#Область Согласование_поручений_на_вывод_активов

// Возвращает дату, с которой запущен механизм согласования поручений на вывод активов
Функция ДатаНачалаСогласованияПорученийНаВыводАктивов() Экспорт
	
	Возврат '20221021';
	
КонецФункции	

// Проверяет, требуется ли согласовывать поручение на вывод активов
//
// Параметры:
// 	РеквизитыПоручения - Структура с реквизитами поручения на вывод денежных средств или ценных бумаг
//						 либо объект документа такого поручения
Функция ТребуетсяСогласованиеПорученияНаВыводАктивов(РеквизитыПоручения) Экспорт
	
	// Документы по ИИС, а также поручения на ввод активов не нужно согласовывать
	// Кроме этого, согласование применяется только в РЭМе и Трасте
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПоручения.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	УК_РЭМ = РеквизитыПоручения.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
	УК_Траст = РеквизитыПоручения.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
	
	//Клиентский отдел согласовывает поручения физ.лиц
	// + при наличии свойства формируется оповещение для клиентского отдела (при проведении, изменении, отмене проведения).
	Если ТипЗнч(РеквизитыПоручения) = Тип("ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств")
		И РеквизитыПоручения.СпособПередачи <> Перечисления.СпособыПередачиПоручений.ВнутренняяСистема 
		И ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица Тогда 
					
		РеквизитыПоручения.ДополнительныеСвойства.Вставить("ТребуетсяПодтверждениеКлиентскогоОтдела");
			
		Если РеквизитыПоручения.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Если РеквизитыПоручения.Дата < ДатаНачалаСогласованияПорученийНаВыводАктивов() 
		Или ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет 
		Или РеквизитыПоручения.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская 
		Или Не (УК_РЭМ Или УК_Траст) 
		Или Не РеквизитыПоручения.Проведен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(РеквизитыПоручения) = Тип("ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств") Тогда
		РеквизитыПоручения.ДополнительныеСвойства.Вставить("ТребуетсяСогласованиеПорученияНаВыводАктивов");
	КонецЕсли;
			
	Возврат Истина;
		
КонецФункции

// Проверяет, отменен ли бизнес-процесс согласования поручения
//
// 	Параметры:
//		- ДокументСсылка - ссылка на документ ПоручениеНаДвижениеДенежныхСредств, ПоручениеНаДвижениеЦенныхБумаг
//
Функция ПоручениеНаВыводАктивовОтменено(ДокументСсылка) Экспорт 
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СогласованиеПорученийНаВыводАктивов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеПорученийНаВыводАктивов КАК СогласованиеПорученийНаВыводАктивов
		|ГДЕ
		|	СогласованиеПорученийНаВыводАктивов.Организация = &Организация
		|	И СогласованиеПорученийНаВыводАктивов.Основание = &Основание
		|	И НЕ СогласованиеПорученийНаВыводАктивов.ПометкаУдаления
		|	И СогласованиеПорученийНаВыводАктивов.Отменен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СогласованиеПорученийНаВыводАктивов.Отменен");

	Запрос.УстановитьПараметр("Основание",		ДокументСсылка);
	Запрос.УстановитьПараметр("Организация", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Организация"));
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Получает карту маршрута бизнес-процесса согласования поручения на вывод денежных средств или ценных бумаг
//
//	Параметры:
//		ДокументСсылка - ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств, ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг - поручение на согласовании
// 		Организация - Организация
//
Функция ПолучитьКартуСогласованияПорученияНаВыводАктивов(ДокументСсылка, Организация) Экспорт
		
	//Ищем бизнес-процесс согласования этого поручения
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СогласованиеПорученийНаВыводАктивов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеПорученийНаВыводАктивов КАК СогласованиеПорученийНаВыводАктивов
		|ГДЕ
		|	СогласованиеПорученийНаВыводАктивов.Организация = &Организация
		|	И СогласованиеПорученийНаВыводАктивов.Основание = &Основание
		|	И НЕ СогласованиеПорученийНаВыводАктивов.ПометкаУдаления
		|	И СогласованиеПорученийНаВыводАктивов.Стартован
		|
		|УПОРЯДОЧИТЬ ПО
		|	СогласованиеПорученийНаВыводАктивов.Отменен";
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Основание",		ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
	
#КонецОбласти

#Область Сверка_со_списком_недействительных_паспортов

// Возвращает дату, с которой полностью запущен механизм сверки со списком недействительных паспортов
Функция ДатаНачалаСверкиСоСпискомНедействительныхПаспортов() Экспорт
	
	Возврат '20230217';
	
КонецФункции	

// Запускает отложенную сверку со списком недействительных паспортов 
// из документов ПоручениеНаДвижениеДенежныхСредств, ПоручениеНаДвижениеЦенныхБумаг
//
//	Параметры: 
//		- ДокументОбъект 	- объект документа ПоручениеНаДвижениеДенежныхСредств или ПоручениеНаДвижениеЦенныхБумаг
//
Процедура ВыполнитьСверкуСоСпискомНедействительныхПаспортовОтложенноПоПоручениюНаВыводАктивов(ДокументОбъект) Экспорт
	
	Если Не ((ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств")
		Или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоручениеНаДвижениеЦенныхБумаг")) 
		И ДокументОбъект.Дата > ДатаНачалаСверкиСоСпискомНедействительныхПаспортов()) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Или ДокументОбъект.ВыводВсехАктивов Тогда
		
		МассивЮрФизЛиц = МассивЮрФизЛицДляСверкиСоСпискомНедействительныхПаспортов(ДокументОбъект.СчетДоверительногоУправления, ДокументОбъект.Контрагент, ДокументОбъект.Дата);
		
		// В массиве не более двух элементов
		Для Каждого ЮрФизЛицо Из МассивЮрФизЛиц Цикл
			РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомНедействительныхПаспортовОтложенно(ДокументОбъект.Организация, ЮрФизЛицо);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

// Проверяет результат отложенной сверки со списком недействительных паспортов
// из документов ВыводДенежныхСредств, ВыводЦенныхБумаг
//
//	Параметры: 
//		- ДокументОбъект 	- объект документа ВыводДенежныхСредств или ВыводЦенныхБумаг
//
Функция ПройденаОтложеннаяСверкаСоСпискомНедействительныхПаспортовПриВыводеАктивов(ДокументОбъект) Экспорт
	
	// Проверяем только выводы ДС и ЦБ
	ТипДокумента = ТипЗнч(ДокументОбъект);
	Если Не ((ТипДокумента = Тип("ДокументОбъект.ВыводДенежныхСредств")
		Или ТипДокумента = Тип("ДокументОбъект.ВыводЦенныхБумаг"))
		И ДокументОбъект.Дата > ДатаНачалаСверкиСоСпискомНедействительныхПаспортов()) Тогда
		Возврат Истина;
	КонецЕсли;
		
	Поручение = ?(ТипДокумента = Тип("ДокументОбъект.ВыводДенежныхСредств"), ДокументОбъект.Основание, ДокументОбъект.Поручение);
	
	Отказ = Ложь;	
	
	МассивЮрФизЛиц = МассивЮрФизЛицДляСверкиСоСпискомНедействительныхПаспортов(ДокументОбъект.СчетДоверительногоУправления, ДокументОбъект.Контрагент, ДокументОбъект.Дата);
	
	// В массиве не более двух элементов
	Для Каждого ЮрФизЛицо Из МассивЮрФизЛиц Цикл
		РегистрыСведений.ЖурналСверкиСоСписками.ПроверитьРезультатОтложеннойСверкиСоСпискомНедействительныхПаспортов(
					ДокументОбъект.Организация, 
					ЮрФизЛицо, 
					НачалоДня(ДокументОбъект.Дата),
					НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поручение, "Дата")),				
					Отказ);			
	КонецЦикла;					
					
	Возврат Не Отказ;
	
КонецФункции

// Возвращает массив из одного или двух элементов справочника юр./физ. лиц для сверки со списком недействительных паспортов при выводе активов
// 
//	Параметры:
//		- СчетДоверительногоУправления 	- владелец активов
//		- Контрагент 					- юр./физ. лицо, которому выводятся активы
//		- Дата 							- дата вывода или поручения на вывод
//
Функция МассивЮрФизЛицДляСверкиСоСпискомНедействительныхПаспортов(СчетДоверительногоУправления, Контрагент, Дата)
	
	// Для умершего клиента проверяем паспорт контрагента
	// Если клиент жив, но активы выводятся другому физ. лицу, проверяем паспорта обоих
	
	МассивЮрФизЛицДляПроверки = Новый Массив;
	
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата);
	Если Справочники.СчетаДоверительногоУправления.ЭтоУмершийКлиент(СчетДоверительногоУправления, Дата) Тогда
		МассивЮрФизЛицДляПроверки.Добавить(Контрагент);
	ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		МассивЮрФизЛицДляПроверки.Добавить(Контрагент);
	ИначеЕсли Клиент <> Контрагент Тогда
		МассивЮрФизЛицДляПроверки.Добавить(Контрагент);
		МассивЮрФизЛицДляПроверки.Добавить(Клиент);
	Иначе
		МассивЮрФизЛицДляПроверки.Добавить(Клиент);
	КонецЕсли;
	
	Возврат МассивЮрФизЛицДляПроверки;
	
КонецФункции

#КонецОбласти

#Область Поручения_и_вводы_выводы_активов

Процедура ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииПоручения(Объект, Отказ) Экспорт
	
	ТекстСообщения = "";
	ПоручениеСсылка = Неопределено;
	ОбъектСсылка = Объект.Ссылка;
	ТипДокумента = ТипЗнч(ОбъектСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.ВводДенежныхСредств") Или ТипДокумента = Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда
		ПоручениеСсылка = Объект.Основание;			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыводЦенныхБумаг") Или ТипДокумента = Тип("ДокументСсылка.СписаниеЗадолженностейПоПоручению") Тогда
     	ПоручениеСсылка = Объект.Поручение;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПоручениеСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (ТипЗнч(ПоручениеСсылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Или ТипЗнч(ПоручениеСсылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг")) Тогда
		Возврат;
	КонецЕсли;
	
	//1. Если поручение на вывод денежных средств или ценных бумаг:
	//		1.1 Нельзя создавать вывод активов, если поручение не согласовано
	Если (ТипДокумента = Тип("ДокументСсылка.ВыводДенежныхСредств") Или ТипДокумента = Тип("ДокументСсылка.ВыводЦенныхБумаг")) Тогда
		
		РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоручениеСсылка, "Дата, Организация, СчетДоверительногоУправления, ТипЗадолженности, Проведен");
		РеквизитыПоручения.Вставить("Ссылка", ПоручениеСсылка);
		
		Если ТребуетсяСогласованиеПорученияНаВыводАктивов(РеквизитыПоручения)
			И Не ПоручениеНаВыводАктивовСогласовано(ПоручениеСсылка, ТекущаяДата()) Тогда
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать документ вывода активов, пока поручение не согласовано",,,, Отказ);
			Возврат;
			
		КонецЕсли;
	
	КонецЕсли;
		
	ВыводВсехАктивов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоручениеСсылка, "ВыводВсехАктивов");
	
	//	1.2 для поручения на движение ЦБ, если это не вывод всех активов, нельзя создавать ввод/вывод денежных средств
	Если ТипЗнч(ПоручениеСсылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг") 
		И (Не ВыводВсехАктивов)
		И (ТипДокумента = Тип("ДокументСсылка.ВводДенежныхСредств") Или ТипДокумента = Тип("ДокументСсылка.ВыводДенежныхСредств")) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать документ ввода/вывода денежных средств на основании поручения на движение ценных бумаг",,,, Отказ);
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(ПоручениеСсылка) <> Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
		Возврат;
	КонецЕсли;
	
	//2. Если поручение на вывод всех активов:
	//		2.1 нельзя создавать ввод денежных средств.
	//		2.2 нельзя создавать списание задолженности, если на основании поручения уже создан вывод ДС/ЦБ.
	//		2.3 нельзя создавать выводы ДС/ЦБ, если на основании поручения создано списание задолженности (отмена поручения).
	//3. Если поручение НЕ на вывод всех активов:
	//		3.1 нельзя создавать вывод ценных бумаг.
	//		3.2 нельзя создавать подчиненные документы при отсутствии задолженности по поручению.   	
		
	Если ВыводВсехАктивов Тогда
		
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.ВводДенежныхСредств") Тогда
				
			ТекстСообщения = "Нельзя создавать документ [Ввод денежных средств] на основании поручения на вывод всех активов!";
			
		ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.СписаниеЗадолженностейПоПоручению") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СписаниеЗадолженностейПоПоручению.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СписаниеЗадолженностейПоПоручению КАК СписаниеЗадолженностейПоПоручению
				|ГДЕ
				|	СписаниеЗадолженностейПоПоручению.Проведен
				|	И СписаниеЗадолженностейПоПоручению.Поручение = &Поручение
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	ВыводДенежныхСредств.Ссылка КАК Ссылка 
				|ИЗ
				|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
				|ГДЕ
				|	ВыводДенежныхСредств.Проведен
				|	И ВыводДенежныхСредств.Основание = &Поручение
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	ВыводЦенныхБумаг.Ссылка
				|ИЗ
				|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
				|ГДЕ
				|	ВыводЦенныхБумаг.Проведен
				|	И ВыводЦенныхБумаг.Поручение = &Поручение";
			
			Запрос.УстановитьПараметр("Поручение", ПоручениеСсылка);
				
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				ТекстСообщения = ТекстСообщения + ?(ТекстСообщения = "", "", Символы.ПС) + "На основании поручения создан документ [" + Выборка.Ссылка  + "].";	
			КонецЦикла;
								
		Иначе
				
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СписаниеЗадолженностейПоПоручению.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СписаниеЗадолженностейПоПоручению КАК СписаниеЗадолженностейПоПоручению
				|ГДЕ
				|	СписаниеЗадолженностейПоПоручению.Проведен
				|	И СписаниеЗадолженностейПоПоручению.Поручение = &Поручение";
			
			Запрос.УстановитьПараметр("Поручение", ПоручениеСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ТекстСообщения = ТекстСообщения + ?(ТекстСообщения = "", "", Символы.ПС) + "На основании поручения создан документ [" + Выборка.Ссылка  + "]."; 	
			КонецЦикла;
				
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
			
			ТекстСообщения = "Документ [Вывод ценных бумаг] можно создавать на основании поручений на вывод всех активов!";
			
		ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.СписаниеЗадолженностейПоПоручению") Тогда
			//У документа нет реквизита сумма, поэтому необходимо проверить задолженность по поручению
			Запрос = Новый Запрос;
			Запрос.Текст = 
	           "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	           |	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток КАК Сумма
	           |ИЗ
	           |	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
	           |			,
	           |			Основание = &Основание
	           |				И ТипЗадолженности = &ТипЗадолженности) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
	           |ГДЕ
	           |	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток > 0";
           
			РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоручениеСсылка, "ТипЗадолженности, Основание");
			
			Запрос.УстановитьПараметр("Основание", ?(ЗначениеЗаполнено(РеквизитыПоручения.Основание), РеквизитыПоручения.Основание, ПоручениеСсылка));
			Запрос.УстановитьПараметр("ТипЗадолженности", РеквизитыПоручения.ТипЗадолженности);
                                                                          
		   Если Запрос.Выполнить().Пустой() Тогда
			   ТекстСообщения = ТекстСообщения + ?(ТекстСообщения = "", "", Символы.ПС) + "Отсутствует задолженность денежных средств по поручению.";
           КонецЕсли;
			
		ИначеЕсли Объект.Сумма = 0 Тогда
			//В обработке заполнения данные заполняются из регистра "задолженности дс по поручениям" - если сумма 0, значит задолженность отсутствует.
			ТекстСообщения = "Отсутствует задолженность денежных средств по поручению.";	
				
		КонецЕсли;
			
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекстКонтрагентаДляВводовВыводовДенежныхСредств(Организация, Контрагент, РасчетныйСчет, ПереводВнутриУК, Дата) Экспорт

	// При переводе между портфелями внутри УК устанавливаем наименование получателя из договора к расчетному счету и номер/дату договора ДУ;
	// иначе - краткое наименование по уставу (для физ. лица - ФИО) контрагента
	
	Если ПереводВнутриУК Тогда
		
		// Определим дату и номер договора ДУ из исполнителя по ДС
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Договор.НаименованиеВладельцаДляДокументов КАК НаименованиеВладельцаДляДокументов,
			|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
			|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
			|ГДЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
			|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет
			|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &Дата
			|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");
		
		Запрос.УстановитьПараметр("Дата", 			Дата);
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("РасчетныйСчет", 	РасчетныйСчет);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.НаименованиеВладельцаДляДокументов + ", договор ДУ " + Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаЗаключения, "ДФ=dd.MM.yyyy");
		Иначе			
			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчет, "Договор.НаименованиеВладельцаДляДокументов");
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(РеквизитыАнкетные.КраткоеНаименованиеПоУставу, Реквизиты.КраткоеНаименованиеПоУставу) КАК Наименование
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|			&Период,
			|			ЮрФизЛицо = &ЮрФизЛицо
			|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК Реквизиты
			|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И ЮрФизЛицо = &ЮрФизЛицо
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыАнкетные
			|		ПО (ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РеквизитыАнкетные.Фамилия + "" "" + РеквизитыАнкетные.Имя + "" "" + РеквизитыАнкетные.Отчество
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыАнкетные");
		
		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("Период", 		Дата);
		Запрос.УстановитьПараметр("ЮрФизЛицо", 		Контрагент);
						
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Наименование;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдены данные по " + СокрЛП(Контрагент), Контрагент);
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
					
// Возвращет значение (0, 1, 2) для значения реквизита формы "ТипПередачи"
// для наглядного отражения куда/откуда был введен/выведен актив
//	0 - клиент
//	1 - другой портфель
//	2 - сторонее юр.физ лицо, другая УК
//
Функция ПолучитьТипПередачиДляВводаВыводаАктивов(Дата, Организация, СчетДоверительногоУправления, Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат 0;
	КонецЕсли;
	
	ЮрФизЛицоСчетаДУ = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(СчетДоверительногоУправления, Дата);
	ЮрФизЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо");
		
	Если Контрагент = ЮрФизЛицоСчетаДУ  Тогда
		Возврат 0;		
	ИначеЕсли Контрагент = ЮрФизЛицоОрганизации Тогда
		Возврат 1;
	Иначе	
		Возврат 2;		
	КонецЕсли;
	
КонецФункции

Функция ДатаНачалаПроверкиЗаполненияКонтрагента(ЭтоПоручениеНаВыводЦенныхБумаг = Ложь) Экспорт
	
	// Реквизит Контрагент добавлен в поручение на вывод ЦБ позже всех, поэтому отдельныя дата контроля
	Если ЭтоПоручениеНаВыводЦенныхБумаг Тогда		
		Возврат '20230519';
	Иначе
		Возврат '20230505';
	КонецЕсли;
	
КонецФункции

Функция ДатаНачалаПроверкиЗаполненияКонтрагентаВоВводахВыводахДенежныхСредствИЦенныхБумагКлиентовНПФ(ЭтоПоручениеНаВыводЦенныхБумаг = Ложь) Экспорт
	
	// Реквизит Контрагент добавлен в поручение на вывод ЦБ позже всех, поэтому отдельныя дата контроля
	Если ЭтоПоручениеНаВыводЦенныхБумаг Тогда
		Возврат ДатаНачалаПроверкиЗаполненияКонтрагента(ЭтоПоручениеНаВыводЦенныхБумаг);
	Иначе
		Возврат '20220711';
	КонецЕсли;
	
КонецФункции

Функция ДатаНачалаПроверкиВыгодоприобретателяПриВыводеАктивов() Экспорт
	
	Возврат '20230519';
	
КонецФункции

Функция ДатаНачалаПроверкиЗаполненияДатыИсполненияПоручения(Объект)
	
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг") Тогда
		
		Возврат '20211215';
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
		
		Возврат '20210730';
		
	КонецЕсли;
	
КонецФункции

Функция ДатаНачалаПроверкиСоответствияДатыИсполнения()
	
	Возврат '20230714';
	
КонецФункции

Функция ДатаНачалаКонтроляАкцептов() Экспорт
	
	Возврат '20250926';
	
КонецФункции

// Контролирует, что вывод активов контрагенту-физ. лицу производится либо физ. лицу-выгодоприобретателю, либо самому клиенту
// 
// 	Параметры:
//		- ДокументОбъект - поручение на вывод или сам вывод активов
//
Функция РазрешенВыводАктивовКонтрагенту(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.Дата < ДатаНачалаПроверкиВыгодоприобретателяПриВыводеАктивов() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТипДокумента = ТипЗнч(ДокументОбъект);
	Если Не (((ТипДокумента = Тип("ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств") 
						Или ТипДокумента = Тип("ДокументОбъект.ПоручениеНаДвижениеЦенныхБумаг")) 
						И ДокументОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская)			
			Или ТипДокумента = Тип("ДокументОбъект.ВыводДенежныхСредств")
			Или ТипДокумента = Тип("ДокументОбъект.ВыводЦенныхБумаг")) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ДокументОбъект.СчетДоверительногоУправления, ДокументОбъект.Дата);
	
	Если ТипЗнч(Клиент) <> Тип("СправочникСсылка.ЮрФизЛица") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Клиент, "ВидЮрФизЛица") = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо 		
		И ЗначениеЗаполнено(ДокументОбъект.Контрагент) 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Контрагент, "ВидЮрФизЛица") = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо
		И Клиент <> ДокументОбъект.Контрагент Тогда
		
		Возврат РаботаСНормативноСправочнойИнформацией.КонтрагентЯвляетсяВыгодоприобретателемКлиентаФизическогоЛица(ДокументОбъект.Организация, 
																													Клиент, 
																													ДокументОбъект.Контрагент, 
																													ДокументОбъект.Дата);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

//Осуществляется проверка дат исполнения поручений с реальной датой подчиненных документов (вводов/выводов)
Процедура ПроверитьДатуИсполненияПоручения(Объект, Отказ) Экспорт
	
	Если Объект.Дата < ДатаНачалаПроверкиСоответствияДатыИсполнения() Тогда
		Возврат;
	КонецЕсли;
	
	ТипДокумента = ТипЗнч(Объект.Ссылка);
	ОснованиеСтр = "";

	Если ТипДокумента = Тип("ДокументСсылка.ВводДенежныхСредств") 
		Или ТипДокумента = Тип("ДокументСсылка.ВыводДенежныхСредств") 
		Или ТипДокумента = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		
		ОснованиеСтр = "Основание";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВводЦенныхБумаг") Или ТипДокумента = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
     	ОснованиеСтр = "Поручение";
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ОснованиеСтр) Тогда
		Возврат;
	КонецЕсли;
	
	ПоручениеСсылка = Объект[ОснованиеСтр];
	
	Если ТипЗнч(ПоручениеСсылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
		
		РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоручениеСсылка, "Дата, ДатаИсполненияС, ДатаИсполненияПо");
		
	ИначеЕсли ТипЗнч(ПоручениеСсылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг") Тогда
		
		РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоручениеСсылка, "Дата, ДатаИсполненияПо");
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
		
	Если РеквизитыПоручения.Дата >= ДатаНачалаПроверкиЗаполненияДатыИсполненияПоручения(ПоручениеСсылка) Тогда
		
		Если ТипДокумента = Тип("ДокументСсылка.ВводДенежныхСредств") Или ТипДокумента = Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда
			
			Если ТипЗнч(ПоручениеСсылка) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") И Объект.Дата < РеквизитыПоручения.ДатаИсполненияС Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа меньше даты исполнения [" + Формат(РеквизитыПоручения.ДатаИсполненияС, "ДФ=dd.MM.yyyy") + "] документа основания", Объект, "Дата",, Отказ);
				Возврат;	
			КонецЕсли;
				
			Если НачалоДня(Объект.Дата) > РеквизитыПоручения.ДатаИсполненияПо Тогда
				
				// Бывают исключительные ситуации, когда документы ввода/вывода проводятся после крайнего срока исполнения поручения
				// Для таких документов указывается доп. сведение
				
				Запрос = Новый Запрос(
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЗначенияДополнительныхСведений.Значение КАК Значение
					|ИЗ
					|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
					|ГДЕ
					|	ЗначенияДополнительныхСведений.Объект = &Объект
					|	И ЗначенияДополнительныхСведений.Свойство.Ключ = ""РазрешитьПроведениеПослеКрайнейДатыИсполненияПоручения"""); 
				
				Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				РазрешеноПроведениеПослеДатыИсполненияПоручения = Ложь;
				Если Выборка.Следующий() Тогда
					РазрешеноПроведениеПослеДатыИсполненияПоручения = Выборка.Значение;	
				КонецЕсли;
				
				Если Не РазрешеноПроведениеПослеДатыИсполненияПоручения Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа больше даты исполнения [" + Формат(РеквизитыПоручения.ДатаИсполненияПо, "ДФ=dd.MM.yyyy") + "] документа основания", Объект, "Дата",, Отказ);					
				КонецЕсли;
				
			КонецЕсли;		
				
		ИначеЕсли ТипДокумента = Тип("ЗадачаСсылка.ЗадачаИсполнителя") И ЗначениеЗаполнено(Объект.ДатаВыполнения) Тогда
			
			Если Объект.ТочкаМаршрута = БизнесПроцессы.СогласованиеПорученийНаВыводАктивов.ТочкиМаршрута.СогласованиеОтделомСопровожденияОпераций Тогда
				
				Если НачалоДня(Объект.ДатаВыполнения) < РеквизитыПоручения.ДатаИсполненияС
					Или НачалоДня(Объект.ДатаВыполнения) > РеквизитыПоручения.ДатаИсполненияПо Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата согласования [" + Формат(НачалоДня(Объект.ДатаВыполнения), "ДФ=dd.MM.yyyy") + "] задачи [" + Объект.Наименование + "] должна соответствовать периоду исполнения поручения [" + Формат(РеквизитыПоручения.ДатаИсполненияС, "ДФ=dd.MM.yyyy") + "-" + Формат(РеквизитыПоручения.ДатаИсполненияПо, "ДФ=dd.MM.yyyy") + "]. ",,,, Отказ)
				КонецЕсли;
			
			ИначеЕсли НачалоДня(Объект.ДатаВыполнения) > РеквизитыПоручения.ДатаИсполненияПо Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата согласования [" + Формат(НачалоДня(Объект.ДатаВыполнения), "ДФ=dd.MM.yyyy") + "] задачи [" + Объект.Наименование + "] не может быть позже крайней даты исполнения поручения [" + Формат(РеквизитыПоручения.ДатаИсполненияПо, "ДФ=dd.MM.yyyy") + "]. ",,,, Отказ);
            КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
					
КонецПроцедуры

// Возвращает список выводов ценных бумаг по доступным организациям. Используется для заполнения
// табличных частей других документов данными из табличной части вывода
//
//	Параметры:
//		- Дата 						- конечная дата поиска документов вывода
// 		- ПривилегированныйРежим 	- Булево - использование привилигированного режима
//		- ТолькоКоличество 			- Булево - список требуется только для заполнения ЦБ и количества, без суммовых показателей
//
Функция СписокВыводовЦенныхБумагПоПрочимОрганизациям(Дата, ПривилегированныйРежим = Ложь, ТолькоКоличество = Ложь) Экспорт
	
	Если ПривилегированныйРежим Тогда
	
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Пользователи.Организация КАК Организация
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
			|	И Пользователи.Организация <> &Организация";
		
		Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь").ИдентификаторПользователяИБ);
		Запрос.УстановитьПараметр("Организация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
		
		ПрочиеОрганизацииПользователя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		
		Если ПрочиеОрганизацииПользователя.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Прочие организации недоступны");
			УстановитьПривилегированныйРежим(Ложь);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	СписокДокументов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыводЦенныхБумаг.Ссылка КАК Ссылка,
		|	ВыводЦенныхБумаг.Номер КАК Номер,
		|	ВыводЦенныхБумаг.Дата КАК Дата,
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВыводЦенныхБумаг.Рынок КАК Рынок
		|ИЗ
		|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
		|ГДЕ
		|	ВыводЦенныхБумаг.Дата МЕЖДУ &НачальнаяДата И &КонечнаяДата
		|	И &УсловиеНаДокумент";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаДокумент", ?(ТолькоКоличество, "НЕ ВыводЦенныхБумаг.ПометкаУдаления", "ВыводЦенныхБумаг.Проведен"));
	
	Если ПривилегированныйРежим Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РАЗРЕШЕННЫЕ", "") + "
		|	И ВыводЦенныхБумаг.Организация В(&Организации)";
		
		Запрос.УстановитьПараметр("Организации", ПрочиеОрганизацииПользователя);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачальнаяДата", ДобавитьМесяц(Дата, -1));
	Запрос.УстановитьПараметр("КонечнаяДата", КонецДня(Дата));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СписокДокументов.Добавить(ВыборкаДетальныеЗаписи.Ссылка, 
			СтрШаблон("№ %1 от %2 %3 (%4)", 
					ВыборкаДетальныеЗаписи.Номер, 
					ВыборкаДетальныеЗаписи.Дата, 
					ВыборкаДетальныеЗаписи.СчетДоверительногоУправления,
					ВыборкаДетальныеЗаписи.Рынок));
		
	КонецЦикла;
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат СписокДокументов;
	
КонецФункции

// Заполняет табличную часть ЦенныеБумаги (ЦБ и количество) документа из переданного вывода ценных бумаг
//
// Параметры:
//	ДокументОбъект 			- ДокументОбъект					- заполняемый документ с ТЧ ЦенныеБумаги
//	ВыводЦенныхБумаг 		- ДокументСсылка.ВыводЦенныхБумаг	- вывод ц/б
//	ПривилегированныйРежим 	- Булево							- использование привилегированного режима 
//
Процедура ЗаполнитьЦенныеБумагиИКоличествоИзВыводаЦенныхБумаг(ДокументОбъект, ВыводЦенныхБумаг, ПривилегированныйРежим = Ложь) Экспорт
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	//При заполнении только ценных бумаг и количества ценные бумаги сворачиваем  	
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ВыводЦенныхБумагЦенныеБумаги.Количество) КАК Количество
		|ИЗ
		|	Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
		|ГДЕ
		|	ВыводЦенныхБумагЦенныеБумаги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага");
		
	Запрос.УстановитьПараметр("Ссылка", ВыводЦенныхБумаг);	
	
	ДокументОбъект.ЦенныеБумаги.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает дату, с которой проверяется реквизит ДатаИВремяПолучения в поручениях на движение активов
Функция ДатаНачалаПроверкиДатыИВремениПолученияДляПорученийНаДвижениеАктивов() Экспорт
	
	Возврат '20221228';

КонецФункции		 

#КонецОбласти

#Область Формирование_платежных_поручений

// Выгрузка платежных поручений в клиент банк включается по очереди для каждой организации
Функция ИспользуетсяВыгрузкаПлатежныхПорученийВКлиентБанк(Организация, Дата) Экспорт
	
	// Организации включаем по очереди в разные даты
	Возврат Дата >= '20241213' И Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст")     		
		Или Дата >= '20241219' И Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")
		Или Дата >= '20250116' И Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") 
		Или Дата >= '20250820' И Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ");
					
КонецФункции
	
// Проверяет использование реквизита РасчетныйСчетКонтрагента в документе НачислениеЗадолженности
Функция ОбязательноЗаполнениеРасчетногоСчетаКонтрагентаВНачисленииЗадолженности(ДокументОбъект) Экспорт
	
	// Если в документе дата не заполнена, считаем, что это текущая дата	
	ДатаПроверки = ?(ДокументОбъект.Дата = '00010101', ТекущаяДатаСеанса(), ДокументОбъект.Дата);
	
	Возврат ИспользуетсяВыгрузкаПлатежныхПорученийВКлиентБанк(ДокументОбъект.Организация, ДатаПроверки)
	    И ДокументОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок
		И ДатаПроверки >= '20250416'
		И Справочники.ВидыЗадолженности.ОпределитьТипЗадолженности(ДокументОбъект.ВидЗадолженности) = Перечисления.ТипыЗадолженности.Кредиторская
		И Справочники.ВидыЗадолженности.ЭтоВидЗадолженностиДляФормированияПоручений(ДокументОбъект.ВидЗадолженности);
	
КонецФункции

#КонецОбласти

Функция ТребуетсяЗаполнениеОснованияДокументаРазмещениеКредитногоИнструмента(ДатаДокумента, Организация, РазмещениеБиржевогоДепозита) Экспорт
	
	// по задаче #546288 для биржевых депозитов создание распоряжений более не требуется
	Если РазмещениеБиржевогоДепозита Тогда
		Возврат Ложь;
	Иначе
		Возврат ДатаДокумента > Дата(2024, 02, 27)
			И (Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
				Или Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	КонецЕсли;
	
КонецФункции
	
// Проверяет соответствие документа основания (расспоряжение) и подчиненных документов (МНО, Размещение кредитного инструмента)	
Процедура ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииРаспоряжения(Объект, Отказ) Экспорт
		
	Если Не (ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Распоряжение")) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеРеквизитовОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "ПометкаУдаления, Дата");
	
	Если ЗначениеРеквизитовОснования.ПометкаУдаления Тогда

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать документы на основании помеченного на удаление распоряжения!",,,, Отказ);
		Возврат;
			
	КонецЕсли;
	
	ЭтоРаспоряжениеНаРазмещениеБиржевогоДепозита = Ложь;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РазмещениеКредитногоИнструмента") Тогда
					
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "СчетДоверительногоУправления, РасчетныйСчет, Сумма, Валюта, ДоВостребования, ПроцентнаяСтавкаПриДосрочномЗакрытии, Субординированность");
		РеквизитыДепозита = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КредитныйИнструмент, "БанковскийСчет, ДоВостребования, ПроцентнаяСтавкаПриДосрочномЗакрытии, Субординированность");  
		
		Если РеквизитыОснования.СчетДоверительногоУправления <> Объект.СчетДоверительногоУправления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет доверительного управления отличается счета указанного в документе основания [" + РеквизитыОснования.СчетДоверительногоУправления + "]", Объект, "СчетДоверительногоУправления",, Отказ);
		КонецЕсли;
		
		ЭтоРаспоряжениеНаРазмещениеБиржевогоДепозита = РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(Объект.КредитныйИнструмент);
		
		Если Не ЭтоРаспоряжениеНаРазмещениеБиржевогоДепозита Тогда
			
			Если РеквизитыОснования.Сумма <> Объект.Сумма Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма отличается от суммы документа основания [" + РеквизитыОснования.Сумма + "]", Объект, "Сумма",, Отказ);
			КонецЕсли;
	
			Если РеквизитыОснования.РасчетныйСчет <> Объект.РасчетныйСчет Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет отличается от счета документа основания [" + РеквизитыОснования.РасчетныйСчет + "]", Объект, "РасчетныйСчет",, Отказ);
			КонецЕсли;
			
		Иначе
			
			// распоряжение по биржевым депозитам может исполняться частично или не исполняться вовсе
			
			// каждому биржевому депозиту расчетный счет присваивается в заключения сделки на бирже
			// и при создании распоряжения они не известны
			
		КонецЕсли;
		
		Если РеквизитыОснования.Валюта <> РеквизитыДепозита.БанковскийСчет.Валюта Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта в документе основания [" + РеквизитыОснования.Валюта + "] отличается от валюты депозита [" + РеквизитыДепозита.Валюта + "]", Объект, "КредитныйИнструмент",, Отказ);
		КонецЕсли;
		
		Если РеквизитыОснования.ДоВостребования <> РеквизитыДепозита.ДоВостребования Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Условие [До востребования] в документе основания [" + РеквизитыОснования.ДоВостребования + "] отличается от условия депозита [" + РеквизитыДепозита.ДоВостребования + "]", Объект, "КредитныйИнструмент",, Отказ);
		КонецЕсли;
		
		Если РеквизитыОснования.ПроцентнаяСтавкаПриДосрочномЗакрытии <> РеквизитыДепозита.ПроцентнаяСтавкаПриДосрочномЗакрытии Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение процентной ставки при досрочном закрытии в документе основания [" + РеквизитыОснования.ПроцентнаяСтавкаПриДосрочномЗакрытии+ "] отличается от значения в депозите [" + РеквизитыДепозита.ПроцентнаяСтавкаПриДосрочномЗакрытии + "]", Объект, "КредитныйИнструмент",, Отказ);
		КонецЕсли;
		
		Если РеквизитыОснования.Субординированность <> РеквизитыДепозита.Субординированность Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Условие [Субординированность] в документе основания [" + РеквизитыОснования.Субординированность + "] отличается от условия депозита [" + РеквизитыДепозита.Субординированность + "]", Объект, "КредитныйИнструмент",, Отказ);
		КонецЕсли;
							
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.МНО") Тогда
													
		Если НачалоДня(Объект.Дата) <> НачалоДня(ЗначениеРеквизитовОснования.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Значение поля [Дата] не соответствует условиям распоряжения'"), Объект, "Дата",, Отказ);
		КонецЕсли; 
		
		Если Объект.Дата < ЗначениеРеквизитовОснования.Дата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Время документа [" + Формат(Объект.Дата, "ДФ=ЧЧ:мм:сс") + "] не должно быть раньше распоряжения [" + Формат(ЗначениеРеквизитовОснования.Дата, "ДФ=ЧЧ:мм:сс") + "]'"), Объект, "Дата",, Отказ);
		КонецЕсли;

		МассивПроверяемыхРеквизитовМНО = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Организация,СчетДоверительногоУправления,Сумма,Процент,ДатаВозврата,РасчетныйСчет", ",");

		Для Каждого Реквизит Из Метаданные.Документы.Распоряжение.Реквизиты Цикл
		
			Если МассивПроверяемыхРеквизитовМНО.Найти(Реквизит.Имя) <> Неопределено И Объект[Реквизит.Имя] <> Объект.Основание[Реквизит.Имя] Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Значение поля [" + Реквизит.Синоним + "] не соответствует условиям распоряжения'"), Объект, Реквизит.Имя,, Отказ);
			КонецЕсли; 
			
		КонецЦикла;
		
		Если Объект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		
			ЗарегистрированныеНомера = РегистрыСведений.НомераОбъектов.ПолучитьЗарегистрированныеНомера(
											Объект.Организация, 
											Справочники.ВидыНумерацииОбъектов.РаспоряженияНаМНО,
											РаботаСКоллекциями.ЗначениеВМассив(Объект.Основание),
											Объект.СчетДоверительногоУправления,
											Год(Объект.Основание.Дата));
			
			Если ЗарегистрированныеНомера = Неопределено Или ЗарегистрированныеНомера.Получить(Объект.Основание) = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нельзя создавать документ МНО на основании распоряжения без номера.'"), Объект, "Основание",, Отказ);									
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;   
	
	Если Не ЭтоРаспоряжениеНаРазмещениеБиржевогоДепозита Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документ.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РазмещениеКредитногоИнструмента КАК Документ
			|ГДЕ
			|	Документ.Ссылка <> &Ссылка 
			|	И Документ.Основание = &Основание
			|	И НЕ Документ.ПометкаУдаления";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("Основание", Объект.Основание);
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.МНО") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РазмещениеКредитногоИнструмента", "МНО");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На основании распоряжения уже создан документ [" + Выборка.Ссылка + "]",,,, Отказ);	
		КонецЦикла;
		
	Иначе	
		// у биржевых депозитов возможно исполнение распоряжения несколькими сделками-размещениями	
	КонецЕсли;
	
КонецПроцедуры

// Проверяет вид задолженности в документах НачислениеЗадолженности и Оплата:
// в зависимости от настройки ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента в условиях договоров доверительного управления 
// отдельные виды задолженности оплачиваются за счет собственных средств клиента, поэтому учет такой задолженности 
// ведется в бухгалтерской базе
//
// Параметры:
//		- Объект	- ДокументОбъект (Оплата, НачислениеЗадолженности)
//  	- Отказ		- Булево, устанавливается в Истина, если отсутствуют настройки или учет по виду задолженности ведется в бухгалтерской базе
//
Процедура ПроверитьВидыЗадолженностиОплачиваемойИзСобственныхСредствКлиента(Объект, Отказ) Экспорт
	
	ТипДокумента = ТипЗнч(Объект);
	Если ТипДокумента <> Тип("ДокументОбъект.НачислениеЗадолженности") 
		И ТипДокумента <> Тип("ДокументОбъект.Оплата") Тогда
		Возврат;
	КонецЕсли;
		
	Если РегистрыСведений.УсловияДоговоровДоверительногоУправления.ДляВидаДоговораДУВозможнаОплатаВознагражденияУправляющегоИРасходовСпецдепозитарияИзСобственныхСредствКлиента(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления")) Тогда
		
	    НастройкаУстановлена = РегистрыСведений.УсловияДоговоровДоверительногоУправления.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата, Отказ);
			
		Если Не Отказ 
			И НастройкаУстановлена
			И Справочники.ВидыЗадолженности.ВидыЗадолженностиОплачиваемойИзСобственныхСредствКлиента().Найти(Объект.ВидЗадолженности) <> Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Задолженность вида '%1' для счета ДУ %2 начисляется и оплачивается только в базе собственной бухгалтерии", 
																Объект.ВидЗадолженности, Объект.СчетДоверительногоУправления), Объект.СчетДоверительногоУправления,,, Отказ);
				
		КонецЕсли;
																
	КонецЕсли;	
	  	
КонецПроцедуры

// Проверка необходимости заполнения основания в поручениях (Начисление задолженности) для контроля
// задолженности по денежным средствам по поручениям при проведении оплат на основании начислений задолженности.
Функция ДействуетКонтрольПорученийВнутреннейСистемы(ДатаДокумента, Организация) Экспорт
	
	Возврат ДатаДокумента > Дата(2024, 11, 26)
		И (Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") 
			Или Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	
КонецФункции
		
Функция ЗначенияРеквизитовСоответствуютОснованиюПоручения(Поручение, РеквизитыОснования = Неопределено, СообщитьОбОшибках = Истина) Экспорт
	
	Отказ = Ложь;
	
	Если РеквизитыОснования = Неопределено Тогда
				
		Если ЗначениеЗаполнено(Поручение.Основание) Тогда 
			
			РеквизитыОснования = Новый Структура("СчетДоверительногоУправления, ВидЗадолженности, Брокер, Валюта, МестоХранения, Сумма");
			
			Если ТипЗнч(Поручение.Основание) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	НачислениеЗадолженности.Брокер КАК Брокер,
					|	НачислениеЗадолженности.МестоХранения КАК МестоХранения,
					|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
					|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
					|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
					|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма
					|ИЗ
					|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(&ДатаПоручения, Основание = &Основание) КАК ЗадолженностиПоДенежнымСредствамОстатки
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
					|			ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = НачислениеЗадолженности.Ссылка
					|				И НачислениеЗадолженности.Ссылка = &Основание";
				
				Запрос.УстановитьПараметр("ДатаПоручения", Поручение.Дата);
				Запрос.УстановитьПараметр("Основание", Поручение.Основание);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(РеквизитыОснования, Выборка);	
				КонецЕсли;
			
			ИначеЕсли ТипЗнч(Поручение.Основание) = Тип("ДокументСсылка.НачислениеДивидендов") Тогда
		
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					|	НачислениеЗадолженности.Брокер КАК Брокер,
					|	НачислениеЗадолженности.МестоХранения КАК МестоХранения,
					|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
					|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
					|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
					|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма
					|ИЗ
					|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(&ДатаПоручения, Основание = &Основание) КАК ЗадолженностиПоДенежнымСредствамОстатки
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
					|			ПО НачислениеЗадолженностиОснования.Ссылка = НачислениеЗадолженности.Ссылка
					|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = НачислениеЗадолженностиОснования.Основание
					|			И (ЗадолженностиПоДенежнымСредствамОстатки.Основание = &Основание)";
				
				Запрос.УстановитьПараметр("ДатаПоручения", Поручение.Дата);
				Запрос.УстановитьПараметр("Основание", Поручение.Основание);
				
				Результат = Запрос.Выполнить();
				
				Если Результат.Пустой() Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить начисление задолженности по НДФЛ с основанием [" + Поручение.Основание + "].",,,, Отказ);
					
				Иначе
					
					Выборка = Результат.Выбрать();
				
					Если Выборка.Следующий() Тогда	
						ЗаполнитьЗначенияСвойств(РеквизитыОснования, Выборка);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Поручение.Основание) = Тип("ДокументСсылка.ПогашениеПаев") Тогда
		
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок) КАК МестоХранения,
					|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Брокер,
					|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
					|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
					|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
					|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма
					|ИЗ
					|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(&ДатаПоручения, Основание = &ЗаявкаПайщика) КАК ЗадолженностиПоДенежнымСредствамОстатки";
				
				Запрос.УстановитьПараметр("ДатаПоручения", Поручение.Дата);
				Запрос.УстановитьПараметр("ЗаявкаПайщика", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поручение.Основание, "Заявка"));
				
				Результат = Запрос.Выполнить();
				
				Если Результат.Пустой() Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить задолженность с основанием [" + Поручение.Основание + "].",,,, Отказ);
					
				Иначе
					
					Выборка = Результат.Выбрать();
				
					Если Выборка.Следующий() Тогда	
						ЗаполнитьЗначенияСвойств(РеквизитыОснования, Выборка);
					КонецЕсли;
					
				КонецЕсли;
	
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать поручение на основании документа [" + Поручение.Основание + "].",,,, Отказ);
								
			КонецЕсли;
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
									
	Если РеквизитыОснования.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручения можно создавать на основании задолженности с местом хранения [Внебиржевой рынок]. В начислениии задолженности указано место хранения [" + РеквизитыОснования.МестоХранения + "].",,,, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОснования.Брокер) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать поручение на основании начислений задолженности с оплатой через брокера [" + РеквизитыОснования.Брокер + "].",,,, Отказ);		
	КонецЕсли; 
	
	Если Не Справочники.ВидыЗадолженности.ЭтоВидЗадолженностиДляФормированияПоручений(РеквизитыОснования.ВидЗадолженности) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать поручение на основании начислений с видом задолженности [" + РеквизитыОснования.ВидЗадолженности + "].",,,, Отказ);		
	КонецЕсли;
	
	Если РеквизитыОснования.СчетДоверительногоУправления <> Поручение.СчетДоверительногоУправления Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта поручения [" + Поручение.СчетДоверительногоУправления + "] отличается от валюты [" + РеквизитыОснования.СчетДоверительногоУправления + "] документа основания [" + Поручение.Основание + "].",,,, Отказ);	
	КонецЕсли;
		
	Если РеквизитыОснования.Свойство("Основания") Тогда	
		//#184359 тех долг. Доработать проверку значения реквизита "Сумма" документа "Начисление задолженности" при перепроведении.
		СуммаНачисления = РеквизитыОснования.Основания.Выгрузить().Итог("Сумма");	
	ИначеЕсли РеквизитыОснования.Свойство("Сумма") Тогда	
		
		СуммаНачисления = РеквизитыОснования.Сумма; 
		
		Если СуммаНачисления <> Поручение.Сумма Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма поручения [" + Поручение.Сумма + "] отличается от суммы [" + СуммаНачисления + "] документа основания [" + Поручение.Основание + "].",,,, Отказ);	
		КонецЕсли; 
		
	КонецЕсли;
	
	Если РеквизитыОснования.Валюта <> Поручение.Валюта Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта поручения [" + Поручение.Валюта + "] отличается от валюты [" + РеквизитыОснования.Валюта + "] документа основания [" + Поручение.Основание + "].",,,, Отказ);	
	КонецЕсли;
			
	Если Не СообщитьОбОшибках Тогда
		ПолучитьСообщенияПользователю(Истина);	
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции 

// Проверка наличия подчиненного поручения на движение денежных средств созданного на основании начисления задолженности.
Функция ПолучитьПодчиненныйДокументПоручениеНаВыводАктивов(Знач Объект) Экспорт
	
	Если ТипЗнч(Объект.Ссылка) <> Тип("ДокументСсылка.НачислениеЗадолженности") Тогда 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Не ДействуетКонтрольПорученийВнутреннейСистемы(Объект.Дата, Объект.Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадолженностиПоДенежнымСредствамПоПоручениям.Регистратор КАК Ссылка,
		|	ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамПоПоручениям.Регистратор) = ТИП(Документ.КорректировкаРегистров) КАК ЭтоКорректировка
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям КАК ЗадолженностиПоДенежнымСредствамПоПоручениям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВЫБОР
		|				КОГДА НачислениеЗадолженностиОснования.Основание ССЫЛКА Документ.НачислениеДивидендов
		|					ТОГДА НачислениеЗадолженностиОснования.Основание
		|				ИНАЧЕ НачислениеЗадолженностиОснования.Ссылка
		|			КОНЕЦ КАК Ссылка
		|		ИЗ
		|			Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК ДокНачислениеЗадолженности
		|				ПО НачислениеЗадолженностиОснования.Ссылка = ДокНачислениеЗадолженности.Ссылка
		|					И (ДокНачислениеЗадолженности.Ссылка = &ДокументСсылка)
		|					И (ДокНачислениеЗадолженности.ВидЗадолженности В (&ВидыЗадолженности))) КАК ОснованиеПоручения
		|		ПО ЗадолженностиПоДенежнымСредствамПоПоручениям.Основание = ОснованиеПоручения.Ссылка
		|			И (ЗадолженностиПоДенежнымСредствамПоПоручениям.Организация = &Организация)
		|			И (ЗадолженностиПоДенежнымСредствамПоПоручениям.Активность)
		|			И (ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамПоПоручениям.Регистратор) В (ТИП(Документ.ПоручениеНаДвижениеДенежныхСредств), ТИП(Документ.КорректировкаРегистров)))
		|			И (ЗадолженностиПоДенежнымСредствамПоПоручениям.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ВидыЗадолженности", Справочники.ВидыЗадолженности.ВидыЗадолженностиДляФормированияПоручений());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ЭтоКорректировка Тогда 
			
			//На основании начисления задолженности должны формироваться поручения, если движение (в регистре Начисление задолженности по денежным средствам по поручениям) сформированно корректировкой - это странно. Сообщим об этом. 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В регистре [Начисление задолженности по денежным средствам по поручениям] сформировано движение регистратором [" + Выборка.Ссылка + "], где основанием является [" + Объект.Ссылка + "].");	
			
		Иначе
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;		
	
	Возврат Неопределено;	
									
КонецФункции

Функция ПолучитьТекущийСтатусПорученияНаПереводДенежныхСредств(ПоручениеСсылка) Экспорт 
				
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыПоручений.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств.СрезПоследних(&Период, ПоручениеНаПереводДенежныхСредств = &ПоручениеСсылка) КАК СтатусыПоручений";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПоручениеСсылка", ПоручениеСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Статус;	
	КонецЕсли;
		
КонецФункции

// Возвращает значение реквизита Субконто1 для документа ВводДенежныхСредств или ВыводДенежныхСредств
// 
//	Параметры:
//		Объект - ДанныеФормыСтруктура, ДокументОбъект - документ ввода или вывода денежных средств
//
Функция Субконто1ДляВводаВыводаДенежныхСредств(Объект) Экспорт
	
	Результат = Неопределено;
	
	Если Объект.КоррСчет = ПланыСчетов.Основной.ЦелевоеФинансированиеВоеннойИпотекиПереданноеВОтчетномГоду Тогда 
		// 86.4.1 - без субконто. Ничего не делаем				
	ИначеЕсли Объект.КоррСчет = ПланыСчетов.Основной.РасчетыПоДоговоруДоверительногоУправленияИмуществом Тогда // 79.3 - контрагенты
		
		Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда 
			Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления);
			Результат = ?(ТипЗнч(Клиент) = Тип("СправочникСсылка.ЮрФизЛица"), Клиент, Неопределено);		
		КонецЕсли;
			
	ИначеЕсли Объект.КоррСчет = ПланыСчетов.Основной.ПрочиеДоходы Тогда // 91.1.1 - комментарии излишни
		
		Если Объект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваДоходПоПаямЗПИФ Тогда
			Результат = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ДоходыПоПаямЗПИФ");
		ИначеЕсли Объект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами Тогда
			Результат = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ПроцентыНаОстатокНаРасчетномСчете");
		КонецЕсли;
		
	ИначеЕсли Объект.КоррСчет = ПланыСчетов.Основной.УслугиБрокера
		Или Объект.КоррСчет = ПланыСчетов.Основной.РасчетыПоПретензиям 
		Или Объект.КоррСчет = ПланыСчетов.Основной.ЧастьПенсионныхВзносовДляОбеспеченияИОУДПеречисленно
		Или Объект.КоррСчет = ПланыСчетов.Основной.ПрибыльУбытокДУТекущегоПериода
		Или Объект.КоррСчет = ПланыСчетов.Основной.РасчетыСАгентами Тогда // 60.5, 76.2, 79.5.2, 79.4.1, 76.10 - контрагенты
		
		Результат = Объект.Контрагент;
					
	ИначеЕсли Объект.КоррСчет = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами Тогда // 76.9 - контрагенты
		
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПогашениеПаев") И ЗначениеЗаполнено(Объект.Основание) Тогда
			Результат = ПолучитьКонтрагентаПоВидуПайщика(Объект.Основание.ВидПайщика, Объект.Основание.Владелец, Объект.Основание.Пайщик, Объект.Дата);
		Иначе
			Результат = Объект.Контрагент;
		КонецЕсли;
		
	ИначеЕсли Объект.КоррСчет = ПланыСчетов.Основной.РасчетыПоАвансамВыданным Тогда // 60.2 - контрагенты
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо");
	КонецЕсли;	
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтрагентаПоВидуПайщика(ВидПайщика, Владелец, Пайщик, Дата) Экспорт    
	
	Если Дата >= Дата(2025, 1, 1) Тогда
		Если ВидПайщика = Перечисления.ВидыПайщиков.НоминальныйДержатель Тогда   
			Контрагент = Владелец;   
		Иначе	
			Контрагент = Пайщик;   
		КонецЕсли;		
	Иначе
		Контрагент = Пайщик;
	КонецЕсли;	
	
	Возврат Контрагент;
	
КонецФункции	

// Функция пробует сначала записать документ, а в случае успеха - провести его
//
//	Параметры:
//		ДокументОбъект - объект записываемого документа
//
Функция ЗаписатьПровестиДокумент(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.ПроверитьЗаполнение() Тогда
						
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось записать документ %1: %2", ДокументОбъект, ОписаниеОшибки()));
			Возврат Ложь;
		КонецПопытки;
		
		ДокументСсылка = ДокументОбъект.Ссылка;
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Документ %1 находится в состоянии 'Записан'", ДокументСсылка), ДокументСсылка); 			
		КонецПопытки;
				
		Возврат Истина;
		
	Иначе
		
		ТекстСообщения = СтрШаблон("Вид документа '%1'", ДокументОбъект.Метаданные().Имя);
		Если ДокументОбъект.Метаданные().Реквизиты.Найти("СчетДоверительногоУправления") <> Неопределено Тогда
			ТекстСообщения = ТекстСообщения + СтрШаблон(", счет доверительного управления %1", ДокументОбъект.СчетДоверительногоУправления);
		КонецЕсли;
		
		Если ДокументОбъект.Метаданные().Реквизиты.Найти("Сумма") <> Неопределено Тогда
			ТекстСообщения = ТекстСообщения + СтрШаблон(", сумма %1", Формат(ДокументОбъект.Сумма, "ЧГ=0"));
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Ложь;
		
	КонецЕсли;	
	
КонецФункции

Функция ОрганизацияРаботаетСРозницейПИФ(Организация, Дата) Экспорт

	Возврат Дата >= '20260130'
		И Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
		
КонецФункции
