
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЭтаФорма.Параметры.Свойство("Отбор") И Не ЭтаФорма.Параметры.Отбор.Свойство("Объект") Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задано Юр/физ лицо!",,,, Отказ);
		
		Возврат;
		
	Иначе
			
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Организация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Объект", ЭтаФорма.Параметры.Отбор.Объект);
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВладелецФормы <> Неопределено Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока); 
    	СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
