#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация		= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	Объект.Период 			= ТекущаяДата();
	
	ЗаполнитьСписокНалоговыхПериодов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
	
#КонецОбласти

#Область СобытияЭлементов

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение(Объект.КаталогДанных + ?(Прав(Объект.КаталогДанных, 1) = "\", "", "\"));

КонецПроцедуры

	
#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Обновить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Обновить");
	Попытка
		ОбновитьНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("НалоговыйПериод"	, Объект.НалоговыйПериод);
	Запрос.УстановитьПараметр("Период"			, Объект.Период);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК Отметка,
		|	НачисленияНДФЛОбороты.ФизЛицо КАК Клиент,
		|	МАКСИМУМ(НачисленияНДФЛОбороты.Регистратор) КАК РасчетНДФЛ,
		|	НачисленияНДФЛОбороты.Регистратор.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.БазаНачисленияНДФЛ.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Организация = &Организация
		|				И ГОД(ДатаПолученияДохода) = &НалоговыйПериод) КАК НачисленияНДФЛОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияНДФЛОбороты.ФизЛицо,
		|	НачисленияНДФЛОбороты.Регистратор.СчетДоверительногоУправления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Объект.СписокРасчетов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//пайщики
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("НалоговыйПериод"	, Объект.НалоговыйПериод);
	Запрос.УстановитьПараметр("КонецНалоговогоПериода"	, Дата(Объект.НалоговыйПериод, 12, 31, 23, 59, 59));
	Запрос.УстановитьПараметр("НачалоНалоговогоПериода"	, Дата(Объект.НалоговыйПериод, 1, 1, 0, 0, 0));
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК Отметка,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода КАК Клиент
		|ИЗ
		|	Документ.РаспределениеДоходаПайщикам.НачислениеНДФЛ КАК РаспределениеДоходаПайщикамНачислениеНДФЛ
		|ГДЕ
		|	ГОД(РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Основание.Дата) = &НалоговыйПериод
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Проведен
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА,
		|	ВЫБОР
		|		КОГДА ПогашениеПаев.Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ПогашениеПаев.Пайщик
		|		КОГДА ПогашениеПаев.Владелец.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ПогашениеПаев.Владелец
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.ОборотыДтКт(&НачалоНалоговогоПериода, &КонецНалоговогоПериода, Регистратор, СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Основной.ЦелевоеФинансированиеИзБюджета), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами), , Организация = &Организация) КАК БухгалтерскийУчетОборотыДтКт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО БухгалтерскийУчетОборотыДтКт.СубконтоДт1 = ЮрФизЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ПогашениеПаев
		|		ПО БухгалтерскийУчетОборотыДтКт.Регистратор = ПогашениеПаев.Ссылка
		|ГДЕ
		|	НЕ ВЫБОР
		|				КОГДА ПогашениеПаев.Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|					ТОГДА ПогашениеПаев.Пайщик
		|				КОГДА ПогашениеПаев.Владелец.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|					ТОГДА ПогашениеПаев.Владелец
		|			КОНЕЦ ЕСТЬ NULL";
	
	Объект.Пайщики.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Экспорт2НДФЛ(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Экспорт2НДФЛ");
	Попытка
		ВыполнитьЭкспорт2НДФЛ(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЭкспорт2НДФЛ(ПараметрыСессии)
	
	Если НЕ КаталогУказанВерно() Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Каталог данных не указан или указан неверно");
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.СписокРасчетов.Количество() 
		И НЕ Объект.Пайщики.Количество()	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для выгрузки. Обновите список расчётов/пайщиков ");
		ДобавитьТекстОшибки(ПараметрыСессии, "Нет данных для выгрузки");
		Возврат;
	КонецЕсли;
	
	Результат = СформироватьXML();
	
	Если Результат <> Неопределено Тогда
		Результат.ДвоичныеДанные.Записать(Объект.КаталогДанных + "\" + Результат.ИмяФайла);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл сохранён: " + Объект.КаталогДанных + "\" + Результат.ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("УстановитьОтметки");
	Попытка
		УстановитьОтметкиНаСервере(Истина);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СнятьОтметки");
	Попытка
		УстановитьОтметкиНаСервере(Ложь);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкиНаСервере(Отметка)
	
	Для Каждого СтрокаСписка Из Объект.СписокРасчетов Цикл
		СтрокаСписка.Отметка = Отметка;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкиПайщикиНаСервере(Отметка)
	
	Для Каждого СтрокаСписка Из Объект.Пайщики Цикл
		СтрокаСписка.Отметка = Отметка;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиПайщики(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("УстановитьОтметкиПайщики");
	Попытка
		УстановитьОтметкиПайщикиНаСервере(Истина);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиПайщики(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СнятьОтметкиПайщики");
	Попытка
		УстановитьОтметкиПайщикиНаСервере(Ложь);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры


#КонецОбласти

#Область ДопФункции

Процедура ЗаполнитьСписокНалоговыхПериодов()
	
	Элементы.НалоговыйПериод.СписокВыбора.Очистить();
	
	ГодНачала	= Год(Макс(Объект.Организация.ДатаНачалаУчета, Дата(2000,1,1)));
	ТекущийГод	= Год(ТекущаяДата());
	
	Пока ГодНачала <= ТекущийГод Цикл
		Элементы.НалоговыйПериод.СписокВыбора.Вставить(0, ГодНачала, Формат(ГодНачала, "ЧГ=0") + " год");
		ГодНачала = ГодНачала + 1;
	КонецЦикла;
	
	Объект.НалоговыйПериод = ГодНачала - 1;
	
КонецПроцедуры

&НаКлиенте
Функция КаталогУказанВерно()
	
	Если НЕ ЗначениеЗаполнено(Объект.КаталогДанных) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Каталог данных"" не заполнено", ЭтаФорма, "КаталогДанных", "Объект");
		Возврат Ложь;
	КонецЕсли;
	
	Каталог = Новый Файл(Объект.КаталогДанных);
	Если НЕ Каталог.Существует() ИЛИ НЕ Каталог.ЭтоКаталог() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно указан каталог данных", ЭтаФорма, "КаталогДанных", "Объект");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанных

Процедура ЗаполнитьВременныеТаблицы(Запрос)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация"				, Объект.Организация);
	Запрос.УстановитьПараметр("Период"					, Объект.Период);
	Запрос.УстановитьПараметр("ПериодСтрокой"			, Формат(Объект.Период, "ДФ=yyyyMMdd"));
	Запрос.УстановитьПараметр("НалоговыйПериод"			, Объект.НалоговыйПериод);
	Запрос.УстановитьПараметр("КонецНалоговогоПериода"	, Дата(Объект.НалоговыйПериод, 12, 31, 23, 59, 59));
	Запрос.УстановитьПараметр("НачалоНалоговогоПериода"	, Дата(Объект.НалоговыйПериод, 1, 1, 0, 0, 0));
	Запрос.УстановитьПараметр("Подписант"				, Объект.Подписант);
	Запрос.УстановитьПараметр("СписокРасчетов"			, Объект.СписокРасчетов.Выгрузить(Объект.СписокРасчетов.НайтиСтроки(Новый Структура("Отметка", Истина))));
	Запрос.УстановитьПараметр("СписокПайщиков"			, Объект.Пайщики.Выгрузить(Объект.Пайщики.НайтиСтроки(Новый Структура("Отметка", Истина))).ВыгрузитьКолонку("Клиент"));	
	
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокВсехРасчетов.Отметка КАК Отметка,
		|	СписокВсехРасчетов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СписокВсехРасчетов.Клиент КАК Клиент
		|ПОМЕСТИТЬ _СписокРасчетов
		|ИЗ
		|	&СписокРасчетов КАК СписокВсехРасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыДоходовНДФЛ.Ссылка КАК ВидДохода,
		|	ВидыДоходовНДФЛ.ВидВычета КАК ВидВычета
		|ПОМЕСТИТЬ _СвязиКодов
		|ИЗ
		|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
		|ГДЕ
		|	НЕ ВидыДоходовНДФЛ.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазаНачисленияНДФЛОбороты.ФизЛицо КАК Клиент,
		|	ГОД(БазаНачисленияНДФЛОбороты.ДатаПолученияДохода) КАК Год,
		|	МЕСЯЦ(БазаНачисленияНДФЛОбороты.ДатаПолученияДохода) КАК Месяц,
		|	БазаНачисленияНДФЛОбороты.ВидДоходаВычета КАК ВидДохода,
		|	БазаНачисленияНДФЛОбороты.ВидДоходаВычета.ВидВычета КАК ВидВычета,
		|	ВЫБОР
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
		|			ТОГДА 13
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
		|			ТОГДА 15
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
		|			ТОГДА 30
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка35)
		|			ТОГДА 35
		|	КОНЕЦ КАК Ставка,
		|	БазаНачисленияНДФЛОбороты.СуммаНДФЛОборот КАК Сумма2НДФЛДоход,
		|	0 КАК Сумма2НДФЛВычет
		|ПОМЕСТИТЬ _ДанныеПоНДФЛ
		|ИЗ
		|	РегистрНакопления.БазаНачисленияНДФЛ.Обороты(
		|			,
		|			,
		|			,
		|			Организация = &Организация
		|				И ГОД(ДатаПолученияДохода) = &НалоговыйПериод) КАК БазаНачисленияНДФЛОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СписокРасчетов КАК _СписокРасчетов
		|		ПО (_СписокРасчетов.Клиент = БазаНачисленияНДФЛОбороты.ФизЛицо)
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛОбороты.ВидДоходаВычета) = ТИП(Справочник.ВидыДоходовНДФЛ)
		|	И _СписокРасчетов.Отметка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БазаНачисленияНДФЛОбороты.ФизЛицо,
		|	ГОД(БазаНачисленияНДФЛОбороты.ДатаПолученияДохода),
		|	МЕСЯЦ(БазаНачисленияНДФЛОбороты.ДатаПолученияДохода),
		|	_СвязиКодов.ВидДохода,
		|	БазаНачисленияНДФЛОбороты.ВидДоходаВычета,
		|	ВЫБОР
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
		|			ТОГДА 13
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
		|			ТОГДА 15
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
		|			ТОГДА 30
		|		КОГДА БазаНачисленияНДФЛОбороты.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка35)
		|			ТОГДА 35
		|	КОНЕЦ,
		|	0,
		|	-БазаНачисленияНДФЛОбороты.СуммаНДФЛОборот
		|ИЗ
		|	РегистрНакопления.БазаНачисленияНДФЛ.Обороты(
		|			,
		|			,
		|			,
		|			Организация = &Организация
		|				И ГОД(ДатаПолученияДохода) = &НалоговыйПериод) КАК БазаНачисленияНДФЛОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СвязиКодов КАК _СвязиКодов
		|		ПО БазаНачисленияНДФЛОбороты.ВидДоходаВычета = _СвязиКодов.ВидВычета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СписокРасчетов КАК _СписокРасчетов
		|		ПО (_СписокРасчетов.Клиент = БазаНачисленияНДФЛОбороты.ФизЛицо)
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛОбороты.ВидДоходаВычета) = ТИП(Справочник.ВидыВычетовНДФЛ)
		|	И _СписокРасчетов.Отметка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОборотыДтКт.Регистратор.Заявка <> ЗНАЧЕНИЕ(Документ.Заявкапайщика.ПустаяСсылка)
		|			ТОГДА БухгалтерскийУчетОборотыДтКт.Регистратор.Заявка
		|		ИНАЧЕ БухгалтерскийУчетОборотыДтКт.Регистратор
		|	КОНЕЦ КАК РегистраторОснование,
		|	НАЧАЛОПЕРИОДА(БухгалтерскийУчетОборотыДтКт.Период, ДЕНЬ) КАК ДатаНачисленияДохода,
		|	БухгалтерскийУчетОборотыДтКт.Регистратор КАК Регистратор,
		|	БухгалтерскийУчетОборотыДтКт.СуммаОборот КАК СуммаДоход,
		|	ВЫБОР
		|		КОГДА ПогашениеПаев.Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ПогашениеПаев.Пайщик
		|		КОГДА ПогашениеПаев.Владелец.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ПогашениеПаев.Владелец
		|	КОНЕЦ КАК Клиент
		|ПОМЕСТИТЬ _ДоходыПайщики
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.ОборотыДтКт(&НачалоНалоговогоПериода, &КонецНалоговогоПериода, Регистратор, СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Основной.ЦелевоеФинансированиеИзБюджета), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами), , Организация = &Организация) КАК БухгалтерскийУчетОборотыДтКт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО БухгалтерскийУчетОборотыДтКт.СубконтоДт1 = ЮрФизЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ПогашениеПаев
		|		ПО БухгалтерскийУчетОборотыДтКт.Регистратор = ПогашениеПаев.Ссылка
		|ГДЕ
		|	НЕ ВЫБОР
		|				КОГДА ПогашениеПаев.Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|					ТОГДА ПогашениеПаев.Пайщик
		|				КОГДА ПогашениеПаев.Владелец.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|					ТОГДА ПогашениеПаев.Владелец
		|			КОНЕЦ ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОборотыДтКт.Регистратор.Основание КАК РегистраторОснование,
		|	НАЧАЛОПЕРИОДА(БухгалтерскийУчетОборотыДтКт.Период, ДЕНЬ) КАК ДатаВыплатыНалога,
		|	БухгалтерскийУчетОборотыДтКт.Регистратор КАК Регистратор,
		|	БухгалтерскийУчетОборотыДтКт.СуммаОборот КАК СуммаНалог,
		|	ЮрФизЛица.Ссылка КАК Клиент
		|ПОМЕСТИТЬ _НалогиПайщики
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.ОборотыДтКт(&НачалоНалоговогоПериода, &КонецНалоговогоПериода, Регистратор, , , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Основной.НДФЛ), , Организация = &Организация) КАК БухгалтерскийУчетОборотыДтКт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО БухгалтерскийУчетОборотыДтКт.СубконтоДт1 = ЮрФизЛица.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДоходыПайщики.Клиент КАК Клиент,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицСрезПоследних.Гражданство = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ИЛИ РеквизитыФизическихЛицСрезПоследних.Гражданство.Код = ""643""
		|			ТОГДА 13
		|		ИНАЧЕ 15
		|	КОНЕЦ КАК СтавкаНДФЛ,
		|	СУММА(_ДоходыПайщики.СуммаДоход) КАК СуммаДохода,
		|	СУММА(ЕСТЬNULL(_НалогиПайщики.СуммаНалог, 0)) КАК СуммаНДФЛ,
		|	_ДоходыПайщики.ДатаНачисленияДохода КАК ДатаДохода,
		|	""1533"" КАК КодДохода
		|ПОМЕСТИТЬ _Пайщики
		|ИЗ
		|	_ДоходыПайщики КАК _ДоходыПайщики
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НалогиПайщики КАК _НалогиПайщики
		|		ПО _ДоходыПайщики.РегистраторОснование = _НалогиПайщики.РегистраторОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛиц.СрезПоследних(, ) КАК РеквизитыФизическихЛицСрезПоследних
		|		ПО _ДоходыПайщики.Клиент = РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	_ДоходыПайщики.Клиент В(&СписокПайщиков)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДоходыПайщики.Клиент,
		|	_ДоходыПайщики.ДатаНачисленияДохода,
		|	_НалогиПайщики.ДатаВыплатыНалога,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицСрезПоследних.Гражданство = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ИЛИ РеквизитыФизическихЛицСрезПоследних.Гражданство.Код = ""643""
		|			ТОГДА 13
		|		ИНАЧЕ 15
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода,
		|	ВЫБОР
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
		|			ТОГДА 13
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
		|			ТОГДА 15
		|	КОНЕЦ,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаДохода,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Основание.Дата,
		|	""3022""
		|ИЗ
		|	Документ.РаспределениеДоходаПайщикам.НачислениеНДФЛ КАК РаспределениеДоходаПайщикамНачислениеНДФЛ
		|ГДЕ
		|	ГОД(РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Основание.Дата) = &НалоговыйПериод
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Проведен
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Организация = &Организация
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода В(&СписокПайщиков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокФизЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ
		|			ТОГДА ""1""
		|		ИНАЧЕ ""2""
		|	КОНЕЦ КАК СтатусНалогоплательщика,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство.Код КАК Гражданство,
		|	КодыДокументовФизЛиц.Код КАК КодУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности
		|ПОМЕСТИТЬ _РеквизитыФизЛиц
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеПоНДФЛ.Клиент КАК ЮрФизЛицо
		|	ИЗ
		|		_ДанныеПоНДФЛ КАК _ДанныеПоНДФЛ
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_Пайщики.Клиент
		|	ИЗ
		|		_Пайщики КАК _Пайщики) КАК СписокФизЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&КонецНалоговогоПериода,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО СписокФизЛиц.ЮрФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонецНалоговогоПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.УказаниеЦБ3484У)) КАК КодыДокументовФизЛиц
		|		ПО (РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = КодыДокументовФизЛиц.Объект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Организация КАК Организация,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КПП КАК КПП,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КППКрупнейшегоНалогоплательщика КАК КППКрупнейшегоНалогоплательщика,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КодПоОКТМО КАК КодПоОКТМО,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны
		|ПОМЕСТИТЬ _РеквизитыОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО Организации.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""NO_NDFL2_"" + ВЫБОР
		|		КОГДА ПОДСТРОКА(_РеквизитыОрганизации.КППКрупнейшегоНалогоплательщика, 1, 1) = """"
		|			ТОГДА ПОДСТРОКА(_РеквизитыОрганизации.КПП, 1, 4)
		|		ИНАЧЕ ПОДСТРОКА(_РеквизитыОрганизации.КППКрупнейшегоНалогоплательщика, 1, 4)
		|	КОНЕЦ + ""_"" + ПОДСТРОКА(_РеквизитыОрганизации.КПП, 1, 4) + ""_"" + _РеквизитыОрганизации.ИНН + _РеквизитыОрганизации.КПП + ""_"" + &ПериодСтрокой КАК ИдФайл,
		|	""КОНТУР-ОТЧЕТ ПФ 1.0"" КАК ВерсПрог,
		|	""5.06"" КАК ВерсФорм
		|ПОМЕСТИТЬ _Файл
		|ИЗ
		|	_РеквизитыОрганизации КАК _РеквизитыОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""1151078"" КАК КНД,
		|	&Период КАК ДатаДок,
		|	&НалоговыйПериод КАК ОтчетГод,
		|	""1"" КАК Признак,
		|	ПОДСТРОКА(_РеквизитыОрганизации.КПП, 1, 4) КАК КодНО
		|ПОМЕСТИТЬ _Документ
		|ИЗ
		|	_РеквизитыОрганизации КАК _РеквизитыОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыОрганизации.КодПоОКТМО КАК ОКТМО,
		|	_РеквизитыОрганизации.Телефоны КАК Тлф
		|ПОМЕСТИТЬ _СвНА
		|ИЗ
		|	_РеквизитыОрганизации КАК _РеквизитыОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыОрганизации.КраткоеНаименованиеПоУставу КАК НаимОрг,
		|	_РеквизитыОрганизации.ИНН КАК ИННЮЛ,
		|	_РеквизитыОрганизации.КПП КАК КПП
		|ПОМЕСТИТЬ _СвНАЮЛ
		|ИЗ
		|	_РеквизитыОрганизации КАК _РеквизитыОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицСрезПоследних.Отчество КАК Отчество
		|ПОМЕСТИТЬ _ПодписантФИО
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛиц.СрезПоследних(
		|			&Период,
		|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &Подписант) КАК РеквизитыФизическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыФизЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|	АВТОНОМЕРЗАПИСИ() КАК НомСпр,
		|	""00"" КАК НомКорр
		|ПОМЕСТИТЬ _НДФЛ2
		|ИЗ
		|	_РеквизитыФизЛиц КАК _РеквизитыФизЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыФизЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|	_РеквизитыФизЛиц.СтатусНалогоплательщика КАК Статус,
		|	_РеквизитыФизЛиц.ДатаРождения КАК ДатаРожд,
		|	_РеквизитыФизЛиц.Гражданство КАК Гражд
		|ПОМЕСТИТЬ _ПолучДох
		|ИЗ
		|	_РеквизитыФизЛиц КАК _РеквизитыФизЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыФизЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|	_РеквизитыФизЛиц.Фамилия КАК Фамилия,
		|	_РеквизитыФизЛиц.Имя КАК Имя,
		|	_РеквизитыФизЛиц.Отчество КАК Отчество
		|ПОМЕСТИТЬ _ПолучДохФИО
		|ИЗ
		|	_РеквизитыФизЛиц КАК _РеквизитыФизЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыФизЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
		|	_РеквизитыФизЛиц.КодУдостоверенияЛичности КАК КодУдЛичн,
		|	ПОДСТРОКА(_РеквизитыФизЛиц.СерияУдостоверенияЛичности, 1, 2) + "" "" + ПОДСТРОКА(_РеквизитыФизЛиц.СерияУдостоверенияЛичности, 3, 2) + "" "" + _РеквизитыФизЛиц.НомерУдостоверенияЛичности КАК СерНомДок
		|ПОМЕСТИТЬ _ПолучДохУдЛичнФЛ
		|ИЗ
		|	_РеквизитыФизЛиц КАК _РеквизитыФизЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеПоНДФЛ.Клиент КАК ЮрФизЛицо,
		|	_ДанныеПоНДФЛ.Ставка КАК Ставка
		|ПОМЕСТИТЬ _СведДох
		|ИЗ
		|	_ДанныеПоНДФЛ КАК _ДанныеПоНДФЛ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_Пайщики.Клиент,
		|	_Пайщики.СтавкаНДФЛ
		|ИЗ
		|	_Пайщики КАК _Пайщики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияНалогов.Налогоплательщик КАК Налогоплательщик,
		|	ВЫБОР
		|		КОГДА НачисленияНалогов.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|			ТОГДА 13
		|		КОГДА НачисленияНалогов.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
		|			ТОГДА 15
		|	КОНЕЦ КАК Ставка,
		|	СУММА(НачисленияНалогов.Сумма) КАК СуммаНалога,
		|	-СУММА(ВЫБОР
		|			КОГДА НачисленияНалогов.Примечание = ""Сумма уменьшающая налог по дивидендам""
		|				ТОГДА НачисленияНалогов.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаУменьшающаяНалог
		|ПОМЕСТИТЬ _НалогНачисленный
		|ИЗ
		|	РегистрНакопления.НачисленияНалогов КАК НачисленияНалогов
		|ГДЕ
		|	НачисленияНалогов.Организация = &Организация
		|	И НачисленияНалогов.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ГОД) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И НачисленияНалогов.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияНалогов.Налогоплательщик,
		|	ВЫБОР
		|		КОГДА НачисленияНалогов.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|			ТОГДА 13
		|		КОГДА НачисленияНалогов.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
		|			ТОГДА 15
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДанныеПоНДФЛ.Клиент КАК ЮрФизЛицо,
		|	_ДанныеПоНДФЛ.Ставка КАК Ставка,
		|	СУММА(_ДанныеПоНДФЛ.Сумма2НДФЛДоход) КАК СумДохОбщ,
		|	СУММА(_ДанныеПоНДФЛ.Сумма2НДФЛДоход - _ДанныеПоНДФЛ.Сумма2НДФЛВычет) КАК НалБаза
		|ПОМЕСТИТЬ _СумИтНалПерПредварительно
		|ИЗ
		|	_ДанныеПоНДФЛ КАК _ДанныеПоНДФЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПоНДФЛ.Клиент,
		|	_ДанныеПоНДФЛ.Ставка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СуммыНалога.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СуммыНалога.Ставка КАК Ставка,
		|	СУММА(СуммыНалога.СумДохОбщ) КАК СумДохОбщ,
		|	СУММА(СуммыНалога.НалБаза) КАК НалБаза,
		|	СУММА(СуммыНалога.НалИсчисл) КАК НалИсчисл,
		|	СУММА(СуммыНалога.НалУдерж) КАК НалУдерж,
		|	СУММА(СуммыНалога.АвансПлатФикс) КАК АвансПлатФикс,
		|	СУММА(СуммыНалога.НалПеречисл) КАК НалПеречисл,
		|	СУММА(СуммыНалога.НалУдержЛиш) КАК НалУдержЛиш,
		|	СУММА(СуммыНалога.НалНеУдерж) КАК НалНеУдерж,
		|	СУММА(СуммыНалога.СумНалПрибЗач) КАК СумНалПрибЗач
		|ПОМЕСТИТЬ _СумИтНалПер
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СумИтНалПерПредварительно.ЮрФизЛицо КАК ЮрФизЛицо,
		|		_СумИтНалПерПредварительно.Ставка КАК Ставка,
		|		_СумИтНалПерПредварительно.СумДохОбщ КАК СумДохОбщ,
		|		_СумИтНалПерПредварительно.НалБаза КАК НалБаза,
		|		_НалогНачисленный.СуммаНалога КАК НалИсчисл,
		|		_НалогНачисленный.СуммаНалога КАК НалУдерж,
		|		0 КАК АвансПлатФикс,
		|		_НалогНачисленный.СуммаНалога КАК НалПеречисл,
		|		0 КАК НалУдержЛиш,
		|		0 КАК НалНеУдерж,
		|		_НалогНачисленный.СуммаУменьшающаяНалог КАК СумНалПрибЗач
		|	ИЗ
		|		_СумИтНалПерПредварительно КАК _СумИтНалПерПредварительно
		|			ЛЕВОЕ СОЕДИНЕНИЕ _НалогНачисленный КАК _НалогНачисленный
		|			ПО _СумИтНалПерПредварительно.ЮрФизЛицо = _НалогНачисленный.Налогоплательщик
		|				И _СумИтНалПерПредварительно.Ставка = _НалогНачисленный.Ставка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_Пайщики.Клиент,
		|		_Пайщики.СтавкаНДФЛ,
		|		СУММА(_Пайщики.СуммаДохода),
		|		СУММА(_Пайщики.СуммаДохода),
		|		СУММА(_Пайщики.СуммаНДФЛ),
		|		СУММА(_Пайщики.СуммаНДФЛ),
		|		0,
		|		СУММА(_Пайщики.СуммаНДФЛ),
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		_Пайщики КАК _Пайщики
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_Пайщики.Клиент,
		|		_Пайщики.СтавкаНДФЛ) КАК СуммыНалога
		|
		|СГРУППИРОВАТЬ ПО
		|	СуммыНалога.ЮрФизЛицо,
		|	СуммыНалога.Ставка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоНДФЛ.Клиент КАК ЮрФизЛицо,
		|	_ДанныеПоНДФЛ.Ставка КАК Ставка,
		|	_ДанныеПоНДФЛ.Месяц КАК Месяц,
		|	_ДанныеПоНДФЛ.ВидДохода.Код КАК КодДоход,
		|	СУММА(_ДанныеПоНДФЛ.Сумма2НДФЛДоход) КАК СумДоход
		|ПОМЕСТИТЬ _СвСумДох
		|ИЗ
		|	_ДанныеПоНДФЛ КАК _ДанныеПоНДФЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПоНДФЛ.Клиент,
		|	_ДанныеПоНДФЛ.Ставка,
		|	_ДанныеПоНДФЛ.Месяц,
		|	_ДанныеПоНДФЛ.ВидДохода.Код
		|
		|ИМЕЮЩИЕ
		|	СУММА(_ДанныеПоНДФЛ.Сумма2НДФЛДоход) <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_Пайщики.Клиент,
		|	_Пайщики.СтавкаНДФЛ,
		|	МЕСЯЦ(_Пайщики.ДатаДохода),
		|	_Пайщики.КодДохода,
		|	СУММА(_Пайщики.СуммаДохода)
		|ИЗ
		|	_Пайщики КАК _Пайщики
		|
		|СГРУППИРОВАТЬ ПО
		|	_Пайщики.Клиент,
		|	_Пайщики.СтавкаНДФЛ,
		|	_Пайщики.КодДохода,
		|	МЕСЯЦ(_Пайщики.ДатаДохода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоНДФЛ.Клиент КАК ЮрФизЛицо,
		|	_ДанныеПоНДФЛ.Ставка КАК Ставка,
		|	_ДанныеПоНДФЛ.Месяц КАК Месяц,
		|	_СвязиКодов.ВидДохода.Код КАК КодДоход,
		|	_ДанныеПоНДФЛ.ВидВычета.Код КАК КодВычет,
		|	СУММА(_ДанныеПоНДФЛ.Сумма2НДФЛВычет) КАК СумВычет
		|ПОМЕСТИТЬ _СвСумВыч
		|ИЗ
		|	_ДанныеПоНДФЛ КАК _ДанныеПоНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СвязиКодов КАК _СвязиКодов
		|		ПО _ДанныеПоНДФЛ.ВидВычета = _СвязиКодов.ВидВычета
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПоНДФЛ.Клиент,
		|	_ДанныеПоНДФЛ.Ставка,
		|	_ДанныеПоНДФЛ.Месяц,
		|	_СвязиКодов.ВидДохода,
		|	_ДанныеПоНДФЛ.ВидВычета.Код,
		|	_СвязиКодов.ВидДохода.Код
		|
		|ИМЕЮЩИЕ
		|	СУММА(_ДанныеПоНДФЛ.Сумма2НДФЛВычет) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СвСумВыч.КодВычет КАК КодВычет
		|ПОМЕСТИТЬ _КонтрольПарныхКодов
		|ИЗ
		|	_СвСумВыч КАК _СвСумВыч
		|ГДЕ
		|	_СвСумВыч.КодДоход ЕСТЬ NULL";
	
#КонецОбласти	

	Запрос.Выполнить();
	
КонецПроцедуры

Процедура КонтрольПарныхКодов(Запрос, Отказ)
	
	КонтрольПарныхКодов = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КонтрольПарныхКодов").ПолучитьДанные().Выгрузить();
	Для Каждого СтрокаКонтрольПарныхКодов Из КонтрольПарныхКодов Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код вычета " + СтрокаКонтрольПарныхКодов.КодВычет + " не связан с кодом дохода",,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПакетДанных_Файл()

	Перем Запрос;
	
	ТаблицыЗапроса = Новый Структура;
	
	Отказ = Ложь;
	
	ЗаполнитьВременныеТаблицы(Запрос);
	
	КонтрольПарныхКодов(Запрос, Отказ);
	
	ПакетДанных = ПолучитьСтруктуруИзЗапроса(Запрос, "_Файл");
	ПакетДанных.Вставить("ИмяФайла"	, ПакетДанных.ИдФайл + ".xml");
	ПакетДанных.Вставить("Документ"	, ПолучитьПакетДанных_Документ(Запрос));
	ПакетДанных.Вставить("Отказ"	, Отказ);
	
	ТаблицыЗапроса = "";
	
	Возврат ПакетДанных;
	
КонецФункции

Функция ПолучитьПакетДанных_Документ(Запрос)

	Документ = ПолучитьСтруктуруИзЗапроса(Запрос, "_Документ");
	Документ.Вставить("СвНА"		, ПолучитьПакетДанных_СвНА(Запрос));
	Документ.Вставить("Подписант"	, ПолучитьПакетДанных_Подписант(Запрос));
	Документ.Вставить("НДФЛ_2"		, ПолучитьПакетДанных_НДФЛ_2(Запрос));
	
	Возврат Документ;
	
КонецФункции

Функция ПолучитьПакетДанных_СвНА(Запрос) //Сведения налогового агента
	
	СвНА = ПолучитьСтруктуруИзЗапроса(Запрос, "_СвНА");
	СвНА.Вставить("СвНАЮЛ", ПолучитьСтруктуруИзЗапроса(Запрос, "_СвНАЮЛ"));
	
	Возврат СвНА;
	
КонецФункции

Функция ПолучитьПакетДанных_Подписант(Запрос)
	
	Подписант = Новый Структура("ПрПодп", "1"); 
	Подписант.Вставить("ФИО", ПолучитьСтруктуруИзЗапроса(Запрос, "_ПодписантФИО"));
	
	Возврат Подписант;
	
КонецФункции

Функция ПолучитьПакетДанных_НДФЛ_2(Запрос)

	МассивНДФЛ_2 = Новый Массив;
	
	Таблица_НДФЛ2 =  ПолучитьТаблицуЗапроса(Запрос, "_НДФЛ2");
	Для Каждого Строка_НДФЛ2 Из Таблица_НДФЛ2 Цикл
		Отбор = Новый Структура("ЮрФизЛицо", Строка_НДФЛ2.ЮрФизЛицо);
		
		НДФЛ2 = Новый Структура;
		
		НДФЛ2.Вставить("НомСпр"		, СериализоватьЗначение(Строка_НДФЛ2, "НомСпр", "_НДФЛ2"));
		НДФЛ2.Вставить("НомКорр"	, СериализоватьЗначение(Строка_НДФЛ2, "НомКорр", "_НДФЛ2"));
		НДФЛ2.Вставить("ПолучДох"	, ПолучитьПакетДанных_ПолучДох(Запрос, Отбор));
		НДФЛ2.Вставить("СведДох"	, ПолучитьПакетДанных_СведДох(Запрос, Отбор));
		
		МассивНДФЛ_2.Добавить(НДФЛ2);
	КонецЦикла;
	
	Возврат МассивНДФЛ_2;
	
КонецФункции

Функция ПолучитьПакетДанных_ПолучДох(Запрос, Знач Отбор)
	
	ПолучДох = ПолучитьСтруктуруИзЗапроса(Запрос, "_ПолучДох", Отбор);
	ПолучДох.Вставить("ФИО"		, ПолучитьСтруктуруИзЗапроса(Запрос, "_ПолучДохФИО"		, Отбор));	
	ПолучДох.Вставить("УдЛичнФЛ", ПолучитьСтруктуруИзЗапроса(Запрос, "_ПолучДохУдЛичнФЛ", Отбор));	
	
	Возврат ПолучДох;
	
КонецФункции

Функция ПолучитьПакетДанных_СведДох(Запрос, Знач Отбор)
	
	Массив = Новый Массив;
	
	Таблица_СведДох =  ПолучитьТаблицуЗапроса(Запрос, "_СведДох");
	НайденныеСтроки = Таблица_СведДох.НайтиСтроки(Отбор);
	
	Для Каждого Строка_СведДох Из НайденныеСтроки Цикл
		Отбор.Вставить("Ставка", Строка_СведДох.Ставка);
		
		СведДох = Новый Структура;
		
		СведДох.Вставить("Ставка"		, СериализоватьЗначение(Строка_СведДох, "Ставка", "_СведДох"));
		СведДох.Вставить("СумИтНалПер"	, ПолучитьСтруктуруИзЗапроса(Запрос, "_СумИтНалПер", Отбор));
		СведДох.Вставить("ДохВыч"		, ПолучитьПакетДанных_ДохВыч(Запрос, Отбор));
		
		Отбор.Удалить("Месяц");
		Отбор.Удалить("КодДоход");
		
		Массив.Добавить(СведДох);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьПакетДанных_ДохВыч(Запрос, Знач Отбор)
	
	ДохВыч = Новый Структура;
	Массив = Новый Массив;
	
	Таблица_СвСумДох	= ПолучитьТаблицуЗапроса(Запрос, "_СвСумДох"); 
	НайденныеСтроки		= Таблица_СвСумДох.НайтиСтроки(Отбор);
	
	Для Каждого Строка_ДохВыч Из НайденныеСтроки Цикл
		Отбор.Вставить("Месяц"		, Строка_ДохВыч.Месяц);
		Отбор.Вставить("КодДоход"	, Строка_ДохВыч.КодДоход);
		
		СвСумДох = Новый Структура;
		СвСумДох.Вставить("Месяц"		, СериализоватьЗначение(Строка_ДохВыч, "Месяц"	, "_СвСумДох"));
		СвСумДох.Вставить("КодДоход"	, СериализоватьЗначение(Строка_ДохВыч, "КодДоход", "_СвСумДох"));
		СвСумДох.Вставить("СумДоход"	, СериализоватьЗначение(Строка_ДохВыч, "СумДоход", "_СвСумДох"));
		
		СвСумДох.Вставить("СвСумВыч", ПолучитьСтруктуруИзЗапроса(Запрос, "_СвСумВыч", Отбор));

		//Отбор.Удалить("Месяц");
		
		Массив.Добавить(СвСумДох);
	КонецЦикла;
	
	ДохВыч.Вставить("СвСумДох", Массив);
	
	Возврат ДохВыч;
	
КонецФункции

Функция ПолучитьСтруктуруИзЗапроса(Запрос, ИмяТаблицы, Отбор = Неопределено)
	
	Приемник = Новый Структура;
	Источник = ПолучитьТаблицуЗапроса(Запрос, ИмяТаблицы); 
	
	Колонки = Новый Массив;
	
	Для Каждого Колонка Из Источник.Колонки Цикл
		Если Отбор = Неопределено ИЛИ НЕ Отбор.Свойство(Колонка.Имя) Тогда
			Колонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если Отбор = Неопределено Тогда
		Для Каждого Строка_Источник Из Источник Цикл
			Для Каждого Колонка Из Колонки Цикл
				Приемник.Вставить(Колонка, СериализоватьЗначение(Строка_Источник, Колонка, ИмяТаблицы));
			КонецЦикла;
		КонецЦикла;
	Иначе
		НайденныеСтроки = Источник.НайтиСтроки(Отбор);
		Для Каждого Строка_Источник Из НайденныеСтроки Цикл
			Для Каждого Колонка Из Колонки Цикл
				Приемник.Вставить(Колонка, СериализоватьЗначение(Строка_Источник, Колонка, ИмяТаблицы));
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Приемник;
	
КонецФункции

Функция СериализоватьЗначение(СтрокаИсточника, ИмяКолонки, ИмяТаблицы)
	
	Значение = СтрокаИсточника[ИмяКолонки];
	
	Если ИмяКолонки = "Месяц" Тогда
		Возврат Прав("0" + Значение, 2); // 3 = "03"
		
	ИначеЕсли ИмяКолонки = "ОКТМО" И ИмяТаблицы = "_СвНА" Тогда
		Возврат Лев(Значение, 8);
		
	ИначеЕсли ИмяКолонки = "ОтчетГод"
		ИЛИ ИмяКолонки = "НомСпр"
		ИЛИ ИмяКолонки = "Ставка" Тогда
		Возврат Формат(Значение, "ЧРД=.; ЧГ=0");
		
	ИначеЕсли ИмяКолонки = "НалИсчисл"
		ИЛИ ИмяКолонки = "НалУдерж"
		ИЛИ ИмяКолонки = "АвансПлатФикс"
		ИЛИ ИмяКолонки = "НалПеречисл" 
		ИЛИ ИмяКолонки = "НалУдержЛиш"
		ИЛИ ИмяКолонки = "НалНеУдерж" 
		ИЛИ ИмяКолонки = "СумНалПрибЗач" Тогда
		Возврат Формат(Значение, "ЧДЦ=0; ЧН=0; ЧГ=0");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=0");
		
	Иначе
		Возврат Значение;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуЗапроса(Запрос, ИмяТаблицы)
	
	Если НЕ ТаблицыЗапроса.Свойство(ИмяТаблицы) Тогда
		ТаблицаЗапроса = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяТаблицы).ПолучитьДанные().Выгрузить();
		ТаблицыЗапроса.Вставить(ИмяТаблицы, ТаблицаЗапроса);
	КонецЕсли;
		
	Возврат ТаблицыЗапроса[ИмяТаблицы];
	
КонецФункции

Функция ПолучитьМассивИзЗапроса(Запрос, ИмяТаблицы)
	
	Массив = Новый Массив;
	Массив.Добавить(ПолучитьСтруктуруИзЗапроса(Запрос, ИмяТаблицы));
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#Область Выгрузка_данных

Функция СформироватьXML()
	
	ПакетДанных = ПолучитьПакетДанных_Файл();
	
	Если ПакетДанных.Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	ПространстваИмен = "Kontur";
	
	ИмяФайла		 = ПолучитьИмяВременногоФайла("xml");	
	ИмяФайлаXSDСхемы = ПолучитьИмяВременногоФайла("xsd");
	
	МакетXSDСхемы = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Схема");	
	МакетXSDСхемы.Записать(ИмяФайлаXSDСхемы);
	
	ФайлыXSD = Новый Массив;
	ФайлыXSD.Добавить(ИмяФайлаXSDСхемы);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла, "windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	НоваяФабрикаXDTO = СоздатьФабрикуXDTO(ФайлыXSD);
	
	ТипОбъектаXDTO = НоваяФабрикаXDTO.Тип(ПространстваИмен, "Файл");
	
	ПакетДанныхXML = ПреобразоватьЗначениеВXML(ПакетДанных, "Файл", НоваяФабрикаXDTO, ТипОбъектаXDTO);
	
	НоваяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПакетДанныхXML, "Файл");
	
	ЗаписьXML.Закрыть();
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.Прочитать(ИмяФайла, "windows-1251");
	ТекстовыйФайл.ЗаменитьСтроку(2, СтрЗаменить(ТекстовыйФайл.ПолучитьСтроку(2), "xmlns=""Kontur"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" ", ""));
	ТекстовыйФайл.Записать(ИмяФайла,"windows-1251");
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФайла"		, ПакетДанных.ИмяФайла);
	Результат.Вставить("ДвоичныеДанные"	, Новый ДвоичныеДанные(ИмяФайла));
	
	УдалитьФайлы(ИмяФайла);	
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьЗначениеВXML(ПакетДанных, ИмяЭлемента, НоваяФабрикаXDTO, ТипОбъектаXDTO = "", ЕстьДанные = ЛОЖЬ)
	
	ТипЗначения = ТипЗнч(ПакетДанных);
	
	Если ТипЗначения = Тип("Структура")  Тогда
		ОбъектXDTO = НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO);

		Для Каждого ЭлементПакета Из ПакетДанных Цикл
			Если ТипЗнч(ЭлементПакета.Значение) = Тип("Массив") Тогда
				Для Каждого ЭлементМассива Из ЭлементПакета.Значение Цикл
					ЕстьДанныеВПодчиненныхЭлементах = Ложь;
					ЭлементОбъекта = ПреобразоватьЗначениеВXML(ЭлементМассива, ЭлементПакета.Ключ, НоваяФабрикаXDTO, ТипОбъектаXDTO.Свойства.Получить(ЭлементПакета.Ключ).Тип, ЕстьДанныеВПодчиненныхЭлементах);
					Если ЕстьДанныеВПодчиненныхЭлементах 
						ИЛИ ТипОбъектаXDTO.Свойства.Получить(ЭлементПакета.Ключ).НижняяГраница > 0 Тогда
						ОбъектXDTO[ЭлементПакета.Ключ].Добавить(ЭлементОбъекта);
					КонецЕсли;
					ЕстьДанные = МАКС(ЕстьДанныеВПодчиненныхЭлементах, ЕстьДанные);
				КонецЦикла;
			ИначеЕсли ТипОбъектаXDTO.Свойства.Получить(ЭлементПакета.Ключ) <> Неопределено Тогда
				ЕстьДанныеВПодчиненныхЭлементах = Ложь;
				ЭлементОбъекта = ПреобразоватьЗначениеВXML(ЭлементПакета.Значение, ЭлементПакета.Ключ, НоваяФабрикаXDTO, ТипОбъектаXDTO.Свойства.Получить(ЭлементПакета.Ключ).Тип, ЕстьДанныеВПодчиненныхЭлементах);
				Если ЕстьДанныеВПодчиненныхЭлементах 
					ИЛИ ТипОбъектаXDTO.Свойства.Получить(ЭлементПакета.Ключ).НижняяГраница > 0 Тогда
					ОбъектXDTO[ЭлементПакета.Ключ] = ЭлементОбъекта;
				КонецЕсли;
				ЕстьДанные = МАКС(ЕстьДанныеВПодчиненныхЭлементах, ЕстьДанные);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЭтоПримитивныйТип(ПакетДанных) Тогда
		ЕстьДанные	= МАКС(ЗначениеЗаполнено(ПакетДанных), ЕстьДанные);
		Если ТипЗнч(ПакетДанных) = Тип("Null")    Тогда
			ОбъектXDTO	= НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO, "");
		Иначе	
			ОбъектXDTO	= НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO, ПакетДанных);
		КонецЕсли;
	Иначе
		ЕстьДанные	= МАКС(ЗначениеЗаполнено(ПакетДанных), ЕстьДанные);
		ОбъектXDTO	= НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO, СериализаторXDTO.XMLСтрока(ПакетДанных));
	КонецЕсли;                                                 
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция ЭтоПримитивныйТип(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Строка")
		ИЛИ ТипЗначения = Тип("Булево")
		ИЛИ ТипЗначения = Тип("Дата")
		ИЛИ ТипЗначения = Тип("Число")
		ИЛИ ТипЗначения = Тип("Неопределено")
		ИЛИ ТипЗначения = Тип("Null")
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

