
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, "Рассылка уведомлений и отчетов о сделках", "0.09", "", Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "РассылкаДанныхОСделкахВРежимеPSOB",				"Рассылка данных о сделках в режиме PSOB",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомлениеОЗаключенииСделокРПС",  				"Уведомление о заключении сделок РПС",,	Ложь, "ВызовСерверногоМетода");
    РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомлениеОЗаключенииСделокРПС_Национальный", 	"Уведомление о заключении сделок РПС (Национальный)",,	Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции 

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	Организация = ПараметрыКоманды.Организация;
	
	Если ИдентификаторКоманды = "РассылкаДанныхОСделкахВРежимеPSOB" Тогда
		
		ДатаФормированияОтчета = НачалоДня(ТекущаяДатаСеанса());
				
		Если ЭтоПервыйРабочийДеньМесяца(ДатаФормированияОтчета) Тогда
					
			ДатаПредыдущегоМесяца = ДобавитьМесяц(ДатаФормированияОтчета, -1);
			
			//проверяем сделки каждый первый рабочий день месяца с 01.01.2026
			ПериодОтчета = Новый СтандартныйПериод;
			ПериодОтчета.ДатаНачала    = Дата(2026,01,01);
			ПериодОтчета.ДатаОкончания = КонецМесяца(ДатаПредыдущегоМесяца);
			
			СформироватьИОтправитьОтчетОСделкахВРежимеPSOB(ПериодОтчета, Организация,, Истина);
			
		КонецЕсли;
		
	ИначеЕсли ИдентификаторКоманды = "УведомлениеОЗаключенииСделокРПС" Тогда
		
		Дата = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
				
		Если ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(Организация) Тогда
			ОтправитьУведомленияОСделкахРПС(Дата, Организация);
		КонецЕсли;
		
	ИначеЕсли ИдентификаторКоманды = "УведомлениеОЗаключенииСделокРПС_Национальный" Тогда
		
		Дата = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
		Организация = ПараметрыКоманды.Организация;
		
		Если ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(Организация) Тогда
			ОтправитьУведомленияОСделкахРПС_Национальный(Дата, Организация);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры // ВыполнитьКоманду

Функция ЭтоПервыйРабочийДеньМесяца(ДатаФормированияОтчета)
		
	//Рассылаем отчет в первый рабочий день месяца	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(ДанныеКалендаря.Дата) КАК ПервыйРабочийДеньМесяца
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ДатаФормированияОтчета));
	Запрос.УстановитьПараметр("КонецМесяца" , КонецМесяца(ДатаФормированияОтчета));
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Если Результат[0].ПервыйРабочийДеньМесяца = НачалоДня(ДатаФормированияОтчета) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции //ЭтоПервыйРабочийДеньМесяца

Функция СформироватьИОтправитьОтчетОСделкахВРежимеPSOB(Период, Организация, ПолучателиОтчета = "", СформироватьОповещения = Ложь) Экспорт
	
#Область НАЧАЛО_СЕССИИ	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьИОтправитьОтчетОСделкахВРежимеPSOB";
	
	ПараметрыОтчета = Новый Структура("Период, ПолучателиОтчета", Период, ПолучателиОтчета);
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	Описание  = "Период: " + Период + Символы.ПС + "ПолучателиОтчета: " + ПолучателиОтчета;	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
#КонецОбласти
			
	Запрос = Новый Запрос;
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Организация КАК Организация,
		|	Сделка.Ссылка КАК Ссылка,
		|	Сделка.Дата КАК Дата,
		|	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Сделка.НомерСделки КАК НомерСделки
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО Сделка.Ссылка = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство = &РаскрытыйКонтрагент)
		|ГДЕ
		|	Сделка.Проведен = ИСТИНА
		|	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Сделка.Организация = &Организация
		|	И Сделка.РежимБиржевыхТоргов В (&Режим_ММВБ_PSOB, &Режим_ММВБ_PTOB)
		|	И (ЗначенияДополнительныхСведений.Значение ЕСТЬ NULL
		|			ИЛИ ЗначенияДополнительныхСведений.Значение = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Дата,
		|	НомерСделки
		|ИТОГИ ПО
		|	Организация";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Режим_ММВБ_PSOB", ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ_PSOB"));
	Запрос.УстановитьПараметр("Режим_ММВБ_PTOB", ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ_PTOB"));
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("РаскрытыйКонтрагент", ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "_РаскрытыйКонтрагент"));
		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
#Область ТЕКСТ_ПИСЬМА	
	Текст_HTML = "";
	Пока Выборка.Следующий() Цикл
		
		Текст_HTML = Текст_HTML + 
			"<tr class=""company"">
			|	<td colspan=""4"", align = ""left"">" + Выборка.Организация + "</td>
			|</tr>";
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Текст_HTML = Текст_HTML + 
				"<tr> 
				|	<td>" + Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=Д") + "</td>
				|	<td>" + Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=В") + "</td>
				|	<td>" + ВыборкаДетальныеЗаписи.СчетДоверительногоУправления + "</td>
				|	<td>" + ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.НомерСделки) + "</td> 
				|</tr>";
		КонецЦикла;
				
	КонецЦикла;
	
	Если Текст_HTML = "" Тогда
		
		Текст_HTML =
			"<html><head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8""></head>
			|<body><a>В период с " + Формат(Период.ДатаНачала, "ДЛФ=Д") + " по " + Формат(Период.ДатаОкончания, "ДЛФ=Д") + " отсутствуют сделки в режиме PSOB/PTOB, у которых не заполнено значение [Раскрытый контрагент].</a>
			|</body></html>";
		
	Иначе
		
		Текст_HTML =
			"<html>
			|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
			|	<style>
			|		body  { font: 10pt sans-serif; }
			|		table { text-align: center; border-spacing: 0; border-collapse: collapse; }
			|		td    { font-size: 1em; border: 1px solid #CCC085; padding: 5px 20px 5px 20px; }
			|		.company { font-size: 14px; background: #F8F2D8; }
			|		.top  { font-size: 15px; background: #F4ECC5; }
			|	</style>
			|</head>
			|<body>
			|<a>Перечень сделок cовершенных в режиме PSOB/PTOB (РПС:А1-Облигации) в период с " + Формат(Период.ДатаНачала, "ДЛФ=Д") + " по " + Формат(Период.ДатаОкончания, "ДЛФ=Д") + ", у которых не заполнено значение [Раскрытый контрагент]</a>
			|<table cols=""4""><tr class=""top""><td>Дата сделки</td><td>Время сделки</td><td>Счет доверительного управления</td><td>Сделка</td></tr>"
			+ Текст_HTML + "</table></body></html>";
			
	КонецЕсли;
#КонецОбласти

	Если ЗначениеЗаполнено(ПолучателиОтчета) Тогда
	
	    ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОтчета, "Отчет о сделках (режим PSOB,PTOB РПС:А1-Облигации). УК " + Строка(Организация), Текст_HTML, "HTML");		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		
	ИначеЕсли СформироватьОповещения Тогда
		
		РеквизитыОповещения = Новый Структура("Тема, Текст", "Отчет о сделках (режим PSOB,PTOB РПС:А1-Облигации). УК " + Строка(Организация), Текст_HTML);
		Справочники.Оповещения.СформироватьОповещения("ВнешняяОбработка._РассылкаУведомленийИОтчетовОСделках.СформироватьИОтправитьОтчетОСделкахВРежимеPSOB", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат Текст_HTML;

КонецФункции //СформироватьИОтправитьОтчетОСделкахВРежимеPSOB

Процедура ОтправитьУведомленияОСделкахРПС(Дата, Организация, Отказ = Ложь) Экспорт
	
#Область НАЧАЛО_СЕССИИ
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ОтправитьУведомленияОСделкахРПС";
	
	ПараметрыОтчета = Новый Структура("Дата, Организация", Дата, Организация);
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	Описание  = "Дата: " + Дата + Символы.ПС + "Организация: " + Организация;	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
		
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
#КонецОбласти

	ИсключаемыеКодыРасчетовНаБирже = Новый Массив;
	ИсключаемыеКодыРасчетовНаБирже.Добавить("Z0");
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акция""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ""Вексель""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ""Депозитарная расписка""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ""Доля""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|			ТОГДА ""Закладная""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ""Ипотечный сертификат участия""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигация""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ""Пай""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|						ТОГДА ""Фьючерс""
		|					КОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
		|						ТОГДА ""Опцион""
		|					КОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Спот)
		|						ТОГДА ""Спот""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.Наименование)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КраткоеНаименованиеЭмитента,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|	КОНЕЦ КАК РегистрационныйНомер,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номинал
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Номинал,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВалютаНоминала,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Ссылка.Номер КАК Номер,
		|	СделкаЦенныеБумаги.Ссылка.Дата КАК Дата,
		|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СделкаЦенныеБумаги.Ссылка.КонтрагентНаБирже КАК КонтрагентНаБирже
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО СделкаЦенныеБумаги.Ссылка = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство = &РаскрытыйКонтрагент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
		|ГДЕ
		|	СделкаЦенныеБумаги.НомерСтроки = 1
		|	И СделкаЦенныеБумаги.Ссылка.Организация = &Организация
		|	И СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СделкаЦенныеБумаги.Ссылка.РежимПереговорныхСделок
		|	И НЕ СделкаЦенныеБумаги.Ссылка.КодРасчетовНаБирже В (&ИсключаемыеКодыРасчетовНаБирже)
		|	И СделкаЦенныеБумаги.Ссылка.Проведен
		|	И НЕ СделкаЦенныеБумаги.Ссылка.ВыкупЭмитентом
		|	И (ЗначенияДополнительныхСведений.Значение ЕСТЬ NULL
		|			ИЛИ ЗначенияДополнительныхСведений.Значение = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправления");
#КонецОбласти
	
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", 					КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", 					Организация);  		
	Запрос.УстановитьПараметр("ИсключаемыеКодыРасчетовНаБирже",	ИсключаемыеКодыРасчетовНаБирже);
	Запрос.УстановитьПараметр("РаскрытыйКонтрагент", ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "_РаскрытыйКонтрагент"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Отказ = Истина;
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		РеквизитыОповещения = Новый Структура();
		РеквизитыОповещения.Вставить("НомерДокумента",					СокрЛП(Выборка.Номер));
		РеквизитыОповещения.Вставить("Дата",							Формат(Дата, "ДФ=dd.MM.yyyy"));
		РеквизитыОповещения.Вставить("КонтрагентНаБирже", 				?(СокрЛП(Выборка.КонтрагентНаБирже) = "", "Нет данных", СокрЛП(Выборка.КонтрагентНаБирже)));
		РеквизитыОповещения.Вставить("Организация",						Организация);
		РеквизитыОповещения.Вставить("СчетДоверительногоУправления",	Выборка.СчетДоверительногоУправления);
		
		НаименованиеЦеннойБумаги = СокрЛП(Выборка.ТипЦБ) +
			?(Выборка.КраткоеНаименованиеЭмитента = "", "", " "+ СокрЛП(Выборка.КраткоеНаименованиеЭмитента)) +
			?(Выборка.РегистрационныйНомер = "", "", ", " + СокрЛП(Выборка.РегистрационныйНомер)) + 
			?(Выборка.Номинал = "", "", ", " + Формат(Выборка.Номинал, "ЧГ=0")) + 
			?(Выборка.ВалютаНоминала = "", "", " " + СокрЛП(Выборка.ВалютаНоминала));
		
		РеквизитыОповещения.Вставить("ЦеннаяБумага", 					НаименованиеЦеннойБумаги);
		
		Справочники.Оповещения.СформироватьОповещения("ВнешняяОбработка._РассылкаУведомленийИОтчетовОСделках.ОтправитьУведомленияОСделкахРПС", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры

Процедура ОтправитьУведомленияОСделкахРПС_Национальный(Дата, Организация, Отказ = Ложь) Экспорт
	
#Область Начало_сессии

	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ОтправитьУведомленияОСделкахРПС_Национальный";
	
	ПараметрыОтчета = Новый Структура("Дата, Организация, Клиент", Дата, Организация, "НПФ Национальный");
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	Описание  = "Дата: " + Дата + Символы.ПС + "Организация: " + Организация;	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
		
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
#КонецОбласти
    	
#Область Текст_запроса

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.Ссылка.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
		|	ВЫБОР
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование)
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование)
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование)
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование)
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Закладные).Банк.Наименование)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА Сделки.Ссылка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""Покупка""
		|		ИНАЧЕ ""Продажа""
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|				И ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				И ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|				И ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
		|			ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|		КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|				И ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|	КОНЕЦ КАК ИдентификаторЦБ,
		|	Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Сделки.Дата КАК Дата,
		|	Сделки.Ссылка.КонтрагентНаБирже КАК Контрагент,
		|	Сделки.Сумма КАК Сумма,
		|	Сделки.Количество КАК Количество,
		|	Сделки.Сумма / Сделки.Количество КАК Цена
		|ИЗ
		|	(ВЫБРАТЬ
		|		СделкаЦенныеБумаги.Ссылка КАК Ссылка,
		|		НАЧАЛОПЕРИОДА(СделкаЦенныеБумаги.Ссылка.Дата, ДЕНЬ) КАК Дата,
		|		СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СУММА(СделкаЦенныеБумаги.Количество) КАК Количество,
		|		СУММА(СделкаЦенныеБумаги.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность) КАК Сумма
		|	ИЗ
		|		Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (КурсыВалют.Период = НАЧАЛОПЕРИОДА(СделкаЦенныеБумаги.Ссылка.Дата, ДЕНЬ))
		|				И (КурсыВалют.Валюта = СделкаЦенныеБумаги.Ссылка.ВалютаСделки)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ПО СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|	ГДЕ
		|		СделкаЦенныеБумаги.Ссылка.Организация = &Организация
		|		И СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И СделкаЦенныеБумаги.Ссылка.РежимПереговорныхСделок
		|		И НЕ СделкаЦенныеБумаги.Ссылка.ПервичноеРазмещение
		|		И НЕ СделкаЦенныеБумаги.Ссылка.РежимБиржевыхТоргов.Аукцион
		|		И СделкаЦенныеБумаги.Ссылка.Проведен
		|		И НЕ СделкаЦенныеБумаги.Ссылка.ВыкупЭмитентом
		|		И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СделкаЦенныеБумаги.Ссылка,
		|		НАЧАЛОПЕРИОДА(СделкаЦенныеБумаги.Ссылка.Дата, ДЕНЬ),
		|		СделкаЦенныеБумаги.ЦеннаяБумага
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(СделкаЦенныеБумаги.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность) <= 200000000) КАК Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО Сделки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА Сделки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|					ТОГДА ВЫРАЗИТЬ(Сделки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО Сделки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
		|ИТОГИ ПО
		|	НомерДоговораДУ");
	
#КонецОбласти
	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Клиент", 		ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Национальный"));
		
	ВыборкаСчетДУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаСчетДУ.Количество() = 0 Тогда
		Отказ = Истина;
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСделка	= Макет.ПолучитьОбласть("Сделка");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	
	ФорматФайла	= "docx";
	
	Пока ВыборкаСчетДУ.Следующий() Цикл
		
		НомерДоговораДУ = ВыборкаСчетДУ.НомерДоговораДУ;
		Результат = Новый ТабличныйДокумент;
		Результат.Вывести(ОбластьШапка);
		
		Выборка = ВыборкаСчетДУ.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбластьСделка.Параметры.Заполнить(Выборка);
			ОбластьСделка.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
			Результат.Вывести(ОбластьСделка);
				
		КонецЦикла;
		
		Результат.Вывести(ОбластьПодвал);
		
		РеквизитыОповещения = Новый Структура();
			
		РеквизитыОповещения.Вставить("Организация",		Организация);
		РеквизитыОповещения.Вставить("НомерДоговораДУ",	НомерДоговораДУ);
				
		ИмяФайла	= СтрШаблон("Уведомление о сделках РПС %1.%2", НомерДоговораДУ, ФорматФайла);
					
		ПотокВПамяти = Новый ПотокВПамяти();
		Результат.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента[ФорматФайла]); 
		ДвоичныеДанныеФайла = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
		
		Вложения = Новый Соответствие;
		Вложения.Вставить(ИмяФайла, ДвоичныеДанныеФайла);

		РеквизитыОповещения.Вставить("Вложения", Вложения);
		
		Справочники.Оповещения.СформироватьОповещения("ВнешняяОбработка._РассылкаУведомленийИОтчетовОСделках.ОтправитьУведомленияОСделкахРПС_Национальный", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры
