
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Контроль отчетности ЦБ",
		"0.18",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

Процедура ВыполнитьКонтроль(ПараметрыКоманды) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,ВариантОтчета");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКонтроль()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Выполнить ПараметрыКоманды.ВариантОтчета + "(ПараметрыКоманды)";
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

#Область ОКУД0420402

Процедура ОКУД0420402_КонтрольОбязательныхПолей(ПараметрыКоманды)

	ПараметрыКоманды.Вставить("Результат", Новый ТабличныйДокумент);
	
	Данные = ОКУД0420402_ПрочитатьФайлВТаблицу(ПараметрыКоманды.РеквизитыФайла, ПараметрыКоманды.Отказ);
	
	Макет = ПолучитьМакет("ОКУД0420402_КонтрольОбязательныхПолей");
	
	ОбластьШапкаОтчета	= Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьШапкаОтчета.Параметры.АдресТекущегоФайла		= ПараметрыКоманды.РеквизитыФайла.АдресФайла;
	
	ПараметрыКоманды.Результат.Вывести(ОбластьШапкаОтчета);
	
	ОКУД0420402_ВывестиДанные("Не указан индивидуальный код АЛ",			Новый Структура("ИндивидуальныйКод", ""), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не указано наименование АЛ", 				Новый Структура("Наименование", ""), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не указан код основания", 					Новый Структура("КодОснования", ""), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не указана дата наступления основания", 		Новый Структура("ДатаОснования", Дата(1,1,1)), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не удалось определить страну регистрации", 	Новый Структура("УказанаСтрана", Ложь), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не указано примечание", 						Новый Структура("Примечание", ""), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не указан ИНН юр.лица РФ", 					Новый Структура("ИНН, РезидентРФ, ТипЮрФизЛица", "", Истина, Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Указан некорректный ИНН", 					Новый Структура("НекорректныйИНН", Истина), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Указан некорректный паспорт гражданина РФ",  Новый Структура("НекорректныйПаспорт, КодДокумента", Истина, Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не указан Tin иностранного юр.лица", 		Новый Структура("ИНН, УказанаСтрана, РезидентРФ, ТипЮрФизЛица", "", Истина, Ложь, Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо), Данные, ПараметрыКоманды);
	ОКУД0420402_ВывестиДанные("Не указано Место нахождение юр.лица", 		Новый Структура("МестоНахождения, ТипЮрФизЛица", "",Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо), Данные, ПараметрыКоманды);
	
	ОКУД0420402_ВывестиДанные("Не указана принадлежащая АЛ доля, если это АЛ аффилировано как принадлежащая к группе по основаниям участия и образует группу под кодом ГЛ1", Новый Структура("ПринадлежащаяАЛДоля,ПринадлежитГруппеГЛ1", 0, Истина), Данные, ПараметрыКоманды);
	
	ОКУД0420402_ВывестиДанные(, Новый Структура("НекорректныеДанные", Ложь), Данные, ПараметрыКоманды);
	
КонецПроцедуры

Процедура ОКУД0420402_ВывестиДанные(ОписаниеОшибки = "", ПараметрыПоиска, Данные, ПараметрыКоманды)
	
	Если Данные.НайтиСтроки(ПараметрыПоиска).Количество() Тогда
		Макет = ПолучитьМакет("ОКУД0420402_КонтрольОбязательныхПолей");
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбластьОписаниеОшибки	= Макет.ПолучитьОбласть("ОписаниеОшибки");
			ОбластьОписаниеОшибки.Параметры.ОписаниеОшибки = ОписаниеОшибки;
			ПараметрыКоманды.Результат.Вывести(ОбластьОписаниеОшибки);
		Иначе
			ОбластьКорректныеДанные	= Макет.ПолучитьОбласть("КорректныеДанные");
			ПараметрыКоманды.Результат.Вывести(ОбластьКорректныеДанные);
		КонецЕсли;
		
		ОбластьРазделитель	= Макет.ПолучитьОбласть("Разделитель");
		
		МассивТиповЮрФизЛиц = Новый Массив;
		Если ПараметрыПоиска.Свойство("ТипЮрФизЛица") Тогда
			МассивТиповЮрФизЛиц.Добавить(ПараметрыПоиска.ТипЮрФизЛица);
		Иначе
			МассивТиповЮрФизЛиц.Добавить(Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);
			МассивТиповЮрФизЛиц.Добавить(Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо);
		КонецЕсли;
		
		Для Каждого ТипЮрФизЛица Из МассивТиповЮрФизЛиц Цикл
			ПараметрыПоиска.Вставить("ТипЮрФизЛица", ТипЮрФизЛица);
			НайденныеСтроки = Данные.НайтиСтроки(ПараметрыПоиска);
			
			Если НайденныеСтроки.Количество() Тогда
				Если ТипЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
					ОбластьШапка	= Макет.ПолучитьОбласть("ШапкаЮЛ");
					ОбластьСтрока	= Макет.ПолучитьОбласть("СтрокаЮЛ");
				Иначе
					ОбластьШапка	= Макет.ПолучитьОбласть("ШапкаФЛ");
					ОбластьСтрока	= Макет.ПолучитьОбласть("СтрокаФЛ");
				КонецЕсли;
			
				ПараметрыКоманды.Результат.Вывести(ОбластьШапка);
				Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
					ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаДанных);
					ПараметрыКоманды.Результат.Вывести(ОбластьСтрока);
					
					Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
						СтрокаДанных.НекорректныеДанные = Истина;
					КонецЕсли;
					
				КонецЦикла;
				
				ПараметрыКоманды.Результат.Вывести(ОбластьРазделитель);
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ОКУД0420402_ПрочитатьФайлВТаблицу(РеквизитыФайла, Отказ)
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("Строка"));
	ТипыДокументов.Добавить(Тип("СправочникСсылка.ВидыДокументовФизическихЛиц"));
	
	Данные = Новый ТаблицаЗначений;
	
	Данные.Колонки.Добавить("ИндивидуальныйКод", 	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("ТипЮрФизЛица", 		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЮрФизЛиц"));
	Данные.Колонки.Добавить("Наименование",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("ИНН",					Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(12, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("НекорректныйИНН",		Новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("МестоНахождения",		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("СтранаРегистрации",	Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	Данные.Колонки.Добавить("КодДокумента",			Новый ОписаниеТипов(ТипыДокументов,,,,	Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("СерияНомерДокумента",	Новый ОписаниеТипов("Строка",,,,		Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("НекорректныйПаспорт",	Новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("КодОснования",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("ДатаОснования",		Новый ОписаниеТипов("Дата"));
	
	Данные.Колонки.Добавить("ПринадлежащаяАЛДоля",	Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("ПринадлежащаяОрганизацииДоля",	Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("ПринадлежитГруппеГЛ1", Новый ОписаниеТипов("Булево"));
	
	Данные.Колонки.Добавить("Примечание",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("НекорректныеДанные", 	Новый ОписаниеТипов("Булево"));
	
	Данные.Колонки.Добавить("РезидентРФ",		Новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("УказанаСтрана",	Новый ОписаниеТипов("Булево"));
	
	БиблиотекаЗначений	= БиблиотекаСтандартныхЗначений();
	
	ДанныеXDTO = ПолучитьДанныеXDTO(РеквизитыФайла, Отказ);
	
	Если ДанныеXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьТаблицуИзИсточникаПоПравилам(Данные, ДанныеXDTO, "ОКУД0420402");
	
	ОКУД0420402_ОпределитьСтраныЮрЛиц(Данные);
	
	НайденныеСтроки1 = Данные.НайтиСтроки(Новый Структура("ПринадлежитГруппеГЛ1", Истина));
	Для Каждого СтрокаДанных1 Из НайденныеСтроки1 Цикл
		НайденныеСтроки2 = Данные.НайтиСтроки(Новый Структура("ИндивидуальныйКод, ПринадлежитГруппеГЛ1", СтрокаДанных1.ИндивидуальныйКод, Ложь));
		Для Каждого СтрокаДанных2 Из НайденныеСтроки2 Цикл
			СтрокаДанных2.ПринадлежитГруппеГЛ1 = Истина;
		КонецЦикла;
		Данные.Удалить(СтрокаДанных1);
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из Данные Цикл
		СтрокаДанных.РезидентРФ		= (СтрокаДанных.СтранаРегистрации = Справочники.СтраныМира.Россия);
		СтрокаДанных.УказанаСтрана	= ЗначениеЗаполнено(СтрокаДанных.СтранаРегистрации);
		
		Если СтрокаДанных.РезидентРФ Тогда 
			Если СтрокаДанных.ТипЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
				СтрокаДанных.НекорректныйИНН = ЗначениеЗаполнено(РаботаСКодамиКлиентСервер.ПроверитьИННЮрЛица(СтрокаДанных.ИНН));
			Иначе
				СтрокаДанных.НекорректныйИНН = ЗначениеЗаполнено(РаботаСКодамиКлиентСервер.ПроверитьИННФизЛица(СтрокаДанных.ИНН));
				
				Если СтрокаДанных.КодДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
					СерияНомерДокумента = СтрЗаменить(СтрЗаменить(СтрокаДанных.СерияНомерДокумента, " ", ""), Символы.НПП, "");
					СтрокаДанных.НекорректныйПаспорт = (НЕ РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(СерияНомерДокумента) ИЛИ СтрДлина(СерияНомерДокумента) <> 10);
				КонецЕсли;	
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивОшибок = Новый Массив;
	
	КонтрольПризнакаНулевогоОтчета(ДанныеXDTO, РеквизитыФайла, Данные.Количество(), МассивОшибок);
	
	Для Каждого ТекстОшибки Из МассивОшибок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,, РеквизитыФайла.ИмяРеквизита, Отказ);
	КонецЦикла;	
	
	Данные.Сортировать("ТипЮрФизЛица, Наименование, КодОснования");
	
	Возврат Данные;
	
КонецФункции

Процедура ОКУД0420402_ОпределитьСтраныЮрЛиц(Данные)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Данные", Данные);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
		|	Данные.МестоНахождения КАК МестоНахождения
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.НомерСтроки КАК НомерСтроки,
		|	СтраныМира.Ссылка КАК СтранаРегистрации
		|ПОМЕСТИТЬ _Страны
		|ИЗ
		|	_Данные КАК _Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|		ПО (СтраныМира.Наименование <> """"
		|					И _Данные.МестоНахождения ПОДОБНО ""%"" + СтраныМира.Наименование + ""%""
		|				ИЛИ СтраныМира.НаименованиеПолное <> """"
		|					И _Данные.МестоНахождения ПОДОБНО ""%"" + СтраныМира.НаименованиеПолное + ""%""
		|				ИЛИ СтраныМира.Код <> """"
		|					И _Данные.МестоНахождения = СтраныМира.Код
		|				ИЛИ СтраныМира.КодАльфа3 <> """"
		|					И _Данные.МестоНахождения = СтраныМира.КодАльфа3
		|				ИЛИ СтраныМира.КодАльфа3 <> """"
		|					И _Данные.МестоНахождения ПОДОБНО ""Strana_"" + СтраныМира.Код + ""%"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Страны.НомерСтроки - 1 КАК Индекс,
		|	МАКСИМУМ(_Страны.СтранаРегистрации) КАК СтранаРегистрации
		|ИЗ
		|	_Страны КАК _Страны
		|
		|СГРУППИРОВАТЬ ПО
		|	_Страны.НомерСтроки
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _Страны.СтранаРегистрации) = 1";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Данные[Выборка.Индекс].СтранаРегистрации = Выборка.СтранаРегистрации;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОКУД0420404

Процедура ОКУД0420404_КонтрольОбязательныхРеквизитов(ПараметрыКоманды)
	
	ПараметрыКоманды.Вставить("Результат", Новый ТабличныйДокумент);
	Данные = ОКУД0420404_ПрочитатьФайлВСтруктуру(ПараметрыКоманды.РеквизитыФайла, ПараметрыКоманды.Отказ);
	
	Макет = ПолучитьМакет(ПараметрыКоманды.ВариантОтчета);
	ОбластьПоказатели = Макет.ПолучитьОбласть("Показатели");
	
	Для НомерСтроки = 1 По ОбластьПоказатели.ВысотаТаблицы Цикл
		
		Ошибка = Ложь;
		
		ИмяПоказателя		= ОбластьПоказатели.Область(НомерСтроки, 2, НомерСтроки, 2).Параметр;
		ВариантСравнения	= ОбластьПоказатели.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
		
		Если ЗначениеЗаполнено(ИмяПоказателя) Тогда
			Показатель = Данные.Итог(ИмяПоказателя);
			
			Если ВариантСравнения = "> 0" Тогда
				Ошибка = НЕ (Показатель > 0);
			ИначеЕсли ВариантСравнения = ">= 0" Тогда
				Ошибка = НЕ (Показатель >= 0);
			КонецЕсли;
			
			Если Ошибка Тогда
				ОбластьПоказатели.Область(НомерСтроки, 1, НомерСтроки, ОбластьПоказатели.ШиринаТаблицы).ЦветТекста = Новый Цвет(255, 0, 0);
				ПараметрыКоманды.Вставить("Отказ", Истина);
			КонецЕсли;
			
			ОбластьПоказатели.Параметры[ИмяПоказателя] = Показатель;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если ПараметрыКоманды.Отказ Тогда
		ПараметрыКоманды.Результат.Вывести(Макет.ПолучитьОбласть("ОписаниеОшибки"));
	Иначе
		ПараметрыКоманды.Результат.Вывести(Макет.ПолучитьОбласть("КорректныеДанные"));
	КонецЕсли;
	
	ПараметрыКоманды.Результат.Вывести(ОбластьПоказатели);

КонецПроцедуры

Функция ОКУД0420404_ПрочитатьФайлВСтруктуру(РеквизитыФайла, Отказ)

	ТипКоличество = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 0, ДопустимыйЗнак.Неотрицательный));
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("КоличествоСотрудников",				ТипКоличество);
	Данные.Колонки.Добавить("КоличествоСотрудниковНерезидентов", 	ТипКоличество);
	Данные.Колонки.Добавить("КоличествоСотрудниковКонтроль224ФЗ",	ТипКоличество);
	Данные.Колонки.Добавить("КоличествоДЛРуководителей", 			ТипКоличество);
	Данные.Колонки.Добавить("КоличествоДЛКонтролеров",				ТипКоличество);
	Данные.Колонки.Добавить("КоличествоДЛПротиводействиеИнсайду",	ТипКоличество);
	Данные.Колонки.Добавить("КоличествоДЛВсего",					ТипКоличество);
	Данные.Колонки.Добавить("КоличествоФункцияДУ",					ТипКоличество);
	Данные.Колонки.Добавить("КоличествоФункцияВнутрУчет",			ТипКоличество);
	Данные.Колонки.Добавить("КоличествоФункцияВсего",				ТипКоличество);
	
	БиблиотекаЗначений	= БиблиотекаСтандартныхЗначений();
	
	ДанныеXDTO = ПолучитьДанныеXDTO(РеквизитыФайла, Отказ);
	
	Если ДанныеXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьТаблицуИзИсточникаПоПравилам(Данные, ДанныеXDTO, "ОКУД0420404");
	
	Возврат Данные;
	
КонецФункции



#КонецОбласти

#Область ОКУД0420409

Процедура ОКУД0420409_СравнитьОстаткиДвухПериодов(ПараметрыКоманды) 
	
	Если НЕ ПараметрыКоманды.Свойство("Результат") Тогда
		ПараметрыКоманды.Вставить("Результат", Новый ТабличныйДокумент);
	КонецЕсли;
	
	ДанныеТекущие		= ОКУД0420409_ПрочитатьФайлВТаблицу(ПараметрыКоманды.РеквизитыФайла, ПараметрыКоманды.Отказ);
	ДанныеПредыдущие	= ОКУД0420409_ПрочитатьФайлВТаблицу(ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода, ПараметрыКоманды.Отказ);
	
	Если ПараметрыКоманды.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ КонтрольПоследовательностиОтчетов(ДанныеТекущие, ДанныеПредыдущие) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДанныеТекущие.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + ПараметрыКоманды.РеквизитыФайла.АдресФайла + Символы.ПС + " пустой. Возможно это нулевой отчёт. Убедитесь что выбран верный файл.",,, ПараметрыКоманды.РеквизитыФайла.ИмяРеквизита, ПараметрыКоманды.Отказ);
	КонецЕсли;
	
	Если НЕ ДанныеПредыдущие.Количество()Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода.АдресФайла + Символы.ПС + " пустой. Возможно это нулевой отчёт. Убедитесь что выбран верный файл.",,, ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода.ИмяРеквизита, ПараметрыКоманды.Отказ);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеТекущие", ДанныеТекущие);
	Запрос.УстановитьПараметр("ДанныеПредыдущие", ДанныеПредыдущие);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеТекущие.ИдентификаторСчета КАК ИдентификаторСчета,
		|	ДанныеТекущие.НаименованиеБанка КАК НаименованиеБанка,
		|	ДанныеТекущие.ИННБанка КАК ИННБанка,
		|	ДанныеТекущие.НомерСчета КАК НомерСчета,
		|	ДанныеТекущие.Валюта КАК Валюта,
		|	ДанныеТекущие.ДатаОткрытия КАК ДатаОткрытия,
		|	ДанныеТекущие.ДатаЗакрытия КАК ДатаЗакрытия,
		|	ДанныеТекущие.ДатаНачала КАК ДатаНачала,
		|	ДанныеТекущие.ДатаОкончания КАК ДатаОкончания,
		|	ДанныеТекущие.НачальныйОстаток КАК НачальныйОстаток,
		|	ДанныеТекущие.Приход КАК Приход,
		|	ДанныеТекущие.Расход КАК Расход,
		|	ДанныеТекущие.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ _ДанныеТекущие
		|ИЗ
		|	&ДанныеТекущие КАК ДанныеТекущие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПредыдущие.ИдентификаторСчета КАК ИдентификаторСчета,
		|	ДанныеПредыдущие.НаименованиеБанка КАК НаименованиеБанка,
		|	ДанныеПредыдущие.ИННБанка КАК ИННБанка,
		|	ДанныеПредыдущие.НомерСчета КАК НомерСчета,
		|	ДанныеПредыдущие.Валюта КАК Валюта,
		|	ДанныеПредыдущие.ДатаОткрытия КАК ДатаОткрытия,
		|	ДанныеПредыдущие.ДатаЗакрытия КАК ДатаЗакрытия,
		|	ДанныеПредыдущие.ДатаНачала КАК ДатаНачала,
		|	ДанныеПредыдущие.ДатаОкончания КАК ДатаОкончания,
		|	ДанныеПредыдущие.НачальныйОстаток КАК НачальныйОстаток,
		|	ДанныеПредыдущие.Приход КАК Приход,
		|	ДанныеПредыдущие.Расход КАК Расход,
		|	ДанныеПредыдущие.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ _ДанныеПредыдущие
		|ИЗ
		|	&ДанныеПредыдущие КАК ДанныеПредыдущие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ДанныеТекущие.НаименованиеБанка, _ДанныеПредыдущие.НаименованиеБанка) КАК Банк,
		|	ЕСТЬNULL(_ДанныеТекущие.НомерСчета, _ДанныеПредыдущие.НомерСчета) КАК НомерСчета,
		|	ЕСТЬNULL(_ДанныеТекущие.ИдентификаторСчета, _ДанныеПредыдущие.ИдентификаторСчета) КАК ИдентификаторСчета,
		|	НЕ(_ДанныеТекущие.НачальныйОстаток ЕСТЬ NULL
		|			ИЛИ _ДанныеПредыдущие.КонечныйОстаток ЕСТЬ NULL) КАК Отсутствуют,
		|	_ДанныеТекущие.НаименованиеБанка КАК НаименованиеБанкаТекущие,
		|	_ДанныеТекущие.ИННБанка КАК ИННБанкаТекущие,
		|	_ДанныеТекущие.НомерСчета КАК НомерСчетаТекущие,
		|	ПОДСТРОКА(_ДанныеТекущие.Валюта, 9, 3) КАК ВалютаТекущие,
		|	_ДанныеТекущие.ДатаОткрытия КАК ДатаОткрытияТекущие,
		|	_ДанныеТекущие.ДатаЗакрытия КАК ДатаЗакрытияТекущие,
		|	_ДанныеТекущие.ДатаНачала КАК ДатаНачалаТекущие,
		|	ЕСТЬNULL(_ДанныеТекущие.НачальныйОстаток, ""Отсутствует"") КАК НачальныйОстатокТекущие,
		|	_ДанныеПредыдущие.НаименованиеБанка КАК НаименованиеБанкаПредыдущие,
		|	_ДанныеПредыдущие.ИННБанка КАК ИННБанкаПредыдущие,
		|	_ДанныеПредыдущие.НомерСчета КАК НомерСчетаПредыдущие,
		|	ПОДСТРОКА(_ДанныеПредыдущие.Валюта, 9, 3) КАК ВалютаПредыдущие,
		|	_ДанныеПредыдущие.ДатаОткрытия КАК ДатаОткрытияПредыдущие,
		|	_ДанныеПредыдущие.ДатаЗакрытия КАК ДатаЗакрытияПредыдущие,
		|	_ДанныеПредыдущие.ДатаОкончания КАК ДатаОкончанияПредыдущие,
		|	ЕСТЬNULL(_ДанныеПредыдущие.КонечныйОстаток, ""Отсутствует"") КАК КонечныйОстатокПредыдущие,
		|	ЕСТЬNULL(_ДанныеТекущие.ДатаНачала, _ДанныеПредыдущие.ДатаОкончания) КАК ПериодПредыдущие,
		|	ЕСТЬNULL(_ДанныеТекущие.ДатаОкончания, ДОБАВИТЬКДАТЕ(_ДанныеПредыдущие.ДатаОкончания, МЕСЯЦ, 1)) КАК ПериодТекущие,
		|	ЕСТЬNULL(_ДанныеТекущие.НачальныйОстаток, 0) <> ЕСТЬNULL(_ДанныеПредыдущие.КонечныйОстаток, 0)
		|		ИЛИ _ДанныеТекущие.НомерСчета ЕСТЬ NULL
		|			И (_ДанныеПредыдущие.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ _ДанныеПредыдущие.ДатаЗакрытия > _ДанныеПредыдущие.ДатаОкончания)
		|		ИЛИ _ДанныеПредыдущие.НомерСчета ЕСТЬ NULL
		|			И _ДанныеТекущие.ДатаОткрытия < _ДанныеТекущие.ДатаНачала
		|		ИЛИ _ДанныеТекущие.НаименованиеБанка ЕСТЬ НЕ NULL 
		|			И _ДанныеПредыдущие.НаименованиеБанка ЕСТЬ НЕ NULL 
		|			И _ДанныеТекущие.НаименованиеБанка <> _ДанныеПредыдущие.НаименованиеБанка
		|		ИЛИ _ДанныеТекущие.ИННБанка ЕСТЬ НЕ NULL 
		|			И _ДанныеПредыдущие.ИННБанка ЕСТЬ НЕ NULL 
		|			И _ДанныеТекущие.ИННБанка <> _ДанныеПредыдущие.ИННБанка
		|		ИЛИ _ДанныеТекущие.НомерСчета ЕСТЬ НЕ NULL 
		|			И _ДанныеПредыдущие.НомерСчета ЕСТЬ НЕ NULL 
		|			И _ДанныеТекущие.НомерСчета <> _ДанныеПредыдущие.НомерСчета
		|		ИЛИ _ДанныеТекущие.Валюта ЕСТЬ НЕ NULL 
		|			И _ДанныеПредыдущие.Валюта ЕСТЬ НЕ NULL 
		|			И _ДанныеТекущие.Валюта <> _ДанныеПредыдущие.Валюта
		|		ИЛИ _ДанныеТекущие.ДатаОткрытия ЕСТЬ НЕ NULL 
		|			И _ДанныеПредыдущие.ДатаОткрытия ЕСТЬ НЕ NULL 
		|			И _ДанныеТекущие.ДатаОткрытия <> _ДанныеПредыдущие.ДатаОткрытия КАК ЕстьРасхождения,
		|	ЕСТЬNULL(_ДанныеТекущие.НачальныйОстаток, 0) <> ЕСТЬNULL(_ДанныеПредыдущие.КонечныйОстаток, 0) КАК РасхожденияВОстатке,
		|	_ДанныеТекущие.НомерСчета ЕСТЬ NULL
		|		И (ЕСТЬNULL(_ДанныеПредыдущие.ДатаЗакрытия, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ЕСТЬNULL(_ДанныеПредыдущие.ДатаЗакрытия, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(_ДанныеПредыдущие.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))) КАК РасхожденияВДатеЗакрытия,
		|	_ДанныеПредыдущие.НомерСчета ЕСТЬ NULL
		|			И ЕСТЬNULL(_ДанныеТекущие.ДатаОткрытия, ДАТАВРЕМЯ(1, 1, 1)) < ЕСТЬNULL(_ДанныеТекущие.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))
		|		ИЛИ ЕСТЬNULL(_ДанныеТекущие.ДатаОткрытия, ДАТАВРЕМЯ(1, 1, 1)) <> ЕСТЬNULL(_ДанныеПредыдущие.ДатаЗакрытия, ДАТАВРЕМЯ(1, 1, 1)) КАК РасхожденияВДатеОткрытия
		|ИЗ
		|	_ДанныеТекущие КАК _ДанныеТекущие
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДанныеПредыдущие КАК _ДанныеПредыдущие
		|		ПО _ДанныеТекущие.ИдентификаторСчета = _ДанныеПредыдущие.ИдентификаторСчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕстьРасхождения УБЫВ,
		|	Отсутствуют,
		|	Банк,
		|	НомерСчета
		|ИТОГИ ПО
		|	ЕстьРасхождения";
	
#КонецОбласти

	Макет = ПолучитьМакет("ОКУД0420409_СравнитьОстаткиДвухПериодов");
	
	ОбластьШапкаОтчета	= Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьСверено		= Макет.ПолучитьОбласть("Сверено");
	ОбластьРасхождения	= Макет.ПолучитьОбласть("Расхождения");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаСверки = Макет.ПолучитьОбласть("СтрокаСверки");
	ОбластьРазделитель	= Макет.ПолучитьОбласть("Разделитель");
	
	ПараметрыКоманды.Результат.Очистить();
	
	ОбластьШапкаОтчета.Параметры.АдресТекущегоФайла		= ПараметрыКоманды.РеквизитыФайла.АдресФайла;
	ОбластьШапкаОтчета.Параметры.АдресПредыдущегоФайла	= ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода.АдресФайла;
	
	ПараметрыКоманды.Результат.Вывести(ОбластьШапкаОтчета);
	
	ВыборкаРаздел = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРаздел.Следующий() Цикл
		
		Если ВыборкаРаздел.ЕстьРасхождения Тогда
			ПараметрыКоманды.Результат.Вывести(ОбластьРасхождения);
		Иначе
			ПараметрыКоманды.Результат.Вывести(ОбластьСверено);
		КонецЕсли;
		
		ПараметрыКоманды.Результат.НачатьГруппуСтрок(,ВыборкаРаздел.ЕстьРасхождения);
		ПараметрыКоманды.Результат.Вывести(ОбластьШапкаТаблицы);
		
		Выборка = ВыборкаРаздел.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаСверки.Параметры, Выборка);
			ПараметрыКоманды.Результат.Вывести(ОбластьСтрокаСверки);
			
#Область РаскраскаРасхождений
			Если ВыборкаРаздел.ЕстьРасхождения Тогда
				Если Выборка.РасхожденияВОстатке Тогда
					ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, 9, ПараметрыКоманды.Результат.ВысотаТаблицы, 9).ЦветТекста = Новый Цвет(255, 0, 0);
				КонецЕсли;
				
				Если Выборка.РасхожденияВДатеЗакрытия Тогда
					ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, 8, ПараметрыКоманды.Результат.ВысотаТаблицы, 8).ЦветТекста = Новый Цвет(255, 0, 0);
				КонецЕсли;
				
				Если Выборка.РасхожденияВДатеОткрытия Тогда
					ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, 7, ПараметрыКоманды.Результат.ВысотаТаблицы, 7).ЦветТекста = Новый Цвет(255, 0, 0);
				КонецЕсли;
				
				Если НЕ Выборка.РасхожденияВДатеЗакрытия 
					И НЕ Выборка.РасхожденияВДатеОткрытия Тогда
					Для НомерКолонки = 3 По 6 Цикл
						Если ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, НомерКолонки, ПараметрыКоманды.Результат.ВысотаТаблицы - 1, НомерКолонки).Текст <> ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы, НомерКолонки, ПараметрыКоманды.Результат.ВысотаТаблицы, НомерКолонки).Текст Тогда
							ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, НомерКолонки, ПараметрыКоманды.Результат.ВысотаТаблицы, НомерКолонки).ЦветТекста = Новый Цвет(255, 0, 0);
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;
			Иначе 
				ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы, 2, ПараметрыКоманды.Результат.ВысотаТаблицы, 9).ЦветТекста = Новый Цвет(110, 110, 110);
			КонецЕсли;
#КонецОбласти				
			
			ПараметрыКоманды.Результат.Вывести(ОбластьРазделитель);
			
		КонецЦикла;
		
		
		ПараметрыКоманды.Результат.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОКУД0420409_ПрочитатьФайлВТаблицу(РеквизитыФайла, Отказ)
	
	Данные = Новый ТаблицаЗначений;
	
	Данные.Колонки.Добавить("ИдентификаторСчета", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("НаименованиеБанка"	, Метаданные.РегистрыСведений.РеквизитыЮридическихЛиц.Ресурсы.КраткоеНаименованиеПоУставу.Тип);
	Данные.Колонки.Добавить("ИННБанка"			, Метаданные.РегистрыСведений.РеквизитыЮридическихЛиц.Ресурсы.ИНН.Тип);
	Данные.Колонки.Добавить("НомерСчета"		, Метаданные.Справочники.БанковскиеСчета.Реквизиты.НомерСчета.Тип);
	Данные.Колонки.Добавить("Валюта"			, Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("ДатаОткрытия"		, Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаЗакрытия"		, Новый ОписаниеТипов("Дата"));
	
	Данные.Колонки.Добавить("ДатаНачала"		, Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаОкончания"		, Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("НачальныйОстаток"	, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Приход"			, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Расход"			, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("КонечныйОстаток"	, Новый ОписаниеТипов("Число"));
	
	ДанныеXDTO = ПолучитьДанныеXDTO(РеквизитыФайла, Отказ);
	
	Если ДанныеXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьТаблицуИзИсточникаПоПравилам(Данные, ДанныеXDTO, "ОКУД0420409");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Данные, "_Данные", Запрос);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_Данные.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(_Данные.ДатаОкончания) КАК ДатаОкончания
		|ПОМЕСТИТЬ _Экстремумы
		|ИЗ
		|	_Данные КАК _Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_Данные_0.ДатаНачала, _Экстремумы.ДатаНачала) КАК ДатаНачала,
		|	_Данные.ДатаОкончания КАК ДатаОкончания,
		|	_Данные.ИдентификаторСчета КАК ИдентификаторСчета,
		|	_Данные.НаименованиеБанка КАК НаименованиеБанка,
		|	_Данные.ИННБанка КАК ИННБанка,
		|	_Данные.НомерСчета КАК НомерСчета,
		|	_Данные.Валюта КАК Валюта,
		|	_Данные.ДатаОткрытия КАК ДатаОткрытия,
		|	_Данные.ДатаЗакрытия КАК ДатаЗакрытия,
		|	ЕСТЬNULL(_Данные_0.НачальныйОстаток, 0) КАК НачальныйОстаток,
		|	_Данные.Приход КАК Приход,
		|	_Данные.Расход КАК Расход,
		|	_Данные.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ _НовыеДанные
		|ИЗ
		|	_Данные КАК _Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Данные КАК _Данные_0
		|		ПО _Данные.ИдентификаторСчета = _Данные_0.ИдентификаторСчета
		|			И (_Данные_0.НомерСчета = """")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Экстремумы КАК _Экстремумы
		|		ПО (ИСТИНА)
		|ГДЕ
		|	_Данные.НомерСчета <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.ИдентификаторСчета КАК ИдентификаторСчета,
		|	_Данные.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ _ДублированиеСтрок
		|ИЗ
		|	_Данные КАК _Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	_Данные.ИдентификаторСчета,
		|	_Данные.НомерСчета
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НовыеДанные.ДатаНачала КАК ДатаНачала,
		|	_НовыеДанные.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ _РазныеПериодыВОтчете
		|ИЗ
		|	_НовыеДанные КАК _НовыеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	_НовыеДанные.ДатаНачала,
		|	_НовыеДанные.ДатаОкончания";
#КонецОбласти	
	
	Запрос.Выполнить();
	
	Данные					= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_НовыеДанные").ПолучитьДанные().Выгрузить();
	ДублированиеСтрок		= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДублированиеСтрок").ПолучитьДанные().Выгрузить();
	РазныеПериодыВОтчете	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РазныеПериодыВОтчете").ПолучитьДанные().Выгрузить();
	
	Если ДублированиеСтрок.Количество() > 0 Тогда
		Для Каждого СтрокаДанных Из ДублированиеСтрок Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Дублированние строк в файле " + РеквизитыФайла.АдресФайла + Символы.ПС + ", ИдентификаторСчета: %1, обратитесь в службу поддержки.", СтрокаДанных.ИдентификаторСчета),,, РеквизитыФайла.ИмяРеквизита, Отказ);
		КонецЦикла;
	КонецЕсли;
	
	Если РазныеПериодыВОтчете.Количество() > 1 Тогда
		ЭлементыСообщения = Новый Массив;
		ЭлементыСообщения.Добавить("В файле " + РеквизитыФайла.АдресФайла);
		ЭлементыСообщения.Добавить("обнаружены разные комбинации дат остатков:");
		
		Для Каждого СтрокаДанных Из РазныеПериодыВОтчете Цикл
			ЭлементыСообщения.Добавить(СтрШаблон("Дата начала: %1, Дата окончания: %2", Формат(СтрокаДанных.ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(СтрокаДанных.ДатаОкончания, "ДФ=dd.MM.yyyy")));
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(ЭлементыСообщения, Символы.ПС),,, РеквизитыФайла.ИмяРеквизита, Отказ);
	КонецЕсли;
	
	МассивОшибок = Новый Массив;
	
	КонтрольПризнакаНулевогоОтчета(ДанныеXDTO, РеквизитыФайла, Данные.Количество(), МассивОшибок);
	
	Для Каждого ТекстОшибки Из МассивОшибок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,, РеквизитыФайла.ИмяРеквизита, Отказ);
	КонецЦикла;	
	
	Возврат Данные;
	
КонецФункции

Процедура ОКУД0420409_СравнитьУчетИОтчетБухгалтерии(ПараметрыКоманды)
	
	Если НЕ ПараметрыКоманды.Свойство("Результат") Тогда
		ПараметрыКоманды.Вставить("Результат", Новый ТабличныйДокумент);
	КонецЕсли;
	
	Бухгалтерия = "";
	ПолучитьДанныеБухгалтерии = НЕ ПараметрыКоманды.Свойство("Бухгалтерия", Бухгалтерия);
	
	Если ПолучитьДанныеБухгалтерии Тогда
		Бухгалтерия = РаботаСВнешнимиСистемами.ПолучитьCOMСоединениеСБухгалтерией(ПараметрыКоманды.Организация);
		
		ОтчетностьЦБ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетностьЦБ");
		ОтчетностьЦБ.Организация		= ПараметрыКоманды.Организация;
		ОтчетностьЦБ.Период				= ПараметрыКоманды.Период;

		ПараметрыКоманды.Вставить("МенеджерВременныхТаблиц", ОтчетностьЦБ.ОКУД0420409_ПолучитьДанныеБухгалтерии(Бухгалтерия));
	КонецЕсли;
	
	РасхожденияСОтчетом = ПараметрыКоманды.МенеджерВременныхТаблиц.Таблицы.Найти("_РасхожденияСОтчетом").ПолучитьДанные().Выгрузить();
	
	Макет = ПолучитьМакет(ПараметрыКоманды.ВариантОтчета);
	
	ОбластьШапкаОтчета	= Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьСверено		= Макет.ПолучитьОбласть("Сверено");
	ОбластьРасхождения	= Макет.ПолучитьОбласть("Расхождения");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьРазделитель	= Макет.ПолучитьОбласть("Разделитель");

	ПараметрыКоманды.Результат.Вывести(ОбластьШапкаОтчета);
	
	НайденныеСтроки = РасхожденияСОтчетом.НайтиСтроки(Бухгалтерия.NewObject("Структура", "ЕстьРасхождения", Истина));
	
	Если НайденныеСтроки.Количество() Тогда
		ПараметрыКоманды.Вставить("Отказ", Истина);
		
		ПараметрыКоманды.Результат.Вывести(ОбластьРасхождения);
		ПараметрыКоманды.Результат.НачатьГруппуСтрок(, Истина);
		ПараметрыКоманды.Результат.Вывести(ОбластьШапкаТаблицы);
		
		Для Каждого СтрокаРасхождения Из НайденныеСтроки Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаРасхождения);
			ПараметрыКоманды.Результат.Вывести(ОбластьСтрока);
			
			Для НомерКолонки = 3 По ПараметрыКоманды.Результат.ШиринаТаблицы Цикл
				Если ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, НомерКолонки, ПараметрыКоманды.Результат.ВысотаТаблицы - 1, НомерКолонки).Текст 
				   <> ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы, НомерКолонки, ПараметрыКоманды.Результат.ВысотаТаблицы, НомерКолонки).Текст Тогда
					ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, НомерКолонки, ПараметрыКоманды.Результат.ВысотаТаблицы, НомерКолонки).ЦветТекста = Новый Цвет(255, 0, 0);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ПараметрыКоманды.Результат.ЗакончитьГруппуСтрок();
		
	КонецЕсли;

	НайденныеСтроки = РасхожденияСОтчетом.НайтиСтроки(Бухгалтерия.NewObject("Структура", "ЕстьРасхождения", Ложь));
	
	Если НайденныеСтроки.Количество() Тогда
		
		ПараметрыКоманды.Результат.Вывести(ОбластьСверено);
		ПараметрыКоманды.Результат.НачатьГруппуСтрок(, Ложь);
		ПараметрыКоманды.Результат.Вывести(ОбластьШапкаТаблицы);
		
		Для Каждого СтрокаРасхождения Из НайденныеСтроки Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаРасхождения);
			ПараметрыКоманды.Результат.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ПараметрыКоманды.Результат.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	ПараметрыКоманды.Результат.Вывести(ОбластьРазделитель);
	
	Если ПолучитьДанныеБухгалтерии Тогда 
		Бухгалтерия = "";
		ПараметрыКоманды.Удалить("МенеджерВременныхТаблиц");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОКУД0420415

Процедура ОКУД0420415_СравнениеБалансовойСтоимостиБумагСОтчетомОКУД0420514(ПараметрыКоманды)

	ВерсияТаксономии = "";
	
	Если НЕ ПараметрыКоманды.Свойство("Результат") Тогда
		ПараметрыКоманды.Вставить("Результат", Новый ТабличныйДокумент);
	КонецЕсли;
	
	Макет = ПолучитьМакет(ПараметрыКоманды.ВариантОтчета);
	
	ОбластьШапкаОтчета	= Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьСверено		= Макет.ПолучитьОбласть("Сверено");
	ОбластьРасхождения	= Макет.ПолучитьОбласть("Расхождения");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока		= Макет.ПолучитьОбласть("СтрокаСверки");
	ОбластьРазделитель	= Макет.ПолучитьОбласть("Разделитель");
	ОбластьОшибки		= Макет.ПолучитьОбласть("Ошибки");
	ОбластьПустойОтчет	= Макет.ПолучитьОбласть("ПустойОтчет");
	
	ОбластьШапкаИдентификации	= Макет.ПолучитьОбласть("ШапкаИдентификации");
	ОбластьСтрокаИдентификации	= Макет.ПолучитьОбласть("СтрокаИдентификации");

	ПараметрыКоманды.Результат.Очистить();
	
	ОбластьШапкаОтчета.Параметры.АдресТекущегоФайла		= ПараметрыКоманды.РеквизитыФайла.АдресФайла;
	ОбластьШапкаОтчета.Параметры.АдресПредыдущегоФайла	= ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода.АдресФайла;
	
	ПараметрыКоманды.Результат.Вывести(ОбластьШапкаОтчета);
	
	Данные415 = ОКУД0420415_ПрочитатьФайлВТаблицу(ПараметрыКоманды.РеквизитыФайла, "ОКУД0420415", ВерсияТаксономии,  ПараметрыКоманды.Отказ);
	Данные514 = ОКУД0420415_ПрочитатьФайлВТаблицу(ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода, "ОКУД0420514", ВерсияТаксономии, ПараметрыКоманды.Отказ);
	
	Если НЕ Данные415.Количество() И НЕ Данные514.Количество() Тогда
		ПараметрыКоманды.Результат.Вывести(ОбластьПустойОтчет);
		Возврат;
		
	ИначеЕсли Данные415.Количество() = 0 Тогда
		СтрокаПериода = Данные514[0];
		
	ИначеЕсли Данные514.Количество() = 0 Тогда
		СтрокаПериода = Данные415[0];
		
	ИначеЕсли Данные415[0].ДатаОкончания <> Данные514[0].ДатаОкончания Тогда
		ОбластьОшибки.Параметры.ТекстОшибки = "В отчётах разные периоды";
		ПараметрыКоманды.Результат.Вывести(ОбластьОшибки);
		Возврат;
		
	Иначе
		СтрокаПериода = Данные415[0];
		
	КонецЕсли;
	
	ЭтотОбъект.Период = Новый СтандартныйПериод(СтрокаПериода.ДатаНачала, СтрокаПериода.ДатаОкончания);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Данные415, "_Данные415", Запрос.МенеджерВременныхТаблиц);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Данные514, "_Данные514", Запрос.МенеджерВременныхТаблиц);
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ОКУД0420415_ПолучитьТаблицуЦенныхБумаг(ВерсияТаксономии, ПараметрыКоманды.Отказ), "_ТаблицаЦенныхБумаг", Запрос.МенеджерВременныхТаблиц);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные415.ИдентификаторЦБ КАК ИдентификаторЦБ,
		|	_ТаблицаЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Данные415.Количество КАК Количество,
		|	_Данные415.Стоимость КАК Стоимость
		|ПОМЕСТИТЬ _Данные415_ЦенныеБумаги
		|ИЗ
		|	_Данные415 КАК _Данные415
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаЦенныхБумаг КАК _ТаблицаЦенныхБумаг
		|		ПО (_Данные415.ИдентификаторЦБ ПОДОБНО _ТаблицаЦенныхБумаг.ЗначениеОси415ДляСверки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные514.ИдентификаторЦБ КАК ИдентификаторЦБ,
		|	_ТаблицаЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Данные514.Количество КАК Количество,
		|	_Данные514.Стоимость КАК Стоимость
		|ПОМЕСТИТЬ _Данные514_ЦенныеБумаги
		|ИЗ
		|	_Данные514 КАК _Данные514
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаЦенныхБумаг КАК _ТаблицаЦенныхБумаг
		|		ПО (_Данные514.ИдентификаторЦБ ПОДОБНО _ТаблицаЦенныхБумаг.ЗначениеОси514ДляСверки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ОКУД0420415"" КАК Отчет,
		|	_Данные415_ЦенныеБумаги.ИдентификаторЦБ КАК Идентификатор,
		|	_Данные415_ЦенныеБумаги.Количество КАК Количество,
		|	_Данные415_ЦенныеБумаги.Стоимость КАК Стоимость
		|ПОМЕСТИТЬ _НеидентифицированныеБумаги
		|ИЗ
		|	_Данные415_ЦенныеБумаги КАК _Данные415_ЦенныеБумаги
		|ГДЕ
		|	_Данные415_ЦенныеБумаги.ЦеннаяБумага ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	_Данные514_ЦенныеБумаги.ИдентификаторЦБ,
		|	_Данные514_ЦенныеБумаги.Количество,
		|	_Данные514_ЦенныеБумаги.Стоимость
		|ИЗ
		|	_Данные514_ЦенныеБумаги КАК _Данные514_ЦенныеБумаги
		|ГДЕ
		|	_Данные514_ЦенныеБумаги.ЦеннаяБумага ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_Данные415_ЦенныеБумаги.ЦеннаяБумага, _Данные514_ЦенныеБумаги.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	_Данные415_ЦенныеБумаги.Количество КАК Количество_415,
		|	_Данные415_ЦенныеБумаги.Стоимость КАК Стоимость_415,
		|	_Данные514_ЦенныеБумаги.Количество КАК Количество_514,
		|	_Данные514_ЦенныеБумаги.Стоимость КАК Стоимость_514,
		|	ЕСТЬNULL(_Данные415_ЦенныеБумаги.Количество, 0) <> ЕСТЬNULL(_Данные514_ЦенныеБумаги.Количество, 0) КАК Количество_Расхождение,
		|	ЕСТЬNULL(_Данные415_ЦенныеБумаги.Стоимость, 0) <> ЕСТЬNULL(_Данные514_ЦенныеБумаги.Стоимость, 0) КАК Стоимость_Расхождение,
		|	ЕСТЬNULL(_Данные415_ЦенныеБумаги.Количество, 0) <> ЕСТЬNULL(_Данные514_ЦенныеБумаги.Количество, 0)
		|		ИЛИ ЕСТЬNULL(_Данные415_ЦенныеБумаги.Стоимость, 0) <> ЕСТЬNULL(_Данные514_ЦенныеБумаги.Стоимость, 0) КАК Есть_Расхождение
		|ПОМЕСТИТЬ _Отчет
		|ИЗ
		|	_Данные415_ЦенныеБумаги КАК _Данные415_ЦенныеБумаги
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Данные514_ЦенныеБумаги КАК _Данные514_ЦенныеБумаги
		|		ПО _Данные415_ЦенныеБумаги.ЦеннаяБумага = _Данные514_ЦенныеБумаги.ЦеннаяБумага
		|ГДЕ
		|	ЕСТЬNULL(_Данные415_ЦенныеБумаги.ЦеннаяБумага, _Данные514_ЦенныеБумаги.ЦеннаяБумага) ЕСТЬ НЕ NULL ";
	
#КонецОбласти	

	Запрос.Выполнить();
	
	Таблица_НеидентифицированныеБумаги = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_НеидентифицированныеБумаги").ПолучитьДанные().Выгрузить();
	Если Таблица_НеидентифицированныеБумаги.Количество() > 0 Тогда
		ПараметрыКоманды.Результат.Вывести(ОбластьРазделитель);
		ПараметрыКоманды.Результат.Вывести(ОбластьШапкаИдентификации);
		Для Каждого Строка_НеидентифицированныеБумаги Из Таблица_НеидентифицированныеБумаги Цикл
			ОбластьСтрокаИдентификации.Параметры.Заполнить(Строка_НеидентифицированныеБумаги);
			ПараметрыКоманды.Результат.Вывести(ОбластьСтрокаИдентификации);
		КонецЦикла;
	КонецЕсли;
	
	Таблица_Отчет = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Отчет").ПолучитьДанные().Выгрузить();
	
	НайденныеСтроки = Таблица_Отчет.НайтиСтроки(Новый Структура("Есть_Расхождение", Истина));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ПараметрыКоманды.Результат.Вывести(ОбластьРазделитель);
		ПараметрыКоманды.Результат.Вывести(ОбластьРасхождения);
		ПараметрыКоманды.Результат.Вывести(ОбластьШапкаТаблицы);
		
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаДанных);
			ПараметрыКоманды.Результат.Вывести(ОбластьСтрока);
			
#Область РаскраскаРасхождений
			Если СтрокаДанных.Есть_Расхождение Тогда
				Если СтрокаДанных.Количество_Расхождение Тогда
					ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, 4, ПараметрыКоманды.Результат.ВысотаТаблицы, 4).ЦветТекста = Новый Цвет(255, 0, 0);
				КонецЕсли;
				
				Если СтрокаДанных.Стоимость_Расхождение Тогда
					ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы - 1, 5, ПараметрыКоманды.Результат.ВысотаТаблицы, 5).ЦветТекста = Новый Цвет(255, 0, 0);
				КонецЕсли;
			Иначе 
				ПараметрыКоманды.Результат.Область(ПараметрыКоманды.Результат.ВысотаТаблицы, 2, ПараметрыКоманды.Результат.ВысотаТаблицы, 5).ЦветТекста = Новый Цвет(110, 110, 110);
			КонецЕсли;
#КонецОбласти				
			
		КонецЦикла;
	КонецЕсли;	
	
	НайденныеСтроки = Таблица_Отчет.НайтиСтроки(Новый Структура("Есть_Расхождение", Ложь));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ПараметрыКоманды.Результат.Вывести(ОбластьРазделитель);
		ПараметрыКоманды.Результат.Вывести(ОбластьСверено);
		ПараметрыКоманды.Результат.Вывести(ОбластьШапкаТаблицы);
		
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаДанных);
			ПараметрыКоманды.Результат.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;	
	
	
КонецПроцедуры

Функция ОКУД0420415_ПрочитатьФайлВТаблицу(РеквизитыФайла, ИмяПравила, ВерсияТаксономии, Отказ)

	Данные = Новый ТаблицаЗначений;
	
	Данные.Колонки.Добавить("ДатаНачала",		Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаОкончания",	Новый ОписаниеТипов("Дата"));
	
	Данные.Колонки.Добавить("ИдентификаторЦБ",	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("ЦеннаяБумага",		Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	Данные.Колонки.Добавить("Количество",		Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Стоимость",		Новый ОписаниеТипов("Число"));
	
	ДанныеXDTO = ПолучитьДанныеXDTO(РеквизитыФайла, Отказ);
	
	Если ДанныеXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьТаблицуИзИсточникаПоПравилам(Данные, ДанныеXDTO, ИмяПравила, ВерсияТаксономии);
	
	Данные.Свернуть("ДатаНачала,ДатаОкончания,ИдентификаторЦБ,ЦеннаяБумага", "Количество,Стоимость");
	
	Возврат Данные;
	
КонецФункции

Функция ОКУД0420415_ПолучитьТаблицуЦенныхБумаг(ВерсияТаксономии, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Паи.Ссылка КАК ЦеннаяБумага,
		|	Паи.Ссылка КАК ЗначениеОси415ДляСверки,
		|	Паи.Ссылка КАК ЗначениеОси514ДляСверки
		|ИЗ
		|	Справочник.Паи КАК Паи
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Облигации.Ссылка,
		|	Облигации.Ссылка,
		|	Облигации.Ссылка
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Акции.Ссылка,
		|	Акции.Ссылка,
		|	Акции.Ссылка
		|ИЗ
		|	Справочник.Акции КАК Акции";
	
	ОтчетностьЦБ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетностьЦБ");
	//ОтчетностьЦБ = ВнешниеОтчеты.Создать("\\ap69\Developers\Рома\Epf\_ОтчетностьЦБ.erf");
	
	ОтчетностьЦБ.Организация		= ЭтотОбъект.Организация;
	ОтчетностьЦБ.Период				= ЭтотОбъект.Период;
	ОтчетностьЦБ.ВерсияТаксономии	= ВерсияТаксономии;
	
	ТаблицаЦенныхБумаг = Запрос.Выполнить().Выгрузить();
	
	МассивКолонокОткрытыхОсей = Новый Массив;
	МассивКолонокОткрытыхОсей.Добавить(ТаблицаЦенныхБумаг.Колонки.Найти("ЗначениеОси415ДляСверки"));
	МассивКолонокОткрытыхОсей.Добавить(ТаблицаЦенныхБумаг.Колонки.Найти("ЗначениеОси514ДляСверки"));
	
	Для Каждого Колонка Из МассивКолонокОткрытыхОсей Цикл
		ИмяКолонки 			= Колонка.Имя;
		ИндексКолонки		= ТаблицаЦенныхБумаг.Колонки.Индекс(Колонка);
		МассивЗначенийОсей	= ОтчетностьЦБ.ПолучитьМассивЗначенийОсей(ТаблицаЦенныхБумаг, ИмяКолонки, Ложь, Отказ);
		
		ТаблицаЦенныхБумаг.Колонки.Удалить(ИмяКолонки);
		ТаблицаЦенныхБумаг.Колонки.Вставить(ИндексКолонки, ИмяКолонки, Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТаблицаЦенныхБумаг.ЗагрузитьКолонку(МассивЗначенийОсей, ИмяКолонки);
	КонецЦикла;
	
	Возврат ТаблицаЦенныхБумаг;
	
КонецФункции

#КонецОбласти

#Область ОКУД0420453

Процедура ОКУД0420453_СверитьСОтчетомПрошлогоПериода(ПараметрыКоманды)
	
	ПараметрыКоманды.Вставить("Результат", Новый ТабличныйДокумент);
	
	МассивОшибок = Новый Массив;
	
	ДанныеТекущие		= ОКУД0420453_ПрочитатьФайлВТаблицу(ПараметрыКоманды.РеквизитыФайла,					МассивОшибок, ПараметрыКоманды.Отказ);
	ДанныеПредыдущие	= ОКУД0420453_ПрочитатьФайлВТаблицу(ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода,	МассивОшибок, ПараметрыКоманды.Отказ);
	
	Для Каждого СтрокаДанных Из ДанныеТекущие Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.КодЖалобы) Тогда
			МассивОшибок.Добавить("В текущем отчёте не указан Код жалобы в строке " + СтрокаДанных.ИдентификаторСтроки);
		КонецЕсли;	
		Если (СтрокаДанных.КоличествоВыплат = 0) <> (СтрокаДанных.СуммаВыплат = 0) Тогда
			МассивОшибок.Добавить(
				СтрШаблон("В отчёте по коду жалобы %1 в строке %2 'Количество жалоб, по которым выплачены компенсационные выплаты' = %3, а 'Суммы выплаченных' = %4",
					СтрокаДанных.КодЖалобы,
					СтрокаДанных.ИдентификаторСтроки,
					СтрокаДанных.КоличествоВыплат,
					СтрокаДанных.СуммаВыплат));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ДанныеПредыдущие Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.КодЖалобы) Тогда
			МассивОшибок.Добавить("В предыдущем отчёте не указан Код жалобы в строке " + СтрокаДанных.ИдентификаторСтроки);
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ КонтрольПоследовательностиОтчетов(ДанныеТекущие, ДанныеПредыдущие) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДанныеТекущие"	, ДанныеТекущие);
	Запрос.УстановитьПараметр("ДанныеПредыдущие", ДанныеПредыдущие);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеТекущие.КодЖалобы КАК КодЖалобы,
		|	ДанныеТекущие.ВидЮрФизЛица КАК ВидЮрФизЛица,
		|	ДанныеТекущие.КоличествоВыявленыхНарушений КАК КоличествоВыявленыхНарушений,
		|	ДанныеТекущие.КоличествоВыплат КАК КоличествоВыплат,
		|	ДанныеТекущие.СуммаВыплат КАК СуммаВыплат,
		|	ДанныеТекущие.КоличествоНеРассмотренных КАК КоличествоНеРассмотренных,
		|	ДанныеТекущие.КоличествоПоступивших КАК КоличествоПоступивших,
		|	ДанныеТекущие.КоличествоРассмотренных КАК КоличествоРассмотренных
		|ПОМЕСТИТЬ _ДанныеТекущие
		|ИЗ
		|	&ДанныеТекущие КАК ДанныеТекущие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПредыдущие.КодЖалобы КАК КодЖалобы,
		|	ДанныеПредыдущие.ВидЮрФизЛица КАК ВидЮрФизЛица,
		|	ДанныеПредыдущие.КоличествоВыявленыхНарушений КАК КоличествоВыявленыхНарушений,
		|	ДанныеПредыдущие.КоличествоВыплат КАК КоличествоВыплат,
		|	ДанныеПредыдущие.СуммаВыплат КАК СуммаВыплат,
		|	ДанныеПредыдущие.КоличествоНеРассмотренных КАК КоличествоНеРассмотренных,
		|	ДанныеПредыдущие.КоличествоПоступивших КАК КоличествоПоступивших,
		|	ДанныеПредыдущие.КоличествоРассмотренных КАК КоличествоРассмотренных
		|ПОМЕСТИТЬ _ДанныеПредыдущие
		|ИЗ
		|	&ДанныеПредыдущие КАК ДанныеПредыдущие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыЖалоб.КодЖалобы КАК КодЖалобы,
		|	_КодыЖалоб.ВидЮрФизЛица КАК ВидЮрФизЛица,
		|	ЕСТЬNULL(_ДанныеТекущие.КоличествоНеРассмотренных, 0) КАК КоличествоНеРассмотренных,
		|	ЕСТЬNULL(_ДанныеПредыдущие.КоличествоНеРассмотренных, 0) КАК КоличествоНеРассмотренныхВПредыдущемПериоде,
		|	ЕСТЬNULL(_ДанныеТекущие.КоличествоПоступивших, 0) КАК КоличествоПоступивших,
		|	ЕСТЬNULL(_ДанныеТекущие.КоличествоРассмотренных, 0) КАК КоличествоРассмотренных
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ВложенныйЗапрос.КодЖалобы КАК КодЖалобы,
		|		ВложенныйЗапрос.ВидЮрФизЛица КАК ВидЮрФизЛица
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_ДанныеТекущие.КодЖалобы КАК КодЖалобы,
		|			_ДанныеТекущие.ВидЮрФизЛица КАК ВидЮрФизЛица
		|		ИЗ
		|			_ДанныеТекущие КАК _ДанныеТекущие
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ДанныеПредыдущие.КодЖалобы,
		|			_ДанныеПредыдущие.ВидЮрФизЛица
		|		ИЗ
		|			_ДанныеПредыдущие КАК _ДанныеПредыдущие) КАК ВложенныйЗапрос) КАК _КодыЖалоб
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеТекущие КАК _ДанныеТекущие
		|		ПО _КодыЖалоб.КодЖалобы = _ДанныеТекущие.КодЖалобы
		|			И _КодыЖалоб.ВидЮрФизЛица = _ДанныеТекущие.ВидЮрФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеПредыдущие КАК _ДанныеПредыдущие
		|		ПО _КодыЖалоб.КодЖалобы = _ДанныеПредыдущие.КодЖалобы
		|			И _КодыЖалоб.ВидЮрФизЛица = _ДанныеПредыдущие.ВидЮрФизЛица
		|ГДЕ
		|	ЕСТЬNULL(_ДанныеТекущие.КоличествоНеРассмотренных, 0) <> ЕСТЬNULL(_ДанныеПредыдущие.КоличествоНеРассмотренных, 0) + ЕСТЬNULL(_ДанныеТекущие.КоличествоПоступивших, 0) - ЕСТЬNULL(_ДанныеТекущие.КоличествоРассмотренных, 0)";
#КонецОбласти

	ТекстОшибки = 
		"По коду жалобы %1 и виду юр.физ лица %2 нарушение контроля остатка:
		|Количество жалоб, находящихся на рассмотрении (%3) = Количество жалоб, находящихся на рассмотрении на окончание предыдущего отчетного периода (%4) + Количество поступивших жалоб (%5) - Количество рассмотренных жалоб в течение отчетного периода (%6).";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОшибок.Добавить(
			СтрШаблон(ТекстОшибки, 
				Выборка.КодЖалобы, 
				Выборка.ВидЮрФизЛица,
				Выборка.КоличествоНеРассмотренных,
				Выборка.КоличествоНеРассмотренныхВПредыдущемПериоде,
				Выборка.КоличествоПоступивших,
				Выборка.КоличествоРассмотренных));
	КонецЦикла;
	
	Макет = ПолучитьМакет("ОКУД0420453_СверитьСОтчетомПрошлогоПериода");
	
	ОбластьШапкаОтчета	= Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьШапкаОшибки	= Макет.ПолучитьОбласть("ШапкаОшибки");
	ОбластьСтрокаОшибки	= Макет.ПолучитьОбласть("СтрокаОшибки");
	ОбластьОшибокНет	= Макет.ПолучитьОбласть("ОшибокНет");
	
	ПараметрыКоманды.Результат.Очистить();
	
	ОбластьШапкаОтчета.Параметры.АдресТекущегоФайла		= ПараметрыКоманды.РеквизитыФайла.АдресФайла;
	ОбластьШапкаОтчета.Параметры.АдресПредыдущегоФайла	= ПараметрыКоманды.РеквизитыФайлаПредыдущегоПериода.АдресФайла;
	
	ПараметрыКоманды.Результат.Вывести(ОбластьШапкаОтчета);
	
	Если МассивОшибок.Количество() Тогда
		ПараметрыКоманды.Результат.Вывести(ОбластьШапкаОшибки);
		Для Индекс = 0 По МассивОшибок.ВГраница() Цикл
			ТекстОшибки = МассивОшибок[Индекс];
			ОбластьСтрокаОшибки.Параметры.ТекстОшибки = Строка(Индекс + 1) + ". " + ТекстОшибки;
			ПараметрыКоманды.Результат.Вывести(ОбластьСтрокаОшибки);
		КонецЦикла;	
	Иначе
		 ПараметрыКоманды.Результат.Вывести(ОбластьОшибокНет);
	КонецЕсли;
	
КонецПроцедуры

Функция ОКУД0420453_ПрочитатьФайлВТаблицу(РеквизитыФайла, МассивОшибок, Отказ)
	
	Данные = Новый ТаблицаЗначений;
	
	Данные.Колонки.Добавить("ДатаНачала"		, Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаОкончания"		, Новый ОписаниеТипов("Дата"));
	
	Данные.Колонки.Добавить("ИдентификаторСтроки"			, Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("КодЖалобы"						, Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Данные.Колонки.Добавить("ВидЮрФизЛица"					, Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	
	Данные.Колонки.Добавить("КоличествоВыявленыхНарушений"	, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("КоличествоВыплат"				, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("СуммаВыплат"					, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("КоличествоНеРассмотренных"		, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("КоличествоПоступивших"			, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("КоличествоРассмотренных"		, Новый ОписаниеТипов("Число"));
	
	ДанныеXDTO = ПолучитьДанныеXDTO(РеквизитыФайла, Отказ);
	
	Если ДанныеXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЗаполнитьТаблицуИзИсточникаПоПравилам(Данные, ДанныеXDTO, "ОКУД0420453");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("АдресФайла", РеквизитыФайла.АдресФайла);
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Данные, "_Данные",	Запрос,,, "КодЖалобы <> """"");
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Данные, "_Данные_2",	Запрос,,, "ВидЮрФизЛица <> """"");
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ДатаНачала КАК ДатаНачала,
		|	Данные.ДатаОкончания КАК ДатаОкончания,
		|	Данные.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Данные.КодЖалобы КАК КодЖалобы,
		|	Данные_2.ВидЮрФизЛица КАК ВидЮрФизЛица,
		|	Данные.КоличествоВыявленыхНарушений КАК КоличествоВыявленыхНарушений,
		|	Данные.КоличествоВыплат КАК КоличествоВыплат,
		|	Данные.СуммаВыплат КАК СуммаВыплат,
		|	Данные_2.КоличествоНеРассмотренных КАК КоличествоНеРассмотренных,
		|	Данные_2.КоличествоПоступивших КАК КоличествоПоступивших,
		|	Данные_2.КоличествоРассмотренных КАК КоличествоРассмотренных
		|ПОМЕСТИТЬ _НовыеДанные
		|ИЗ
		|	_Данные КАК Данные
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Данные_2 КАК Данные_2
		|		ПО Данные.ИдентификаторСтроки = Данные_2.ИдентификаторСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Нарушение уникальности строк [АдресФайла]. Идентификатор строки: [ИдентификаторСтроки]"" КАК ТекстОшибки,
		|	&АдресФайла КАК АдресФайла,
		|	_НовыеДанные.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ _Контроль
		|ИЗ
		|	_НовыеДанные КАК _НовыеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	_НовыеДанные.ИдентификаторСтроки
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) > 1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Нарушение структуры отчёта [АдресФайла]. В разделе SR_0420453 нет строки с идентфикатором [ИдентификаторСтроки] из раздела SR_0420453_2"",
		|	&АдресФайла,
		|	_НовыеДанные.ИдентификаторСтроки
		|ИЗ
		|	_НовыеДанные КАК _НовыеДанные
		|ГДЕ
		|	_НовыеДанные.ВидЮрФизЛица ЕСТЬ NULL";
#КонецОбласти
	
	Запрос.Выполнить();
	
	Данные = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_НовыеДанные").ПолучитьДанные().Выгрузить();
	
	Если ВДанныхЕстьОшибки(Запрос, "_Контроль", Отказ, Данные) Тогда
		Возврат Данные;
	КонецЕсли;
	
	КлючевыеПоказатели		= Новый Структура("КоличествоВыявленыхНарушений,КоличествоВыплат,СуммаВыплат,КоличествоНеРассмотренных,КоличествоПоступивших,КоличествоРассмотренных", 0, 0, 0, 0, 0, 0);
	КоличествоСтрокОтчета	= Данные.Количество() - Данные.НайтиСтроки(КлючевыеПоказатели).Количество();
	
	КонтрольПризнакаНулевогоОтчета(ДанныеXDTO, РеквизитыФайла, КоличествоСтрокОтчета, МассивОшибок);
	
	Возврат Данные;
	
КонецФункции
	
#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

Функция ПолучитьНастройкиВидимостиРеквизитов() Экспорт
	
	НастройкиВидимостиРеквизитов = Новый Структура;
	
	МакетВидимостьРеквизитов = ПолучитьМакет("ВидимостьРеквизитов");
	
	Для НомерСтроки = 2 По МакетВидимостьРеквизитов.ВысотаТаблицы Цикл
		ТекИмяПакета = СокрЛП(МакетВидимостьРеквизитов.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		НастройкиВидимостиРеквизитов.Вставить(ТекИмяПакета, Новый Структура);
		
		НастройкиВидимостиРеквизитов[ТекИмяПакета].Вставить("Представление", СокрЛП(МакетВидимостьРеквизитов.Область(НомерСтроки, 2, НомерСтроки, 2).Текст));
		
		Для НомерКолонки = 3 По МакетВидимостьРеквизитов.ШиринаТаблицы Цикл
			ИмяРеквизита	= СокрЛП(МакетВидимостьРеквизитов.Область(1, НомерКолонки, 1, НомерКолонки).Текст);

			Видимость = СокрЛП(МакетВидимостьРеквизитов.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст);
			Заголовок = СокрЛП(МакетВидимостьРеквизитов.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Примечание.Текст);
			
			Если ВРЕГ(Видимость) = "ДА" Тогда
				Видимость = Истина;
			ИначеЕсли ВРЕГ(Видимость) = "НЕТ" ИЛИ ПустаяСтрока(Видимость) Тогда
				Видимость = Ложь;
			Иначе
				//Если ни нет, ни да, тогда параметр формы 
			КонецЕсли;

			НастройкиВидимостиРеквизитов[ТекИмяПакета].Вставить(ИмяРеквизита, Новый Структура("Видимость, Заголовок", Видимость, Заголовок));
		КонецЦикла;
	КонецЦикла;
	
	Возврат НастройкиВидимостиРеквизитов;
	
КонецФункции

Функция ПолучитьЗначениеСвойства(ОбъектXDTO, ИмяСвойства, БиблиотекаЗначений = Неопределено)
	
	Если ОбъектXDTO.Свойства().Получить(ИмяСвойства) <> Неопределено Тогда
		Если ТипЗнч(БиблиотекаЗначений) = Тип("Соответствие") И БиблиотекаЗначений.Получить(ОбъектXDTO[ИмяСвойства].Value) <> Неопределено Тогда
			Возврат БиблиотекаЗначений.Получить(ОбъектXDTO[ИмяСвойства].Value);
		ИначеЕсли БиблиотекаЗначений = Тип("Дата") Тогда
			Возврат XMLЗначение(Тип("Дата"), ОбъектXDTO[ИмяСвойства].Value);
		ИначеЕсли БиблиотекаЗначений = Тип("Число") Тогда
			Возврат XMLЗначение(Тип("Число"), ОбъектXDTO[ИмяСвойства].Value);
		Иначе
			Возврат ОбъектXDTO[ИмяСвойства].Value;
		КонецЕсли;
	ИначеЕсли БиблиотекаЗначений = Тип("Число") Тогда
		Возврат 0;
	Иначе	
		Возврат "";
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьМассивСтрокXDTO(Знач ОбъектXDTO, Знач ИмяСвойства)
	
	МассивСтрок = Новый Массив;
	
	Если ОбъектXDTO.Свойства().Получить(ИмяСвойства) = Неопределено Тогда //нет раздела
		Возврат МассивСтрок;
	КонецЕсли;
	
	ОбъектXDTO	= ОбъектXDTO[ИмяСвойства];
	ИмяСвойства = ИмяСвойства + "_Item";
	
	Если ОбъектXDTO.Свойства().Получить(ИмяСвойства) = Неопределено Тогда //Раздел пуст
	
	ИначеЕсли ТипЗнч(ОбъектXDTO[ИмяСвойства]) = Тип("ОбъектXDTO") Тогда
		МассивСтрок.Добавить(ОбъектXDTO[ИмяСвойства]);
	ИначеЕсли ТипЗнч(ОбъектXDTO[ИмяСвойства]) = Тип("СписокXDTO") Тогда
		Для Каждого СтрокаXDTO Из ОбъектXDTO[ИмяСвойства] Цикл
			МассивСтрок.Добавить(СтрокаXDTO);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции

Процедура КонтрольПризнакаНулевогоОтчета(ДанныеXDTO, РеквизитыФайла, КоличествоСтрокОтчета, МассивОшибок)
	
	ПризнакНулевогоОтчета = Ложь;
	
	ПутиПризнаковНулевогоОтчета = Новый Массив;
	ПутиПризнаковНулевогоОтчета.Добавить("SR_Sved_ObOtchOrg_OtvLicza.SR_Sved_ObOtchOrg_OtvLicza_Item.Priznak_Nulevogo_OtchetaEnumerator.Value");
	ПутиПризнаковНулевогоОтчета.Добавить("SR_Sved_ObOtchOrg_OtvLicza2.SR_Sved_ObOtchOrg_OtvLicza2_Item.Priznak_Nulevogo_OtchetaEnumerator.Value");
	ПутиПризнаковНулевогоОтчета.Добавить("sr_sved_otch_org_inf_ob_otch.sr_sved_otch_org_inf_ob_otch_Item.OtsutstvDannyxEnumerator.Value");
	ПутиПризнаковНулевогоОтчета.Добавить("SR_Sved_ObOtchOrg_OtvLicza.SR_Sved_ObOtchOrg_OtvLicza_Item.PriznakNulevogoOtchetaEnumerator.Value"); // В таксономии 6.1 поле переименовали
	
	Для Каждого ПутьПризнакаНулевогоОтчета Из ПутиПризнаковНулевогоОтчета Цикл
		Элемент = ДанныеXDTO; 
		
		Для Каждого ИмяЭлемента Из СтрРазделить(ПутьПризнакаНулевогоОтчета, ".") Цикл
			Если Элемент.Свойства().Получить(ИмяЭлемента) <> Неопределено Тогда
				Элемент = Элемент[ИмяЭлемента];
				// Здесь подразумевается, что проверяется признак нулевого отчета для основного отчета пакета. Вторым идет 459, его проверять нет смысла и мы берем только первый элемент списка
				Если ТипЗнч(Элемент) = Тип("СписокXDTO") Тогда
					Элемент = Элемент[0];
				КонецЕсли;	
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		
		Если Элемент = "DaMember" ИЛИ Элемент = "ZnachPokOtsMember" Тогда
			ПризнакНулевогоОтчета = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если ПризнакНулевогоОтчета <> (КоличествоСтрокОтчета = 0) Тогда
		
		Если ПризнакНулевогоОтчета Тогда
			МассивОшибок.Добавить(СтрШаблон("В отчёте установлен признак нулевого отчёта, но при этом есть данные. Файл: %1", РеквизитыФайла.АдресФайла));
		Иначе
			МассивОшибок.Добавить(СтрШаблон("В отчёте нет данных, но не установлен признак нулевого отчёта. Файл: %1", РеквизитыФайла.АдресФайла));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеXDTO(РеквизитыФайла, Отказ)
	
	ПутьКФайлу	= ПолучитьИмяВременногоФайла("xml");
	
	Файл = ПолучитьИзВременногоХранилища(РеквизитыФайла.АдресФайлаВХ);
	Файл.Записать(ПутьКФайлу);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	
	ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Если ДанныеXDTO.Свойства().Получить("Entity") = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + РеквизитыФайла.АдресФайла + Символы.ПС + " не является отчётом XBRL.",,, РеквизитыФайла.ИмяРеквизита, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеXDTO;
	
КонецФункции

Функция БиблиотекаСтандартныхЗначений()
	
	БиблиотекаЗначений = Новый Соответствие;
	
	БиблиотекаЗначений.Вставить("FizicheskoeliczoMEMBER",	Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);
	БиблиотекаЗначений.Вставить("YULMEMBER",				Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо);
	
	БиблиотекаЗначений.Вставить("Pasportgrazhdanina_Rossijskoj_FederacziiMember", Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
	БиблиотекаЗначений.Вставить("SvidZAGS_Rek_kl_razm_im_u_prof_uch_o_rozhdeniiMember", "свидетельство органов ЗАГС, органа исполнительной власти или органа местного самоуправления о рождении гражданина");
	БиблиотекаЗначений.Вставить("Pasportmoryakaudostoverenie_lichnosti_moryakaMember", "паспорт моряка (удостоверение личности моряка)");
	БиблиотекаЗначений.Вставить("UdostoverenielichnostivoennosluzhashhegoMember", "удостоверение личности военнослужащего");
	БиблиотекаЗначений.Вставить("VoennyjbiletvoennosluzhashhegoMember", "военный билет военнослужащего");
	БиблиотекаЗначений.Вставить("VremennoeudostoverenielichnostigrazhdaninaMember", "временное удостоверение личности гражданина Российской Федерации");
	БиблиотекаЗначений.Вставить("SpravkaobosvobozhdeniiizmestlisheniyasvobodyMember", "справка об освобождении из мест лишения свободы");
	БиблиотекаЗначений.Вставить("Pasportinostrannogograzhdanina_inoj_dokumentmember", Справочники.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина);
	БиблиотекаЗначений.Вставить("VidnazhitelstvoMember", "вид на жительство");
	БиблиотекаЗначений.Вставить("RazreshenienavremennoeprozhivanieMember", "разрешение на временное проживание (для лиц без гражданства)");
	БиблиотекаЗначений.Вставить("UdostovereniebezhenczaMember", "удостоверение беженца");
	БиблиотекаЗначений.Вставить("MigraczionnayakartaMember", "миграционная карта");
	БиблиотекаЗначений.Вставить("PasportgrazhdaninaSSSRMember", "паспорт гражданина СССР");
	БиблиотекаЗначений.Вставить("SNILSMember", "страховой номер индивидуального лицевого счета застрахованного лица в системе персонифицированного учета Пенсионного фонда Российской Федерации (СНИЛС)");
	БиблиотекаЗначений.Вставить("VoditelskoeudostoverenieMember", "водительское удостоверение");
	БиблиотекаЗначений.Вставить("SvidetelstvooregistracziitransportnogosredstvavMVDMember", "свидетельство о регистрации транспортного средства в органах Министерства внутренних дел Российской Федерации.");
	БиблиотекаЗначений.Вставить("OhotbiletMember", "охотничий билет");
	БиблиотекаЗначений.Вставить("HranenohotMember", "разрешение на хранение и ношение охотничьего оружия");
	БиблиотекаЗначений.Вставить("InpassportMember", Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ);
	БиблиотекаЗначений.Вставить("VremybejMember", "свидетельство о предоставлении временного убежища на территории Российской Федерации");
	БиблиотекаЗначений.Вставить("SvidoHodMember", "свидетельство о рассмотрении ходатайства по существу");
	БиблиотекаЗначений.Вставить("LicoBezGrazhdanstvaMember", "Лицо без гражданства ");
	БиблиотекаЗначений.Вставить("Informacziya_otsutstvuet_Aff_lInformacziya_otsutstvuetmember", "Информация отсутствует");
	
	БиблиотекаЗначений.Вставить("Chlen_sovet_dirzacziiMember", "A 1-1");
	БиблиотекаЗначений.Вставить("Chlen_kolleg_isp_organaMember", "A 1-2");
	БиблиотекаЗначений.Вставить("Liczo_Osushh_funk_edinolich_ispolnit_organaMember", "A 1-3");
	БиблиотекаЗначений.Вставить("Licza_prinadlKgruppe_licz_kKot_prinadlMember", "A 2");
	БиблиотекаЗначений.Вставить("Licza_raspor_bolee_20proczGolosovMember", "A 3");
	БиблиотекаЗначений.Вставить("YUL_vkot_orgimeetpravorasporyazhbolee20proczgolosovMember", "A 4");

	Возврат БиблиотекаЗначений;
	
КонецФункции

Функция КонтрольПоследовательностиОтчетов(ДанныеТекущие, ДанныеПредыдущие)
	
	Отказ = Ложь;
	
	Если НЕ ДанныеТекущие.Количество() ИЛИ НЕ ДанныеПредыдущие.Количество() Тогда
		Возврат Истина; //Один из отчётов нулевой, нечего проверять
	КонецЕсли;
	
	Если ДанныеТекущие[0].ДатаНачала <> ДанныеПредыдущие[0].ДатаОкончания
		И ДанныеТекущие[0].ДатаНачала <> ДанныеПредыдущие[0].ДатаОкончания + 86400 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(
				"Отчёты не являются последовательными. Дата окончания предыдущего отчёта %1 не равна дате начала текущего отчёта %2", 
				Формат(ДанныеПредыдущие[0].ДатаОкончания, "ДФ=dd.MM.yy"),
				Формат(ДанныеТекущие[0].ДатаНачала, "ДФ=dd.MM.yy")),,,, Отказ);
	КонецЕсли;
			
	Возврат НЕ Отказ;		
	
КонецФункции

Функция ПолучитьТаблицуИзМакета(ИмяМакета, ВерсияТаксономии, ПараметрыПоиска = Неопределено, Сортировка = Неопределено, Отказ = Ложь)
	
	Таблица = Новый ТаблицаЗначений;
	Макет	= ПолучитьМакет(ИмяМакета);
	
	КолонкиМакета = Новый Соответствие;
	Для НомерКолонки = 1 По Макет.ШиринаТаблицы Цикл
		ПараметрыКолонки = СтрРазделить(СокрЛП(Макет.Область(1, НомерКолонки, 1, НомерКолонки).Текст), "()", Ложь);
		
		КолонкиМакета.Вставить(ПараметрыКолонки[0], НомерКолонки);
		Если ПараметрыКолонки.Количество() = 1 Тогда
			Таблица.Колонки.Добавить(ПараметрыКолонки[0], Новый ОписаниеТипов("Строка"));
		ИначеЕсли ПараметрыКолонки.Количество() = 2 Тогда
			Таблица.Колонки.Добавить(ПараметрыКолонки[0], Новый ОписаниеТипов(ПараметрыКолонки[1]));
		ИначеЕсли ПараметрыКолонки.Количество() = 3 И ПараметрыКолонки[1] = "Строка" Тогда
			Таблица.Колонки.Добавить(ПараметрыКолонки[0], Новый ОписаниеТипов(ПараметрыКолонки[1], Новый КвалификаторыСтроки(ПараметрыКолонки[2])));	
		КонецЕсли;
		
	КонецЦикла;
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НомерКолонки = КолонкиМакета.Получить("ТаксономияС");
		Если НомерКолонки <> Неопределено Тогда
			ВерсияТаксономииС	= СокрЛП(Макет.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст);
			Если ЗначениеЗаполнено(ВерсияТаксономииС) И ВерсияТаксономииС > ВерсияТаксономии Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НомерКолонки = КолонкиМакета.Получить("ТаксономияПо");
		Если НомерКолонки <> Неопределено Тогда
			ВерсияТаксономииПо	= СокрЛП(Макет.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст);
			Если ЗначениеЗаполнено(ВерсияТаксономииПо) И ВерсияТаксономииПо < ВерсияТаксономии Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = Таблица.Добавить();
		Для Каждого КолонкаМакета Из КолонкиМакета Цикл
			Значение = СокрЛП(Макет.Область(НомерСтроки, КолонкаМакета.Значение, НомерСтроки, КолонкаМакета.Значение).Текст);
			
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(НоваяСтрока[КолонкаМакета.Ключ])) Тогда
				Если ЗначениеЗаполнено(Значение) Тогда
					Если СтрЧислоВхождений(Значение, "-") = 4 Тогда
						Попытка 
							УникальныйИдентификатор = Новый УникальныйИдентификатор(Значение);
							НоваяСтрока[КолонкаМакета.Ключ]	= ОбщегоНазначения.МенеджерОбъектаПоСсылке(НоваяСтрока[КолонкаМакета.Ключ]).ПолучитьСсылку(УникальныйИдентификатор);
						Исключение
							НоваяСтрока[КолонкаМакета.Ключ] = ОбщегоНазначения.ПолучитьИменованныйОбъект(Значение);
						КонецПопытки;
					Иначе
						НоваяСтрока[КолонкаМакета.Ключ] = ОбщегоНазначения.ПолучитьИменованныйОбъект(Значение);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(НоваяСтрока[КолонкаМакета.Ключ]) = Тип("Тип") Тогда
				Если ЗначениеЗаполнено(Значение) Тогда // на 23 платформе возникает ошибка если передается пустая строка
					НоваяСтрока[КолонкаМакета.Ключ]	= Тип(Значение);
				КонецЕсли;	
			Иначе
				НоваяСтрока[КолонкаМакета.Ключ]	= Значение;
			КонецЕсли;
				
			Если ТипЗнч(НоваяСтрока[КолонкаМакета.Ключ]) = Тип("Строка") И НоваяСтрока[КолонкаМакета.Ключ] <> Значение Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Неверно указана ширина колонки %1 в макете %2, не поместилось значение %3, обратитесь к программисту.", КолонкаМакета.Ключ, ИмяМакета, Значение),,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Если ТипЗнч(ПараметрыПоиска) = Тип("Структура") Тогда
		Результат = Таблица.Скопировать(ПараметрыПоиска);
	Иначе
		Результат = Таблица;
	КонецЕсли;
	
	Если Сортировка <> Неопределено Тогда
		Результат.Сортировать(Сортировка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТаблицуИзИсточникаПоПравилам(Данные, ДанныеXDTO, ИмяПравила, ВерсияТаксономии = "")
	
	ВерсияТаксономии = ПолучитьВерсиюТаксономииИзXDTO(ДанныеXDTO);	
	
	ПравилаИмпортаДанныхИзФайла = ПолучитьТаблицуИзМакета("ПравилаИмпортаДанныхИзФайла", ВерсияТаксономии, Новый Структура("ИмяПравила", ИмяПравила));
	БиблиотекаЗначений	= БиблиотекаСтандартныхЗначений();
	
	ГруппыПравил = Новый Соответствие;
	Для Каждого Правило Из ПравилаИмпортаДанныхИзФайла Цикл
		Если ГруппыПравил.Получить(Правило.ТаблицаИсточник + Правило.НомерПравила) = Неопределено Тогда
			ГруппыПравил.Вставить(Правило.ТаблицаИсточник + Правило.НомерПравила, Новый Структура("ТаблицаИсточник, НомерПравила", Правило.ТаблицаИсточник, Правило.НомерПравила));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ГруппаПравил Из ГруппыПравил Цикл 
		Если НЕ ДанныеXDTO.Свойства().Получить(ГруппаПравил.Значение.ТаблицаИсточник) = Неопределено Тогда
			Для Каждого СтрокаДанныхXDTO Из ПолучитьМассивСтрокXDTO(ДанныеXDTO, ГруппаПравил.Значение.ТаблицаИсточник) Цикл
				
				НайденныеСтроки = ПравилаИмпортаДанныхИзФайла.НайтиСтроки(ГруппаПравил.Значение);
				ПервоеПравило 	= НайденныеСтроки[0];
				ПолучитьДанные	= Ложь;
				
				Если ПустаяСтрока(ПервоеПравило.ПолеОтбора) Тогда
					ПолучитьДанные = Истина;
				ИначеЕсли ПустаяСтрока(ПервоеПравило.ЗначениеОтбора) Тогда
					ПолучитьДанные = ЗначениеЗаполнено(ПолучитьЗначениеСвойства(СтрокаДанныхXDTO, ПервоеПравило.ПолеОтбора));
				Иначе
					ПолучитьДанные = (ПолучитьЗначениеСвойства(СтрокаДанныхXDTO, ПервоеПравило.ПолеОтбора) = ПервоеПравило.ЗначениеОтбора);
				КонецЕсли;
				
				Если ПолучитьДанные Тогда
					СтрокаДанных = Данные.Добавить();
					
					Для Каждого Правило Из НайденныеСтроки Цикл
						
						Если ЗначениеЗаполнено(Правило.ФиксированноеЗначение) Тогда
							СтрокаДанных[Правило.ПолеПриемник] = Вычислить(Правило.ФиксированноеЗначение);
						Иначе
							Если Правило.Тип = "БиблиотекаЗначений" Тогда
								Тип = БиблиотекаЗначений;
							ИначеЕсли ЗначениеЗаполнено(Правило.Тип) Тогда
								Тип = Тип(Правило.Тип);
							Иначе 
								Тип = Неопределено;
							КонецЕсли;
							
							МассивПолейИсточника = СтрРазделить(Правило.ПолеИсточник, ",");
							Для Каждого ПолеИсточник Из МассивПолейИсточника Цикл
								Если ЗначениеЗаполнено(СтрокаДанных[Правило.ПолеПриемник]) Тогда
									СтрокаДанных[Правило.ПолеПриемник] = СтрокаДанных[Правило.ПолеПриемник] + ПолучитьЗначениеСвойства(СтрокаДанныхXDTO, ПолеИсточник, Тип);
								Иначе
									СтрокаДанных[Правило.ПолеПриемник] = ПолучитьЗначениеСвойства(СтрокаДанныхXDTO, ПолеИсточник, Тип);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
					КонецЦикла;
					
					Если Данные.Колонки.Найти("ДатаНачала") <> Неопределено Тогда
						СтрокаДанных.ДатаНачала		= XMLЗначение(Тип("Дата"), СтрокаДанныхXDTO.Date_From);
						СтрокаДанных.ДатаОкончания	= XMLЗначение(Тип("Дата"), СтрокаДанныхXDTO.Date_To);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВерсиюТаксономииИзXDTO(ДанныеXDTO)
	
	ВерсияТаксономии = "";
	
	Если ДанныеXDTO.Свойства().Получить("Taxonomy") <> Неопределено Тогда
		ВерсияТаксономии = СтрЗаменить(ДанныеXDTO.Taxonomy, ".", "_");
	Иначе
		ОтчетнаяДата = "";
		
		Для Каждого Свойство Из ДанныеXDTO.Свойства() Цикл
			Если НЕ ЗначениеЗаполнено(ОтчетнаяДата) И ТипЗнч(ДанныеXDTO[Свойство.Имя]) = Тип("ОбъектXDTO") Тогда
				Для Каждого Свойство1 Из ДанныеXDTO[Свойство.Имя].Свойства() Цикл
					Если НЕ ЗначениеЗаполнено(ОтчетнаяДата) И ТипЗнч(ДанныеXDTO[Свойство.Имя][Свойство1.Имя]) = Тип("СписокXDTO") Тогда
						СтрокаДанныхXDTO = ДанныеXDTO[Свойство.Имя][Свойство1.Имя][0];
						Если СтрокаДанныхXDTO.Свойства().Получить("Date_To") <> Неопределено Тогда
							ОтчетнаяДата = XMLЗначение(Тип("Дата"), СтрокаДанныхXDTO.Date_To);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(ОтчетнаяДата) Тогда
			Если ОтчетнаяДата > Дата(2023, 4, 1) Тогда
				ВерсияТаксономии = "5_2";
			ИначеЕсли ОтчетнаяДата > Дата(2021, 10, 1) Тогда
				ВерсияТаксономии = "4_2";
			ИначеЕсли ОтчетнаяДата > Дата(2021, 4, 1) Тогда
				ВерсияТаксономии = "3_2";
			ИначеЕсли ОтчетнаяДата > Дата(2019, 9, 1) Тогда
				ВерсияТаксономии = "3_1";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВерсияТаксономии;
	
КонецФункции

Функция ВДанныхЕстьОшибки(Запрос, ИмяТаблицыКонтроля, Отказ, Данные = Неопределено)
	
	Таблица_Контроля = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяТаблицыКонтроля).ПолучитьДанные().Выгрузить();
	
	Если Таблица_Контроля.Количество() > 0 Тогда
		Для Каждого Строка_Контроля Из Таблица_Контроля Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СформироватьСтрокуПоШаблону(Строка_Контроля, Строка_Контроля.ТекстОшибки),,,, Отказ);
		КонецЦикла;
		
		Если Данные <> Неопределено Тогда
			Данные.Очистить();
		КонецЕсли;
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

Функция СформироватьСтрокуПоШаблону(СтрокаДанных, Шаблон)
	
	ПараметрыСообщения = Новый Структура;
	Для Каждого Колонка Из СтрокаДанных.Владелец().Колонки Цикл
		Если Колонка.Имя = "ШаблонСообщения" Тогда
			ШаблонСообщения = СтрокаДанных[Колонка.Имя];
		ИначеЕсли Колонка.Имя = "Отказ" Тогда
			ВызватьОтказ = СтрокаДанных[Колонка.Имя];
		ИначеЕсли ТипЗнч(СтрокаДанных[Колонка.Имя]) = Тип("Дата") Тогда
			ПараметрыСообщения.Вставить(Колонка.Имя, Формат(СтрокаДанных[Колонка.Имя], "ДФ=dd.MM.yyyy; ДП=отсутствует"));	
		Иначе
			ПараметрыСообщения.Вставить(Колонка.Имя, СтрокаДанных[Колонка.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РаботаСоСтрокамиКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыСообщения);
	
КонецФункции

#КонецОбласти













