
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.СостояниеНаДату		= ТекущаяДата();
	ЭтаФорма.СкрытьНедействующие	= Истина;
	
	Элементы.ФормаКомандаСкрытьНедействующие.Пометка = ЭтаФорма.СкрытьНедействующие;		
	
	ПриИзмененииПараметровСписка();	
	УстановитьОтборЗамещающих(ЭтаФорма, Неопределено, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеНаДатуПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ЭтаФорма.СостояниеНаДату)	Тогда
		ЭтаФорма.СостояниеНаДату = ТекущаяДата();
	КонецЕсли;
	
	ПриИзмененииПараметровСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		ИЛИ Не ТекущиеДанные.Свойство("Организация")
		ИЛИ Не ТекущиеДанные.Свойство("Сотрудник")
	Тогда
		УстановитьОтборЗамещающих(ЭтаФорма, Неопределено, Неопределено, Неопределено);	
		Возврат;	
	КонецЕсли;
	
	УстановитьОтборЗамещающих(ЭтаФорма, ТекущиеДанные.Организация, ТекущиеДанные.Сотрудник, ТекущиеДанные.ГруппаВидовОпераций);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазначитьОсновнымОтветственным(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		ИЛИ Не (ТекущиеДанные.Свойство("Организация") И ТекущиеДанные.Свойство("ГруппаВидовОпераций") И ТекущиеДанные.Свойство("Сотрудник") И ТекущиеДанные.Свойство("Период"))
	Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОсновногоОтветственного(ТекущиеДанные.Организация, ТекущиеДанные.ГруппаВидовОпераций, ТекущиеДанные.Сотрудник, ТекущиеДанные.Период);	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьНедействующие(Команда)

	ЭтаФорма.СкрытьНедействующие = Не ЭтаФорма.СкрытьНедействующие;	
	
	Элементы.ФормаКомандаСкрытьНедействующие.Пометка = ЭтаФорма.СкрытьНедействующие;	
	
	ПриИзмененииПараметровСписка();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОсновногоОтветственного(Организация, ГруппаВидовОпераций, Сотрудник, Период)

	// Определяем текущего ответственного	
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОтветственныеЗаОперации.Организация КАК Организация,
		|	ОтветственныеЗаОперации.ГруппаВидовОпераций КАК ГруппаВидовОпераций,
		|	ОтветственныеЗаОперации.Сотрудник КАК Сотрудник,
		|	ОтветственныеЗаОперации.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|ГДЕ
		|	ОтветственныеЗаОперации.Организация = &Организация
		|	И ОтветственныеЗаОперации.ГруппаВидовОпераций = &ГруппаВидовОпераций
		|	И ОтветственныеЗаОперации.Период <= &Период
		|	И (&Период <= ОтветственныеЗаОперации.ДатаОкончания
		|			ИЛИ ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И ОтветственныеЗаОперации.Основной");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГруппаВидовОпераций", ГруппаВидовОпераций);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	// Отменяем старого
	
	НачатьТранзакцию();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекущийОтветственный = РезультатЗапроса.Выгрузить()[0];
		
		рсОтветственныеЗаОперации = РегистрыСведений.ОтветственныеЗаОперации.СоздатьНаборЗаписей();
		рсОтветственныеЗаОперации.Отбор.Организация.Установить(ТекущийОтветственный.Организация); 
		рсОтветственныеЗаОперации.Отбор.ГруппаВидовОпераций.Установить(ТекущийОтветственный.ГруппаВидовОпераций); 
		рсОтветственныеЗаОперации.Отбор.Сотрудник.Установить(ТекущийОтветственный.Сотрудник); 
		рсОтветственныеЗаОперации.Отбор.Период.Установить(ТекущийОтветственный.Период); 
		
		рсОтветственныеЗаОперации.Прочитать();
		Если рсОтветственныеЗаОперации.Количество() > 0 Тогда
			рсОтветственныеЗаОперации[0].Основной = Ложь;
			
			рсОтветственныеЗаОперации.ДополнительныеСвойства.Вставить("ЗаменаОсновогоОтветственного", Истина);
			рсОтветственныеЗаОперации.Записать(Истина);
		КонецЕсли;			
	КонецЕсли;
	
	// Добавляем нового	
	
	рсОтветственныеЗаОперации = РегистрыСведений.ОтветственныеЗаОперации.СоздатьМенеджерЗаписи();
	рсОтветственныеЗаОперации.Организация			= Организация;
	рсОтветственныеЗаОперации.ГруппаВидовОпераций	= ГруппаВидовОпераций;
	рсОтветственныеЗаОперации.Сотрудник				= Сотрудник;
	рсОтветственныеЗаОперации.Период				= Период;
	
	рсОтветственныеЗаОперации.Прочитать();		
	Если рсОтветственныеЗаОперации.Выбран() Тогда
		рсОтветственныеЗаОперации.Основной = Истина;
		рсОтветственныеЗаОперации.Записать(Истина);
	КонецЕсли;
		
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ЭтаФорма.СостояниеНаДату);
	Список.Параметры.УстановитьЗначениеПараметра("СкрытьНедействующие", ЭтаФорма.СкрытьНедействующие);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборЗамещающих(ЭтаФорма, Организация, Сотрудник, ГруппаВидовОпераций) Экспорт
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ЗамещающиеПользователи.Отбор, "Организация", , , Организация,  , РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ЗамещающиеПользователи.Отбор, "Сотрудник", , , Сотрудник,  , РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ЗамещающиеПользователи.Отбор, "ГруппаВидовОпераций", , , ГруппаВидовОпераций,  , РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	
КонецПроцедуры