#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = ПолучитьНаименование(Объект.ЮрЛицо);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЮрЛицоПриИзменении(Элемент)
	
	УстановитьОтборыПоВедомымРегистрам(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УстановитьОтборыПоВедомымРегистрам(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыПоВедомымРегистрам(Форма)
	
	Объект = Форма.Объект;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма.УставнойКапитал.Отбор, "ЮрЛицо",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.ЮрЛицо, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименование(ЮрЛицо)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЮрЛицо", ЮрЛицо);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Наименование
	               |ИЗ
	               |	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	               |			,
	               |			ЮрФизЛицо = &ЮрЛицо
	               |				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	               |				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Наименование;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти




