
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРегистраторыОстатковДенежныхСредств();
	
	ЭтаФорма.АдресНастроек = Параметры.АдресНастроек;
	ЭтаФорма.Обстоятельства.Загрузить(ПолучитьИзВременногоХранилища(ЭтаФорма.АдресНастроек));
			
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Обстоятельства.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Элементы.ГруппаОтборСделок.Доступность = ТекСтрока.Сделка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбстоятельстваПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Обстоятельства.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Элементы.ГруппаОтборСделок.Доступность = ТекСтрока.Сделка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	ЗаписатьДанныеВНастройки();
	Закрыть(ЭтаФорма.НастройкиИзменялись);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	ЗаписатьДанныеВНастройки();
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ДобавитьРегистраторыОстатковДенежныхСредств()

	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	ТаблицаРеквизитов.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("РеквизитФормы"));
	
	ТипыРегистраторов = Метаданные.РегистрыНакопления.ОстаткиДенежныхСредств.СтандартныеРеквизиты.Регистратор.Тип.Типы();
	
	Для каждого ТипРегистратора Из ТипыРегистраторов Цикл
		
		ДокументМД = Метаданные.НайтиПоТипу(ТипРегистратора);
		
		НовыйРеквизит = Новый РеквизитФормы(
			"ДС_" + ДокументМД.Имя,
			Новый ОписаниеТипов("Булево"),
			"Обстоятельства",
			ДокументМД.Синоним,
			Истина);
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.Синоним = ДокументМД.Синоним;
		НоваяСтрока.Реквизит = НовыйРеквизит;
		
	КонецЦикла; 
	
	ТаблицаРеквизитов.Сортировать("Синоним");
	ДобавляемыеРеквизиты = ТаблицаРеквизитов.ВыгрузитьКолонку("Реквизит");
		
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого НовыйРеквизит Из ДобавляемыеРеквизиты Цикл
	
		НовыйЭлемент = Элементы.Добавить(НовыйРеквизит.Имя, Тип("ПолеФормы"), Элементы.ДенежныеСредства); 
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Элементы.Обстоятельства.ТекущиеДанные." + НовыйРеквизит.Имя;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВНастройки()

	ПоместитьВоВременноеХранилище(ЭтаФорма.Обстоятельства.Выгрузить(), ЭтаФорма.АдресНастроек);
	ЭтаФорма.НастройкиИзменялись = Истина;
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		Отказ = Истина;
		
		Если Вопрос("Настройки изменены. Продолжить без сохранения?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да Тогда;
			
			ЭтаФорма.Модифицированность = Ложь;
			Закрыть(ЭтаФорма.НастройкиИзменялись);
			
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.НастройкиИзменялись Тогда 
		
		//ЭтаФорма.НастройкиИзменялись = Ложь;
		Закрыть(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

