Перем Брокер;
Перем ОплатаТорговойКомиссииПриИсполненииСделокСОтложеннымИсполнением;
Перем ТочностьЦеныЦеннойБумаги;
Перем ПропуститьРеквизитыСписок;

////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ДЛЯ ВКЛЮЧЕНИЯ В ДОП. ОТЧЕТЫ И ОБРАБОТКИ

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Импорт операций брокера БК РЕГИОН",
		"4.88",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОСНОВНОЙ ФУНКЦИОНАЛ

Функция ОпределитьЗагрузкуКонтрагентаПоВнебиржевымСделкам(Организация) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект = &Объект
		|	И ЗначенияДополнительныхСведений.Свойство.Ключ = &Ключ");
		
	Запрос.УстановитьПараметр("Объект", Организация);
	Запрос.УстановитьПараметр("Ключ",   "ЗагружатьКонтрагентаПоВнебиржевымСделкам");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.Значение;	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ФайлИмпортаСоответствуетСхемеXSD(ТаблицаДанных, ИмяМакета) Экспорт
		
	//исключил из проверки, что бы в схему не добовлять старьё
	//из выгрузки на стороне матрих удалены элементы (REPO_Changes) которые присутствовали в прошлом.
	Если ЭтотОбъект.ДатаИмпорта < Дата(2021, 04, 01) И ИмяМакета = "Схема_OTBR" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Дата сверки [" + ЭтотОбъект.ДатаИмпорта + "] меньше даты перехода на формат OTBR [01.04.2021]");
		Возврат Ложь;	
	КонецЕсли;
	
	ФайлСхемы = Новый Файл(КаталогВременныхФайлов() + "XMLSchema.xsd");
	
	Если ФайлСхемы.Существует() Тогда
		УдалитьФайлы(ФайлСхемы.ПолноеИмя);
	КонецЕсли;
		
	Макет = ЭтотОбъект.ПолучитьМакет(ИмяМакета);

	Попытка
		Макет.Записать(ФайлСхемы.ПолноеИмя);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось записать файл схемы в каталог временных файлов!" + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
		
	Попытка
		КомОбъектКэшСхем = Новый COMОбъект("MSXML2.XMLSchemaCache.6.0");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось создать объект XMLSchemaCache" + Символы.ПС + ОписаниеОшибки());
		УдалитьФайлы(ФайлСхемы.ПолноеИмя);
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		КомОбъектКэшСхем.add(, ФайлСхемы.ПолноеИмя);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось подключить схему: " + Символы.ПС + ОписаниеОшибки());
		УдалитьФайлы(ФайлСхемы.ПолноеИмя);
		Возврат Ложь;
	КонецПопытки;
	
	ИмяФайлаДанных = ПолучитьИмяВременногоФайла("xml");
		
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		
		СтрокаТаблицыДанных.ДанныеФайла.Записать(ИмяФайлаДанных);
		
		Попытка
			КомОбъектДок = Новый COMОбъект("MSXML2.DOMDocument.6.0");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось создать объект DOMDocument" + Символы.ПС + ОписаниеОшибки());
			УдалитьФайлы(ФайлСхемы.ПолноеИмя);
			Возврат Ложь;
		КонецПопытки;
		
		КомОбъектДок.schemas          = КомОбъектКэшСхем;
		КомОбъектДок.async            = Ложь;
		КомОбъектДок.validateOnParse  = Истина;
		КомОбъектДок.resolveExternals = Истина;
		КомОбъектДок.SetProperty("MultipleErrorMessages", Истина);
		
		Попытка
			КомОбъектДок.load(ИмяФайлаДанных);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось загрузить файл [" + СтрокаТаблицыДанных.ИмяФайла + "] в объект DOMDocument" + Символы.ПС + ОписаниеОшибки());
			УдалитьФайлы(ИмяФайлаДанных);
			УдалитьФайлы(ФайлСхемы.ПолноеИмя);
			Возврат Ложь;
		КонецПопытки;

		
		Если КомОбъектДок.parseError.errorCode <> 0 Тогда //erorcode -1072898027
			
			ТекстСообщения = "Файл импорта [" + СтрокаТаблицыДанных.ИмяФайла + "] не соответствует схеме XSD."; 
		
			Для Каждого Ошибка из КомОбъектДок.parseError.AllErrors  Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + СокрЛП(Ошибка.errorXPath) + " Ошибка: " + СокрЛП(Ошибка.reason);
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			УдалитьФайлы(ИмяФайлаДанных);
			УдалитьФайлы(ФайлСхемы.ПолноеИмя);
			Возврат Ложь;
			
		КонецЕсли;
			
	КонецЦикла;
	
	УдалитьФайлы(ФайлСхемы.ПолноеИмя);
	УдалитьФайлы(ИмяФайлаДанных);

	Возврат Истина;
	
КонецФункции

Функция ПолучитьПрочиеДоходыИРасходы(ВидЗадолженности)
	
	Если ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии") Тогда
		Возврат Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам брокера");
	ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии")
		ИЛИ ПринадлежитГруппеЗадолженностей(ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия")) Тогда 	
		Возврат Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам депозитария");
	ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоБанковскойКомиссии")
		ИЛИ ПринадлежитГруппеЗадолженностей(ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.БанковскаяКомиссия")) Тогда 	
		Возврат Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Комиссия банка");	
	Иначе
		Возврат Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

Функция ПринадлежитГруппеЗадолженностей(ВидЗадолженности, Группа)
	Если НЕ ЗначениеЗаполнено(ВидЗадолженности) Тогда
		Возврат Ложь;
	Иначе
		Возврат ВидЗадолженности.ПринадлежитЭлементу(Группа);
	КонецЕсли;
КонецФункции

Функция ПолучитьНезагружаемыеРеквизиты(ПолноеИмяОбъектаМД, Внебиржа = Ложь)
	
	Если ПропуститьРеквизитыСписок = Неопределено Тогда
		ПропуститьРеквизитыСписок = Новый СписокЗначений;
		ПропуститьРеквизитыСписок.Добавить("Ответственный");
		ПропуститьРеквизитыСписок.Добавить("Комментарий");
		ПропуститьРеквизитыСписок.Добавить("СтрокаПартии");
		ПропуститьРеквизитыСписок.Добавить("УчетныйАктивЕПС");
		ПропуститьРеквизитыСписок.Добавить("ГруппаФинансовогоУчетаДоходовРасходов");
		ПропуститьРеквизитыСписок.Добавить("ВидВходящегоДокумента");
		ПропуститьРеквизитыСписок.Добавить("НомерВходящегоДокумента");
		ПропуститьРеквизитыСписок.Добавить("ДатаВходящегоДокумента");
		ПропуститьРеквизитыСписок.Добавить("Резерв");
		ПропуститьРеквизитыСписок.Добавить("НалогИлиВзнос");
		ПропуститьРеквизитыСписок.Добавить("УровеньБюджета");
	КонецЕсли;
	
	Результат = ПропуститьРеквизитыСписок.Скопировать();
	
	Если ПолноеИмяОбъектаМД = "Документ.ПоставкаЦенныхБумаг" Тогда
		Результат.Добавить("Взаимозачет");
	КонецЕсли;
	
	Если ПолноеИмяОбъектаМД = "Документ.Оплата" Тогда
		Результат.Добавить("ОбеспечительныйПлатеж");
		Результат.Добавить("КоррСчет");
		Результат.Добавить("Субконто1");
		Результат.Добавить("Субконто2");
		Результат.Добавить("Субконто3");
		Результат.Добавить("КоррСчетЕПС");
		Результат.Добавить("СубконтоЕПС1");
		Результат.Добавить("СубконтоЕПС2");
		Результат.Добавить("СубконтоЕПС3");
		Результат.Добавить("ДатаПлановогоПогашенияЗадолженности");
		Результат.Добавить("Поручение");
	КонецЕсли;
	
	Если ПолноеИмяОбъектаМД = "Документ.Оплата.ТабличнаяЧасть.Основания" Тогда
		Результат.Добавить("СтавкаНДС");
		Результат.Добавить("СуммаНДС");
	КонецЕсли;

	Если ПолноеИмяОбъектаМД = "Документ.НачислениеЗадолженности" Тогда
		Результат.Добавить("НомерСчетаФактуры");
		Результат.Добавить("ДатаСчетаФактуры");
		Результат.Добавить("НДСВключатьВСтоимость");
		Результат.Добавить("ЗачестьНДС");
		Результат.Добавить("НДСПоОбщимРасходам");
		Результат.Добавить("Предварительно");
		Результат.Добавить("Грузоотправитель");
		Результат.Добавить("Арендатор");
		Результат.Добавить("ДоговорАренды");
		Результат.Добавить("ДатаОплатыАренды");
		Результат.Добавить("СчетФактураСводный");
	КонецЕсли;
	
	Если ПолноеИмяОбъектаМД = "Документ.НачислениеЗадолженности.ТабличнаяЧасть.Основания" Тогда
		Результат.Добавить("Содержание");
	КонецЕсли;
	
	Если ПолноеИмяОбъектаМД = "Документ.СделкаСПФИ" Тогда
		Результат.Добавить("СтавкаВходящихПлатежей");
		Результат.Добавить("СтавкаИсходящихПлатежей");
		Результат.Добавить("ПериодичностьВходящихПлатежей");
		Результат.Добавить("ПериодичностьИсходящихПлатежей");
		Результат.Добавить("Поставочный");
		Результат.Добавить("РежимБиржевыхТоргов");
	КонецЕсли;

	Если Внебиржа И НЕ ЗагружатьКонтрагентаПоВнебиржевымСделкам Тогда
		//Не грузим и не сверяем контрагента по внебирже, т.к. в отчете брокера его нет
		Если ПолноеИмяОбъектаМД = "Документ.СделкаРЕПО" ИЛИ ПолноеИмяОбъектаМД = "Документ.Сделка" Тогда
			Результат.Добавить("Контрагент");
		ИначеЕсли ПолноеИмяОбъектаМД = "Документ.Оплата" Тогда
			Результат.Добавить("Контрагент");
			Результат.Добавить("Договор");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляОбъектаНаОснованииМетаданных(ОбъектМД, Знач ИменаПолейОбъектаМД = Неопределено, Внебиржа = Ложь)
	
	ПоляОбъекта = Новый Структура();
	
	ИменаПолейОбъектаМД = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолейОбъектаМД, ",", Истина, Истина);
	ПолноеИмяОбъектаМД  = ОбъектМД.ПолноеИмя();
	
	Если Найти(ПолноеИмяОбъектаМД, "Документ.") = 1 Тогда
		Если Найти(ПолноеИмяОбъектаМД, ".ТабличнаяЧасть.") = 0 Тогда
			ПоляОбъекта.Вставить("Дата");
			ПоляОбъекта.Вставить("Проведен");
			ПоляОбъекта.Вставить("ПометкаУдаления");
		Иначе
			ПоляОбъекта.Вставить("НомерСтроки");
		КонецЕсли;
		
		НезагружаемыеРеквизиты = ПолучитьНезагружаемыеРеквизиты(ПолноеИмяОбъектаМД, Внебиржа);
		
		Для каждого РеквизитМД Из ОбъектМД.Реквизиты Цикл
			Если НезагружаемыеРеквизиты.НайтиПоЗначению(РеквизитМД.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляОбъекта.Вставить(РеквизитМД.Имя);
		КонецЦикла;
		
	Иначе
		ВызватьИсключение "Получение таблицы полей на основании объекта '" + ПолноеИмяОбъектаМД + "' не поддерживается";
		
	КонецЕсли;
	
	Возврат
		Новый ФиксированнаяСтруктура(ПоляОбъекта);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Процедура ЗагрузитьОперации(ДанныеСФормы)
			
	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	
	ВидыОпераций = Новый Соответствие();
	ВидыОпераций.Вставить("БиржевыеСделки", "Сделка");
	ВидыОпераций.Вставить("ВнебиржевыеСделки", "Сделка");
	ВидыОпераций.Вставить("ИзмененияСделок", "ИзменениеУсловийСделки");
	ВидыОпераций.Вставить("БиржевыеСделкиРЕПО1", "СделкаРЕПО");
	ВидыОпераций.Вставить("БиржевыеСделкиРЕПО2", "СделкаРЕПО");
	ВидыОпераций.Вставить("ИзмененияСделокРЕПО2", "ИзменениеУсловийСделки");
	ВидыОпераций.Вставить("ВнебиржевыеСделкиРЕПО", "СделкаРЕПО");
	ВидыОпераций.Вставить("СделкиСВалютой", "СделкаСвалютой");
	ВидыОпераций.Вставить("ФорвардыПоставочные", "СделкаСвалютой");
	ВидыОпераций.Вставить("ПоставкиЦенныхБумаг", "ПоставкаЦенныхБумаг");
	ВидыОпераций.Вставить("ОплатыВнебиржевыхСделок", "Оплата");
	ВидыОпераций.Вставить("ОплатыБиржевыхСделок", "Оплата");
	ВидыОпераций.Вставить("ИсполненияБиржевыхСделок", "ИсполнениеОбязательствПоСделке");
	ВидыОпераций.Вставить("ВариационнаяМаржа", "Маржа");
	ВидыОпераций.Вставить("ПереводыДенежныхСредств", "ПереводДенежныхСредств");
	ВидыОпераций.Вставить("НачисленияКомиссии", "НачислениеЗадолженности");
	ВидыОпераций.Вставить("ОплатыКомиссии", "Оплата");
	ВидыОпераций.Вставить("ОтменыСделок", "ОтменаСделки");
	ВидыОпераций.Вставить("ОплатыПоПогашениям", "Оплата");
	ВидыОпераций.Вставить("ОплатыПоВозвратуКупона", "Оплата");
	ВидыОпераций.Вставить("СписанияЦенныхБумаг", "СписаниеЦеннойБумаги");
	ВидыОпераций.Вставить("СделкиСПФИ", "СделкаСПФИ");
	ВидыОпераций.Вставить("МаржаСПФИ", "Маржа");
	
	Для Каждого ТаблицаОпераций Из ДанныеСФормы Цикл
	
		ВидОперации = ВидыОпераций.Получить(ТаблицаОпераций.Ключ);
		
		Если ТаблицаОпераций.Ключ = "БиржевыеСделки" Или ТаблицаОпераций.Ключ = "БиржевыеСделкиРЕПО1"
			Или ТаблицаОпераций.Ключ = "БиржевыеСделкиРЕПО2" Или ТаблицаОпераций.Ключ = "СделкиСВалютой"
			Или ТаблицаОпераций.Ключ = "ИсполненияБиржевыхСделок" 
				Тогда
			
			МассивНовыхДокументов = ТаблицаОпераций.Значение.НайтиСтроки(Новый Структура("Статус", "Новый"));
			
			Если МассивНовыхДокументов.Количество() > 0 Тогда
				
				Если ТаблицаНовыхДокументов.Количество() > 0 Тогда
					РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ТаблицаОпераций.Значение.Скопировать(МассивНовыхДокументов), ТаблицаНовыхДокументов);
				Иначе
					ТаблицаНовыхДокументов = ТаблицаОпераций.Значение.Скопировать(МассивНовыхДокументов);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
					
		Если ВидОперации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УстранитьРасхождения(ВидОперации, ТаблицаОпераций.Значение);
		
	КонецЦикла;
	
	Если ЭтотОбъект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") И ТаблицаНовыхДокументов.Количество() > 0 Тогда
		ОповеститьОНовыхБиржевыхОперациях(ТаблицаНовыхДокументов);	
	КонецЕсли;
			
КонецПроцедуры

Функция УстранитьРасхождения(ВидДокумента, Операции)
		
	Для каждого СтрокаОперации Из Операции Цикл
					
		НовыеРеквизиты = СтрокаОперации.НовыеРеквизиты.Получить();
		
		Если СтрокаОперации.Статус = "Расхождения в доп сведениях" Тогда
			
			РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(СтрокаОперации.Ссылка, "_РаскрытыйКонтрагент", НовыеРеквизиты.ДопСведения.РаскрытыйКонтрагент);
			Продолжить;
			
		ИначеЕсли СтрокаОперации.Статус = "Отсутствует" Тогда			
								
			Документ = СтрокаОперации.Ссылка.ПолучитьОбъект();
			
			Попытка
				
				Документ.УстановитьПометкуУдаления(Истина);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ помечен на удаление '" + Документ + "'");
				Продолжить;
				
			Исключение
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка установки пометки на удаление документа '" + ВидДокумента + "'. Система сообщает: " + ОписаниеОшибки());
				Продолжить;
				
			КонецПопытки;
			
		ИначеЕсли СтрокаОперации.Статус = "Новый" Тогда
			
			Документ = Документы[ВидДокумента].СоздатьДокумент();
			
			Документ.Комментарий   = "Создан аппаратно-техническими средствами " + ТекущаяДата();
			Документ.Ответственный = РаботаСПользователями.ТекущийПользователь();
						
		ИначеЕсли СтрокаОперации.Статус = "Есть расхождения" Тогда
			
			Документ = СтрокаОперации.Ссылка.ПолучитьОбъект();
			
		Иначе
			Продолжить;
		КонецЕсли;
						
		Для каждого НаборПолей Из НовыеРеквизиты Цикл
			
			Если НаборПолей.Ключ = "Шапка" Тогда
				
				ЗаполнитьЗначенияСвойств(Документ, НаборПолей.Значение);
				
			ИначеЕсли НаборПолей.Ключ = "ДопСведения" Тогда
				//запись в доп сведения осуществляется после записи сделки.	
			Иначе
				Документ[НаборПолей.Ключ].Очистить();
				
				Для каждого СтрокаНабора Из НаборПолей.Значение Цикл
					ЗаполнитьЗначенияСвойств(Документ[НаборПолей.Ключ].Добавить(), СтрокаНабора,, "НомерСтроки");
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Логика проведения:
		//1. Проводим все документы в Т-1
		//2. Если есть непроведенные биржевые операции в Т0 сообщаем об этом + вносим изменения (если есть) и пытаемся провести.
		//3. Если в проведенный документ в Т0 вносятся изменения и при этом документ не проводится (с внесенными изменениями) - не вносим изменения и оставляем проведенным со старыми данными.
		//4. Если в документ с датой больше Т0 вносим изменения и оставляем его в том состоянии, в котором он был до внесения изменения.
		
		ОшибкаПроведения = Ложь;
		ДокументПроведен = Документ.Проведен;
		
		//Если новый док - Первый раз пробуем провести. Во второй раз пробуем записать.
		//Если НЕ новый док не проводится после внесения изменений - оставляем проведенным без изменений.
		Пока Истина Цикл 
			
			НачатьТранзакцию();
						
			Если Документ.ПроверитьЗаполнение() И ДокументПроведен И Не ОшибкаПроведения Тогда
				
				Попытка
					Документ.Записать(РежимЗаписиДокумента.Проведение);
					Прервать;
				Исключение
					
					ОтменитьТранзакцию();
					ОшибкаПроведения = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ '" + ВидДокумента + "'. Система сообщает: " + ОписаниеОшибки());
					Продолжить;
					
				КонецПопытки;
				
			Иначе
				
				Попытка
					
					Если Документ.ЭтоНовый() Или Не ДокументПроведен Тогда
						
						Документ.Проведен = Ложь;
						Документ.Записать(РежимЗаписиДокумента.Запись);
						
					КонецЕсли;
					
				Исключение
					
					ОтменитьТранзакцию();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ '" + ВидДокумента + "'. Система сообщает: " + ОписаниеОшибки());
					
				КонецПопытки;
				
				Прервать;
					
			КонецЕсли;
			
		КонецЦикла;
								
		Если Не ТранзакцияАктивна() Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидДокумента = "Сделка" И НовыеРеквизиты.Свойство("ДопСведения") Тогда
			
			ТекущиеРеквизиты = СтрокаОперации.ТекущиеРеквизиты.Получить();
			
			Если ТекущиеРеквизиты = Неопределено Или ТекущиеРеквизиты.Свойство("ДопСведения") И НовыеРеквизиты.ДопСведения.Свойство("РаскрытыйКонтрагент") И НовыеРеквизиты.ДопСведения.РаскрытыйКонтрагент <> ТекущиеРеквизиты.ДопСведения.РаскрытыйКонтрагент Тогда
				РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Документ.Ссылка, "_РаскрытыйКонтрагент", НовыеРеквизиты.ДопСведения.РаскрытыйКонтрагент);	
			КонецЕсли;
		
		КонецЕсли;
					
		КодВоВнешнейСистеме = СтрокаОперации.КодВоВнешнейСистеме.Получить();
		
		Если ТипЗнч(КодВоВнешнейСистеме) = Тип("Структура") Тогда
			УстановитьПривилегированныйРежим(Истина);
			
			КодыДокументаВоВнешнейСистеме = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьНаборЗаписей();
			
			КодыДокументаВоВнешнейСистеме.Отбор.ВнешняяСистема.Установить(КодВоВнешнейСистеме.ВнешняяСистема);
			КодыДокументаВоВнешнейСистеме.Отбор.ГруппаОбъектов.Установить(КодВоВнешнейСистеме.ГруппаОбъектов);
			КодыДокументаВоВнешнейСистеме.Отбор.Объект.Установить(Документ.Ссылка);
			КодыДокументаВоВнешнейСистеме.Прочитать();
			
			Если КодыДокументаВоВнешнейСистеме.Количество() = 0 Тогда
				Запись = КодыДокументаВоВнешнейСистеме.Добавить();
				Запись.ВнешняяСистема = КодВоВнешнейСистеме.ВнешняяСистема;
				Запись.ГруппаОбъектов = КодВоВнешнейСистеме.ГруппаОбъектов;
				Запись.Объект         = Документ.Ссылка;
				Запись.Период         = Дата(1980, 1, 1);
				Запись.Код            = КодВоВнешнейСистеме.Код;
				
				КодыДокументаВоВнешнейСистеме.Записать();
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
			
		ЗафиксироватьТранзакцию();

	КонецЦикла;
	
КонецФункции

Процедура НайтиРасхожденияИУстановитьСтатус(НовыеРеквизиты, ТекущиеРеквизиты, Статус, ОшибкиЧтения, СтрокаРеквизитов = "")
	
	Статус = ?(Статус = "Ошибка чтения", Статус, "Нет расхождений");
	// Для нижеследующих реквизитов (в случае если не удалось определить значение по данным из файла), значение заполняем значениями текущих реквизитов. #219002
	ФильтрРеквизитов = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРеквизитов, ",", Истина, Истина);
	
	Для каждого КлючЗначение Из НовыеРеквизиты Цикл
		
		Если КлючЗначение.Ключ = "Шапка" Тогда // это структура
			
			Для Каждого Реквизит Из КлючЗначение.Значение Цикл
				
				Если ФильтрРеквизитов.Найти(Реквизит.Ключ) <> Неопределено Тогда//И ЗначениеЗаполнено(ТекущиеРеквизиты.Шапка[Реквизит.Ключ]) Тогда
					КлючЗначение.Значение[Реквизит.Ключ] = ТекущиеРеквизиты.Шапка[Реквизит.Ключ];
					Продолжить;
				КонецЕсли;
				
				Если Реквизит.Значение <> ТекущиеРеквизиты.Шапка[Реквизит.Ключ] И Статус <> "Ошибка чтения" Тогда
					Статус = "Есть расхождения";
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли КлючЗначение.Ключ = "ДопСведения" Тогда
			
			Для Каждого Реквизит Из КлючЗначение.Значение Цикл
				
				Если Реквизит.Значение <> ТекущиеРеквизиты.ДопСведения[Реквизит.Ключ] И Статус <> "Ошибка чтения" Тогда
					Статус = ?(Статус = "Есть расхождения", Статус, "Расхождения в доп сведениях");
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе // это табличная часть представленная массивом структур
			Если НовыеРеквизиты[КлючЗначение.Ключ].Количество() <> ТекущиеРеквизиты[КлючЗначение.Ключ].Количество() И Статус <> "Ошибка чтения" Тогда
				Статус = "Есть расхождения";
			КонецЕсли;
			
			Для Инд = 0 По НовыеРеквизиты[КлючЗначение.Ключ].Количество() - 1 Цикл
				НовыеРеквизитыТабЧасти   = НовыеРеквизиты[КлючЗначение.Ключ][Инд];
				
				//может поменяться количество строк в табл.части
				Попытка
					ТекущиеРеквизитыТабЧасти = ТекущиеРеквизиты[КлючЗначение.Ключ][Инд];
				Исключение
					Статус = ?(Статус = "Ошибка чтения", Статус, "Есть расхождения");
					Возврат;
				КонецПопытки;
				
				Для Каждого Реквизит Из НовыеРеквизитыТабЧасти Цикл
					
					Если ФильтрРеквизитов.Найти(КлючЗначение.Ключ + "." + Реквизит.Ключ) <> Неопределено Тогда
						
						Если Не ЗначениеЗаполнено(ТекущиеРеквизитыТабЧасти[Реквизит.Ключ]) Тогда
							
							Если Реквизит.Ключ = "ДепозитарныйСчет" Тогда 
								Статус = "Требуется ручной ввод";
								
								ТекстСообщения = "При импорте данных не удалось получить реквизит [" + Реквизит.Ключ + "]. Заполните [" + Реквизит.Ключ + "] и проведите документ."; 
								Если ОшибкиЧтения.Найти(ТекстСообщения) = Неопределено Тогда
									ОшибкиЧтения.Добавить(ТекстСообщения);
								КонецЕсли;
							КонецЕсли;
							
						ИначеЕсли Реквизит.Значение <> ТекущиеРеквизитыТабЧасти[Реквизит.Ключ] Тогда 
							
							НовыеРеквизитыТабЧасти[Реквизит.Ключ] = ТекущиеРеквизитыТабЧасти[Реквизит.Ключ];	
							
						КонецЕсли;
						
						Продолжить;
						
					КонецЕсли;
					
					Если Реквизит.Значение <> ТекущиеРеквизитыТабЧасти[Реквизит.Ключ] И Статус <> "Ошибка чтения" Тогда
						Статус = "Есть расхождения";
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ОповеститьОНовыхБиржевыхОперациях(ТаблицаНовыхОпераций)
	
	//Биржевые операции должны загружаться из QUIKа, если они загружаются из файла брокера - нам нужно об этом знать.
	ТаблицаСообщений = Новый ТаблицаЗначений;
	ТаблицаСообщений.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаСообщений.Колонки.Добавить("ТекстСообщения", Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаТаблицы Из ТаблицаНовыхОпераций Цикл
		
		НовыеРеквизиты = СтрокаТаблицы.НовыеРеквизиты.Получить();
		
		Если СтрНайти(СтрокаТаблицы.Описание, "РЕПО") > 0 Тогда
			НомерСделки = ?(НовыеРеквизиты.Шапка.НомерСделки = Неопределено, НовыеРеквизиты.Шапка.НомерСделкиСЦентральнымКонтрагентом, НовыеРеквизиты.Шапка.НомерСделки); 
			ТекстСообщения = "Сделка Репо № " + НомерСделки + ", режим торгов [" + НовыеРеквизиты.Шапка.РежимБиржевыхТоргов.Код + "]";
		ИначеЕсли СтрНайти(СтрокаТаблицы.Описание, "Бирж. сделка") > 0 Тогда
			ТекстСообщения = "Сделка № " + НовыеРеквизиты.Шапка.НомерСделки + ", режим торгов [" + НовыеРеквизиты.Шапка.РежимБиржевыхТоргов.Код + "]";
		ИначеЕсли СтрНайти(СтрокаТаблицы.Описание, "Сделка с валютой") > 0 И НовыеРеквизиты.Шапка.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
			ТекстСообщения = "Сделка с валютой № " + НовыеРеквизиты.Шапка.НомерСделки;
		ИначеЕсли СтрНайти(СтрокаТаблицы.описание, "Исполн. бирж. сделки") > 0 Тогда
			ТекстСообщения = "Исполнение по сделке № " + НовыеРеквизиты.Шапка.Основание.НомерСделки;
		Иначе
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТаблицыСообщений = ТаблицаСообщений.Добавить();
		НоваяСтрокаТаблицыСообщений.СчетДоверительногоУправления = НовыеРеквизиты.Шапка.СчетДоверительногоУправления;
		НоваяСтрокаТаблицыСообщений.ТекстСообщения = ТекстСообщения;
	
	КонецЦикла;
	
	Если ТаблицаСообщений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСообщений.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаСообщений.ТекстСообщения КАК ТекстСообщения
		|ПОМЕСТИТЬ _ТаблицаСообщений
		|ИЗ
		|	&ТаблицаСообщений КАК ТаблицаСообщений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаСообщений.ТекстСообщения КАК ТекстСообщения,
		|	 "", счет ДУ ["" + КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления.Наименование + ""], код у брокера ["" + КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код + ""]"" КАК ТекстДополнение
		|ИЗ
		|	_ТаблицаСообщений КАК _ТаблицаСообщений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Брокер = &Брокер
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_ТаблицаСообщений.СчетДоверительногоУправления
		|						ИЗ
		|							_ТаблицаСообщений)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО _ТаблицаСообщений.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления";
#КонецОбласти
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаИмпорта);
	Запрос.УстановитьПараметр("Брокер", ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион"));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ТаблицаСообщений", ТаблицаСообщений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСообщения = "";
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + Выборка.ТекстСообщения + Выборка.ТекстДополнение;	
	КонецЦикла;

	Если ТекстСообщения = "" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "При импорте операций из файла брокера на дату " + Формат(ЭтотОбъект.ДатаИмпорта, "ДЛФ=Д")  + " загружены новые биржевые сделки: " + ТекстСообщения;
	
	СформироватьОповещение("Импорт операции БК Регион. Уведомление о новых биржевых операциях.", ТекстСообщения);
	   	
КонецПроцедуры

Функция ПолучитьОписаниеПолейКомиссии()
	
	ПоляКомиссии = Новый Структура;
	
	ПоляКомиссии.Вставить("Operation_ID",                Новый ОписаниеТипов("Строка"));
	ПоляКомиссии.Вставить("Charge_ID",                   Новый ОписаниеТипов("Строка"));
	ПоляКомиссии.Вставить("Charge_Operation_ID",         Новый ОписаниеТипов("Строка"));
	ПоляКомиссии.Вставить("Operation_Time",              Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(8)));
	ПоляКомиссии.Вставить("Commission_Type_ID",          Новый ОписаниеТипов("Строка"));
	ПоляКомиссии.Вставить("Commission_Type",             Новый ОписаниеТипов("Строка"));
	ПоляКомиссии.Вставить("Client_Code",                 Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.Ресурсы.Код.Тип);
	ПоляКомиссии.Вставить("Briefcase_Code",              Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.Ресурсы.Код.Тип);
	ПоляКомиссии.Вставить("Deal_ID",                     Новый ОписаниеТипов("Строка"));
	ПоляКомиссии.Вставить("Deal_Number",                 Метаданные.Документы.Сделка.Реквизиты.НомерСделки.Тип);
	ПоляКомиссии.Вставить("Deal_Type",                   Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ПоляКомиссии.Вставить("Deal_Direction",              Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(1)));
	ПоляКомиссии.Вставить("Currency_Code",               Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(Метаданные.Справочники.Валюты.ДлинаКода)));
	ПоляКомиссии.Вставить("Amount",                      Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
	ПоляКомиссии.Вставить("Money_Account_Division_Type", Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.Ресурсы.Код.Тип);	
	ПоляКомиссии.Вставить("Security_ID",                 Новый ОписаниеТипов("Строка"));
	ПоляКомиссии.Вставить("Security_Type_Name",          Новый ОписаниеТипов("Строка"));
	
	Возврат ПоляКомиссии;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////
// ОТБР
Функция ИмпортироватьИзXMLФайлов_ФорматOTBR(ФайлыИмпорта, ТаблицаСделокРЕПО_М, ДанныеСФормы) Экспорт
		
	ТочностьЦеныЦеннойБумаги = Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");      
	
	Организация_ДК = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК");
	КонтролироватьНепроведенныеДокументы = ЭтотОбъект.Организация <> Организация_ДК;
	ИспользуютсяСоставныеКодыУБрокера = ЭтотОбъект.Организация = Организация_ДК
					Или ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ");
	
	Если ДанныеСФормы <> Неопределено Тогда
		ЗагрузитьОперации(ДанныеСФормы);	
	КонецЕсли;
	
	Макет = ЭтотОбъект.ПолучитьМакет("Схема_OTBR");

	ЧтениеСхемыOTBR = Новый ЧтениеXML;
	ЧтениеСхемыOTBR.УстановитьСтроку(Макет.ПолучитьТекст());
	
	ПостроительDOM = Новый ПостроительDOM;
	
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеСхемыOTBR);
	
	ПостроительСхемXML = Новый ПостроительСхемXML;
	СхемаXML = ПостроительСхемXML.СоздатьСхемуXML(ДокументDOM);
	
	НаборСхемXML = Новый НаборСхемXML;
	НаборСхемXML.Добавить(СхемаXML);
	
	СвояФабрикаXDTO = Новый ФабрикаXDTO(НаборСхемXML);
	ТипXDTO = СвояФабрикаXDTO.Тип("xmlns:xs=""xmlns:xs=""http://www.w3.org/2001/XMLSchema""", "Data");
	
	ИмяФайлаДанныхНаСервере = ПолучитьИмяВременногоФайла("xml");
		
	СтруктураВнешнихДанных = ПолучитьСтруктуруДанных();
	
	Для Каждого СтрокаФайловИмпорта Из ФайлыИмпорта Цикл
			
		СтрокаФайловИмпорта.ДанныеФайла.Записать(ИмяФайлаДанныхНаСервере);
		
		ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаДанныхНаСервере, КодировкаТекста.UTF8);
		СтрокаXML = ЧтениеТекста.Прочитать();
		СтрокаXML = СтрЗаменить(СтрокаXML, "<Data", "<Data xmlns:xs=""http://www.w3.org/2001/XMLSchema"" ");
		                                                                                              
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		
		ОбъектXDTO = СвояФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		
		Если ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO") Тогда
			
			ЗаполнитьСтруктуруДаннымиИзОбъектаXTDO(ОбъектXDTO, СтруктураВнешнихДанных, СтрокаФайловИмпорта.ИмяФайла, ИспользуютсяСоставныеКодыУБрокера);
											
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить объект XDTO");
			Возврат Неопределено;
		КонецЕсли;
		
		ЧтениеТекста.Закрыть();
	КонецЦикла;
	
	МВТ = Новый МенеджерВременныхТаблиц;
//Справочники
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РежимыБиржевыхТоргов.Ссылка КАК Ссылка,
		|	РежимыБиржевыхТоргов.Код КАК Код,
		|	РежимыБиржевыхТоргов.РЕПО КАК флагРепо,
		|	РежимыБиржевыхТоргов.Наименование КАК Наименование,
		|	РежимыБиржевыхТоргов.РежимПереговорныхСделок КАК РежимПереговорныхСделок,
		|	РежимыБиржевыхТоргов.ПервичноеРазмещение КАК ПервичноеРазмещение,
		|	РежимыБиржевыхТоргов.ВыкупЭмитентом КАК ВыкупЭмитентом,
		|	РежимыБиржевыхТоргов.Аукцион КАК Аукцион,
		|	ЛОЖЬ КАК РепоСЦК
		|ИЗ
		|	Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|ГДЕ
		|	НЕ РежимыБиржевыхТоргов.ПометкаУдаления";
	
	РежимыБиржевыхТоргов = Запрос.Выполнить().Выгрузить();
		
	Для Каждого СтрокаРежимов Из РежимыБиржевыхТоргов Цикл
		
		Если СтрокаРежимов.ФлагРепо = Истина И СтрНайти(СтрокаРежимов.Наименование, "с ЦК") > 0 Тогда
			СтрокаРежимов.РепоСЦК = Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПервыхУзлов.Ключ КАК Ключ,
		|	ДанныеПервыхУзлов.ФайлСоответствуетФормату КАК ФайлСоответствуетФормату
		|ПОМЕСТИТЬ _ДанныеПервыхУзлов
		|ИЗ
		|	&ДанныеПервыхУзлов КАК ДанныеПервыхУзлов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РежимыБиржевыхТоргов.Ссылка КАК Ссылка,
		|	РежимыБиржевыхТоргов.Код КАК Код,
		|	РежимыБиржевыхТоргов.РепоСЦК КАК РепоСЦК,
		|	РежимыБиржевыхТоргов.РежимПереговорныхСделок КАК РежимПереговорныхСделок,
		|	РежимыБиржевыхТоргов.ПервичноеРазмещение КАК ПервичноеРазмещение,
		|	РежимыБиржевыхТоргов.ВыкупЭмитентом КАК ВыкупЭмитентом,
		|	РежимыБиржевыхТоргов.Аукцион КАК Аукцион,
		|	РежимыБиржевыхТоргов.флагРепо КАК флагРепо
		|ПОМЕСТИТЬ _РежимыБиржевыхТоргов
		|ИЗ
		|	&РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Firms.ID КАК ID,
		|	Firms.Name_Official_Ru КАК Name_Official_Ru
		|ПОМЕСТИТЬ _Firms
		|ИЗ
		|	&Firms КАК Firms
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Bonds.ID КАК ID,
		|	Bonds.Code_MOEX КАК Code_MOEX,
		|	Bonds.Face_Value_Current КАК Face_Value_Current,
		|	Bonds.Currency КАК Currency
		|ПОМЕСТИТЬ _Bonds
		|ИЗ
		|	&Bonds КАК Bonds
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Shares.ID КАК ID,
		|	Shares.Code_MOEX КАК Code_MOEX
		|ПОМЕСТИТЬ _Shares
		|ИЗ
		|	&Shares КАК Shares
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Bills.ID КАК ID
		|ПОМЕСТИТЬ _Bills
		|ИЗ
		|	&Bills КАК Bills
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Derivatives.ID КАК ID,
		|	Derivatives.Code_FORTS КАК Code_FORTS,
		|	Derivatives.Type КАК Type,
		|	Derivatives.Date_Execution КАК Date_Execution
		|ПОМЕСТИТЬ _Derivatives
		|ИЗ
		|	&Derivatives КАК Derivatives
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	DRs.ID КАК ID,
		|	DRs.Code_MOEX КАК Code_MOEX
		|ПОМЕСТИТЬ _DRs
		|ИЗ
		|	&DRs КАК DRs
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Funds.ID КАК ID,
		|	Funds.Code_MOEX КАК Code_MOEX,
		|	Funds.Type КАК Type
		|ПОМЕСТИТЬ _FundsAll
		|ИЗ
		|	&Funds КАК Funds
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Funds.ID КАК ID,
		|	Funds.Code_MOEX КАК Code_MOEX
		|ПОМЕСТИТЬ _Funds
		|ИЗ
		|	_FundsAll КАК Funds
		|ГДЕ
		|	Funds.Type <> ""Securities.Type.Funds.Clearing""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Serts.ID КАК ID,
		|	Serts.Code_MOEX КАК Code_MOEX
		|ПОМЕСТИТЬ _Serts
		|ИЗ
		|	_FundsAll КАК Serts
		|ГДЕ
		|	Serts.Type = ""Securities.Type.Funds.Clearing""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Currencies.ID КАК ID,
		|	Currencies.ISO_Code КАК ISO_Code
		|ПОМЕСТИТЬ _Currencies
		|ИЗ
		|	&Currencies КАК Currencies
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Bonds.ID КАК ID,
		|	_Bonds.Code_MOEX КАК Code,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации) КАК ГруппаИмпорта
		|ПОМЕСТИТЬ _ЦенныеБумагиИзФайлаИмпорта
		|ИЗ
		|	_Bonds КАК _Bonds
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Shares.ID,
		|	_Shares.Code_MOEX,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)
		|ИЗ
		|	_Shares КАК _Shares
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Bills.ID,
		|	"""",
		|	ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Векселя)
		|ИЗ
		|	_Bills КАК _Bills
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Derivatives.ID,
		|	_Derivatives.Code_FORTS,
		|	ВЫБОР
		|		КОГДА _Derivatives.Type В (""Securities.Type.Derivatives.Future"", ""Securities.Type.Derivatives.Option"")
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПроизводныеФинансовыеИнструменты)
		|	КОНЕЦ
		|ИЗ
		|	_Derivatives КАК _Derivatives
		|ГДЕ
		|	_Derivatives.Type <> ""Securities.Type.Derivatives.IRS""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Currencies.ID,
		|	"""",
		|	ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты)
		|ИЗ
		|	_Currencies КАК _Currencies
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_DRs.ID,
		|	_DRs.Code_MOEX,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ДепозитарныеРасписки)
		|ИЗ
		|	_DRs КАК _DRs
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Funds.ID,
		|	_Funds.Code_MOEX,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Паи)
		|ИЗ
		|	_Funds КАК _Funds
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Serts.ID,
		|	_Serts.Code_MOEX,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ИпотечныеСертификатыУчастия)
		|ИЗ
		|	_Serts КАК _Serts
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов,
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _ДанныеРегистра
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Дата,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|				И (ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Векселя)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПроизводныеФинансовыеИнструменты)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ДепозитарныеРасписки)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Паи)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ИпотечныеСертификатыУчастия)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.МестаХранения)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица))) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)
		|				ТОГДА ВЫРАЗИТЬ(КодыВоВнешнихСистемахСрезПоследних.Объект КАК Справочник.Акции).ДатаАннулирования >= &Дата
		|						ИЛИ ВЫРАЗИТЬ(КодыВоВнешнихСистемахСрезПоследних.Объект КАК Справочник.Акции).ДатаАннулирования = ДАТАВРЕМЯ(1, 1, 1)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумагиИзФайлаИмпорта.ID КАК Matrix_ID,
		|	_ЦенныеБумагиИзФайлаИмпорта.Code КАК Code,
		|	_ЦенныеБумагиИзФайлаИмпорта.ГруппаИмпорта КАК ГруппаИмпорта,
		|	_ДанныеРегистра.ГруппаОбъектов КАК ГруппаОбъектов,
		|	_ДанныеРегистра.Объект КАК Ссылка,
		|	ВЫБОР
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.Акции
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.Векселя
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.Закладные
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Закладные)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.Облигации
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.Паи
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|					КОГДА ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|					КОГДА ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Спот)
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипБазовогоАктива = ЗНАЧЕНИЕ(Перечисление.ТипыБазовыхАктивов.ВалютнаяПара)
		|									ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары)
		|								КОГДА ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипБазовогоАктива = ЗНАЧЕНИЕ(Перечисление.ТипыБазовыхАктивов.ДрагоценныйМеталл)
		|									ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы)
		|							КОНЕЦ
		|				КОНЕЦ
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.ВалютныеПары
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары)
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.Доли
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Рынок,
		|	ВЫБОР
		|		КОГДА _ДанныеРегистра.Объект ССЫЛКА Справочник.Акции
		|				ИЛИ _ДанныеРегистра.Объект ССЫЛКА Справочник.Облигации
		|				ИЛИ _ДанныеРегистра.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА _ДанныеРегистра.Объект.Эмитент.ЮрФизЛицо
		|	КОНЕЦ КАК ЭмитентЮрФизЛицо
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ЦенныеБумагиИзФайлаИмпорта КАК _ЦенныеБумагиИзФайлаИмпорта
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _ЦенныеБумагиИзФайлаИмпорта.ID = _ДанныеРегистра.Код
		|			И (НЕ _ДанныеРегистра.ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.МестаХранения), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Currencies.ID КАК Matrix_ID,
		|	ЕСТЬNULL(_Currencies.ISO_Code, ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.Валюты).Наименование) КАК ISO_Code,
		|	ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.Валюты).Код КАК ЧисловойКод,
		|	ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.Валюты).Ссылка КАК Валюта
		|ПОМЕСТИТЬ _Валюты
		|ИЗ
		|	_ДанныеРегистра КАК _ДанныеРегистра
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Currencies КАК _Currencies
		|		ПО _ДанныеРегистра.Код = _Currencies.ID
		|ГДЕ
		|	_ДанныеРегистра.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеРегистра.ГруппаОбъектов КАК ГруппаОбъектов,
		|	ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.МестаХранения).Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА _ДанныеРегистра.Код = ""ММВБ Т+""
		|			ТОГДА ""MICEX""
		|		КОГДА _ДанныеРегистра.Код = ""ММВБ FX""
		|			ТОГДА ""MOEX.FX""
		|		КОГДА _ДанныеРегистра.Код = ""ММВБ FORTS""
		|			ТОГДА ""FORTS""
		|		КОГДА _ДанныеРегистра.Код = ""Внебиржевой""
		|			ТОГДА ""OTC""
		|	КОНЕЦ КАК Код
		|ПОМЕСТИТЬ _МестаХраненияДенежныхСредств
		|ИЗ
		|	_ДанныеРегистра КАК _ДанныеРегистра
		|ГДЕ
		|	_ДанныеРегистра.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.МестаХранения)
		|	И ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.МестаХранения).ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Firms.ID КАК Firm_ID,
		|	_Firms.Name_Official_Ru КАК Name_Official_Ru,
		|	ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.ЮрФизЛица).Ссылка КАК КонтрагентСсылка
		|ПОМЕСТИТЬ _Контрагенты
		|ИЗ
		|	_Firms КАК _Firms
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _Firms.ID = _ДанныеРегистра.Код
		|			И (_ДанныеРегистра.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.Matrix_ID КАК Matrix_ID,
		|	_ЦенныеБумаги.ГруппаИмпорта КАК ГруппаИмпорта
		|ПОМЕСТИТЬ _НовыеЦенныеБумаги
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|ГДЕ
		|	_ЦенныеБумаги.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Валюты.Matrix_ID КАК Matrix_ID,
		|	_Валюты.ISO_Code КАК ISO_Code
		|ПОМЕСТИТЬ _ОшибкиОпределенияВалюты
		|ИЗ
		|	_Валюты КАК _Валюты
		|ГДЕ
		|	_Валюты.Валюта ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПервыхУзлов.Ключ КАК Ключ,
		|	_ДанныеПервыхУзлов.ФайлСоответствуетФормату КАК ФайлСоответствуетФормату
		|ПОМЕСТИТЬ _ФайлыСоответствующиеФормату
		|ИЗ
		|	_ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|ГДЕ
		|	_ДанныеПервыхУзлов.ФайлСоответствуетФормату
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Shares
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Bills
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _DRs
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Funds
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _FundsAll
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Serts
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Currencies
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Firms
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЦенныеБумагиИзФайлаИмпорта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДанныеРегистра";
#КонецОбласти

	//добавить валютные пары
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ДатаИмпорта);
	Запрос.УстановитьПараметр("Bonds", СтруктураВнешнихДанных.Bonds);
	Запрос.УстановитьПараметр("Shares", СтруктураВнешнихДанных.Shares);
	Запрос.УстановитьПараметр("Bills", СтруктураВнешнихДанных.Bills);
	Запрос.УстановитьПараметр("Derivatives", СтруктураВнешнихДанных.Derivatives);
	Запрос.УстановитьПараметр("DRs", СтруктураВнешнихДанных.DRs);
	Запрос.УстановитьПараметр("Funds", СтруктураВнешнихДанных.Funds);
	Запрос.УстановитьПараметр("Currencies", СтруктураВнешнихДанных.Currencies);
	Запрос.УстановитьПараметр("Firms", СтруктураВнешнихДанных.Firms);
	Запрос.УстановитьПараметр("ДанныеПервыхУзлов", СтруктураВнешнихДанных.ДанныеПервыхУзлов);
	Запрос.УстановитьПараметр("РежимыБиржевыхТоргов", РежимыБиржевыхТоргов);
	
	Запрос.Выполнить();
	
	ВыборкаНовыхЦенныхБумаг = МВТ.Таблицы["_НовыеЦенныеБумаги"].ПолучитьДанные().Выбрать();
	
	ЗагруженыНовыеЦенныеБумаги = Ложь;
	
	Пока ВыборкаНовыхЦенныхБумаг.Следующий() Цикл
		
		Если ВыборкаНовыхЦенныхБумаг.ГруппаИмпорта = Справочники.ГруппыИмпортируемыхОбъектов.Валюты Тогда
			Продолжить;
		ИначеЕсли ВыборкаНовыхЦенныхБумаг.ГруппаИмпорта = Справочники.ГруппыИмпортируемыхОбъектов.ПустаяСсылка() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить группу импортируемых объектов для ценной бумаги [Derivatives]. Код [" + ВыборкаНовыхЦенныхБумаг.Matrix_ID + "].");	
		Иначе
			
			ЗагрузитьЦеннуюБумагу(ВыборкаНовыхЦенныхБумаг.Matrix_ID, ВыборкаНовыхЦенныхБумаг.ГруппаИмпорта);
			ЗагруженыНовыеЦенныеБумаги = Истина;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если ЗагруженыНовыеЦенныеБумаги Тогда
		
		МВТ = Новый МенеджерВременныхТаблиц; // после того как загруженны ценные бумаги еще раз выполняем запрос.
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Выполнить();
	
	КонецЕсли;
		
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСделокРЕПО_М, "_ТаблицаСделокРЕПО_М", МВТ, , , , "НомерСделки, ЧастьСделкиРЕПО");
		
	ВыборкаОшибокОпределнияВалюты = МВТ.Таблицы["_ОшибкиОпределенияВалюты"].ПолучитьДанные().Выбрать();	
		
	Пока ВыборкаОшибокОпределнияВалюты.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В регистре [Коды во внешних системах] не найдена валюта [" + ВыборкаОшибокОпределнияВалюты.ISO_Code + "] по коду [" + ВыборкаОшибокОпределнияВалюты.Matrix_ID + "].");	
	КонецЦикла;
		
	Если МВТ.Таблицы["_ФайлыСоответствующиеФормату"].ПолучитьДанные().Пустой() Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В папке [" + ЭтотОбъект.КаталогФайловОТБР + "] отсутствуют файлы соответствующие параметрам импорта.");	
		Возврат Неопределено;
	КонецЕсли;	
	
//Счета ДУ, депозитарные счета	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления).Ссылка КАК Счет
		|ПОМЕСТИТЬ _СчетаИсключеныИзЗагрузки
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект ССЫЛКА Справочник.СчетаДоверительногоУправления
		|	И ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления).Организация = &Организация
		|	И ЗначенияДополнительныхСведений.Свойство.Ключ = &Ключ
		|	И ЗначенияДополнительныхСведений.Значение = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетаДоверительногоУправления.Ссылка
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.Ссылка В (&НеопределенныеСчета)
		|			ИЛИ &ОтборОчередьЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация КАК Организация,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК КодДляСверкиОпераций,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения КАК ДатаРасторженияСчета,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключенияСчета,
		|	ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРасторженияДоговора,
		|	ВЫБОР
		|		КОГДА _СчетаИсключеныИзЗагрузки.Счет ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИсключенИзЗагрузки
		|ПОМЕСТИТЬ _КодыСчетовУБрокера
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Дата, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = _СчетаИсключеныИзЗагрузки.Счет";
#КонецОбласти

	НепоределенныеСчета = Новый Массив;
	НепоределенныеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Неопределен_Траст"));
	НепоределенныеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Неопределен_РЭМ"));
	
	Запрос.УстановитьПараметр("Ключ", "УчетНеВедется");
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("НеопределенныеСчета", НепоределенныеСчета);
	
	Если ЭтотОбъект.ОчередьЗагрузки = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборОчередьЗагрузки", "ЛОЖЬ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборОчередьЗагрузки", "НЕ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровСчетовДУ)");
		Запрос.УстановитьПараметр("ВидыДоговоровСчетовДУ", РаботаСВнешнимиСистемами.ПолучитьВидыДоговорДоверительногоУправленияДляОчереди(ЭтотОбъект.Организация, ЭтотОбъект.ОчередьЗагрузки));
	КонецЕсли;
	
	Запрос.Выполнить();

	ТаблицаКодов = МВТ.Таблицы["_КодыСчетовУБрокера"].ПолучитьДанные().Выгрузить();
		
	//У клиента Югория (ДК Регион) и у Юпитера в УКПИ несколько договоров с брокером.
	//Решили записать все коды клиента в одной записи через запятую.
	Если ИспользуютсяСоставныеКодыУБрокера Тогда
		
		Для Каждого СтрокаТаблицыКодов Из ТаблицаКодов Цикл
			
			Если СтрНайти(СтрокаТаблицыКодов.Код, ",") > 0 Тогда
				
				МассивКодовКлиента = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТаблицыКодов.Код, ",", Истина, Истина);
				
				Для Каждого КодКлиента Из МассивКодовКлиента Цикл
					
					Если МассивКодовКлиента.Найти(КодКлиента) = 0 Тогда
						СтрокаТаблицыКодов.Код = КодКлиента;
						Продолжить;
					КонецЕсли;
					
					НоваяСтрокаТаблицыКодов = ТаблицаКодов.Добавить();
					НоваяСтрокаТаблицыКодов.Организация                  = СтрокаТаблицыКодов.Организация;
					НоваяСтрокаТаблицыКодов.СчетДоверительногоУправления = СтрокаТаблицыКодов.СчетДоверительногоУправления;
					НоваяСтрокаТаблицыКодов.Брокер                       = СтрокаТаблицыКодов.Брокер;
					НоваяСтрокаТаблицыКодов.Код                          = КодКлиента;
					НоваяСтрокаТаблицыКодов.ДатаРасторженияСчета         = СтрокаТаблицыКодов.ДатаРасторженияСчета; 
					НоваяСтрокаТаблицыКодов.ДатаЗаключенияСчета          = СтрокаТаблицыКодов.ДатаЗаключенияСчета; 
					НоваяСтрокаТаблицыКодов.ИсключенИзЗагрузки           = СтрокаТаблицыКодов.ИсключенИзЗагрузки;
					НоваяСтрокаТаблицыКодов.ДатаРасторженияДоговора      = СтрокаТаблицыКодов.ДатаРасторженияДоговора;
					НоваяСтрокаТаблицыКодов.КодДляСверкиОпераций         = СтрокаТаблицыКодов.КодДляСверкиОпераций;
					
				КонецЦикла;
								
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаКодов.Организация КАК Организация,
		|	_ТаблицаКодов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ТаблицаКодов.Брокер КАК Брокер,
		|	_ТаблицаКодов.Код КАК Код,
		|	_ТаблицаКодов.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	_ТаблицаКодов.ДатаРасторженияСчета КАК ДатаРасторженияСчета, 
		|	_ТаблицаКодов.ДатаЗаключенияСчета КАК ДатаЗаключенияСчета,
		|	_ТаблицаКодов.ДатаРасторженияДоговора КАК ДатаРасторженияДоговора,
		|	_ТаблицаКодов.ИсключенИзЗагрузки
		|ПОМЕСТИТЬ _КодыСчетов
		|ИЗ
		|	&ТаблицаКодов КАК _ТаблицаКодов
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Accounts.ID КАК ID,
		|	Accounts.Firm_ID КАК Firm_ID,
		|	Accounts.Partner_ID КАК Partner_ID,
		|	Accounts.Agreement_ID КАК Agreement_ID,
		|	Accounts.Number КАК Number,
		|	Accounts.Type КАК Type,
		|	Accounts.Sub_Type КАК Sub_Type,
		|	Accounts.Ключ КАК Ключ
		|ПОМЕСТИТЬ _Accounts
		|ИЗ
		|	&Accounts КАК Accounts
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Accounts_Divisions.ID КАК ID,
		|	Accounts_Divisions.Account_ID КАК Account_ID,
		|	Accounts_Divisions.Number КАК Number,
		|	Accounts_Divisions.Секция КАК Секция
		|ПОМЕСТИТЬ _Accounts_Divisions
		|ИЗ
		|	&Accounts_Divisions КАК Accounts_Divisions
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Accounts.Ключ КАК Ключ,
		|	_Accounts_Divisions.ID КАК Account_Division_ID,
		|	_Accounts_Divisions.Account_ID КАК Account_ID,
		|	_Accounts_Divisions.Number КАК Account_Division_Number,
		|	_Accounts_Divisions.Секция КАК Секция,
		|	_КодыСчетов.Организация КАК Организация,
		|	_КодыСчетов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетов.ДатаРасторженияСчета КАК ДатаРасторженияСчета,
		|	_КодыСчетов.ДатаЗаключенияСчета КАК ДатаЗаключенияСчета,
		|	_КодыСчетов.ДатаРасторженияДоговора КАК ДатаРасторженияДоговора,
		|	_КодыСчетов.Брокер КАК Брокер,
		|	_КодыСчетов.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	_КодыСчетов.ИсключенИзЗагрузки КАК ИсключенИзЗагрузки
		|ПОМЕСТИТЬ _КодыСчетовВнутреннегоУчетаСКлючами
		|ИЗ
		|	_Accounts КАК _Accounts
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Accounts.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Accounts_Divisions КАК _Accounts_Divisions
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетов КАК _КодыСчетов
		|			ПО _Accounts_Divisions.Number = _КодыСчетов.Код
		|		ПО _Accounts.ID = _Accounts_Divisions.Account_ID
		|
		|ГДЕ
		|	_Accounts.Type = ""Accounts.Type.Investment""
		|	И НЕ _Accounts_Divisions.Number ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Account_Division_ID КАК Account_Division_ID,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Account_ID КАК Account_ID,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Account_Division_Number КАК Account_Division_Number,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.ДатаРасторженияСчета КАК ДатаРасторженияСчета,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.ДатаРасторженияДоговора КАК ДатаРасторженияДоговора,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Ключ КАК Ключ
		|ПОМЕСТИТЬ _ИстекшиеДоговора
		|ИЗ
		|	_КодыСчетовВнутреннегоУчетаСКлючами КАК _КодыСчетовВнутреннегоУчетаСКлючами
		|ГДЕ
		|	_КодыСчетовВнутреннегоУчетаСКлючами.СчетДоверительногоУправления ЕСТЬ NULL
		|		ИЛИ (_КодыСчетовВнутреннегоУчетаСКлючами.ДатаРасторженияСчета < &Дата И _КодыСчетовВнутреннегоУчетаСКлючами.ДатаРасторженияСчета <> ДАТАВРЕМЯ(1, 1, 1))
		|		ИЛИ (НЕ &ИспользуютсяСоставныеКодыУБрокера И _КодыСчетовВнутреннегоУчетаСКлючами.ДатаРасторженияДоговора < &Дата И _КодыСчетовВнутреннегоУчетаСКлючами.ДатаРасторженияДоговора <> ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Account_Division_ID КАК Account_Division_ID,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Account_ID КАК Account_ID,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Account_Division_Number КАК Account_Division_Number,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Секция КАК Секция,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Организация КАК Организация,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.ДатаЗаключенияСчета КАК ДатаЗаключенияСчета,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.Брокер КАК Брокер,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	_КодыСчетовВнутреннегоУчетаСКлючами.ИсключенИзЗагрузки КАК ИсключенИзЗагрузки
		|ПОМЕСТИТЬ _КодыСчетовВнутреннегоУчета
		|ИЗ
		|	_КодыСчетовВнутреннегоУчетаСКлючами КАК _КодыСчетовВнутреннегоУчетаСКлючами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоЦеннымБумагам.Организация КАК Организация,
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет КАК Счет,
		|	ВЫБОР
		|		КОГДА КодыВоВнешнихСистемахСрезПоследних.Код ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Основной)
		|							И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий = &ДБК_Регион
		|						ТОГДА ""Основной в НРД""
		|					КОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение)
		|						ТОГДА ""Касса Векселя""
		|					КОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|							И ПОДСТРОКА(ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.НомерСчета, 1, 2) = ""36""
		|							И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий <> &ДБК_Регион
		|						ТОГДА ""СпецДЕП Т+""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ КодыВоВнешнихСистемахСрезПоследних.Код
		|	КОНЕЦ КАК КодДепозитарногоСчета,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_ID КАК Account_Division_ID
		|ПОМЕСТИТЬ _ВсеДепозитарныеСчета
		|ИЗ
		|	_КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|					&Дата,
		|					ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ОтчетБрокераБКРегион)
		|						И ГруппаОбъектов = &ГруппаОбъектов) КАК КодыВоВнешнихСистемахСрезПоследних
		|			ПО ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет = КодыВоВнешнихСистемахСрезПоследних.Объект
		|		ПО _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления = ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления
		|			И _КодыСчетовВнутреннегоУчета.Организация = ИсполнителиПоЦеннымБумагам.Организация
		|ГДЕ
		|	(ИсполнителиПоЦеннымБумагам.ДатаЗакрытия > &Дата
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|	И (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаОткрытия <= &Дата
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1))
		|	И ИсполнителиПоЦеннымБумагам.Организация = &Организация
		|	И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Брокер В (&Брокер, ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка))
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.КодДепозитарногоСчета КАК КодДепозитарногоСчета,
		|	ВложенныйЗапрос.Account_Division_ID КАК Account_Division_ID,
		|	ВложенныйЗапрос.КоличествоСчетов КАК КоличествоСчетов,
		|	_ВсеДепозитарныеСчета.Счет КАК Счет
		|ПОМЕСТИТЬ _ДепозитарныеСчета
		|ИЗ
		|	_КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ВсеДепозитарныеСчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ВсеДепозитарныеСчета.КодДепозитарногоСчета КАК КодДепозитарногоСчета,
		|			_ВсеДепозитарныеСчета.Account_Division_ID КАК Account_Division_ID,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеДепозитарныеСчета.Счет) КАК КоличествоСчетов,
		|			_ВсеДепозитарныеСчета.Организация КАК Организация
		|		ИЗ
		|			_ВсеДепозитарныеСчета КАК _ВсеДепозитарныеСчета
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ВсеДепозитарныеСчета.СчетДоверительногоУправления,
		|			_ВсеДепозитарныеСчета.КодДепозитарногоСчета,
		|			_ВсеДепозитарныеСчета.Account_Division_ID,
		|			_ВсеДепозитарныеСчета.Организация) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеДепозитарныеСчета КАК _ВсеДепозитарныеСчета
		|			ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеДепозитарныеСчета.СчетДоверительногоУправления
		|				И ВложенныйЗапрос.Account_Division_ID = _ВсеДепозитарныеСчета.Account_Division_ID
		|				И ВложенныйЗапрос.КодДепозитарногоСчета = _ВсеДепозитарныеСчета.КодДепозитарногоСчета
		|				И (ВложенныйЗапрос.КоличествоСчетов = 1)
		|		ПО _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _КодыСчетовВнутреннегоУчета.Account_Division_ID = ВложенныйЗапрос.Account_Division_ID
		|			И (ВложенныйЗапрос.КодДепозитарногоСчета <> """")
		|			И (_КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Accounts
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Accounts_Divisions
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КодыСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВсеДепозитарныеСчета";
#КонецОбласти
	
	Запрос.УстановитьПараметр("ДБК_Регион", ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_БК_Регион"));
	Запрос.УстановитьПараметр("ГруппаОбъектов", Справочники.ГруппыИмпортируемыхОбъектов.ДепозитарныеСчета);
	Запрос.УстановитьПараметр("Accounts", СтруктураВнешнихДанных.Accounts);
	Запрос.УстановитьПараметр("Accounts_Divisions", СтруктураВнешнихДанных.Accounts_Divisions);
	Запрос.УстановитьПараметр("ТаблицаКодов", ТаблицаКодов);
	Запрос.УстановитьПараметр("ИспользуютсяСоставныеКодыУБрокера", ИспользуютсяСоставныеКодыУБрокера);
		
	Запрос.Выполнить();
	
	ВыборкаИстекшихДоговоров = МВТ.Таблицы["_ИстекшиеДоговора"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаИстекшихДоговоров.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаИстекшихДоговоров.СчетДоверительногоУправления) Тогда
			
			Если ЗначениеЗаполнено(ВыборкаИстекшихДоговоров.ДатаРасторженияСчета) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле [" + ВыборкаИстекшихДоговоров.Ключ  + "] присутствуют данные счета ДУ [" + ВыборкаИстекшихДоговоров.СчетДоверительногоУправления + "], у которого истек срок действия договора доверительного управления [" + Формат(ВыборкаИстекшихДоговоров.ДатаРасторженияСчета, "ДФ=dd.MM.yyyy") + " г.]");	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаИстекшихДоговоров.ДатаРасторженияДоговора) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле [" + ВыборкаИстекшихДоговоров.Ключ  + "] присутствуют данные счета ДУ [" + ВыборкаИстекшихДоговоров.СчетДоверительногоУправления + "], у которого истек срок действия договора с брокером [" + Формат(ВыборкаИстекшихДоговоров.ДатаРасторженияДоговора, "ДФ=dd.MM.yyyy") + " г.]");	
			КонецЕсли;
				
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В регистре [Коды счетов ДУ у брокера] не найден счет ДУ по коду [" + ВыборкаИстекшихДоговоров.Account_Division_Number + "]. Матрикс ID счета [" + ВыборкаИстекшихДоговоров.Account_ID + "], матрикс ID портфеля [" + ВыборкаИстекшихДоговоров.Account_Division_ID + "]. Файл [" + ВыборкаИстекшихДоговоров.Ключ + "]");	
		КонецЕсли;
			
	КонецЦикла;
	
//Операции

#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Deals.Record_UID КАК Record_UID,
	    |	Deals.Market КАК Market,
	    |	Deals.Market_Board КАК Market_Board,
	    |	Deals.Market_Number КАК Market_Number,
	    |	Deals.Market_Order_Number КАК Market_Order_Number,
	    |	Deals.Is_Market_Maker КАК Is_Market_Maker,
	    |	Deals.Date КАК Date,
	    |	Deals.Time КАК Time,
	    |	Deals.Operation_Type КАК Operation_Type,
	    |	Deals.Direction КАК Direction,
	    |	Deals.Currency КАК Currency,
	    |	Deals.Payment_Currency КАК Payment_Currency,
	    |	Deals.Payment_Rate_Base КАК Payment_Rate_Base,
	    |	Deals.Is_Payment_Rate_Fixed КАК Is_Payment_Rate_Fixed,
	    |	Deals.Is_Payment_Rate_Inverted КАК Is_Payment_Rate_Inverted,
	    |	Deals.Payment_Rate КАК Payment_Rate,
	    |	Deals.Payment_Date КАК Payment_Date,
	    |	Deals.Delivery_Date КАК Delivery_Date,
	    |	Deals.Money_Storage_Place КАК Money_Storage_Place,
	    |	Deals.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	Deals.SE_Charge_Amount КАК SE_Charge_Amount,
	    |	Deals.SE_Charge_Date КАК SE_Charge_Date,
	    |	Deals.PSA_Settlement_Type КАК PSA_Settlement_Type,
	    |	Deals.Far_Execution_Date КАК Far_Execution_Date,
	    |	Deals.Far_Interest_Rate КАК Far_Interest_Rate,
	    |	Deals.Is_Deal_Info КАК Is_Deal_Info,
	    |	Deals.Deal_Info_Type КАК Deal_Info_Type,
	    |	Deals.Reason_Type КАК Reason_Type,
	    |	Deals.Is_Cancelled КАК Is_Cancelled,
	    |	Deals.Date_Cancelled КАК Date_Cancelled,
	    |	Deals.Time_Cancelled КАК Time_Cancelled,
	    |	Deals.Order_Number КАК Order_Number,
	    |	Deals.Order_Date КАК Order_Date,
	    |	Deals.Parent_Order_Number КАК Parent_Order_Number,
	    |	Deals.Parent_Order_Date КАК Parent_Order_Date,
	    |	Deals.Near_Deal_Record_UID КАК Near_Deal_Record_UID,
	    |	Deals.Parent_Record_UID КАК Parent_Record_UID,
	    |	Deals.Is_Not_Confirmed КАК Is_Not_Confirmed,
	    |	Deals.Is_Outer_Broker_Execution КАК Is_Outer_Broker_Execution,
	    |	Deals.Partner_ID КАК Partner_ID,
	    |	Deals.SettleCode КАК SettleCode,
	    |	Deals.External_Reference КАК External_Reference,
	    |	Deals.Parent_External_Reference КАК Parent_External_Reference,
	    |	Deals.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _Deals
	    |ИЗ
	    |	&Deals КАК Deals
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Deals_Details.Record_UID КАК Record_UID,
	    |	Deals_Details.Parent_Record_UID КАК Parent_Record_UID,
	    |	Deals_Details.Security_ID КАК Security_ID,
	    |	Deals_Details.Price КАК Price,
	    |	Deals_Details.Price_Points КАК Price_Points,
	    |	Deals_Details.Volume КАК Volume,
	    |	Deals_Details.Amount КАК Amount,
	    |	Deals_Details.ACI_Amount КАК ACI_Amount,
	    |	Deals_Details.Margin_Amount КАК Margin_Amount,
	    |	Deals_Details.Payment_Amount КАК Payment_Amount,
	    |	Deals_Details.Payment_ACI_Amount КАК Payment_ACI_Amount,
	    |	Deals_Details.Payment_Margin_Amount КАК Payment_Margin_Amount,
	    |	Deals_Details.Far_Price КАК Far_Price,
	    |	Deals_Details.Far_Amount КАК Far_Amount,
	    |	Deals_Details.Far_ACI_Amount КАК Far_ACI_Amount,
	    |	Deals_Details.Account_Division_ID КАК Account_Division_ID,
	    |	Deals_Details.Price_Percent КАК Price_Percent
	    |ПОМЕСТИТЬ _Deals_Details
	    |ИЗ
	    |	&Deals_Details КАК Deals_Details
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Deals_Incomplete.Record_UID КАК Record_UID,
	    |	Deals_Incomplete.Market КАК Market,
	    |	Deals_Incomplete.Market_Board КАК Market_Board,
	    |	Deals_Incomplete.Market_Number КАК Market_Number,
	    |	Deals_Incomplete.Market_Order_Number КАК Market_Order_Number,
	    |	Deals_Incomplete.Is_Market_Maker КАК Is_Market_Maker,
	    |	Deals_Incomplete.Date КАК Date,
	    |	Deals_Incomplete.Time КАК Time,
	    |	Deals_Incomplete.Operation_Type КАК Operation_Type,
	    |	Deals_Incomplete.Direction КАК Direction,
	    |	Deals_Incomplete.Currency КАК Currency,
	    |	Deals_Incomplete.Payment_Currency КАК Payment_Currency,
	    |	Deals_Incomplete.Payment_Rate_Base КАК Payment_Rate_Base,
	    |	Deals_Incomplete.Is_Payment_Rate_Fixed КАК Is_Payment_Rate_Fixed,
	    |	Deals_Incomplete.Is_Payment_Rate_Inverted КАК Is_Payment_Rate_Inverted,
	    |	Deals_Incomplete.Payment_Rate КАК Payment_Rate,
	    |	Deals_Incomplete.Payment_Date КАК Payment_Date,
	    |	Deals_Incomplete.Delivery_Date КАК Delivery_Date,
	    |	Deals_Incomplete.Money_Storage_Place КАК Money_Storage_Place,
	    |	Deals_Incomplete.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	Deals_Incomplete.SE_Charge_Amount КАК SE_Charge_Amount,
	    |	Deals_Incomplete.SE_Charge_Date КАК SE_Charge_Date,
	    |	Deals_Incomplete.PSA_Settlement_Type КАК PSA_Settlement_Type,
	    |	Deals_Incomplete.Far_Execution_Date КАК Far_Execution_Date,
	    |	Deals_Incomplete.Far_Interest_Rate КАК Far_Interest_Rate,
	    |	Deals_Incomplete.Is_Deal_Info КАК Is_Deal_Info,
	    |	Deals_Incomplete.Deal_Info_Type КАК Deal_Info_Type,
	    |	Deals_Incomplete.Reason_Type КАК Reason_Type,
	    |	Deals_Incomplete.Is_Cancelled КАК Is_Cancelled,
	    |	Deals_Incomplete.Date_Cancelled КАК Date_Cancelled,
	    |	Deals_Incomplete.Time_Cancelled КАК Time_Cancelled,
	    |	Deals_Incomplete.Order_Number КАК Order_Number,
	    |	Deals_Incomplete.Order_Date КАК Order_Date,
	    |	Deals_Incomplete.Parent_Order_Number КАК Parent_Order_Number,
	    |	Deals_Incomplete.Parent_Order_Date КАК Parent_Order_Date,
	    |	Deals_Incomplete.Near_Deal_Record_UID КАК Near_Deal_Record_UID,
	    |	Deals_Incomplete.Parent_Record_UID КАК Parent_Record_UID,
	    |	Deals_Incomplete.Is_Not_Confirmed КАК Is_Not_Confirmed,
	    |	Deals_Incomplete.Is_Outer_Broker_Execution КАК Is_Outer_Broker_Execution,
	    |	Deals_Incomplete.Partner_ID КАК Partner_ID,
	    |	Deals_Incomplete.SettleCode КАК SettleCode,
	    |	Deals_Incomplete.External_Reference КАК External_Reference,
	    |	Deals_Incomplete.Parent_External_Reference КАК Parent_External_Reference,
	    |	Deals_Incomplete.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _Deals_Incomplete
	    |ИЗ
	    |	&Deals_Incomplete КАК Deals_Incomplete
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Deals_Details_Incomplete.Record_UID КАК Record_UID,
	    |	Deals_Details_Incomplete.Parent_Record_UID КАК Parent_Record_UID,
	    |	Deals_Details_Incomplete.Security_ID КАК Security_ID,
	    |	Deals_Details_Incomplete.Price КАК Price,
	    |	Deals_Details_Incomplete.Price_Points КАК Price_Points,
	    |	Deals_Details_Incomplete.Volume КАК Volume,
	    |	Deals_Details_Incomplete.Amount КАК Amount,
	    |	Deals_Details_Incomplete.ACI_Amount КАК ACI_Amount,
	    |	Deals_Details_Incomplete.Margin_Amount КАК Margin_Amount,
	    |	Deals_Details_Incomplete.Payment_Amount КАК Payment_Amount,
	    |	Deals_Details_Incomplete.Payment_ACI_Amount КАК Payment_ACI_Amount,
	    |	Deals_Details_Incomplete.Payment_Margin_Amount КАК Payment_Margin_Amount,
	    |	Deals_Details_Incomplete.Far_Price КАК Far_Price,
	    |	Deals_Details_Incomplete.Far_Amount КАК Far_Amount,
	    |	Deals_Details_Incomplete.Far_ACI_Amount КАК Far_ACI_Amount,
	    |	Deals_Details_Incomplete.Account_Division_ID КАК Account_Division_ID,
	    |	Deals_Details_Incomplete.Price_Percent КАК Price_Percent
	    |ПОМЕСТИТЬ _Deals_Details_Incomplete
	    |ИЗ
	    |	&Deals_Details_Incomplete КАК Deals_Details_Incomplete
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Deals_Operations_States.Date КАК Date,
	    |	Deals_Operations_States.Market_Number КАК Market_Number,
	    |	Deals_Operations_States.Record_UID КАК Record_UID,
	    |	Deals_Operations_States.State КАК State,
	    |	Deals_Operations_States.Operation_Step КАК Operation_Step,
	    |	Deals_Operations_States.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _Deals_Operations_States
	    |ИЗ
	    |	&Deals_Operations_States КАК Deals_Operations_States
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_Deals_Operations_States.Date КАК Date,
	    |	ЕСТЬNULL(ВложенныйЗапрос.Date, """") КАК Deal_Date,
	    |	_Deals_Operations_States.Market_Number КАК Market_Number,
	    |	_Deals_Operations_States.Record_UID КАК Record_UID,
	    |	ВЫБОР
	    |		КОГДА _Deals_Operations_States.Operation_Step В (""Is_Payment_Far_Completed"", ""Is_Delivery_Far_Completed"")
	    |			ТОГДА ""РепоВтораяЧасть""
	    |		КОГДА _Deals_Operations_States.Operation_Step В (""Is_Payment_Completed"", ""Is_Delivery_Completed"")
	    |			ТОГДА ВЫБОР
	    |					КОГДА ЕСТЬNULL(ВложенныйЗапрос.Operation_Type, """") = ""Operations.Group.Deals.REPO""
	    |						ТОГДА ""РепоПерваяЧасть""
	    |					ИНАЧЕ ""Сделка""
	    |				КОНЕЦ
	    |	КОНЕЦ КАК ТипСделки,
	    |	СУММА(ВЫБОР
	    |			КОГДА _Deals_Operations_States.Operation_Step В (""Is_Payment_Completed"", ""Is_Payment_Far_Completed"")
	    |				ТОГДА ВЫБОР
	    |						КОГДА _Deals_Operations_States.State = ""1""
	    |							ТОГДА 1
	    |						ИНАЧЕ 0
	    |					КОНЕЦ
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК Оплата,
	    |	СУММА(ВЫБОР
	    |			КОГДА _Deals_Operations_States.Operation_Step В (""Is_Delivery_Completed"", ""Is_Delivery_Far_Completed"")
	    |				ТОГДА ВЫБОР
	    |						КОГДА _Deals_Operations_States.State = ""1""
	    |							ТОГДА 1
	    |						ИНАЧЕ 0
	    |					КОНЕЦ
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК Поставка,
	    |	_Deals_Operations_States.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _ИсполненныеСделки
	    |ИЗ
	    |	_Deals_Operations_States КАК _Deals_Operations_States
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
	    |		ПО _Deals_Operations_States.Ключ = _ДанныеПервыхУзлов.Ключ
	    |			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |			_Deals.Market_Number КАК Market_Number,
	    |			_Deals.Date КАК Date,
	    |			_Deals.Operation_Type КАК Operation_Type
	    |		ИЗ
	    |			_Deals КАК _Deals
	    |		ГДЕ
	    |			_Deals.Deal_Info_Type = """") КАК ВложенныйЗапрос
	    |		ПО _Deals_Operations_States.Market_Number = ВложенныйЗапрос.Market_Number
	    |ГДЕ
	    |	_Deals_Operations_States.Ключ В
	    |			(ВЫБРАТЬ
	    |				_КодыСчетовВнутреннегоУчетаСКлючами.Ключ
	    |			ИЗ
	    |				_КодыСчетовВнутреннегоУчетаСКлючами КАК _КодыСчетовВнутреннегоУчетаСКлючами
	    |			ГДЕ
	    |				_КодыСчетовВнутреннегоУчетаСКлючами.ИсключенИзЗагрузки = ЛОЖЬ)
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	_Deals_Operations_States.Date,
	    |	_Deals_Operations_States.Market_Number,
	    |	_Deals_Operations_States.Record_UID,
	    |	_Deals_Operations_States.Ключ,
	    |	ЕСТЬNULL(ВложенныйЗапрос.Date, """"),
	    |	ВЫБОР
	    |		КОГДА _Deals_Operations_States.Operation_Step В (""Is_Payment_Far_Completed"", ""Is_Delivery_Far_Completed"")
	    |			ТОГДА ""РепоВтораяЧасть""
	    |		КОГДА _Deals_Operations_States.Operation_Step В (""Is_Payment_Completed"", ""Is_Delivery_Completed"")
	    |			ТОГДА ВЫБОР
	    |					КОГДА ЕСТЬNULL(ВложенныйЗапрос.Operation_Type, """") = ""Operations.Group.Deals.REPO""
	    |						ТОГДА ""РепоПерваяЧасть""
	    |					ИНАЧЕ ""Сделка""
	    |				КОНЕЦ
	    |	КОНЕЦ
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Charges_Operations.Record_UID КАК Record_UID,
	    |	Charges_Operations.Date КАК Date,
	    |	Charges_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
	    |	Charges_Operations.Payment_Amount КАК Payment_Amount,
	    |	Charges_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
	    |	Charges_Operations.Security_ID КАК Security_ID,
	    |	Charges_Operations.Volume КАК Volume,
	    |	Charges_Operations.Market КАК Market,
	    |	Charges_Operations.Invoice_Number КАК Invoice_Number,
	    |	Charges_Operations.Charge_Record_UID КАК Charge_Record_UID,
	    |	Charges_Operations.Deal_Record_UID КАК Deal_Record_UID,
	    |	Charges_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
	    |	Charges_Operations.Storage_Place КАК Storage_Place,
	    |	Charges_Operations.Market_Number КАК Market_Number,
	    |	Charges_Operations.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _All_Charges_Operations
	    |ИЗ
	    |	&Charges_Operations КАК Charges_Operations
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
	    |			ТОГДА """"
	    |		ИНАЧЕ _All_Charges_Operations.Record_UID
	    |	КОНЕЦ КАК Record_UID,
	    |	_All_Charges_Operations.Date КАК Date,
	    |	_All_Charges_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
	    |	СУММА(_All_Charges_Operations.Payment_Amount) КАК Payment_Amount,
	    |	_All_Charges_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
	    |			ТОГДА """"
	    |		ИНАЧЕ _All_Charges_Operations.Security_ID
	    |	КОНЕЦ КАК Security_ID,
	    |	_All_Charges_Operations.Volume КАК Volume,
	    |	_All_Charges_Operations.Market КАК Market,
	    |	_All_Charges_Operations.Invoice_Number КАК Invoice_Number,
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
	    |			ТОГДА """"
	    |		ИНАЧЕ _All_Charges_Operations.Charge_Record_UID
	    |	КОНЕЦ КАК Charge_Record_UID,
	    |	_All_Charges_Operations.Deal_Record_UID КАК Deal_Record_UID,
	    |	_All_Charges_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
	    |	_All_Charges_Operations.Storage_Place КАК Storage_Place,
	    |	_All_Charges_Operations.Market_Number КАК Market_Number,
	    |	_All_Charges_Operations.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _Charges_Operations
	    |ИЗ
	    |	_All_Charges_Operations КАК _All_Charges_Operations
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
	    |			ТОГДА """"
	    |		ИНАЧЕ _All_Charges_Operations.Record_UID
	    |	КОНЕЦ,
	    |	_All_Charges_Operations.Date,
	    |	_All_Charges_Operations.Origin_Operation_Type,
	    |	_All_Charges_Operations.Payment_Currency_Code,
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
	    |			ТОГДА """"
	    |		ИНАЧЕ _All_Charges_Operations.Security_ID
	    |	КОНЕЦ,
	    |	_All_Charges_Operations.Volume,
	    |	_All_Charges_Operations.Market,
	    |	_All_Charges_Operations.Invoice_Number,
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
	    |			ТОГДА """"
	    |		ИНАЧЕ _All_Charges_Operations.Charge_Record_UID
	    |	КОНЕЦ,
	    |	_All_Charges_Operations.Deal_Record_UID,
	    |	_All_Charges_Operations.Inner_Account_Division_ID,
	    |	_All_Charges_Operations.Storage_Place,
	    |	_All_Charges_Operations.Market_Number,
	    |	_All_Charges_Operations.Ключ
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Money_Operations.Record_UID КАК Record_UID,
	    |	Money_Operations.Date КАК Date,
	    |	Money_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
	    |	Money_Operations.Direction КАК Direction,
	    |	Money_Operations.Client_ID КАК Client_ID,
	    |	Money_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
	    |	Money_Operations.Money_Storage_Place КАК Money_Storage_Place,
	    |	Money_Operations.Payment_Amount КАК Payment_Amount,
	    |	Money_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
	    |	Money_Operations.Deal_Record_UID КАК Deal_Record_UID,
	    |	Money_Operations.Charge_Record_UID КАК Charge_Record_UID,
	    |	Money_Operations.Security_ID КАК Security_ID,
	    |	Money_Operations.Volume КАК Volume,
	    |	Money_Operations.Is_Netted КАК Is_Netted,
	    |	Money_Operations.Market_Number КАК Market_Number,
	    |	Money_Operations.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _All_Money_Operations
	    |ИЗ
	    |	&Money_Operations КАК Money_Operations
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	МАКСИМУМ(_All_Money_Operations.Record_UID) КАК Record_UID,
	    |	_All_Money_Operations.Date КАК Date,
	    |	_All_Money_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
	    |	_All_Money_Operations.Direction КАК Direction,
	    |	_All_Money_Operations.Client_ID КАК Client_ID,
	    |	_All_Money_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
	    |	_All_Money_Operations.Money_Storage_Place КАК Money_Storage_Place,
	    |	СУММА(_All_Money_Operations.Payment_Amount) КАК Payment_Amount,
	    |	_All_Money_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
	    |	_All_Money_Operations.Deal_Record_UID КАК Deal_Record_UID,
	    |	"""" КАК Charge_Record_UID,
	    |	"""" КАК Security_ID,
	    |	_All_Money_Operations.Volume КАК Volume,
	    |	_All_Money_Operations.Market_Number КАК Market_Number,
	    |	_All_Money_Operations.Ключ КАК Ключ,
	    |	0 КАК Coupon_Amount,
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Record_UID ЕСТЬ NULL
	    |			ТОГДА ЛОЖЬ
	    |		ИНАЧЕ ИСТИНА
	    |	КОНЕЦ КАК ЗадолженностьНачисленаВТекущемДне
	    |ПОМЕСТИТЬ _Money_Operations
	    |ИЗ
	    |	_All_Money_Operations КАК _All_Money_Operations
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _All_Charges_Operations КАК _All_Charges_Operations
	    |		ПО _All_Money_Operations.Charge_Record_UID = _All_Charges_Operations.Record_UID
	    |ГДЕ
	    |	_All_Money_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	_All_Money_Operations.Date,
	    |	_All_Money_Operations.Origin_Operation_Type,
	    |	_All_Money_Operations.Direction,
	    |	_All_Money_Operations.Client_ID,
	    |	_All_Money_Operations.Inner_Account_Division_ID,
	    |	_All_Money_Operations.Money_Storage_Place,
	    |	_All_Money_Operations.Payment_Currency_Code,
	    |	_All_Money_Operations.Deal_Record_UID,
	    |	_All_Money_Operations.Volume,
	    |	_All_Money_Operations.Market_Number,
	    |	_All_Money_Operations.Ключ,
	    |	ВЫБОР
	    |		КОГДА _All_Charges_Operations.Record_UID ЕСТЬ NULL
	    |			ТОГДА ЛОЖЬ
	    |		ИНАЧЕ ИСТИНА
	    |	КОНЕЦ
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	_All_Money_Operations.Record_UID,
	    |	_All_Money_Operations.Date,
	    |	_All_Money_Operations.Origin_Operation_Type,
	    |	_All_Money_Operations.Direction,
	    |	_All_Money_Operations.Client_ID,
	    |	_All_Money_Operations.Inner_Account_Division_ID,
	    |	_All_Money_Operations.Money_Storage_Place,
	    |	ВЫБОР
	    |		КОГДА _All_Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.IncomeReturn"", ""Operations.Group.Payments.Coupon"", ""Operations.Group.Payments.CouponReturn"")
	    |			ТОГДА 0
	    |		ИНАЧЕ _All_Money_Operations.Payment_Amount
	    |	КОНЕЦ,
	    |	_All_Money_Operations.Payment_Currency_Code,
	    |	_All_Money_Operations.Deal_Record_UID,
	    |	_All_Money_Operations.Charge_Record_UID,
	    |	_All_Money_Operations.Security_ID,
	    |	_All_Money_Operations.Volume,
	    |	_All_Money_Operations.Market_Number,
	    |	_All_Money_Operations.Ключ,
	    |	ВЫБОР
	    |		КОГДА _All_Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.IncomeReturn"", ""Operations.Group.Payments.Coupon"", ""Operations.Group.Payments.CouponReturn"")
	    |			ТОГДА _All_Money_Operations.Payment_Amount
	    |		ИНАЧЕ ЕСТЬNULL(СуммыКупонов.Payment_Amount, 0)
	    |	КОНЕЦ,
	    |	ЛОЖЬ
	    |ИЗ
	    |	_All_Money_Operations КАК _All_Money_Operations
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			_All_Money_Operations.Deal_Record_UID КАК Deal_Record_UID,
	    |			_All_Money_Operations.Is_Netted КАК Is_Netted,
	    |			_All_Money_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
	    |			СУММА(_All_Money_Operations.Payment_Amount) КАК Payment_Amount
	    |		ИЗ
	    |			_All_Money_Operations КАК _All_Money_Operations
	    |		ГДЕ
	    |			_All_Money_Operations.Origin_Operation_Type В (""Operations.Group.Settlements.ACI"", ""Operations.Group.Settlements.REPO.ACI.Near"", ""Operations.Group.Settlements.REPO.ACI.Far"")
	    |		
	    |		СГРУППИРОВАТЬ ПО
	    |			_All_Money_Operations.Deal_Record_UID,
	    |			_All_Money_Operations.Is_Netted,
	    |			_All_Money_Operations.Payment_Currency_Code) КАК СуммыКупонов
	    |		ПО _All_Money_Operations.Deal_Record_UID = СуммыКупонов.Deal_Record_UID
	    |			И _All_Money_Operations.Is_Netted = СуммыКупонов.Is_Netted
	    |			И _All_Money_Operations.Payment_Currency_Code = СуммыКупонов.Payment_Currency_Code
	    |			И (_All_Money_Operations.Origin_Operation_Type В (""Operations.Group.Settlements.Payment"", ""Operations.Group.Settlements.REPO.Payment.Near"", ""Operations.Group.Settlements.REPO.Payment.Far""))
	    |ГДЕ
	    |	НЕ _All_Money_Operations.Origin_Operation_Type В (""Operations.Group.Charges.Depository"", ""Operations.Group.Settlements.ACI"", ""Operations.Group.Settlements.REPO.ACI.Near"", ""Operations.Group.Settlements.REPO.ACI.Far"")
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Money_Instructions.Record_UID КАК Record_UID,
	    |	Money_Instructions.Date КАК Date,
	    |	Money_Instructions.Operation_Type КАК Operation_Type,
	    |	Money_Instructions.Transfer_Type КАК Transfer_Type,
	    |	Money_Instructions.Amount КАК Amount,
	    |	Money_Instructions.Currency_Code КАК Currency_Code,
	    |	Money_Instructions.Client_ID КАК Client_ID,
	    |	Money_Instructions.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
	    |	Money_Instructions.Money_Storage_Place КАК Money_Storage_Place,
	    |	Money_Instructions.Partner_ID КАК Partner_ID,
	    |	Money_Instructions.Partner_Inner_Account_Division_ID КАК Partner_Inner_Account_Division_ID,
	    |	Money_Instructions.Partner_Money_Storage_Place КАК Partner_Money_Storage_Place,
	    |	Money_Instructions.Order_Number КАК Order_Number,
	    |	Money_Instructions.Order_Date КАК Order_Date,
	    |	Money_Instructions.Reason_Type КАК Reason_Type,
	    |	Money_Instructions.Description КАК Description,
	    |	Money_Instructions.Deal_Record_UID КАК Deal_Record_UID,
	    |	Money_Instructions.External_Reference КАК External_Reference,
	    |	Money_Instructions.Market_Number КАК Market_Number,
	    |	Money_Instructions.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _Money_Instructions
	    |ИЗ
	    |	&Money_Instructions КАК Money_Instructions
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Depo_Operations.Record_UID КАК Record_UID,
	    |	Depo_Operations.Date КАК Date,
	    |	Depo_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
	    |	Depo_Operations.Direction КАК Direction,
	    |	Depo_Operations.Client_ID КАК Client_ID,
	    |	Depo_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
	    |	Depo_Operations.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	Depo_Operations.Security_ID КАК Security_ID,
	    |	Depo_Operations.Volume КАК Volume,
	    |	Depo_Operations.Deal_Record_UID КАК Deal_Record_UID,
	    |	Depo_Operations.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _Depo_Operations
	    |ИЗ
	    |	&Depo_Operations КАК Depo_Operations
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	&Звездочка КАК Звездочка,
	    |	_Deals.Date КАК ДатаСделки,
	    |	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	    |	ВалютыСделки.Валюта КАК ВалютаСделки,
	    |	ВалютыОплаты.Валюта КАК ВалютаОплаты
	    |ПОМЕСТИТЬ _Deals_With_Details
	    |ИЗ
	    |	_Deals КАК _Deals
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
	    |		ПО _Deals.Ключ = _ДанныеПервыхУзлов.Ключ
	    |			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Deals_Details КАК _Deals_Details
	    |			ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
	    |			ПО _Deals_Details.Security_ID = _ЦенныеБумаги.Matrix_ID
	    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
	    |			ПО _Deals_Details.Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
	    |				И (НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL)
	    |				И (_КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ)
	    |		ПО _Deals.Record_UID = _Deals_Details.Parent_Record_UID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _Контрагенты КАК _Контрагенты
	    |		ПО _Deals.Partner_ID = _Контрагенты.Firm_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыСделки
	    |		ПО _Deals.Currency = ВалютыСделки.ISO_Code
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОплаты
	    |		ПО _Deals.Payment_Currency = ВалютыОплаты.ISO_Code
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	&Звездочка КАК Звездочка,
	    |	_Deals_Incomplete.Date КАК ДатаСделки,
	    |	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	    |	ВалютыСделки.Валюта КАК ВалютаСделки,
	    |	ВалютыОплаты.Валюта КАК ВалютаОплаты
	    |ПОМЕСТИТЬ _Deals_Incomplete_With_Details
	    |ИЗ
	    |	_Deals_Incomplete КАК _Deals_Incomplete
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
	    |		ПО _Deals_Incomplete.Ключ = _ДанныеПервыхУзлов.Ключ
	    |			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Deals_Details_Incomplete КАК _Deals_Details_Incomplete
	    |			ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
	    |			ПО _Deals_Details_Incomplete.Security_ID = _ЦенныеБумаги.Matrix_ID
	    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
	    |			ПО _Deals_Details_Incomplete.Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
	    |				И (НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL)
	    |				И (_КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ)
	    |		ПО _Deals_Incomplete.Record_UID = _Deals_Details_Incomplete.Parent_Record_UID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _Контрагенты КАК _Контрагенты
	    |		ПО _Deals_Incomplete.Partner_ID = _Контрагенты.Firm_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыСделки
	    |		ПО _Deals_Incomplete.Currency = ВалютыСделки.ISO_Code
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОплаты
	    |		ПО _Deals_Incomplete.Payment_Currency = ВалютыОплаты.ISO_Code
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВложенныйЗапрос.ДатаСделки КАК ДатаСделки,
	    |	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	ЕСТЬNULL(НоминалыЦенныхБумаг.Номинал, ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Справочник.Облигации).Номинал) КАК Номинал,
	    |	КурсыВалют.Курс КАК КурсВалютыНоминала,
	    |	КурсыВалют.Кратность КАК КратностьКурсаВалютыНоминала
	    |ПОМЕСТИТЬ _НоминалыЦенныхБумаг
	    |ИЗ
	    |	(ВЫБРАТЬ
	    |		ВложенныйЗапрос.ДатаСделки КАК ДатаСделки,
	    |		ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
	    |		МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала
	    |	ИЗ
	    |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |			_Deals_With_Details.ДатаСделки КАК ДатаСделки,
	    |			_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага
	    |		ИЗ
	    |			_Deals_With_Details КАК _Deals_With_Details
	    |		ГДЕ
	    |			_Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	    |		
	    |		ОБЪЕДИНИТЬ
	    |		
	    |		ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |			_Deals_Incomplete_With_Details.ДатаСделки,
	    |			_Deals_Incomplete_With_Details.ЦеннаяБумага
	    |		ИЗ
	    |			_Deals_Incomplete_With_Details КАК _Deals_Incomplete_With_Details
	    |		ГДЕ
	    |			_Deals_Incomplete_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации) КАК ВложенныйЗапрос
	    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
	    |			ПО ВложенныйЗапрос.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
	    |				И ВложенныйЗапрос.ДатаСделки >= НоминалыЦенныхБумаг.Период
	    |	
	    |	СГРУППИРОВАТЬ ПО
	    |		ВложенныйЗапрос.ДатаСделки,
	    |		ВложенныйЗапрос.ЦеннаяБумага) КАК ВложенныйЗапрос
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
	    |		ПО ВложенныйЗапрос.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
	    |			И ВложенныйЗапрос.ПериодНоминала = НоминалыЦенныхБумаг.Период
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	    |		ПО (ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала = КурсыВалют.Валюта)
	    |			И ВложенныйЗапрос.ДатаСделки = КурсыВалют.Период
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВложенныйЗапрос.ДатаСделки КАК ДатаСделки,
	    |	ВложенныйЗапрос.ВалютаОплаты КАК ВалютаОплаты,
	    |	КурсыВалют.Курс КАК КурсВалютыОплаты,
	    |	КурсыВалют.Кратность КАК КратностьКурсаВалютыОплаты
	    |ПОМЕСТИТЬ _КурсыВалют
	    |ИЗ
	    |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |		_Deals_With_Details.ДатаСделки КАК ДатаСделки,
	    |		_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты
	    |	ИЗ
	    |		_Deals_With_Details КАК _Deals_With_Details
	    |	
	    |	ОБЪЕДИНИТЬ
	    |	
	    |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |		_Deals_Incomplete_With_Details.ДатаСделки,
	    |		_Deals_Incomplete_With_Details.ВалютаОплаты
	    |	ИЗ
	    |		_Deals_Incomplete_With_Details КАК _Deals_Incomplete_With_Details) КАК ВложенныйЗапрос
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	    |		ПО ВложенныйЗапрос.ВалютаОплаты = КурсыВалют.Валюта
	    |			И ВложенныйЗапрос.ДатаСделки = КурсыВалют.Период
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	    |	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
	    |	КодыВоВнешнихСистемахСрезПоследних.Объект.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	КодыВоВнешнихСистемахСрезПоследних.Объект.Брокер КАК Брокер,
	    |	КодыВоВнешнихСистемахСрезПоследних.Объект.Организация КАК Организация,
	    |	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов,
	    |	КодыВоВнешнихСистемахСрезПоследних.Код КАК НомерОперации
	    |ПОМЕСТИТЬ _ВнебиржевыеОперации
	    |ИЗ
	    |	(ВЫБРАТЬ
	    |		_Deals.Near_Deal_Record_UID КАК Matrix_ID
	    |	ИЗ
	    |		_Deals КАК _Deals
	    |	ГДЕ
	    |		_Deals.Near_Deal_Record_UID <> """"
	    |		И _Deals.Market = ""OTC""
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Deals.Parent_Record_UID
	    |	ИЗ
	    |		_Deals КАК _Deals
	    |	ГДЕ
	    |		_Deals.Parent_Record_UID <> """"
	    |		И _Deals.Market = ""OTC""
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Deals.Record_UID
	    |	ИЗ
	    |		_Deals КАК _Deals
	    |	ГДЕ
	    |		_Deals.Market = ""OTC""
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Money_Instructions.Record_UID
	    |	ИЗ
	    |		_Money_Instructions КАК _Money_Instructions
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Money_Instructions.Deal_Record_UID
	    |	ИЗ
	    |		_Money_Instructions КАК _Money_Instructions
	    |	ГДЕ
	    |		_Money_Instructions.Deal_Record_UID <> """"
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Charges_Operations.Deal_Record_UID
	    |	ИЗ
	    |		_Charges_Operations КАК _Charges_Operations
	    |	ГДЕ
	    |		_Charges_Operations.Deal_Record_UID <> """"
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Charges_Operations.Charge_Record_UID
	    |	ИЗ
	    |		_Charges_Operations КАК _Charges_Operations
	    |	ГДЕ
	    |		_Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Broker""
	    |		И _Charges_Operations.Charge_Record_UID <> """"
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Charges_Operations.Record_UID
	    |	ИЗ
	    |		_Charges_Operations КАК _Charges_Operations
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Depo_Operations.Record_UID
	    |	ИЗ
	    |		_Depo_Operations КАК _Depo_Operations
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Money_Operations.Deal_Record_UID
	    |	ИЗ
	    |		_Money_Operations КАК _Money_Operations
	    |	ГДЕ
	    |		_Money_Operations.Deal_Record_UID <> """"
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Money_Operations.Record_UID
	    |	ИЗ
	    |		_Money_Operations КАК _Money_Operations
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		_Money_Operations.Charge_Record_UID
	    |	ИЗ
	    |		_Money_Operations КАК _Money_Operations
	    |	ГДЕ
	    |		_Money_Operations.Charge_Record_UID <> """") КАК ВложенныйЗапрос
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
	    |				&КонецПериода,
	    |				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
	    |					И ГруппаОбъектов В
	    |						(ВЫБРАТЬ
	    |							ГруппыИмпортируемыхОбъектов.Ссылка
	    |						ИЗ
	    |							Справочник.ГруппыИмпортируемыхОбъектов КАК ГруппыИмпортируемыхОбъектов
	    |								ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
	    |								ПО
	    |									ГруппыИмпортируемыхОбъектов.Родитель = ИменованныеОбъекты.Объект
	    |										И ИменованныеОбъекты.Имя = ""ГруппаИмпортируемыхОбъектов_Матрих"")
	    |					И (Объект ССЫЛКА Документ.Сделка
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.Сделка).Брокер = &Брокер
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.Сделка).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.Сделка).ПометкаУдаления = ЛОЖЬ
	    |						ИЛИ Объект ССЫЛКА Документ.СделкаРЕПО
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.СделкаРЕПО).Брокер = &Брокер
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.СделкаРЕПО).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.СделкаРЕПО).ПометкаУдаления = ЛОЖЬ
	    |						ИЛИ Объект ССЫЛКА Документ.НачислениеЗадолженности
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.НачислениеЗадолженности).Брокер = &Брокер
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.НачислениеЗадолженности).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.НачислениеЗадолженности).ПометкаУдаления = ЛОЖЬ
	    |						ИЛИ Объект ССЫЛКА Документ.ПереводДенежныхСредств
	    |							И (ВЫРАЗИТЬ(Объект КАК Документ.ПереводДенежныхСредств).Брокер = &Брокер
	    |								ИЛИ ВЫРАЗИТЬ(Объект КАК Документ.ПереводДенежныхСредств).БрокерПолучатель = &Брокер)
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.ПереводДенежныхСредств).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.ПереводДенежныхСредств).ПометкаУдаления = ЛОЖЬ
	    |						ИЛИ Объект ССЫЛКА Документ.Оплата
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.Оплата).Брокер = &Брокер
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.Оплата).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.Оплата).ПометкаУдаления = ЛОЖЬ
	    |						ИЛИ Объект ССЫЛКА Документ.ИзменениеУсловийСделки
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.ИзменениеУсловийСделки).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.ИзменениеУсловийСделки).ПометкаУдаления = ЛОЖЬ
	    |						ИЛИ Объект ССЫЛКА Документ.ПоставкаЦенныхБумаг
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.ПоставкаЦенныхБумаг).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.ПоставкаЦенныхБумаг).ПометкаУдаления = ЛОЖЬ
	    |						ИЛИ Объект ССЫЛКА Документ.СделкаСВалютой
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.СделкаСВалютой).Брокер = &Брокер
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.СделкаСВалютой).Организация = &Организация
	    |							И ВЫРАЗИТЬ(Объект КАК Документ.СделкаСВалютой).ПометкаУдаления = ЛОЖЬ)) КАК КодыВоВнешнихСистемахСрезПоследних
	    |		ПО ВложенныйЗапрос.Matrix_ID = КодыВоВнешнихСистемахСрезПоследних.Код
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	Сделка.Ссылка КАК Ссылка,
	    |	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	СделкаЦенныеБумаги.Количество КАК Количество
	    |ПОМЕСТИТЬ _СделкиИсполненияФьючерсныхКонтрактов
	    |ИЗ
	    |	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
	    |		ПО СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка
	    |			И (Сделка.Организация = &Организация)
	    |			И (Сделка.Брокер = &Брокер)
	    |			И (Сделка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
	    |			И (Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка))
	    |			И (ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).Исполнение = &ДатаИмпорта)
	    |			И (НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ) = &ДатаИмпорта)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	    |	""Deals"" КАК Таблица,
	    |	_Deals.Operation_Type КАК Operation_Type,
	    |	_Deals.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _ТипыОпераций
	    |ИЗ
	    |	_Deals КАК _Deals
	    |ГДЕ
	    |	НЕ _Deals.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.IPO"", ""Operations.Group.Deals.REPO"", ""Operations.Group.Deals.Forward"", ""Operations.Group.Deals.Swap"")
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	""Deals_Incomplete"",
	    |	_Deals_Incomplete.Operation_Type,
	    |	_Deals_Incomplete.Ключ
	    |ИЗ
	    |	_Deals_Incomplete КАК _Deals_Incomplete
	    |ГДЕ
	    |	НЕ _Deals_Incomplete.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.IPO"", ""Operations.Group.Deals.REPO"", ""Operations.Group.Deals.Forward"", ""Operations.Group.Deals.Swap"")
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	""Money_Operations"",
	    |	_Money_Operations.Origin_Operation_Type,
	    |	_Money_Operations.Ключ
	    |ИЗ
	    |	_Money_Operations КАК _Money_Operations
	    |ГДЕ
	    |	НЕ _Money_Operations.Origin_Operation_Type В (&ТипыОплат)
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	""Money_Instructions"",
	    |	_Money_Instructions.Operation_Type,
	    |	_Money_Instructions.Ключ
	    |ИЗ
	    |	_Money_Instructions КАК _Money_Instructions
	    |ГДЕ
	    |	НЕ _Money_Instructions.Operation_Type В (""Operations.Group.MoneyInstructions.Transfer"", ""Operations.Group.MoneyInstructions.In"", ""Operations.Group.MoneyInstructions.Out"")
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	""Charges_Operations"",
	    |	_Charges_Operations.Origin_Operation_Type,
	    |	_Charges_Operations.Ключ
	    |ИЗ
	    |	_Charges_Operations КАК _Charges_Operations
	    |ГДЕ
	    |	НЕ _Charges_Operations.Origin_Operation_Type В (&ТипыКомиссии)
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	""Depo_Operations"",
	    |	_Depo_Operations.Origin_Operation_Type,
	    |	_Depo_Operations.Ключ
	    |ИЗ
	    |	_Depo_Operations КАК _Depo_Operations
	    |ГДЕ
	    |	НЕ _Depo_Operations.Origin_Operation_Type В (""Operations.Group.Settlements.Delivery"", ""Operations.Group.Settlements.REPO.Delivery.Near"", ""Operations.Group.Settlements.REPO.Delivery.Far"", ""Operations.Group.CorporateActions.WriteOff"")
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ТипыОпераций.Таблица КАК Таблица,
	    |	_ТипыОпераций.Operation_Type КАК Operation_Type,
	    |	_ТипыОпераций.Ключ КАК Ключ
	    |ПОМЕСТИТЬ _ОшибкиОпределенияТипаОпераций
	    |ИЗ
	    |	_ТипыОпераций КАК _ТипыОпераций
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
	    |		ПО _ТипыОпераций.Ключ = _ДанныеПервыхУзлов.Ключ
	    |			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _ТипыОпераций
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _All_Money_Operations
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _Deals_Operations_States
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _All_Charges_Operations
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _КодыСчетовВнутреннегоУчетаСКлючами";
	
#КонецОбласти

	ТипыКомиссий = "Operations.Group.Charges.Depository, Operations.Group.Charges.Broker, Operations.Group.Charges.Broker.Equities, Operations.Group.Charges.Broker.Bills,
				   |Operations.Group.Charges.Broker.FX, Operations.Group.Charges.Broker.REPO, Operations.Group.Charges.Recovery, Operations.Group.Charges.Agent,
				   |Operations.Group.Charges.Broker.FX.REPO, Operations.Group.Charges.Clearing, Operations.Group.Charges.Broker.Derivatives, Operations.Group.Charges.SE.Transaction, Operations.Group.Settlements.Add.SE.Fee";
	
	ТипыОплат = "Operations.Group.Charges.Depository, Operations.Group.Settlements.Add.SE.Fee, Operations.Group.Charges.Broker, Operations.Group.Charges.Broker.Equities, Operations.Group.Charges.Broker.FX,
				|Operations.Group.Charges.Broker.REPO, Operations.Group.Charges.Recovery, Operations.Group.Charges.Agent, Operations.Group.Charges.Broker.FX.REPO,
				|Operations.Group.Charges.Clearing, Operations.Group.Charges.Broker.Derivatives, Operations.Group.Charges.Broker.Bills, Operations.Group.Settlements.Delivery,
				|Operations.Group.Settlements.Payment, Operations.Group.Settlements.ACI, Operations.Group.Settlements.REPO.Payment.Near, Operations.Group.Settlements.REPO.ACI.Near,
				|Operations.Group.Settlements.REPO.Payment.Far, Operations.Group.Settlements.REPO.ACI.Far, Operations.Group.Payments.IncomeReturn, Operations.Group.Payments.Coupon, Operations.Group.Payments.CouponReturn,
				|Operations.Group.Payments.Redemption, Operations.Group.Payments.PartialRedemption, Operations.Group.Payments.Dividend, Operations.Group.Payments.SharesIncome,
				|Operations.Group.Payments.Percents, Operations.Group.Payments.VariationMarginRevaluation, Operations.Group.Settlements.VariationMargin, Operations.Group.Settlements.Add.PayOff, Operations.Group.Charges.SE.Transaction,
				|Operations.Group.Payments.DepositMargin";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*"); 
	Запрос.УстановитьПараметр("ДатаИмпорта", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	
	Запрос.УстановитьПараметр("Deals", СтруктураВнешнихДанных.Deals);
	Запрос.УстановитьПараметр("Deals_Details", СтруктураВнешнихДанных.Deals_Details);
	Запрос.УстановитьПараметр("Deals_Incomplete", СтруктураВнешнихДанных.Deals_Incomplete);
	Запрос.УстановитьПараметр("Deals_Details_Incomplete", СтруктураВнешнихДанных.Deals_Details_Incomplete);
	Запрос.УстановитьПараметр("Deals_Operations_States", СтруктураВнешнихДанных.Deals_Operations_States);
	
	Запрос.УстановитьПараметр("Money_Operations", СтруктураВнешнихДанных.Money_Operations);
	Запрос.УстановитьПараметр("Money_Instructions", СтруктураВнешнихДанных.Money_Instructions);
	Запрос.УстановитьПараметр("Charges_Operations", СтруктураВнешнихДанных.Charges_Operations);
	Запрос.УстановитьПараметр("Depo_Operations", СтруктураВнешнихДанных.Depo_Operations);
		
	Запрос.УстановитьПараметр("ТипыКомиссии", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТипыКомиссий, ",", Истина, Истина));
	Запрос.УстановитьПараметр("ТипыОплат", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТипыОплат, ",", Истина, Истина));
	
	Запрос.Выполнить();
	
	ВыборкаОшибокОпределенияТипаОперации = МВТ.Таблицы["_ОшибкиОпределенияТипаОпераций"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаОшибокОпределенияТипаОперации.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ВыборкаОшибокОпределенияТипаОперации.Ключ + "] в элементе [" + ВыборкаОшибокОпределенияТипаОперации.Таблица + "] присутствуют записи со значением атрибута Operation_Type = " + ВыборкаОшибокОпределенияТипаОперации.Operation_Type + ", для которого не описаны правила обработки.");	
	КонецЦикла;
	
	СтруктураВнешнихДанных = Неопределено;
		
	ИмпортируемыеДанные = Новый Структура;
	ИмпортируемыеДанные.Вставить("БиржевыеСделки", ОбработатьБиржевыеСделки_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ИсполненияБиржевыхСделок", ОбработатьИсполненияБиржевыхСделок_OTBR(МВТ, КонтролироватьНепроведенныеДокументы));
	
	ИмпортируемыеДанные.Вставить("БиржевыеСделкиРЕПО1", ОбработатьБиржевыеСделкиРЕПО_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("БиржевыеСделкиРЕПО2", ОбработатьБиржевыеСделкиРЕПО2_OTBR(МВТ, КонтролироватьНепроведенныеДокументы));
	
	ИмпортируемыеДанные.Вставить("СделкиСВалютой", ОбработатьСделкиСВалютой_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ПереводыДенежныхСредств", ОбработатьПереводыДенежныхСредств_OTBR(МВТ));
	
	ИмпортируемыеДанные.Вставить("НачисленияКомиссии", ОбработатьНачисленияКомиссии_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ОплатыКомиссии", ОбработатьОплатыКомиссий_OTBR(МВТ));
	
	ИмпортируемыеДанные.Вставить("ОплатыВнебиржевыхСделок", ОбработатьОплатыВнебиржевыхСделок_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ОплатыБиржевыхСделок", ОбработатьОплатыБиржевыхСделокСВалютой_OTBR(МВТ));
	
	ИмпортируемыеДанные.Вставить("ОплатыПоПогашениям", ОбработатьОплатыПоПогашениям_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ОплатыПоВозвратуКупона", ОбработатьОплатыПоВозвратуКупона_OTBR(МВТ));

	ИмпортируемыеДанные.Вставить("ВариационнаяМаржа", ОбработатьВариационнуюМаржу_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ВнебиржевыеСделки", ОбработатьВнебиржевыеСделки_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("СделкиСПФИ", ОбработатьСделкиСПФИ_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("МаржаСПФИ", ОбработатьМаржуСПФИ_OTBR(МВТ));
	
	ИмпортируемыеДанные.Вставить("ВнебиржевыеСделкиРЕПО", ОбработатьВнебиржевыеСделкиРЕПО_OTBR(МВТ));
	
	ИмпортируемыеДанные.Вставить("ИзмененияСделок", ОбработатьИзмененияСделок_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ИзмененияСделокРЕПО2", ОбработатьИзмененияСделокРЕПО2_OTBR(МВТ));
	
	ИмпортируемыеДанные.Вставить("ПоставкиЦенныхБумаг", ОбработатьПоставкиЦенныхБумаг_OTBR(МВТ));
	ИмпортируемыеДанные.Вставить("ОтменыСделок", ОбработатьОтменыСделок_OTBR(МВТ));
	
	ИмпортируемыеДанные.Вставить("СписанияЦенныхБумаг", ОбработатьСписанияЦенныхБумаг_OTBR(МВТ));
	
	Если ДанныеСФормы = Неопределено Тогда
		
		СообщениеОбИсполнениях = "";
		
		ВыборкаИсполнений = МВТ.Таблицы["_НепроведенныеИсполнения"].ПолучитьДанные().Выбрать();
		
		Пока ВыборкаИсполнений.Следующий() Цикл
			СообщениеОбИсполнениях = СообщениеОбИсполнениях + Символы.ПС + "Дата [" + Формат(ВыборкаИсполнений.ПроверяемаяДата, "ДФ=dd.MM.yyyy") + "] " + ВыборкаИсполнений.СчетДоверительногоУправления + " [" + ВыборкаИсполнений.Количество + "] шт.";	
		КонецЦикла;

		Если СообщениеОбИсполнениях <> "" Тогда
			СообщениеОбИсполнениях = Символы.ПС + "Исполнения обязательств по сделкам:" + СообщениеОбИсполнениях;
		КонецЕсли;
		
		СообщениеОСделкахРепо = "";
		
		ВыборкаВторыхЧастей = МВТ.Таблицы["_НепроведенныеВторыеЧасти"].ПолучитьДанные().Выбрать();
		
		Пока ВыборкаВторыхЧастей.Следующий() Цикл
			СообщениеОСделкахРепо = СообщениеОСделкахРепо + Символы.ПС + "Дата [" + Формат(ВыборкаВторыхЧастей.ПроверяемаяДата, "ДФ=dd.MM.yyyy") + "] " + ВыборкаВторыхЧастей.СчетДоверительногоУправления + " [" + ВыборкаВторыхЧастей.Количество + "] шт.";	
		КонецЦикла;

		Если СообщениеОСделкахРепо <> "" Тогда
			СообщениеОСделкахРепо = Символы.ПС + "Вторые части сделок репо:" + СообщениеОСделкахРепо;
		КонецЕсли;
		
		Если СообщениеОбИсполнениях <> "" Или СообщениеОСделкахРепо <> "" Тогда
			
			ТекстСообщения = "При импорте операций брокера обнаружены непроведенные документы:" + ?(СообщениеОбИсполнениях <> "", СообщениеОбИсполнениях, "") + ?(СообщениеОСделкахРепо <> "", СообщениеОСделкахРепо, ""); 
			СформироватьОповещение("Импорт операции БК Регион. Уведомление о непроведенных документах.", ТекстСообщения);
						
		КонецЕсли;
			
	КонецЕсли;
				
	Возврат ИмпортируемыеДанные;
	
КонецФункции

#Область Сделки_РЕПО_М

Функция ИмпортироватьТаблицуСделокРЕПО_М(ФайлыИмпорта) Экспорт 
	
	ПараметрыПолей = ПолучитьПараметрыПолейФайлаСделокРЕПО_М();
	
	ТаблицаСделокРЕПО_М = Новый ТаблицаЗначений;
	
	Для каждого Поле Из ПараметрыПолей Цикл
		ТаблицаСделокРЕПО_М.Колонки.Добавить(Поле.Ключ, Поле.Значение.Тип);
	КонецЦикла; 
	
	ИмяФайлаДанныхНаСервере = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".xlsx";
	
	Для каждого СтрокаФайловИмпорта Из ФайлыИмпорта Цикл
		
		СтрокаФайловИмпорта.ДанныеФайла.Записать(ИмяФайлаДанныхНаСервере);
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ИмяФайлаДанныхНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		ПерваяЧастьЗагружена = Ложь;
		ВтораяЧастьЗагружена = Ложь;
		
		Для НомерСтроки = 14 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
			ЗаголовокРаздела = ТабличныйДокумент.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
			
			ЭтоСделки = ЗаголовокРаздела = "Сделки с ценными бумагами по счету клиента за отчетный период:";
			ЭтоНезавершенныеСделки = ЗаголовокРаздела = "Незавершенные сделки с ценными бумагами по счету клиента за отчетный период:";
			
			Если ЭтоСделки Или ЭтоНезавершенныеСделки Тогда
				НомерСтроки = НомерСтроки + 4;
			КонецЕсли;
			
			МестоЗаключенияСделки = ТабличныйДокумент.Область(НомерСтроки, ПараметрыПолей["МестоЗаключенияСделки"].Колонка, НомерСтроки, ПараметрыПолей["МестоЗаключенияСделки"].Колонка).Текст;
			//ЧастьСделкиРЕПО = ТабличныйДокумент.Область(НомерСтроки, ПараметрыПолей["ЧастьСделкиРЕПО"].Колонка, НомерСтроки, ПараметрыПолей["ЧастьСделкиРЕПО"].Колонка).Текст;
			Если МестоЗаключенияСделки = "ММВБ / RPMO: РЕПО-М" Тогда //И Не СтрНачинаетсяС(ЧастьСделкиРЕПО, "Закрытие") Тогда
				
				СтруктураПолей = Новый Структура;
				
				Для каждого Поле Из ПараметрыПолей Цикл
				
					Значение = ТабличныйДокумент.Область(НомерСтроки, Поле.Значение.Колонка, НомерСтроки, Поле.Значение.Колонка).Текст;
					
					Если Поле.Ключ = "РегНомер" Тогда
						Значение = ПолучитьКодЦеннойБумагиИзСтроки(Значение);
					ИначеЕсли Поле.Ключ = "ЧастьСделкиРЕПО" Тогда 
						Если СтрНачинаетсяС(Значение, "Закрытие") Тогда
						    Значение = 2;
						Иначе
							Значение = 1;						
						КонецЕсли; 
					ИначеЕсли Поле.Ключ = "НомерСделки" Тогда
						НачалоНомера = СтрНайти(Значение, "Бирж. № ") + 8;
						Значение = Сред(Значение, НачалоНомера);
					ИначеЕсли Поле.Ключ = "ИНН" Тогда
						НачалоИНН = СтрНайти(Значение, " ", НаправлениеПоиска.СКонца) + 1;
						Значение = Сред(Значение, НачалоИНН);
					КонецЕсли; 
					
					СтруктураПолей.Вставить(Поле.Ключ, Поле.Значение.Тип.ПривестиЗначение(Значение));
					
				КонецЦикла; 
				
				СтруктураПолей.Вставить("НезавершенныеСделки", ЭтоНезавершенныеСделки);
				
				ЗаполнитьЗначенияСвойств(ТаблицаСделокРЕПО_М.Добавить(), СтруктураПолей) 
								
			КонецЕсли; 
		
		КонецЦикла; 
		
		УдалитьФайлы(ИмяФайлаДанныхНаСервере);
	
	КонецЦикла; 
	
	ЗаполнитьРаскрытыхКонтрагентовВТаблицеСделокРЕПО_М(ТаблицаСделокРЕПО_М);
	
	Возврат ТаблицаСделокРЕПО_М;
	
КонецФункции

Функция ПолучитьКодЦеннойБумагиИзСтроки(Строка)

	Код = "";
	
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ГОС.РЕГ. ");
	Идентификаторы.Добавить("ISIN ");
	
	Для каждого Идентификатор Из Идентификаторы Цикл
	
		ПозицияИдентификатора = СтрНайти(ВРег(Строка), Идентификатор);
		Если ПозицияИдентификатора > 0 Тогда
			
			Код = Сред(Строка, ПозицияИдентификатора + СтрДлина(Идентификатор));
			Прервать;
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если Код = "" Тогда
		Код = Строка;
	КонецЕсли; 
	
	Если СтрНачинаетсяС(ВРег(Код), ВРег("не предусмотрен")) Тогда
		
		Код = ВРег("не предусмотрен");
		
	КонецЕсли; 
		
	Возврат Код;

КонецФункции

Функция ПолучитьПараметрыПолейФайлаСделокРЕПО_М()
	
	ПараметрыПолей = Новый Соответствие;
	
	ПараметрыПолей.Вставить("ДатаВремяСделки", 			Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Дата"), 1));
	ПараметрыПолей.Вставить("МестоЗаключенияСделки", 	Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)), 9));
	ПараметрыПолей.Вставить("РегНомер", 				Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)), 14));
	ПараметрыПолей.Вставить("ЧастьСделкиРЕПО", 			Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1)), 20));
	ПараметрыПолей.Вставить("НомерСделки", 				Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)), 20));
	ПараметрыПолей.Вставить("Дисконт", 					Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)), 53));
	ПараметрыПолей.Вставить("ИНН", 						Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12)), 54));
	ПараметрыПолей.Вставить("НезавершенныеСделки", 		Новый Структура("Тип, Колонка", Новый ОписаниеТипов("Булево"), 0));
		
	Возврат ПараметрыПолей;

КонецФункции

Процедура ЗаполнитьРаскрытыхКонтрагентовВТаблицеСделокРЕПО_М(ТаблицаСделокРЕПО_М)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСделокРЕПО_М, "_ТаблицаСделокРЕПО_М", Запрос.МенеджерВременныхТаблиц, Истина);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ТаблицаСделокРЕПО_М.ДатаВремяСделки КАК ДатаВремяСделки,
		|	_ТаблицаСделокРЕПО_М.ИНН КАК ИНН
		|ПОМЕСТИТЬ _ТаблицаИНН
		|ИЗ
		|	_ТаблицаСделокРЕПО_М КАК _ТаблицаСделокРЕПО_М
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ДатаВремяСделки КАК ДатаВремяСделки,
		|	ВложенныйЗапрос.ИНН КАК ИНН,
		|	_ТаблицаСделокРЕПО_М.МестоЗаключенияСделки КАК МестоЗаключенияСделки,
		|	_ТаблицаСделокРЕПО_М.РегНомер КАК РегНомер,
		|	_ТаблицаСделокРЕПО_М.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_ТаблицаСделокРЕПО_М.НомерСделки КАК НомерСделки,
		|	_ТаблицаСделокРЕПО_М.Дисконт КАК Дисконт,
		|	_ТаблицаСделокРЕПО_М.НезавершенныеСделки КАК НезавершенныеСделки,
		|	РеквизитыЮридическихЛиц.ЮрФизЛицо КАК РаскрытыйКонтрагент
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ТаблицаИНН.ДатаВремяСделки КАК ДатаВремяСделки,
		|		_ТаблицаИНН.ИНН КАК ИНН,
		|		МАКСИМУМ(РеквизитыЮридическихЛиц.Период) КАК Период
		|	ИЗ
		|		_ТаблицаИНН КАК _ТаблицаИНН
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|			ПО _ТаблицаИНН.ИНН = РеквизитыЮридическихЛиц.ИНН
		|				И _ТаблицаИНН.ДатаВремяСделки >= РеквизитыЮридическихЛиц.Период
		|				И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|				И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ТаблицаИНН.ДатаВремяСделки,
		|		_ТаблицаИНН.ИНН) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|		ПО ВложенныйЗапрос.Период = РеквизитыЮридическихЛиц.Период
		|			И ВложенныйЗапрос.ИНН = РеквизитыЮридическихЛиц.ИНН
		|			И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаСделокРЕПО_М КАК _ТаблицаСделокРЕПО_М
		|		ПО ВложенныйЗапрос.ДатаВремяСделки = _ТаблицаСделокРЕПО_М.ДатаВремяСделки
		|			И ВложенныйЗапрос.ИНН = _ТаблицаСделокРЕПО_М.ИНН";
	
	ТаблицаСделокРЕПО_М = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьСтруктуруДаннымиИзОбъектаXTDO(ОбъектXDTO, СтруктураДанных, ИмяФайла, ИспользуютсяСоставныеКодыУБрокера, ИмяТаблицы = "")
	
	ДанныеПервогоУзла = Неопределено;
	
	Для Каждого СвойствоОбъектаXDTO Из ОбъектXDTO.Свойства() Цикл
		
		Если ИмяТаблицы = "" И ДанныеПервогоУзла = Неопределено Тогда
			
#Область Данные_первого_узла	
	        ЕстьОшибки = Ложь;
			ДанныеПервогоУзла = Новый Структура("Account_Number, Date_From, Date_To, Recipient, Sender, Sender_System");
			
			ЗаполнитьЗначенияСвойств(ДанныеПервогоУзла, ОбъектXDTO);
			
			Если Не ЗначениеЗаполнено(ДанныеПервогоУзла.Account_Number)  Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] не заполнено значение атрибута первого узла [Account_Number]!");	
				ЕстьОшибки = Истина;
			КонецЕсли;
				
			Если ДанныеПервогоУзла.Date_From <> Формат(ЭтотОбъект.ДатаИмпорта, "ДФ=""гггг-ММ-дд""") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Date_From = " + ДанныеПервогоУзла.Date_From + "] не соответствет дате импорта!");
				ЕстьОшибки = Истина;
			КонецЕсли;
				
			Если ДанныеПервогоУзла.Date_To <> Формат(ЭтотОбъект.ДатаИмпорта, "ДФ=""гггг-ММ-дд""") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Date_To = " + ДанныеПервогоУзла.Date_To + "] не соответствет дате импорта!");
				ЕстьОшибки = Истина;
			КонецЕсли;
					
			Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") И Не (ДанныеПервогоУзла.Recipient = "OTBR.RegionAM" Или ДанныеПервогоУзла.Recipient = "OTBR.RegionAM.PIF")  
				Или ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") И Не (ДанныеПервогоУзла.Recipient = "OTBR.RegionTR" Или ДанныеПервогоУзла.Recipient = "OTBR.RegionTR.PIF") 
				Или ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") И Не (ДанныеПервогоУзла.Recipient = "OTBR.RegionPI" Или ДанныеПервогоУзла.Recipient = "OTBR.RegionPI.PIF") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Recipient = " + ДанныеПервогоУзла.Recipient + "] не соответствет организации [" + ЭтотОбъект.Организация + "]!");	
				ЕстьОшибки = Истина;
			КонецЕсли;
					
			Если ДанныеПервогоУзла.Sender <> "Region.BC" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Sender = " + ДанныеПервогоУзла.Sender + "] не соответствет формату обмена данных!");
				ЕстьОшибки = Истина;
			КонецЕсли;
						
			Если ДанныеПервогоУзла.Sender_System <> "MX1" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Sender_System = " + ДанныеПервогоУзла.Sender_System + "] не соответствет формату обмена данных!");
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			НоваяСтрока                          = СтруктураДанных.ДанныеПервыхУзлов.Добавить();
			НоваяСтрока.Ключ                     = ИмяФайла;
			НоваяСтрока.ЗначенияАтрибутов        = ДанныеПервогоУзла;
			НоваяСтрока.ФайлСоответствуетФормату = Не ЕстьОшибки;
			
			Продолжить;
#КонецОбласти
	
		КонецЕсли;

		//Исключен из сверки блок с остатками. При импорте операции остатки не сверяются.
		Если СвойствоОбъектаXDTO.Имя = "Remains" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СвойствоОбъектаXDTO.Форма = ФормаXML.Элемент Тогда
			
			Если СвойствоОбъектаXDTO.ВерхняяГраница = 1 Тогда  //у cписка XDTO ВерхняяГраница = -1 
				ЗначениеСвойстваОбъектаXDTO = ОбъектXDTO.Получить(СвойствоОбъектаXDTO);
			Иначе
				ЗначениеСвойстваОбъектаXDTO = ОбъектXDTO.ПолучитьСписок(СвойствоОбъектаXDTO);
			КонецЕсли;
			
			Если СвойствоОбъектаXDTO.Имя = "Record" Тогда //Может состоять из списка, может состоять из атрибутов (если одна запись)
				
				Если СтруктураДанных.Свойство(ИмяТаблицы) Тогда
					ЗаполнитьТаблицуЗначенийДаннымиИзОбъектаXTDO(ЗначениеСвойстваОбъектаXDTO, СтруктураДанных[ИмяТаблицы], ИмяТаблицы, ИмяФайла, ИспользуютсяСоставныеКодыУБрокера);
				Иначе 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не настроена загрузка для элемента файла " + ИмяТаблицы + "");
				КонецЕсли;
			
				Продолжить;
			
			Иначе
				ЗаполнитьСтруктуруДаннымиИзОбъектаXTDO(ЗначениеСвойстваОбъектаXDTO, СтруктураДанных, ИмяФайла, ИспользуютсяСоставныеКодыУБрокера, СвойствоОбъектаXDTO.Имя);
			КонецЕсли;
					
		КонецЕсли;
				
	КонецЦикла;
						
КонецПроцедуры

Функция ПолучитьСтруктуруДанных()
	
	СтруктураДанных = Новый Структура();
	
	НаименованиеТаблиц = "Deals, Deals_Details, Deals_Operations_States, Deals_Incomplete, Deals_Details_Incomplete,
						 |Money_Operations, Money_Instructions,
						 |Charges, Charges_Operations,
						 |Depo_Operations, Depo_Instructions, Depo_Instructions_Details,
						 |Accounts, Accounts_Divisions, Agreements,
						 |Currencies, Currencies_Pairs, Bonds, Shares, Bills, Derivatives, DRs, Funds,
						 |Firms, Persons, Enums_Values";
	
	Для Каждого ИмяТаблицы Из РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаименованиеТаблиц, ",", Истина, Истина) Цикл 
	
		Если ИмяТаблицы = "Deals" Или ИмяТаблицы = "Deals_Incomplete" Тогда //сделки
			
			ИменаПолей = "Record_UID, Market, Market_Board, Market_Number, Market_Order_Number, Is_Market_Maker, Date, Time, Operation_Type, Direction,
						 |Currency, Payment_Currency, Payment_Rate_Base, Is_Payment_Rate_Fixed, Is_Payment_Rate_Inverted, Payment_Rate, Payment_Date,
						 |Delivery_Date, Money_Storage_Place, Depo_Storage_Place, SE_Charge_Amount, PSA_Settlement_Type, Far_Execution_Date, Far_Interest_Rate,
						 |Is_Deal_Info, Deal_Info_Type, Reason_Type, Is_Cancelled, Date_Cancelled, Time_Cancelled, Order_Number, Order_Date, Parent_Order_Number,
						 |Parent_Order_Date, Near_Deal_Record_UID, Parent_Record_UID, Is_Not_Confirmed, Is_Outer_Broker_Execution, Partner_ID, External_Reference,
						 |SettleCode, SE_Charge_Date, Parent_External_Reference";			

		ИначеЕсли ИмяТаблицы = "Deals_Details" Или ИмяТаблицы = "Deals_Details_Incomplete" Тогда //детали сделок
			
			ИменаПолей = "Record_UID, Parent_Record_UID, Security_ID, Price, Price_Points, Volume, Amount, ACI_Amount, Margin_Amount, Payment_Amount,
						 |Payment_ACI_Amount, Payment_Margin_Amount, Far_Price, Far_Amount, Far_ACI_Amount, Account_Division_ID, Price_Percent";
			
		ИначеЕсли ИмяТаблицы = "Deals_Operations_States" Тогда //статусы сделок, исполнение
			
			ИменаПолей = "Record_UID, Date, Operation_Step, State, Market_Number";
			
		ИначеЕсли ИмяТаблицы = "Money_Operations" Тогда //неторговые операции с ДС
			
			ИменаПолей = "Record_UID, Date, Origin_Operation_Type, Direction, Client_ID, Inner_Account_Division_ID, Money_Storage_Place, Payment_Amount,
						 |Payment_Currency_Code, Deal_Record_UID, Charge_Record_UID, Security_ID, Volume, External_Reference, Market_Number, Is_Netted";
			
		ИначеЕсли ИмяТаблицы = "Money_Instructions" Тогда //неторговые операции с ДС
			
			ИменаПолей = "Record_UID, Date, Operation_Type, Transfer_Type, Amount, Currency_Code, Client_ID, Inner_Account_Division_ID,
						 |Money_Storage_Place, Partner_ID, Partner_Inner_Account_Division_ID, Partner_Money_Storage_Place, Order_Number,
						 |Order_Date, Reason_Type, Description, Deal_Record_UID, External_Reference, Market_Number";

		ИначеЕсли ИмяТаблицы = "Charges" Тогда //услуги
			
			ИменаПолей = "Record_UID, Date, Charge_Type, Period, Operation_Description";

		ИначеЕсли ИмяТаблицы = "Charges_Operations" Тогда //начисления комиссий
			
			ИменаПолей = "Record_UID, Date, Origin_Operation_Type, Payment_Amount, Payment_Currency_Code, Security_ID, Volume, Market, Invoice_Number,
						 |Charge_Record_UID, Deal_Record_UID, Inner_Account_Division_ID, Storage_Place, Market_Number";
			
		ИначеЕсли  ИмяТаблицы = "Depo_Operations" Тогда //операции по депозитарным счетам
			
			ИменаПолей = "Record_UID, Date, Origin_Operation_Type, Direction, Client_ID, Inner_Account_Division_ID, Depo_Storage_Place, Security_ID, Volume, Deal_Record_UID, Is_Netted, Market_Number";	
			
		ИначеЕсли ИмяТаблицы = "Depo_Instructions" Тогда //
			
			ИменаПолей = "Record_UID, Date, Operation_Type, Transfer_Type, Client_ID, Inner_Account_Division_ID, Depo_Storage_Place, Partner_ID,
						 |Partner_Inner_Account_Division_ID, Partner_Depo_Storage_Place, Order_Number, Order_Date, Reason_Type, Description, External_Reference";
			
		ИначеЕсли ИмяТаблицы = "Depo_Instructions_Details" Тогда
			
			ИменаПолей = "Record_UID, Parent_Record_UID, Security_ID, Volume";		
				
		ИначеЕсли ИмяТаблицы = "Accounts" Тогда //счета
			
			ИменаПолей = "ID, Firm_ID, Partner_ID, Agreement_ID, Number, Type, Sub_Type";
			
		ИначеЕсли ИмяТаблицы = "Accounts_Divisions" Тогда //портфели
			
			ИменаПолей = "ID, Account_ID, Number, Секция";
			
		ИначеЕсли ИмяТаблицы = "Agreements" Тогда //договоры
			
			ИменаПолей = "ID, Number, Type, Date_Signed";
			
		ИначеЕсли ИмяТаблицы = "Currencies" Тогда //валюты
			
			ИменаПолей = "ID, ISO_Code";
			
		ИначеЕсли ИмяТаблицы = "Currencies_Pairs" Тогда //валютные пары
			
			ИменаПолей = "ID, Code";
	
		ИначеЕсли ИмяТаблицы = "Bonds" Тогда  //облигации
			
			ИменаПолей = "ID, Issuer_ID, ISIN, CFI, Register_Number, Register_Date, Face_Value, Currency, Code_MOEX, Face_Value_Current";
			
		ИначеЕсли ИмяТаблицы = "Shares" Тогда //акции
			
			ИменаПолей = "ID, Issuer_ID, Type, ISIN, CFI, Register_Number, Register_Date, Code_MOEX";
			
		ИначеЕсли ИмяТаблицы = "Bills" Тогда //векселя
			
			ИменаПолей = "ID, Issuer_ID, Type, Payment_Type, Number_Series, Number_Blank, Number, Face_Value, Currency, Issue_Date, Interest_Rate,
						 |Retirement_Type, Retirement_Date_From, Retirement_Date_To, Retirement_After_Days";
			
		ИначеЕсли ИмяТаблицы = "Derivatives" Тогда //фьючерсы, опционы
			
			ИменаПолей = "ID, Name_Ru, Name_En, Type, Trading_Type, Settlement_Type, Currency, Kind_Type, Execution_Type, Date_Execution, 
						 |Base_Asset_Type, Base_Asset_Issuer_ID, Base_Asset_Security_ID, Base_Asset_Volume, Strike_Price, Strike_Currency,
						 |Is_Futures_Style, Description, Code_FORTS, Code_FORTS_Short";
			
		ИначеЕсли ИмяТаблицы = "DRs" Тогда //депозитарные расписки
			
			ИменаПолей = "ID, Share_ID, Issuer_ID, Type, ISIN, CFI, CUSIP, Register_Number, Register_Date, Share_Type, Level_Type, Bank_Custodian_ID,
						 |Factor_DRs, Factor_Shares, Code_MOEX";
			
		ИначеЕсли ИмяТаблицы = "Funds" Тогда //паи
			
			ИменаПолей = "ID, Issuer_ID, Type, Asset_Type, ISIN, CFI, Name_Ru, Name_En, Register_Number, Register_Date, Code_MOEX";
			
		ИначеЕсли ИмяТаблицы = "Firms" Тогда //юр.лица
			
			ИменаПолей = "ID, Name_Official_Ru, Name_Official_En, INN, Legal_Form_Type";
			
		ИначеЕсли ИмяТаблицы = "Persons" Тогда
			
			ИменаПолей = "ID, Name_Official_Ru, Name_Official_En";
			
		ИначеЕсли ИмяТаблицы = "Enums_Values" Тогда //описание типов
			
			ИменаПолей = "ID, UID, Enum_UID, Name_Ru, Name_En";
						
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для таблицы [" + ИмяТаблицы + "] не описаны поля");
			Продолжить;
		КонецЕсли;
		
		ТаблицаПриемникДанных = Новый ТаблицаЗначений;
		МассивИменПолей = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолей, ",", Истина, Истина);
		
		Для Каждого ИмяПоля Из МассивИменПолей Цикл
			Если (СтрНайти(ИмяПоля, "Amount") > 0) Или (СтрНайти(ИмяПоля, "Price") > 0) Или ИмяПоля = "Payment_Rate" Или ИмяПоля = "Volume" Или ИмяПоля = "Face_Value_Current" Тогда
				ТаблицаПриемникДанных.Колонки.Добавить(ИмяПоля, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(27, 12)));
			ИначеЕсли СтрНайти(ИмяПоля, "Date") > 0 Или СтрНайти(ИмяПоля, "Time") > 0 Тогда
				ТаблицаПриемникДанных.Колонки.Добавить(ИмяПоля, Новый ОписаниеТипов("Дата"));	
			Иначе
				ТаблицаПриемникДанных.Колонки.Добавить(ИмяПоля, Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаПриемникДанных.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
		СтруктураДанных.Вставить(ИмяТаблицы, ТаблицаПриемникДанных);
		
	КонецЦикла;
	
	ДанныеПервыхУзлов = Новый ТаблицаЗначений;
	ДанныеПервыхУзлов.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	ДанныеПервыхУзлов.Колонки.Добавить("ЗначенияАтрибутов");
	ДанныеПервыхУзлов.Колонки.Добавить("ФайлСоответствуетФормату", Новый ОписаниеТипов("Булево"));
	
	СтруктураДанных.Вставить("ДанныеПервыхУзлов", ДанныеПервыхУзлов);
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ЗаполнитьТаблицуЗначенийДаннымиИзОбъектаXTDO(ЗначниеОбъектаXDTO, ТаблицаПриемникДанных, ИмяТаблицы, ИмяФайла, ИспользуютсяСоставныеКодыУБрокера)
	
	ПоляДляКонвертацииЗначений = "";
	
	Для Каждого КолонкаТаблицы Из ТаблицаПриемникДанных.Колонки Цикл
		
		Если СтрНайти(КолонкаТаблицы.Имя, "Time") > 0 Или СтрНайти(КолонкаТаблицы.Имя, "Date") > 0 Тогда
			ПоляДляКонвертацииЗначений = ?(ПоляДляКонвертацииЗначений = "", "", ПоляДляКонвертацииЗначений + ",") + КолонкаТаблицы.Имя;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(ЗначниеОбъектаXDTO) = Тип("ОбъектXDTO") Тогда
						
		НоваяСтрокаТаблицы = ТаблицаПриемникДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, ЗначниеОбъектаXDTO);
		НоваяСтрокаТаблицы.Ключ = ИмяФайла;
		
		Если ИмяТаблицы = "Accounts_Divisions" Тогда	
			ЗаполнитьКодБрокераИСекцию(НоваяСтрокаТаблицы, ИспользуютсяСоставныеКодыУБрокера); 	
		КонецЕсли;
		
		Если ПоляДляКонвертацииЗначений <> "" Тогда 
			КонвертироватьЗначенияПолей(НоваяСтрокаТаблицы, ЗначниеОбъектаXDTO, ПоляДляКонвертацииЗначений);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЗначниеОбъектаXDTO) = Тип("СписокXDTO") Тогда
		
		Для Каждого СтрокаСписка Из ЗначниеОбъектаXDTO Цикл
			
			НоваяСтрокаТаблицы = ТаблицаПриемникДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаСписка);
			НоваяСтрокаТаблицы.Ключ = ИмяФайла;
			
			Если ИмяТаблицы = "Accounts_Divisions" Тогда	
				ЗаполнитьКодБрокераИСекцию(НоваяСтрокаТаблицы, ИспользуютсяСоставныеКодыУБрокера);	
			КонецЕсли;

			Если ПоляДляКонвертацииЗначений <> "" Тогда 
				КонвертироватьЗначенияПолей(НоваяСтрокаТаблицы, СтрокаСписка, ПоляДляКонвертацииЗначений);
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЕсли;
				
КонецПроцедуры

Процедура ЗаполнитьКодБрокераИСекцию(СтрокаТаблицы, ИспользуютсяСоставныеКодыУБрокера)
	
	Номер =	СтрокаТаблицы.Number;	
	
	Код = "";
	Секция = "";
		
	Если СтрНайти(Номер, "_VN") > 0 Тогда
		Код = СтрЗаменить(Номер, "_VN", "");
		Секция = "Внебиржевая";
	ИначеЕсли СтрНайти(Номер, "_OTC") > 0 Тогда
		Код = СтрЗаменить(Номер, "_OTC", "");
		Секция = "Внебиржевая";
	ИначеЕсли СтрНайти(Номер, "_FX") > 0 Тогда
		Код = СтрЗаменить(Номер, "_FX", "");
		Секция = "Валютная";
	ИначеЕсли СтрНайти(Номер, "_V") > 0 Тогда
		Код = СтрЗаменить(Номер, "_V", "");
		Секция = "Валютная";	
	ИначеЕсли СтрНайти(Номер, "V") > 0 Тогда
		Код = СтрЗаменить(Номер, "V", "");
		Секция = "Валютная";
	ИначеЕсли СтрНайти(Номер, "_R") > 0 Тогда 
		Код = СтрЗаменить(Номер, "_R", "");
		Секция = "Репо";
	ИначеЕсли СтрНайти(Номер, "_FO") > 0 Тогда
		Код = СтрЗаменить(Номер, "_FO", "");
		Секция = "Фортс";
	ИначеЕсли СтрНайти(Номер, "_F") > 0 Тогда
		Код = СтрЗаменить(Номер, "_F", "");
		Секция = "Фортс";
	ИначеЕсли СтрНайти(Номер, "_SPFI") > 0 Тогда
		Код = СтрЗаменить(Номер, "_SPFI", "");
		Секция = "Деривативы";
	Иначе
		
		Если ИспользуютсяСоставныеКодыУБрокера И СтрНайти(Номер, "_") > 0 Тогда
			Код = Лев(Номер, СтрНайти(Номер, "_") - 1);	
		Иначе
			Код = Номер;
		КонецЕсли;
		
		Секция = "Основная";
		
	КонецЕсли;

	СтрокаТаблицы.Number = Код;
	СтрокаТаблицы.Секция = Секция;
	
КонецПроцедуры

Процедура КонвертироватьЗначенияПолей(СтрокаПриемник, СтрокаИсточник, ПоляДляКонвертацииЗначений)
	
	СтруктураЗначений = Новый Структура(ПоляДляКонвертацииЗначений);
	
	ЗаполнитьЗначенияСвойств(СтруктураЗначений, СтрокаИсточник);
	
	Для Каждого ЭлементСтруктурыЗначений Из СтруктураЗначений Цикл
		
		Если ЗначениеЗаполнено(ЭлементСтруктурыЗначений.Значение) Тогда
			
			Если СтрНайти(ЭлементСтруктурыЗначений.Ключ, "Date") > 0 Тогда
				СтрокаПриемник[ЭлементСтруктурыЗначений.Ключ] = Дата(СтрЗаменить(ЭлементСтруктурыЗначений.Значение, "-", ""));
			ИначеЕсли СтрНайти(ЭлементСтруктурыЗначений.Ключ, "Time") > 0 Тогда
				СтрокаПриемник[ЭлементСтруктурыЗначений.Ключ] = Дата("00010101" + СтрЗаменить(ЭлементСтруктурыЗначений.Значение, ":", ""));
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьБиржевыеСделки_OTBR(МВТ)
	
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Сделка, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;

#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_Deals_With_Details.Date КАК ДатаСделки,
	    |	_Deals_With_Details.Time КАК ВремяСделки,
	    |	_Deals_With_Details.Market_Number КАК НомерСделки,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Direction = ""-1""
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	    |		КОГДА _Deals_With_Details.Direction = ""1""
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	    |		ИНАЧЕ """"
	    |	КОНЕЦ КАК ВидСделки,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Date <> _Deals_With_Details.Payment_Date
	    |				ИЛИ _Deals_With_Details.Date <> _Deals_With_Details.Delivery_Date
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ КАК ОтложенноеИсполнение,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ КАК РаздельноеИсполнение,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Payment_Date = _Deals_With_Details.Date
	    |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	    |		ИНАЧЕ _Deals_With_Details.Payment_Date
	    |	КОНЕЦ КАК ДатаОплаты,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Delivery_Date = _Deals_With_Details.Date
	    |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	    |		ИНАЧЕ _Deals_With_Details.Delivery_Date
	    |	КОНЕЦ КАК ДатаПоставки,
	    |	_Deals_With_Details.Security_ID КАК Security_ID,
	    |	_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	_Deals_With_Details.Рынок КАК Рынок,
	    |	_Deals_With_Details.ВалютаСделки КАК ВалютаСделки,
	    |	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
	    |	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	_Deals_With_Details.Partner_ID КАК Partner_ID,
	    |	ВЫБОР
	    |		КОГДА _РежимыБиржевыхТоргов.РежимПереговорныхСделок
	    |			ТОГДА ЕСТЬNULL(_Deals_With_Details.КонтрагентСсылка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
	    |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
	    |	КОНЕЦ КАК Контрагент,
	    |	_РежимыБиржевыхТоргов.Ссылка КАК РежимБиржевыхТоргов,
	    |	ЕСТЬNULL(_РежимыБиржевыхТоргов.РежимПереговорныхСделок, ЛОЖЬ) КАК РежимПереговорныхСделок,
	    |	ЕСТЬNULL(_РежимыБиржевыхТоргов.ВыкупЭмитентом, ЛОЖЬ) КАК ВыкупЭмитентом,
	    |	ЕСТЬNULL(_РежимыБиржевыхТоргов.ПервичноеРазмещение, ЛОЖЬ) КАК ПервичноеРазмещение,
	    |	ЕСТЬNULL(_РежимыБиржевыхТоргов.РепоСЦК, ЛОЖЬ) КАК РепоСЦК,
	    |	_Deals_With_Details.Market_Board КАК Market_Board,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Market_Board = ""SMAL""
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ КАК НеполныеЛоты,
	    |	_Deals_With_Details.SettleCode КАК SettleCode,
	    |	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
	    |	_Deals_With_Details.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Depo_Storage_Place = ""FORTS""
	    |			ТОГДА ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.СчетУчетаДеривативов)
	    |		ИНАЧЕ _ДепозитарныеСчета.Счет
	    |	КОНЕЦ КАК ДепозитарныйСчет,
	    |	_Deals_With_Details.Price КАК Цена,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	    |			ТОГДА _Deals_With_Details.Price_Percent
	    |		ИНАЧЕ 0
	    |	КОНЕЦ КАК ЦенаПроцент,
	    |	_Deals_With_Details.Volume КАК Количество,
	    |	_Deals_With_Details.Amount КАК Сумма,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	    |			ТОГДА _Deals_With_Details.ACI_Amount
	    |		ИНАЧЕ 0
	    |	КОНЕЦ КАК СуммаКупона,
	    |	_Deals_With_Details.SE_Charge_Date КАК ДатаОплатыТорговойКомиссии,
	    |	_Deals_With_Details.SE_Charge_Amount КАК СуммаТорговойКомиссии,
	    |	ЕСТЬNULL(ВалютыТорговойКомиссии.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаТорговойКомиссии,
	    |	ВЫБОР
	    |		КОГДА _Deals_With_Details.Market <> ""OTC""
	    |				И _Deals_With_Details.Date <> _Deals_With_Details.SE_Charge_Date
	    |				И _Deals_With_Details.SE_Charge_Date <> ДАТАВРЕМЯ(1, 1, 1)
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ КАК ОтложеннаяОплатаТорговойКомиссии,
	    |	ВЫБОР
	    |		КОГДА &ЭтоРэм_Траст
	    |				И (ЕСТЬNULL(_РежимыБиржевыхТоргов.ПервичноеРазмещение, ЛОЖЬ) = ИСТИНА
	    |					ИЛИ ЕСТЬNULL(_РежимыБиржевыхТоргов.ВыкупЭмитентом, ЛОЖЬ) = ИСТИНА
	    |					ИЛИ ЕСТЬNULL(_РежимыБиржевыхТоргов.Аукцион, ЛОЖЬ) = ИСТИНА)
	    |				И ЕСТЬNULL(_РежимыБиржевыхТоргов.флагРепо, ЛОЖЬ) = ЛОЖЬ
	    |				И _Deals_With_Details.Date >= ДАТАВРЕМЯ(2021, 4, 1)
	    |				И (_Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	    |					ИЛИ _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Акции
	    |					ИЛИ _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки)
	    |			ТОГДА _Deals_With_Details.ЭмитентЮрФизЛицо
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК РаскрытыйКонтрагент
	    |ПОМЕСТИТЬ _СделкиВнешниеДанные
	    |ИЗ
	    |	_Deals_With_Details КАК _Deals_With_Details
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _Money_Operations КАК _Money_Operations
	    |			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыТорговойКомиссии
	    |			ПО _Money_Operations.Payment_Currency_Code = ВалютыТорговойКомиссии.ISO_Code
	    |		ПО _Deals_With_Details.Record_UID = _Money_Operations.Deal_Record_UID
	    |			И _Deals_With_Details.SE_Charge_Amount = _Money_Operations.Payment_Amount
	    |			И (_Money_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.Add.SE.Fee"")
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыБиржевыхТоргов КАК _РежимыБиржевыхТоргов
	    |		ПО _Deals_With_Details.Market_Board = _РежимыБиржевыхТоргов.Код
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
	    |		ПО _Deals_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
	    |		ПО _Deals_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
	    |			И _Deals_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
	    |ГДЕ
	    |	_Deals_With_Details.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.IPO"")
	    |	И _Deals_With_Details.Is_Deal_Info = ""0""
	    |	И _Deals_With_Details.Market В (""MICEX"", ""FORTS"")
	    |	И _Deals_With_Details.Date = &НачалоПериода
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВЫБОР
	    |		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	    |			ТОГДА ""Покупка""
	    |		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	    |			ТОГДА ""Продажа""
	    |		ИНАЧЕ """"
	    |	КОНЕЦ + ""/"" + Сделка.НомерСделки КАК Ключ,
	    |	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, НЕОПРЕДЕЛЕНО) КАК РаскрытыйКонтрагент,
	    |	&Звездочка КАК Звездочка
	    |ИЗ
	    |	Документ.Сделка КАК Сделка
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	    |		ПО Сделка.Ссылка = ЗначенияДополнительныхСведений.Объект
	    |			И (ЗначенияДополнительныхСведений.Свойство = &РаскрытыйКонтрагент)
	    |			И (&ЭтоРэм_Траст)
	    |ГДЕ
	    |	Сделка.Организация = &Организация
	    |	И НЕ Сделка.ПометкаУдаления
	    |	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	    |	И Сделка.Брокер = &Брокер
	    |	И Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |	И НЕ Сделка.РежимБиржевыхТоргов.РежимВнебиржевыхСделок
	    |	И НЕ Сделка.СчетДоверительногоУправления В
	    |				(ВЫБРАТЬ
	    |					_СчетаИсключеныИзЗагрузки.Счет
	    |				ИЗ
	    |					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";

#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*"); 

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("ЭтоРэм_Траст", (ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Или ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")));
	Запрос.УстановитьПараметр("РаскрытыйКонтрагент", ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "_РаскрытыйКонтрагент"));
	
	СделкиДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_СделкиВнешниеДанные"].ПолучитьДанные().Выбрать();
						
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЧтения = Новый Массив;
						
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Строка(Выборка.ВидСделки) + "/" + Выборка.НомерСделки;
		НоваяСтрокаОперации.Описание     = "Бирж. сделка № " + Выборка.НомерСделки + " [" + Строка(Выборка.ВидСделки) + "]";
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = Выборка.ДатаСделки + (Выборка.ВремяСделки - Дата(1, 1, 1));
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.ВидСделки                    = Выборка.ВидСделки;
		РеквизитыШапки.Брокер                       = Брокер;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;	
		РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.ВалютаСделки                 = Выборка.ВалютаСделки;
		РеквизитыШапки.НомерСделки                  = Выборка.НомерСделки;
		РеквизитыШапки.ВремяСделки                  = Выборка.ВремяСделки;
		РеквизитыШапки.КодРасчетовНаБирже           = Выборка.SettleCode;
		РеквизитыШапки.НеполныеЛоты                 = Выборка.НеполныеЛоты;
		РеквизитыШапки.Контрагент                   = Выборка.Контрагент;
		РеквизитыШапки.РасчетныйСчетКонтрагента     = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.НомерДоговораКонтрагента     = "";
		РеквизитыШапки.Договор                 		= Справочники.Договоры.ПустаяСсылка();
		РеквизитыШапки.ОтложенноеИсполнение         = Выборка.ОтложенноеИсполнение;
		РеквизитыШапки.ДатаИсполнения               = ?(Выборка.ОтложенноеИсполнение, Выборка.ДатаОплаты, Дата(1, 1, 1));
		РеквизитыШапки.РаздельноеИсполнение         = Выборка.РаздельноеИсполнение;
		РеквизитыШапки.ДатаОплаты                   = Выборка.ДатаОплаты;
		РеквизитыШапки.ДатаПоставки                 = Выборка.ДатаПоставки;
		РеквизитыШапки.ВалютаОплаты                 = Выборка.ВалютаОплаты;
		РеквизитыШапки.СобственныйКурсОплаты        = Ложь;
		РеквизитыШапки.КурсОплаты                   = Неопределено;
		РеквизитыШапки.ПлатежноеУсловиеСделки       = "";
		РеквизитыШапки.НомерПорученияУБрокера       = "";
		РеквизитыШапки.ДатаПорученияУБрокера        = Дата(1, 1, 1);

		Если Не ЗначениеЗаполнено(Выборка.РежимБиржевыхТоргов) Тогда
			Если Выборка.Рынок <> Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда 
				ОшибкиЧтения.Добавить("Не удалось определить режим торгов по коду. Проверьте наличие режима биржевых торгов [" + Выборка.Market_Board + "] в справочнике!");
			КонецЕсли;	
			РеквизитыШапки.РежимБиржевыхТоргов      = Справочники.РежимыБиржевыхТоргов.ПустаяСсылка();
		Иначе
			РеквизитыШапки.РежимБиржевыхТоргов      = Выборка.РежимБиржевыхТоргов;
		КонецЕсли;
		
			РеквизитыШапки.РежимПереговорныхСделок  = Выборка.РежимПереговорныхСделок;
			РеквизитыШапки.ВыкупЭмитентом           = Выборка.ВыкупЭмитентом;
			РеквизитыШапки.ПервичноеРазмещение      = Выборка.ПервичноеРазмещение;
		
		Если Выборка.РежимПереговорныхСделок И ЗначениеЗаполнено(Выборка.Partner_ID) И Не ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить контрагента по матрих ID [" + Выборка.Partner_ID + "]! Проверьте наличие кода в регистре [Коды во внешних системах].");
		КонецЕсли;
			
		РеквизитыШапки.ПриобретениеПаев				= Ложь;
		РеквизитыШапки.ДепозитарныйСчетКонтрагента	= Справочники.ДепозитарныеСчета.ПустаяСсылка();
		РеквизитыШапки.Рынок                        = Выборка.Рынок;
		РеквизитыШапки.ВалютаТорговойКомиссии       = ?(ЭтотОбъект.ДатаИмпорта < Дата(2024, 07, 10) И Не ЗначениеЗаполнено(Выборка.ВалютаТорговойКомиссии), ЭтотОбъект.Организация.ВалютаУчета, Выборка.ВалютаТорговойКомиссии);
		
		РеквизитыШапки.ОтложеннаяОплатаТорговойКомиссии = Выборка.ОтложеннаяОплатаТорговойКомиссии;
		РеквизитыШапки.ДатаОплатыТорговойКомиссии       = ?(Выборка.ОтложеннаяОплатаТорговойКомиссии, Выборка.ДатаОплатыТорговойКомиссии, Дата(1, 1, 1));
		
		Если Не ЗначениеЗаполнено(Выборка.МестоХраненияДенежныхСредств) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить место хранения денежных средств по коду [" + Выборка.Money_Storage_Place + "]!");
		Иначе
			РеквизитыШапки.МестоХранения = Выборка.МестоХраненияДенежныхСредств;
		КонецЕсли;
		
		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		РеквизитыЦенныеБумаги.НомерСтроки      = 1;
		
		Если ЗначениеЗаполнено(Выборка.ЦеннаяБумага) Тогда
			РеквизитыЦенныеБумаги.ЦеннаяБумага     = Выборка.ЦеннаяБумага;
		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить ценную бумагу по коду во внешней системе [" + Выборка.Security_ID + "]!");
		КонецЕсли;
		
		РеквизитыЦенныеБумаги.Количество       = ?(Выборка.Количество = 0, 1, Выборка.Количество);		
		РеквизитыЦенныеБумаги.Сумма            = Выборка.Сумма;
		РеквизитыЦенныеБумаги.СуммаКупона      = Выборка.СуммаКупона;
		РеквизитыЦенныеБумаги.Цена             = Выборка.Цена;
		РеквизитыЦенныеБумаги.ЦенаПроцент      = Выборка.ЦенаПроцент;
		РеквизитыЦенныеБумаги.ЦенаКупона       = Окр(Выборка.СуммаКупона / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги);
		РеквизитыЦенныеБумаги.ТорговаяКомиссия = Выборка.СуммаТорговойКомиссии;
		
		Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
			РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
		Иначе
			Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
			КонецЕсли;
		КонецЕсли;
		
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги", РеквизитыШапки, ЦенныеБумаги);
		
		Если ЗначениеЗаполнено(Выборка.РаскрытыйКонтрагент) Тогда	
			НоваяСтрокаОперации.НовыеРеквизиты.Вставить("ДопСведения", Новый Структура("РаскрытыйКонтрагент", Выборка.РаскрытыйКонтрагент));	
		КонецЕсли;
				
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, СделкиДанныеСистемы, ПоляДокумента, "КонтрагентНаБирже");
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьИсполненияБиржевыхСделок_OTBR(МВТ, КонтролироватьНепроведенныеДокументы)
	
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.ИсполнениеОбязательствПоСделке, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК ЗначенияПолученыИзРегистра,
		|	УсловияСделокСрезПоследних.Сделка.НомерСделки КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(УсловияСделокСрезПоследних.ДатаИсполнения, ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Проведен,
		|	ЛОЖЬ КАК ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ДОБАВИТЬКДАТЕ(УсловияСделокСрезПоследних.ДатаИсполнения, СЕКУНДА, 34200)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(УсловияСделокСрезПоследних.ДатаИсполнения, СЕКУНДА, 34201)
		|	КОНЕЦ КАК Дата,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплаты,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоставки,
		|	УсловияСделокСрезПоследних.Организация КАК Организация,
		|	УсловияСделокСрезПоследних.Сделка КАК Основание,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке) КАК ВидЗадолженности,
		|	УсловияСделокСрезПоследних.Сделка.ВидСделки КАК ВидСделки,
		|	УсловияСделокСрезПоследних.Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокСрезПоследних.Рынок КАК Рынок,
		|	УсловияСделокСрезПоследних.Сделка.Брокер КАК Брокер,
		|	УсловияСделокСрезПоследних.Сделка.МестоХранения КАК МестоХранения,
		|	УсловияСделокСрезПоследних.Сделка.РасчетныйСчет КАК РасчетныйСчет,
		|	УсловияСделокСрезПоследних.Сделка.ВалютаСделки КАК ВалютаСделки,
		|	1 КАК НомерСтроки,
		|	УсловияСделокСрезПоследних.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.Количество КАК Количество,
		|	УсловияСделокСрезПоследних.Цена КАК Цена,
		|	УсловияСделокСрезПоследних.ЦенаПроцент КАК ЦенаПроцент,
		|	УсловияСделокСрезПоследних.ЦенаКупона КАК ЦенаКупона,
		|	УсловияСделокСрезПоследних.Сумма КАК Сумма,
		|	УсловияСделокСрезПоследних.СуммаКупона КАК СуммаКупона
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	РегистрСведений.УсловияСделок.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокСрезПоследних
		|ГДЕ
		|	УсловияСделокСрезПоследних.Отменено = ЛОЖЬ
		|	И УсловияСделокСрезПоследних.ДатаИсполнения >= &НачалоПериода
		|	И НЕ УсловияСделокСрезПоследних.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|	И УсловияСделокСрезПоследних.Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И НАЧАЛОПЕРИОДА(УсловияСделокСрезПоследних.Сделка.Дата, ДЕНЬ) <= &НачалоПериода
		|	И УсловияСделокСрезПоследних.Сделка.Брокер = &Брокер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ИсполнениеОбязательствПоСделке.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""покупка""
		|		КОГДА ИсполнениеОбязательствПоСделке.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ""продажа""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ""/"" + ИсполнениеОбязательствПоСделке.Основание.НомерСделки КАК Ключ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ) <= &ТекущаяДата
		|				И НЕ ИсполнениеОбязательствПоСделке.Проведен
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлОшибкаНепроведенногоДокумента,
		|	НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ) КАК ПроверяемаяДата,
		|	ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнениеОбязательствПоСделке.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ТекущиеОперации
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО ИсполнениеОбязательствПоСделке.Основание = Сделка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО ИсполнениеОбязательствПоСделке.Ссылка = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|ГДЕ
		|	ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И НЕ ИсполнениеОбязательствПоСделке.ПометкаУдаления
		|	И НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ) >= &НачалоПериода
		|	И НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ) <= &НачалоПериода
		|	И ИсполнениеОбязательствПоСделке.Брокер = &Брокер
		|	И ИсполнениеОбязательствПоСделке.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И НЕ ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|	И Сделка.Организация = &Организация
		|	И Сделка.Брокер = &Брокер
		|	И Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТекущиеОперации.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ТекущиеОперации.ПроверяемаяДата КАК ПроверяемаяДата,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ТекущиеОперации.Ключ) КАК Количество
		|ПОМЕСТИТЬ _НепроведенныеИсполнения
		|ИЗ
		|	_ТекущиеОперации КАК _ТекущиеОперации
		|ГДЕ
		|	&КонтролироватьНепроведенные
		|	И _ТекущиеОперации.ФлОшибкаНепроведенногоДокумента = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТекущиеОперации.СчетДоверительногоУправления,
		|	_ТекущиеОперации.ПроверяемаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияСделок.ЗначенияПолученыИзРегистра КАК ЗначенияПолученыИзРегистра,
		|	_ИсполненныеСделки.Market_Number КАК НомерСделки,
		|	_УсловияСделок.Проведен КАК Проведен,
		|	_УсловияСделок.ПометкаУдаления КАК ПометкаУдаления,
		|	_УсловияСделок.Дата КАК Дата,
		|	_УсловияСделок.ДатаОплаты КАК ДатаОплаты,
		|	_УсловияСделок.ДатаПоставки КАК ДатаПоставки,
		|	_УсловияСделок.Организация КАК Организация,
		|	_УсловияСделок.Основание КАК Основание,
		|	_УсловияСделок.ВидЗадолженности КАК ВидЗадолженности,
		|	_УсловияСделок.ВидСделки КАК ВидСделки,
		|	_УсловияСделок.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_УсловияСделок.Рынок КАК Рынок,
		|	_УсловияСделок.Брокер КАК Брокер,
		|	_УсловияСделок.МестоХранения КАК МестоХранения,
		|	_УсловияСделок.РасчетныйСчет КАК РасчетныйСчет,
		|	_УсловияСделок.ВалютаСделки КАК ВалютаСделки,
		|	_УсловияСделок.НомерСтроки КАК НомерСтроки,
		|	_УсловияСделок.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_УсловияСделок.Количество КАК Количество,
		|	_УсловияСделок.Цена КАК Цена,
		|	_УсловияСделок.ЦенаПроцент КАК ЦенаПроцент,
		|	_УсловияСделок.ЦенаКупона КАК ЦенаКупона,
		|	_УсловияСделок.Сумма КАК Сумма,
		|	_УсловияСделок.СуммаКупона КАК СуммаКупона,
		|	_ИсполненныеСделки.Ключ КАК ИмяФайла,
		|	"""" КАК Depo_Storage_Place,
		|	"""" КАК КоличествоДепозитарныхСчетов
		|ПОМЕСТИТЬ _ИсполненияСделокВнешниеДанные
		|ИЗ
		|	_ИсполненныеСделки КАК _ИсполненныеСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|		ПО _ИсполненныеСделки.Market_Number = _УсловияСделок.НомерСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО _ИсполненныеСделки.Market_Number = СделкаСВалютой.НомерСделки
		|			И (СделкаСВалютой.ПометкаУдаления = ЛОЖЬ)
		|			И (СделкаСВалютой.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|ГДЕ
		|	_ИсполненныеСделки.Date = &НачалоПериода
		|	И _ИсполненныеСделки.Deal_Date <> &НачалоПериода
		|	И _ИсполненныеСделки.ТипСделки = ""Сделка""
		|	И _ИсполненныеСделки.Оплата = 1
		|	И _ИсполненныеСделки.Поставка = 1
		|	И СделкаСВалютой.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	_Deals_Incomplete_With_Details.Market_Number,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	_Deals_Incomplete_With_Details.Date,
		|	_Deals_Incomplete_With_Details.Payment_Date,
		|	_Deals_Incomplete_With_Details.Delivery_Date,
		|	_УсловияСделок.Организация,
		|	_УсловияСделок.Основание,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке),
		|	ВЫБОР
		|		КОГДА _Deals_Incomplete_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_Incomplete_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	_Deals_Incomplete_With_Details.СчетДоверительногоУправления,
		|	_Deals_Incomplete_With_Details.Рынок,
		|	_УсловияСделок.Брокер,
		|	_МестаХраненияДенежныхСредств.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка),
		|	_Deals_Incomplete_With_Details.ВалютаСделки КАК ВалютаСделки,
		|	1,
		|	_ДепозитарныеСчета.Счет,
		|	_Deals_Incomplete_With_Details.ЦеннаяБумага,
		|	_Deals_Incomplete_With_Details.Volume,
		|	_Deals_Incomplete_With_Details.Price,
		|	ВЫБОР
		|		КОГДА _Deals_Incomplete_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_Incomplete_With_Details.Price_Percent
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	_Deals_Incomplete_With_Details.Amount,
		|	ВЫБОР
		|		КОГДА _Deals_Incomplete_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_Incomplete_With_Details.ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	"""",
		|	_Deals_Incomplete_With_Details.Depo_Storage_Place,
		|	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0)
		|ИЗ
		|	_Deals_Incomplete_With_Details КАК _Deals_Incomplete_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Deals_Incomplete_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Deals_Incomplete_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Deals_Incomplete_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|		ПО _Deals_Incomplete_With_Details.Market_Number = _УсловияСделок.НомерСделки
		|			И _Deals_Incomplete_With_Details.СчетДоверительногоУправления = _УсловияСделок.СчетДоверительногоУправления
		|ГДЕ
		|	_Deals_Incomplete_With_Details.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.IPO"")
		|	И _Deals_Incomplete_With_Details.Is_Deal_Info = ""0""
		|	И _Deals_Incomplete_With_Details.Is_Cancelled <> ""1""
		|	И _Deals_Incomplete_With_Details.Market = ""MICEX""
		|	И _Deals_Incomplete_With_Details.Deal_Info_Type <> ""Deals.Info.Type.Cancellation""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ) = &ТекущаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ИсполнениеОбязательствПоСделке.Проведен
		|	КОНЕЦ КАК Проведен,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТекущиеОперации КАК _ТекущиеОперации
		|		ПО ИсполнениеОбязательствПоСделке.Ссылка = _ТекущиеОперации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _УсловияСделок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ТекущиеОперации";
#КонецОбласти

	ТекДата = НачалоДня(ТекущаяДатаСеанса()); 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");  
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("КонтролироватьНепроведенные", КонтролироватьНепроведенныеДокументы);
		
	ИсполненияСделокДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_ИсполненияСделокВнешниеДанные"].ПолучитьДанные().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = НРег(Выборка.ВидСделки) + "/" + Выборка.НомерСделки;
		НоваяСтрокаОперации.Описание     = "Исполн. бирж. сделки, № " + Выборка.НомерСделки + ?(ЗначениеЗаполнено(Выборка.ВидСделки), ", [" + Строка(Выборка.ВидСделки) + "], " + Выборка.ЦеннаяБумага, "");
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;

		РеквизитыШапки        = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		
		РеквизитыШапки.КонтрагентНаБирже = "";
		
		Если Не ЗначениеЗаполнено(Выборка.ЗначенияПолученыИзРегистра) Тогда
			
		 	ОшибкиЧтения.Добавить("Не удалось сформировать документ [исполнение обязательств по сделке]. Не найдена биржевая сделка по номеру [" + Выборка.НомерСделки + "]. Данные загружены из файла [" + Выборка.ИмяФайла + "].");
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
			Продолжить;

		ИначеЕсли Выборка.ЗначенияПолученыИзРегистра Тогда

			ЗаполнитьЗначенияСвойств(РеквизитыШапки, Выборка);
			ЗаполнитьЗначенияСвойств(РеквизитыЦенныеБумаги, Выборка);
			
		Иначе //данные получены из файла брокера (Deals_Incomplete - незавершенные сделки)
	
			РеквизитыШапки.Проведен          = ?(Выборка.ДатаОплаты <= ТекДата И Выборка.ДатаПоставки <= ТекДата, Истина, Ложь);
			РеквизитыШапки.ПометкаУдаления   = ЛОЖЬ;
			РеквизитыШапки.Дата              = Выборка.ДатаОплаты + ?(Выборка.ВидСделки = Перечисления.ВидыСделок.Покупка, 34200, 34201);
			РеквизитыШапки.Организация       = Выборка.Организация;
			
			Если ЗначениеЗаполнено(Выборка.Основание) Тогда
				РеквизитыШапки.Основание     = Выборка.Основание;
			Иначе
				ОшибкиЧтения.Добавить("Не удалось сформировать документ [исполнение обязательств по сделке]. Не найдена биржевая сделка-основание по номеру [" + Выборка.НомерСделки + "].");	
			КонецЕсли;
			
			РеквизитыШапки.ВидЗадолженности  = Выборка.ВидЗадолженности;
			РеквизитыШапки.ВидСделки         = Выборка.ВидСделки;
			РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
			РеквизитыШапки.Рынок             = Выборка.Рынок;
			РеквизитыШапки.Брокер            = Выборка.Брокер;
			РеквизитыШапки.МестоХранения     = Выборка.МестоХранения;
			РеквизитыШапки.РасчетныйСчет     = Выборка.РасчетныйСчет;
			РеквизитыШапки.ВалютаСделки      = Выборка.Валютасделки;
			
			РеквизитыЦенныеБумаги.НомерСтроки = Выборка.НомерСтроки;
			
			Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
				РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
			Иначе
				Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
					ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
				Иначе
					ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
				КонецЕсли;
			КонецЕсли;

			РеквизитыЦенныеБумаги.ЦеннаяБумага = Выборка.ЦеннаяБумага;
			РеквизитыЦенныеБумаги.Количество   = ?(Выборка.Количество = 0, 1, Выборка.Количество);
			РеквизитыЦенныеБумаги.Цена         = Выборка.Цена;
			РеквизитыЦенныеБумаги.ЦенаПроцент  = Выборка.ЦенаПроцент;
			РеквизитыЦенныеБумаги.СуммаКупона  = Выборка.СуммаКупона;
			РеквизитыЦенныеБумаги.ЦенаКупона   = Окр(Выборка.СуммаКупона / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги);
			РеквизитыЦенныеБумаги.Сумма        = Выборка.Сумма;
			
		КонецЕсли;
		
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги", РеквизитыШапки, ЦенныеБумаги);
				
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
		
	КонецЦикла;
		
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ИсполненияСделокДанныеСистемы, ПоляДокумента);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьОплатыБиржевыхСделокСВалютой_OTBR(МВТ)
	
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Оплата, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
		
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаСВалютой.Ссылка КАК Ссылка,
		|	СделкаСВалютой.ПометкаУдаления КАК ПометкаУдаления,
		|	СделкаСВалютой.Проведен КАК Проведен,
		|	СделкаСВалютой.Организация КАК Организация,
		|	СделкаСВалютой.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СделкаСВалютой.ВидСделки КАК ВидСделки,
		|	СделкаСВалютой.МестоХранения КАК МестоХранения,
		|	СделкаСВалютой.Брокер КАК Брокер,
		|	СделкаСВалютой.Валюта КАК Валюта,
		|	СделкаСВалютой.Контрвалюта КАК Контрвалюта,
		|	СделкаСВалютой.Сумма КАК Сумма,
		|	СделкаСВалютой.СуммаКонтрвалюты КАК СуммаКонтрвалюты,
		|	СделкаСВалютой.ДатаИсполнения КАК ДатаИсполнения,
		|	СделкаСВалютой.НомерСделки КАК НомерСделки,
		|	"""" + СделкаСВалютой.НомерСделки + ВЫБОР
		|		КОГДА СделкаСВалютой.ТипСделки = ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.СвопВтораяЧасть)
		|			ТОГДА ""/2""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Ключ
		|ПОМЕСТИТЬ _СделкиСВалютой
		|ИЗ
		|	Документ.СделкаСВалютой КАК СделкаСВалютой
		|ГДЕ
		|	СделкаСВалютой.Организация = &Организация
		|	И СделкаСВалютой.Брокер = &Брокер
		|	И СделкаСВалютой.Проведен
		|	И НЕ СделкаСВалютой.ПометкаУдаления
		|	И СделкаСВалютой.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И (НАЧАЛОПЕРИОДА(СделкаСВалютой.Дата, ДЕНЬ) = &НачалоПериода
		|			ИЛИ СделкаСВалютой.ДатаИсполнения = &НачалоПериода)
		|	И НАЧАЛОПЕРИОДА(СделкаСВалютой.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(СделкаСВалютой.ДатаИсполнения, ДЕНЬ)
		|	И НЕ СделкаСВалютой.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|	И СделкаСВалютой.НомерСделки В
		|			(ВЫБРАТЬ
		|				_ИсполненныеСделки.Market_Number
		|			ИЗ
		|				_ИсполненныеСделки КАК _ИсполненныеСделки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиСВалютой.Ссылка КАК Основание,
		|	ЛОЖЬ КАК ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА СделкиСВалютой.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ДОБАВИТЬКДАТЕ(СделкиСВалютой.ДатаИсполнения, СЕКУНДА, 61201)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(СделкиСВалютой.ДатаИсполнения, СЕКУНДА, 36000)
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА СделкиСВалютой.ДатаИсполнения <= &ТекущаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Проведен,
		|	СделкиСВалютой.Организация КАК Организация,
		|	СделкиСВалютой.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА СделкиСВалютой.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке) КАК ВидЗадолженности,
		|	ЛОЖЬ КАК Аванс,
		|	СделкиСВалютой.Брокер КАК Брокер,
		|	СделкиСВалютой.МестоХранения КАК МестоХранения,
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка) КАК РасчетныйСчет,
		|	СделкиСВалютой.Валюта КАК ВалютаОплаты,
		|	ЗНАЧЕНИЕ(Документ.СтрокаБанковскойВыписки.ПустаяСсылка) КАК СтрокаБанковскойВыписки,
		|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Контрагент,
		|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка) КАК Договор,
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка) КАК РасчетныйСчетКонтрагента,
		|	СделкиСВалютой.Валюта КАК Валюта,
		|	СделкиСВалютой.Сумма КАК Сумма,
		|	0 КАК СуммаКупона,
		|	НЕОПРЕДЕЛЕНО КАК КурсОплаты,
		|	ЛОЖЬ КАК СобственныйКурсОплаты,
		|	СделкиСВалютой.Сумма КАК СуммаОплаты,
		|	0 КАК СуммаОплатыКупона,
		|	1 КАК НомерСтроки,
		|	СделкиСВалютой.Ключ КАК Ключ
		|ПОМЕСТИТЬ _ДанныеДляОплат
		|ИЗ
		|	_СделкиСВалютой КАК СделкиСВалютой
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкиСВалютой.Ссылка,
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА СделкиСВалютой.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ДОБАВИТЬКДАТЕ(СделкиСВалютой.ДатаИсполнения, СЕКУНДА, 36000)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(СделкиСВалютой.ДатаИсполнения, СЕКУНДА, 61201)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СделкиСВалютой.ДатаИсполнения <= &ТекущаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	СделкиСВалютой.Организация,
		|	СделкиСВалютой.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА СделкиСВалютой.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке),
		|	ЛОЖЬ,
		|	СделкиСВалютой.Брокер,
		|	СделкиСВалютой.МестоХранения,
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка),
		|	СделкиСВалютой.Контрвалюта,
		|	ЗНАЧЕНИЕ(Документ.СтрокаБанковскойВыписки.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка),
		|	СделкиСВалютой.Контрвалюта,
		|	СделкиСВалютой.СуммаКонтрвалюты,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	СделкиСВалютой.СуммаКонтрвалюты,
		|	0,
		|	1,
		|	СделкиСВалютой.Ключ
		|ИЗ
		|	_СделкиСВалютой КАК СделкиСВалютой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Оплата.Ссылка КАК ОплатаСсылка,
		|	Оплата.ПометкаУдаления КАК ПометкаУдаления,
		|	Оплата.Дата КАК Дата,
		|	Оплата.Проведен КАК Проведен,
		|	Оплата.Организация КАК Организация,
		|	Оплата.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Оплата.ВидДвижения КАК ВидДвижения,
		|	Оплата.ВидЗадолженности КАК ВидЗадолженности,
		|	Оплата.Аванс КАК Аванс,
		|	Оплата.Брокер КАК Брокер,
		|	Оплата.МестоХранения КАК МестоХранения,
		|	Оплата.РасчетныйСчет КАК РасчетныйСчет,
		|	Оплата.ВалютаОплаты КАК ВалютаОплаты,
		|	Оплата.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки,
		|	ОплатаОснования.НомерСтроки КАК НомерСтроки,
		|	ОплатаОснования.Основание КАК Основание,
		|	Оплата.Контрагент КАК Контрагент,
		|	Оплата.Договор КАК Договор,
		|	Оплата.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента,
		|	ОплатаОснования.Валюта КАК Валюта,
		|	ОплатаОснования.Сумма КАК Сумма,
		|	ОплатаОснования.СуммаКупона КАК СуммаКупона,
		|	ОплатаОснования.КурсОплаты КАК КурсОплаты,
		|	ОплатаОснования.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	ОплатаОснования.СуммаОплаты КАК СуммаОплаты,
		|	ОплатаОснования.СуммаОплатыКупона КАК СуммаОплатыКупона,
		|	"""" + _СделкиСВалютой.Ключ + "" / "" + ВЫБОР
		|		КОГДА Оплата.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ""Расход""
		|		ИНАЧЕ ""Приход""
		|	КОНЕЦ КАК Ключ
		|ПОМЕСТИТЬ _Оплаты
		|ИЗ
		|	_СделкиСВалютой КАК _СделкиСВалютой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|			ПО ОплатаОснования.Ссылка = Оплата.Ссылка
		|		ПО _СделкиСВалютой.Ссылка = ОплатаОснования.Основание
		|ГДЕ
		|	Оплата.Организация = &Организация
		|	И Оплата.Брокер = &Брокер
		|	И Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Новый"" КАК Статус,
		|	"""" + _ДанныеДляОплат.Ключ + "" / "" + ВЫБОР
		|		КОГДА _ДанныеДляОплат.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ""Расход""
		|		ИНАЧЕ ""Приход""
		|	КОНЕЦ КАК Ключ,
		|	_ДанныеДляОплат.ПометкаУдаления КАК ПометкаУдаления,
		|	_ДанныеДляОплат.Дата КАК Дата,
		|	_ДанныеДляОплат.Проведен КАК Проведен,
		|	_ДанныеДляОплат.Организация КАК Организация,
		|	_ДанныеДляОплат.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДанныеДляОплат.ВидДвижения КАК ВидДвижения,
		|	_ДанныеДляОплат.ВидЗадолженности КАК ВидЗадолженности,
		|	_ДанныеДляОплат.Аванс КАК Аванс,
		|	_ДанныеДляОплат.Брокер КАК Брокер,
		|	_ДанныеДляОплат.МестоХранения КАК МестоХранения,
		|	_ДанныеДляОплат.РасчетныйСчет КАК РасчетныйСчет,
		|	_ДанныеДляОплат.ВалютаОплаты КАК ВалютаОплаты,
		|	_ДанныеДляОплат.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки,
		|	_ДанныеДляОплат.НомерСтроки КАК НомерСтроки,
		|	_ДанныеДляОплат.Основание КАК Основание,
		|	_ДанныеДляОплат.Контрагент КАК Контрагент,
		|	_ДанныеДляОплат.Договор КАК Договор,
		|	_ДанныеДляОплат.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента,
		|	_ДанныеДляОплат.Валюта КАК Валюта,
		|	_ДанныеДляОплат.Сумма КАК Сумма,
		|	_ДанныеДляОплат.СуммаКупона КАК СуммаКупона,
		|	_ДанныеДляОплат.КурсОплаты КАК КурсОплаты,
		|	_ДанныеДляОплат.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	_ДанныеДляОплат.СуммаОплаты КАК СуммаОплаты,
		|	_ДанныеДляОплат.СуммаОплатыКупона КАК СуммаОплатыКупона,
		|	_Оплаты.ОплатаСсылка КАК ОплатаСсылка
		|ПОМЕСТИТЬ _ОплатыСделокСВалютойРасчетные
		|ИЗ
		|	_ДанныеДляОплат КАК _ДанныеДляОплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Оплаты КАК _Оплаты
		|		ПО _ДанныеДляОплат.Основание = _Оплаты.Основание
		|			И _ДанныеДляОплат.НомерСтроки = _Оплаты.НомерСтроки
		|			И _ДанныеДляОплат.ВидДвижения = _Оплаты.ВидДвижения
		|ГДЕ
		|	(_Оплаты.ОплатаСсылка ЕСТЬ NULL
		|			ИЛИ _ДанныеДляОплат.ПометкаУдаления <> _Оплаты.ПометкаУдаления
		|			ИЛИ _ДанныеДляОплат.Дата <> _Оплаты.Дата
		|			ИЛИ _ДанныеДляОплат.Проведен <> _Оплаты.Проведен
		|			ИЛИ _ДанныеДляОплат.Организация <> _Оплаты.Организация
		|			ИЛИ _ДанныеДляОплат.СчетДоверительногоУправления <> _Оплаты.СчетДоверительногоУправления
		|			ИЛИ _ДанныеДляОплат.ВидЗадолженности <> _Оплаты.ВидЗадолженности
		|			ИЛИ _ДанныеДляОплат.Аванс <> _Оплаты.Аванс
		|			ИЛИ _ДанныеДляОплат.Брокер <> _Оплаты.Брокер
		|			ИЛИ _ДанныеДляОплат.МестоХранения <> _Оплаты.МестоХранения
		|			ИЛИ _ДанныеДляОплат.РасчетныйСчет <> _Оплаты.РасчетныйСчет
		|			ИЛИ _ДанныеДляОплат.ВалютаОплаты <> _Оплаты.ВалютаОплаты
		|			ИЛИ _ДанныеДляОплат.СтрокаБанковскойВыписки <> _Оплаты.СтрокаБанковскойВыписки
		|			ИЛИ _ДанныеДляОплат.Контрагент <> _Оплаты.Контрагент
		|			ИЛИ _ДанныеДляОплат.Договор <> _Оплаты.Договор
		|			ИЛИ _ДанныеДляОплат.РасчетныйСчетКонтрагента <> _Оплаты.РасчетныйСчетКонтрагента
		|			ИЛИ _ДанныеДляОплат.Валюта <> _Оплаты.Валюта
		|			ИЛИ _ДанныеДляОплат.Сумма <> _Оплаты.Сумма
		|			ИЛИ _ДанныеДляОплат.СуммаКупона <> _Оплаты.СуммаКупона
		|			ИЛИ _ДанныеДляОплат.КурсОплаты <> _Оплаты.КурсОплаты
		|			ИЛИ _ДанныеДляОплат.СобственныйКурсОплаты <> _Оплаты.СобственныйКурсОплаты
		|			ИЛИ _ДанныеДляОплат.СуммаОплаты <> _Оплаты.СуммаОплаты
		|			ИЛИ _ДанныеДляОплат.СуммаОплатыКупона <> _Оплаты.СуммаОплатыКупона)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Оплаты.Ключ КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	_ДанныеДляОплат КАК _ДанныеДляОплат
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Оплаты КАК _Оплаты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|			ПО _Оплаты.ОплатаСсылка = Оплата.Ссылка
		|		ПО _ДанныеДляОплат.Основание = _Оплаты.Основание
		|			И _ДанныеДляОплат.НомерСтроки = _Оплаты.НомерСтроки
		|			И _ДанныеДляОплат.ВидДвижения = _Оплаты.ВидДвижения
		|ГДЕ
		|	(_ДанныеДляОплат.Основание ЕСТЬ NULL
		|			ИЛИ _ДанныеДляОплат.ПометкаУдаления <> _Оплаты.ПометкаУдаления
		|			ИЛИ _ДанныеДляОплат.Дата <> _Оплаты.Дата
		|			ИЛИ _ДанныеДляОплат.Проведен <> _Оплаты.Проведен
		|			ИЛИ _ДанныеДляОплат.Организация <> _Оплаты.Организация
		|			ИЛИ _ДанныеДляОплат.СчетДоверительногоУправления <> _Оплаты.СчетДоверительногоУправления
		|			ИЛИ _ДанныеДляОплат.ВидЗадолженности <> _Оплаты.ВидЗадолженности
		|			ИЛИ _ДанныеДляОплат.Аванс <> _Оплаты.Аванс
		|			ИЛИ _ДанныеДляОплат.Брокер <> _Оплаты.Брокер
		|			ИЛИ _ДанныеДляОплат.МестоХранения <> _Оплаты.МестоХранения
		|			ИЛИ _ДанныеДляОплат.РасчетныйСчет <> _Оплаты.РасчетныйСчет
		|			ИЛИ _ДанныеДляОплат.ВалютаОплаты <> _Оплаты.ВалютаОплаты
		|			ИЛИ _ДанныеДляОплат.СтрокаБанковскойВыписки <> _Оплаты.СтрокаБанковскойВыписки
		|			ИЛИ _ДанныеДляОплат.Контрагент <> _Оплаты.Контрагент
		|			ИЛИ _ДанныеДляОплат.Договор <> _Оплаты.Договор
		|			ИЛИ _ДанныеДляОплат.РасчетныйСчетКонтрагента <> _Оплаты.РасчетныйСчетКонтрагента
		|			ИЛИ _ДанныеДляОплат.Валюта <> _Оплаты.Валюта
		|			ИЛИ _ДанныеДляОплат.Сумма <> _Оплаты.Сумма
		|			ИЛИ _ДанныеДляОплат.СуммаКупона <> _Оплаты.СуммаКупона
		|			ИЛИ _ДанныеДляОплат.КурсОплаты <> _Оплаты.КурсОплаты
		|			ИЛИ _ДанныеДляОплат.СобственныйКурсОплаты <> _Оплаты.СобственныйКурсОплаты
		|			ИЛИ _ДанныеДляОплат.СуммаОплаты <> _Оплаты.СуммаОплаты
		|			ИЛИ _ДанныеДляОплат.СуммаОплатыКупона <> _Оплаты.СуммаОплатыКупона)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИсполненныеСделки";
#КонецОбласти	

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");  		
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	ТекущиеОперации = Запрос.Выполнить().Выгрузить();
				
	Выборка = МВТ.Таблицы["_ОплатыСделокСВалютойРасчетные"].ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Выборка.Ключ;
		НоваяСтрокаОперации.Описание     = "Оплата по сделке с вал./ " + Выборка.Ключ;
		НоваяСтрокаОперации.ОшибкиЧтения = Новый Массив;
		НоваяСтрокаОперации.Статус       = Выборка.Статус;
		
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		ЗаполнитьЗначенияСвойств(РеквизитыШапки, Выборка);
		
		РеквизитыОснования = Новый Структура(ПоляДокумента.Основания);
		ЗаполнитьЗначенияСвойств(РеквизитыОснования, Выборка);
		
		Основания = Новый Массив;
		Основания.Добавить(РеквизитыОснования);
		
		НоваяСтрокаОперации.НовыеРеквизиты               = Новый Структура("Шапка, Основания", РеквизитыШапки, Основания);
		НоваяСтрокаОперации.СчетДоверительногоУправления = РеквизитыШапки.СчетДоверительногоУправления;
		
	КонецЦикла;
	
	Если ТекущиеОперации.Количество() > 0 Тогда 
		УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента);
	КонецЕсли;
	
	Возврат Операции;
		
КонецФункции

Функция ОбработатьБиржевыеСделкиРЕПО_OTBR(МВТ)
	
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.СделкаРЕПО, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Deals_With_Details.Date КАК ДатаСделки,
		|	_Deals_With_Details.Time КАК ВремяСделки,
		|	_Deals_With_Details.Market_Number КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Date <> _Deals_With_Details.Payment_Date
		|				ИЛИ _Deals_With_Details.Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложенноеИсполнение,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаздельноеИсполнение,
		|	_Deals_With_Details.Payment_Date КАК ДатаОплаты,
		|	_Deals_With_Details.Delivery_Date КАК ДатаПоставки,
		|	_Deals_With_Details.Far_Execution_Date КАК ДатаВторойЧастиРЕПО,
		|	_Deals_With_Details.Far_Interest_Rate КАК СтавкаРЕПО,
		|	_Deals_With_Details.Security_ID КАК Security_ID,
		|	_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_НоминалыЦенныхБумаг.Номинал КАК Номинал,
		|	_КурсыВалют.КурсВалютыОплаты / (_КурсыВалют.КратностьКурсаВалютыОплаты * _НоминалыЦенныхБумаг.КратностьКурсаВалютыНоминала * _НоминалыЦенныхБумаг.КурсВалютыНоминала) КАК КоэффициентКонвертации,
		|	_Deals_With_Details.Рынок КАК Рынок,
		|	_Deals_With_Details.ВалютаСделки КАК ВалютаСделки,
		|	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_РежимыБиржевыхТоргов.Ссылка КАК РежимБиржевыхТоргов,
		|	ЕСТЬNULL(_РежимыБиржевыхТоргов.РепоСЦК, ЛОЖЬ) КАК РепоСЦК,
		|	ВЫБОР
		|		КОГДА _РежимыБиржевыхТоргов.РепоСЦК = ИСТИНА
		|			ТОГДА _Deals_With_Details.Market_Number
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерСделкиСЦК,
		|	_Deals_With_Details.Market_Board КАК Market_Board,
		|	_Deals_With_Details.Partner_ID КАК Partner_ID,
		|	ЕСТЬNULL(_Deals_With_Details.КонтрагентСсылка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Контрагент,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market_Board = ""SMAL""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеполныеЛоты,
		|	ПОДСТРОКА(_Deals_With_Details.SettleCode, 1, 2) КАК SettleCode,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Deals_With_Details.Depo_Storage_Place КАК Depo_Storage_Place,
		|	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
		|	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
		|	_Deals_With_Details.Price КАК Цена,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.Price_Percent
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПроцент,
		|	_Deals_With_Details.Volume КАК Количество,
		|	_Deals_With_Details.Amount КАК Сумма,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупона,
		|	_Deals_With_Details.Far_Amount КАК СуммаВторойЧасти,
		|	_Deals_With_Details.Far_Price КАК ЦенаВторойЧасти,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.Far_ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупонаВторойЧасти,
		|	_Deals_With_Details.SE_Charge_Date КАК ДатаОплатыТорговойКомиссии,
		|	_Deals_With_Details.SE_Charge_Amount КАК СуммаТорговойКомиссии,
		|	ВалютыТорговойКомиссии.Валюта КАК ВалютаТорговойКомиссии,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market <> ""OTC""
		|				И _Deals_With_Details.Date <> _Deals_With_Details.SE_Charge_Date
		|				И _Deals_With_Details.SE_Charge_Date <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложеннаяОплатаТорговойКомиссии,
		|	ЕСТЬNULL(_ТаблицаСделокРЕПО_М.Дисконт, 0) КАК Дисконт,
		|	ЕСТЬNULL(_ТаблицаСделокРЕПО_М.РаскрытыйКонтрагент, НЕОПРЕДЕЛЕНО) КАК РаскрытыйКонтрагент
		|ПОМЕСТИТЬ _СделкиРепоВнешниеДанные
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Money_Operations КАК _Money_Operations
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыТорговойКомиссии
		|			ПО _Money_Operations.Payment_Currency_Code = ВалютыТорговойКомиссии.ISO_Code
		|		ПО _Deals_With_Details.Record_UID = _Money_Operations.Deal_Record_UID
		|			И _Deals_With_Details.SE_Charge_Amount = _Money_Operations.Payment_Amount
		|			И (_Money_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.Add.SE.Fee"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
		|		ПО _Deals_With_Details.ВалютаОплаты = _КурсыВалют.ВалютаОплаты
		|			И _Deals_With_Details.ДатаСделки = _КурсыВалют.ДатаСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыБиржевыхТоргов КАК _РежимыБиржевыхТоргов
		|		ПО _Deals_With_Details.Market_Board = _РежимыБиржевыхТоргов.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Deals_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Deals_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Deals_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НоминалыЦенныхБумаг КАК _НоминалыЦенныхБумаг
		|		ПО _Deals_With_Details.ЦеннаяБумага = _НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _Deals_With_Details.ДатаСделки = _НоминалыЦенныхБумаг.ДатаСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаСделокРЕПО_М КАК _ТаблицаСделокРЕПО_М
		|		ПО _Deals_With_Details.Market_Number = _ТаблицаСделокРЕПО_М.НомерСделки
		|			И _ТаблицаСделокРЕПО_М.ЧастьСделкиРЕПО = 1
		|			И НЕ _ТаблицаСделокРЕПО_М.НезавершенныеСделки
		|ГДЕ
		|	_Deals_With_Details.Operation_Type = ""Operations.Group.Deals.REPO""
		|	И _Deals_With_Details.Is_Deal_Info = ""0""
		|	И _Deals_With_Details.Market = ""MICEX""
		|	И _Deals_With_Details.Date = &НачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""Покупка""
		|		КОГДА СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ""Продажа""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ""/"" + ВЫБОР
		|		КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом
		|			ТОГДА СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
		|		ИНАЧЕ СделкаРЕПО.НомерСделки
		|	КОНЕЦ + ""/1"" КАК Ключ,
	    |	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, НЕОПРЕДЕЛЕНО) КАК РаскрытыйКонтрагент,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	    |		ПО СделкаРЕПО.Ссылка = ЗначенияДополнительныхСведений.Объект
	    |			И (ЗначенияДополнительныхСведений.Свойство = &РаскрытыйКонтрагент)
	    |			И (&ЭтоРэм_Траст)
		|ГДЕ
		|	СделкаРЕПО.Организация = &Организация
		|	И НЕ СделкаРЕПО.ПометкаУдаления
		|	И СделкаРЕПО.ЧастьСделкиРЕПО = 1
		|	И СделкаРЕПО.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СделкаРЕПО.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И СделкаРЕПО.Брокер = &Брокер
		|	И НЕ СделкаРЕПО.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";
#КонецОбласти		

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("ЭтоРэм_Траст", (ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Или ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")));
	Запрос.УстановитьПараметр("РаскрытыйКонтрагент", ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "_РаскрытыйКонтрагент"));
	
	СтелкиРепоДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_СделкиРепоВнешниеДанные"].ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
						
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Строка(Выборка.ВидСделки) + "/" + Выборка.НомерСделки + "/1";
		НоваяСтрокаОперации.Описание     = "Бирж. сделка РЕПО #1, № " + Выборка.НомерСделки + " [" + Строка(Выборка.ВидСделки) + "]";
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = Выборка.ДатаСделки + (Выборка.ВремяСделки - Дата(1, 1, 1));
		РеквизитыШапки.НомерСделки                  = ?(Выборка.РепоСЦК, Строка(Формат(Число(Выборка.НомерСделки) + 1, "ЧГ=0")), Выборка.НомерСделки);;
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.ВидСделки                    = Выборка.ВидСделки;
		РеквизитыШапки.ДвеЧастиСделкиРЕПО           = Истина;
		РеквизитыШапки.ЧастьСделкиРЕПО              = 1;
		РеквизитыШапки.ДатаВторойЧастиРЕПО          = Выборка.ДатаВторойЧастиРЕПО;
		РеквизитыШапки.ПерваяЧастьРЕПО              = Документы.СделкаРЕПО.ПустаяСсылка();
		РеквизитыШапки.СтавкаРЕПО                   = Число(Выборка.СтавкаРЕПО);
		РеквизитыШапки.БазаРасчетаПроцентов         = 0;
		РеквизитыШапки.Брокер                       = Брокер;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;		
		РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.ВалютаСделки                 = Выборка.ВалютаСделки;
		РеквизитыШапки.ВремяСделки                  = Выборка.ВремяСделки;
		РеквизитыШапки.КодРасчетовНаБирже           = Выборка.SettleCode;
		РеквизитыШапки.НеполныеЛоты                 = Выборка.НеполныеЛоты;
		РеквизитыШапки.Контрагент                   = Выборка.Контрагент;
		РеквизитыШапки.Дисконт                   	= Выборка.Дисконт;
				
		РеквизитыШапки.РасчетныйСчетКонтрагента     = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.НомерДоговораКонтрагента     = "";
		РеквизитыШапки.Договор                 	    = Справочники.Договоры.ПустаяСсылка();
		РеквизитыШапки.ОтложенноеИсполнение         = Выборка.ОтложенноеИсполнение;
		РеквизитыШапки.ДатаИсполнения               = ?(Выборка.ОтложенноеИсполнение, Выборка.ДатаОплаты, Дата(1, 1, 1));
		РеквизитыШапки.РаздельноеИсполнение         = Выборка.РаздельноеИсполнение;
		РеквизитыШапки.ДатаОплаты                   = ?(Выборка.ОтложенноеИсполнение, Выборка.ДатаОплаты, Дата(1, 1, 1));
		РеквизитыШапки.ДатаПоставки                 = ?(Выборка.ОтложенноеИсполнение, Выборка.ДатаПоставки, Дата(1, 1, 1));
		РеквизитыШапки.ВалютаОплаты                 = Выборка.ВалютаОплаты;
		РеквизитыШапки.СобственныйКурсОплаты        = Ложь;
		РеквизитыШапки.КурсОплаты                   = Неопределено;
		РеквизитыШапки.ПлатежноеУсловиеСделки       = "";
		РеквизитыШапки.Рынок                        = Выборка.Рынок;
		РеквизитыШапки.НомерПорученияУБрокера       = "";
		РеквизитыШапки.ДатаПорученияУБрокера        = Дата(1, 1, 1);
		
		Если Не ЗначениеЗаполнено(Выборка.РежимБиржевыхТоргов) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить режим торгов по коду. Проверьте наличие режима биржевых торгов [" + Выборка.Market_Board + "] в справочнике!");
			РеквизитыШапки.РежимБиржевыхТоргов      = Справочники.РежимыБиржевыхТоргов.ПустаяСсылка();
		Иначе
			РеквизитыШапки.РежимБиржевыхТоргов            = Выборка.РежимБиржевыхТоргов;
			РеквизитыШапки.СделкаСЦентральнымКонтрагентом = Выборка.РепоСЦК;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Partner_ID) И Не ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить контрагента по матрих ID [" + Выборка.Partner_ID + "]! Проверьте наличие кода в регистре [Коды во внешних системах].");
		КонецЕсли;

		РеквизитыШапки.НомерСделкиСЦентральнымКонтрагентом = Выборка.НомерСделкиСЦК;		
		РеквизитыШапки.ОтложенноеИсполнениеВторойЧасти  = Ложь;
		РеквизитыШапки.РаздельноеИсполнениеВторойЧасти  = Ложь;
		РеквизитыШапки.ДатаИсполненияВторойЧасти        = Дата(1, 1, 1);
		РеквизитыШапки.ДатаОплатыВторойЧасти            = Дата(1, 1, 1);
		РеквизитыШапки.ДатаПоставкиВторойЧасти          = Дата(1, 1, 1);
		РеквизитыШапки.ВалютаОплатыВторойЧасти          = Выборка.ВалютаОплаты;
		РеквизитыШапки.СобственныйКурсОплатыВторойЧасти = Ложь;
		РеквизитыШапки.КурсОплатыВторойЧасти            = Неопределено;
		
		РеквизитыШапки.ВалютаТорговойКомиссии           = ?(ЗначениеЗаполнено(Выборка.ВалютаТорговойКомиссии), Выборка.ВалютаТорговойКомиссии, ЭтотОбъект.Организация.ВалютаУчета);
		РеквизитыШапки.ОтложеннаяОплатаТорговойКомиссии = Выборка.ОтложеннаяОплатаТорговойКомиссии;
		РеквизитыШапки.ДатаОплатыТорговойКомиссии       = ?((Выборка.ОтложеннаяОплатаТорговойКомиссии И ЗначениеЗаполнено(Выборка.ДатаОплатыТорговойКомиссии)), Выборка.ДатаОплатыТорговойКомиссии, Дата(1, 1, 1));
						
		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		РеквизитыЦенныеБумаги.НомерСтроки = 1;
		
		Если ЗначениеЗаполнено(Выборка.ЦеннаяБумага) Тогда
			РеквизитыЦенныеБумаги.ЦеннаяБумага = Выборка.ЦеннаяБумага;
		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить ценную бумагу по коду во внешней системе. [" + Выборка.Security_ID + "]!");
		КонецЕсли;

		РеквизитыЦенныеБумаги.Количество       = ?(Выборка.Количество = 0, 1, Выборка.Количество);
		РеквизитыЦенныеБумаги.Сумма            = Выборка.Сумма;
		РеквизитыЦенныеБумаги.СуммаКупона      = Выборка.СуммаКупона;
		РеквизитыЦенныеБумаги.Цена             = Выборка.Цена;
		РеквизитыЦенныеБумаги.ЦенаПроцент      = Выборка.ЦенаПроцент;
		РеквизитыЦенныеБумаги.ЦенаКупона       = Окр(Выборка.СуммаКупона / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги);
		РеквизитыЦенныеБумаги.ТорговаяКомиссия = Выборка.СуммаТорговойКомиссии;
		
		Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
			РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
		Иначе

			Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.МестоХраненияДенежныхСредств) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить место хранения денежных средств по коду [" + Выборка.Money_Storage_Place + "]!");
		Иначе
			РеквизитыШапки.МестоХранения = Выборка.МестоХраненияДенежныхСредств;
		КонецЕсли;
		
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		ЦенныеБумагиВторойЧасти = Новый Массив;
		
		РеквизитыЦенныеБумагиВторойЧасти = Новый Структура(ПоляДокумента.ЦенныеБумагиВторойЧасти);
		ЗаполнитьЗначенияСвойств(РеквизитыЦенныеБумагиВторойЧасти, РеквизитыЦенныеБумаги, "НомерСтроки, ДепозитарныйСчет, ЦеннаяБумага, Количество");
				
		РеквизитыЦенныеБумагиВторойЧасти.Сумма       = Выборка.СуммаВторойЧасти;
		РеквизитыЦенныеБумагиВторойЧасти.СуммаКупона = Выборка.СуммаКупонаВторойЧасти;
		РеквизитыЦенныеБумагиВторойЧасти.Цена        = Выборка.ЦенаВторойЧасти;
		
		Если Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
			
			Если Не ЗначениеЗаполнено(Выборка.Номинал) Тогда
				
				ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент] второй части сделки, т.к. отсутствует значение номинала для бумаги [" + РеквизитыЦенныеБумагиВторойЧасти.ЦеннаяБумага + "]!");
				
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.КоэффициентКонвертации) Тогда
	
				ВалютаНоминалаЦБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЦенныеБумагиВторойЧасти.ЦеннаяБумага, "ВалютаНоминала");
				
				ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент] второй части сделки, т.к. не удалось определить курс конвертации валюты оплаты [" + Выборка.ВалютаОплаты + "] в валюту номинала [" + ВалютаНоминалаЦБ + "]. Возможно отсутствуют курсы валют на дату [" + Выборка.ДатаСделки + "]!");	
				
			Иначе
				
				РеквизитыЦенныеБумагиВторойЧасти.ЦенаПроцент = Окр(Выборка.ЦенаВторойЧасти * Выборка.КоэффициентКонвертации * 100 / Выборка.Номинал, 4); //Аналогично формату из QUIKа					
				
			КонецЕсли;
			
		Иначе
			РеквизитыЦенныеБумагиВторойЧасти.ЦенаПроцент = 0;	
		КонецЕсли;
					
		РеквизитыЦенныеБумагиВторойЧасти.ЦенаКупона = ?(Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации, Окр(Выборка.СуммаКупонаВторойЧасти / РеквизитыЦенныеБумагиВторойЧасти.Количество, ТочностьЦеныЦеннойБумаги), 0);
	
		ЦенныеБумагиВторойЧасти.Добавить(РеквизитыЦенныеБумагиВторойЧасти);
		
		НоваяСтрокаОперации.НовыеРеквизиты               = Новый Структура("Шапка, ЦенныеБумаги, ЦенныеБумагиВторойЧасти", РеквизитыШапки, ЦенныеБумаги, ЦенныеБумагиВторойЧасти);
		НоваяСтрокаОперации.СчетДоверительногоУправления = РеквизитыШапки.СчетДоверительногоУправления;
		
		Если ЗначениеЗаполнено(Выборка.РаскрытыйКонтрагент) Тогда	
			НоваяСтрокаОперации.НовыеРеквизиты.Вставить("ДопСведения", Новый Структура("РаскрытыйКонтрагент", Выборка.РаскрытыйКонтрагент));	
		КонецЕсли;
		
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, СтелкиРепоДанныеСистемы, ПоляДокумента, "КонтрагентНаБирже");
			
	Возврат Операции
	
КонецФункции

Функция ОбработатьБиржевыеСделкиРЕПО2_OTBR(МВТ, КонтролироватьНепроведенныеДокументы)
	
	Перем Операции, ПоляДокумента;
		
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.СделкаРЕПО, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ИСТИНА КАК ЗначенияПолученыИзРегистра,
	    |	УсловияСделокРЕПОСрезПоследних.Период КАК ДатаПервойЧасти,
	    |	ВЫБОР
	    |		КОГДА НАЧАЛОПЕРИОДА(УсловияСделокРЕПОСрезПоследних.ДатаИсполнения, ДЕНЬ) <= &ТекущаяДата
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ КАК Проведен,
	    |	ЛОЖЬ КАК ПометкаУдаления,
	    |	ВЫБОР
	    |		КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	    |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	    |	КОНЕЦ КАК ВидСделки,
	    |	ВЫБОР
	    |		КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	    |			ТОГДА ДОБАВИТЬКДАТЕ(УсловияСделокРЕПОСрезПоследних.ДатаИсполнения, СЕКУНДА, 34200)
	    |		ИНАЧЕ ДОБАВИТЬКДАТЕ(УсловияСделокРЕПОСрезПоследних.ДатаИсполнения, СЕКУНДА, 34260)
	    |	КОНЕЦ КАК Дата,
	    |	ИСТИНА КАК ДвеЧастиСделкиРЕПО,
	    |	УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВторойЧастиРЕПО,
	    |	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК ПерваяЧастьРЕПО,
	    |	УсловияСделокРЕПОСрезПоследних.Организация КАК Организация,
	    |	0 КАК СтавкаРЕПО,
	    |	0 КАК БазаРасчетаПроцентов,
	    |	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Брокер КАК Брокер,
	    |	УсловияСделокРЕПОСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
	    |	"""" КАК КодРасчетовНаБирже,
	    |	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НеполныеЛоты КАК НеполныеЛоты,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ВремяСделки,
	    |	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Контрагент,
	    |	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка) КАК РасчетныйСчетКонтрагента,
	    |	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка) КАК РасчетныйСчет,
	    |	"""" КАК НомерДоговораКонтрагента,
	    |	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка) КАК Договор,
	    |	УсловияСделокРЕПОСрезПоследних.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсполнения,
	    |	УсловияСделокРЕПОСрезПоследних.РаздельноеИсполнение КАК РаздельноеИсполнение,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплаты,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоставки,
	    |	УсловияСделокРЕПОСрезПоследних.ВалютаОплаты КАК ВалютаОплаты,
	    |	ЛОЖЬ КАК СобственныйКурсОплаты,
	    |	НЕОПРЕДЕЛЕНО КАК КурсОплаты,
	    |	"""" КАК ПлатежноеУсловиеСделки,
	    |	ЛОЖЬ КАК ОтложенноеИсполнениеВторойЧасти,
	    |	ЛОЖЬ КАК РаздельноеИсполнениеВторойЧасти,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсполненияВторойЧасти,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплатыВторойЧасти,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоставкиВторойЧасти,
	    |	ВЫБОР
	    |		КОГДА УсловияСделокРЕПОСрезПоследних.ДатаИсполнения > ДАТАВРЕМЯ(2021, 10, 20)
	    |			ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	    |		ИНАЧЕ УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВалютаСделки
	    |	КОНЕЦ КАК ВалютаОплатыВторойЧасти,
	    |	ЛОЖЬ КАК СобственныйКурсОплатыВторойЧасти,
	    |	НЕОПРЕДЕЛЕНО КАК КурсОплатыВторойЧасти,
	    |	ЛОЖЬ КАК ОтложеннаяОплатаТорговойКомиссии,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплатыТорговойКомиссии,
	    |	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаТорговойКомиссии,
	    |	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.СделкаСЦентральнымКонтрагентом КАК СделкаСЦентральнымКонтрагентом,
	    |	ВЫБОР
	    |		КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.СделкаСЦентральнымКонтрагентом = ИСТИНА
	    |			ТОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
	    |		ИНАЧЕ УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделки
	    |	КОНЕЦ КАК НомерСделки,
	    |	ВЫБОР
	    |		КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.СделкаСЦентральнымКонтрагентом = ИСТИНА
	    |			ТОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
	    |		ИНАЧЕ """"
	    |	КОНЕЦ КАК НомерСделкиСЦентральнымКонтрагентом,
	    |	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.РежимБиржевыхТоргов КАК РежимБиржевыхТоргов,
	    |	УсловияСделокРЕПОСрезПоследних.Рынок КАК Рынок,
	    |	1 КАК НомерСтроки,
	    |	УсловияСделокРЕПОСрезПоследних.ДепозитарныйСчет КАК ДепозитарныйСчет,
	    |	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.МестоХранения КАК МестоХранения,
	    |	УсловияСделокРЕПОСрезПоследних.Количество КАК Количество,
	    |	УсловияСделокРЕПОСрезПоследних.Цена КАК Цена,
	    |	УсловияСделокРЕПОСрезПоследних.ЦенаПроцент КАК ЦенаПроцент,
	    |	УсловияСделокРЕПОСрезПоследних.ЦенаКупона КАК ЦенаКупона,
	    |	УсловияСделокРЕПОСрезПоследних.Сумма КАК Сумма,
	    |	УсловияСделокРЕПОСрезПоследних.СуммаКупона КАК СуммаКупона,
	    |	0 КАК ТорговаяКомиссия
	    |ПОМЕСТИТЬ _УсловияСделокРепо
	    |ИЗ
	    |	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
	    |			&КонецПериода,
	    |			Организация = &Организация
	    |				И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних
	    |ГДЕ
	    |	УсловияСделокРЕПОСрезПоследних.Отменено = ЛОЖЬ
	    |	И УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Брокер = &Брокер
	    |	И НАЧАЛОПЕРИОДА(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, ДЕНЬ) <= &НачалоПериода
	    |	И УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО >= &НачалоПериода
	    |	И УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |	И НЕ УсловияСделокРЕПОСрезПоследних.СчетДоверительногоУправления В
	    |				(ВЫБРАТЬ
	    |					_СчетаИсключеныИзЗагрузки.Счет
	    |				ИЗ
	    |					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_УсловияСделокРепо.ЗначенияПолученыИзРегистра КАК ЗначенияПолученыИзРегистра,
	    |	_ИсполненныеСделкиРепо.Market_Number КАК Ключ,
	    |	_УсловияСделокРепо.ДатаПервойЧасти КАК ДатаПервойЧасти,
	    |	_УсловияСделокРепо.Проведен КАК Проведен,
	    |	_УсловияСделокРепо.ПометкаУдаления КАК ПометкаУдаления,
	    |	_УсловияСделокРепо.ВидСделки КАК ВидСделки,
	    |	_УсловияСделокРепо.Дата КАК Дата,
	    |	_УсловияСделокРепо.ДвеЧастиСделкиРЕПО КАК ДвеЧастиСделкиРЕПО,
	    |	_УсловияСделокРепо.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
	    |	_УсловияСделокРепо.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
	    |	_УсловияСделокРепо.ПерваяЧастьРЕПО КАК ПерваяЧастьРЕПО,
	    |	_УсловияСделокРепо.Организация КАК Организация,
	    |	_УсловияСделокРепо.СтавкаРЕПО КАК СтавкаРЕПО,
	    |	_УсловияСделокРепо.БазаРасчетаПроцентов КАК БазаРасчетаПроцентов,
	    |	_УсловияСделокРепо.Брокер КАК Брокер,
	    |	_УсловияСделокРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	_УсловияСделокРепо.ВалютаСделки КАК ВалютаСделки,
	    |	_УсловияСделокРепо.КодРасчетовНаБирже КАК КодРасчетовНаБирже,
	    |	_УсловияСделокРепо.НеполныеЛоты КАК НеполныеЛоты,
	    |	_УсловияСделокРепо.ВремяСделки КАК ВремяСделки,
	    |	_УсловияСделокРепо.Контрагент КАК Контрагент,
	    |	_УсловияСделокРепо.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента,
	    |	_УсловияСделокРепо.РасчетныйСчет КАК РасчетныйСчет,
	    |	_УсловияСделокРепо.НомерДоговораКонтрагента КАК НомерДоговораКонтрагента,
	    |	_УсловияСделокРепо.Договор КАК Договор,
	    |	_УсловияСделокРепо.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
	    |	_УсловияСделокРепо.ДатаИсполнения КАК ДатаИсполнения,
	    |	_УсловияСделокРепо.РаздельноеИсполнение КАК РаздельноеИсполнение,
	    |	_УсловияСделокРепо.ДатаОплаты КАК ДатаОплаты,
	    |	_УсловияСделокРепо.ДатаПоставки КАК ДатаПоставки,
	    |	_УсловияСделокРепо.ВалютаОплаты КАК ВалютаОплаты,
	    |	_УсловияСделокРепо.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
	    |	_УсловияСделокРепо.КурсОплаты КАК КурсОплаты,
	    |	_УсловияСделокРепо.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки,
	    |	_УсловияСделокРепо.ОтложенноеИсполнениеВторойЧасти КАК ОтложенноеИсполнениеВторойЧасти,
	    |	_УсловияСделокРепо.РаздельноеИсполнениеВторойЧасти КАК РаздельноеИсполнениеВторойЧасти,
	    |	_УсловияСделокРепо.ДатаИсполненияВторойЧасти КАК ДатаИсполненияВторойЧасти,
	    |	_УсловияСделокРепо.ДатаОплатыВторойЧасти КАК ДатаОплатыВторойЧасти,
	    |	_УсловияСделокРепо.ДатаПоставкиВторойЧасти КАК ДатаПоставкиВторойЧасти,
	    |	_УсловияСделокРепо.ВалютаОплатыВторойЧасти КАК ВалютаОплатыВторойЧасти,
	    |	_УсловияСделокРепо.СобственныйКурсОплатыВторойЧасти КАК СобственныйКурсОплатыВторойЧасти,
	    |	_УсловияСделокРепо.КурсОплатыВторойЧасти КАК КурсОплатыВторойЧасти,
	    |	_УсловияСделокРепо.ОтложеннаяОплатаТорговойКомиссии КАК ОтложеннаяОплатаТорговойКомиссии,
	    |	_УсловияСделокРепо.ДатаОплатыТорговойКомиссии КАК ДатаОплатыТорговойКомиссии,
	    |	_УсловияСделокРепо.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
	    |	_УсловияСделокРепо.СделкаСЦентральнымКонтрагентом КАК СделкаСЦентральнымКонтрагентом,
	    |	_УсловияСделокРепо.НомерСделки КАК НомерСделки,
	    |	_УсловияСделокРепо.НомерСделкиСЦентральнымКонтрагентом КАК НомерСделкиСЦентральнымКонтрагентом,
	    |	_УсловияСделокРепо.РежимБиржевыхТоргов КАК РежимБиржевыхТоргов,
	    |	_УсловияСделокРепо.Рынок КАК Рынок,
	    |	_УсловияСделокРепо.НомерСтроки КАК НомерСтроки,
	    |	_УсловияСделокРепо.ДепозитарныйСчет КАК ДепозитарныйСчет,
	    |	_УсловияСделокРепо.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	0 КАК Номинал,
	    |	1 КАК КоэффициентКонвертации,
	    |	_УсловияСделокРепо.МестоХранения КАК МестоХранения,
	    |	_УсловияСделокРепо.Количество КАК Количество,
	    |	ВЫРАЗИТЬ(_УсловияСделокРепо.Цена КАК ЧИСЛО(27, 10)) КАК Цена,
	    |	_УсловияСделокРепо.ЦенаПроцент КАК ЦенаПроцент,
	    |	_УсловияСделокРепо.ЦенаКупона КАК ЦенаКупона,
	    |	_УсловияСделокРепо.Сумма КАК Сумма,
	    |	_УсловияСделокРепо.СуммаКупона КАК СуммаКупона,
	    |	_УсловияСделокРепо.ТорговаяКомиссия КАК ТорговаяКомиссия,
	    |	_ИсполненныеСделкиРепо.Ключ КАК ИмяФайла,
	    |	"""" КАК Depo_Storage_Place,
	    |	"""" КАК КоличествоДепозитарныхСчетов,
	    |	"""" КАК НомерПорученияУБрокера,
	    |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПорученияУБрокера,
		|	_УсловияСделокРепо.ПерваяЧастьРЕПО.Дисконт КАК Дисконт,
		|	НЕОПРЕДЕЛЕНО КАК РаскрытыйКонтрагент
	    |ПОМЕСТИТЬ _СделкиРепо2ВнешниеДанные
	    |ИЗ
	    |	_ИсполненныеСделки КАК _ИсполненныеСделкиРепо
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделокРепо КАК _УсловияСделокРепо
	    |		ПО _ИсполненныеСделкиРепо.Market_Number = _УсловияСделокРепо.НомерСделки
	    |ГДЕ
	    |	_ИсполненныеСделкиРепо.Date = &НачалоПериода
	    |	И _ИсполненныеСделкиРепо.Deal_Date <> &НачалоПериода
	    |	И _ИсполненныеСделкиРепо.ТипСделки = ""РепоВтораяЧасть""
	    |	И _ИсполненныеСделкиРепо.Оплата = 1
	    |	И _ИсполненныеСделкиРепо.Поставка = 1
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ЛОЖЬ,
	    |	_Deals_Incomplete_With_Details.Market_Number,
	    |	_Deals_Incomplete_With_Details.ДатаСделки,
	    |	ЛОЖЬ,
	    |	ЛОЖЬ,
	    |	ВЫБОР
	    |		КОГДА _Deals_Incomplete_With_Details.Direction = ""-1""
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	    |		КОГДА _Deals_Incomplete_With_Details.Direction = ""1""
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	    |		ИНАЧЕ """"
	    |	КОНЕЦ,
	    |	ЕСТЬNULL(_ИсполненныеСделкиРепо2.Date, _Deals_Incomplete_With_Details.Far_Execution_Date),
	    |	ИСТИНА,
	    |	2,
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	_УсловияСделокРепо.ПерваяЧастьРЕПО,
	    |	&Организация,
	    |	0,
	    |	0,
	    |	&Брокер,
	    |	_Deals_Incomplete_With_Details.СчетДоверительногоУправления,
	    |	_Deals_Incomplete_With_Details.ВалютаСделки,
	    |	ПОДСТРОКА(_Deals_Incomplete_With_Details.SettleCode, 4, 4),
	    |	ВЫБОР
	    |		КОГДА _Deals_Incomplete_With_Details.Market_Board = ""SMAL""
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ,
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка),
	    |	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка),
	    |	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка),
	    |	"""",
	    |	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	    |	ЛОЖЬ,
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	ЛОЖЬ,
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	_Deals_Incomplete_With_Details.ВалютаОплаты,
	    |	ЛОЖЬ,
	    |	НЕОПРЕДЕЛЕНО,
	    |	"""",
	    |	ЛОЖЬ,
	    |	ЛОЖЬ,
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	ВЫБОР
	    |		КОГДА ЕСТЬNULL(_ИсполненныеСделкиРепо2.Date, _Deals_Incomplete_With_Details.Far_Execution_Date) > ДАТАВРЕМЯ(2021, 10, 20)
	    |			ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	    |		ИНАЧЕ _Deals_Incomplete_With_Details.ВалютаСделки
	    |	КОНЕЦ,
	    |	ЛОЖЬ,
	    |	НЕОПРЕДЕЛЕНО,
	    |	ЛОЖЬ,
	    |	ДАТАВРЕМЯ(1, 1, 1),
	    |	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	    |	_РежимыБиржевыхТоргов.РепоСЦК,
	    |	_Deals_Incomplete_With_Details.Market_Number,
	    |	ВЫБОР
	    |		КОГДА _РежимыБиржевыхТоргов.РепоСЦК = ИСТИНА
	    |			ТОГДА _Deals_Incomplete_With_Details.Market_Number
	    |		ИНАЧЕ """"
	    |	КОНЕЦ,
	    |	_РежимыБиржевыхТоргов.Ссылка,
	    |	_Deals_Incomplete_With_Details.Рынок,
	    |	1,
	    |	_ДепозитарныеСчета.Счет,
	    |	_Deals_Incomplete_With_Details.ЦеннаяБумага,
	    |	_НоминалыЦенныхБумаг.Номинал,
	    |	_КурсыВалют.КурсВалютыОплаты / (_КурсыВалют.КратностьКурсаВалютыОплаты * _НоминалыЦенныхБумаг.КратностьКурсаВалютыНоминала * _НоминалыЦенныхБумаг.КурсВалютыНоминала),
	    |	_МестаХраненияДенежныхСредств.Ссылка,
	    |	_Deals_Incomplete_With_Details.Volume,
	    |	_Deals_Incomplete_With_Details.Far_Price,
	    |	0,
	    |	0,
	    |	_Deals_Incomplete_With_Details.Far_Amount,
	    |	ВЫБОР
	    |		КОГДА _Deals_Incomplete_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	    |			ТОГДА _Deals_Incomplete_With_Details.Far_ACI_Amount
	    |		ИНАЧЕ 0
	    |	КОНЕЦ,
	    |	0,
	    |	"""",
	    |	_Deals_Incomplete_With_Details.Depo_Storage_Place,
	    |	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0),
	    |	"""",
	    |	ДАТАВРЕМЯ(1, 1, 1),
		|	ЕСТЬNULL(_ТаблицаСделокРЕПО_М.Дисконт, 0),
		|	ЕСТЬNULL(_ТаблицаСделокРЕПО_М.РаскрытыйКонтрагент, НЕОПРЕДЕЛЕНО)
	    |ИЗ
	    |	_Deals_Incomplete_With_Details КАК _Deals_Incomplete_With_Details
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ИсполненныеСделки КАК _ИсполненныеСделкиРепо2
	    |		ПО _Deals_Incomplete_With_Details.Market_Number = _ИсполненныеСделкиРепо2.Market_Number
	    |			И (_ИсполненныеСделкиРепо2.Date = &НачалоПериода)
	    |			И (_ИсполненныеСделкиРепо2.ТипСделки = ""РепоВтораяЧасть"")
	    |			И (_ИсполненныеСделкиРепо2.Оплата = 1)
	    |			И (_ИсполненныеСделкиРепо2.Поставка = 1)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
	    |		ПО _Deals_Incomplete_With_Details.ВалютаОплаты = _КурсыВалют.ВалютаОплаты
	    |			И _Deals_Incomplete_With_Details.ДатаСделки = _КурсыВалют.ДатаСделки
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыБиржевыхТоргов КАК _РежимыБиржевыхТоргов
	    |		ПО _Deals_Incomplete_With_Details.Market_Board = _РежимыБиржевыхТоргов.Код
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
	    |		ПО _Deals_Incomplete_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
	    |		ПО _Deals_Incomplete_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
	    |			И _Deals_Incomplete_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделокРепо КАК _УсловияСделокРепо
	    |		ПО _Deals_Incomplete_With_Details.Market_Number = _УсловияСделокРепо.НомерСделки
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _НоминалыЦенныхБумаг КАК _НоминалыЦенныхБумаг
	    |		ПО _Deals_Incomplete_With_Details.ЦеннаяБумага = _НоминалыЦенныхБумаг.ЦеннаяБумага
	    |			И _Deals_Incomplete_With_Details.ДатаСделки = _НоминалыЦенныхБумаг.ДатаСделки 
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаСделокРЕПО_М КАК _ТаблицаСделокРЕПО_М
		|		ПО _Deals_Incomplete_With_Details.Market_Number = _ТаблицаСделокРЕПО_М.НомерСделки
		|			И _ТаблицаСделокРЕПО_М.ЧастьСделкиРЕПО = 2
		|			И _ТаблицаСделокРЕПО_М.НезавершенныеСделки
	    |ГДЕ
	    |	_Deals_Incomplete_With_Details.Operation_Type = ""Operations.Group.Deals.REPO""
	    |	И _Deals_Incomplete_With_Details.Is_Deal_Info = ""0""
	    |	И _Deals_Incomplete_With_Details.Market = ""MICEX""
	    |	И _Deals_Incomplete_With_Details.Deal_Info_Type <> ""Deals.Info.Type.Cancellation""
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВЫБОР
	    |		КОГДА СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	    |			ТОГДА ""Покупка""
	    |		КОГДА СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	    |			ТОГДА ""Продажа""
	    |		ИНАЧЕ """"
	    |	КОНЕЦ + ""/"" + ВЫБОР
	    |		КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом
	    |			ТОГДА СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
	    |		ИНАЧЕ СделкаРЕПО.ПерваяЧастьРЕПО.НомерСделки
	    |	КОНЕЦ + ""/2"" КАК Ключ,
	    |	ВЫБОР
	    |		КОГДА НАЧАЛОПЕРИОДА(СделкаРЕПО.Дата, ДЕНЬ) <= &ТекущаяДата
	    |				И СделкаРЕПО.Проведен = ЛОЖЬ
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ КАК ФлОшибкаНепроведенногоДокумента,
	    |	НАЧАЛОПЕРИОДА(СделкаРЕПО.Дата, ДЕНЬ) КАК ПроверяемаяДата,
	    |	СделкаРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	СделкаРЕПО.Ссылка КАК Ссылка
	    |ПОМЕСТИТЬ _ТекущиеОперации
	    |ИЗ
	    |	Документ.СделкаРЕПО КАК СделкаРЕПО
	    |ГДЕ
	    |	СделкаРЕПО.Организация = &Организация
	    |	И НЕ СделкаРЕПО.ПометкаУдаления
	    |	И СделкаРЕПО.ЧастьСделкиРЕПО = 2
	    |	И НАЧАЛОПЕРИОДА(СделкаРЕПО.Дата, ДЕНЬ) >= &НачалоПериода
	    |	И НАЧАЛОПЕРИОДА(СделкаРЕПО.ПерваяЧастьРЕПО.Дата, ДЕНЬ) <= &КонецПериода
	    |	И СделкаРЕПО.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |	И СделкаРЕПО.Брокер = &Брокер
	    |	И НЕ СделкаРЕПО.СчетДоверительногоУправления В
	    |				(ВЫБРАТЬ
	    |					_СчетаИсключеныИзЗагрузки.Счет
	    |				ИЗ
	    |					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ТекущиеОперации.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	_ТекущиеОперации.ПроверяемаяДата КАК ПроверяемаяДата,
	    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ТекущиеОперации.Ключ) КАК Количество
	    |ПОМЕСТИТЬ _НепроведенныеВторыеЧасти
	    |ИЗ
	    |	_ТекущиеОперации КАК _ТекущиеОперации
	    |ГДЕ
	    |	&КонтролироватьНепроведенные
	    |	И _ТекущиеОперации.ФлОшибкаНепроведенногоДокумента = ИСТИНА
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	_ТекущиеОперации.СчетДоверительногоУправления,
	    |	_ТекущиеОперации.ПроверяемаяДата
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВЫБОР
	    |		КОГДА НАЧАЛОПЕРИОДА(СделкаРЕПО.Дата, ДЕНЬ) = &ТекущаяДата
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ СделкаРЕПО.Проведен
	    |	КОНЕЦ КАК Проведен,
	    |	&Звездочка КАК Звездочка
	    |ИЗ
	    |	Документ.СделкаРЕПО КАК СделкаРЕПО
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТекущиеОперации КАК _ТекущиеОперации
	    |		ПО СделкаРЕПО.Ссылка = _ТекущиеОперации.Ссылка
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _ТекущиеОперации
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _УсловияСделокРепо";
#КонецОбласти

	ТекДата = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("КонтролироватьНепроведенные", КонтролироватьНепроведенныеДокументы);
	
	СделкиРепо2ДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_СделкиРепо2ВнешниеДанные"].ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Строка(Выборка.ВидСделки) + "/" + Выборка.Ключ + "/2";
		НоваяСтрокаОперации.Описание     = "Бирж. сделка РЕПО #2, № " + Выборка.Ключ + ?(ЗначениеЗаполнено(Выборка.ВидСделки), ", " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy") + " [" + Строка(Выборка.ВидСделки) + "]", "");
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		Если Не ЗначениеЗаполнено(Выборка.ЗначенияПолученыИзРегистра) Тогда
			
			ОшибкиЧтения.Добавить("Не удалось сформировать документ [сделка РЕПО часть 2]. Не найдена первая часть сделки Репо по номеру сделки (номеру сделки с центральным контрагентом) [" + Выборка.Ключ + "].  Данные загружены из файла [" + Выборка.ИмяФайла + "].");
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
			Продолжить;
			
		КонецЕсли;
		
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		
		ЗаполнитьЗначенияСвойств(РеквизитыШапки, Выборка);
		ЗаполнитьЗначенияСвойств(РеквизитыЦенныеБумаги, Выборка);
		
		РеквизитыШапки.НомерСделки = ?(Выборка.СделкаСЦентральнымКонтрагентом, Строка(Формат(Число(Выборка.НомерСделки) + 2, "ЧГ=0")), Выборка.НомерСделки);
		РеквизитыШапки.КонтрагентНаБирже = "";
		РеквизитыШапки.Дисконт = Выборка.Дисконт;
		
		Если Не Выборка.ЗначенияПолученыИзРегистра Тогда
			
			РеквизитыШапки.Проведен = ?(Выборка.Дата <= ТекДата, Истина, Ложь);
			РеквизитыШапки.Дата     = ?(ЗначениеЗаполнено(Выборка.ПерваяЧастьРЕПО) И Выборка.Дата = НачалоДня(Выборка.ПерваяЧастьРЕПО.Дата), Выборка.ПерваяЧастьРЕПО.Дата + 1, Выборка.Дата + ?(Выборка.ВидСделки = Перечисления.ВидыСделок.Покупка, 34200, 34260)); //9:30, 9:31
			
			РеквизитыЦенныеБумаги.Количество  = ?(Выборка.Количество = 0, 1, Выборка.Количество) ;
			РеквизитыЦенныеБумаги.Сумма       = Выборка.Сумма;
			РеквизитыЦенныеБумаги.СуммаКупона = Выборка.СуммаКупона;
			РеквизитыЦенныеБумаги.Цена        = Выборка.Цена;
			РеквизитыЦенныеБумаги.ЦенаКупона  = ?(Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации, Окр(Выборка.СуммаКупона / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги), 0);
						
			Если Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
				
				
				Если Не ЗначениеЗаполнено(Выборка.Номинал) Тогда
					
					ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент], т.к. отсутствует значение номинала для бумаги [" + РеквизитыЦенныеБумаги.ЦеннаяБумага + "]!");
					
				ИначеЕсли Не ЗначениеЗаполнено(Выборка.КоэффициентКонвертации) Тогда
	
					ВалютаНоминалаЦБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЦенныеБумаги.ЦеннаяБумага, "ВалютаНоминала");
				
					ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент], т.к. не удалось определить курс конвертации валюты оплаты [" + Выборка.ВалютаОплаты + "] в валюту номинала [" + ВалютаНоминалаЦБ + "]. Возможно отсутствуют курсы валют на дату [" + Выборка.ДатаПервойЧасти + "]!");	
				
				Иначе
					
					РеквизитыЦенныеБумаги.ЦенаПроцент = Окр(Выборка.Цена * Выборка.КоэффициентКонвертации * 100 / Выборка.Номинал, 4);					
					
				КонецЕсли;
				
			Иначе
				РеквизитыЦенныеБумаги.ЦенаПроцент = 0;	
			КонецЕсли;
						
			Если Не ЗначениеЗаполнено(Выборка.ПерваяЧастьРЕПО) Тогда
				ОшибкиЧтения.Добавить("Не удалось сформировать документ [сделка РЕПО часть 2]. Не найдена первая часть сделки Репо по номеру сделки (номеру сделки с центральным контрагентом) [" + Выборка.Ключ + "].");	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
				РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
			Иначе
				Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
					ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
				Иначе
					ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		ЦенныеБумагиВторойЧасти = Новый Массив;		
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги, ЦенныеБумагиВторойЧасти", РеквизитыШапки, ЦенныеБумаги, ЦенныеБумагиВторойЧасти);
		
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, СделкиРепо2ДанныеСистемы, ПоляДокумента, "КодРасчетовНаБирже");
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьСделкиСВалютой_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
		
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.СделкаСВалютой, Операции, ПоляДокумента);
		
	Группа_FX = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("FX");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаСВалютой.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""Покупка""
		|		КОГДА СделкаСВалютой.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ""Продажа""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ""/"" + ВЫБОР
		|		КОГДА СделкаСВалютой.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА _ВнебиржевыеСделки.НомерОперации
		|		ИНАЧЕ СделкаСВалютой.НомерСделки
		|	КОНЕЦ + """" + ВЫБОР
		|		КОГДА СделкаСВалютой.ТипСделки = ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.СвопВтораяЧасть)
		|			ТОГДА ""/2""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ПОМЕСТИТЬ _СделкиСВалютойДанныеСистемы
		|ИЗ
		|	Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделки
		|		ПО СделкаСВалютой.Ссылка = _ВнебиржевыеСделки.Объект
		|ГДЕ
		|	СделкаСВалютой.Организация = &Организация
		|	И НЕ СделкаСВалютой.ПометкаУдаления
		|	И СделкаСВалютой.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СделкаСВалютой.Брокер = &Брокер
		|	И НЕ СделкаСВалютой.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Deals_With_Details.Record_UID КАК Record_UID,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market = ""OTC""
		|			ТОГДА _Deals_With_Details.Record_UID
		|		ИНАЧЕ _Deals_With_Details.Market_Number
		|	КОНЕЦ КАК Ключ,
		|	_Deals_With_Details.Near_Deal_Record_UID КАК Near_Deal_Record_UID,
		|	_Deals_With_Details.Market_Number КАК НомерСделки,
		|	_Deals_With_Details.Date КАК ДатаСделки,
		|	_Deals_With_Details.Time КАК ВремяСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Operation_Type = ""Operations.Group.Deals.Trade""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.Конверсионная)
		|		КОГДА _Deals_With_Details.Operation_Type = ""Operations.Group.Deals.Forward""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.ФорвардПоставочный)
		|		КОГДА _Deals_With_Details.Operation_Type = ""Operations.Group.Deals.Swap""
		|			ТОГДА ВЫБОР
		|					КОГДА _Deals_With_Details.Near_Deal_Record_UID = """"
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.СвопПерваяЧасть)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.СвопВтораяЧасть)
		|				КОНЕЦ
		|	КОНЕЦ КАК ТипСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Date <> _Deals_With_Details.Payment_Date
		|				ИЛИ _Deals_With_Details.Date <> _Deals_With_Details.Delivery_Date
		|				ИЛИ _Deals_With_Details.Market = ""OTC""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложенноеИсполнение,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаздельноеИсполнение,
		|	_Deals_With_Details.Payment_Date КАК ДатаОплаты,
		|	_Deals_With_Details.Delivery_Date КАК ДатаПоставки,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Deals_With_Details.ВалютаСделки КАК Контрвалюта,
		|	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА НЕ _ВнебиржевыеСделки.Объект ЕСТЬ NULL
		|			ТОГДА _ВнебиржевыеСделки.Объект
		|		КОГДА НЕ СделкаСВалютой.Ссылка ЕСТЬ NULL
		|			ТОГДА СделкаСВалютой.Ссылка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СделкаСВалютой.ПустаяСсылка)
		|	КОНЕЦ КАК Основание,
		|	_Deals_With_Details.Price КАК Курс,
		|	_Deals_With_Details.Volume КАК Сумма,
		|	_Deals_With_Details.Amount КАК СуммаКонтрвалюты,
		|	_Deals_With_Details.ЦеннаяБумага КАК Валюта,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market <> ""OTC""
		|				И _Deals_With_Details.Date <> _Deals_With_Details.SE_Charge_Date
		|				И _Deals_With_Details.SE_Charge_Date <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложеннаяОплатаТорговойКомиссии,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market <> ""OTC""
		|				И _Deals_With_Details.Date <> _Deals_With_Details.SE_Charge_Date
		|				И _Deals_With_Details.SE_Charge_Date <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА _Deals_With_Details.SE_Charge_Date
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаОплатыТорговойКомиссии,
		|	_Deals_With_Details.SE_Charge_Amount КАК СуммаТорговойКомиссии,
		|	ЕСТЬNULL(ВалютыТорговойКомиссии.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаТорговойКомиссии
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Money_Operations КАК _Money_Operations
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыТорговойКомиссии
		|			ПО _Money_Operations.Payment_Currency_Code = ВалютыТорговойКомиссии.ISO_Code
		|		ПО _Deals_With_Details.Record_UID = _Money_Operations.Deal_Record_UID
		|			И _Deals_With_Details.SE_Charge_Amount = _Money_Operations.Payment_Amount
		|			И (_Money_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.Add.SE.Fee"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыБиржевыхТоргов КАК _РежимыБиржевыхТоргов
		|		ПО _Deals_With_Details.Market_Board = _РежимыБиржевыхТоргов.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Deals_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделки
		|		ПО _Deals_With_Details.Near_Deal_Record_UID = _ВнебиржевыеСделки.НомерОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО _Deals_With_Details.Market_Number = СделкаСВалютой.НомерСделки
		|			И (_Deals_With_Details.Market_Number <> """")
		|			И (_Deals_With_Details.Near_Deal_Record_UID <> """")
		|			И (СделкаСВалютой.Проведен = ИСТИНА)
		|			И (СделкаСВалютой.Организация = &Организация)
		|			И (СделкаСВалютой.Брокер = &Брокер)
		|			И (СделкаСВалютой.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (СделкаСВалютой.ТипСделки В (ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.СвопПерваяЧасть), ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.ФорвардПоставочный)))
		|ГДЕ
		|	_Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Валюты
		|	И _Deals_With_Details.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.Forward"", ""Operations.Group.Deals.Swap"")
		|	И _Deals_With_Details.Is_Deal_Info = ""0""
		|	И _Deals_With_Details.Date = &НачалоПериода";
	
#КонецОбласти		

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("Группа_Forwards", Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Forwards"));
	Запрос.УстановитьПараметр("Группа_FX", Группа_FX);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЧтения = Новый Массив;  
				
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Строка(Выборка.ВидСделки) + "/" + Выборка.Ключ + ?(Выборка.ТипСделки = Перечисления.ТипыСделокСВалютой.СвопВтораяЧасть, "/2", "");
		НоваяСтрокаОперации.Описание     = "Сделка с валютой, № " + Выборка.Ключ + ", [" + Выборка.ТипСделки + "] ," + Выборка.Валюта + " / " + Выборка.Контрвалюта;
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		Если Выборка.МестоХраненияДенежныхСредств = Справочники.МестаХранения.ВнебиржевойРынок И Не ЗначениеЗаполнено(Выборка.НомерСделки) Тогда
			НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
				Справочники.ВнешниеСистемы.Матрих, Группа_FX, Выборка.Record_UID);			
		КонецЕсли;
				
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = Выборка.ДатаСделки + (Выборка.ВремяСделки - Дата(1, 1, 1));
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.ТипСделки                    = Выборка.ТипСделки;
		РеквизитыШапки.ВидСделки                    = Выборка.ВидСделки;
		РеквизитыШапки.НомерСделки                  = Выборка.НомерСделки;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;	
		РеквизитыШапки.Брокер                       = Брокер;
		РеквизитыШапки.Валюта                       = Выборка.Валюта;
		РеквизитыШапки.Контрвалюта                  = Выборка.Контрвалюта;
		РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.РасчетныйСчетКонтрвалюты     = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.МестоХранения                = Выборка.МестоХраненияДенежныхСредств;
		РеквизитыШапки.ДатаИсполнения 			    = Выборка.ДатаПоставки;
		РеквизитыШапки.ОтложенноеИсполнение         = Выборка.ОтложенноеИсполнение;
		РеквизитыШапки.Сумма                        = Выборка.Сумма;
		РеквизитыШапки.СуммаКонтрвалюты             = Выборка.СуммаКонтрвалюты;
		РеквизитыШапки.Курс                         = Выборка.Курс;
		РеквизитыШапки.СуммаКомиссии				= Выборка.СуммаТорговойКомиссии;
		РеквизитыШапки.ВалютаКомиссии				= Выборка.ВалютаТорговойКомиссии;
		РеквизитыШапки.ОтложеннаяОплатаКомиссии		= Выборка.ОтложеннаяОплатаТорговойКомиссии;
		РеквизитыШапки.ДатаОплатыКомиссии			= Выборка.ДатаОплатыТорговойКомиссии;
		
		Если Не ЗначениеЗаполнено(Выборка.Основание) И (ЗначениеЗаполнено(Выборка.НомерСделки) И Выборка.ТипСделки <> Перечисления.ТипыСделокСВалютой.Конверсионная Или ЗначениеЗаполнено(Выборка.Near_Deal_Record_UID)) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить документ основание по " + ?(ЗначениеЗаполнено(Выборка.НомерСделки), "номеру сделки [" + Выборка.НомерСделки + "]!", "коду [" + Выборка.Near_Deal_Record_UID + "]!"));
		Иначе
			РеквизитыШапки.Основание = Выборка.Основание;
		КонецЕсли;
				
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка", РеквизитыШапки);
		
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
		
	КонецЦикла;                                   
	
	ТекущиеОперации = МВТ.Таблицы["_СделкиСВалютойДанныеСистемы"].ПолучитьДанные().Выгрузить();
	ТекущиеОперации.Колонки.Удалить("НомерПодтверждения");
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента);
		
	Возврат Операции;
	
КонецФункции

Функция ОбработатьПереводыДенежныхСредств_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.ПереводДенежныхСредств, Операции, ПоляДокумента);
	
	Группа_MoneyTransfer = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Money_Transfer");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаБэкОфисаСрезПоследних.АвтоматизированаПодачаПоручений КАК АвтоматизированаПодачаПоручений
		|ПОМЕСТИТЬ _НастройкаУчетаБэкОфиса
		|ИЗ
		|	РегистрСведений.НастройкиУчетаБэкОфиса.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК НастройкиУчетаБэкОфисаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КодыПорученийВоВнешнихСистемахСрезПоследних.Код, _ВнебиржевыеОперации.НомерОперации) КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ПОМЕСТИТЬ _ПереводыДанныеСистемы
		|ИЗ
		|	Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО ПереводДенежныхСредств.Ссылка = _ВнебиржевыеОперации.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкаУчетаБэкОфиса КАК _НастройкаУчетаБэкОфиса
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонецПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.QUIK)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.НомераПоручений)) КАК КодыПорученийВоВнешнихСистемахСрезПоследних
		|		ПО ПереводДенежныхСредств.Основание = КодыПорученийВоВнешнихСистемахСрезПоследних.Объект
		|ГДЕ
		|	ПереводДенежныхСредств.Организация = &Организация
		|	И НЕ ПереводДенежныхСредств.ПометкаУдаления
		|	И ПереводДенежныхСредств.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПереводДенежныхСредств.Брокер = &Брокер
		|	И НЕ(ПереводДенежныхСредств.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				И НЕ _НастройкаУчетаБэкОфиса.АвтоматизированаПодачаПоручений)
		|	И НЕ ПереводДенежныхСредств.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Money_Instructions.Record_UID КАК Record_UID,
		|	_Money_Instructions.Date КАК Дата,
		|	ВЫБОР
		|		КОГДА _НастройкаУчетаБэкОфиса.АвтоматизированаПодачаПоручений
		|			ТОГДА _Money_Instructions.External_Reference
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК External_Reference,
		|	_Money_Instructions.Amount КАК Сумма,
		|	ВалютыПеревода.Валюта КАК Валюта,
		|	_КодыСчетовВнутреннегоУчетаОсновные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчетаОсновные.Секция КАК Секция_1,
		|	_КодыСчетовВнутреннегоУчетаДополнительные.Секция КАК Секция_2,
		|	ВЫБОР
		|		КОГДА _Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.In""
		|			ТОГДА ЕСТЬNULL(_МестаХраненияДенежныхСредств_2.Ссылка, ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|		ИНАЧЕ _МестаХраненияДенежныхСредств_1.Ссылка
		|	КОНЕЦ КАК МестоХранения,
		|	ВЫБОР
		|		КОГДА _Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.In""
		|			ТОГДА _МестаХраненияДенежныхСредств_1.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(_МестаХраненияДенежныхСредств_2.Ссылка, ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|	КОНЕЦ КАК МестоХраненияПолучатель,
		|	ВЫБОР
		|		КОГДА КодыВоВнешнихСистемахСрезПоследних.Объект ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Документ.ПоручениеНаПереводДенежныхСредств.ПустаяСсылка)
		|		ИНАЧЕ ВЫРАЗИТЬ(КодыВоВнешнихСистемахСрезПоследних.Объект КАК Документ.ПоручениеНаПереводДенежныхСредств).Ссылка
		|	КОНЕЦ КАК Основание,
		|	ВЫБОР
		|		КОГДА _Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.In""
		|				И _МестаХраненияДенежныхСредств_2.Ссылка ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|		ИНАЧЕ &Брокер
		|	КОНЕЦ КАК Брокер,
		|	ВЫБОР
		|		КОГДА _Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.Out""
		|				И _МестаХраненияДенежныхСредств_2.Ссылка ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|		ИНАЧЕ &Брокер
		|	КОНЕЦ КАК БрокерПолучатель
		|ИЗ
		|	_Money_Instructions КАК _Money_Instructions
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Instructions.Ключ = _ДанныеПервыхУзлов.Ключ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыПеревода
		|		ПО _Money_Instructions.Currency_Code = ВалютыПеревода.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств_1
		|		ПО _Money_Instructions.Money_Storage_Place = _МестаХраненияДенежныхСредств_1.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств_2
		|		ПО _Money_Instructions.Partner_Money_Storage_Place = _МестаХраненияДенежныхСредств_2.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчетаОсновные
		|		ПО _Money_Instructions.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчетаОсновные.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчетаДополнительные
		|		ПО _Money_Instructions.Partner_Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчетаДополнительные.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкаУчетаБэкОфиса КАК _НастройкаУчетаБэкОфиса
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонецПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.QUIK)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.НомераПоручений)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО _Money_Instructions.External_Reference = КодыВоВнешнихСистемахСрезПоследних.Код
		|			И (_Money_Instructions.External_Reference <> """")
		|ГДЕ
		|	НЕ _КодыСчетовВнутреннегоУчетаОсновные.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчетаОсновные.ИсключенИзЗагрузки = ЛОЖЬ
		|	И НЕ(_Money_Instructions.Money_Storage_Place = ""MICEX""
		|				И _Money_Instructions.Partner_Money_Storage_Place = ""MICEX"")
		|	И НЕ(_Money_Instructions.Money_Storage_Place = ""OTC""
		|				И _Money_Instructions.Partner_Money_Storage_Place = ""OTC""
		|				И НЕ(_КодыСчетовВнутреннегоУчетаОсновные.Секция = ""Валютная""
		|						ИЛИ _КодыСчетовВнутреннегоУчетаДополнительные.Секция = ""Валютная""))
		|	И НЕ((_Money_Instructions.Transfer_Type = ""Transfer.Type.Account""
		|				ИЛИ _Money_Instructions.Transfer_Type = ""Transfer.Type.Portfolio""
		|					И (&УК_Траст
		|							И &НачалоПериода > ДАТАВРЕМЯ(2021, 11, 3)
		|						ИЛИ НЕ &УК_Траст
		|							И (_КодыСчетовВнутреннегоУчетаОсновные.ДатаЗаключенияСчета > ДАТАВРЕМЯ(2021, 11, 1)
		|								ИЛИ &НачалоПериода > ДАТАВРЕМЯ(2022, 6, 9))))
		|				И _Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.Transfer""
		|				И _Money_Instructions.Money_Storage_Place = _Money_Instructions.Partner_Money_Storage_Place)
		|	И НЕ(_Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.In""
		|				И _Money_Instructions.Partner_Money_Storage_Place = """")
		|	И НЕ(_Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.Out""
		|				И _Money_Instructions.Partner_Money_Storage_Place = """"
		|				И НЕ _НастройкаУчетаБэкОфиса.АвтоматизированаПодачаПоручений)
		|	И _Money_Instructions.Deal_Record_UID = """"
		|	И _Money_Instructions.Date = &НачалоПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ";
#КонецОбласти
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	
	//В УК РЭМ и Траст переводы создаются через НТП (на основании поручений поданых через QUIK) 
	//При сверке исключаем Расчетный счет.
	//Для других УК исключены выводы с брокера/биржи на расчетный счет. Брокер не раскрывает инфу о р/с получателе.
	ЭтоУК_Траст  = (ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")); 
	ЭтоРЭМ_Траст = (ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Или ЭтоУК_Траст);
	
	Запрос.УстановитьПараметр("УК_Траст", ЭтоУК_Траст); 

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации              = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = ?(Выборка.External_Reference = "", Выборка.Record_UID, Выборка.External_Reference);
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.Описание     = "Перевод д/с, " + Строка(Выборка.МестоХранения) + " -> " + Строка(Выборка.МестоХраненияПолучатель) + ", " + Выборка.Сумма + " " + Выборка.Валюта;
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		Если Выборка.External_Reference = "" Тогда //если перевод создан не на основании поручения
			НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
				Справочники.ВнешниеСистемы.Матрих, Группа_MoneyTransfer, Выборка.Record_UID);
		КонецЕсли;
				
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = ?(ЗначениеЗаполнено(Выборка.Основание) И ЭтотОбъект.ДатаИмпорта = НачалоДня(Выборка.Основание.Дата), Выборка.Основание.Дата + 1, ЭтотОбъект.ДатаИмпорта + (?(ЭтоРЭМ_Траст, 10, 14) * 60 + 30) * 60); //Для РПИ 14:30, Для РЭМа и Траста 10:30
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		Если ЗначениеЗаполнено(Выборка.External_Reference) И Не ЗначениеЗаполнено(Выборка.Основание) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить поручение на перевод денежных средств по номеру [" + Выборка.External_Reference + "].");
		Иначе
			РеквизитыШапки.Основание = Выборка.Основание;
		КонецЕсли;

		РеквизитыШапки.ВариантПеревода      = Перечисления.ВариантыПереводаДенежныхСредств.Перевод;
		РеквизитыШапки.Сумма                = Выборка.Сумма;
		РеквизитыШапки.Валюта               = Выборка.Валюта;
		РеквизитыШапки.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная;
		РеквизитыШапки.Брокер               = Выборка.Брокер;
		РеквизитыШапки.РасчетныйСчет        = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.МестоХранения        = Выборка.МестоХранения;
		РеквизитыШапки.Касса                = Справочники.Кассы.ПустаяСсылка();   
		
		РеквизитыШапки.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Безналичная;
		РеквизитыШапки.БрокерПолучатель               = Выборка.БрокерПолучатель;
		РеквизитыШапки.РасчетныйСчетПолучатель        = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.МестоХраненияПолучатель        = Выборка.МестоХраненияПолучатель;
		РеквизитыШапки.КассаПолучатель                = Справочники.Кассы.ПустаяСсылка();
		
		РеквизитыШапки.СтрокаБанковскойВыписки           = Документы.СтрокаБанковскойВыписки.ПустаяСсылка();
		РеквизитыШапки.СтрокаБанковскойВыпискиПолучатель = Документы.СтрокаБанковскойВыписки.ПустаяСсылка();
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка", РеквизитыШапки);

		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
		
	КонецЦикла;
	
	ИсключитьИзСверки = "Дата, СтрокаБанковскойВыпискиПолучатель, СтрокаБанковскойВыписки, РасчетныйСчетПолучатель"; //брокер не предоставляет данные
	
	ТекущиеОперации = МВТ.Таблицы["_ПереводыДанныеСистемы"].ПолучитьДанные().Выгрузить();
	ТекущиеОперации.Сортировать("Сумма УБЫВ");
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьНачисленияКомиссии_OTBR(МВТ)
	
	Перем Операции, ПоляДокумента;
	
	ГруппаИмпортируемыхОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Commission");
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.НачислениеЗадолженности, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
		
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор КАК Договор,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор.ДатаЗаключения КАК ДепозитарныйСчетДоговорДатаЗаключения
		|ПОМЕСТИТЬ _ВсеДоговорыДепозитарногоОбслуживания
		|ИЗ
		|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Дата, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор)
		|ГДЕ
		|	ИсполнителиПоЦеннымБумагам.Организация = &Организация
		|	И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия >= &Дата)
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &Дата)
		|	И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо = &ДепозитарийЮрЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.КоличествоДоговоров КАК КоличествоДоговоров,
		|	_ВсеДоговорыДепозитарногоОбслуживания.Договор КАК Договор
		|ПОМЕСТИТЬ _Договоры
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеДоговорыДепозитарногоОбслуживания.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеДоговорыДепозитарногоОбслуживания.Договор) КАК КоличествоДоговоров,
		|		МИНИМУМ(_ВсеДоговорыДепозитарногоОбслуживания.ДепозитарныйСчетДоговорДатаЗаключения) КАК ДатаМаксимум
		|	ИЗ
		|		_ВсеДоговорыДепозитарногоОбслуживания КАК _ВсеДоговорыДепозитарногоОбслуживания
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеДоговорыДепозитарногоОбслуживания.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеДоговорыДепозитарногоОбслуживания КАК _ВсеДоговорыДепозитарногоОбслуживания
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеДоговорыДепозитарногоОбслуживания.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ДатаМаксимум = _ВсеДоговорыДепозитарногоОбслуживания.ДепозитарныйСчетДоговорДатаЗаключения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Charges_Operations.Record_UID КАК Record_UID,
		|	_Charges_Operations.Date КАК Date,
		|	_Charges_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
		|	ВЫБОР
		|		КОГДА _Charges_Operations.Origin_Operation_Type В (&ТипыБрокерскойКомиссии)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|		КОГДА _Charges_Operations.Origin_Operation_Type В (""Operations.Group.Charges.SE.Transaction"", ""Operations.Group.Settlements.Add.SE.Fee"")
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|		КОГДА _Charges_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидЗадолженности,
		|	_Charges_Operations.Payment_Amount КАК Payment_Amount,
		|	_Charges_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
		|	_Charges_Operations.Security_ID КАК Security_ID,
		|	_Charges_Operations.Volume КАК Volume,
		|	_Charges_Operations.Market КАК Market,
		|	ВЫБОР
		|		КОГДА _Charges_Operations.Market = ""MOEX.FX""
		|				ИЛИ _КодыСчетовВнутреннегоУчета.Секция = ""Валютная""
		|			ТОГДА ""MOEX.FX""
		|		ИНАЧЕ ""MICEX""
		|	КОНЕЦ КАК Money_Market,
		|	_Charges_Operations.Invoice_Number КАК Invoice_Number,
		|	_Charges_Operations.Charge_Record_UID КАК Charge_Record_UID,
		|	_Charges_Operations.Deal_Record_UID КАК Deal_Record_UID,
		|	_Charges_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	_Charges_Operations.Storage_Place КАК Storage_Place,
		|	_Charges_Operations.Market_Number КАК Market_Number,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	_Валюты.Валюта КАК ВалютаОплаты,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК КодУБрокера,
		|	_КодыСчетовВнутреннегоУчета.КодДляСверкиОпераций КАК КодДляСверкиОпераций
		|ПОМЕСТИТЬ _НачисленияКомиссий
		|ИЗ
		|	_Charges_Operations КАК _Charges_Operations
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Charges_Operations.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _Charges_Operations.Security_ID = _ЦенныеБумаги.Matrix_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Charges_Operations.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Charges_Operations.Payment_Currency_Code = _Валюты.ISO_Code
		|ГДЕ
		|	_Charges_Operations.Date = &Дата
		|	И НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НачисленияКомиссий.Record_UID КАК Record_UID,
		|	_НачисленияКомиссий.Date КАК Date,
		|	_НачисленияКомиссий.Origin_Operation_Type КАК Origin_Operation_Type,
		|	_НачисленияКомиссий.ВидЗадолженности КАК ВидЗадолженности,
		|	_НачисленияКомиссий.Payment_Amount КАК Сумма,
		|	_НачисленияКомиссий.Payment_Currency_Code КАК Payment_Currency_Code,
		|	_НачисленияКомиссий.Security_ID КАК Security_ID,
		|	_НачисленияКомиссий.Volume КАК Volume,
		|	_НачисленияКомиссий.Market КАК Market,
		|	_НачисленияКомиссий.Invoice_Number КАК Invoice_Number,
		|	_НачисленияКомиссий.Charge_Record_UID КАК Charge_Record_UID,
		|	_НачисленияКомиссий.Deal_Record_UID КАК Deal_Record_UID,
		|	_НачисленияКомиссий.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	_НачисленияКомиссий.Storage_Place КАК Storage_Place,
		|	_НачисленияКомиссий.Market_Number КАК Market_Number,
		|	_НачисленияКомиссий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_НачисленияКомиссий.ВалютаОплаты КАК ВалютаОплаты,
		|	_НачисленияКомиссий.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НачисленияКомиссий.КодУБрокера КАК КодУБрокера,
		|	_НачисленияКомиссий.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	ЕСТЬNULL(_Договоры.Договор, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)) КАК Договор,
		|	_Договоры.КоличествоДоговоров КАК КоличествоДоговоров,
		|	ВЫБОР
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.REPO"", ""Operations.Group.Charges.SE.Transaction"")
		|				И _НачисленияКомиссий.Market = ""MICEX""
		|			ТОГДА СделкаРЕПО.Ссылка
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.FX"", ""Operations.Group.Charges.SE.Transaction"")
		|				И _НачисленияКомиссий.Market = ""MOEX.FX""
		|			ТОГДА СделкаСВалютой.Ссылка
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Charges.SE.Transaction"", ""Operations.Group.Charges.Broker.Derivatives"")
		|				И _НачисленияКомиссий.Market В (""MICEX"", ""FORTS"")
		|				И _НачисленияКомиссий.Market_Number <> """"
		|			ТОГДА Сделка.Ссылка
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.SE.Transaction""
		|				И _НачисленияКомиссий.Market = ""FORTS""
		|				И _НачисленияКомиссий.Market_Number = """"
		|			ТОГДА _СделкиИсполненияФьючерсныхКонтрактов.Ссылка
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Charges.Broker.Bills"", ""Operations.Group.Settlements.Add.SE.Fee"")
		|				И _НачисленияКомиссий.Market = ""OTC""
		|			ТОГДА _ВнебиржевыеСделки.Объект
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.Broker.REPO""
		|				И _НачисленияКомиссий.Market = ""OTC""
		|			ТОГДА _ВнебиржевыеСделкиРепо.Объект
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.Broker.FX""
		|				И _НачисленияКомиссий.Market = ""OTC""
		|			ТОГДА _ВнебиржевыеСделкиСВалютой.Объект
		|		КОГДА _НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker"", ""Operations.Group.Charges.Broker.Derivatives"")
		|				И _НачисленияКомиссий.Market = ""OTC""
		|			ТОГДА СделкаСПФИ.Ссылка
		|	КОНЕЦ КАК Основание,
		|	ВЫБОР
		|		КОГДА _НачисленияКомиссий.Market_Number = """"
		|				И _НачисленияКомиссий.Deal_Record_UID = """"
		|				И НЕ(_НачисленияКомиссий.Market = ""FORTS""
		|						И _НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.SE.Transaction"")
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ФлагЕстьОснование
		|ИЗ
		|	_НачисленияКомиссий КАК _НачисленияКомиссий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _НачисленияКомиссий.Money_Market = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _НачисленияКомиссий.Market_Number = Сделка.НомерСделки
		|			И _НачисленияКомиссий.СчетДоверительногоУправления = Сделка.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Charges.SE.Transaction"", ""Operations.Group.Charges.Broker.Derivatives""))
		|			И (_НачисленияКомиссий.Market В (""MICEX"", ""FORTS""))
		|			И (_НачисленияКомиссий.Market_Number <> """")
		|			И (Сделка.Проведен = ИСТИНА)
		|			И (Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (Сделка.Организация = &Организация)
		|			И (Сделка.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиИсполненияФьючерсныхКонтрактов КАК _СделкиИсполненияФьючерсныхКонтрактов
		|		ПО _НачисленияКомиссий.СчетДоверительногоУправления = _СделкиИсполненияФьючерсныхКонтрактов.СчетДоверительногоУправления
		|			И _НачисленияКомиссий.ЦеннаяБумага = _СделкиИсполненияФьючерсныхКонтрактов.ЦеннаяБумага
		|			И _НачисленияКомиссий.Volume = _СделкиИсполненияФьючерсныхКонтрактов.Количество
		|			И (_НачисленияКомиссий.Market_Number = """")
		|			И (_НачисленияКомиссий.Market = ""FORTS"")
		|			И (_НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.SE.Transaction"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО (ВЫБОР
		|				КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом = ЛОЖЬ
		|					ТОГДА _НачисленияКомиссий.Market_Number = СделкаРЕПО.НомерСделки
		|				ИНАЧЕ _НачисленияКомиссий.Market_Number = СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
		|			КОНЕЦ)
		|			И _НачисленияКомиссий.СчетДоверительногоУправления = СделкаРЕПО.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.REPO"", ""Operations.Group.Charges.SE.Transaction""))
		|			И (_НачисленияКомиссий.Market = ""MICEX"")
		|			И (_НачисленияКомиссий.Market_Number <> """")
		|			И (СделкаРЕПО.ЧастьСделкиРЕПО = 1)
		|			И (СделкаРЕПО.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (СделкаРЕПО.Проведен = ИСТИНА)
		|			И (СделкаРЕПО.Организация = &Организация)
		|			И (СделкаРЕПО.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО _НачисленияКомиссий.Market_Number = СделкаСВалютой.НомерСделки
		|			И _НачисленияКомиссий.СчетДоверительногоУправления = СделкаСВалютой.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.FX"", ""Operations.Group.Charges.SE.Transaction""))
		|			И (_НачисленияКомиссий.Market = ""MOEX.FX"")
		|			И (_НачисленияКомиссий.Market_Number <> """")
		|			И (СделкаСВалютой.Проведен = ИСТИНА)
		|			И (СделкаСВалютой.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (СделкаСВалютой.Организация = &Организация)
		|			И (СделкаСВалютой.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСПФИ КАК СделкаСПФИ
		|		ПО _НачисленияКомиссий.Market_Number = СделкаСПФИ.НомерСделки
		|			И _НачисленияКомиссий.СчетДоверительногоУправления = СделкаСПФИ.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker"", ""Operations.Group.Charges.Broker.Derivatives""))
		|			И (_НачисленияКомиссий.Market = ""OTC"")
		|			И (_НачисленияКомиссий.Market_Number <> """")
		|			И (СделкаСПФИ.Проведен = ИСТИНА)
		|			И (СделкаСПФИ.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (СделкаСПФИ.Организация = &Организация)
		|			И (СделкаСПФИ.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделки
		|		ПО _НачисленияКомиссий.Deal_Record_UID = _ВнебиржевыеСделки.НомерОперации
		|			И _НачисленияКомиссий.СчетДоверительногоУправления = _ВнебиржевыеСделки.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Market = ""OTC"")
		|			И (_НачисленияКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Charges.Broker.Bills"", ""Operations.Group.Settlements.Add.SE.Fee""))
		|			И (_НачисленияКомиссий.Deal_Record_UID <> """")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделкиРепо
		|		ПО _НачисленияКомиссий.Deal_Record_UID = _ВнебиржевыеСделкиРепо.НомерОперации
		|			И _НачисленияКомиссий.СчетДоверительногоУправления = _ВнебиржевыеСделкиРепо.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Market = ""OTC"")
		|			И (_НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.Broker.REPO"")
		|			И (_НачисленияКомиссий.Deal_Record_UID <> """")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделкиСВалютой
		|		ПО _НачисленияКомиссий.Deal_Record_UID = _ВнебиржевыеСделкиСВалютой.НомерОперации
		|			И _НачисленияКомиссий.СчетДоверительногоУправления = _ВнебиржевыеСделкиСВалютой.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Market = ""OTC"")
		|			И (_НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.Broker.FX"")
		|			И (_НачисленияКомиссий.Deal_Record_UID <> """")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Договоры КАК _Договоры
		|		ПО _НачисленияКомиссий.СчетДоверительногоУправления = _Договоры.СчетДоверительногоУправления
		|			И (_НачисленияКомиссий.Origin_Operation_Type = ""Operations.Group.Charges.Depository"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Deal_Record_UID,
		|	Record_UID
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	МестоХраненияДенежныхСредств,
		|	ВидЗадолженности,
		|	ВалютаОплаты,
		|	ФлагЕстьОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _НачисленияКомиссий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВсеДоговорыДепозитарногоОбслуживания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Договоры";
#КонецОбласти
	
	СтрокаТиповБрокерскойКомиссии = "Operations.Group.Charges.Broker, Operations.Group.Charges.Broker.Equities, Operations.Group.Charges.Broker.FX, Operations.Group.Charges.Broker.REPO,
									|Operations.Group.Charges.Recovery, Operations.Group.Charges.Agent, Operations.Group.Charges.Broker.FX.REPO,
									|Operations.Group.Charges.Clearing, Operations.Group.Charges.Broker.Derivatives, Operations.Group.Charges.Broker.Bills";
	
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ДатаИмпорта);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("ДепозитарийЮрЛицо", Брокер.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ТипыБрокерскойКомиссии", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТиповБрокерскойКомиссии, ",", Истина, Истина));
			
	ГруппировкаПоСчету = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	МассивКодовНачислений = Новый Массив;
	
	Пока ГруппировкаПоСчету.Следующий() Цикл
		
		ГруппировкаПоМестуХранения = ГруппировкаПоСчету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоМестуХранения.Следующий() Цикл
	
			ГруппировкаПоВидуЗадолженности = ГруппировкаПоМестуХранения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ГруппировкаПоВидуЗадолженности.Следующий() Цикл
				
				ГруппировкаПоВалютеОплаты = ГруппировкаПоВидуЗадолженности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ГруппировкаПоВалютеОплаты.Следующий() Цикл
					
					ГруппировкаПоФлагуЕстьОснование = ГруппировкаПоВалютеОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ГруппировкаПоФлагуЕстьОснование.Следующий() Цикл
					
						ВыборкаЗаписей = ГруппировкаПоФлагуЕстьОснование.Выбрать();
												
						НомерСтроки = 0;
									
						Пока ВыборкаЗаписей.Следующий() Цикл
							
							Если НомерСтроки = 0 Тогда
								
								ОшибкиЧтения        = Новый Массив;
								НоваяСтрокаОперации = Операции.Добавить();
								
								Если ЗначениеЗаполнено(ВыборкаЗаписей.Deal_Record_UID) Или ВыборкаЗаписей.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария Тогда 
									НоваяСтрокаОперации.Ключ = СокрЛП(ВыборкаЗаписей.КодДляСверкиОпераций) + "/" + ВыборкаЗаписей.ВидЗадолженности.ИмяПредопределенныхДанных + "/" + ВыборкаЗаписей.ВалютаОплаты.Наименование + "/" + ВыборкаЗаписей.МестоХраненияДенежныхСредств.Наименование;
								ИначеЕсли Не ПустаяСтрока(ВыборкаЗаписей.Record_UID) Тогда
									НоваяСтрокаОперации.Ключ                = ?(ВыборкаЗаписей.Origin_Operation_Type = "Operations.Group.Charges.Broker", ВыборкаЗаписей.Charge_Record_UID, ВыборкаЗаписей.Record_UID);
									НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код", Справочники.ВнешниеСистемы.Матрих, ГруппаИмпортируемыхОбъектов, НоваяСтрокаОперации.Ключ);
								КонецЕсли;
								
								НоваяСтрокаОперации.Описание     = "Начисление комиссии / " + ?(ВыборкаЗаписей.Origin_Operation_Type = "Operations.Group.Charges.Broker", ВыборкаЗаписей.Charge_Record_UID, ВыборкаЗаписей.Record_UID);;
								НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
								НоваяСтрокаОперации.Статус       = "Новый";
								НоваяСтрокаОперации.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
														
								РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
								РеквизитыШапки.Проведен                     = Истина;
								РеквизитыШапки.ПометкаУдаления              = Ложь;
								РеквизитыШапки.Дата                         = ЭтотОбъект.ДатаИмпорта + 73799; // "20:29:59"
								РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
								РеквизитыШапки.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
								
								Если ЗначениеЗаполнено(ВыборкаЗаписей.ВидЗадолженности) Тогда
									РеквизитыШапки.ВидЗадолженности         = ВыборкаЗаписей.ВидЗадолженности;
								Иначе
									ОшибкиЧтения.Добавить("Не удалось определить вид задолженности по Origin_Operation_Type = [" + ВыборкаЗаписей.Origin_Operation_Type + "]");	
								КонецЕсли;
								
								РеквизитыШапки.ПрочиеДоходыИРасходы			= ПолучитьПрочиеДоходыИРасходы(ВыборкаЗаписей.ВидЗадолженности);
								РеквизитыШапки.МестоХранения                = ВыборкаЗаписей.МестоХраненияДенежныхСредств;
								РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
								РеквизитыШапки.Брокер                       = Брокер;
								РеквизитыШапки.Контрагент                   = РеквизитыШапки.Брокер.ЮрФизЛицо;
								РеквизитыШапки.Валюта                       = ВыборкаЗаписей.ВалютаОплаты;
								РеквизитыШапки.ДополнительнаяАналитика		= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка();
								РеквизитыШапки.ДатаПолученияДокумента		= НачалоДня(РеквизитыШапки.Дата);
								РеквизитыШапки.Договор                      = ВыборкаЗаписей.Договор;
								РеквизитыШапки.НачалоПериодаНачисления		= '00010101';
								РеквизитыШапки.ОкончаниеПериодаНачисления	= '00010101';
								РеквизитыШапки.Вознаграждение                    = Ложь;
								РеквизитыШапки.НеУчитыватьВСЧА                   = Ложь;
								РеквизитыШапки.ПоКлиентскомуОтноситьНаДатуОплаты = Ложь;
								
								Если ВыборкаЗаписей.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария Тогда
									
									Если ЗначениеЗаполнено(ВыборкаЗаписей.Договор) Тогда
										Если ВыборкаЗаписей.КоличествоДоговоров > 1 Тогда
											ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента [" + ВыборкаЗаписей.СчетДоверительногоУправления + "] на " + Формат(ДатаИмпорта, "ДФ=dd.MM.yyyy") + " обнаружено несколько действующих договоров депозитарного обслуживания! Для документов по депозитарной комиссии будет установлен договор " + ВыборкаЗаписей.Договор + ".");
										КонецЕсли;
									Иначе
										ОшибкиЧтения.Добавить("Не удалось определить договор депозитарного обслуживания для клиента [" + ВыборкаЗаписей.СчетДоверительногоУправления + "] на " + Формат(ДатаИмпорта, "ДФ=dd.MM.yyyy"));
									КонецЕсли;
									
								КонецЕсли;
								
								Основания = Новый Массив;
								НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, Основания", РеквизитыШапки, Основания);
								
							КонецЕсли;
							
							НомерСтроки = НомерСтроки + 1;										
							РеквизитыОснования = Новый Структура(ПоляДокумента.Основания);
							РеквизитыОснования.НомерСтроки = НомерСтроки;
							РеквизитыОснования.ДатаОплаты  = НачалоДня(ЭтотОбъект.ДатаИмпорта);
							РеквизитыОснования.Сумма       = ВыборкаЗаписей.Сумма;
							РеквизитыОснования.СтавкаНДС   = Перечисления.СтавкиНДС.ПустаяСсылка();
							РеквизитыОснования.СуммаНДС    = 0;
												
							Если ЗначениеЗаполнено(ВыборкаЗаписей.Основание) Тогда
								РеквизитыОснования.Основание = ВыборкаЗаписей.Основание;
							Иначе
								Если ВыборкаЗаписей.Market = "MICEX" Тогда
									
									Если ЗначениеЗаполнено(ВыборкаЗаписей.Market_Number) Тогда
										ОшибкиЧтения.Добавить("Не удалось определить документ основание по номеру сделки/сделки Репо [" + ВыборкаЗаписей.Market_Number + "].");
									Иначе
										ОшибкиЧтения.Добавить("Не удалось определить документ основание. Отсутствует номер сделки [Market_Number]. Операция Record_UID [" + ВыборкаЗаписей.Record_UID + "].");
									КонецЕсли;
									
								ИначеЕсли ВыборкаЗаписей.Market = "MOEX.FX" Тогда
									
									Если ЗначениеЗаполнено(ВыборкаЗаписей.Market_Number) Тогда
										ОшибкиЧтения.Добавить("Не удалось определить документ основание по номеру сделки с валютой [" + ВыборкаЗаписей.Market_Number + "].");
									Иначе
										ОшибкиЧтения.Добавить("Не удалось определить документ основание. Отсутствует номер сделки с валютой [Market_Number]. Операция Record_UID [" + ВыборкаЗаписей.Record_UID + "].");
									КонецЕсли;
									
								ИначеЕсли ВыборкаЗаписей.Market = "OTC" Тогда
									
									Если ЗначениеЗаполнено(ВыборкаЗаписей.Market_Number) Тогда
										ОшибкиЧтения.Добавить("Не удалось определить документ основание по номеру сделки/сделки Репо [" + ВыборкаЗаписей.Market_Number + "].");
									ИначеЕсли ЗначениеЗаполнено(ВыборкаЗаписей.Deal_Record_UID) Тогда
										ОшибкиЧтения.Добавить("Не удалось определить документ основание по Matrix ID [" + ВыборкаЗаписей.Deal_Record_UID + "].");
									КонецЕсли;
									
								Иначе
									 ОшибкиЧтения.Добавить("Не удалось определить документ основание. Операция Record_UID [" + ВыборкаЗаписей.Record_UID + "], место хранения [" + ВыборкаЗаписей.Market + "].");
								КонецЕсли;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ВыборкаЗаписей.Основание) И ТипЗнч(ВыборкаЗаписей.Основание) = Тип("ДокументСсылка.Сделка") Или ТипЗнч(ВыборкаЗаписей.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
							    РеквизитыОснования.ЦеннаяБумага = ВыборкаЗаписей.ЦеннаяБумага;
							КонецЕсли;
							
							Основания.Добавить(РеквизитыОснования);
							
							Если ОшибкиЧтения.Количество() > 0 Тогда
								НоваяСтрокаОперации.Статус = "Ошибка чтения";
							КонецЕсли;
							//есть начисления без основания, в прошлой загрузке они загружались отдельными документами
							Если ЗначениеЗаполнено(НоваяСтрокаОперации.КодВоВнешнейСистеме) И ВыборкаЗаписей.Origin_Operation_Type <> "Operations.Group.Charges.Broker" Тогда 
								НомерСтроки = 0;
							КонецЕсли;
											
						КонецЦикла;
																
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ВнебиржевыеОперации.НомерОперации, _КодыСчетовУБрокера.КодДляСверкиОпераций) КАК Ключ,
		|	НачислениеЗадолженности.ВидЗадолженности.ИмяПредопределенныхДанных КАК ВидЗадолженностиИмяПредопределенныхДанных,
		|	НачислениеЗадолженности.Валюта.Наименование КАК ВалютаНаименование,
		|	НачислениеЗадолженности.МестоХранения.Наименование КАК МестоХраненияНаименование,
		|	ВЫБОР
		|		КОГДА _ВнебиржевыеОперации.НомерОперации ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагСформироватьКлюч,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовУБрокера КАК _КодыСчетовУБрокера
		|		ПО НачислениеЗадолженности.СчетДоверительногоУправления = _КодыСчетовУБрокера.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО НачислениеЗадолженности.Ссылка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	НачислениеЗадолженности.Организация = &Организация
		|	И НЕ НачислениеЗадолженности.ПометкаУдаления
		|	И НачислениеЗадолженности.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|	И (НачислениеЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|			ИЛИ НачислениеЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|			ИЛИ НачислениеЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария))
		|	И НачислениеЗадолженности.Брокер = &Брокер
		|	И НЕ НачислениеЗадолженности.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
#КонецОбласти	

	ТекущиеОперации = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТекущиеОперации Из ТекущиеОперации Цикл
		Если СтрокаТекущиеОперации.ФлагСформироватьКлюч Тогда
			СтрокаТекущиеОперации.Ключ = "" + СокрЛП(СтрокаТекущиеОперации.Ключ) + "/" + СтрокаТекущиеОперации.ВидЗадолженностиИмяПредопределенныхДанных + "/" + СтрокаТекущиеОперации.ВалютаНаименование + "/" + СтрокаТекущиеОперации.МестоХраненияНаименование;
		КонецЕсли;	
	КонецЦикла;	
	
	ИсключитьИзСверки = "РасчетныйСчетКонтрагента";	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
		
КонецФункции 

Функция ОбработатьОплатыКомиссий_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
		
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Оплата, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).Дата КАК Дата,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.Договор КАК Договор,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _НачисленнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&ГраницаОплат,
		|			Организация = &Организация
		|				И НЕ СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаИсключеныИзЗагрузки.Счет
		|						ИЗ
		|							_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|				И Контрагент = &Контрагент) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НачисленнаяЗадолженность.Дата КАК ДатаДок,
		|	_НачисленнаяЗадолженность.Основание КАК ДокНачислениеЗадолженности,
		|	_НачисленнаяЗадолженность.Договор КАК Договор,
		|	_НачисленнаяЗадолженность.Организация КАК Организация,
		|	_НачисленнаяЗадолженность.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НачисленнаяЗадолженность.Валюта КАК Валюта,
		|	_НачисленнаяЗадолженность.Контрагент КАК Контрагент,
		|	_НачисленнаяЗадолженность.СуммаОстаток КАК СуммаОстаток,
		|	СУММА(_НачисленнаяЗадолженность1.СуммаОстаток) КАК СуммаИтого,
		|	_НачисленнаяЗадолженность.ВидЗадолженности КАК ВидЗадолженности
		|ПОМЕСТИТЬ _ЗадолженностьСИтогами
		|ИЗ
		|	_НачисленнаяЗадолженность КАК _НачисленнаяЗадолженность
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НачисленнаяЗадолженность КАК _НачисленнаяЗадолженность1
		|		ПО _НачисленнаяЗадолженность.Дата >= _НачисленнаяЗадолженность1.Дата
		|			И _НачисленнаяЗадолженность.СчетДоверительногоУправления = _НачисленнаяЗадолженность1.СчетДоверительногоУправления
		|			И _НачисленнаяЗадолженность.Валюта = _НачисленнаяЗадолженность1.Валюта
		|			И _НачисленнаяЗадолженность.Договор = _НачисленнаяЗадолженность1.Договор
		|			И _НачисленнаяЗадолженность.Контрагент = _НачисленнаяЗадолженность1.Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	_НачисленнаяЗадолженность.Дата,
		|	_НачисленнаяЗадолженность.Основание,
		|	_НачисленнаяЗадолженность.Договор,
		|	_НачисленнаяЗадолженность.Организация,
		|	_НачисленнаяЗадолженность.СчетДоверительногоУправления,
		|	_НачисленнаяЗадолженность.Валюта,
		|	_НачисленнаяЗадолженность.Контрагент,
		|	_НачисленнаяЗадолженность.СуммаОстаток,
		|	_НачисленнаяЗадолженность.ВидЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Money_Operations.Record_UID КАК Record_UID,
		|	_Money_Operations.Date КАК Date,
		|	_Money_Operations.Deal_Record_UID КАК Deal_Record_UID,
		|	_Money_Operations.Charge_Record_UID КАК Charge_Record_UID,
		|	_Money_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
		|	_Money_Operations.Money_Storage_Place КАК Money_Storage_Place,
		|	_Money_Operations.Volume КАК Volume,
		|	ВЫБОР
		|		КОГДА _Money_Operations.Origin_Operation_Type В (&ТипыБрокерскойКомиссии)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Depository""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.Add.SE.Fee""
		|				ИЛИ _Money_Operations.Origin_Operation_Type = ""Operations.Group.Charges.SE.Transaction""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА _Money_Operations.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		КОГДА _Money_Operations.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА _Money_Operations.Money_Storage_Place = ""OTC""
		|				И _Money_Operations.Origin_Operation_Type = ""Operations.Group.Charges.Broker.FX""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОснованиеСделкаСВалютой,
		|	_Money_Operations.Payment_Amount КАК Сумма,
		|	_Money_Operations.Market_Number КАК Market_Number,
		|	_Money_Operations.ЗадолженностьНачисленаВТекущемДне КАК ЗадолженностьНачисленаВТекущемДне,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Валюты.Валюта КАК ВалютаОплаты,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК КодУБрокера,
		|	_КодыСчетовВнутреннегоУчета.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОплатыКомиссийБезОснований
		|ИЗ
		|	_Money_Operations КАК _Money_Operations
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Operations.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Deals КАК _Deals
		|		ПО _Money_Operations.Deal_Record_UID = _Deals.Record_UID
		|			И _Money_Operations.Market_Number = _Deals.Market_Number
		|			И _Money_Operations.Date = _Deals.Date
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _Money_Operations.Security_ID = _ЦенныеБумаги.Matrix_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_Operations.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Money_Operations.Payment_Currency_Code = _Валюты.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Money_Operations.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|ГДЕ
		|	_Money_Operations.Date = &НачалоПериода
		|	И _Money_Operations.Origin_Operation_Type В (&ТипыБрокерскойКомиссии, ""Operations.Group.Charges.Depository"", ""Operations.Group.Settlements.Add.SE.Fee"", ""Operations.Group.Charges.SE.Transaction"")
		|	И НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|	И НЕ(_Money_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.Add.SE.Fee""
		|				И НЕ _Deals.Record_UID ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОплатыКомиссийБезОснований.Record_UID КАК Record_UID,
		|	_ОплатыКомиссийБезОснований.Date КАК Date,
		|	_ОплатыКомиссийБезОснований.Origin_Operation_Type КАК Origin_Operation_Type,
		|	_ОплатыКомиссийБезОснований.Deal_Record_UID КАК Deal_Record_UID,
		|	_ОплатыКомиссийБезОснований.Charge_Record_UID КАК Charge_Record_UID,
		|	_ОплатыКомиссийБезОснований.ВидДвижения КАК ВидДвижения,
		|	_ОплатыКомиссийБезОснований.ОснованиеСделкаСВалютой КАК ОснованиеСделкаСВалютой,
		|	_ОплатыКомиссийБезОснований.Market_Number КАК Market_Number,
		|	_ОплатыКомиссийБезОснований.МестоХраненияДенежныхСредств КАК МестоХраненияДенежныхСредств,
		|	_ОплатыКомиссийБезОснований.ВалютаОплаты КАК ВалютаОплаты,
		|	_ОплатыКомиссийБезОснований.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОплатыКомиссийБезОснований.КодУБрокера КАК КодУБрокера,
		|	_ОплатыКомиссийБезОснований.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	_ОплатыКомиссийБезОснований.ВидЗадолженности КАК ВидЗадолженности,
		|	_ОплатыКомиссийБезОснований.ЗадолженностьНачисленаВТекущемДне КАК ЗадолженностьНачисленаВТекущемДне,
		|	_ОплатыКомиссийБезОснований.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.REPO"", ""Operations.Group.Settlements.Add.SE.Fee"")
		|				И _ОплатыКомиссийБезОснований.Money_Storage_Place <> ""FORTS""
		|				И _ОплатыКомиссийБезОснований.Market_Number <> """"
		|			ТОГДА СделкаРЕПО.Ссылка
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.FX"", ""Operations.Group.Settlements.Add.SE.Fee"")
		|				И _ОплатыКомиссийБезОснований.Market_Number <> """"
		|			ТОГДА СделкаСВалютой.Ссылка
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Clearing"", ""Operations.Group.Charges.Broker"", ""Operations.Group.Charges.Broker.Derivatives"")
		|				И _ОплатыКомиссийБезОснований.Market_Number <> """"
		|				И НЕ СделкаСПФИ.Ссылка ЕСТЬ NULL
		|			ТОГДА СделкаСПФИ.Ссылка
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Settlements.Add.SE.Fee"", ""Operations.Group.Charges.Broker.Derivatives"")
		|				И _ОплатыКомиссийБезОснований.Market_Number <> """"
		|			ТОГДА ЕСТЬNULL(Сделка.Ссылка, _ВнебиржевыеСделки.Объект)
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type = ""Operations.Group.Charges.SE.Transaction""
		|				И _ОплатыКомиссийБезОснований.Market_Number = """"
		|				И _ОплатыКомиссийБезОснований.Money_Storage_Place = ""FORTS""
		|			ТОГДА _СделкиИсполненияФьючерсныхКонтрактов.Ссылка
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Charges.Broker.FX"", ""Operations.Group.Charges.Broker.Bills"")
		|				И _ОплатыКомиссийБезОснований.Market_Number = """"
		|			ТОГДА _ВнебиржевыеСделки.Объект
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type = ""Operations.Group.Charges.Broker.REPO""
		|				И _ОплатыКомиссийБезОснований.Market_Number = """"
		|			ТОГДА _ВнебиржевыеСделкиРепо.Объект
		|		КОГДА _ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Recovery"", ""Operations.Group.Charges.Clearing"", ""Operations.Group.Charges.Agent"", ""Operations.Group.Charges.Broker"")
		|			ТОГДА _НачисленияКомиссий.Объект
		|	КОНЕЦ КАК Основание
		|ПОМЕСТИТЬ _ОплатыКомиссий
		|ИЗ
		|	_ОплатыКомиссийБезОснований КАК _ОплатыКомиссийБезОснований
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО (ВЫБОР
		|				КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом = ЛОЖЬ
		|					ТОГДА _ОплатыКомиссийБезОснований.Market_Number = СделкаРЕПО.НомерСделки
		|				ИНАЧЕ _ОплатыКомиссийБезОснований.Market_Number = СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
		|			КОНЕЦ)
		|			И (НЕ _ОплатыКомиссийБезОснований.Market_Number = """")
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.REPO"", ""Operations.Group.Settlements.Add.SE.Fee""))
		|			И (_ОплатыКомиссийБезОснований.Money_Storage_Place <> ""FORTS"")
		|			И (СделкаРЕПО.ЧастьСделкиРЕПО = 1)
		|			И (СделкаРЕПО.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (СделкаРЕПО.Проведен = ИСТИНА)
		|			И (СделкаРЕПО.Организация = &Организация)
		|			И (СделкаРЕПО.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО _ОплатыКомиссийБезОснований.Market_Number = СделкаСВалютой.НомерСделки
		|			И (НЕ _ОплатыКомиссийБезОснований.Market_Number = """")
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.FX"", ""Operations.Group.Settlements.Add.SE.Fee""))
		|			И (СделкаСВалютой.Проведен = ИСТИНА)
		|			И (СделкаСВалютой.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (СделкаСВалютой.Организация = &Организация)
		|			И (СделкаСВалютой.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _ОплатыКомиссийБезОснований.Market_Number = Сделка.НомерСделки
		|			И (НЕ _ОплатыКомиссийБезОснований.Market_Number = """")
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Settlements.Add.SE.Fee"", ""Operations.Group.Charges.Broker.Derivatives""))
		|			И (Сделка.Проведен = ИСТИНА)
		|			И (Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (Сделка.Организация = &Организация)
		|			И (Сделка.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСПФИ КАК СделкаСПФИ
		|		ПО _ОплатыКомиссийБезОснований.Market_Number = СделкаСПФИ.НомерСделки
		|			И _ОплатыКомиссийБезОснований.СчетДоверительногоУправления = СделкаСПФИ.СчетДоверительногоУправления
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Clearing"", ""Operations.Group.Charges.Broker"", ""Operations.Group.Charges.Broker.Derivatives""))
		|			И (_ОплатыКомиссийБезОснований.Market_Number <> """")
		|			И (СделкаСПФИ.Проведен = ИСТИНА)
		|			И (СделкаСПФИ.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			И (СделкаСПФИ.Организация = &Организация)
		|			И (СделкаСПФИ.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиИсполненияФьючерсныхКонтрактов КАК _СделкиИсполненияФьючерсныхКонтрактов
		|		ПО _ОплатыКомиссийБезОснований.СчетДоверительногоУправления = _СделкиИсполненияФьючерсныхКонтрактов.СчетДоверительногоУправления
		|			И _ОплатыКомиссийБезОснований.ЦеннаяБумага = _СделкиИсполненияФьючерсныхКонтрактов.ЦеннаяБумага
		|			И _ОплатыКомиссийБезОснований.Volume = _СделкиИсполненияФьючерсныхКонтрактов.Количество
		|			И (_ОплатыКомиссийБезОснований.Market_Number = """")
		|			И (_ОплатыКомиссийБезОснований.Money_Storage_Place = ""FORTS"")
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type = ""Operations.Group.Charges.SE.Transaction"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделки
		|		ПО _ОплатыКомиссийБезОснований.Deal_Record_UID = _ВнебиржевыеСделки.НомерОперации
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Broker.Equities"", ""Operations.Group.Charges.Broker.FX"", ""Operations.Group.Charges.Broker.Bills""))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделкиРепо
		|		ПО _ОплатыКомиссийБезОснований.Deal_Record_UID = _ВнебиржевыеСделкиРепо.НомерОперации
		|			И (_ОплатыКомиссийБезОснований.Market_Number = """")
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type = ""Operations.Group.Charges.Broker.REPO"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _НачисленияКомиссий
		|		ПО _ОплатыКомиссийБезОснований.Charge_Record_UID = _НачисленияКомиссий.НомерОперации
		|			И (_ОплатыКомиссийБезОснований.Origin_Operation_Type В (""Operations.Group.Charges.Recovery"", ""Operations.Group.Charges.Clearing"", ""Operations.Group.Charges.Agent"", ""Operations.Group.Charges.Broker""))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОплатыКомиссий.Record_UID КАК Record_UID,
		|	_ОплатыКомиссий.Date КАК Date,
		|	_ОплатыКомиссий.Origin_Operation_Type КАК Origin_Operation_Type,
		|	_ОплатыКомиссий.Deal_Record_UID КАК Deal_Record_UID,
		|	_ОплатыКомиссий.Charge_Record_UID КАК Charge_Record_UID,
		|	_ОплатыКомиссий.ВидДвижения КАК ВидДвижения,
		|	_ОплатыКомиссий.ОснованиеСделкаСВалютой КАК ОснованиеСделкаСВалютой,
		|	ВЫБОР
		|		КОГДА _ОплатыКомиссий.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|				И НЕ _ЗадолженностьСИтогами.СуммаИтого ЕСТЬ NULL
		|				И НЕ _ОплатыКомиссий.ЗадолженностьНачисленаВТекущемДне
		|			ТОГДА ВЫБОР
		|					КОГДА _ОплатыКомиссий.Сумма >= _ЗадолженностьСИтогами.СуммаИтого
		|						ТОГДА _ЗадолженностьСИтогами.СуммаОстаток
		|					ИНАЧЕ _ОплатыКомиссий.Сумма - (_ЗадолженностьСИтогами.СуммаИтого - _ЗадолженностьСИтогами.СуммаОстаток)
		|				КОНЕЦ
		|		ИНАЧЕ _ОплатыКомиссий.Сумма
		|	КОНЕЦ КАК Сумма,
		|	_ОплатыКомиссий.Market_Number КАК Market_Number,
		|	_ОплатыКомиссий.МестоХраненияДенежныхСредств КАК МестоХраненияДенежныхСредств,
		|	_ОплатыКомиссий.ВалютаОплаты КАК ВалютаОплаты,
		|	_ОплатыКомиссий.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОплатыКомиссий.КодУБрокера КАК КодУБрокера,
		|	_ОплатыКомиссий.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	ЕСТЬNULL(_ОплатыКомиссий.Основание, _ЗадолженностьСИтогами.ДокНачислениеЗадолженности) КАК Основание,
		|	ЕСТЬNULL(_ЗадолженностьСИтогами.Договор, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)) КАК Договор,
		|	_ОплатыКомиссий.ВидЗадолженности КАК ВидЗадолженности
		|ИЗ
		|	_ОплатыКомиссий КАК _ОплатыКомиссий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьСИтогами КАК _ЗадолженностьСИтогами
		|		ПО _ОплатыКомиссий.СчетДоверительногоУправления = _ЗадолженностьСИтогами.СчетДоверительногоУправления
		|			И _ОплатыКомиссий.ВидЗадолженности = _ЗадолженностьСИтогами.ВидЗадолженности
		|			И (ВЫБОР
		|				КОГДА _ОплатыКомиссий.ЗадолженностьНачисленаВТекущемДне
		|					ТОГДА НАЧАЛОПЕРИОДА(_ЗадолженностьСИтогами.ДатаДок, ДЕНЬ) = &НачалоПериода
		|				ИНАЧЕ _ОплатыКомиссий.Сумма > ЕСТЬNULL(_ЗадолженностьСИтогами.СуммаИтого, 0) - ЕСТЬNULL(_ЗадолженностьСИтогами.СуммаОстаток, 0)
		|			КОНЕЦ)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(_ОплатыКомиссий.Основание) = ТИП(Документ.СделкаСПФИ)
		|				ТОГДА ВЫБОР
		|						КОГДА НЕ ВЫРАЗИТЬ(_ОплатыКомиссий.Основание КАК Документ.СделкаСПФИ).ОтложеннаяОплатаКлиринговогоСбора
		|								И _ОплатыКомиссий.Origin_Operation_Type В (""Operations.Group.Charges.Clearing"")
		|							ТОГДА ЛОЖЬ
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Deal_Record_UID,
		|	Record_UID
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	МестоХраненияДенежныхСредств,
		|	ВидЗадолженности,
		|	ВалютаОплаты,
		|	ОснованиеСделкаСВалютой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _НачисленнаяЗадолженность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЗадолженностьСИтогами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОплатыКомиссий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОплатыКомиссийБезОснований";
#КонецОбласти
	
	СтрокаТиповБрокерскойКомиссии = "Operations.Group.Charges.Broker, Operations.Group.Charges.Broker.Equities, Operations.Group.Charges.Broker.FX, Operations.Group.Charges.Broker.REPO,
									|Operations.Group.Charges.Recovery, Operations.Group.Charges.Agent, Operations.Group.Charges.Broker.FX.REPO,
									|Operations.Group.Charges.Clearing, Operations.Group.Charges.Broker.Derivatives, Operations.Group.Charges.Broker.Bills";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("ГраницаОплат", Новый Граница(ЭтотОбъект.ДатаИмпорта + (20 * 60 + 30) * 60, ВидГраницы.Исключая)); // время оплат 20:30:00
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("Контрагент", Брокер.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ТипыБрокерскойКомиссии", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТиповБрокерскойКомиссии, ",", Истина, Истина));
	
	ГруппировкаПоСчету = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МаксимальныйНомерСтроки = 1000;
	Пока ГруппировкаПоСчету.Следующий() Цикл
		
		ГруппировкаПоМестуХранения = ГруппировкаПоСчету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоМестуХранения.Следующий() Цикл
	
			ГруппировкаПоВидуЗадолженности = ГруппировкаПоМестуХранения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ГруппировкаПоВидуЗадолженности.Следующий() Цикл
				
				ГруппировкаПоВалютеОплаты = ГруппировкаПоВидуЗадолженности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ГруппировкаПоВалютеОплаты.Следующий() Цикл
					//оплаты комиссий по сделкам с валютой нужно выделить в отдельный документ.
					ГруппировкаПоДокументуОснования = ГруппировкаПоВалютеОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ГруппировкаПоДокументуОснования.Следующий() Цикл
						
						ВыборкаЗаписей = ГруппировкаПоДокументуОснования.Выбрать();
						НомерСтроки = 0;
						МассивСуммТекстом = Новый Массив; // Массив(Строка)
						НоваяСтрокаОперации = Неопределено;
						
						Пока ВыборкаЗаписей.Следующий() Цикл
							
							НомерСтроки = НомерСтроки + 1;
							
							Если НомерСтроки = 1 Тогда
								ОшибкиЧтения = Новый Массив;
								НоваяСтрокаОперации = Операции.Добавить();
								
								НоваяСтрокаОперации.Ключ = СокрЛП(ВыборкаЗаписей.КодДляСверкиОпераций)
									+ ?(ВыборкаЗаписей.ОснованиеСделкаСВалютой, "/FX", "")
									+ "/" + ВыборкаЗаписей.ВидЗадолженности.ИмяПредопределенныхДанных
									+ "/" + ВыборкаЗаписей.ВалютаОплаты.Наименование
									+ "/" + ВыборкаЗаписей.МестоХраненияДенежныхСредств.Наименование + "/"; // Сумму добавим потом
								
								НоваяСтрокаОперации.Описание     = "Оплата комиссии / "
									+ ?(ВыборкаЗаписей.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария,
										ВыборкаЗаписей.КодУБрокера, ВыборкаЗаписей.Record_UID);
								НоваяСтрокаОперации.Статус       = "Новый";
								НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
								НоваяСтрокаОперации.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
								
								РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
								РеквизитыШапки.Проведен                     = Истина;
								РеквизитыШапки.ПометкаУдаления              = Ложь;
								РеквизитыШапки.Дата                         = ЭтотОбъект.ДатаИмпорта + (20 * 60 + 30) * 60; //"20:30:00"
								РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
								РеквизитыШапки.ВидДвижения                  = ВыборкаЗаписей.ВидДвижения;
								
								Если ЗначениеЗаполнено(ВыборкаЗаписей.ВидЗадолженности) Тогда
									РеквизитыШапки.ВидЗадолженности         = ВыборкаЗаписей.ВидЗадолженности;
								Иначе
									ОшибкиЧтения.Добавить("Не удалось определить вид задолженности по Origin_Operation_Type = [" + ВыборкаЗаписей.Origin_Operation_Type + "]");	
								КонецЕсли;
								
								РеквизитыШапки.Аванс                        = Ложь;
								РеквизитыШапки.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
								РеквизитыШапки.МестоХранения                = ВыборкаЗаписей.МестоХраненияДенежныхСредств;
								РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
								РеквизитыШапки.ВалютаОплаты                 = ВыборкаЗаписей.ВалютаОплаты;
								РеквизитыШапки.Брокер                       = Брокер;
								РеквизитыШапки.СтрокаБанковскойВыписки      = Документы.СтрокаБанковскойВыписки.ПустаяСсылка();
								РеквизитыШапки.Контрагент                   = РеквизитыШапки.Брокер.ЮрФизЛицо;
								РеквизитыШапки.РасчетныйСчетКонтрагента     = Справочники.БанковскиеСчета.ПустаяСсылка();
								РеквизитыШапки.Договор                      = ВыборкаЗаписей.Договор;
								
								Основания = Новый Массив;
								НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, Основания", РеквизитыШапки, Основания);
							КонецЕсли;
							
							РеквизитыОснования = Новый Структура(ПоляДокумента.Основания);
							РеквизитыОснования.НомерСтроки           = НомерСтроки;
							РеквизитыОснования.Валюта                = ВыборкаЗаписей.ВалютаОплаты;
							РеквизитыОснования.Сумма                 = ВыборкаЗаписей.Сумма;
							РеквизитыОснования.СуммаКупона           = 0;
							РеквизитыОснования.СобственныйКурсОплаты = Ложь;
							РеквизитыОснования.КурсОплаты            = Неопределено;
							РеквизитыОснования.СуммаОплаты           = ВыборкаЗаписей.Сумма;
							РеквизитыОснования.СуммаОплатыКупона     = 0;
							
							Если ЗначениеЗаполнено(ВыборкаЗаписей.Основание) Тогда
								РеквизитыОснования.Основание = ВыборкаЗаписей.Основание;
							Иначе
								Если ВыборкаЗаписей.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария Тогда
									ОшибкиЧтения.Добавить("Не удалось определить начисление задолженности для оплаты расходов депозитария по клиенту [" + ВыборкаЗаписей.СчетДоверительногоУправления + "] на сумму " + ВыборкаЗаписей.Сумма + " " + ВыборкаЗаписей.ВалютаОплаты + " !");
								Иначе
									ОшибкиЧтения.Добавить("Не удалось определить документ основание по " + ?(ЗначениеЗаполнено(ВыборкаЗаписей.Market_Number), "номеру сделки [" + ВыборкаЗаписей.Market_Number + "]", "ID операции [" + ?(ЗначениеЗаполнено(ВыборкаЗаписей.Deal_Record_UID), ВыборкаЗаписей.Deal_Record_UID, ВыборкаЗаписей.Charge_Record_UID) + "]"));
								КонецЕсли;
							КонецЕсли;
							
							Основания.Добавить(РеквизитыОснования);
							
							Если ОшибкиЧтения.Количество() > 0 Тогда
								НоваяСтрокаОперации.Статус = "Ошибка чтения";
							КонецЕсли;
							
							МассивСуммТекстом.Добавить(Формат(ВыборкаЗаписей.Сумма, "ЧРД=.; ЧГ="));
							
							// Как только проходит 1000 строк, создаётся новая операция
							Если НомерСтроки = МаксимальныйНомерСтроки Тогда
								НоваяСтрокаОперации.Ключ = НоваяСтрокаОперации.Ключ + ПолучитьХешСуммуМассива(МассивСуммТекстом);
								НомерСтроки = 0;
								МассивСуммТекстом = Новый Массив;
							КонецЕсли;
						КонецЦикла;
						
						// Хеширование сумм для ключа
						Если НоваяСтрокаОперации <> Неопределено Тогда
							НоваяСтрокаОперации.Ключ = НоваяСтрокаОперации.Ключ + ПолучитьХешСуммуМассива(МассивСуммТекстом);
						КонецЕсли;
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
				
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Оплата.Ссылка КАК Ссылка,
		|	Оплата.ВидЗадолженности КАК ВидЗадолженности,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОплатаОснования.Основание ССЫЛКА Документ.СделкаСВалютой
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ФлагСделкаСВалютой
		|ПОМЕСТИТЬ _Основания
		|ИЗ
		|	Документ.Оплата КАК Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|		ПО Оплата.Ссылка = ОплатаОснования.Ссылка
		|ГДЕ
		|	Оплата.Организация = &Организация
		|	И НЕ Оплата.ПометкаУдаления
		|	И Оплата.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|			ИЛИ Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|			ИЛИ Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария))
		|	И Оплата.Брокер = &Брокер
		|	И НЕ Оплата.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплата.Ссылка,
		|	Оплата.ВидЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Основания.Ссылка КАК Ссылка,
		|	ОплатаОснования.Сумма КАК Сумма
		|ИЗ
		|	_Основания КАК Основания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|		ПО Основания.Ссылка = ОплатаОснования.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Основания.Ссылка,
		|	ОплатаОснования.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА _Основания.ФлагСделкаСВалютой
		|				И Оплата.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА _КодыСчетовУБрокера.КодДляСверкиОпераций + ""/FX""
		|		ИНАЧЕ _КодыСчетовУБрокера.КодДляСверкиОпераций
		|	КОНЕЦ КАК СТРОКА(256)) КАК Ключ,
		|	Оплата.ВидЗадолженности.ИмяПредопределенныхДанных КАК ВидЗадолженностиИмяПредопределенныхДанных,
		|	Оплата.ВалютаОплаты.Наименование КАК ВалютаОплатыНаименование,
		|	Оплата.МестоХранения.Наименование КАК МестоХраненияНаименование,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.Оплата КАК Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовУБрокера КАК _КодыСчетовУБрокера
		|		ПО Оплата.СчетДоверительногоУправления = _КодыСчетовУБрокера.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Основания КАК _Основания
		|		ПО Оплата.Ссылка = _Основания.Ссылка
		|ГДЕ
		|	Оплата.Ссылка В
		|			(ВЫБРАТЬ
		|				_Основания.Ссылка
		|			ИЗ
		|				_Основания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Основания";
	#КонецОбласти
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	СуммыОснований = РезультатыЗапроса[1].Выбрать();
	ТекущиеОперации = РезультатыЗапроса[2].Выгрузить();
	
	// Распределение сумм оснований по каждому документу для подсчёта хеш-сумм
	МассивыСуммТекстомПоОплатам = Новый Соответствие; // Соответствие(ДокументСсылка.Оплата, Массив(Строка))
	ПоследняяСсылка = Неопределено;
	МассивСуммТекстом = Неопределено;
	Пока СуммыОснований.Следующий() Цикл
		Если СуммыОснований.Ссылка <> ПоследняяСсылка Тогда
			МассивСуммТекстом = МассивыСуммТекстомПоОплатам.Получить(СуммыОснований.Ссылка);
		КонецЕсли;
		Если МассивСуммТекстом = Неопределено Тогда
			МассивСуммТекстом = Новый Массив;
			МассивыСуммТекстомПоОплатам.Вставить(СуммыОснований.Ссылка, МассивСуммТекстом);
		КонецЕсли;
		МассивСуммТекстом.Добавить(Формат(СуммыОснований.Сумма, "ЧРД=.; ЧГ="));
		ПоследняяСсылка = СуммыОснований.Ссылка;
	КонецЦикла;
	
	// Подсчёт хеш-сумм по суммам оснований документов оплат комиссий
	ХешСуммыПоОплатам = Новый Соответствие; // Соответствие(ДокументСсылка.Оплата, Строка)
	Для Каждого КлючЗначение Из МассивыСуммТекстомПоОплатам Цикл
		ХешСуммыПоОплатам.Вставить(КлючЗначение.Ключ, ПолучитьХешСуммуМассива(КлючЗначение.Значение));
	КонецЦикла;
	
	Для Каждого СтрокаТекущиеОперации Из ТекущиеОперации Цикл
		ХешСумма = ХешСуммыПоОплатам.Получить(СтрокаТекущиеОперации.Ссылка);
		Если ХешСумма = Неопределено Тогда
			ХешСумма = "";
		КонецЕсли;
		СтрокаТекущиеОперации.Ключ = "" + СокрЛП(СтрокаТекущиеОперации.Ключ)
			+ "/" + СтрокаТекущиеОперации.ВидЗадолженностиИмяПредопределенныхДанных
			+ "/" + СтрокаТекущиеОперации.ВалютаОплатыНаименование
			+ "/" + СтрокаТекущиеОперации.МестоХраненияНаименование
			+ "/" + ХешСумма;
	КонецЦикла;
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьОплатыВнебиржевыхСделок_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	Группа_Payment = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Payment");
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Оплата, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнебиржевыеСделки.Брокер КАК Брокер,
		|	_ВнебиржевыеСделки.Организация КАК Организация,
		|	_ВнебиржевыеСделки.ГруппаОбъектов КАК ГруппаОбъектов,
		|	_ВнебиржевыеСделки.НомерОперации КАК НомерОперации,
		|	УсловияСделокСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокСрезПоследних.Сделка КАК Сделка,
		|	СУММА(УсловияСделокСрезПоследних.Сумма) КАК Сумма,
		|	СУММА(УсловияСделокСрезПоследних.СуммаКупона) КАК СуммаКупона,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке) КАК ВидЗадолженности,
		|	УсловияСделокСрезПоследних.ВалютаОплаты КАК Валюта,
		|	УсловияСделокСрезПоследних.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	УсловияСделокСрезПоследних.КурсОплаты КАК КурсОплаты
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	_ВнебиржевыеОперации КАК _ВнебиржевыеСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО _ВнебиржевыеСделки.Объект = УсловияСделокСрезПоследних.Сделка
		|			И _ВнебиржевыеСделки.Организация = УсловияСделокСрезПоследних.Организация
		|ГДЕ
		|	НЕ _ВнебиржевыеСделки.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВнебиржевыеСделки.Брокер,
		|	_ВнебиржевыеСделки.Организация,
		|	_ВнебиржевыеСделки.ГруппаОбъектов,
		|	_ВнебиржевыеСделки.НомерОперации,
		|	УсловияСделокСрезПоследних.СчетДоверительногоУправления,
		|	УсловияСделокСрезПоследних.Сделка,
		|	УсловияСделокСрезПоследних.ВалютаОплаты,
		|	УсловияСделокСрезПоследних.СобственныйКурсОплаты,
		|	УсловияСделокСрезПоследних.КурсОплаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ВнебиржевыеСделкиРепо.Брокер,
		|	_ВнебиржевыеСделкиРепо.Организация,
		|	_ВнебиржевыеСделкиРепо.ГруппаОбъектов,
		|	_ВнебиржевыеСделкиРепо.НомерОперации,
		|	УсловияСделокРЕПОСрезПоследних.СчетДоверительногоУправления,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.Сумма,
		|	УсловияСделокРЕПОСрезПоследних.СуммаКупона,
		|	УсловияСделокРЕПОСрезПоследних.ВидЗадолженности,
		|	УсловияСделокРЕПОСрезПоследних.ВалютаОплаты,
		|	УсловияСделокРЕПОСрезПоследних.СобственныйКурсОплаты,
		|	УсловияСделокРЕПОСрезПоследних.КурсОплаты
		|ИЗ
		|	_ВнебиржевыеОперации КАК _ВнебиржевыеСделкиРепо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО _ВнебиржевыеСделкиРепо.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И _ВнебиржевыеСделкиРепо.Объект = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|ГДЕ
		|	НЕ _ВнебиржевыеСделкиРепо.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Money_Operations.Ключ КАК Ключ,
		|	_Money_Operations.Record_UID КАК Record_UID,
		|	_Money_Operations.Date КАК Date,
		|	_Money_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
		|	_Money_Operations.Payment_Amount КАК Payment_Amount,
		|	_Money_Operations.Coupon_Amount КАК Coupon_Amount,
		|	_Money_Operations.Direction КАК Direction,
		|	_Money_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	_Money_Operations.Money_Storage_Place КАК Money_Storage_Place,
		|	_Money_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
		|	_Money_Operations.Deal_Record_UID КАК Deal_Record_UID
		|ПОМЕСТИТЬ _Money_Operations_OTC
		|ИЗ
		|	_Money_Operations КАК _Money_Operations
		|ГДЕ
		|	_Money_Operations.Date = &НачалоПериода
		|	И _Money_Operations.Origin_Operation_Type В (""Operations.Group.Settlements.Delivery"", ""Operations.Group.Settlements.Payment"", ""Operations.Group.Settlements.REPO.Payment.Near"", ""Operations.Group.Settlements.REPO.Payment.Far"")
		|	И _Money_Operations.Money_Storage_Place = ""OTC""
		|	И _Money_Operations.Market_Number = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Money_Operations_OTC.Record_UID КАК Record_UID,
		|	_Money_Operations_OTC.Date КАК Date,
		|	ВЫБОР
		|		КОГДА _Money_Operations_OTC.Origin_Operation_Type В (""Operations.Group.Settlements.Delivery"", ""Operations.Group.Settlements.Payment"")
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|		КОГДА _Money_Operations_OTC.Origin_Operation_Type В (""Operations.Group.Settlements.REPO.Payment.Near"")
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|		КОГДА _Money_Operations_OTC.Origin_Operation_Type В (""Operations.Group.Settlements.REPO.Payment.Far"")
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА _Money_Operations_OTC.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		КОГДА _Money_Operations_OTC.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	_Money_Operations_OTC.Payment_Amount КАК Сумма,
		|	_Money_Operations_OTC.Coupon_Amount КАК СуммаКупона,
		|	_Money_Operations_OTC.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	_Money_Operations_OTC.Money_Storage_Place КАК Money_Storage_Place,
		|	_Money_Operations_OTC.Payment_Currency_Code КАК Payment_Currency_Code,
		|	_Money_Operations_OTC.Deal_Record_UID КАК Deal_Record_UID,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Валюты.Валюта КАК ВалютаОплаты,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК КодУБрокера
		|ПОМЕСТИТЬ _ВнешниеДанные
		|ИЗ
		|	_Money_Operations_OTC КАК _Money_Operations_OTC
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Operations_OTC.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_Operations_OTC.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Money_Operations_OTC.Payment_Currency_Code = _Валюты.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Money_Operations_OTC.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|ГДЕ
		|	НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнешниеДанные.Record_UID КАК Record_UID,
		|	_ВнешниеДанные.Deal_Record_UID КАК Deal_Record_UID,
		|	_ВнешниеДанные.Date КАК Date,
		|	_ВнешниеДанные.ВидЗадолженности КАК ВидЗадолженности,
		|	_ВнешниеДанные.ВидДвижения КАК ВидДвижения,
		|	_ВнешниеДанные.МестоХраненияДенежныхСредств КАК МестоХраненияДенежныхСредств,
		|	_ВнешниеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВнешниеДанные.КодУБрокера КАК КодУБрокера,
		|	ЕСТЬNULL(_УсловияСделок.Сделка, _ВнебиржевыеСделки.Объект) КАК Основание,
		|	ВЫБОР
		|		КОГДА _ВнешниеДанные.ВалютаОплаты <> _УсловияСделок.Сделка.ВалютаСделки
		|				И _ВнешниеДанные.ВалютаОплаты = &РоссийскийРубль
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(_УсловияСделок.СобственныйКурсОплаты, ЛОЖЬ) = ИСТИНА
		|						ТОГДА ВЫБОР
		|								КОГДА ТИПЗНАЧЕНИЯ(_УсловияСделок.КурсОплаты) = ТИП(ЧИСЛО)
		|										И _УсловияСделок.КурсОплаты <> 0
		|									ТОГДА ВЫРАЗИТЬ(_ВнешниеДанные.Сумма / (ВЫРАЗИТЬ(_УсловияСделок.КурсОплаты КАК ЧИСЛО(10, 4))) КАК ЧИСЛО(19, 2))
		|								КОГДА ТИПЗНАЧЕНИЯ(_УсловияСделок.КурсОплаты) = ТИП(ДАТА)
		|										И _УсловияСделок.КурсОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|									ТОГДА ВЫРАЗИТЬ(_ВнешниеДанные.Сумма * СобственныйКурс.Кратность / СобственныйКурс.Курс КАК ЧИСЛО(19, 2))
		|							КОНЕЦ
		|					ИНАЧЕ ВЫРАЗИТЬ(_ВнешниеДанные.Сумма * КурсыВалют.Кратность / КурсыВалют.Курс КАК ЧИСЛО(19, 2))
		|				КОНЕЦ
		|		ИНАЧЕ _ВнешниеДанные.Сумма
		|	КОНЕЦ КАК СуммаВВалютеСделки,
		|	_ВнешниеДанные.Сумма КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА _ВнешниеДанные.ВалютаОплаты <> _УсловияСделок.Сделка.ВалютаСделки
		|				И _ВнешниеДанные.ВалютаОплаты = &РоссийскийРубль
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(_УсловияСделок.СобственныйКурсОплаты, ЛОЖЬ) = ИСТИНА
		|						ТОГДА ВЫБОР
		|								КОГДА ТИПЗНАЧЕНИЯ(_УсловияСделок.КурсОплаты) = ТИП(ЧИСЛО)
		|										И _УсловияСделок.КурсОплаты <> 0
		|									ТОГДА ВЫРАЗИТЬ(_ВнешниеДанные.СуммаКупона / (ВЫРАЗИТЬ(_УсловияСделок.КурсОплаты КАК ЧИСЛО(10, 4))) КАК ЧИСЛО(19, 2))
		|								КОГДА ТИПЗНАЧЕНИЯ(_УсловияСделок.КурсОплаты) = ТИП(ДАТА)
		|										И _УсловияСделок.КурсОплаты <> ДАТАВРЕМЯ(1, 1, 1)
		|									ТОГДА ВЫРАЗИТЬ(_ВнешниеДанные.СуммаКупона * СобственныйКурс.Кратность / СобственныйКурс.Курс КАК ЧИСЛО(19, 2))
		|							КОНЕЦ
		|					ИНАЧЕ ВЫРАЗИТЬ(_ВнешниеДанные.СуммаКупона * КурсыВалют.Кратность / КурсыВалют.Курс КАК ЧИСЛО(19, 2))
		|				КОНЕЦ
		|		ИНАЧЕ _ВнешниеДанные.СуммаКупона
		|	КОНЕЦ КАК СуммаКупонаВВалютеСделки,
		|	_ВнешниеДанные.СуммаКупона КАК СуммаОплатыКупона,
		|	_УсловияСделок.Сделка.ВалютаСделки КАК ВалютаСделки,
		|	_ВнешниеДанные.ВалютаОплаты КАК ВалютаОплаты,
		|	_УсловияСделок.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	_УсловияСделок.КурсОплаты КАК КурсОплаты
		|ПОМЕСТИТЬ _ОплатыВнебиржевыхСделокВнешниеДанные
		|ИЗ
		|	_ВнешниеДанные КАК _ВнешниеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО _УсловияСделок.Сделка.ВалютаСделки = КурсыВалют.Валюта
		|				И (КурсыВалют.Период = &НачалоПериода)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК СобственныйКурс
		|			ПО _УсловияСделок.Сделка.ВалютаСделки = СобственныйКурс.Валюта
		|				И (_УсловияСделок.СобственныйКурсОплаты = ИСТИНА)
		|				И (ТИПЗНАЧЕНИЯ(_УсловияСделок.КурсОплаты) = ТИП(ДАТА))
		|				И (_УсловияСделок.КурсОплаты <> ДАТАВРЕМЯ(1, 1, 1))
		|				И _УсловияСделок.КурсОплаты = СобственныйКурс.Период
		|		ПО _ВнешниеДанные.Deal_Record_UID = _УсловияСделок.НомерОперации
		|			И _ВнешниеДанные.СчетДоверительногоУправления = _УсловияСделок.СчетДоверительногоУправления
		|			И _ВнешниеДанные.ВидЗадолженности = _УсловияСделок.ВидЗадолженности
		|			И (_УсловияСделок.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделки
		|		ПО _ВнешниеДанные.Deal_Record_UID = _ВнебиржевыеСделки.НомерОперации
		|			И (_ВнешниеДанные.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|				ИЛИ _ВнебиржевыеСделки.Объект ССЫЛКА Документ.СделкаСВалютой)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнебиржевыеОперации.НомерОперации КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.Оплата КАК Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО Оплата.Ссылка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	Оплата.Организация = &Организация
		|	И НЕ Оплата.ПометкаУдаления
		|	И Оплата.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Оплата.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И Оплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|	И Оплата.Брокер = &Брокер
		|	И НЕ Оплата.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Money_Operations_OTC
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВнешниеДанные";
#КонецОбласти
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("РоссийскийРубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
		
	ОплатыВнебиржевыхСделокДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_ОплатыВнебиржевыхСделокВнешниеДанные"].ПолучитьДанные().Выбрать();
			
	Пока Выборка.Следующий() Цикл
						
		ОшибкиЧтения                     = Новый Массив;
		НоваяСтрокаОперации              = Операции.Добавить();					
		НоваяСтрокаОперации.Ключ         = Выборка.Record_UID;
		НоваяСтрокаОперации.Описание     = "Оплата / " + Выборка.ВидЗадолженности + " / " + Выборка.Record_UID;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
				Справочники.ВнешниеСистемы.Матрих, Группа_Payment, Выборка.Record_UID);
		
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = ?(Выборка.ВидДвижения = Перечисления.ВидыДвижений.Расход, ЭтотОбъект.ДатаИмпорта + ((19 * 60 + 30) * 60), ?(ЗначениеЗаполнено(Выборка.Основание) И НачалоДня(Выборка.Основание.Дата) = ЭтотОбъект.ДатаИмпорта, Выборка.Основание.Дата + 2, ЭтотОбъект.ДатаИмпорта + (9 * 60 + 30) *60));
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.ВидДвижения                  = Выборка.ВидДвижения;
		РеквизитыШапки.ВидЗадолженности             = Выборка.ВидЗадолженности;
		РеквизитыШапки.Аванс                        = Ложь;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.МестоХранения                = Выборка.МестоХраненияДенежныхСредств;
		РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.ВалютаОплаты                 = Выборка.ВалютаОплаты;
		РеквизитыШапки.Брокер                       = Брокер;
		РеквизитыШапки.СтрокаБанковскойВыписки      = Документы.СтрокаБанковскойВыписки.ПустаяСсылка();
		РеквизитыШапки.Контрагент 					= Справочники.ЮрФизЛица.ПустаяСсылка();
		РеквизитыШапки.РасчетныйСчетКонтрагента 	= Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.Договор               		= Справочники.Договоры.ПустаяСсылка();	
				

		Основания = Новый Массив;
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, Основания", РеквизитыШапки, Основания);
					
		РеквизитыОснования = Новый Структура(ПоляДокумента.Основания);
		РеквизитыОснования.НомерСтроки = 1;
		
		Если ЗначениеЗаполнено(Выборка.Основание) Тогда 
			
			РеквизитыОснования.Основание = Выборка.Основание;
			
			Если РеквизитыШапки.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО Тогда
				РеквизитыШапки.Контрагент = Выборка.Основание.Контрагент;
			КонецЕсли;

		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить документ основание по коду матрих [" + Выборка.Deal_Record_UID + "]");
		КонецЕсли;
		
		РеквизитыОснования.СобственныйКурсОплаты = Ложь;
		РеквизитыОснования.КурсОплаты            = Неопределено;
		РеквизитыОснования.Сумма                 = Выборка.СуммаВВалютеСделки;
		РеквизитыОснования.СуммаКупона           = Выборка.СуммаКупонаВВалютеСделки;
		РеквизитыОснования.Валюта                = ?(ЗначениеЗаполнено(Выборка.ВалютаСделки), Выборка.ВалютаСделки, Выборка.ВалютаОплаты);
		РеквизитыОснования.СуммаОплаты           = Выборка.СуммаОплаты;
		РеквизитыОснования.СуммаОплатыКупона     = Выборка.СуммаОплатыКупона;
										
		Основания.Добавить(РеквизитыОснования);
									
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
										
	КонецЦикла;
	
	ИсключитьИзСверки = "Дата";
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ОплатыВнебиржевыхСделокДанныеСистемы, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьОплатыПоВозвратуКупона_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	Группа_Payment = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Payment");
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Оплата, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Money_Operations.Ключ КАК Ключ,
		|	_Money_Operations.Record_UID КАК Record_UID,
		|	_Money_Operations.Date КАК Date,
		|	_Money_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
		|	_Money_Operations.Payment_Amount КАК Payment_Amount,
		|	_Money_Operations.Coupon_Amount КАК Coupon_Amount,
		|	_Money_Operations.Direction КАК Direction,
		|	_Money_Operations.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	_Money_Operations.Money_Storage_Place КАК Money_Storage_Place,
		|	_Money_Operations.Payment_Currency_Code КАК Payment_Currency_Code,
		|	_Money_Operations.Security_ID КАК Security_ID,
		|	_Money_Operations.Deal_Record_UID КАК Deal_Record_UID,
		|	_Money_Operations.Market_Number КАК Market_Number
		|ПОМЕСТИТЬ _Money_Operations_Instructions
		|ИЗ
		|	_Money_Operations КАК _Money_Operations
		|ГДЕ
		|	_Money_Operations.Date = &НачалоПериода
		|	И _Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.IncomeReturn"", ""Operations.Group.Payments.CouponReturn"")
		|	И _Money_Operations.Direction = ""-1""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Money_Instructions.Ключ,
		|	_Money_Instructions.Record_UID,
		|	_Money_Instructions.Date,
		|	_Money_Instructions.Operation_Type,
		|	0,
		|	_Money_Instructions.Amount,
		|	""-1"",
		|	_Money_Instructions.Inner_Account_Division_ID,
		|	_Money_Instructions.Money_Storage_Place,
		|	_Money_Instructions.Currency_Code,
		|	"""",
		|	_Money_Instructions.Deal_Record_UID,
		|	_Money_Instructions.Market_Number
		|ИЗ
		|	_Money_Instructions КАК _Money_Instructions
		|ГДЕ
		|	_Money_Instructions.Date = &НачалоПериода
		|	И _Money_Instructions.Deal_Record_UID <> """"
		|	И _Money_Instructions.Operation_Type = ""Operations.Group.MoneyInstructions.Out""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Money_Operations_Instructions.Record_UID КАК Record_UID,
		|	_Money_Operations_Instructions.Date КАК Date,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода) КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА _Money_Operations_Instructions.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		КОГДА _Money_Operations_Instructions.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	_Money_Operations_Instructions.Payment_Amount КАК Сумма,
		|	_Money_Operations_Instructions.Coupon_Amount КАК СуммаКупона,
		|	_Money_Operations_Instructions.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	_Money_Operations_Instructions.Money_Storage_Place КАК Money_Storage_Place,
		|	_Money_Operations_Instructions.Payment_Currency_Code КАК Payment_Currency_Code,
		|	_Money_Operations_Instructions.Security_ID КАК Security_ID,
		|	_Money_Operations_Instructions.Deal_Record_UID КАК Deal_Record_UID,
		|	_Money_Operations_Instructions.Market_Number КАК Market_Number,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Валюты.Валюта КАК ВалютаОплаты,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК КодУБрокера,
		|	_КодыСчетовВнутреннегоУчета.КодДляСверкиОпераций КАК КодДляСверкиОпераций
		|ПОМЕСТИТЬ _ВнешниеДанные
		|ИЗ
		|	_Money_Operations_Instructions КАК _Money_Operations_Instructions
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Operations_Instructions.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_Operations_Instructions.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Money_Operations_Instructions.Payment_Currency_Code = _Валюты.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Money_Operations_Instructions.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|ГДЕ
		|	НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнешниеДанные.Record_UID КАК Record_UID,
		|	_ВнешниеДанные.Deal_Record_UID КАК Deal_Record_UID,
		|	_ВнешниеДанные.Market_Number КАК Market_Number,
		|	_ВнешниеДанные.Date КАК Date,
		|	_ВнешниеДанные.ВидЗадолженности КАК ВидЗадолженности,
		|	_ВнешниеДанные.ВидДвижения КАК ВидДвижения,
		|	_ВнешниеДанные.МестоХраненияДенежныхСредств КАК МестоХраненияДенежныхСредств,
		|	_ВнешниеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВнешниеДанные.КодУБрокера КАК КодУБрокера,
		|	_ВнешниеДанные.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	ВЫБОР
		|		КОГДА _ВнешниеДанные.Market_Number = """"
		|			ТОГДА _ВнебиржевыеСделки.Объект
		|		ИНАЧЕ ЕСТЬNULL(СделкаРЕПО.Ссылка, Сделка.Ссылка)
		|	КОНЕЦ КАК Основание,
		|	_ВнешниеДанные.Сумма КАК СуммаОплаты,
		|	_ВнешниеДанные.Security_ID КАК КодМатрихЦБ,
		|	_ВнешниеДанные.СуммаКупона КАК СуммаОплатыКупона,
		|	_ВнешниеДанные.ВалютаОплаты КАК ВалютаОплаты
		|ИЗ
		|	_ВнешниеДанные КАК _ВнешниеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеСделки
		|		ПО _ВнешниеДанные.Deal_Record_UID = _ВнебиржевыеСделки.НомерОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО (ВЫБОР
		|				КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом
		|					ТОГДА _ВнешниеДанные.Market_Number = СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
		|				ИНАЧЕ _ВнешниеДанные.Market_Number = СделкаРЕПО.НомерСделки
		|			КОНЕЦ)
		|			И (СделкаРЕПО.ЧастьСделкиРЕПО = 1)
		|			И (_ВнешниеДанные.Market_Number <> """")
		|			И (СделкаРЕПО.Организация = &Организация)
		|			И (СделкаРЕПО.Брокер = &Брокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _ВнешниеДанные.Market_Number = Сделка.НомерСделки
		|			И (_ВнешниеДанные.Market_Number <> """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправления,
		|	МестоХраненияДенежныхСредств,
		|	Deal_Record_UID УБЫВ,
		|	Market_Number УБЫВ
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	МестоХраненияДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Money_Operations_Instructions
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВнешниеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _УсловияСделок";
#КонецОбласти
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
		
	ГруппировкаПоСчету = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ГруппировкаПоСчету.Следующий() Цикл
		
		ГруппировкаПоМестуХранения = ГруппировкаПоСчету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоМестуХранения.Следующий() Цикл
	
			Выборка = ГруппировкаПоМестуХранения.Выбрать();
			
			НомерСтроки = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НомерСтроки = 0 Тогда
				
					ОшибкиЧтения                     = Новый Массив;
					НоваяСтрокаОперации              = Операции.Добавить();
					НоваяСтрокаОперации.Ключ         = Выборка.МестоХраненияДенежныхСредств.Наименование + "/" + Выборка.КодДляСверкиОпераций;	
					НоваяСтрокаОперации.Описание     = "Оплата / " + Выборка.ВидЗадолженности + " / " + ?(ЗначениеЗаполнено(Выборка.Market_Number), Выборка.КодУБрокера, Выборка.Record_UID);
					НоваяСтрокаОперации.Статус       = "Новый";
					НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
					НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
										
					РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
					РеквизитыШапки.Проведен                     = Истина;
					РеквизитыШапки.ПометкаУдаления              = Ложь;
					РеквизитыШапки.Дата                         = ?(Выборка.ВидДвижения = Перечисления.ВидыДвижений.Расход, ЭтотОбъект.ДатаИмпорта + ((19 * 60 + 30) * 60), ?(ЗначениеЗаполнено(Выборка.Основание) И НачалоДня(Выборка.Основание.Дата) = ЭтотОбъект.ДатаИмпорта, Выборка.Основание.Дата + 2, ЭтотОбъект.ДатаИмпорта + (9 * 60 + 30) *60));
					РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
					РеквизитыШапки.ВидДвижения                  = Выборка.ВидДвижения;
					РеквизитыШапки.ВидЗадолженности             = Выборка.ВидЗадолженности;
					РеквизитыШапки.Аванс                        = Ложь;
					РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
					РеквизитыШапки.МестоХранения                = Выборка.МестоХраненияДенежныхСредств;
					РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
					РеквизитыШапки.ВалютаОплаты                 = Выборка.ВалютаОплаты;
					РеквизитыШапки.Брокер                       = Брокер;
					РеквизитыШапки.СтрокаБанковскойВыписки      = Документы.СтрокаБанковскойВыписки.ПустаяСсылка();
					РеквизитыШапки.РасчетныйСчетКонтрагента 	= Справочники.БанковскиеСчета.ПустаяСсылка();
					РеквизитыШапки.Договор               		= Справочники.Договоры.ПустаяСсылка();	
							
					
					Основания = Новый Массив;
					НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, Основания", РеквизитыШапки, Основания);

				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
				РеквизитыОснования = Новый Структура(ПоляДокумента.Основания);
				
				РеквизитыОснования.НомерСтроки = НомерСтроки;
				
				Если ЗначениеЗаполнено(Выборка.Основание) Тогда 
					
					РеквизитыОснования.Основание = Выборка.Основание;
					
					Если Выборка.Основание.Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
						РеквизитыШапки.Контрагент = Выборка.Основание.Брокер.ЮрФизЛицо
					Иначе 
						РеквизитыШапки.Контрагент = Выборка.Основание.Контрагент;
					КонецЕсли;

				Иначе
					ОшибкиЧтения.Добавить("Не удалось определить " + ?(Выборка.Market_Number = "", " документ основание по коду матрих [" + Выборка.Deal_Record_UID + "]", "сделку Репо по номеру сделки [" + Выборка.Market_Number + "]"));
				КонецЕсли;
				
				РеквизитыОснования.СобственныйКурсОплаты = Ложь;
				РеквизитыОснования.КурсОплаты            = Неопределено;
				РеквизитыОснования.Сумма                 = Выборка.СуммаОплаты;
				РеквизитыОснования.СуммаКупона           = Выборка.СуммаОплатыКупона;
				РеквизитыОснования.Валюта                = Выборка.ВалютаОплаты;
				РеквизитыОснования.СуммаОплаты           = Выборка.СуммаОплаты;
				РеквизитыОснования.СуммаОплатыКупона     = Выборка.СуммаОплатыКупона;
												
				Основания.Добавить(РеквизитыОснования);
											
				Если ОшибкиЧтения.Количество() > 0 Тогда
					НоваяСтрокаОперации.Статус = "Ошибка чтения";
				КонецЕсли;
									
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Оплата.МестоХранения.Наименование + ""/"" + _КодыСчетовУБрокера.КодДляСверкиОпераций КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.Оплата КАК Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовУБрокера КАК _КодыСчетовУБрокера
		|		ПО Оплата.СчетДоверительногоУправления = _КодыСчетовУБрокера.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО Оплата.Ссылка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	Оплата.Организация = &Организация
		|	И НЕ Оплата.ПометкаУдаления
		|	И Оплата.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|	И Оплата.Брокер = &Брокер
		|	И НЕ Оплата.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
#КонецОбласти

	ИсключитьИзСверки = "Дата";
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, Запрос.Выполнить().Выгрузить(), ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьОплатыПоПогашениям_OTBR(МВТ)
	
	Перем Операции, ПоляДокумента;
		
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Оплата, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеДивидендов).ЦеннаяБумага
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеКупона).Облигация
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеДивидендов).Количество
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеКупона).Количество
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|	КОНЕЦ КАК Количество,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Аванс КАК Аванс,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаНачальныйОстаток + ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОборот > 0
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаНачальныйОстаток + ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОборот > 0
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупонаОстаток
		|ПОМЕСТИТЬ _Задолженности
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&ПериодВозникновенияЗадолженности,
		|			,
		|			,
		|			Организация = &Организация
		|				И НЕ СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаИсключеныИзЗагрузки.Счет
		|						ИЗ
		|							_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона))
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Money_Operations.Date КАК Date,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	СУММА(_Money_Operations.Volume) КАК Volume
		|ПОМЕСТИТЬ _ПогашенияВДень
		|ИЗ
		|	_Money_Operations КАК _Money_Operations
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Operations.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _Money_Operations.Security_ID = _ЦенныеБумаги.Matrix_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_Operations.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|ГДЕ
		|	_Money_Operations.Date = &НачалоПериода
		|	И _Money_Operations.Direction = ""1""
		|	И _Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.Redemption"", ""Operations.Group.Payments.PartialRedemption"")
		|	И НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|	И НЕ _ЦенныеБумаги.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	_Money_Operations.Date,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления,
		|	_ЦенныеБумаги.Ссылка
		|ИМЕЮЩИЕ
		|	СУММА(_Money_Operations.Volume) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_Money_Operations.Record_UID) КАК Record_UID,
		|	_Money_Operations.Date КАК Date,
		|	_Money_Operations.Origin_Operation_Type КАК Origin_Operation_Type,
		|	ВЫБОР
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.Dividend""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.PartialRedemption""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.Redemption""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.SharesIncome""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи)
		|		КОГДА _Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.Coupon"", ""Operations.Group.Payments.IncomeReturn"", ""Operations.Group.Payments.CouponReturn"")
		|				И _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ _ПогашенияВДень.СчетДоверительногоУправления ЕСТЬ NULL
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.Ссылка КАК Справочник.Облигации).ДатаПогашения <= &НачалоПериода
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА _Money_Operations.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		КОГДА _Money_Operations.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	СУММА(_Money_Operations.Payment_Amount) КАК Сумма,
		|	СУММА(_Money_Operations.Coupon_Amount) КАК СуммаКупона,
		|	СУММА(_Money_Operations.Volume) КАК Volume,
		|	_Money_Operations.Security_ID КАК Security_ID,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА НЕ _ПогашенияВДень.СчетДоверительногоУправления ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьПогашениеВДень,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Валюты.Валюта КАК ВалютаОплаты,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК КодУБрокера
		|ПОМЕСТИТЬ _ВнешниеДанные
		|ИЗ
		|	_Money_Operations КАК _Money_Operations
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Operations.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _Money_Operations.Security_ID = _ЦенныеБумаги.Matrix_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_Operations.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Money_Operations.Payment_Currency_Code = _Валюты.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Money_Operations.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПогашенияВДень КАК _ПогашенияВДень
		|		ПО _Money_Operations.Date = _ПогашенияВДень.Date
		|			И _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления = _ПогашенияВДень.СчетДоверительногоУправления
		|			И _ЦенныеБумаги.Ссылка = _ПогашенияВДень.ЦеннаяБумага
		|			И _Money_Operations.Volume = _ПогашенияВДень.Volume
		|ГДЕ
		|	_Money_Operations.Date = &НачалоПериода
		|	И (_Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.Coupon"", ""Operations.Group.Payments.Redemption"", ""Operations.Group.Payments.PartialRedemption"", ""Operations.Group.Payments.Dividend"", ""Operations.Group.Payments.SharesIncome"")
		|			ИЛИ _Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.IncomeReturn"", ""Operations.Group.Payments.CouponReturn"")
		|				И _Money_Operations.Direction = ""1"")
		|	И НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	_Money_Operations.Origin_Operation_Type,
		|	ВЫБОР
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.Dividend""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.PartialRedemption""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.Redemption""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
		|		КОГДА _Money_Operations.Origin_Operation_Type = ""Operations.Group.Payments.SharesIncome""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи)
		|		КОГДА _Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.Coupon"", ""Operations.Group.Payments.IncomeReturn"", ""Operations.Group.Payments.CouponReturn"")
		|				И _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ _ПогашенияВДень.СчетДоверительногоУправления ЕСТЬ NULL
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.Ссылка КАК Справочник.Облигации).ДатаПогашения <= &НачалоПериода
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _Money_Operations.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		КОГДА _Money_Operations.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ,
		|	_Money_Operations.Security_ID,
		|	_ЦенныеБумаги.Ссылка,
		|	ВЫБОР
		|		КОГДА НЕ _ПогашенияВДень.СчетДоверительногоУправления ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	_МестаХраненияДенежныхСредств.Ссылка,
		|	_Валюты.Валюта,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number,
		|	_Money_Operations.Date
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнешниеДанные.Record_UID КАК Record_UID,
		|	_ВнешниеДанные.Date КАК Date,
		|	_ВнешниеДанные.ВидЗадолженности КАК ВидЗадолженности,
		|	_ВнешниеДанные.ВидДвижения КАК ВидДвижения,
		|	_ВнешниеДанные.Volume КАК Volume,
		|	_ВнешниеДанные.МестоХраненияДенежныхСредств КАК МестоХраненияДенежныхСредств,
		|	_ВнешниеДанные.ВалютаОплаты КАК ВалютаОплаты,
		|	_ВнешниеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВнешниеДанные.Сумма КАК Сумма,
		|	_ВнешниеДанные.СуммаКупона КАК СуммаКупона,
		|	_ВнешниеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВнешниеДанные.ЕстьПогашениеВДень КАК ЕстьПогашениеВДень,
		|	_Задолженности.Основание КАК Основание,
		|	_Задолженности.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(_Задолженности.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(_Задолженности.СуммаКупонаОстаток, 0) КАК СуммаКупонаОстаток,
		|	ЕСТЬNULL(_Задолженности.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаЗадолженности,
		|	ЕСТЬNULL(ЗадолженностиСКоличествомОснований.КоличествоОснований, 0) КАК КоличествоОснований,
		|	ЕСТЬNULL(_Задолженности.Количество, 0) КАК Количество,
		|	_ЗадолженностиАльт.Основание КАК ОснованиеАльт,
		|	_ЗадолженностиАльт.Контрагент КАК КонтрагентАльт,
		|	ЕСТЬNULL(_ЗадолженностиАльт.СуммаОстаток, 0) КАК СуммаОстатокАльт,
		|	ЕСТЬNULL(_ЗадолженностиАльт.СуммаКупонаОстаток, 0) КАК СуммаКупонаОстатокАльт,
		|	ЕСТЬNULL(_ЗадолженностиАльт.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаЗадолженностиАльт,
		|	ЕСТЬNULL(ЗадолженностиСКоличествомОснованийАльт.КоличествоОснований, 0) КАК КоличествоОснованийАльт,
		|	ЕСТЬNULL(_ЗадолженностиАльт.Количество, 0) КАК КоличествоАльт
		|ПОМЕСТИТЬ _ОплатыПоПогашениямВнешниеДанные
		|ИЗ
		|	_ВнешниеДанные КАК _ВнешниеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_Задолженности.ЦеннаяБумага КАК ЦеннаяБумага,
		|			_Задолженности.Количество КАК Количество,
		|			_Задолженности.ВидЗадолженности КАК ВидЗадолженности,
		|			_Задолженности.Организация КАК Организация,
		|			_Задолженности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _Задолженности.Основание) КАК КоличествоОснований
		|		ИЗ
		|			_Задолженности КАК _Задолженности
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_Задолженности.ЦеннаяБумага,
		|			_Задолженности.Количество,
		|			_Задолженности.ВидЗадолженности,
		|			_Задолженности.Организация,
		|			_Задолженности.СчетДоверительногоУправления) КАК ЗадолженностиСКоличествомОснований
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Задолженности КАК _Задолженности
		|			ПО ЗадолженностиСКоличествомОснований.СчетДоверительногоУправления = _Задолженности.СчетДоверительногоУправления
		|				И ЗадолженностиСКоличествомОснований.ВидЗадолженности = _Задолженности.ВидЗадолженности
		|				И ЗадолженностиСКоличествомОснований.ЦеннаяБумага = _Задолженности.ЦеннаяБумага
		|				И ЗадолженностиСКоличествомОснований.Количество = _Задолженности.Количество
		|				И (ЗадолженностиСКоличествомОснований.КоличествоОснований = 1)
		|		ПО _ВнешниеДанные.СчетДоверительногоУправления = ЗадолженностиСКоличествомОснований.СчетДоверительногоУправления
		|			И _ВнешниеДанные.ВидЗадолженности = ЗадолженностиСКоличествомОснований.ВидЗадолженности
		|			И _ВнешниеДанные.ЦеннаяБумага = ЗадолженностиСКоличествомОснований.ЦеннаяБумага
		|			И _ВнешниеДанные.Volume = ЗадолженностиСКоличествомОснований.Количество
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_Задолженности.ЦеннаяБумага КАК ЦеннаяБумага,
		|			_Задолженности.Количество КАК Количество,
		|			_Задолженности.ВидЗадолженности КАК ВидЗадолженности,
		|			_Задолженности.Организация КАК Организация,
		|			_Задолженности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _Задолженности.Основание) КАК КоличествоОснований
		|		ИЗ
		|			_Задолженности КАК _Задолженности
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_Задолженности.ЦеннаяБумага,
		|			_Задолженности.Количество,
		|			_Задолженности.ВидЗадолженности,
		|			_Задолженности.Организация,
		|			_Задолженности.СчетДоверительногоУправления) КАК ЗадолженностиСКоличествомОснованийАльт
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Задолженности КАК _ЗадолженностиАльт
		|			ПО ЗадолженностиСКоличествомОснованийАльт.СчетДоверительногоУправления = _ЗадолженностиАльт.СчетДоверительногоУправления
		|				И ЗадолженностиСКоличествомОснованийАльт.ВидЗадолженности = _ЗадолженностиАльт.ВидЗадолженности
		|				И ЗадолженностиСКоличествомОснованийАльт.ЦеннаяБумага = _ЗадолженностиАльт.ЦеннаяБумага
		|				И ЗадолженностиСКоличествомОснованийАльт.Количество = _ЗадолженностиАльт.Количество
		|				И (ЗадолженностиСКоличествомОснованийАльт.КоличествоОснований = 1)
		|		ПО _ВнешниеДанные.СчетДоверительногоУправления = ЗадолженностиСКоличествомОснованийАльт.СчетДоверительногоУправления
		|			И _ВнешниеДанные.ЦеннаяБумага = ЗадолженностиСКоличествомОснованийАльт.ЦеннаяБумага
		|			И _ВнешниеДанные.Volume = ЗадолженностиСКоличествомОснованийАльт.Количество
		|			И ЗадолженностиСКоличествомОснованийАльт.ВидЗадолженности = ВЫБОР
		|				КОГДА _ВнешниеДанные.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|				КОГДА _ВнешниеДанные.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка)
		|			КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Оплата.ВидЗадолженности.ИмяПредопределенныхДанных КАК Ключ,
		|	Оплата.СчетДоверительногоУправления.Наименование КАК НаименованиеСчета,
		|	ВЫБОР
		|		КОГДА Оплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
		|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.НачислениеДивидендов).ЦеннаяБумага.Наименование
		|		КОГДА Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Облигация.Наименование
		|		КОГДА Оплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага.Наименование
		|	КОНЕЦ КАК ЦеннаяБумагаНаименование,
		|	ВЫБОР
		|		КОГДА Оплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
		|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.НачислениеДивидендов).Количество
		|		КОГДА Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|		КОГДА Оплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|	КОНЕЦ КАК Количество,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.Оплата КАК Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|		ПО Оплата.Ссылка = ОплатаОснования.Ссылка
		|ГДЕ
		|	Оплата.Организация = &Организация
		|	И НЕ Оплата.ПометкаУдаления
		|	И Оплата.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Оплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона))
		|	И Оплата.Брокер = &Брокер
		|	И НЕ Оплата.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Задолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВнешниеДанные";
#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	
	// обычно оплата от брокера по погашенным ценным бумагам приходит на следующий рабочий день,
	// однако 15.12.2021 она пришла в день погашения; остатков задолженности на начало дня не было,
	// т.к. документы Погашение ц/б заводятся в 09:30, поэтому пришлось сместить период анализа задолженности
	Запрос.УстановитьПараметр("ПериодВозникновенияЗадолженности", Новый Граница(НачалоДня(ЭтотОбъект.ДатаИмпорта) + 09 * 3600 + 30 * 60, ВидГраницы.Включая));

	ТекущиеОперации = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_ОплатыПоПогашениямВнешниеДанные"].ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		ОшибкиЧтения                     = Новый Массив;
		НоваяСтрокаОперации              = Операции.Добавить();					
		ВидЗадолженностиОперации         = Выборка.ВидЗадолженности;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.ВидДвижения                  = Выборка.ВидДвижения;
		РеквизитыШапки.ВидЗадолженности             = ВидЗадолженностиОперации;
		РеквизитыШапки.Аванс                        = Ложь;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.МестоХранения                = Выборка.МестоХраненияДенежныхСредств;
		РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.ВалютаОплаты                 = Выборка.ВалютаОплаты;
		РеквизитыШапки.Брокер                       = Брокер;
		РеквизитыШапки.СтрокаБанковскойВыписки      = Документы.СтрокаБанковскойВыписки.ПустаяСсылка();
		РеквизитыШапки.Контрагент               	= Выборка.Контрагент;		
		РеквизитыШапки.РасчетныйСчетКонтрагента 	= Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.Договор                  	= Справочники.Договоры.ПустаяСсылка();
				
		РеквизитыОснования = Новый Структура(ПоляДокумента.Основания);
		РеквизитыОснования.НомерСтроки              = 1;						
		РеквизитыОснования.Валюта                   = Выборка.ВалютаЗадолженности;
		РеквизитыОснования.Сумма                    = Выборка.СуммаОстаток;
		РеквизитыОснования.СуммаКупона              = Выборка.СуммаКупонаОстаток;
		РеквизитыОснования.СобственныйКурсОплаты    = Ложь;
		РеквизитыОснования.КурсОплаты               = Неопределено;
		РеквизитыОснования.СуммаОплаты              = Выборка.Сумма;
		РеквизитыОснования.СуммаОплатыКупона        = Выборка.СуммаКупона;
		
		Если ЗначениеЗаполнено(Выборка.Основание) Тогда
			РеквизитыОснования.Основание = Выборка.Основание;
			
			Если Выборка.Volume <> Выборка.Количество Тогда
				ОшибкиЧтения.Добавить("В документе основания [" + Выборка.Основание + "] количество [" + Выборка.Количество + "] ценных бумаг не соответствует количеству [" + Выборка.Volume + "] бумаг в данных импорта");	
			КонецЕсли;

		Иначе
			Если Выборка.ЕстьПогашениеВДень
				И (Выборка.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюКупона
					Или Выборка.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
				И ЗначениеЗаполнено(Выборка.ОснованиеАльт) Тогда
				
				// Переключим вид задолженности и основание на альтернативные данные из основного запроса
				ВидЗадолженностиОперации = ?(Выборка.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюКупона,
					Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона,
					Справочники.ВидыЗадолженности.ПоПогашениюКупона);
				
				РеквизитыШапки.ВидЗадолженности = ВидЗадолженностиОперации;
				РеквизитыШапки.Контрагент       = Выборка.КонтрагентАльт;
				
				РеквизитыОснования.Валюта      = Выборка.ВалютаЗадолженностиАльт;
				РеквизитыОснования.Сумма       = Выборка.СуммаОстатокАльт;
				РеквизитыОснования.СуммаКупона = Выборка.СуммаКупонаОстатокАльт;
				РеквизитыОснования.Основание   = Выборка.ОснованиеАльт;
				
			Иначе
				Если Выборка.КоличествоОснований = 0 Тогда
					ОшибкиЧтения.Добавить("Не удалось определить документ основание по виду задолженности [" + Выборка.ВидЗадолженности + "] и счету внутреннего учета [" + Выборка.СчетДоверительногоУправления + "] в регистре [Задолженности по денежным средствам].");
				Иначе
					ОшибкиЧтения.Добавить("Не удалось определить документ основание. В регистре [Задолженности по денежным средствам] по виду задолженности [" + Выборка.ВидЗадолженности + "] и счету внутреннего учета [" + Выборка.СчетДоверительногоУправления + "] найдено более одного документа основания. Количество оснований: " + Выборка.КоличествоОснований + "");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Дата считается здесь — после того, как определено финальное основание (первичное или альтернативное)
		РеквизитыШапки.Дата = ?(ЗначениеЗаполнено(РеквизитыОснования.Основание) И НачалоДня(РеквизитыОснования.Основание.Дата) = ЭтотОбъект.ДатаИмпорта, РеквизитыОснования.Основание.Дата + 1, ЭтотОбъект.ДатаИмпорта + (9 * 60 + 30) * 60); //"9:30:00"
		
		НоваяСтрокаОперации.Ключ         = ВидЗадолженностиОперации.ИмяПредопределенныхДанных + "/" + Выборка.СчетДоверительногоУправления.Наименование + "/" + Выборка.ЦеннаяБумага.Наименование + "/" + Выборка.Volume;
		НоваяСтрокаОперации.Описание     = "Оплата / " + ВидЗадолженностиОперации + " / " + Выборка.Record_UID + " / " + Выборка.ЦеннаяБумага;
				
		Основания = Новый Массив;								
		Основания.Добавить(РеквизитыОснования);
									
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, Основания", РеквизитыШапки, Основания);
		
	КонецЦикла;
			
	Для каждого СтрокаТекущиеОперации Из ТекущиеОперации Цикл
		СтрокаТекущиеОперации.Ключ = СтрокаТекущиеОперации.Ключ + "/" + СтрокаТекущиеОперации.НаименованиеСчета + "/" + СтрокаТекущиеОперации.ЦеннаяБумагаНаименование + "/" + СтрокаТекущиеОперации.Количество;
	КонецЦикла;
	
	ИсключитьИзСверки = "Дата";
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьВариационнуюМаржу_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Маржа, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_Money_Operations.Record_UID) КАК Record_UID,
		|	СУММА(ВЫБОР
		|			КОГДА _Money_Operations.Direction = ""-1""
		|				ТОГДА -_Money_Operations.Payment_Amount
		|			КОГДА _Money_Operations.Direction = ""1""
		|				ТОГДА _Money_Operations.Payment_Amount
		|		КОНЕЦ) КАК Сумма,
		|	_Money_Operations.Security_ID КАК Security_ID,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Code КАК КодБумаги,
		|	_Валюты.Валюта КАК ВалютаОплаты,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК КодУБрокера,
		|	_КодыСчетовВнутреннегоУчета.КодДляСверкиОпераций КАК КодДляСверкиОпераций
		|ИЗ
		|	_Money_Operations КАК _Money_Operations
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Operations.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _Money_Operations.Security_ID = _ЦенныеБумаги.Matrix_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_Operations.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Money_Operations.Payment_Currency_Code = _Валюты.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Money_Operations.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|ГДЕ
		|	_Money_Operations.Date = &Дата
		|	И _Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.VariationMarginRevaluation"", ""Operations.Group.Settlements.VariationMargin"")
		|	И НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	_Money_Operations.Security_ID,
		|	_МестаХраненияДенежныхСредств.Ссылка,
		|	_ЦенныеБумаги.Ссылка,
		|	_ЦенныеБумаги.Code,
		|	_Валюты.Валюта,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number,
		|	_КодыСчетовВнутреннегоУчета.КодДляСверкиОпераций
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодБумаги
		|ИТОГИ ПО
		|	СчетДоверительногоУправления";
#КонецОбласти

	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ДатаИмпорта);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
		
	ГруппировкаПоСчету = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
	Пока ГруппировкаПоСчету.Следующий() Цикл
				
		ВыборкаЗаписей = ГруппировкаПоСчету.Выбрать();
				
	    НомерСтроки = 0;
								
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			Если НомерСтроки = 0 Тогда
				
				ОшибкиЧтения = Новый Массив;
			
				НоваяСтрокаОперации = Операции.Добавить();
				НоваяСтрокаОперации.Ключ         = ВыборкаЗаписей.КодДляСверкиОпераций;
				НоваяСтрокаОперации.Описание     = "Вариационная маржа, " + ВыборкаЗаписей.Record_UID + ", " + ВыборкаЗаписей.Сумма;
				НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
				НоваяСтрокаОперации.Статус       = "Новый";
				НоваяСтрокаОперации.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
						
				РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
				РеквизитыШапки.Проведен                     = Истина;
				РеквизитыШапки.ПометкаУдаления              = Ложь;
				РеквизитыШапки.Дата                         = ЭтотОбъект.ДатаИмпорта + (19 * 60 * 60);
				РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
				РеквизитыШапки.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
				РеквизитыШапки.Брокер                       = Брокер;
				РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
				РеквизитыШапки.МестоХранения                = ВыборкаЗаписей.МестоХраненияДенежныхСредств;
				РеквизитыШапки.ОтложеннаяОплата 			= Ложь;
				РеквизитыШапки.ВалютаОплаты                 = ВыборкаЗаписей.ВалютаОплаты;
				РеквизитыШапки.Сумма                        = 0;
				
				Инструменты = Новый Массив;
				НоваяСтрокаОперации.НовыеРеквизиты          = Новый Структура("Шапка, Инструменты", РеквизитыШапки, Инструменты);
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
			РеквизитыИнструменты = Новый Структура(ПоляДокумента.Инструменты);
			РеквизитыИнструменты.НомерСтроки = НомерСтроки;
			РеквизитыИнструменты.Сумма       = ВыборкаЗаписей.Сумма;
			
			Если ЗначениеЗаполнено(ВыборкаЗаписей.ЦеннаяБумага) Тогда
				РеквизитыИнструменты.Инструмент = ВыборкаЗаписей.ЦеннаяБумага;
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить ценную бумагу по коду во внешней системе [" + ВыборкаЗаписей.Security_ID + "]!");
			КонецЕсли;
			
			РеквизитыШапки.Сумма = РеквизитыШапки.Сумма + РеквизитыИнструменты.Сумма;
			
			Инструменты.Добавить(РеквизитыИнструменты);		
			
			Если ОшибкиЧтения.Количество() > 0 Тогда
				НоваяСтрокаОперации.Статус = "Ошибка чтения";
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;

#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыСчетовУБрокера.КодДляСверкиОпераций КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.Маржа КАК Маржа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовУБрокера КАК _КодыСчетовУБрокера
		|		ПО Маржа.СчетДоверительногоУправления = _КодыСчетовУБрокера.СчетДоверительногоУправления
		|ГДЕ
		|	Маржа.Организация = &Организация
		|	И НЕ Маржа.ПометкаУдаления
		|	И Маржа.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|	И Маржа.Брокер = &Брокер
		|	И НЕ Маржа.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|	И НЕ Маржа.РынокСПФИ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
#КонецОбласти
								
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, Запрос.Выполнить().Выгрузить(), ПоляДокумента);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьМаржуСПФИ_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Маржа, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_Money_OperationsDepositMargin.Record_UID) КАК Record_UID,
		|	СУММА(ВЫБОР
		|			КОГДА _Money_OperationsDepositMargin.Direction = ""-1""
		|				ТОГДА -_Money_OperationsDepositMargin.Payment_Amount
		|			КОГДА _Money_OperationsDepositMargin.Direction = ""1""
		|				ТОГДА _Money_OperationsDepositMargin.Payment_Amount
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА _Money_Operations.Direction = ""-1""
		|				ТОГДА -_Money_Operations.Payment_Amount
		|			КОГДА _Money_Operations.Direction = ""1""
		|				ТОГДА _Money_Operations.Payment_Amount
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Процент,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК КодУБрокера,
		|	_КодыСчетовВнутреннегоУчета.КодДляСверкиОпераций КАК КодДляСверкиОпераций,
		|	_Валюты.Валюта КАК ВалютаОплаты,
		|	ЕСТЬNULL(_МестаХраненияДенежныхСредств.Ссылка, """") КАК МестоХраненияДенежныхСредств,
		|	ЕСТЬNULL(_Money_OperationsDepositMargin.Security_ID, """") КАК Security_ID,
		|	МАКСИМУМ(СделкаСПФИ.Ссылка) КАК СсылкаСПФИ,
		|	_Money_OperationsDepositMargin.Market_Number КАК Market_Number
		|ИЗ
		|	_Money_Operations КАК _Money_OperationsDepositMargin
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_OperationsDepositMargin.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Money_Operations КАК _Money_Operations
		|		ПО _Money_OperationsDepositMargin.Date = _Money_Operations.Date
		|			И _Money_OperationsDepositMargin.Client_ID = _Money_Operations.Client_ID
		|			И _Money_OperationsDepositMargin.Inner_Account_Division_ID = _Money_Operations.Inner_Account_Division_ID
		|			И _Money_OperationsDepositMargin.Market_Number = _Money_Operations.Market_Number
		|			И (_Money_Operations.Origin_Operation_Type В (""Operations.Group.Payments.VariationMarginRevaluation"", ""Operations.Group.Settlements.VariationMargin"", ""Operations.Group.Payments.Percents""))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_OperationsDepositMargin.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Money_OperationsDepositMargin.Payment_Currency_Code = _Валюты.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Money_OperationsDepositMargin.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСПФИ КАК СделкаСПФИ
		|		ПО _Money_OperationsDepositMargin.Market_Number = СделкаСПФИ.НомерСделки
		|			И (НЕ СделкаСПФИ.ПометкаУдаления)
		|ГДЕ
		|	_Money_OperationsDepositMargin.Date = &Дата
		|	И _Money_OperationsDepositMargin.Origin_Operation_Type В (""Operations.Group.Payments.DepositMargin"")
		|	И _Money_OperationsDepositMargin.Money_Storage_Place = ""MICEX""
		|	И НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	_Money_Operations.Security_ID,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number,
		|	_Валюты.Валюта,
		|	_МестаХраненияДенежныхСредств.Ссылка,
		|	_КодыСчетовВнутреннегоУчета.КодДляСверкиОпераций,
		|	_Money_OperationsDepositMargin.Security_ID,
		|	_Money_OperationsDepositMargin.Market_Number
		|ИТОГИ ПО
		|	СчетДоверительногоУправления";
	
#КонецОбласти

	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ДатаИмпорта);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
		
	ГруппировкаПоСчету = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
	Пока ГруппировкаПоСчету.Следующий() Цикл
				
		ВыборкаЗаписей = ГруппировкаПоСчету.Выбрать();
				
	    НомерСтроки = 0;
								
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			Если НомерСтроки = 0 Тогда
				
				ОшибкиЧтения = Новый Массив;
			
				НоваяСтрокаОперации = Операции.Добавить();
				НоваяСтрокаОперации.Ключ         = ВыборкаЗаписей.КодДляСверкиОпераций;
				НоваяСтрокаОперации.Описание     = "Вариационная маржа, " + ВыборкаЗаписей.Record_UID + ", " + ВыборкаЗаписей.Сумма;
				НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
				НоваяСтрокаОперации.Статус       = "Новый";
				НоваяСтрокаОперации.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
						
				РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
				РеквизитыШапки.Проведен                     = Истина;
				РеквизитыШапки.ПометкаУдаления              = Ложь;
				РеквизитыШапки.Дата                         = ЭтотОбъект.ДатаИмпорта + (19 * 60 * 60);
				РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
				РеквизитыШапки.СчетДоверительногоУправления = ВыборкаЗаписей.СчетДоверительногоУправления;
				РеквизитыШапки.Брокер                       = Брокер;
				РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
				РеквизитыШапки.МестоХранения                = ВыборкаЗаписей.МестоХраненияДенежныхСредств;
				РеквизитыШапки.ОтложеннаяОплата 			= Ложь;
				РеквизитыШапки.ВалютаОплаты                 = ВыборкаЗаписей.ВалютаОплаты;
				РеквизитыШапки.Сумма                        = 0;
				РеквизитыШапки.РынокСПФИ                    = Истина;
				
				Инструменты = Новый Массив;
				НоваяСтрокаОперации.НовыеРеквизиты          = Новый Структура("Шапка, Инструменты", РеквизитыШапки, Инструменты);
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
			РеквизитыИнструменты = Новый Структура(ПоляДокумента.Инструменты);
			РеквизитыИнструменты.НомерСтроки = НомерСтроки;
			РеквизитыИнструменты.Сумма       = ВыборкаЗаписей.Сумма;
			РеквизитыИнструменты.Процент     = ВыборкаЗаписей.Процент;
			
			Если ЗначениеЗаполнено(ВыборкаЗаписей.СсылкаСПФИ) Тогда
				РеквизитыИнструменты.Инструмент = ВыборкаЗаписей.СсылкаСПФИ;
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить сделку СПФИ [" + ВыборкаЗаписей.Market_Number + "]!");
			КонецЕсли;
			
			РеквизитыШапки.Сумма = РеквизитыШапки.Сумма + РеквизитыИнструменты.Сумма;
			
			Инструменты.Добавить(РеквизитыИнструменты);		
			
			Если ОшибкиЧтения.Количество() > 0 Тогда
				НоваяСтрокаОперации.Статус = "Ошибка чтения";
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;

#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыСчетовУБрокера.КодДляСверкиОпераций КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.Маржа КАК Маржа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовУБрокера КАК _КодыСчетовУБрокера
		|		ПО Маржа.СчетДоверительногоУправления = _КодыСчетовУБрокера.СчетДоверительногоУправления
		|ГДЕ
		|	Маржа.Организация = &Организация
		|	И НЕ Маржа.ПометкаУдаления
		|	И Маржа.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|	И Маржа.Брокер = &Брокер
		|	И НЕ Маржа.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|	И Маржа.РынокСПФИ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
#КонецОбласти
								
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, Запрос.Выполнить().Выгрузить(), ПоляДокумента);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьВнебиржевыеСделки_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.Сделка, Операции, ПоляДокумента);
	
	ГруппаИмпортируемыхОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("OTC");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;

#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Deals_With_Details.Record_UID КАК Record_UID,
		|	_Deals_With_Details.Date КАК ДатаСделки,
		|	_Deals_With_Details.Time КАК ВремяСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаздельноеИсполнение,
		|	_Deals_With_Details.Payment_Date КАК ДатаОплаты,
		|	_Deals_With_Details.Delivery_Date КАК ДатаПоставки,
		|	_Deals_With_Details.Payment_Rate КАК Курс,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Rate > 0
		|				И _Deals_With_Details.Is_Payment_Rate_Fixed = ""1""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СобственныйКурсОплаты,
		|	_Deals_With_Details.PSA_Settlement_Type КАК PSA_Settlement_Type,
		|	_Deals_With_Details.Security_ID КАК Security_ID,
		|	_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Deals_With_Details.Рынок КАК Рынок,
		|	_Deals_With_Details.ВалютаСделки КАК ВалютаСделки,
	    |	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Deals_With_Details.Partner_ID КАК Partner_ID,
		|	ЕСТЬNULL(_Deals_With_Details.КонтрагентСсылка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Контрагент,
		|	_Deals_With_Details.SettleCode КАК SettleCode,
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок) КАК МестоХраненияДенежныхСредств,
		|	_Deals_With_Details.Depo_Storage_Place КАК Depo_Storage_Place,
		|	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
		|	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
		|	_Deals_With_Details.Price КАК Цена,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА _Deals_With_Details.Price_Percent
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПроцент,
		|	_Deals_With_Details.Volume КАК Количество,
		|	_Deals_With_Details.Amount КАК Сумма,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупона,
		|	_Deals_With_Details.Order_Number КАК НомерПоручения,
		|	_Deals_With_Details.Order_Date КАК ДатаПоручения
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Deals_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Deals_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|ГДЕ
		|	_Deals_With_Details.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.IPO"")
		|	И НЕ _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Валюты
		|	И _Deals_With_Details.Is_Deal_Info = ""0""
		|	И _Deals_With_Details.Market = ""OTC""
		|	И _Deals_With_Details.Date = &НачалоПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Record_UID
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	Record_UID";
		
#КонецОбласти

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	ГруппировкаПоСчету = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
	Пока ГруппировкаПоСчету.Следующий() Цикл
				
		ГруппировкаПоСделке = ГруппировкаПоСчету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоСделке.Следующий() Цикл

	    	ДетальныеЗаписи = ГруппировкаПоСделке.Выбрать();
			
			НомерСтроки = 0;
			
			Пока ДетальныеЗаписи.Следующий() Цикл
				
				Если НомерСтроки = 0 Тогда
					
					ОшибкиЧтения = Новый Массив;
		
					НоваяСтрокаОперации = Операции.Добавить();
					НоваяСтрокаОперации.Ключ         = ДетальныеЗаписи.Record_UID;
					НоваяСтрокаОперации.Описание     = "Внебирж. сделка, " + ДетальныеЗаписи.Record_UID + " [" + Строка(ДетальныеЗаписи.ВидСделки) + "] " + ДетальныеЗаписи.ЦеннаяБумага;
					НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
					НоваяСтрокаОперации.Статус       = "Новый";
					НоваяСтрокаОперации.СчетДоверительногоУправления = ДетальныеЗаписи.СчетДоверительногоУправления;
					
					НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
					Справочники.ВнешниеСистемы.Матрих, ГруппаИмпортируемыхОбъектов, ДетальныеЗаписи.Record_UID);	
					
					РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
					РеквизитыШапки.Проведен                     = Истина;
					РеквизитыШапки.ПометкаУдаления              = Ложь;
					РеквизитыШапки.Дата                         = ДетальныеЗаписи.ДатаСделки + (ДетальныеЗаписи.ВремяСделки - Дата(1, 1, 1));
					РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
					РеквизитыШапки.ВидСделки                    = ДетальныеЗаписи.ВидСделки;
					РеквизитыШапки.Рынок                        = ДетальныеЗаписи.Рынок;
					РеквизитыШапки.Брокер                       = Брокер;
					РеквизитыШапки.МестоХранения                = ДетальныеЗаписи.МестоХраненияДенежныхСредств;
					РеквизитыШапки.СчетДоверительногоУправления = ДетальныеЗаписи.СчетДоверительногоУправления;
					РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
					РеквизитыШапки.ВалютаСделки                 = ДетальныеЗаписи.ВалютаСделки;
					РеквизитыШапки.НомерСделки                  = "";
					РеквизитыШапки.ВремяСделки                  = Дата(1, 1, 1);
					РеквизитыШапки.КодРасчетовНаБирже           = "";
					РеквизитыШапки.НеполныеЛоты                 = Ложь;
					РеквизитыШапки.РежимПереговорныхСделок      = Ложь;
					РеквизитыШапки.ВыкупЭмитентом               = Ложь;
					РеквизитыШапки.ПервичноеРазмещение          = Ложь;
					РеквизитыШапки.РасчетныйСчетКонтрагента     = Справочники.БанковскиеСчета.ПустаяСсылка();
					РеквизитыШапки.НомерДоговораКонтрагента     = "";
					РеквизитыШапки.Договор                 		= Справочники.Договоры.ПустаяСсылка();
					РеквизитыШапки.ОтложенноеИсполнение         = Истина;
					РеквизитыШапки.ДатаИсполнения               = Дата(1,1,1);
					РеквизитыШапки.РаздельноеИсполнение         = Истина;
					РеквизитыШапки.ДатаОплаты                   = ДетальныеЗаписи.ДатаОплаты;
					РеквизитыШапки.ДатаПоставки                 = ДетальныеЗаписи.ДатаПоставки;
					РеквизитыШапки.ВалютаОплаты                 = ДетальныеЗаписи.ВалютаОплаты;
					РеквизитыШапки.СобственныйКурсОплаты        = ДетальныеЗаписи.СобственныйКурсОплаты;
					РеквизитыШапки.КурсОплаты                   = ?(ДетальныеЗаписи.ВалютаСделки <> ДетальныеЗаписи.ВалютаОплаты, ?(ДетальныеЗаписи.Курс > 0, ДетальныеЗаписи.Курс, ДетальныеЗаписи.ДатаОплаты), Неопределено);
					РеквизитыШапки.ВалютаТорговойКомиссии       = Справочники.Валюты.ПустаяСсылка();
					РеквизитыШапки.ПлатежноеУсловиеСделки       = СокрЛП(ДетальныеЗаписи.PSA_Settlement_Type);
					РеквизитыШапки.РежимБиржевыхТоргов			= Справочники.РежимыБиржевыхТоргов.ПустаяСсылка();
					РеквизитыШапки.ПриобретениеПаев				= Ложь;
					РеквизитыШапки.ДепозитарныйСчетКонтрагента	= Справочники.ДепозитарныеСчета.ПустаяСсылка();
					РеквизитыШапки.НомерПорученияУБрокера       = ДетальныеЗаписи.НомерПоручения;
					РеквизитыШапки.ДатаПорученияУБрокера        = ДетальныеЗаписи.ДатаПоручения;
					РеквизитыШапки.КонтрагентНаБирже            = "";
					
					Если ЗначениеЗаполнено(ДетальныеЗаписи.Partner_ID) И Не ЗначениеЗаполнено(ДетальныеЗаписи.Контрагент) Тогда
						ОшибкиЧтения.Добавить("Не удалось определить контрагента по матрих ID [" + ДетальныеЗаписи.Partner_ID + "]! Проверьте наличие кода в регистре [Коды во внешних системах].");	
					Иначе
						РеквизитыШапки.Контрагент = ДетальныеЗаписи.Контрагент;
					КонецЕсли;
					
					РеквизитыШапки.ОтложеннаяОплатаТорговойКомиссии = Ложь;
					РеквизитыШапки.ДатаОплатыТорговойКомиссии       = Дата(1, 1, 1);
					
					ЦенныеБумаги  = Новый Массив;
					
					НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги", РеквизитыШапки, ЦенныеБумаги);

				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
				РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
				РеквизитыЦенныеБумаги.НомерСтроки = НомерСтроки;
				
				Если ЗначениеЗаполнено(ДетальныеЗаписи.ЦеннаяБумага) Тогда
					РеквизитыЦенныеБумаги.ЦеннаяБумага = ДетальныеЗаписи.ЦеннаяБумага;
				Иначе
					ОшибкиЧтения.Добавить("В сделке [" + ДетальныеЗаписи.НомерСделки + "] не удалось определить ценную бумагу по коду во внешней системе. [" + ДетальныеЗаписи.Security_ID + "]!");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДетальныеЗаписи.ДепозитарныйСчет) Тогда
					РеквизитыЦенныеБумаги.ДепозитарныйСчет = ДетальныеЗаписи.ДепозитарныйСчет;
				Иначе
					Если ДетальныеЗаписи.КоличествоДепозитарныхСчетов = 0 Тогда
						ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(ДетальныеЗаписи.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + ДетальныеЗаписи.Depo_Storage_Place + "]!"));
					Иначе
						ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + ДетальныеЗаписи.КоличествоДепозитарныхСчетов + "]" + ?(ДетальныеЗаписи.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + ДетальныеЗаписи.Depo_Storage_Place + "]!"));
					КонецЕсли;
				КонецЕсли;

				РеквизитыЦенныеБумаги.Количество       = ?(ДетальныеЗаписи.Количество = 0, 1, ДетальныеЗаписи.Количество);
				РеквизитыЦенныеБумаги.Сумма            = ДетальныеЗаписи.Сумма;
				РеквизитыЦенныеБумаги.СуммаКупона      = ДетальныеЗаписи.СуммаКупона;
				РеквизитыЦенныеБумаги.Цена             = ДетальныеЗаписи.Цена;
				РеквизитыЦенныеБумаги.ЦенаПроцент      = ?(ЗначениеЗаполнено(ДетальныеЗаписи.ЦенаПроцент), ДетальныеЗаписи.ЦенаПроцент, 0);
				РеквизитыЦенныеБумаги.ЦенаКупона       = ?(ДетальныеЗаписи.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации, Окр(ДетальныеЗаписи.СуммаКупона / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги), 0);
				РеквизитыЦенныеБумаги.ТорговаяКомиссия = 0;
				
				ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
				
				Если ОшибкиЧтения.Количество() > 0 Тогда
					НоваяСтрокаОперации.Статус = "Ошибка чтения";
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнебиржевыеОперации.НомерОперации КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО Сделка.Ссылка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	Сделка.Организация = &Организация
		|	И НЕ Сделка.ПометкаУдаления
		|	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Сделка.Брокер = &Брокер
		|	И (Сделка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ИЛИ Сделка.РежимБиржевыхТоргов.РежимВнебиржевыхСделок)
		|	И НЕ Сделка.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
#КонецОбласти

	ИсключитьИзСверки = "ЦенныеБумаги.ДепозитарныйСчет";
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, Запрос.Выполнить().Выгрузить(), ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьСделкиСПФИ_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.СделкаСПФИ, Операции, ПоляДокумента);
	
	ГруппаИмпортируемыхОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("OTC");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;

#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Deals_With_Details.Record_UID КАК Record_UID,
		|	_Deals_With_Details.Date КАК ДатаСделки,
	    |	_Deals_With_Details.Time КАК ВремяСделки,
	    |	_Deals_With_Details.Market_Number КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаздельноеИсполнение,
		|	_Deals_With_Details.Payment_Date КАК ДатаОплаты,
		|	_Deals_With_Details.Delivery_Date КАК ДатаПоставки,
		|	_Deals_With_Details.Payment_Rate КАК Курс,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Rate > 0
		|				И _Deals_With_Details.Is_Payment_Rate_Fixed = ""1""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СобственныйКурсОплаты,
		|	_Deals_With_Details.PSA_Settlement_Type КАК PSA_Settlement_Type,
		|	_Deals_With_Details.Security_ID КАК Security_ID,
		|	_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Deals_With_Details.Рынок КАК Рынок,
		|	_Deals_With_Details.ВалютаСделки КАК ВалютаСделки,
	    |	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Deals_With_Details.Partner_ID КАК Partner_ID,
		|	ЕСТЬNULL(_Deals_With_Details.КонтрагентСсылка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Контрагент,
		|	_Deals_With_Details.SettleCode КАК SettleCode,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Deals_With_Details.Depo_Storage_Place КАК Depo_Storage_Place,
		|	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
		|	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
		|	_Deals_With_Details.SE_Charge_Amount КАК КлиринговыйСбор,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.SE_Charge_Date <> _Deals_With_Details.Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложеннаяОплатаКлиринговогоСбора,
		|	_Deals_With_Details.Amount КАК Номинал,
		|	_Deals_With_Details.Order_Number КАК НомерПоручения,
		|	_Deals_With_Details.Order_Date КАК ДатаПоручения,
		|	ЕСТЬNULL(_Derivatives.Date_Execution, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИсполнения
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Deals_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Deals_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Deals_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Derivatives КАК _Derivatives
		|		ПО _Deals_With_Details.Security_ID = _Derivatives.ID
		|ГДЕ
		|	_Deals_With_Details.Operation_Type В (""Operations.Group.Deals.Trade"")
		|	И _Deals_With_Details.Is_Deal_Info = ""0""
		|	И _Deals_With_Details.Market_Board = ""NSDSPFINEG""
		|	И _Deals_With_Details.Date = &НачалоПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Record_UID
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	Record_UID";
		
#КонецОбласти

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	ГруппировкаПоСчету = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
	Пока ГруппировкаПоСчету.Следующий() Цикл
				
		ГруппировкаПоСделке = ГруппировкаПоСчету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоСделке.Следующий() Цикл

	    	ДетальныеЗаписи = ГруппировкаПоСделке.Выбрать();
			
			НомерСтроки = 0;
			
			Пока ДетальныеЗаписи.Следующий() Цикл
				
				Если НомерСтроки = 0 Тогда
					
					ОшибкиЧтения = Новый Массив;
		
					НоваяСтрокаОперации = Операции.Добавить();
					НоваяСтрокаОперации.Ключ         = ДетальныеЗаписи.НомерСделки;
					НоваяСтрокаОперации.Описание     = "Сделка СПФИ, " + ДетальныеЗаписи.НомерСделки + " [" + Строка(ДетальныеЗаписи.ВидСделки) + "]";
					НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
					НоваяСтрокаОперации.Статус       = "Новый";
					НоваяСтрокаОперации.СчетДоверительногоУправления = ДетальныеЗаписи.СчетДоверительногоУправления;
					
					НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
					Справочники.ВнешниеСистемы.Матрих, ГруппаИмпортируемыхОбъектов, ДетальныеЗаписи.Record_UID);	
					
					РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
					РеквизитыШапки.Проведен                     = Истина;
					РеквизитыШапки.ПометкаУдаления              = Ложь;
					РеквизитыШапки.Дата                         = ДетальныеЗаписи.ДатаСделки + (ДетальныеЗаписи.ВремяСделки - Дата(1, 1, 1));
					РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
					//РеквизитыШапки.ВидСделки                    = ДетальныеЗаписи.ВидСделки;
					РеквизитыШапки.Брокер                       = Брокер;
					РеквизитыШапки.МестоХранения                = ДетальныеЗаписи.МестоХраненияДенежныхСредств;
					РеквизитыШапки.СчетДоверительногоУправления = ДетальныеЗаписи.СчетДоверительногоУправления;
					РеквизитыШапки.Валюта             		    = ДетальныеЗаписи.ВалютаСделки;
					РеквизитыШапки.НомерСделки                  = ДетальныеЗаписи.НомерСделки;
					//РеквизитыШапки.ВремяСделки                  = ДетальныеЗаписи.ВремяСделки;
					РеквизитыШапки.Номинал					    = ДетальныеЗаписи.Номинал;
					РеквизитыШапки.Контрагент					= ДетальныеЗаписи.Контрагент;
					РеквизитыШапки.КлиринговыйСбор       		= ДетальныеЗаписи.КлиринговыйСбор;
					РеквизитыШапки.ОтложеннаяОплатаКлиринговогоСбора	= ДетальныеЗаписи.ОтложеннаяОплатаКлиринговогоСбора;
					РеквизитыШапки.ДатаИсполнения				= ДетальныеЗаписи.ДатаИсполнения;

					
					Если ЗначениеЗаполнено(ДетальныеЗаписи.Partner_ID) И Не ЗначениеЗаполнено(ДетальныеЗаписи.Контрагент) Тогда
						ОшибкиЧтения.Добавить("Не удалось определить контрагента по матрих ID [" + ДетальныеЗаписи.Partner_ID + "]! Проверьте наличие кода в регистре [Коды во внешних системах].");	
					Иначе
						РеквизитыШапки.Контрагент = ДетальныеЗаписи.Контрагент;
					КонецЕсли;
					
					НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка", РеквизитыШапки);

				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
				
				Если ОшибкиЧтения.Количество() > 0 Тогда
					НоваяСтрокаОперации.Статус = "Ошибка чтения";
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СделкаСПФИ.НомерСделки КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.СделкаСПФИ КАК СделкаСПФИ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО СделкаСПФИ.Ссылка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	СделкаСПФИ.Организация = &Организация
		|	И НЕ СделкаСПФИ.ПометкаУдаления
		|	И СделкаСПФИ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СделкаСПФИ.Брокер = &Брокер
		|	И НЕ СделкаСПФИ.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
#КонецОбласти

	ИсключитьИзСверки = "";
	//ИсключитьИзСверки = "ЦенныеБумаги.ДепозитарныйСчет";
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, Запрос.Выполнить().Выгрузить(), ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьВнебиржевыеСделкиРЕПО_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.СделкаРЕПО, Операции, ПоляДокумента);
	
	ГруппаИмпортируемыхОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("OTC_REPO");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Deals_With_Details.Record_UID КАК Record_UID,
		|	_Deals_With_Details.Date КАК ДатаСделки,
		|	_Deals_With_Details.Time КАК ВремяСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Date <> _Deals_With_Details.Payment_Date
		|				ИЛИ _Deals_With_Details.Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложенноеИсполнение,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаздельноеИсполнение,
		|	_Deals_With_Details.Payment_Date КАК ДатаОплаты,
		|	_Deals_With_Details.Delivery_Date КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Rate > 0
		|				И _Deals_With_Details.Is_Payment_Rate_Fixed = ""1""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СобственныйКурсОплаты,
		|	_Deals_With_Details.Payment_Rate КАК Курс,
		|	_Deals_With_Details.Far_Execution_Date КАК ДатаВторойЧастиРЕПО,
		|	_Deals_With_Details.Far_Interest_Rate КАК СтавкаРЕПО,
		|	_Deals_With_Details.PSA_Settlement_Type КАК PSA_Settlement_Type,
		|	_Deals_With_Details.Security_ID КАК Security_ID,
		|	_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_НоминалыЦенныхБумаг.Номинал КАК Номинал,
		|	_КурсыВалют.КурсВалютыОплаты / (_КурсыВалют.КратностьКурсаВалютыОплаты * _НоминалыЦенныхБумаг.КратностьКурсаВалютыНоминала * _НоминалыЦенныхБумаг.КурсВалютыНоминала) КАК КоэффициентКонвертации,
		|	_Deals_With_Details.Рынок КАК Рынок,
		|	_Deals_With_Details.ВалютаСделки КАК ВалютаСделки,
		|	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Deals_With_Details.Partner_ID КАК Partner_ID,
		|	ЕСТЬNULL(_Deals_With_Details.КонтрагентСсылка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Контрагент,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Deals_With_Details.Depo_Storage_Place КАК Depo_Storage_Place,
		|	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
		|	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
		|	_Deals_With_Details.Price КАК Цена,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.Price_Percent
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПроцент,
		|	_Deals_With_Details.Volume КАК Количество,
		|	_Deals_With_Details.Amount КАК Сумма,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупона,
		|	_Deals_With_Details.Far_Price КАК ЦенаВторойЧасти,
		|	_Deals_With_Details.Far_Amount КАК СуммаВторойЧасти,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.Far_ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупонаВторойЧасти,
		|	_Deals_With_Details.Order_Number КАК НомерПоручения,
		|	_Deals_With_Details.Order_Date КАК ДатаПоручения
		|ПОМЕСТИТЬ _ВнебиржевыеСделкиРЕПОВнешниеДанные
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
		|		ПО _Deals_With_Details.ВалютаОплаты = _КурсыВалют.ВалютаОплаты
		|			И _Deals_With_Details.ДатаСделки = _КурсыВалют.ДатаСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Deals_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Deals_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Deals_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НоминалыЦенныхБумаг КАК _НоминалыЦенныхБумаг
		|		ПО _Deals_With_Details.ЦеннаяБумага = _НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _Deals_With_Details.ДатаСделки = _НоминалыЦенныхБумаг.ДатаСделки
		|ГДЕ
		|	_Deals_With_Details.Operation_Type = ""Operations.Group.Deals.REPO""
		|	И _Deals_With_Details.Is_Deal_Info = ""0""
		|	И _Deals_With_Details.Market = ""OTC""
		|	И _Deals_With_Details.Date = &НачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнебиржевыеОперации.НомерОперации КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО СделкаРЕПО.Ссылка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	СделкаРЕПО.Организация = &Организация
		|	И НЕ СделкаРЕПО.ПометкаУдаления
		|	И СделкаРЕПО.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И СделкаРЕПО.Брокер = &Брокер
		|	И НЕ СделкаРЕПО.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";
#КонецОбласти		

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	
	ВнебиржевыеСделкиРЕПОДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_ВнебиржевыеСделкиРЕПОВнешниеДанные"].ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Выборка.Record_UID;
		НоваяСтрокаОперации.Описание     = "Внебирж. сделка РЕПО, " + Выборка.Record_UID + " [" + Строка(Выборка.ВидСделки) + "] " + Выборка.ЦеннаяБумага + ", " + Выборка.Количество;
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		
		НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
			Справочники.ВнешниеСистемы.Матрих, ГруппаИмпортируемыхОбъектов, Выборка.Record_UID);
			
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = Выборка.ДатаСделки + (Выборка.ВремяСделки - Дата(1, 1, 1));
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.ВидСделки                    = Выборка.ВидСделки;
		РеквизитыШапки.ДвеЧастиСделкиРЕПО           = Ложь;
		РеквизитыШапки.ЧастьСделкиРЕПО              = 0;
		РеквизитыШапки.ДатаВторойЧастиРЕПО          = Дата(1, 1, 1);
		РеквизитыШапки.ПерваяЧастьРЕПО              = Документы.СделкаРЕПО.ПустаяСсылка();
		РеквизитыШапки.СтавкаРЕПО                   = Число(Выборка.СтавкаРЕПО);
		РеквизитыШапки.БазаРасчетаПроцентов         = 0;
		РеквизитыШапки.Брокер                       = Брокер;
		РеквизитыШапки.МестоХранения                = Выборка.МестоХраненияДенежныхСредств;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.РасчетныйСчет                = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.ВалютаСделки                 = Выборка.ВалютаСделки;
		РеквизитыШапки.ВремяСделки                  = Дата(1, 1, 1);
		РеквизитыШапки.КодРасчетовНаБирже           = "";
		РеквизитыШапки.НеполныеЛоты                 = Ложь;
		РеквизитыШапки.НомерПорученияУБрокера       = Выборка.НомерПоручения;
		РеквизитыШапки.ДатаПорученияУБрокера        = Выборка.ДатаПоручения;
		
		Если ЗначениеЗаполнено(Выборка.Partner_ID) И Не ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			ОшибкиЧтения.Добавить("Не удалось определить контрагента по матрих ID [" + Выборка.Partner_ID + "]! Проверьте наличие кода в регистре [Коды во внешних системах].");	
		Иначе
			РеквизитыШапки.Контрагент = Выборка.Контрагент;
		КонецЕсли;
						
		РеквизитыШапки.РасчетныйСчетКонтрагента = Справочники.БанковскиеСчета.ПустаяСсылка();
		РеквизитыШапки.НомерДоговораКонтрагента = "";
		РеквизитыШапки.Договор                  = Справочники.Договоры.ПустаяСсылка();
		РеквизитыШапки.ПлатежноеУсловиеСделки   = СокрЛП(Выборка.PSA_Settlement_Type);
		РеквизитыШапки.РежимБиржевыхТоргов	    = Справочники.РежимыБиржевыхТоргов.ПустаяСсылка();
		РеквизитыШапки.Рынок                    = Выборка.Рынок;

		РеквизитыШапки.СделкаСЦентральнымКонтрагентом      = Ложь;
		РеквизитыШапки.НомерСделки                         = "";
		РеквизитыШапки.НомерСделкиСЦентральнымКонтрагентом = "";
		
		РеквизитыШапки.ОтложенноеИсполнение  = Истина;
		РеквизитыШапки.РаздельноеИсполнение  = Истина;
		РеквизитыШапки.ДатаИсполнения        = Дата(1, 1, 1);
		РеквизитыШапки.ДатаОплаты            = Выборка.ДатаОплаты;
		РеквизитыШапки.ДатаПоставки          = Выборка.ДатаПоставки;
		РеквизитыШапки.ВалютаОплаты          = Выборка.ВалютаОплаты;
		РеквизитыШапки.СобственныйКурсОплаты = Выборка.СобственныйКурсОплаты;
		РеквизитыШапки.КурсОплаты            = ?(Выборка.ВалютаСделки <> Выборка.ВалютаОплаты, ?(Выборка.Курс > 0, Выборка.Курс, Выборка.ДатаОплаты), Неопределено);
		
		РеквизитыШапки.ОтложенноеИсполнениеВторойЧасти  = Истина;
		РеквизитыШапки.РаздельноеИсполнениеВторойЧасти  = Истина;
		РеквизитыШапки.ДатаИсполненияВторойЧасти        = Дата(1, 1, 1);
		РеквизитыШапки.ДатаОплатыВторойЧасти            = Выборка.ДатаВторойЧастиРЕПО;
		РеквизитыШапки.ДатаПоставкиВторойЧасти          = Выборка.ДатаВторойЧастиРЕПО;
		РеквизитыШапки.ВалютаОплатыВторойЧасти          = Выборка.ВалютаОплаты;
		РеквизитыШапки.СобственныйКурсОплатыВторойЧасти = Выборка.СобственныйКурсОплаты;
		РеквизитыШапки.КурсОплатыВторойЧасти            = ?(Выборка.ВалютаСделки <> Выборка.ВалютаОплаты, ?(Выборка.Курс > 0, Выборка.Курс, РеквизитыШапки.ДатаВторойЧастиРЕПО), Неопределено);
				
		РеквизитыШапки.ОтложеннаяОплатаТорговойКомиссии = Ложь;
		РеквизитыШапки.ДатаОплатыТорговойКомиссии       = Дата(1, 1, 1);
		РеквизитыШапки.ВалютаТорговойКомиссии           = Справочники.Валюты.ПустаяСсылка();
		РеквизитыШапки.КонтрагентНабирже                = "";
		РеквизитыШапки.Дисконт                          = 0;
				
		// ценные бумаги 1-й части
		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		РеквизитыЦенныеБумаги.НомерСтроки = 1;
		
		Если ЗначениеЗаполнено(Выборка.ЦеннаяБумага) Тогда
			РеквизитыЦенныеБумаги.ЦеннаяБумага     = Выборка.ЦеннаяБумага;
		Иначе
			ОшибкиЧтения.Добавить("Внебиржевая сделка Репо [" + Выборка.Record_UID + "]. Не удалось определить ценную бумагу по коду во внешней системе. [" + Выборка.Security_ID + "]!");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
			РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
		Иначе
			Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
			КонецЕсли;
		КонецЕсли;

		РеквизитыЦенныеБумаги.Количество       = ?(Выборка.Количество = 0, 1, Выборка.Количество);
		РеквизитыЦенныеБумаги.Сумма            = Выборка.Сумма;
		РеквизитыЦенныеБумаги.СуммаКупона      = Выборка.СуммаКупона;
		РеквизитыЦенныеБумаги.Цена             = Выборка.Цена;
		РеквизитыЦенныеБумаги.ЦенаПроцент      = Выборка.ЦенаПроцент;
		РеквизитыЦенныеБумаги.ЦенаКупона       = ?(Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации, Окр(Выборка.СуммаКупона / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги), 0);
		РеквизитыЦенныеБумаги.ТорговаяКомиссия = 0;
				
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		// ценные бумаги 2-й части
		ЦенныеБумагиВторойЧасти = Новый Массив;
		
		РеквизитыЦенныеБумагиВторойЧасти = Новый Структура(ПоляДокумента.ЦенныеБумагиВторойЧасти);
		ЗаполнитьЗначенияСвойств(РеквизитыЦенныеБумагиВторойЧасти, РеквизитыЦенныеБумаги, "НомерСтроки, ДепозитарныйСчет, ЦеннаяБумага, Количество");
		
		РеквизитыЦенныеБумагиВторойЧасти.Сумма       = Выборка.СуммаВторойЧасти;
		РеквизитыЦенныеБумагиВторойЧасти.СуммаКупона = Выборка.СуммаКупонаВторойЧасти;
		РеквизитыЦенныеБумагиВторойЧасти.Цена        = Выборка.ЦенаВторойЧасти;
		
		Если Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
			
			Если Не ЗначениеЗаполнено(Выборка.Номинал) Тогда
				
				ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент] второй части сделки, т.к. отсутствует значение номинала для бумаги [" + РеквизитыЦенныеБумагиВторойЧасти.ЦеннаяБумага + "]!");
				
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.КоэффициентКонвертации) Тогда
				
				ВалютаНоминалаЦБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЦенныеБумагиВторойЧасти.ЦеннаяБумага, "ВалютаНоминала");

				ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент] второй части сделки, т.к. не удалось определить курс конвертации валюты оплаты [" + Выборка.ВалютаОплаты + "] в валюту номинала [" + ВалютаНоминалаЦБ + "]. Возможно отсутствуют курсы валют на дату [" + Выборка.ДатаСделки + "]!");	
				
			Иначе
				
				РеквизитыЦенныеБумагиВторойЧасти.ЦенаПроцент = Окр(Выборка.ЦенаВторойЧасти * Выборка.КоэффициентКонвертации * 100 / Выборка.Номинал, 4);
	
			КонецЕсли;
			
			РеквизитыЦенныеБумагиВторойЧасти.ЦенаКупона = Окр(Выборка.СуммаКупонаВторойЧасти / РеквизитыЦенныеБумагиВторойЧасти.Количество, ТочностьЦеныЦеннойБумаги);
				
		Иначе
			РеквизитыЦенныеБумагиВторойЧасти.ЦенаПроцент = 0;
			РеквизитыЦенныеБумагиВторойЧасти.ЦенаКупона  = 0;	
		КонецЕсли;
			
		ЦенныеБумагиВторойЧасти.Добавить(РеквизитыЦенныеБумагиВторойЧасти);
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги, ЦенныеБумагиВторойЧасти", РеквизитыШапки, ЦенныеБумаги, ЦенныеБумагиВторойЧасти);
		
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;		
		
	КонецЦикла;
	
	ИсключитьИзСверки = "ЦенныеБумаги.ДепозитарныйСчет";
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ВнебиржевыеСделкиРЕПОДанныеСистемы, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьИзмененияСделок_OTBR(МВТ)
	
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.ИзменениеУсловийСделки, Операции, ПоляДокумента);
	
	ГруппаИмпортируемыхОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Deals_Changes");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Deals_With_Details.Record_UID КАК Record_UID,
		|	_Deals_With_Details.Record_UID КАК Parent_Record_UID,
		|	_Deals_With_Details.Date КАК ДатаСделки,
		|	_Deals_With_Details.Time КАК ВремяСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Date <> _Deals_With_Details.Payment_Date
		|				ИЛИ _Deals_With_Details.Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложенноеИсполнение,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаздельноеИсполнение,
		|	_Deals_With_Details.Payment_Date КАК ДатаОплаты,
		|	_Deals_With_Details.Delivery_Date КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Rate > 0
		|				И _Deals_With_Details.Is_Payment_Rate_Fixed = ""1""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СобственныйКурсОплаты,
		|	_Deals_With_Details.Payment_Rate КАК Курс,
		|	_Deals_With_Details.PSA_Settlement_Type КАК PSA_Settlement_Type,
		|	_Deals_With_Details.Security_ID КАК Security_ID,
		|	_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Deals_With_Details.Рынок КАК Рынок,		
		|	_Deals_With_Details.ВалютаСделки КАК ВалютаСделки,
	    |	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_Deals_With_Details.КонтрагентСсылка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Контрагент,
		|	_ВнебиржевыеОперации.Объект КАК Основание,
		|	_Deals_With_Details.SettleCode КАК SettleCode,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	_Deals_With_Details.Depo_Storage_Place КАК Depo_Storage_Place,
		|	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
		|	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
		|	_Deals_With_Details.Price КАК Цена,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА _Deals_With_Details.Price_Percent
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПроцент,
		|	_Deals_With_Details.Volume КАК Количество,
		|	_Deals_With_Details.Amount КАК Сумма,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупона
		|ПОМЕСТИТЬ _ИзмененияСделокВнешниеДанные
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Deals_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Deals_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Deals_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО _Deals_With_Details.Parent_Record_UID = _ВнебиржевыеОперации.НомерОперации
		|ГДЕ
		|	_Deals_With_Details.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.IPO"")
		|	И _Deals_With_Details.Deal_Info_Type = ""Deals.Info.Type.Regular""
		|	И _Deals_With_Details.Is_Deal_Info = ""1""
		|	И _Deals_With_Details.Market = ""OTC""
		|	И _Deals_With_Details.Date = &НачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнебиржевыеОперации.НомерОперации КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО ИзменениеУсловийСделки.Ссылка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	ИзменениеУсловийСделки.Организация = &Организация
		|	И НЕ ИзменениеУсловийСделки.ПометкаУдаления
		|	И ИзменениеУсловийСделки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ИзменениеУсловийСделки.Основание.Брокер = &Брокер
		|	И НЕ ИзменениеУсловийСделки.Основание ССЫЛКА Документ.СделкаРЕПО
		|	И НЕ ИзменениеУсловийСделки.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";
#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
		
	ИзмененияСделокДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_ИзмененияСделокВнешниеДанные"].ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
						
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Выборка.Record_UID;
		НоваяСтрокаОперации.Описание     = "Изм. сделки, " + Выборка.Record_UID + " [" + Выборка.ВидСделки + "] " + Выборка.ЦеннаяБумага;
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;

		
		НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
			Справочники.ВнешниеСистемы.Матрих, ГруппаИмпортируемыхОбъектов, Выборка.Record_UID);
		
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.Дата                         = ?(ЗначениеЗаполнено(Выборка.Основание) И НачалоДня(Выборка.Основание.Дата) = ЭтотОбъект.ДатаИмпорта, Выборка.Основание.Дата + 1, ЭтотОбъект.ДатаИмпорта + (9 * 60 + 29) * 60);
		РеквизитыШапки.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоСделке;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.ДатаИсполнения               = Дата(1, 1, 1);
		РеквизитыШапки.ДатаОплаты                   = Выборка.ДатаОплаты;
		РеквизитыШапки.ДатаПоставки                 = Выборка.ДатаПоставки;
		РеквизитыШапки.ДатаВторойЧастиРЕПО			= Дата(1, 1, 1);
		РеквизитыШапки.ВалютаОплаты					= Выборка.ВалютаОплаты;
		РеквизитыШапки.СобственныйКурсОплаты        = Выборка.СобственныйКурсОплаты;
		РеквизитыШапки.КурсОплаты                   = ?(Выборка.ВалютаСделки <> Выборка.ВалютаОплаты, ?(Выборка.Курс > 0, Выборка.Курс, Выборка.ДатаОплаты), Неопределено);
		РеквизитыШапки.ВозвратныйКупонКЗачету		= 0;
		РеквизитыШапки.Рынок                        = Выборка.Рынок;
		РеквизитыШапки.ПлатежноеУсловиеСделки       = СокрЛП(Выборка.PSA_Settlement_Type);
		РеквизитыШапки.СтавкаРЕПО                   = 0;
		
		Если ЗначениеЗаполнено(Выборка.Основание) Тогда
			РеквизитыШапки.Основание = Выборка.Основание;
		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить сделку основание по коду матрих [" + Выборка.Parent_Record_UID + "]");
		КонецЕсли;
		
		РеквизитыШапки.ВалютаЗадолженностиПоКупону		 = Справочники.Валюты.ПустаяСсылка();
		РеквизитыШапки.СуммаЗаймаКПогашениюВВалютеСделки = 0;
				
		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		РеквизитыЦенныеБумаги.НомерСтроки = 1;
		РеквизитыЦенныеБумаги.Исполнено   = Ложь;
		
		Если ЗначениеЗаполнено(Выборка.ЦеннаяБумага) Тогда
			РеквизитыЦенныеБумаги.ЦеннаяБумага = Выборка.ЦеннаяБумага;
		Иначе
			ОшибкиЧтения.Добавить("Изменение условий сделки [" + Выборка.Record_UID + "]. Не удалось определить ценную бумагу по коду во внешней системе. [" + Выборка.Security_ID + "]!");
		КонецЕсли;
		 
		Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
			РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
		Иначе
			Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
			КонецЕсли;
		КонецЕсли;

		РеквизитыЦенныеБумаги.Количество  = ?(Выборка.Количество = 0, 1, Выборка.Количество);
		РеквизитыЦенныеБумаги.ЦенаПроцент = Выборка.ЦенаПроцент;				
		РеквизитыЦенныеБумаги.Сумма       = Выборка.Сумма;
		РеквизитыЦенныеБумаги.СуммаКупона = Выборка.СуммаКупона;
		РеквизитыЦенныеБумаги.Цена        = Выборка.Цена;
		РеквизитыЦенныеБумаги.ЦенаКупона  = Окр(РеквизитыЦенныеБумаги.СуммаКупона / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги);
		
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги", РеквизитыШапки, ЦенныеБумаги);
				
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;		
		
	КонецЦикла;
	
	ИсключитьИзСверки = "Дата";	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ИзмененияСделокДанныеСистемы, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьИзмененияСделокРЕПО2_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.ИзменениеУсловийСделки, Операции, ПоляДокумента);
	
	ГруппаИмпортируемыхОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("REPO_Close_Changes");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market_Number = """"
		|			ТОГДА _Deals_With_Details.Parent_Record_UID
		|		ИНАЧЕ _Deals_With_Details.Market_Number
		|	КОНЕЦ КАК НомерСделки,
		|	_Deals_With_Details.Parent_Record_UID КАК Parent_Record_UID,
		|	_Deals_With_Details.Date КАК ДатаСделки,
		|	_Deals_With_Details.Time КАК ВремяСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Direction = ""-1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|		КОГДА _Deals_With_Details.Direction = ""1""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидСделки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Date <> _Deals_With_Details.Payment_Date
		|				ИЛИ _Deals_With_Details.Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложенноеИсполнение,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Date <> _Deals_With_Details.Delivery_Date
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РаздельноеИсполнение,
		|	_Deals_With_Details.Payment_Date КАК ДатаОплаты,
		|	_Deals_With_Details.Delivery_Date КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Payment_Rate > 0
		|				И _Deals_With_Details.Is_Payment_Rate_Fixed = ""1""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СобственныйКурсОплаты,
		|	_Deals_With_Details.Payment_Rate КАК Курс,
		|	_Deals_With_Details.Far_Execution_Date КАК ДатаВторойЧастиРЕПО,
		|	_Deals_With_Details.Far_Interest_Rate КАК СтавкаРЕПО,
		|	_Deals_With_Details.PSA_Settlement_Type КАК PSA_Settlement_Type,
		|	_Deals_With_Details.Security_ID КАК Security_ID,
		|	_Deals_With_Details.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_НоминалыЦенныхБумаг.Номинал КАК Номинал,
		|	_КурсыВалют.КурсВалютыОплаты / (_КурсыВалют.КратностьКурсаВалютыОплаты * _НоминалыЦенныхБумаг.КратностьКурсаВалютыНоминала * _НоминалыЦенныхБумаг.КурсВалютыНоминала) КАК КоэффициентКонвертации,
		|	_Deals_With_Details.Рынок КАК Рынок,
		|	_Deals_With_Details.ВалютаСделки КАК ВалютаСделки,
		|	_Deals_With_Details.ВалютаОплаты КАК ВалютаОплаты,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_Deals_With_Details.КонтрагентСсылка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Контрагент,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market = ""OTC""
		|			ТОГДА _ВнебиржевыеОперации.Объект
		|		КОГДА _Deals_With_Details.Market = ""MICEX""
		|			ТОГДА СделкаРЕПО.Ссылка
		|	КОНЕЦ КАК Основание,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХраненияДенежныхСредств,
		|	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
		|	_Deals_With_Details.Depo_Storage_Place КАК Depo_Storage_Place,
		|	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
		|	_Deals_With_Details.Price КАК Цена,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.Price_Percent
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПроцент,
		|	_Deals_With_Details.Volume КАК Количество,
		|	_Deals_With_Details.Amount КАК Сумма,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупона,
		|	_Deals_With_Details.Far_Price КАК ЦенаВторойЧасти,
		|	_Deals_With_Details.Far_Amount КАК СуммаВторойЧасти,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА _Deals_With_Details.Far_ACI_Amount
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаКупонаВторойЧасти
		|ПОМЕСТИТЬ _ИзмененияСделокРЕПО2ВнешниеДанные
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
		|		ПО _Deals_With_Details.ВалютаОплаты = _КурсыВалют.ВалютаОплаты
		|			И _Deals_With_Details.ДатаСделки = _КурсыВалют.ДатаСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НоминалыЦенныхБумаг КАК _НоминалыЦенныхБумаг
		|		ПО _Deals_With_Details.ЦеннаяБумага = _НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _Deals_With_Details.ДатаСделки = _НоминалыЦенныхБумаг.ДатаСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Deals_With_Details.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Deals_With_Details.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Deals_With_Details.Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО _Deals_With_Details.Parent_Record_UID = _ВнебиржевыеОперации.НомерОперации
		|			И (_Deals_With_Details.Market = ""OTC"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО (ВЫБОР
		|				КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом
		|					ТОГДА _Deals_With_Details.Market_Number = СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
		|				ИНАЧЕ _Deals_With_Details.Market_Number = СделкаРЕПО.НомерСделки
		|			КОНЕЦ)
		|			И (СделкаРЕПО.ЧастьСделкиРЕПО = 1)
		|			И (_Deals_With_Details.Operation_Type = ""Operations.Group.Deals.REPO"")
		|			И (_Deals_With_Details.Market = ""MICEX"")
		|ГДЕ
		|	_Deals_With_Details.Operation_Type = ""Operations.Group.Deals.REPO""
		|	И _Deals_With_Details.Deal_Info_Type В (""Deals.Info.Type.Regular"", ""Deals.Info.Type.Coupon"")
		|	И _Deals_With_Details.Is_Deal_Info = ""1""
		|	И _Deals_With_Details.Date = &НачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ВнебиржевыеОперации.НомерОперации ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ИзменениеУсловийСделки.Основание ССЫЛКА Документ.СделкаРЕПО
		|							И ВЫРАЗИТЬ(ИзменениеУсловийСделки.Основание КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом
		|						ТОГДА ВЫРАЗИТЬ(ИзменениеУсловийСделки.Основание КАК Документ.СделкаРЕПО).НомерСделкиСЦентральнымКонтрагентом
		|					ИНАЧЕ ВЫРАЗИТЬ(ИзменениеУсловийСделки.Основание КАК Документ.СделкаРЕПО).НомерСделки
		|				КОНЕЦ
		|		ИНАЧЕ _ВнебиржевыеОперации.НомерОперации
		|	КОНЕЦ КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО ИзменениеУсловийСделки.Основание = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	ИзменениеУсловийСделки.Организация = &Организация
		|	И НЕ ИзменениеУсловийСделки.ПометкаУдаления
		|	И ИзменениеУсловийСделки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ИзменениеУсловийСделки.Основание.Брокер = &Брокер
		|	И ИзменениеУсловийСделки.Основание ССЫЛКА Документ.СделкаРЕПО
		|	И НЕ ИзменениеУсловийСделки.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)";

#КонецОбласти		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	
	ИзмененияСделокРЕПО2ДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_ИзмененияСделокРЕПО2ВнешниеДанные"].ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Выборка.НомерСделки;
		НоваяСтрокаОперации.Описание     = "Изм. сделки РЕПО, " + Выборка.НомерСделки + " [" + Выборка.ВидСделки + "] " + Выборка.ЦеннаяБумага;
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
				
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.Дата                         = ?(ЗначениеЗаполнено(Выборка.Основание) И НачалоДня(Выборка.Основание.Дата) = ЭтотОбъект.ДатаИмпорта, Выборка.Основание.Дата + 1, ЭтотОбъект.ДатаИмпорта + (9 * 60 + 29) * 60);
		РеквизитыШапки.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.ДатаИсполнения               = Дата(1, 1, 1);
		РеквизитыШапки.ДатаОплаты                   = Выборка.ДатаВторойЧастиРЕПО;
		РеквизитыШапки.ДатаПоставки                 = Выборка.ДатаВторойЧастиРЕПО;
		РеквизитыШапки.ДатаВторойЧастиРЕПО          = ?(ЗначениеЗаполнено(Выборка.Основание) и Выборка.Основание.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок, РеквизитыШапки.ДатаПоставки, Дата(1, 1, 1));
		РеквизитыШапки.ВозвратныйКупонКЗачету       = 0;
		РеквизитыШапки.ВалютаОплаты          	    = Выборка.ВалютаОплаты;
		РеквизитыШапки.СобственныйКурсОплаты        = Выборка.СобственныйКурсОплаты;
		РеквизитыШапки.КурсОплаты                   = ?(Выборка.ВалютаСделки <> Выборка.ВалютаОплаты, ?(Выборка.Курс > 0, Выборка.Курс, Выборка.ДатаОплаты), Неопределено);
		РеквизитыШапки.Рынок                        = Выборка.Рынок;
		РеквизитыШапки.ПлатежноеУсловиеСделки       = СокрЛП(Выборка.PSA_Settlement_Type);
		РеквизитыШапки.СтавкаРЕПО			        = Число(Выборка.СтавкаРЕПО);
		
		Если ЗначениеЗаполнено(Выборка.Основание) Тогда
			РеквизитыШапки.Основание = Выборка.Основание;
		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить сделку Репо (основание) по коду матрих [" + Выборка.Parent_Record_UID + "]");
		КонецЕсли;
		
		РеквизитыШапки.ВалютаЗадолженностиПоКупону		 = Справочники.Валюты.ПустаяСсылка();
		РеквизитыШапки.СуммаЗаймаКПогашениюВВалютеСделки = 0;
		
		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		РеквизитыЦенныеБумаги.НомерСтроки = 1;
		РеквизитыЦенныеБумаги.Исполнено   = Ложь;
		
		Если ЗначениеЗаполнено(Выборка.ЦеннаяБумага) Тогда
			РеквизитыЦенныеБумаги.ЦеннаяБумага	= Выборка.ЦеннаяБумага;
		Иначе
			ОшибкиЧтения.Добавить("Изменение условий сделки [" + Выборка.Record_UID + "]. Не удалось определить ценную бумагу по коду во внешней системе [" + Выборка.Security_ID + "]!");
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
			РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
		Иначе
			Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
			КонецЕсли;
		КонецЕсли;

		РеквизитыЦенныеБумаги.Количество  = ?(Выборка.Количество = 0, 1, Выборка.Количество);
		РеквизитыЦенныеБумаги.Сумма       = Выборка.СуммаВторойЧасти;
		РеквизитыЦенныеБумаги.СуммаКупона = Выборка.СуммаКупонаВторойЧасти;
		РеквизитыЦенныеБумаги.Цена        = Выборка.ЦенаВторойЧасти;	
		
		Если Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
			
			Если Не ЗначениеЗаполнено(Выборка.Номинал) Тогда
				
				ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент], т.к. отсутствует значение номинала для бумаги [" + РеквизитыЦенныеБумаги.ЦеннаяБумага + "]!");
				
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.КоэффициентКонвертации) Тогда
				
				ВалютаНоминалаЦБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЦенныеБумаги.ЦеннаяБумага, "ВалютаНоминала");

				ОшибкиЧтения.Добавить("Не удалось рассчитать значение реквизита [ЦенаПроцент], т.к. не удалось определить курс конвертации валюты оплаты [" + Выборка.ВалютаОплаты + "] в валюту номинала [" + ВалютаНоминалаЦБ + "]. Возможно отсутствуют курсы валют на дату [" + Выборка.ДатаСделки + "]!");	
				
			Иначе
				
				РеквизитыЦенныеБумаги.ЦенаПроцент = Окр(Выборка.ЦенаВторойЧасти * Выборка.КоэффициентКонвертации * 100 / Выборка.Номинал, 4);
	
			КонецЕсли;
			
			РеквизитыЦенныеБумаги.ЦенаКупона = Окр(Выборка.СуммаКупонаВторойЧасти / РеквизитыЦенныеБумаги.Количество, ТочностьЦеныЦеннойБумаги);
		
		Иначе	
			РеквизитыЦенныеБумаги.ЦенаПроцент = 0;
			РеквизитыЦенныеБумаги.ЦенаКупона = 0;	
		КонецЕсли;
				
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги", РеквизитыШапки, ЦенныеБумаги);
				
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;		
		
	КонецЦикла;
	
	ИсключитьИзСверки = "Дата";	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ИзмененияСделокРЕПО2ДанныеСистемы, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьПоставкиЦенныхБумаг_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.ПоставкаЦенныхБумаг, Операции, ПоляДокумента);
	
	Группа_Delivery = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Delivery");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_Depo_Operations.Record_UID КАК Record_UID,
	    |	_Depo_Operations.Deal_Record_UID КАК Deal_Record_UID,
	    |	_Depo_Operations.Date КАК Дата,
	    |	ВЫБОР
	    |		КОГДА _Depo_Operations.Direction = ""1""
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
	    |		КОГДА _Depo_Operations.Direction = ""-1""
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
	    |	КОНЕЦ КАК ВидДвижения,
	    |	_ВнебиржевыеОперации.Объект КАК Основание,
	    |	_ВнебиржевыеОперации.ГруппаОбъектов КАК ГруппаОбъектов,
	    |	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	    |	_ЦенныеБумаги.Рынок КАК Рынок,
	    |	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
	    |	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
	    |	_Depo_Operations.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	_Depo_Operations.Volume КАК Количество,
	    |	ВЫБОР
	    |		КОГДА _Depo_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.Delivery""
	    |			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
	    |		КОГДА _Depo_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.REPO.Delivery.Near""
	    |			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
	    |		КОГДА _Depo_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.REPO.Delivery.Far""
	    |			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
	    |	КОНЕЦ КАК ВидЗадолженности
	    |ПОМЕСТИТЬ _ВнешниеДанные
	    |ИЗ
	    |	_Depo_Operations КАК _Depo_Operations
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
	    |		ПО _Depo_Operations.Ключ = _ДанныеПервыхУзлов.Ключ
	    |			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
	    |		ПО _Depo_Operations.Security_ID = _ЦенныеБумаги.Matrix_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
	    |		ПО _Depo_Operations.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
	    |		ПО _Depo_Operations.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
	    |			И _Depo_Operations.Inner_Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
	    |		ПО _Depo_Operations.Deal_Record_UID = _ВнебиржевыеОперации.НомерОперации
	    |ГДЕ
	    |	НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
	    |	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
	    |	И _Depo_Operations.Date = &НачалоПериода
	    |	И _Depo_Operations.Origin_Operation_Type В (""Operations.Group.Settlements.Delivery"", ""Operations.Group.Settlements.REPO.Delivery.Near"", ""Operations.Group.Settlements.REPO.Delivery.Far"")
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ВнешниеДанные.Record_UID КАК Record_UID,
	    |	_ВнешниеДанные.Deal_Record_UID КАК Deal_Record_UID,
	    |	_ВнешниеДанные.Дата КАК ДатаПоставки,
	    |	_ВнешниеДанные.ВидДвижения КАК ВидДвижения,
	    |	_ВнешниеДанные.ВидЗадолженности КАК ВидЗадолженности,
	    |	_ВнешниеДанные.Основание КАК Основание,
	    |	_ВнешниеДанные.ГруппаОбъектов КАК ГруппаОбъектов,
	    |	_ВнешниеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	_ВнешниеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	_ВнешниеДанные.Рынок КАК Рынок,
	    |	_ВнешниеДанные.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	_ВнешниеДанные.КоличествоДепозитарныхСчетов КАК КоличествоДепозитарныхСчетов,
	    |	_ВнешниеДанные.ДепозитарныйСчет КАК ДепозитарныйСчет,
	    |	ВЫБОР
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.Сделка
	    |			ТОГДА ВЫРАЗИТЬ(_ВнешниеДанные.Основание КАК Документ.Сделка).ВалютаСделки
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.СделкаРЕПО
	    |			ТОГДА ВЫРАЗИТЬ(_ВнешниеДанные.Основание КАК Документ.СделкаРЕПО).ВалютаСделки
	    |	КОНЕЦ КАК ВалютаСделки,
	    |	_ВнешниеДанные.Количество КАК Количество,
	    |	ВЫБОР
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.Сделка
	    |			ТОГДА УсловияСделокСрезПоследних.Цена
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.СделкаРЕПО
	    |			ТОГДА УсловияСделокРЕПОСрезПоследних.Цена
	    |		ИНАЧЕ 0
	    |	КОНЕЦ КАК Цена,
	    |	ВЫБОР
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.Сделка
	    |			ТОГДА УсловияСделокСрезПоследних.ЦенаПроцент
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.СделкаРЕПО
	    |			ТОГДА УсловияСделокРЕПОСрезПоследних.ЦенаПроцент
	    |		ИНАЧЕ 0
	    |	КОНЕЦ КАК ЦенаПроцент,
	    |	ВЫБОР
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.Сделка
	    |			ТОГДА УсловияСделокСрезПоследних.ЦенаКупона
	    |		КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.СделкаРЕПО
	    |			ТОГДА УсловияСделокРЕПОСрезПоследних.ЦенаКупона
	    |		ИНАЧЕ 0
	    |	КОНЕЦ КАК ЦенаКупона,
	    |	ВЫРАЗИТЬ(ВЫБОР
	    |			КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.Сделка
	    |				ТОГДА УсловияСделокСрезПоследних.Сумма / УсловияСделокСрезПоследних.Количество * _ВнешниеДанные.Количество
	    |			КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.СделкаРЕПО
	    |				ТОГДА УсловияСделокРЕПОСрезПоследних.Сумма / УсловияСделокРЕПОСрезПоследних.Количество * _ВнешниеДанные.Количество
	    |			ИНАЧЕ 0
	    |		КОНЕЦ КАК ЧИСЛО(19, 2)) КАК Сумма,
	    |	ВЫРАЗИТЬ(ВЫБОР
	    |			КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.Сделка
	    |				ТОГДА УсловияСделокСрезПоследних.СуммаКупона / УсловияСделокСрезПоследних.Количество * _ВнешниеДанные.Количество
	    |			КОГДА _ВнешниеДанные.Основание ССЫЛКА Документ.СделкаРЕПО
	    |				ТОГДА УсловияСделокРЕПОСрезПоследних.СуммаКупона / УсловияСделокРЕПОСрезПоследних.Количество * _ВнешниеДанные.Количество
	    |			ИНАЧЕ 0
	    |		КОНЕЦ КАК ЧИСЛО(19, 2)) КАК СуммаКупона
	    |ПОМЕСТИТЬ _ПоставкиЦенныхБумагВнешниеДанные
	    |ИЗ
	    |	_ВнешниеДанные КАК _ВнешниеДанные
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокСрезПоследних
	    |		ПО _ВнешниеДанные.СчетДоверительногоУправления = УсловияСделокСрезПоследних.СчетДоверительногоУправления
	    |			И _ВнешниеДанные.Основание = УсловияСделокСрезПоследних.Сделка
	    |			И _ВнешниеДанные.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
	    |		ПО _ВнешниеДанные.СчетДоверительногоУправления = УсловияСделокРЕПОСрезПоследних.СчетДоверительногоУправления
	    |			И _ВнешниеДанные.Основание = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
	    |			И _ВнешниеДанные.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
	    |			И _ВнешниеДанные.ВидЗадолженности = УсловияСделокРЕПОСрезПоследних.ВидЗадолженности
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ВнебиржевыеОперации.НомерОперации КАК Ключ,
	    |	&Звездочка КАК Звездочка
	    |ИЗ
	    |	Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
	    |		ПО ПоставкаЦенныхБумаг.Ссылка = _ВнебиржевыеОперации.Объект
	    |ГДЕ
	    |	ПоставкаЦенныхБумаг.Организация = &Организация
	    |	И НЕ ПоставкаЦенныхБумаг.ПометкаУдаления
	    |	И ПоставкаЦенныхБумаг.Основание.Брокер = &Брокер
	    |	И ПоставкаЦенныхБумаг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	    |	И НЕ ПоставкаЦенныхБумаг.СчетДоверительногоУправления В
	    |				(ВЫБРАТЬ
	    |					_СчетаИсключеныИзЗагрузки.Счет
	    |				ИЗ
	    |					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _ВнешниеДанные";
#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*"); 
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	
	ПоставкиЦенныхБумагДанныеСистемы = Запрос.Выполнить().Выгрузить();
	
	Выборка = МВТ.Таблицы["_ПоставкиЦенныхБумагВнешниеДанные"].ПолучитьДанные().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Выборка.Record_UID;
		НоваяСтрокаОперации.Описание     = "Поставка ц/б, " + Выборка.ВидДвижения + ", " + Выборка.ЦеннаяБумага + ", " + Выборка.Количество;
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;

		НоваяСтрокаОперации.КодВоВнешнейСистеме = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Код",
			Справочники.ВнешниеСистемы.Матрих, Группа_Delivery, Выборка.Record_UID);
			
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = ?(ЗначениеЗаполнено(Выборка.Основание) И НачалоДня(Выборка.Основание.Дата) = Выборка.ДатаПоставки, Выборка.Основание.Дата + 2, Выборка.ДатаПоставки + ?(Выборка.ВидДвижения = Перечисления.ВидыДвижений.Приход, (9 * 60 + 30) * 60, (19 * 60 + 30) * 60));
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		
		Если ЗначениеЗаполнено(Выборка.Основание) Тогда
			РеквизитыШапки.Основание = Выборка.Основание;
		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить документ основание по коду [" + Выборка.Deal_Record_UID + "]!");
		КонецЕсли;
		
		РеквизитыШапки.ВидДвижения                  = Выборка.ВидДвижения;
		РеквизитыШапки.ВидЗадолженности             = Выборка.ВидЗадолженности;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.ВалютаСделки                 = Выборка.ВалютаСделки;
		РеквизитыШапки.Рынок                        = Выборка.Рынок;

		РеквизитыЦенныеБумаги = Новый Структура(ПоляДокумента.ЦенныеБумаги);
		РеквизитыЦенныеБумаги.НомерСтроки = 1;
				
		Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
			РеквизитыЦенныеБумаги.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
		Иначе
			Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
			КонецЕсли;
		КонецЕсли;

		РеквизитыЦенныеБумаги.ЦеннаяБумага = Выборка.ЦеннаяБумага;
		РеквизитыЦенныеБумаги.Количество   = ?(Выборка.Количество = 0, 1, Выборка.Количество);
		РеквизитыЦенныеБумаги.Сумма        = Выборка.Сумма;
		РеквизитыЦенныеБумаги.СуммаКупона  = Выборка.СуммаКупона;
		РеквизитыЦенныеБумаги.Цена         = Выборка.Цена;
		РеквизитыЦенныеБумаги.ЦенаПроцент  = Выборка.ЦенаПроцент;
		РеквизитыЦенныеБумаги.ЦенаКупона   = Выборка.ЦенаКупона;
				
		ЦенныеБумаги = Новый Массив;
		ЦенныеБумаги.Добавить(РеквизитыЦенныеБумаги);
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка, ЦенныеБумаги", РеквизитыШапки, ЦенныеБумаги);
				
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
	КонецЦикла;
	
	ИсключитьИзСверки = "Дата";
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ПоставкиЦенныхБумагДанныеСистемы, ПоляДокумента, ИсключитьИзСверки);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьОтменыСделок_OTBR(МВТ)
	
	Перем Операции, ПоляДокумента;
		
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.ОтменаСделки, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;

#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ВнебиржевыеОперации.НомерОперации ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ОтменаСделки.Сделка ССЫЛКА Документ.СделкаРЕПО
		|							И ВЫРАЗИТЬ(ОтменаСделки.Сделка КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом
		|						ТОГДА ВЫРАЗИТЬ(ОтменаСделки.Сделка КАК Документ.СделкаРЕПО).НомерСделкиСЦентральнымКонтрагентом
		|					ИНАЧЕ ОтменаСделки.Сделка.НомерСделки
		|				КОНЕЦ
		|		ИНАЧЕ _ВнебиржевыеОперации.НомерОперации
		|	КОНЕЦ КАК Ключ,
		|	&Звездочка КАК Звездочка
		|ПОМЕСТИТЬ _ОтменыСделокДанныеСистемы
		|ИЗ
		|	Документ.ОтменаСделки КАК ОтменаСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО ОтменаСделки.Сделка = _ВнебиржевыеОперации.Объект
		|ГДЕ
		|	ОтменаСделки.Организация = &Организация
		|	И НЕ ОтменаСделки.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаИсключеныИзЗагрузки.Счет
		|				ИЗ
		|					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
		|	И НЕ ОтменаСделки.ПометкаУдаления
		|	И ОтменаСделки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Deals_With_Details.Date КАК ДатаСделки,
		|	_Deals_With_Details.Date_Cancelled КАК ДатаОтмены,
		|	_Deals_With_Details.Time_Cancelled КАК ВремяОтмены,
		|	_Deals_With_Details.Market КАК Market,
		|	_Deals_With_Details.Operation_Type КАК Operation_Type,
		|	ВЫБОР
		|		КОГДА _Deals_With_Details.Market_Number = """"
		|			ТОГДА _Deals_With_Details.Parent_Record_UID
		|		ИНАЧЕ _Deals_With_Details.Market_Number
		|	КОНЕЦ КАК НомерСделки,
		|	_Deals_With_Details.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА НЕ _ВнебиржевыеОперации.Объект ЕСТЬ NULL
		|			ТОГДА _ВнебиржевыеОперации.Объект
		|		КОГДА НЕ Сделка.Ссылка ЕСТЬ NULL
		|			ТОГДА Сделка.Ссылка
		|		КОГДА НЕ СделкаРЕПО.Ссылка ЕСТЬ NULL
		|			ТОГДА СделкаРЕПО.Ссылка
		|	КОНЕЦ КАК Сделка,
		|	ЕСТЬNULL(_Money_Operations.Payment_Amount, 0) КАК СуммаОтступных,
		|	ВалютыОтступных.Валюта КАК ВалютаОтступных
		|ИЗ
		|	_Deals_With_Details КАК _Deals_With_Details
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнебиржевыеОперации КАК _ВнебиржевыеОперации
		|		ПО _Deals_With_Details.Parent_Record_UID = _ВнебиржевыеОперации.НомерОперации
		|			И (_Deals_With_Details.Market = ""OTC"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _Deals_With_Details.Market_Number = Сделка.Номер
		|			И (_Deals_With_Details.Operation_Type = ""Operations.Group.Deals.Trade"")
		|			И (_Deals_With_Details.Market = ""MICEX"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО (ВЫБОР
		|				КОГДА СделкаРЕПО.СделкаСЦентральнымКонтрагентом
		|					ТОГДА _Deals_With_Details.Market_Number = СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
		|				ИНАЧЕ _Deals_With_Details.Market_Number = СделкаРЕПО.НомерСделки
		|			КОНЕЦ)
		|			И (СделкаРЕПО.ЧастьСделкиРЕПО = 1)
		|			И (_Deals_With_Details.Operation_Type = ""Operations.Group.Deals.REPO"")
		|			И (_Deals_With_Details.Market = ""MICEX"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Money_Operations КАК _Money_Operations
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОтступных
		|			ПО _Money_Operations.Payment_Currency_Code = ВалютыОтступных.ISO_Code
		|		ПО _Deals_With_Details.Parent_Record_UID = _Money_Operations.Deal_Record_UID
		|			И (_Money_Operations.Origin_Operation_Type = ""Operations.Group.Settlements.Add.PayOff"")
		|ГДЕ
		|	_Deals_With_Details.Operation_Type В (""Operations.Group.Deals.Trade"", ""Operations.Group.Deals.REPO"")
		|	И _Deals_With_Details.Is_Deal_Info = ""1""
		|	И _Deals_With_Details.Deal_Info_Type = ""Deals.Info.Type.Cancellation""
		|	И _Deals_With_Details.Date = &НачалоПериода";
		
#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*"); 
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
			
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Выборка.НомерСделки;
		НоваяСтрокаОперации.Описание     = "Отмена сделки" + ?(Выборка.Operation_Type = "Operations.Group.Deals.REPO", " РЕПО, ", ", ") + Выборка.НомерСделки;
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
				
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = ?(ЗначениеЗаполнено(Выборка.ВремяОтмены), Выборка.ДатаОтмены + (Выборка.ВремяОтмены - Дата(1, 1, 1)), ЭтотОбъект.ДатаИмпорта + ((19 * 60 + 30) * 60));
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.Валюта                       = ?(ЗначениеЗаполнено(Выборка.ВалютаОтступных), Выборка.ВалютаОтступных, ЭтотОбъект.Организация.ВалютаУчета);
		РеквизитыШапки.СуммаОтступных               = Выборка.СуммаОтступных;
		
		Если ЗначениеЗаполнено(Выборка.Сделка) Тогда
			РеквизитыШапки.Сделка = Выборка.Сделка;
		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить " + ?(ЗначениеЗаполнено(Выборка.Market), "биржевую", "внебиржевую") + " сделку " + ?(Выборка.Operation_Type = "Operations.Group.Deals.REPO", "РЕПО", "") + " по номеру [" + Выборка.НомерСделки  + "].");
		КонецЕсли; 
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка", РеквизитыШапки);
		
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
	КонецЦикла;
			
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, МВТ.Таблицы["_ОтменыСделокДанныеСистемы"].ПолучитьДанные().Выгрузить(), ПоляДокумента);
	
	Возврат Операции;
	
КонецФункции

Функция ОбработатьСписанияЦенныхБумаг_OTBR(МВТ)
	Перем Операции, ПоляДокумента;
	
	ПодготовитьОбработкуОпераций_OTBR(Метаданные.Документы.СписаниеЦеннойБумаги, Операции, ПоляДокумента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_Depo_Operations.Record_UID КАК Record_UID,
	    |	_Depo_Operations.Date КАК Дата,
	    |	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	_Depo_Operations.Security_ID КАК Security_ID,
	    |	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	    |	_ЦенныеБумаги.Рынок КАК Рынок,
	    |	_ДепозитарныеСчета.Счет КАК ДепозитарныйСчет,
	    |	ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) КАК КоличествоДепозитарныхСчетов,
	    |	_Depo_Operations.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	_Depo_Operations.Volume КАК Количество
	    |ПОМЕСТИТЬ _ВнешниеДанные
	    |ИЗ
	    |	_Depo_Operations КАК _Depo_Operations
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
	    |		ПО _Depo_Operations.Ключ = _ДанныеПервыхУзлов.Ключ
	    |			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
	    |		ПО _Depo_Operations.Security_ID = _ЦенныеБумаги.Matrix_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
	    |		ПО _Depo_Operations.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
	    |		ПО _Depo_Operations.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
	    |			И _Depo_Operations.Inner_Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
	    |ГДЕ
	    |	НЕ _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
	    |	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
	    |	И _Depo_Operations.Date = &НачалоПериода
	    |	И _Depo_Operations.Origin_Operation_Type В (""Operations.Group.CorporateActions.WriteOff"")
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СписаниеЦеннойБумаги.СчетДоверительногоУправления.Наименование КАК Ключ,
	    |	&Звездочка КАК Звездочка
	    |ПОМЕСТИТЬ _СписанияЦенныхБумагДанныеСистемы
	    |ИЗ
	    |	Документ.СписаниеЦеннойБумаги КАК СписаниеЦеннойБумаги
	    |ГДЕ
	    |	СписаниеЦеннойБумаги.Организация = &Организация
	    |	И НЕ СписаниеЦеннойБумаги.СчетДоверительногоУправления В
	    |				(ВЫБРАТЬ
	    |					_СчетаИсключеныИзЗагрузки.Счет
	    |				ИЗ
	    |					_СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки)
	    |	И СписаниеЦеннойБумаги.Проведен
	    |	И СписаниеЦеннойБумаги.ДепозитарныйСчет.Депозитарий = &ДБК_Регион
	    |	И НАЧАЛОПЕРИОДА(СписаниеЦеннойБумаги.Дата, ДЕНЬ) = &НачалоПериода
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ВнешниеДанные.Record_UID КАК Record_UID,
	    |	_ВнешниеДанные.Дата КАК Дата,
	    |	_ВнешниеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	_ВнешниеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	_ВнешниеДанные.Security_ID КАК Security_ID,
	    |	_ВнешниеДанные.Рынок КАК Рынок,
	    |	_ВнешниеДанные.ДепозитарныйСчет КАК ДепозитарныйСчет,
	    |	_ВнешниеДанные.КоличествоДепозитарныхСчетов КАК КоличествоДепозитарныхСчетов,
	    |	_ВнешниеДанные.Depo_Storage_Place КАК Depo_Storage_Place,
	    |	_ВнешниеДанные.Количество КАК Количество,
	    |	ОстаткиЦенныхБумагЗаблокированные.Регистратор КАК Основание
	    |ИЗ
	    |	_ВнешниеДанные КАК _ВнешниеДанные
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные КАК ОстаткиЦенныхБумагЗаблокированные
	    |		ПО _ВнешниеДанные.СчетДоверительногоУправления = ОстаткиЦенныхБумагЗаблокированные.СчетДоверительногоУправления
	    |			И _ВнешниеДанные.ДепозитарныйСчет = ОстаткиЦенныхБумагЗаблокированные.ДепозитарныйСчет
	    |			И _ВнешниеДанные.ЦеннаяБумага = ОстаткиЦенныхБумагЗаблокированные.ЦеннаяБумага
	    |			И _ВнешниеДанные.Количество = ОстаткиЦенныхБумагЗаблокированные.Количество
	    |			И (ОстаткиЦенныхБумагЗаблокированные.ВидБлокировкиАктива = ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение))
	    |			И (ОстаткиЦенныхБумагЗаблокированные.Регистратор ССЫЛКА Документ.ПогашениеЦеннойБумаги)
	    |			И (ОстаткиЦенныхБумагЗаблокированные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ _ВнешниеДанные";
#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*"); 
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.ДатаИмпорта));
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.ДатаИмпорта + (17 * 60 + 29) * 60 + 59); //17:29:59
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДБК_Регион", ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_БК_Регион"));
			
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЧтения = Новый Массив;
		
		НоваяСтрокаОперации = Операции.Добавить();
		НоваяСтрокаОперации.Ключ         = Выборка.СчетДоверительногоУправления.Наименование + "/" + Выборка.ЦеннаяБумага.Наименование + "/" + Выборка.Количество;
		НоваяСтрокаОперации.Описание     = "Списание ц/б, " + Выборка.ЦеннаяБумага + ", " + Выборка.Количество;
		НоваяСтрокаОперации.ОшибкиЧтения = ОшибкиЧтения;
		НоваяСтрокаОперации.Статус       = "Новый";
		НоваяСтрокаОперации.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
			
		РеквизитыШапки = Новый Структура(ПоляДокумента.Шапка);
		РеквизитыШапки.Проведен                     = Истина;
		РеквизитыШапки.ПометкаУдаления              = Ложь;
		РеквизитыШапки.Дата                         = Выборка.Дата + ((17 * 60 + 30) * 60);
		РеквизитыШапки.Организация                  = ЭтотОбъект.Организация;
		РеквизитыШапки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		РеквизитыШапки.Рынок                        = Выборка.Рынок;
		РеквизитыШапки.Количество                   = Выборка.Количество;
		
		Если ЗначениеЗаполнено(Выборка.ЦеннаяБумага) Тогда
			РеквизитыШапки.ЦеннаяБумага = Выборка.ЦеннаяБумага;
		Иначе
			ОшибкиЧтения.Добавить("Не удалось определить ценную бумагу по коду во внешней системе [" + Выборка.Security_ID + "]!");
		КонецЕсли;

		Если ЗначениеЗаполнено(Выборка.Основание) Тогда
			РеквизитыШапки.ПогашениеЦеннойБумаги = Выборка.Основание;
		Иначе
			ОшибкиЧтения.Добавить("Не найден документ основание [Погашение ценной бумаги " + Выборка.ЦеннаяБумага + "]");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДепозитарныйСчет) Тогда
			РеквизитыШапки.ДепозитарныйСчет = Выборка.ДепозитарныйСчет;
		Иначе
			Если Выборка.КоличествоДепозитарныхСчетов = 0 Тогда
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Не найден " + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", "36-ой раздел.", "депозитарный счет по коду [" + Выборка.Depo_Storage_Place + "]!"));
			Иначе
				ОшибкиЧтения.Добавить("Не удалось определить место хранения ЦБ. Найдено несколько [" + Выборка.КоличествоДепозитарныхСчетов + "]" + ?(Выборка.Depo_Storage_Place = "СпецДЕП Т+", " 36-ых разделов.", " депозитраных счетов по коду [" + Выборка.Depo_Storage_Place + "]!"));
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрокаОперации.НовыеРеквизиты = Новый Структура("Шапка", РеквизитыШапки);
				
		Если ОшибкиЧтения.Количество() > 0 Тогда
			НоваяСтрокаОперации.Статус = "Ошибка чтения";
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеОперации = МВТ.Таблицы["_СписанияЦенныхБумагДанныеСистемы"].ПолучитьДанные().Выгрузить();
	
	Для каждого СтрокаТекущиеОперации Из ТекущиеОперации Цикл
		СтрокаТекущиеОперации.Ключ = СтрокаТекущиеОперации.Ключ + "/" + СтрокаТекущиеОперации.ЦеннаяБумага.Наименование + "/" + СтрокаТекущиеОперации.Количество;
	КонецЦикла;
	
	УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента);
	
	Возврат Операции;	
	
КонецФункции

Процедура ПодготовитьОбработкуОпераций_OTBR(ДокументМД, Операции, ПоляДокумента, Внебиржа = Ложь)
		
	Операции = Новый ТаблицаЗначений;
	Операции.Колонки.Добавить("Ключ");
	Операции.Колонки.Добавить("Статус");
	Операции.Колонки.Добавить("Описание");
	Операции.Колонки.Добавить("Ссылка");
	Операции.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	Операции.Колонки.Добавить("ТекущиеРеквизиты");
	Операции.Колонки.Добавить("НовыеРеквизиты");
	Операции.Колонки.Добавить("ОшибкиЧтения");
	Операции.Колонки.Добавить("КодВоВнешнейСистеме");
	
	ПоляДокумента = Новый Структура("Шапка", ПолучитьПоляОбъектаНаОснованииМетаданных(ДокументМД,,Внебиржа));
	
	Для каждого ТаблицаМД Из ДокументМД.ТабличныеЧасти Цикл
		ПоляДокумента.Вставить(ТаблицаМД.Имя, ПолучитьПоляОбъектаНаОснованииМетаданных(ТаблицаМД,,Внебиржа));
	КонецЦикла;
	
	ПоляДокумента.Вставить("ДопСведения", Новый ФиксированнаяСтруктура("РаскрытыйКонтрагент")); 
	
КонецПроцедуры

Процедура УстановитьСоответствияСТекущимиОперациями_OTBR(Операции, ТекущиеОперации, ПоляДокумента, РеквизитыИсключенныеИзСверки = "")
	
	ТекущиеОперации.Сортировать("Проведен УБЫВ");
	
	Для Каждого СтрокаТекущиеОперации Из ТекущиеОперации Цикл
		// соберем реквизиты текущей операции
		РеквизитыТекущейОперации = Новый Структура;
		
		Для Каждого НаборПолей Из ПоляДокумента Цикл
			
			Если НаборПолей.Ключ = "Шапка" Или НаборПолей.Ключ = "ДопСведения" Тогда
				
				Реквизиты = Новый Структура(НаборПолей.Значение);
				ЗаполнитьЗначенияСвойств(Реквизиты, СтрокаТекущиеОперации); 
				
			Иначе // табличная часть
				
				Реквизиты = Новый Массив;
				
				Для Каждого Строка Из СтрокаТекущиеОперации[НаборПолей.Ключ] Цикл
					РеквизитыСтроки = Новый Структура(НаборПолей.Значение);
					ЗаполнитьЗначенияСвойств(РеквизитыСтроки, Строка);
					
					Реквизиты.Добавить(РеквизитыСтроки);
				КонецЦикла;
				
			КонецЕсли;
		
			РеквизитыТекущейОперации.Вставить(НаборПолей.Ключ, Реквизиты);
		КонецЦикла;
		//17.11.22 брокер исполнил поручения несколькими переводами.
		Если НачалоДня(СтрокаТекущиеОперации.Дата) = Дата(2022,11,17) И ТипЗнч(СтрокаТекущиеОперации.Ссылка) = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда
			СтрокаОперации = Операции.НайтиСтроки(Новый Структура("Ключ, Статус", СтрокаТекущиеОперации.Ключ, "Новый"))[0];
		Иначе
			СтрокаОперации = Операции.Найти(СтрокаТекущиеОперации.Ключ, "Ключ");  //ТаблицаЗначений
		КонецЕсли;
				
		//Если (СтрокаОперации = Неопределено Или ЗначениеЗаполнено(СтрокаОперации.Ссылка)) или ((СтрокаОперации <> Неопределено) и (СтрокаОперации.Статус = "Ошибка чтения")) Тогда		
		Если (СтрокаОперации = Неопределено Или ЗначениеЗаполнено(СтрокаОперации.Ссылка)) Тогда
			
			НоваяСтрокаОперации = Операции.Добавить();
			НоваяСтрокаОперации.Ссылка                       = СтрокаТекущиеОперации.Ссылка;
			НоваяСтрокаОперации.Описание                     = "";
			НоваяСтрокаОперации.СчетДоверительногоУправления = СтрокаТекущиеОперации.СчетДоверительногоУправления;
			НоваяСтрокаОперации.Статус                       = "Отсутствует";
			НоваяСтрокаОперации.ТекущиеРеквизиты             = РеквизитыТекущейОперации;
			
		Иначе
			
			СтрокаОперации.Ссылка           = СтрокаТекущиеОперации.Ссылка; 
			СтрокаОперации.ТекущиеРеквизиты = РеквизитыТекущейОперации;
			НайтиРасхожденияИУстановитьСтатус(СтрокаОперации.НовыеРеквизиты, РеквизитыТекущейОперации, СтрокаОперации.Статус, СтрокаОперации.ОшибкиЧтения, РеквизитыИсключенныеИзСверки);

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЦеннуюБумагу(МатрихИД, ГруппаИмпортируемыхОбъектов)
		
	ИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
		
	ИмпортНСИ.Организация    = ЭтотОбъект.Организация;
	ИмпортНСИ.Подразделение  = Справочники.Подразделения.ГруппаКомпаний;
	ИмпортНСИ.Язык           = Справочники.Языки.Русский;
	ИмпортНСИ.ГруппаПравил   = "Матрих";
	ИмпортНСИ.ГруппаОбъектов = ГруппаИмпортируемыхОбъектов;
	
	ИмпортНСИ.НеСообщатьОСозданииНовыхОбъектов = Истина;
		
	ДанныеНовогоОбъекта = ИмпортНСИ.ПолучитьДанныеДляВыбора(МатрихИД);
	
	Если ДанныеНовогоОбъекта = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось загрузить ценную бумагу (" + ГруппаИмпортируемыхОбъектов + ") по коду матрих " + МатрихИД);
		Возврат;
	КонецЕсли;
	
	Если ДанныеНовогоОбъекта.Количество() > 0 Тогда
		
		Для Каждого НовыйОбъект Из ДанныеНовогоОбъекта Цикл
			
			СтрокаИмпортируемыйОбъект = ИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
			СтрокаИмпортируемыйОбъект.КодВоВнешнейСистеме = НовыйОбъект.Идентификатор;
			СтрокаИмпортируемыйОбъект.Объект			  = НовыйОбъект.Объект;
			ЗагруженныйОбъект = ИмпортНСИ.ИмпортироватьДанные();
			
			Если ЗагруженныйОбъект = Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось загрузить ценную бумагу по коду матрих [" + МатрихИД + "]");
			
			ИначеЕсли ТипЗнч(ЗагруженныйОбъект) = Тип("Массив") Тогда
				
				Если ЗагруженныйОбъект.Количество() = 1 Тогда
				
					МассивСообщений = ПолучитьСообщенияПользователю(Истина);
					ТекстСообщения = "";
					
					Для Каждого Сообщение Из МассивСообщений Цикл
						ТекстСообщения = ?(ТекстСообщения = "", "", ТекстСообщения + ". ") + Сообщение.Текст;	
					КонецЦикла;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загружена новая ценная бумага [" + ЗагруженныйОбъект[0].Наименование + "]. " + ТекстСообщения);				
					ИмпортНСИ.ИмпортируемыеОбъекты.Очистить();
				Иначе
					
					Для Каждого Объект Из ЗагруженныйОбъект Цикл
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при загрузке ценной бумаги. По коду матрих [" + МатрихИД + "] загружено " + ЗагруженныйОбъект.Количество() + " бумаг. [" + ЗагруженныйОбъект[0].Наименование + "]"); 
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По коду матрих [" + МатрихИД + "] не удалось найти ценную бумагу для загрузки.");
	КонецЕсли;	
	
КонецПроцедуры

Процедура СформироватьОповещение(ТемаСообщения, ТекстСообщения)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетыДанныхКОбработке.Текст КАК ТекстПисьма
		|ИЗ
		|	Справочник.ПакетыДанныхКОбработке КАК ПакетыДанныхКОбработке
		|ГДЕ
		|	ПакетыДанныхКОбработке.ДатаСоздания >= &ДатаИмпорта
		|	И ПакетыДанныхКОбработке.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо)
		|	И (ВЫРАЗИТЬ(ПакетыДанныхКОбработке.Тема КАК СТРОКА(100))) = (ВЫРАЗИТЬ(&ТемаСообщения КАК СТРОКА(100)))
		|	И НЕ ПакетыДанныхКОбработке.ОбработкаОтменена";
	
	Запрос.УстановитьПараметр("ДатаИмпорта", ЭтотОбъект.ДатаИмпорта);
	Запрос.УстановитьПараметр("ТемаСообщения", ТемаСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СтрНайти(Выборка.ТекстПисьма, ТекстСообщения) > 0 Тогда
			Возврат;		
		КонецЕсли;
		
	КонецЦикла;
		
	РеквизитыОповещения = Новый Структура("Тема, Текст", ТемаСообщения, ТекстСообщения);
	Справочники.Оповещения.СформироватьОповещения("Обработка._ИмпортОперацийБрокераБКРегион", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);

КонецПроцедуры

Функция ПолучитьХешСуммуМассива(Массив)
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	СуммыТекстом = СтрСоединить(Массив, ";");
	ХешированиеДанных.Добавить(СуммыТекстом);
	ХешСуммыДляКлюча = СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
	Возврат ХешСуммыДляКлюча;
КонецФункции

////////////////////////////////////////////////////////////////////////////////

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
