
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация") = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
		ЭтотОбъект.ТипИсходящегоДокумента = Перечисления.ТипыИсходящихДокументов.ИсходящийДокументДепозитарнойКомпании;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ЭтотОбъект.Метаданные().ТабличныеЧасти.Основания.Реквизиты.Основание.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда // ввод на основании
		
		СтрокаОснование = ЭтотОбъект.Основания.Добавить();
		СтрокаОснование.Основание = ДанныеЗаполнения;
		
		Если ДанныеЗаполнения.Метаданные().Реквизиты.Найти("Отправитель") <> Неопределено Тогда
			ЭтотОбъект.Получатель = ДанныеЗаполнения.Отправитель;
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВходящийДокумент") Тогда
			ЭтотОбъект.Договоры.Загрузить(ДанныеЗаполнения.Договоры.Выгрузить());
			ЭтотОбъект.Исполнитель = ДанныеЗаполнения.ОтветственныйСотрудник;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "ПоЛицензииДУ, ПоЛицензииУКПИФ, ПоСобственнойДеятельностиУК");
			Если ДанныеЗаполнения.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ОбращениеКлиента
				Или ДанныеЗаполнения.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ОбращениеПотенциальногоКлиента
				Или ДанныеЗаполнения.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ОбращениеИное Тогда
				ЭтотОбъект.Содержание = Документы.ИсходящийДокумент.ПолучитьСодержаниеОтветаНаОбращение(ТекущаяДатаСеанса(), ДанныеЗаполнения.Организация, ЭтотОбъект.Основания.ВыгрузитьКолонку("Основание"));
			КонецЕсли; 
		КонецЕсли; 
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВнесениеИзмененийВоВнутреннийПеречень") Тогда
			
			Если ДанныеЗаполнения.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Включение Тогда
			    ЭтотОбъект.ТипИсходящегоДокумента = Перечисления.ТипыИсходящихДокументов.УведомлениеОВключенииИнсайдераВСписок;
			ИначеЕсли ДанныеЗаполнения.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение Тогда
			    ЭтотОбъект.ТипИсходящегоДокумента = Перечисления.ТипыИсходящихДокументов.УведомлениеОбИсключенииИнсайдераИзСписка;
			Иначе
				ЭтотОбъект.ТипИсходящегоДокумента = Перечисления.ТипыИсходящихДокументов.ИноеУведомлениеИнсайдеру;
			КонецЕсли; 
			
			ЭтотОбъект.Получатель 				= ДанныеЗаполнения.Объект;
			ЭтотОбъект.Организация 				= ДанныеЗаполнения.Организация;
			
			ЭтотОбъект.ПоСобственнойДеятельностиУК = Истина;
			ЭтотОбъект.Исполнитель = РаботаСПользователями.ТекущийПользователь().ЮрФизЛицо;
		КонецЕсли;
				
	КонецЕсли;

	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТипИсходящегоДокумента <> Перечисления.ТипыИсходящихДокументов.ИсходящийДокументДепозитарнойКомпании Тогда
		
		ПроверяемыеРеквизиты.Добавить("Получатель");
		ПроверяемыеРеквизиты.Добавить("Исполнитель");
		
		Если ЭтотОбъект.ТипИсходящегоДокумента <> Перечисления.ТипыИсходящихДокументов.УведомлениеОбИсключенииИнсайдераИзСписка
		   И ЭтотОбъект.ТипИсходящегоДокумента <> Перечисления.ТипыИсходящихДокументов.УведомлениеОВключенииИнсайдераВСписок
		   И ЭтотОбъект.ТипИсходящегоДокумента <> Перечисления.ТипыИсходящихДокументов.ИноеУведомлениеИнсайдеру Тогда
			ПроверяемыеРеквизиты.Добавить("Описание");
		КонецЕсли;
	
	КонецЕсли;  
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	РаботаСДокументооборотом.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ЭтотОбъект.Ссылка.Пустая() Тогда 	
		
		// проверка зацикливания оснований
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Основания.Основание КАК Основание,
			|	Основания.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ _Основания
			|ИЗ
			|	&Основания КАК Основания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Основания.НомерСтроки КАК НомерСтроки,
			|	_Основания.Основание КАК Основание,
			|	ВходящийДокументОснования.Ссылка КАК ВходящийДокумент
			|ИЗ
			|	_Основания КАК _Основания
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийДокумент.Основания КАК ВходящийДокументОснования
			|		ПО _Основания.Основание = ВходящийДокументОснования.Ссылка
			|			И (ВходящийДокументОснования.Основание = &Ссылка)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Основания", ЭтотОбъект.Основания.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон("Данный документ является основанием для документа %1. Два документа не могут являться основаниями друг для друга", Выборка.ВходящийДокумент);
			Поле = СтрШаблон("Объект.Основания[%1].Основание", (Выборка.НомерСтроки - 1));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, Поле,, Отказ);
		
		КонецЦикла;
		
		// проверка последовательности дат документов
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Основания.НомерСтроки КАК НомерСтроки,
			|	_Основания.Основание КАК Основание
			|ИЗ
			|	_Основания КАК _Основания
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийДокумент КАК ВходящийДокумент
			|		ПО _Основания.Основание = ВходящийДокумент.Ссылка
			|			И (ВходящийДокумент.Дата > &ДатаДокумента)";
		
		Запрос.УстановитьПараметр("ДатаДокумента", ЭтотОбъект.Дата);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон("Данный документ введен на основании документа %1. Проверьте последовательность регистрации документов. Исходящий документ зарегистрирован ранее запроса", Выборка.Основание);
			Поле = СтрШаблон("Объект.Основания[%1].Основание", (Выборка.НомерСтроки - 1));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, Поле,, Отказ);
		
		КонецЦикла;
		 
	КонецЕсли;
	
КонецПроцедуры

