
&НаСервере
Процедура СформироватьПроверкуНаСервере()
	
	Если РольДоступна("ПолныеПрава") Тогда
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания, ЭтаФорма.Результат, ЭтаФорма.ОрганизацияВыбор);
	Иначе
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания,  ЭтаФорма.Результат, ПараметрыСеанса.ТекущаяОрганизация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПроверку(Команда)
	
	СформироватьПроверкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ОрганизацияВыбор = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Дата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Константы.ОсновнойКалендарьКотировок.Получить(), НачалоДня(НачалоДня(ТекущаяДата()) - 1));
	ЭтаФорма.Период.ДатаНачала = Дата;
	ЭтаФорма.Период.ДатаОкончания = Дата;
	
	ЭтаФорма.Элементы.Организация.Видимость = НЕ РольДоступна("ПолныеПрава");
	ЭтаФорма.Элементы.ОрганизацияВыбор.Видимость = РольДоступна("ПолныеПрава");
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПисьмаНаСервере()
	РеквизитФормыВЗначение("Объект").ПроверитьШкалыРейтинга(Новый Структура("ДатаНачала, ДатаОкончания", Период.ДатаНачала, Период.ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура Письма(Команда)
	ПисьмаНаСервере();
КонецПроцедуры
