
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	// начальное заполнение формы
	Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Дата		= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2);
	
	ВариантЗагрузкиПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Таблицы EXCEL (*.xls;*.xlsx)|*.xls;*.xlsx";

	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗагрузкиПриИзменении(Элемент)
	
	Элементы.НадписьВариантЗагрузки.Заголовок = ?(ВариантЗагрузки = 0, "ISIN ценной бумаги - в колонке 1 файла, ISIN аналога - в колонке 4", "ISIN ценной бумаги - в колонке 2 файла, ISIN аналога - в колонке 3");
	
	ВариантЗагрузкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВариантЗагрузкиПриИзмененииНаСервере()

	Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект(?(ВариантЗагрузки = 0, "ЮрФизЛицо_Транснефть", "ЮрФизЛицо_Стройкомплекс"));
	
КонецПроцедуры
	
#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура ЗагрузитьАналоги(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка отменена.");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьДатыЗапретаРедактированияНаСервере() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка отменена.");
		Возврат;
	КонецЕсли;
	
	РеквизитыОбработки = Новый Структура("Период, Организация, Клиент, Механизм, Сессия", Дата, Организация, Клиент, "ВнешняяОбработка._ЗагрузкаАналоговЦенныхБумагИзExcel", Неопределено);
	ЗарегистрироватьНачалоСессии(РеквизитыОбработки);
				
	Если Не ПрочитатьФайл() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка отменена.");
		Возврат;
	КонецЕсли;
	
	Состояние("Формирование документов");
	
	ОбработатьАналогиНаСервере();
	
	ТабДокумент = СформироватьПечатнуюФормуРезультатаНаСервере();
	
	ТабДокумент.Показать("Результат загрузки");
	
	ЗарегистрироватьОкончаниеСессии(РеквизитыОбработки);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Функция ПроверитьДатыЗапретаРедактированияНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Если есть хотя бы один из счетов ДУ с датой запрета, загрузку прерываем
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДУ
	|ПОМЕСТИТЬ _ДействующиеСчетаДУ
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|			&Период,
	|			СчетДоверительногоУправления.Организация = &Организация
	|				И Клиент = &Клиент
	|				И НЕ СчетДоверительногоУправления.ПометкаУдаления
	|				И СчетДоверительногоУправления.ДатаЗаключения <= &Период
	|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения > &Период)) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДУ,
	|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Организация = &Организация
	|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления В
	|			(ВЫБРАТЬ
	|				_ДействующиеСчетаДУ.СчетДУ
	|			ИЗ
	|				_ДействующиеСчетаДУ)
	|	И ДатыЗапретаРедактирования.ГруппаЗапрета = &ГруппаЗапрета
	|	И ДатыЗапретаРедактирования.ДатаЗапретаРедактирования >= &Период";
	
	Запрос.УстановитьПараметр("Период", 		ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", 	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Клиент", 		ЭтотОбъект.Клиент);
	Запрос.УстановитьПараметр("ГруппаЗапрета", 	Перечисления.ГруппыЗапретаРедактирования.БэкОфис);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отказ = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета ДУ " + СокрЛП(Выборка.СчетДУ) + " запрещено редактирование данных. Дата запрета редактирования " + Формат(Выборка.ДатаЗапретаРедактирования, "ДФ=dd.MM.yyyy"),,,, Отказ);
			
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не Отказ;
	
КонецФункции
	
&НаСервере
Процедура ОбработатьАналогиНаСервере()
	
	МассивАналогов = Новый Массив();

	НомерСтроки = 1;
	ТаблицаЦенныхБумаг = ВнешниеДанные.Выгрузить();
	ТаблицаЦенныхБумаг.Свернуть("ЦеннаяБумага,НомерГруппы");
	
	// Если дублей ЦБ нет, останется одна строка по каждой ценной бумаге
	// Далее будем это проверять и сообщать ошибки
		
	Для каждого СтрокаЦБ Из ТаблицаЦенныхБумаг Цикл					
		
		// Сначала получаем массив аналогов из одной группы, чтобы потом проверить дубли
		АналогиГруппы = Новый Массив;
		НайдСтрокиГруппы = ВнешниеДанные.НайтиСтроки(Новый Структура("ЦеннаяБумага, НомерГруппы", СтрокаЦБ.ЦеннаяБумага, СтрокаЦБ.НомерГруппы));
		Для Каждого НайдСтрокаГруппы Из НайдСтрокиГруппы Цикл						
			АналогиГруппы.Добавить(НайдСтрокаГруппы.Аналог); 			
		КонецЦикла; 
		
		НайдСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура("ЦеннаяБумага", СтрокаЦБ.ЦеннаяБумага));
		Аналоги = Новый Массив;
		ЕстьДублиСРазнымиНаборамиАналогов = Ложь;
		Для Каждого НайдСтрока Из НайдСтроки Цикл
			
			АналогаНетВМассиве = АналогиГруппы.Найти(НайдСтрока.Аналог) = Неопределено;
			Если НайдСтрока.НомерГруппы <> СтрокаЦБ.НомерГруппы И АналогаНетВМассиве Тогда
				ЕстьДублиСРазнымиНаборамиАналогов = Истина;
				Прервать;
			КонецЕсли;
			
			Если Аналоги.Найти(НайдСтрока.Аналог) = Неопределено Тогда
				Аналоги.Добавить(НайдСтрока.Аналог);
			КонецЕсли;
						
		КонецЦикла;  			
		
		Если ЕстьДублиСРазнымиНаборамиАналогов Тогда
			// Очищаем массив аналогов, по этой ЦБ ничего не будем загружать
			Аналоги.Очистить();
			Для Каждого НайдСтрока Из НайдСтроки Цикл
				НайдСтрока.ОписаниеОшибки = "Для строки " + СокрЛП(НайдСтрока.НомерСтроки) + " таблицы файла обнаружен дубль с другим аналогом. Аналоги для нее не загружены. Необходимо уточнить информацию у клиента"; 
			КонецЦикла;
		КонецЕсли;
		
		Если Аналоги.Количество() > 0 Тогда
			// Загружаем, только если найдены аналоги
			ДанныеДокумента = Новый Структура("ЦеннаяБумага, Аналоги", СтрокаЦБ.ЦеннаяБумага, Аналоги);  			
			МассивАналогов.Добавить(ДанныеДокумента);
		КонецЕсли;
		
	КонецЦикла;	
		
	Если МассивАналогов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для загрузки");
	Иначе
			
		СформироватьДокументыНаСервере(МассивАналогов);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена.");
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьФайл()
	
	Состояние("Обработка файла");
	
	ВнешниеДанные.Очистить();
	Отказ = Ложь;
	
	Попытка		
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);  	
		Excel.Sheets(1).Select();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	НомСтр = 1;	
	
	НомерКолонкиЦеннойБумаги = ?(ВариантЗагрузки = 0, 1, 2);
	НомерКолонкиАналога = ?(ВариантЗагрузки = 0, 4, 3);
	ТекущаяЦеннаяБумага = Неопределено;
	МассивАналогов = Новый Массив;
	КодЦеннойбумаги = "";
	КодАналога		= "";
	НайденКод       = Ложь;
	
	Пока НомСтр < 10000 Цикл  		
		
		ДанныеЦеннойБумаги = СокрЛП(Excel.Cells(НомСтр, НомерКолонкиЦеннойБумаги).Value);
		ДанныеАналога      = СокрЛП(Excel.Cells(НомСтр, НомерКолонкиАналога).Value); 
		
		ОбщаяСтрока = НРег(ДанныеЦеннойБумаги+ДанныеАналога);
		Если ПустаяСтрока(ОбщаяСтрока) И НомСтр > 10 Тогда
			// Конец таблицы
			ДобавитьСтрокиВоВнешниеДанные(ТекущаяЦеннаяБумага, МассивАналогов);
			Прервать;
		ИначеЕсли ПустаяСтрока(ОбщаяСтрока) Тогда 
			// Пустая строка перед таблицей
			НомСтр = НомСтр + 1;
			Продолжить;
		ИначеЕсли СтрНайти(ОбщаяСтрока, "ценн") > 0 Или  СтрНайти(ОбщаяСтрока, "аналог") > 0 Тогда
			// Шапка таблицы
			НомСтр = НомСтр + 1;
			Продолжить;
		КонецЕсли;
		
		НайденКод = Не ПустаяСтрока(КодЦеннойБумаги);
				
		КодЦеннойБумаги = ПолучитьКодЦеннойБумагиПоСтроке(ДанныеЦеннойБумаги, Ложь);
		КодАналога 		= ПолучитьКодЦеннойБумагиПоСтроке(ДанныеАналога, Истина);

		Если ((КодЦеннойБумаги <> Неопределено Или Не ПустаяСтрока(ДанныеЦеннойБумаги)) И ТекущаяЦеннаяБумага <> КодЦеннойБумаги) Или МассивАналогов.Количество() = 3 Тогда
			
			Если МассивАналогов.Количество() = 3 И ПустаяСтрока(ТекущаяЦеннаяБумага) И (Не НайденКод) И (Не ПустаяСтрока(ДанныеЦеннойБумаги)) Тогда 
				ДобавитьСтрокиВоВнешниеДанные("", МассивАналогов);
			Иначе
				ДобавитьСтрокиВоВнешниеДанные(?(ПустаяСтрока(ТекущаяЦеннаяБумага), КодЦеннойБумаги, ТекущаяЦеннаяБумага), МассивАналогов); 
			КонецЕсли;
			ТекущаяЦеннаяБумага = КодЦеннойБумаги; 
			
			НайденКод = Не ПустаяСтрока(КодЦеннойБумаги);
		
		КонецЕсли;
		
		Если КодАналога <> Неопределено Тогда
			МассивАналогов.Добавить(КодАналога);
		КонецЕсли;
		
		НомСтр = НомСтр + 1;
		
	КонецЦикла;	
	
	ДобавитьСтрокиВоВнешниеДанные(ТекущаяЦеннаяБумага, МассивАналогов);
			
	Excel.DisplayAlerts = 0;
	Excel.ActiveWorkbook.Close();
	Excel.DisplayAlerts = 1;
		
	Если ВнешниеДанные.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для загрузки!");
		Возврат Ложь;
	КонецЕсли;
	
	ВсеАналогиЗаполнены = ОбновитьВнешниеДанныеНаСервере();
	
	// Проверим и загрузим отсутствующие в базе аналоги
	Если Не ВсеАналогиЗаполнены Тогда 
		Состояние("Обновление данных по отсутствующим аналогам");
		ЗагрузитьОтсутствующиеАналогиИзMatrixНаСервере();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОбновитьВнешниеДанныеНаСервере()
	
	// Получим ссылки на ЦБ и аналоги
	МассивКодов = Новый Массив;
	Для Каждого СтрокаВнешниеДанные Из ВнешниеДанные Цикл
		Если ЗначениеЗаполнено(СтрокаВнешниеДанные.КодЦеннойБумаги) Тогда
			МассивКодов.Добавить(СтрокаВнешниеДанные.КодЦеннойБумаги);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВнешниеДанные.КодАналога) Тогда
			МассивКодов.Добавить(СтрокаВнешниеДанные.КодАналога);	
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаЦБИАналогов = ПолучитьЦенныеБумагиПоISINНаСервере(Дата, МассивКодов);
 
	Для Каждого ТекСтрокаЦБ Из ТаблицаЦБИАналогов Цикл
		
		// Поочередно заполняем ссылки на ЦБ и аналоги
		ЗаполнитьСсылкиНаЦенныеБумаги(ТекСтрокаЦБ, "КодЦеннойБумаги", 	"ЦеннаяБумага");
		ЗаполнитьСсылкиНаЦенныеБумаги(ТекСтрокаЦБ, "КодАналога", 		"Аналог");
		
	КонецЦикла;

	// Проверим, все ли ссылки на аналоги заполнены
	ВсеАналогиЗаполнены = Истина;
	Для Каждого ТекСтрокаВнешниеДанные Из ВнешниеДанные Цикл
		Если (ЗначениеЗаполнено(ТекСтрокаВнешниеДанные.КодАналога)) И Не ЗначениеЗаполнено(ТекСтрокаВнешниеДанные.Аналог) Тогда
			ВсеАналогиЗаполнены = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеАналогиЗаполнены;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьОтсутствующиеАналогиИзMatrixНаСервере()
	
	// Теперь получим коды аналогов, по которым не найдены бумаги, и загрузим эти аналоги из Matrix
	ТаблицаКодовДляПроверки = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(50);
	ТаблицаКодовДляПроверки.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",,,,КС));
	ТаблицаКодовДляПроверки.Колонки.Добавить("ВидСправочника", Новый ОписаниеТипов("Строка",,,,КС));  
	
	Для Каждого СтрокаВнешниеДанные Из ВнешниеДанные Цикл
		
		Если (Не ЗначениеЗаполнено(СтрокаВнешниеДанные.Аналог)) И ЗначениеЗаполнено(СтрокаВнешниеДанные.КодАналога) И ЗначениеЗаполнено(СтрокаВнешниеДанные.Ценнаябумага) Тогда
			
			НоваяСтрока = ТаблицаКодовДляПроверки.Добавить();	
			НоваяСтрока.Код = СтрокаВнешниеДанные.КодАналога;
			Если ТипЗнч(СтрокаВнешниеДанные.ЦеннаяБумага) = Тип("СправочникСсылка.Акции") Тогда
				ВидСправочника = "Акции";
			ИначеЕсли ТипЗнч(СтрокаВнешниеДанные.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
				ВидСправочника = "Облигации";
			ИначеЕсли ТипЗнч(СтрокаВнешниеДанные.ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
				ВидСправочника = "Паи";
			ИначеЕсли ТипЗнч(СтрокаВнешниеДанные.ЦеннаяБумага) = Тип("СправочникСсылка.ПроизводныеФинансовыеИнструменты") Тогда
				ВидСправочника = "ПроизводныеФинансовыеИнструменты";
			Иначе
				ВидСправочника = "Прочее";
			КонецЕсли;
			
			НоваяСтрока.ВидСправочника = ВидСправочника;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаКодовДляПроверки.Количество() > 0 Тогда
		РеквизитФормыВЗначение("Объект").НайтиИЗагрузитьЦенныеБумаги(ТаблицаКодовДляПроверки, Организация, Дата);
		ТаблицаАналогов = ПолучитьЦенныеБумагиПоISINНаСервере(Дата, ТаблицаКодовДляПроверки.ВыгрузитьКолонку("Код"));
 
		Для Каждого ТекСтрокаЦБ Из ТаблицаАналогов Цикл 			
			// Заполняем ссылки на аналоги
			ЗаполнитьСсылкиНаЦенныеБумаги(ТекСтрокаЦБ, "КодАналога", "Аналог"); 			
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСсылкиНаЦенныеБумаги(СтрокаЦеннойБумаги, НаименованиеКолонкиСКодом, НаименованиеКолонкиСЦеннойБумагой)
	
	НайдСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура(НаименованиеКолонкиСКодом, СтрокаЦеннойБумаги.Код));
	Для Каждого НайдСтрока Из НайдСтроки Цикл
		НайдСтрока[НаименованиеКолонкиСЦеннойБумагой] = СтрокаЦеннойБумаги.ЦеннаяБумага;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКодЦеннойБумагиПоСтроке(СтрЦеннаяБумага, ЭтоАналог = Ложь)

	Если ПустаяСтрока(СтрЦеннаяБумага) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ISIN = "";
	// Пробуем найти ISIN
	Если ЭтоАналог Тогда
		
		 //ISIN в готовом виде
		 ISIN = СтрЦеннаяБумага;
		
		//Если ВариантЗагрузки = 0 Тогда
		//	// Транснефть, ISIN в готовом виде
		//	ISIN = СтрЦеннаяБумага;
		//ИначеЕсли ВариантЗагрузки = 1 Тогда
		//	// Стройкомплекс, ISIN - до первого пробела в строке
		//	ПозицияПервогоПробела = СтрНайти(СтрЦеннаяБумага, " ");
		//	Если ПозицияПервогоПробела = 0 Тогда
		//		Возврат Неопределено;
		//	КонецЕсли;
		//	ISIN = Лев(СтрЦеннаяБумага, ПозицияПервогоПробела - 1);
		//КонецЕсли;
		
	Иначе
		
		Если ВариантЗагрузки = 0 Тогда
			// Транснефть, ISIN от последнего пробела до конца строки
			ПозицияПоследнегоПробела = СтрНайти(СтрЦеннаяБумага, " ", НаправлениеПоиска.СКонца);
			Если ПозицияПоследнегоПробела = 0 Тогда
				Возврат Неопределено;
			КонецЕсли;
			ISIN = Сред(СтрЦеннаяБумага, ПозицияПоследнегоПробела + 1);
		ИначеЕсли ВариантЗагрузки = 1 Тогда
			//Стройкомплекс, ISIN в готовом виде
		 	ISIN = СтрЦеннаяБумага;
			//// Стройкомплекс, ISIN - в скобках
			//ПозицияОткрывающейСкобки = СтрНайти(СтрЦеннаяБумага, "(");
			//ПозицияЗакрывающейСкобки = СтрНайти(СтрЦеннаяБумага, ")");
			//Если ПозицияОткрывающейСкобки = 0 Или ПозицияЗакрывающейСкобки = 0 Тогда
			//	Возврат Неопределено;
			//КонецЕсли;
			//ISIN = Сред(СтрЦеннаяБумага, ПозицияОткрывающейСкобки + 1, ПозицияЗакрывающейСкобки - ПозицияОткрывающейСкобки - 1);
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ISIN = "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ISIN;
			
КонецФункции

&НаКлиенте
Процедура ДобавитьСтрокиВоВнешниеДанные(КодЦеннойБумаги, МассивАналогов);
		
	ТекКоличество = ВнешниеДанные.Количество();
	
	НомерСтроки = ТекКоличество + 1; 	
	НомерГруппы = 1;
	
	Если ТекКоличество > 0 Тогда		
		НомерГруппы = ВнешниеДанные[ТекКоличество-1].НомерГруппы + 1;		
	КонецЕсли;
	
	Для Каждого ТекАналог Из МассивАналогов Цикл
		НоваяСтрокаВнешниеДанные = ВнешниеДанные.Добавить();
		НоваяСтрокаВнешниеДанные.НомерСтроки 		= НомерСтроки;
		НоваяСтрокаВнешниеДанные.НомерГруппы		= НомерГруппы;
		НоваяСтрокаВнешниеДанные.КодЦеннойБумаги	= ?(ПустаяСтрока(КодЦеннойБумаги), "НеНайден" + СокрЛП(ТекКоличество), КодЦеннойБумаги);
		НоваяСтрокаВнешниеДанные.КодАналога        	= ТекАналог;
		НомерСтроки	= НомерСтроки + 1;
	КонецЦикла;
	
	МассивАналогов.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенныеБумагиПоISINНаСервере(ТекДата, МассивКодов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
	|	КодыВТорговыхСистемахСрезПоследних.Код КАК Код
	|ИЗ
	|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Дата, ВидКода = &ВидКода) КАК КодыВТорговыхСистемахСрезПоследних
	|ГДЕ
	|	КодыВТорговыхСистемахСрезПоследних.Код В(&МассивКодов)";
	
	Запрос.УстановитьПараметр("Дата", 			ТекДата);
	Запрос.УстановитьПараметр("ВидКода", 		Перечисления.ВидыКодовВТорговыхСистемах.ISIN);
	Запрос.УстановитьПараметр("МассивКодов", 	МассивКодов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	
	
&НаСервере
Функция СформироватьДокументыНаСервере(МассивАналогов)
	
	Для Каждого ДанныеДокумента Из МассивАналогов Цикл
		Если Не ЗначениеЗаполнено(ДанныеДокумента.Ценнаябумага) Тогда
			Продолжить;
		КонецЕсли;
		
		СформироватьДокументРегистрацииАналоговНаСервере(ДанныеДокумента); 
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СформироватьДокументРегистрацииАналоговНаСервере(ДанныеДокумента)
	
	// Проверяем существующие документы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	АналогиЦенныхБумаг.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрСведений.АналогиЦенныхБумаг КАК АналогиЦенныхБумаг
	|ГДЕ
	|	АналогиЦенныхБумаг.Организация = &Организация
	|	И АналогиЦенныхБумаг.Клиент = &Клиент
	|	И АналогиЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
	|	И АналогиЦенныхБумаг.Период = &ДатаНачалаДействия";
	
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Клиент", 			Клиент);
	Запрос.УстановитьПараметр("ЦеннаяБумага", 		ДанныеДокумента.ЦеннаяБумага);
	Запрос.УстановитьПараметр("ДатаНачалаДействия", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.СоздатьДокумент();
		ДокументОбъект.Дата 				= Дата;
		ДокументОбъект.Организация 			= Организация;
		ДокументОбъект.Клиент 				= Клиент;
		ДокументОбъект.ДатаНачалаДействия 	= Дата;
		ДокументОбъект.ЦеннаяБумага 		= ДанныеДокумента.ЦеннаяБумага;
		ДокументОбъект.Ответственный		= РаботаСПользователями.ТекущийПользователь();
	КонецЕсли;
	
	ДокументОбъект.Аналоги.Очистить();
	Для Каждого Аналог Из ДанныеДокумента.Аналоги Цикл
		Если Не ЗначениеЗаполнено(Аналог) Тогда 
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ДокументОбъект.Аналоги.Добавить();
		НоваяСтрока.ЦеннаяБумага		  = Аналог;
		НоваяСтрока.Назначение			  = Назначение;
		НоваяСтрока.ДатаОкончанияДействия = Дата;
	КонецЦикла;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекОписаниеОшибки = ОписаниеОшибки();
		ТекСообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
		Для Каждого ТекСообщение Из ТекСообщенияПользователю Цикл
			ТекОписаниеОшибки = ТекОписаниеОшибки + Символы.ПС + ТекСообщение.Текст;
		КонецЦикла;
		
		ЗарегистрироватьОшибкуПроведенияДокумента(ДанныеДокумента.ЦеннаяБумага, ТекОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры   

&НаСервере
Процедура ЗарегистрироватьОшибкуПроведенияДокумента(ЦеннаяБумага, ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка выполнения'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах, Неопределено, ТекстОшибки);
	
	НайдСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура("ЦеннаяБумага", ЦеннаяБумага));
	Если НайдСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Записываем в первую строку для этой бумаги 
	НайдСтроки[0].ОписаниеОшибки = "Не создан документ регистрации аналогов: " + ТекстОшибки;
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуРезультатаНаСервере()

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	ТабДокумент		= Новый ТабличныйДокумент;
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаЦБ			= Макет.ПолучитьОбласть("СтрокаЦБ");
	ОбластьСтрокаАналога	= Макет.ПолучитьОбласть("СтрокаАналога");	
	ОбластьПодвал           = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Клиент = Клиент;
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	Сч = 1;
	ТаблицаЦенныхБумаг = ВнешниеДанные.Выгрузить();
	ТаблицаЦенныхБумаг.Свернуть("КодЦеннойБумаги, НомерГруппы");

	Для каждого СтрокаЦБ Из ТаблицаЦенныхБумаг Цикл					
		
		НайдСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура("КодЦеннойБумаги, НомерГруппы", СтрокаЦБ.КодЦеннойБумаги, СтрокаЦБ.НомерГруппы));
		
		Если НайдСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерВГруппе = 1;
		Для Каждого НайдСтрока Из НайдСтроки Цикл
			
			Если НомерВГруппе = 1 Тогда
				ОбластьСтрокаЦБ.Параметры.Заполнить(НайдСтрока);
				ОбластьСтрокаЦБ.Параметры.Сч = Сч;
			
				МассивОшибок = Новый Массив;
				Если (Не ЗначениеЗаполнено(НайдСтрока.КодЦеннойБумаги)) Или СтрНайти(НайдСтрока.КодЦеннойБумаги, "НеНайден") > 0 Тогда
					ОбластьСтрокаЦБ.Параметры.КодЦеннойбумаги = "";
					МассивОшибок.Добавить("Для строки " + СокрЛП(НайдСтрока.НомерСтроки) + " таблицы файла не найден ISIN ценной бумаги. Аналоги для нее не загружены");
				ИначеЕсли Не ЗначениеЗаполнено(НайдСтрока.ЦеннаяБумага) Тогда
				    МассивОшибок.Добавить("Для строки " + СокрЛП(НайдСтрока.НомерСтроки) + " таблицы файла не найдена ценная бумага по ISIN " + НайдСтрока.КодЦеннойБумаги + ". Аналоги для нее не загружены");
				КонецЕсли; 
			Иначе
				МассивОшибок = Новый Массив;
				ОбластьСтрокаАналога.Параметры.Заполнить(НайдСтрока);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НайдСтрока.КодАналога) Тогда
				МассивОшибок.Добавить("По строке " + СокрЛП(НайдСтрока.НомерСтроки) + " таблицы файла не найден ISIN аналога. Аналог не загружен");
			ИначеЕсли Не ЗначениеЗаполнено(НайдСтрока.Аналог) Тогда
			    МассивОшибок.Добавить("По строке " + СокрЛП(НайдСтрока.НомерСтроки) + " таблицы файла не найден аналог по ISIN " + НайдСтрока.КодАналога + ". Аналог не загружен");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайдСтрока.ОписаниеОшибки) Тогда
				МассивОшибок.Добавить(НайдСтрока.ОписаниеОшибки)
			КонецЕсли;
			
			ТекстОшибки = "";
			Если МассивОшибок.Количество() > 0 Тогда
				ТекстОшибки = СтрСоединить(Новый ФиксированныйМассив(МассивОшибок), Символы.ПС); 			
			КонецЕсли;
			
			Если НомерВГруппе = 1 Тогда
				ОбластьСтрокаЦБ.Параметры.ТекстОшибки = ТекстОшибки;
				ТабДокумент.Вывести(ОбластьСтрокаЦБ);
			Иначе
				ОбластьСтрокаАналога.Параметры.ТекстОшибки = ТекстОшибки;
				ТабДокумент.Вывести(ОбластьСтрокаАналога);
			КонецЕсли;
			
			НомерВГруппе = НомерВГруппе + 1;
			
		КонецЦикла;
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.ОтображатьСетку 	= Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ТолькоПросмотр 		= Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(РеквизитыОбработки)
	
	СтрСохраняемыеДанные = "Период,Организация,Клиент";
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, РеквизитыОбработки);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

&НаСервереБезКонтекста
Процедура ЗарегистрироватьНачалоСессии(РеквизитыОбработки)
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(РеквизитыОбработки);
	Механизм = РеквизитыОбработки.Механизм;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	РеквизитыОбработки.Вставить("Сессия", Сессия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(РеквизитыОбработки)
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(РеквизитыОбработки.Механизм, РеквизитыОбработки.Сессия);
	
КонецПроцедуры

#КонецОбласти

