
Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// блокирующие проверки
	ВидыАктивовКупон = Новый Массив;
	ВидыАктивовКупон.Добавить(Справочники.УчетныеАктивы.ЕврооблигацииКупон);
	ВидыАктивовКупон.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон);
	ВидыАктивовКупон.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон);
	ВидыАктивовКупон.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон);

	МассивСрокиДо2025 = Новый Массив;
	МассивСрокиДо2025.Добавить(Справочники.КлассификаторАктивовПоСрочности.СвышеГода);
	
	МассивСрокиПосле2025 = Новый Массив;
	МассивСрокиПосле2025.Добавить(Справочники.КлассификаторАктивовПоСрочности.ОтГодаДоДвух);
	МассивСрокиПосле2025.Добавить(Справочники.КлассификаторАктивовПоСрочности.ОтДвухДоТрехЛет);
	МассивСрокиПосле2025.Добавить(Справочники.КлассификаторАктивовПоСрочности.ОтТрехДоЧетырехЛет);
	МассивСрокиПосле2025.Добавить(Справочники.КлассификаторАктивовПоСрочности.ОтЧетырехДоПятиЛет); 
	МассивСрокиПосле2025.Добавить(Справочники.КлассификаторАктивовПоСрочности.СвышеПятиЛет);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// ВыделятьНалогПоДивидендам и СпособОтраженияДивидендов
		Если Запись.ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет ИЛИ Запись.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
			
			Запись.УчитыватьПереоценкуВСтоимости = (Запись.СчетУчета = Запись.СчетУчетаПереоценки);
			
		КонецЕсли;	
		
		// КлассификацияАктиваПоСрочности
		Если Запись.ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет И ЗначениеЗаполнено(Запись.КлассификацияАктиваПоСрочности) Тогда
			
			КлассификацияАктиваПоСрочностиРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.КлассификацияАктиваПоСрочности, "Родитель");
			
			Если ВидыАктивовКупон.Найти(Запись.УчетныйАктив) <> Неопределено Тогда // купоны
				Если КлассификацияАктиваПоСрочностиРодитель <> Справочники.КлассификаторАктивовПоСрочности.МетодикиКупона Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для актива " + Запись.УчетныйАктив + " классификатор по срочности '" + Запись.КлассификацияАктиваПоСрочности + "' недоступен",,,, Отказ);
				КонецЕсли;
			Иначе // актив
				Если КлассификацияАктиваПоСрочностиРодитель = Справочники.КлассификаторАктивовПоСрочности.МетодикиКупона
					Или КлассификацияАктиваПоСрочностиРодитель = Справочники.КлассификаторАктивовПоСрочности.ФиксированныеЗначения
				Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для актива " + Запись.УчетныйАктив + " классификатор по срочности '" + Запись.КлассификацияАктиваПоСрочности + "' недоступен",,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Запись.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет И ЗначениеЗаполнено(Запись.КлассификацияАктиваПоСрочности) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для вид учета " + Запись.ВидУчета + " заполнение классификатора актива по срочности недоступно",,,, Отказ);
			
		ИначеЕсли Запись.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет И ЗначениеЗаполнено(Запись.КлассификацияАктиваПоСрочности) Тогда	
			// Тех долг. 
			// Необходимо убрать Ресурс МетодикаРасчетаСрокаКупона, значение перенести в КлассификацияАктиваПоСрочности
			
			Если Запись.Период < '20250101' 
				И МассивСрокиПосле2025.Найти(Запись.КлассификацияАктиваПоСрочности) <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Классификатор актива по срочности '" + Запись.КлассификацияАктиваПоСрочности + "' недоступен до 2025 г.",,,, Отказ);
			ИначеЕсли Запись.Период >= '20250101'
				И МассивСрокиДо2025.Найти(Запись.КлассификацияАктиваПоСрочности) <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Классификатор актива по срочности '" + Запись.КлассификацияАктиваПоСрочности + "' недоступен после 2025  г.",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		//#422967
		Если Запись.ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда 
			Если Запись.ПереоцениватьВДеньОперации Тогда 
				ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Переоценивать в день операции' противоречит настройке 'Периодичность переоценки'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			Если Запись.ПереоцениватьВНерабочиеДни Тогда 
				ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Переоценивать в нерабочие дни' противоречит настройке 'Периодичность переоценки'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если Запись.ПериодичностьПереоценкиПереданныхВЗалог = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать
			И Запись.ПереоцениватьВЗалогеВНерабочиеДни Тогда 
			ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Переоценивать в залоге в нерабочие дни' противоречит настройке 'Периодичность переоценки переданных в залог'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры