
// Процедура установки типа и доступности субконто в зависимости от выбранного счета
//
Процедура ПриВыбореСчета(Организация, Счет, Форма, ПоляСубконто) Экспорт
	
	ДанныеСчета = БухгалтерскийУчет.ПолучитьСвойстваСчета(Счет);
	
	Для Индекс = 1 По РаботаСМетаданнымиПовтИсп.ПолучитьМаксимальноеКоличествоСубконто(Счет) Цикл
		Если Индекс <= ДанныеСчета.КоличествоСубконто Тогда
			Если ПоляСубконто.Свойство("Субконто" + Индекс) Тогда
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].Видимость                 = Истина;
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].АвтоотметкаНезаполненного = Не РаботаСМетаданнымиПовтИсп.НеПроверятьЗаполнениеСубконто(Организация, Счет, ДанныеСчета["ВидСубконто" + Индекс]);
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].ОграничениеТипа           = ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"];
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].Заголовок                 = ДанныеСчета["ВидСубконто" + Индекс + "Наименование"];
			КонецЕсли;
		Иначе 
			// Ничего делать не надо, т.к. не доступные поля будут скрыты
			Если ПоляСубконто.Свойство("Субконто" + Индекс) Тогда
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].Видимость                 = Ложь;
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].АвтоотметкаНезаполненного = Ложь;
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].ОграничениеТипа           = Новый ОписаниеТипов("Неопределено");
				Форма.Элементы[ПоляСубконто["Субконто" + Индекс]].Заголовок                 = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПриВыбореСчета

Процедура РасчетЭСПвExcel(Облигация, ДанныеПереоценки, ДанныеПокупки) Экспорт
	
	ЭСППоток = БухгалтерскийУчетЕПС.ПолучитьЭСПИДенежныйПотокДляОблигации(Облигация, ДанныеПереоценки, ДанныеПокупки);
	
	ExcelApp = Новый COMОбъект("Excel.Application");
	
	ExcelApp.Application.Workbooks.Add();
	
	xlBook = ExcelApp.Application.ActiveWorkbook;
	xlSheet = ExcelApp.Application.ActiveWorkbook.Sheets(1);
	
	xlSheet.Cells(1, 4).Value = "ЭСП 1с :";
	xlSheet.Cells(1, 5).Value = ЭСППоток.ЭСП;
	
	xlSheet.Cells(1, 1).Value = "ЭСП:";
	
	xlSheet.Cells(2, 1).Value = "Дата";
	xlSheet.Cells(2, 2).Value = "Сумма";
	
	xlSheet.Cells(3, 1).Value = ДанныеПокупки.ДатаПокупки;
	xlSheet.Cells(3, 2).Value = -(ДанныеПокупки.ЦенаПокупки + ДанныеПокупки.ЦенаПокупкиКупона) * ДанныеПокупки.Количество;
	
	Инд = 4;
	
	Для каждого СтрокаПотока Из ЭСППоток.Поток Цикл
		
		xlSheet.Cells(Инд, 1).Value = СтрокаПотока.Дата;
		xlSheet.Cells(Инд, 2).Value = СтрокаПотока.Поток * ДанныеПокупки.Количество;
		
		Инд = Инд + 1;
	
	КонецЦикла;
	
	xlSheet.Range("B1").FormulaLocal = "=ЧИСТВНДОХ(B3:B" + СокрЛП(Формат(Инд - 1, "ЧГ=")) + ";A3:A" + СокрЛП(Формат(Инд - 1, "ЧГ=")) + ")";
	xlSheet.Range("B1").NumberFormat = "0,0000000000%";
	
	ExcelApp.Application.Visible = True;
	
	
КонецПроцедуры
