
&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	СписокСчетовДУ = РеквизитФормыВЗначение("Отчет").ПолучитьСписокСчетовДУ(ЭтотОбъект.ОтчетПоКлиенту);

	Если СписокСчетовДУ.Количество() > 0 Тогда
		//возьмем настройки из Баланса, чтобы распределять результат по строкам:    
		НастройкиОтчетаБаланс = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Отчет.Период, СписокСчетовДУ[0], "РегламентированныйОтчетБаланс");
		РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ЭтотОбъект.Результат, НастройкиОтчетаБаланс, СписокСчетовДУ);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда) 
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	КомандаСформироватьНаСервере(); 
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат); 

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	Если Параметры.Свойство("СчетДоверительногоУправления") Тогда
		Отчет.СчетДоверительногоУправления = Параметры.СчетДоверительногоУправления;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Отчет.Период = Параметры.Период;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОтчетПоКлиенту = Ложь;
	НастроитьВидимостьДоступность();
	
	Если ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) 
		И ЗначениеЗаполнено(Отчет.Период) Тогда
		КомандаСформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоКлиентуПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	Элементы.Клиент.Видимость = ОтчетПоКлиенту;
	Элементы.СчетДоверительногоУправления.Видимость = Не ОтчетПоКлиенту;
	
	Если ОтчетПоКлиенту Тогда 
		Отчет.СчетДоверительногоУправления = "";
	Иначе
		Отчет.Клиент = "";
	КонецЕсли; 
	
КонецПроцедуры
