
Функция ПолучитьСостояниеПоследовательности(Отбор, РежимВосстановления, ИмяПоследовательности = "ОперацииПоСчетуДоверительногоУправления") Экспорт

	Если ИмяПоследовательности <> "ОперацииПоСчетуДоверительногоУправления" Тогда
		ВызватьИсключение "Восстановление последовательности " + ИмяПоследовательности + " не поддерживается";
	КонецЕсли;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
	
		ПараметрыСтатистики =
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
				Новый Структура, "",
				Новый Структура("Период, Организация, СчетДоверительногоУправления, ИмяПоследовательности", Отбор.Период, Отбор.Организация, Отбор.СчетДоверительногоУправления, ИмяПоследовательности)
			);
			
	Иначе
		
		ПараметрыСтатистики =
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
				Новый Структура, "",
				Новый Структура("Отбор, ИмяПоследовательности", Отбор, ИмяПоследовательности)
			);
			
	КонецЕсли;
			
	Механизм = Метаданные.Обработки.ВосстановлениеПоследовательностей.Имя + ".ПолучитьСостояниеПоследовательности";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	// точки актуальности -- это самый последний регистратор, на который может стать граница последовательности

	// при определении точки актуальности приходится добавлять отбор по Регистратор.Проведен, т.к. непроведенные
	// документы остаются в составе последовательности -- сэ ля ви
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда

		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументыПоследовательности.Организация КАК Организация,
			|	ДокументыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	МАКСИМУМ(ДокументыПоследовательности.Период) КАК Период
			|ПОМЕСТИТЬ _МаксПериодыПоследовательности
			|ИЗ
			|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ДокументыПоследовательности
			|ГДЕ
			|	&ОтборПоПроведенномуРегистратору
			|	И &ОтборПоПериоду
			|	И &ОтборПоОрганизации
			|	И &ОтборПоСчетуДоверительногоУправления
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокументыПоследовательности.Организация,
			|	ДокументыПоследовательности.СчетДоверительногоУправления";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОрганизации", "ДокументыПоследовательности.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", Отбор.Организация);
		
		УточнитьОтборПоПроведенномуРегистраторуВТекстеЗапроса(Запрос.Текст, РежимВосстановления);
		
		Если ЗначениеЗаполнено(Отбор.Период) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоПериоду", "ДокументыПоследовательности.Период <= &Период");
			Запрос.УстановитьПараметр("Период", КонецДня(Отбор.Период));
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоПериоду", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отбор.СчетДоверительногоУправления) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСчетуДоверительногоУправления", "ДокументыПоследовательности.СчетДоверительногоУправления В(&СчетДоверительногоУправления)");
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", Отбор.СчетДоверительногоУправления);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСчетуДоверительногоУправления", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Выполнить();
		
	ИначеЕсли ТипЗнч(Отбор) = Тип("ТаблицаЗначений") Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Отбор.Организация КАК Организация,
			|	Отбор.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	КОНЕЦПЕРИОДА(Отбор.Период, ДЕНЬ) КАК Период
			|ПОМЕСТИТЬ _Отбор
			|ИЗ
			|	&Отбор КАК Отбор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументыПоследовательности.Организация КАК Организация,
			|	ДокументыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	МАКСИМУМ(ДокументыПоследовательности.Период) КАК Период
			|ПОМЕСТИТЬ _МаксПериодыПоследовательности
			|ИЗ
			|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ДокументыПоследовательности
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Отбор КАК Отбор
			|		ПО ДокументыПоследовательности.Организация = Отбор.Организация
			|			И ДокументыПоследовательности.СчетДоверительногоУправления = Отбор.СчетДоверительногоУправления
			|			И ДокументыПоследовательности.Период <= Отбор.Период
			|ГДЕ
			|	&ОтборПоПроведенномуРегистратору
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокументыПоследовательности.Организация,
			|	ДокументыПоследовательности.СчетДоверительногоУправления";
		
		Запрос.УстановитьПараметр("Отбор", Отбор);
		
		УточнитьОтборПоПроведенномуРегистраторуВТекстеЗапроса(Запрос.Текст, РежимВосстановления);
		
		Запрос.Выполнить();
		
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_МаксПериодыПоследовательности.Организация КАК Организация,
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период КАК Период,
		|	МАКСИМУМ(ДокументыПоследовательности.Регистратор) КАК Регистратор
		|ПОМЕСТИТЬ _ТочкиАктуальности
		|ИЗ
		|	_МаксПериодыПоследовательности КАК _МаксПериодыПоследовательности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ДокументыПоследовательности
		|		ПО _МаксПериодыПоследовательности.Организация = ДокументыПоследовательности.Организация
		|			И _МаксПериодыПоследовательности.СчетДоверительногоУправления = ДокументыПоследовательности.СчетДоверительногоУправления
		|			И _МаксПериодыПоследовательности.Период = ДокументыПоследовательности.Период
		|			И (&ОтборПоПроведенномуРегистратору)
		|
		|СГРУППИРОВАТЬ ПО
		|	_МаксПериодыПоследовательности.Организация,
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТочкиАктуальности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.МоментВремени >= _ТочкиАктуальности.Регистратор.МоментВремени КАК Восстановлена,
		|	_ТочкиАктуальности.Период КАК ТочкаАктуальности_Период,
		|	_ТочкиАктуальности.Регистратор.МоментВремени КАК ТочкаАктуальности_МоментВремени,
		|	_ТочкиАктуальности.Регистратор КАК ТочкаАктуальности_Регистратор,
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.Период КАК ГраницаПоследовательности_Период,
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.МоментВремени КАК ГраницаПоследовательности_МоментВремени,
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.Регистратор КАК ГраницаПоследовательности_Регистратор
		|ИЗ
		|	_ТочкиАктуальности КАК _ТочкиАктуальности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления.Границы КАК ОперацииПоСчетуДоверительногоУправленияГраницы
		|		ПО _ТочкиАктуальности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления";	
	
	УточнитьОтборПоПроведенномуРегистраторуВТекстеЗапроса(Запрос.Текст, РежимВосстановления);
	
	СостояниеПоследовательности = Запрос.Выполнить().Выгрузить();
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат СостояниеПоследовательности;
	
КонецФункции

Процедура ВосстановитьПоследовательность(Период, Организация, СчетДоверительногоУправления, РежимВосстановления, Ошибки) Экспорт
	
	ПараметрыСтатистики =
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
			Новый Структура, "",
			Новый Структура("Период, Организация, СчетДоверительногоУправления, РежимВосстановления", Период, Организация, СчетДоверительногоУправления, РежимВосстановления)
		); 
	
	Механизм = Метаданные.Обработки.ВосстановлениеПоследовательностей.Имя + ".ВосстановитьПоследовательность";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	Ошибки = Новый Массив;
	
	НачатьТранзакцию();
	
	// блокировка последовательности
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Последовательность.ОперацииПоСчетуДоверительногоУправления");
	ЭлементБлокировки.УстановитьЗначение("Организация",                  Организация);
	ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Блокировка.Заблокировать();
	
	// восстановление последовательности
	Если РежимВосстановления = 1 Тогда // через проведение документов
		
		РезультатЗапроса = ВыбратьДокументыПоследовательностиДляПроведения(Период, Организация, СчетДоверительногоУправления);
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Попытка
				Документ = Выборка.Регистратор.ПолучитьОбъект();
				Документ.ДополнительныеСвойства.Вставить("ГрупповоеПроведение", Истина);
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Ошибки.Добавить("Ошибка проведения документа " + Документ + ". Система сообщает: " + ОписаниеОшибки());
				Прервать;
			КонецПопытки;
			
		КонецЦикла;
	
	ИначеЕсли РежимВосстановления = 2 Тогда // через контроль отрицательных остатков и сдвиг границы
		
		// еще раз получим состояние последовательности, а то вдруг оно изменилось
		Отбор = Новый Структура("Организация, СчетДоверительногоУправления, Период",
			Организация, СчетДоверительногоУправления, Период);
		
		СостояниеПоследовательности = ПолучитьСостояниеПоследовательности(Отбор, РежимВосстановления);
		
		Если СостояниеПоследовательности.Количество() <> 1 Тогда
			ВызватьИсключение "Ошибка определения состояния последовательности";
		КонецЕсли;
		
		СостояниеПоследовательности = СостояниеПоследовательности[0];
		
		Если СостояниеПоследовательности.ГраницаПоследовательности_МоментВремени.Сравнить(СостояниеПоследовательности.ТочкаАктуальности_МоментВремени) = -1 Тогда // последовательность не восстановлена
			
			ПериодПроверкиОстатков =
				Новый СтандартныйПериод(
						НачалоДня(СостояниеПоследовательности.ГраницаПоследовательности_Период),
						КонецДня(СостояниеПоследовательности.ТочкаАктуальности_Период)
				);
			
			ОтрицательныеОстатки = НайтиОтрицательныеОстаткиПоРегистрамПоследовательностиЧерезОстаткиИОбороты(ПериодПроверкиОстатков, Организация, СчетДоверительногоУправления);
			
			Если ОтрицательныеОстатки.Количество() > 0 Тогда
				// выводим только одну, самую первую ошибку
				СтрокаОтрицательныеОстатки = ОтрицательныеОстатки[0];
				Ошибки.Добавить(
					"Найден отрицательный остаток в " + СтрокаОтрицательныеОстатки.Регистр + " на " + Формат(СтрокаОтрицательныеОстатки.Период, "ДФ=dd.MM.yyyy") + ":
					|	" + СтрСоединить(СтрокаОтрицательныеОстатки.ЗначенияПолей, Символы.ПС + Символы.Таб)
				);
			Иначе
				// в случае, если мы проверяем остатки более чем за один день, границу последовательности можно было бы установить 
				// на предыдущий день, относительно первого найденного отрицательного остатка, но процесс довольно быстрый, а день,
				// когда были регистраторы, на которые можно установить последовательность еще нужно найти, так что пока живем так
				УстановитьГраницуПоследовательностиНаПоследнийДокумент(СостояниеПоследовательности.ТочкаАктуальности_Период, Организация, СчетДоверительногоУправления, РежимВосстановления);
			КонецЕсли;
			
		КонецЕсли;
			
	Иначе
			
		ВызватьИсключение "Режим восстановления последовательности " + РежимВосстановления + " не поддерживается";
			
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, Ошибки.Количество() > 0);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Функция ВыбратьДокументыПоследовательностиДляПроведения(Период, Организация, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Период) КАК Период
		|ПОМЕСТИТЬ _МаксПериодыПоследовательности
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.Организация = &Организация
		|	И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииПоСчетуДоверительногоУправления.Период <= &Период
		|	И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период КАК Период,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Регистратор.Ссылка) КАК Регистратор
		|ПОМЕСТИТЬ _ТочкиАктуальности
		|ИЗ
		|	_МаксПериодыПоследовательности КАК _МаксПериодыПоследовательности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ПО _МаксПериодыПоследовательности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|			И _МаксПериодыПоследовательности.Период = ОперацииПоСчетуДоверительногоУправления.Период
		|			И (ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОперацииПоСчетуДоверительногоУправления.Регистратор КАК Регистратор
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТочкиАктуальности КАК _ТочкиАктуальности
		|		ПО ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = _ТочкиАктуальности.СчетДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления.Границы КАК ОперацииПоСчетуДоверительногоУправленияГраницы
		|		ПО ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.МоментВремени > ОперацииПоСчетуДоверительногоУправленияГраницы.МоментВремени
		|	И ОперацииПоСчетуДоверительногоУправления.МоментВремени <= _ТочкиАктуальности.Регистратор.МоментВремени
		|	И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.МоментВремени";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправления.Период <= &Период", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // ВыбратьДокументыПоследовательностиДляПроведения

Функция НайтиОтрицательныеОстаткиПоРегистрамПоследовательностиЧерезОстаткиИОбороты(Знач Период, Организация, СчетаДоверительногоУправления)
	
	// вот такая ошибка возникает, если выбрать отрицательные остатки из ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты
	// по всем действующим счетам д/у РЭМ-а за период с 01.01.2026 по 13.05.2026 с группировкой по дням по всем измерениям
	//
	//		//Ошибка при вызове метода контекста (Выполнить)
	//		//{ВнешняяОбработка.КонтрольОтрицательныхОстатковПоследовательности.Форма.Форма.Форма(172)}:РезультатЗапроса = Запрос.Выполнить();
	//		//{ВнешняяОбработка.КонтрольОтрицательныхОстатковПоследовательности.Форма.Форма.Форма(360)}:НайтиОтрицательныеОстаткиПоРегистрамПоследовательностиЧерезОстаткиИОбороты();
	//		//
	//		//по причине:
	//		//Ошибка выполнения запроса
	//		//по причине:
	//		//Недостаточно памяти для получения результата запроса к базе данных
	// 
	// ВАЖНО! На большимх периодах лучше отбирать по одному счету д/у
	
	Если ТипЗнч(Период) = Тип("Дата") Тогда
		Период = Новый СтандартныйПериод(Период, Период);
	КонецЕсли;
	
	ВремяНачалаВыполнения = ТекущаяДатаСеанса();
	
	ОтрицательныеОстаткиПоРегистрамНакопления = Новый ТаблицаЗначений;
	ОтрицательныеОстаткиПоРегистрамНакопления.Колонки.Добавить("Период");
	ОтрицательныеОстаткиПоРегистрамНакопления.Колонки.Добавить("Организация");
	ОтрицательныеОстаткиПоРегистрамНакопления.Колонки.Добавить("СчетДоверительногоУправления");
	ОтрицательныеОстаткиПоРегистрамНакопления.Колонки.Добавить("Регистр");
	ОтрицательныеОстаткиПоРегистрамНакопления.Колонки.Добавить("ЗначенияПолей");
	
	РегистрыНакопленияВПоследовательности = Новый Массив;
	
	Для каждого РегистрМД Из Метаданные.Последовательности.ОперацииПоСчетуДоверительногоУправления.Движения Цикл
		Если Метаданные.РегистрыНакопления.Содержит(РегистрМД) Тогда
			РегистрыНакопленияВПоследовательности.Добавить(РегистрМД);
		КонецЕсли;
	КонецЦикла;
	
	ШаблонЗапрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрНакопленияОстаткиИОбороты.Период КАК Период,
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	#РегистрНакопленияОстаткиИОбороты# КАК РегистрНакопленияОстаткиИОбороты
		|ГДЕ
		|	&РесурсыКонечныйОстатокМеньшеНуля
		|ИТОГИ ПО
		|	Период";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",                   Организация);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоПериода",                 Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",                  КонецДня(Период.ДатаОкончания));
	
	Для каждого РегистрНакопленияМД Из РегистрыНакопленияВПоследовательности Цикл
		
		РесурсыКонечныйОстатокМеньшеНуля = Новый Массив;
		
		Для каждого ПолеМД Из РегистрНакопленияМД.Ресурсы Цикл
			РесурсыКонечныйОстатокМеньшеНуля.Добавить("РегистрНакопленияОстаткиИОбороты." + ПолеМД.Имя + "КонечныйОстаток < 0");
		КонецЦикла;
		
		Запрос.Текст = СтрЗаменить(ШаблонЗапрос, "#РегистрНакопленияОстаткиИОбороты#", "РегистрНакопления." + РегистрНакопленияМД.Имя + ".ОстаткиИОбороты(&НачалоПериода, &КонецПериода, ДЕНЬ,, Организация = &Организация И СчетДоверительногоУправления В(&СчетаДоверительногоУправления))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РесурсыКонечныйОстатокМеньшеНуля", СтрСоединить(РесурсыКонечныйОстатокМеньшеНуля, " ИЛИ "));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПериод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПериод.Следующий() Цикл
			
			Выборка = ВыборкаПериод.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				// очень не хочется, чтобы портился порядок выборки, поэтому определим массив структур
				ЗначенияПолейВыборки = Новый Массив;
				
				Для каждого ПолеВыборки Из РезультатЗапроса.Колонки Цикл
					Если ПолеВыборки.Имя = "Период" Или ПолеВыборки.Имя = "Период1" // поле "Период1" добавляется, когда уже есть поле "Период" и раскрывается "*"
							Или ПолеВыборки.Имя = "Организация" Или ПолеВыборки.Имя = "СчетДоверительногоУправления"
							Или СтрЗаканчиваетсяНа(ПолеВыборки.Имя, "Оборот")
					Тогда
						Продолжить;
					КонецЕсли;
					ЗначенияПолейВыборки.Добавить(ПолеВыборки.Имя + ": " + Выборка[ПолеВыборки.Имя]);
				КонецЦикла;
				
				НоваяСтрокаОтрицательныеОстатки = ОтрицательныеОстаткиПоРегистрамНакопления.Добавить();
				НоваяСтрокаОтрицательныеОстатки.Период                       = Выборка.Период;
				НоваяСтрокаОтрицательныеОстатки.Организация                  = Выборка.Организация;
				НоваяСтрокаОтрицательныеОстатки.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
				НоваяСтрокаОтрицательныеОстатки.Регистр                      = РегистрНакопленияМД.ПолноеИмя();
				НоваяСтрокаОтрицательныеОстатки.ЗначенияПолей                = ЗначенияПолейВыборки;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОтрицательныеОстаткиПоРегистрамНакопления;
	
КонецФункции

Процедура УстановитьГраницуПоследовательностиНаПоследнийДокумент(Знач Период, Организация, СчетДоверительногоУправления, РежимВосстановления)
	
	Если ТипЗнч(Период) = Тип("СтандартныйПериод") Тогда
		Период = КонецДня(Период.ДатаОкончания);
	Иначе
		Период = КонецДня(Период);
	КонецЕсли;
	
	// найдем последний документ в последовательности на конец периода и установим на него границу
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыПоследовательности.МоментВремени КАК МоментВремени,
		|	ДокументыПоследовательности.Регистратор КАК Регистратор
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ДокументыПоследовательности
		|ГДЕ
		|	ДокументыПоследовательности.Организация = &Организация
		|	И ДокументыПоследовательности.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ДокументыПоследовательности.Период < &Период
		|	И &ОтборПоПроведенномуРегистратору
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументыПоследовательности.МоментВремени УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", НачалоДня(Период + 86400));
	
	УточнитьОтборПоПроведенномуРегистраторуВТекстеЗапроса(Запрос.Текст, РежимВосстановления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Последовательности.ОперацииПоСчетуДоверительногоУправления.УстановитьГраницу(
			Выборка.МоментВремени, Новый Структура("Организация, СчетДоверительногоУправления", Организация, СчетДоверительногоУправления));
	КонецЕсли;
	
КонецПроцедуры

Процедура УточнитьОтборПоПроведенномуРегистраторуВТекстеЗапроса(ТекстЗапроса, РежимВосстановления)
	
	Если      РежимВосстановления = 1 Тогда
		// в состав последовательности могут быть включены непроведенные документы
		// если последовательность восстанавливается через проведение, а последний документ в
		// дне непроведен, то граница на неё никогда не станет, а значит непроведенные документы
		// при расчете точки актуальности нужно исключить, что существенно увеличивает время
		// выполнения запроса
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоПроведенномуРегистратору", "ДокументыПоследовательности.Регистратор.Проведен");
	ИначеЕсли РежимВосстановления = 2 Тогда
		// если последовательность восстанавливается через контроль отрицательных остатков,
		// то мы просто ставим границу последовательности на последний документ в дне
		// и неважно, проведен он или нет -- работает быстро
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоПроведенномуРегистратору", "ИСТИНА");
	Иначе
		ВызватьИсключение "Режим восстановления последовательности " + РежимВосстановления + " не поддерживается";
	КонецЕсли;
	
КонецПроцедуры
