
Функция ВыбратьНевосстановленныеПоследовательностиПоНаборуЗаписей(НаборЗаписей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КОНЕЦПЕРИОДА(НаборЗаписей.ДатаЗапретаРедактирования, ДЕНЬ) КАК Период
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|ГДЕ
		|	НаборЗаписей.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Период) КАК Период
		|ПОМЕСТИТЬ _МаксПериодыПоследовательности
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаборЗаписей КАК _НаборЗаписей
		|		ПО ОперацииПоСчетуДоверительногоУправления.Организация = _НаборЗаписей.Организация
		|			И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = _НаборЗаписей.СчетДоверительногоУправления
		|			И ОперацииПоСчетуДоверительногоУправления.Период <= _НаборЗаписей.Период
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период КАК Период,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Регистратор.Ссылка) КАК Регистратор
		|ПОМЕСТИТЬ _ТочкиАктуальности
		|ИЗ
		|	_МаксПериодыПоследовательности КАК _МаксПериодыПоследовательности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ПО _МаксПериодыПоследовательности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|			И _МаксПериодыПоследовательности.Период = ОперацииПоСчетуДоверительногоУправления.Период
		|			И (ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТочкиАктуальности.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	_ТочкиАктуальности КАК _ТочкиАктуальности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления.Границы КАК ОперацииПоСчетуДоверительногоУправленияГраницы
		|		ПО _ТочкиАктуальности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.МоментВремени < _ТочкиАктуальности.Регистратор.МоментВремени";
		
	Возврат Запрос.Выполнить();
	
КонецФункции // ВыбратьНевосстановленныеПоследовательностиПоНаборуЗаписей

Функция ПолучитьСостоянияПоследовательностиОперацийПоСчетамДоверительногоУправления(Организация, СчетаДоверительногоУправления, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Период) КАК Период
		|ПОМЕСТИТЬ _МаксПериодыПоследовательности
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.Организация = &Организация
		|	И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления В(&СчетДоверительногоУправления)
		|	И ОперацииПоСчетуДоверительногоУправления.Период <= &Период
		|	И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период КАК Период,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Регистратор.Ссылка) КАК Регистратор
		|ПОМЕСТИТЬ _ТочкиАктуальности
		|ИЗ
		|	_МаксПериодыПоследовательности КАК _МаксПериодыПоследовательности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ПО _МаксПериодыПоследовательности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|			И _МаксПериодыПоследовательности.Период = ОперацииПоСчетуДоверительногоУправления.Период
		|			И (ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТочкиАктуальности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ОперацииПоСчетуДоверительногоУправленияГраницы.МоментВремени >= _ТочкиАктуальности.Регистратор.МоментВремени
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Восстановлена,
		|	_ТочкиАктуальности.Период КАК ТочкаАктуальности_Период,
		|	_ТочкиАктуальности.Регистратор.МоментВремени КАК ТочкаАктуальности_МоментВремени,
		|	_ТочкиАктуальности.Регистратор КАК ТочкаАктуальности_Регистратор,
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.Период КАК ГраницаПоследовательности_Период,
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.МоментВремени КАК ГраницаПоследовательности_МоментВремени,
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.Регистратор КАК ГраницаПоследовательности_Регистратор
		|ИЗ
		|	_ТочкиАктуальности КАК _ТочкиАктуальности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления.Границы КАК ОперацииПоСчетуДоверительногоУправленияГраницы
		|		ПО _ТочкиАктуальности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	
	Если Не ЗначениеЗаполнено(СчетаДоверительногоУправления) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления В(&СчетДоверительногоУправления)", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправления.Период <= &Период", "");
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьСостоянияПоследовательностиОперацийПоСчетамДоверительногоУправления

Процедура ВосстановитьПоследовательностиПоСчетамДоверительногоУправления(Организация, СчетаДоверительногоУправления, Период, ВыполненоСОшибками = Ложь) Экспорт
	
	ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Новый Структура, "", Новый Структура("Организация, Период", Организация, Период)); 
	Механизм = Метаданные.Обработки.ВосстановлениеПоследовательностей.Имя;
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	ДанныеДляСтатистики = Новый Структура("СчетаДоверительногоУправления", "");
	ТекстОшибки = "";
	
	Для Каждого СчетДоверительногоУправления Из СчетаДоверительногоУправления Цикл
		
		ДанныеДляСтатистики.СчетаДоверительногоУправления = ДанныеДляСтатистики.СчетаДоверительногоУправления + СчетДоверительногоУправления.Наименование + Символы.ПС; 
		// получим актуальные данные по последовательности
		РезультатЗапроса = ВыбратьДокументыПоследовательностиДляПроведения(Организация, СчетДоверительногоУправления, Период);
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Попытка
				Документ = Выборка.Регистратор.ПолучитьОбъект();
				Документ.ДополнительныеСвойства.Вставить("ГрупповоеПроведение", Истина);
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
				ВыполненоСОшибками = Истина;
				ТекстОшибки = ТекстОшибки + Символы.ПС + "Ошибка проведения документа " + Документ + ". Система сообщает: " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Документ);
				Прервать;
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
		
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, ДанныеДляСтатистики, ?(ТекстОшибки = "", Неопределено, ТекстОшибки));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Функция ВыбратьДокументыПоследовательностиДляПроведения(Организация, СчетДоверительногоУправления, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Период) КАК Период
		|ПОМЕСТИТЬ _МаксПериодыПоследовательности
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.Организация = &Организация
		|	И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииПоСчетуДоверительногоУправления.Период <= &Период
		|	И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период КАК Период,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Регистратор.Ссылка) КАК Регистратор
		|ПОМЕСТИТЬ _ТочкиАктуальности
		|ИЗ
		|	_МаксПериодыПоследовательности КАК _МаксПериодыПоследовательности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ПО _МаксПериодыПоследовательности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|			И _МаксПериодыПоследовательности.Период = ОперацииПоСчетуДоверительногоУправления.Период
		|			И (ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	_МаксПериодыПоследовательности.СчетДоверительногоУправления,
		|	_МаксПериодыПоследовательности.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОперацииПоСчетуДоверительногоУправления.Регистратор КАК Регистратор
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТочкиАктуальности КАК _ТочкиАктуальности
		|		ПО ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = _ТочкиАктуальности.СчетДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления.Границы КАК ОперацииПоСчетуДоверительногоУправленияГраницы
		|		ПО ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.МоментВремени > ОперацииПоСчетуДоверительногоУправленияГраницы.МоментВремени
		|	И ОперацииПоСчетуДоверительногоУправления.МоментВремени <= _ТочкиАктуальности.Регистратор.МоментВремени
		|	И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.МоментВремени";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправления.Период <= &Период", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // ВыбратьДокументыПоследовательностиДляПроведения
