#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	Отчет.Период		= Новый СтандартныйПериод(НачалоМесяца(ТекущаяДата()), ТекущаяДата());
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры
	
#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ОткрытьExcel(Команда)

	Если Элементы.Результат.ОтображениеСостояния.Видимость Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчёт не сформирован");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Куда сохранить?"; 
	
	Если НЕ Диалог.Выбрать() Тогда 
		Возврат;
	КонецЕсли;
	
	Версия = 1;
	Расширение = "xlsx";
	
	ШаблонФайла	= Диалог.Каталог + "\" + СтрШаблон("Список сотрудников для обучения %1 на %2", Отчет.Организация, Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	ИмяФайла =  ШаблонФайла + " ver." + Строка(Версия) + "." + Расширение;
		
	Если СтрДлина(ИмяФайла) > 255 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Длина файла превышает 255 символов. Сохранение отчёта невозможно. " + ИмяФайла);
		Возврат;
	КонецЕсли;	
	
	ПроверяемыйФайл = Новый Файл(ИмяФайла);
	Пока ПроверяемыйФайл.Существует() Цикл
		Версия = Версия + 1;
		ИмяФайла =  ШаблонФайла + " ver." + Строка(Версия) + "." + Расширение;
		ПроверяемыйФайл = Новый Файл(ИмяФайла);
	КонецЦикла;
	
	Если КаталогСуществует(ИмяФайла) Тогда	
		Результат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	Иначе
		Предупреждение("Не удалось сохранить файл: " + ИмяФайла);
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Открыть сохранённый файл?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КаталогСуществует(ИмяФайла)
	
	Отказ = Ложь;
	
	СохраняемыйФайл		= Новый Файл(ИмяФайла);
	ПроверяемыйКаталог	= Новый Файл(СохраняемыйФайл.Путь);
		
	Если НЕ ПроверяемыйКаталог.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сохранить отчёт, нет доступа к каталогу: " + СохраняемыйФайл.Путь,,,, Отказ);
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти