
Функция СформироватьНаименование(РеквизитыДоговора, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "Банк, НомерКредитногоДоговора, ДатаКредитногоДоговора";
	
	Если РеквизитыДоговора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаименованиеДоговора = "";
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.Банк) И Не ПустаяСтрока(РеквизитыДоговора.НомерКредитногоДоговора) И ЗначениеЗаполнено(РеквизитыДоговора.ДатаКредитногоДоговора) Тогда
		НаименованиеДоговора = "" + РеквизитыДоговора.Банк + ", № " + СокрЛП(РеквизитыДоговора.НомерКредитногоДоговора) + " от " + Формат(РеквизитыДоговора.ДатаКредитногоДоговора, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат НаименованиеДоговора;
	
КонецФункции // СформироватьНаименованиеДоговора
