
&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть(Новый Структура("Настройка, ЗначениеНастройки, Отключить", ЭтотОбъект.Настройка, ЭтотОбъект.ЗначениеНастройки, ЭтотОбъект.Отключить));
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ДенежныйПотокПоОблигации") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура("Владелец", ЭтаФорма.ЦеннаяБумага);
		ПараметрыФормы = Новый Структура("Отбор", Отбор);
		ФормаВыбора = ОткрытьФорму("Справочник.ДенежныеПотокиПоОблигациям.ФормаВыбора", ПараметрыФормы, Элемент);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЦеннаяБумага") Тогда
		ЭтаФорма.ЦеннаяБумага = Параметры.ЦеннаяБумага;
	КонецЕсли;

КонецПроцедуры
