
////////////////////////////////////////////////////////////////////////////////
// "ПЕРЕКРЫТЫЕ" ФУНКЦИИ ОБЩЕГО МОДУЛЯ "ИНТЕГРАЦИЯ"

Функция ADODBC_ВыгрузитьЗаписиИзНабораВТаблицуЗначений(НаборЗаписей, Параметры = Неопределено, Ошибки)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Поля         = Новый Массив();
	ПоляФункции  = Новый Массив();
	ПоляВыражения = Новый Массив();
	
	Попытка
		ПоляЗаписи = НаборЗаписей.Fields;
		
		// создадим колонки таблицы значений
		Для НомПоля = 0 По ПоляЗаписи.Count - 1 Цикл
			ПолеЗаписи = ПоляЗаписи.Item(НомПоля);
			
			ИмяПоля = ПолеЗаписи.Name;
			Если      Лев(ИмяПоля, 2) = "$$" Тогда // это поле содержит вызов функции
				ИмяПоля = Сред(ИмяПоля, 3);
				ПоляФункции.Добавить(ИмяПоля);
			ИначеЕсли Лев(ИмяПоля, 1) = "$"  Тогда // это поле содержит обращение к параметру или предопределенному значению
				ИмяПоля = Сред(ИмяПоля, 2);
				ПоляВыражения.Добавить(ИмяПоля);
			КонецЕсли;
			
			ОписаниеТипа = Неопределено;
			
			// выделим тип из имени поля
			ПозРазделителяТипа = Найти(ИмяПоля, ":");
			Если ПозРазделителяТипа > 0 Тогда
				ПредставлениеТипа = НРег(Сред(ИмяПоля, ПозРазделителяТипа + 1));
				
				Если Лев(ПредставлениеТипа, 6) = "строка" Тогда
					ДлинаСтроки = 0; // неограниченная
					
					ПозРазделителяДлины = Найти(ПредставлениеТипа, ":");
					Если ПозРазделителяДлины > 0 Тогда
						ДлинаСтроки = Число(Сред(ПредставлениеТипа, ПозРазделителяДлины + 1));
					КонецЕсли;
					
					ОписаниеТипа = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(ДлинаСтроки));
					
				ИначеЕсли Лев(ПредставлениеТипа, 5) = "число" Тогда
					ДлинаЧисла    = 0;
					ТочностьЧисла = 0;
					
					ПозРазделителяДлины = Найти(ПредставлениеТипа, ":");
					Если ПозРазделителяДлины > 0 Тогда
						ОписаниеКвалификатора = Сред(ПредставлениеТипа, ПозРазделителяДлины + 1);
						
						ПозРазделителяТочности = Найти(ОписаниеКвалификатора, ":");
						Если ПозРазделителяТочности > 0 Тогда
							ДлинаЧисла    = Число(Лев(ОписаниеКвалификатора, ПозРазделителяТочности - 1));
							ТочностьЧисла = Число(Сред(ОписаниеКвалификатора, ПозРазделителяТочности + 1));
						Иначе
							ДлинаЧисла = Число(ОписаниеКвалификатора);
						КонецЕсли;
					КонецЕсли;
					
					ОписаниеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ДлинаЧисла, ТочностьЧисла));
					
				Иначе
					ОписаниеТипа = Новый ОписаниеТипов(ПредставлениеТипа);
					
				КонецЕсли;
				
				
				ИмяПоля = Лев(ИмяПоля, ПозРазделителяТипа - 1);
			КонецЕсли;				
			
			Поля.Добавить(ИмяПоля);
			
			Если ОписаниеТипа = Неопределено Тогда
				ТаблицаЗначений.Колонки.Добавить(ИмяПоля);
			Иначе
				ТаблицаЗначений.Колонки.Добавить(ИмяПоля, ОписаниеТипа);
			КонецЕсли;
	    КонецЦикла;

		ТаблицаЗначений.Колонки.Добавить("СодержитОшибки", Новый ОписаниеТипов("Булево"));
		
		// заполним таблицу данными
		Пока НЕ НаборЗаписей.EOF() Цикл
			// новая строка и её заполнение
			СтрокаТаблицыЗначений = ТаблицаЗначений.Добавить();
			
			Для НомПоля = 0 По ПоляЗаписи.Count - 1 Цикл
				ЗначениеПоля = ПоляЗаписи.Item(НомПоля).Value;
				
				Если      ПоляВыражения.Найти(Поля[НомПоля]) <> Неопределено Тогда
					ЗначениеПоля = ВычислитьЗначениеПоля(ЗначениеПоля, Параметры);
					Если ЗначениеПоля = Неопределено Тогда
						Комментарий = "Не удалось вычислить значение выражения «" + ПоляЗаписи.Item(НомПоля).Value + "» поля «" + ПоляЗаписи.Item(НомПоля).Name + "» в запросе"
										+ Символы.ПС + НаборЗаписей.Source;
										
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
						
						Если Ошибки <> Неопределено Тогда
							ДобавитьОшибкуВМассив(Ошибки, Комментарий);
						КонецЕсли;	
						
						Возврат Неопределено;
					КонецЕсли;
					
				ИначеЕсли ПоляФункции.Найти(Поля[НомПоля]) <> Неопределено Тогда
					Если      Найти(ЗначениеПоля, "ПолучитьОбъектПоКодуВнешнейСистемы") = 1 Тогда
						ЗначениеПоля = СтрЗаменить(ЗначениеПоля, "ПолучитьОбъектПоКодуВнешнейСистемы(", "ПолучитьОбъектПоКодуВнешнейСистемы(Параметры, ");
					ИначеЕсли Найти(ЗначениеПоля, "ПолучитьСправочникПоРеквизиту") = 1 Тогда
						ЗначениеПоля = СтрЗаменить(ЗначениеПоля, "ПолучитьСправочникПоРеквизиту(", "ПолучитьСправочникПоРеквизиту(Параметры, ");
					ИначеЕсли Найти(ЗначениеПоля, "ПолучитьФункциональнуюРольЮрФизЛица") = 1 Тогда
						ЗначениеПоля = СтрЗаменить(ЗначениеПоля, "ПолучитьФункциональнуюРольЮрФизЛица(", "ПолучитьФункциональнуюРольЮрФизЛица(Параметры, ");
					ИначеЕсли Найти(ЗначениеПоля, "ПолучитьФункциональнуюРольБанка") = 1 Тогда
						ЗначениеПоля = СтрЗаменить(ЗначениеПоля, "ПолучитьФункциональнуюРольБанка(", "ПолучитьФункциональнуюРольБанка(Параметры, ");
					ИначеЕсли Найти(ЗначениеПоля, "ПолучитьНастройкуРасчетаПроцентаВекселя") = 1 Тогда
						ЗначениеПоля = СтрЗаменить(ЗначениеПоля, "ПолучитьНастройкуРасчетаПроцентаВекселя(", "ПолучитьНастройкуРасчетаПроцентаВекселя(Параметры, ");
					ИначеЕсли Найти(ЗначениеПоля, "ПредопределенноеЗначение") = 1 Тогда
						// функция глобального контекста, ничего делать не надо
					Иначе
						ЗначениеПоля = Неопределено;
					КонецЕсли;
					
					Если ЗначениеПоля <> Неопределено Тогда
						Попытка
							ЗначениеПоля = Вычислить(ЗначениеПоля);
						Исключение
							Комментарий = "Ошибка при выполнении пользовательской функции «" + ЗначениеПоля + "» в запросе"
											+ Символы.ПС + НаборЗаписей.Source
											+ Символы.ПС + " Система сообщает: " + ОписаниеОшибки()	+ """";
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
							
							Если Ошибки <> Неопределено Тогда
								ДобавитьОшибкуВМассив(Ошибки, Комментарий);
							КонецЕсли;	
							
							ЗначениеПоля = Неопределено;
							СтрокаТаблицыЗначений.СодержитОшибки = Истина;
							
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТаблицыЗначений[НомПоля] = ЗначениеПоля;
				
				// выгрузим поля записи в структуру и передадим её в параметры, т.к. их значения могут пригодится для вычисления пользовательских функций
				ЗначенияПолей = Новый Структура;
				Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
					ЗначенияПолей.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
				КонецЦикла;
				
				Если ТипЗнч(Параметры) = Тип("Структура") Тогда
					Если Параметры.Свойство("ЗначенияПолей") <> Неопределено Тогда
						Параметры.Вставить("ЗначенияПолей", ЗначенияПолей);
					Иначе
						Параметры.ЗначенияПолей = ЗначенияПолей;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
				
		    НаборЗаписей.MoveNext();
		КонецЦикла;
		
	Исключение
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки(), """", "'");
		Пока Найти(ОписаниеОшибки, """") > 0 Цикл // двойные кавычки используем для разделения языков в НСтр
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, """", "'");
		КонецЦикла;
		
		Попытка
			ТекстЗапроса = НаборЗаписей.Source;
			Пока Найти(ТекстЗапроса, """") > 0 Цикл // двойные кавычки используем для разделения языков в НСтр
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """", "'");
			КонецЦикла;
		Исключение
			ТекстЗапроса = "<>";
		КонецПопытки;
		
		Комментарий = "Не удалось выгрузить результат запроса "
						+ Символы.ПС + ТекстЗапроса
						+ Символы.ПС + "в таблицу значений. Система сообщает: " + ОписаниеОшибки + """";
						
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
		
		Если Ошибки <> Неопределено Тогда
			ДобавитьОшибкуВМассив(Ошибки, Комментарий);
		КонецЕсли;	
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат ТаблицаЗначений;
	
КонецФункции // ADODBC_ВыгрузитьЗаписиИзНабораВТаблицуЗначений

Функция ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, Параметры = Неопределено, Ошибки = Неопределено)
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(СтрокаСоединения);
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса);
	Если НаборЗаписей = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВнешниеДанные = ADODBC_ВыгрузитьЗаписиИзНабораВТаблицуЗначений(НаборЗаписей, Параметры, Ошибки);
	
	РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(Соединение);
	
	Возврат ВнешниеДанные;
	
КонецФункции // ADODBC_ПолучитьТаблицуДанныхССервера

////////////////////////////////////////////////////////////////////////////////
// ПОЛЬЗОВАТЕЛЬСКИЕ ФУНКЦИИ, ОБРАБАТЫВАЕМЫЕ В ЗАПРОСАХ

Функция ВычислитьЗначениеПоля(Знач Выражение, Параметры)
	
	Если ПустаяСтрока(Выражение) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ЗнчПоля = Неопределено;
		
	// сначала попытаемся найти значение в параметрах
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		Попытка
			Если Параметры.Свойство(Выражение, ЗнчПоля) Тогда
				Возврат ЗнчПоля;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// работают математические, логические выражения, операции конкатенации
	Попытка
		ЗнчПоля = Вычислить(?(Лев(Выражение, 1) = ".", "Параметры.ЗначенияПолей", "") + Выражение);
	Исключение
		ВызватьИсключение("Не удалось вычислить выражение «" + Выражение + "». Система сообщает: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ЗнчПоля;
	
КонецФункции // ВычислитьЗначениеПоля

Функция ПолучитьОбъектПоКодуВнешнейСистемы(Параметры, КодВоВнешСистеме, Знач ГруппаОбъектов, ИмпортироватьПриОтсутствии = Ложь) Экспорт
	
	Если КодВоВнешСистеме = "NULL" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ГруппаОбъектов) = Тип("Строка") Тогда
		ИмяГруппыОбъектов = ГруппаОбъектов;
		ГруппаОбъектов    = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуОбъекта(ИмяГруппыОбъектов, Ложь);
		Если Не ЗначениеЗаполнено(ГруппаОбъектов) Тогда
			ВызватьИсключение("Не удалось получить группу объектов по имени «" + ИмяГруппыОбъектов + "»");
		КонецЕсли;
	КонецЕсли;
	
	// первым делом, проверим наличие объекта в списке обработанных объектов
	ГруппаОбработанныхОбъектов = Неопределено;
	ОбработанныеОбъекты        = Неопределено;
	
	Если Параметры.Свойство("ГруппаОбъектов", ГруппаОбработанныхОбъектов) и Параметры.Свойство("ОбработанныеОбъекты", ОбработанныеОбъекты) Тогда
		Если ГруппаОбъектов = ГруппаОбработанныхОбъектов и ТипЗнч(ОбработанныеОбъекты) = Тип("ТаблицаЗначений") Тогда
			СтрокаОбработанныеОбъекты = ОбработанныеОбъекты.Найти(КодВоВнешСистеме, "Идентификатор");
			Если СтрокаОбработанныеОбъекты <> Неопределено Тогда
				Возврат СтрокаОбработанныеОбъекты.Объект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// следующим делом, проверим в кэше
	ИмяКэша     = "КэшКодыВоВнешнихСистемах";
	КэшОбъектов = Неопределено;
	КлючПоиска  = Новый Структура("ГруппаОбъектов, Код", ГруппаОбъектов, КодВоВнешСистеме);
	
	Если Не Параметры.Свойство(ИмяКэша, КэшОбъектов) Тогда
		КэшОбъектов = РаботаСКоллекциями.Кэширование_СоздатьКэш(КлючПоиска);
		Параметры.Вставить(ИмяКэша, КэшОбъектов);
		
	Иначе
		ЗнчНайдено = Неопределено;
		
		ЗнчИзКэша = РаботаСКоллекциями.Кэширование_НайтиЗначение(КэшОбъектов, КлючПоиска, ЗнчНайдено);
		Если ЗнчНайдено Тогда
			Возврат ЗнчИзКэша;
		КонецЕсли;
	КонецЕсли;
	
	// поиск в базе данных
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Период,
		|			ВнешняяСистема = &ВнешняяСистема
		|				И ГруппаОбъектов = &ГруппаОбъектов
		|				И Код = &Код) КАК КодыВоВнешнихСистемахСрезПоследних";
		
	Запрос.УстановитьПараметр("Период",         ТекущаяДата());
	Запрос.УстановитьПараметр("ВнешняяСистема", Параметры.ВнешняяСистема);
	Запрос.УстановитьПараметр("ГруппаОбъектов", ГруппаОбъектов);
	Запрос.УстановитьПараметр("Код",            КодВоВнешСистеме);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Если ИмпортироватьПриОтсутствии Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ГруппаОбъектов",		ГруппаОбъектов);
			Отбор.Вставить("КодВоВнешнейСистеме",	КодВоВнешСистеме);
			
			ОбъектПоЦиклическойСсылке = НовыеОбъекты.НайтиСтроки(Отбор);
			
			Если ОбъектПоЦиклическойСсылке.Количество() > 0 Тогда
				ВызватьИсключение("Не удалось найти и импортировать объект из группы объектов «" + ГруппаОбъектов + "» по коду «" + КодВоВнешСистеме + "»!
								|Обнаружена циклическая ссылка.");
			Иначе
				НоваяСтрока						= НовыеОбъекты.Добавить();
				НоваяСтрока.ГруппаОбъектов		= ГруппаОбъектов;
				НоваяСтрока.КодВоВнешнейСистеме	= КодВоВнешСистеме;
			КонецЕсли;
				
			ОбработкаИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
			ОбработкаИмпортНСИ.ГруппаПравил   = ЭтотОбъект.ГруппаПравил;
			ОбработкаИмпортНСИ.ГруппаОбъектов = ГруппаОбъектов;
			ОбработкаИмпортНСИ.Подразделение  = ЭтотОбъект.Подразделение;
			ОбработкаИмпортНСИ.Язык           = ЭтотОбъект.Язык;
			
			ОбработкаИмпортНСИ.НеСообщатьОСозданииНовыхОбъектов = Истина;
			ОбработкаИмпортНСИ.НеСообщатьОбИзмененииОбъектов    = Истина;
			
			ОбработкаИмпортНСИ.НовыеОбъекты.Загрузить(НовыеОбъекты.Выгрузить());
			
			СтрокаИмпортируемыеОбъекты = ОбработкаИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
			СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = КодВоВнешСистеме;
			
			Если ОбработкаИмпортНСИ.ИмпортироватьДанные(, , Параметры.ГлубинаРекурсии) = Неопределено Тогда
				ВызватьИсключение("Не удалось найти и импортировать объект из группы объектов «" + ГруппаОбъектов + "» по коду «" + КодВоВнешСистеме + "»");
			КонецЕсли;
			
			НовыеОбъекты.Загрузить(ОбработкаИмпортНСИ.НовыеОбъекты.Выгрузить());
			
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ОбработкаИмпортНСИ.ИнформацияОбОбновлении, ИнформацияОбОбновлении);
			
			// повторно выполним запрос по поиску элемента
			Выборка = Запрос.Выполнить().Выбрать();
			Если Не Выборка.Следующий() Тогда
				ВызватьИсключение("Не удалось найти и импортировать объект из группы объектов «" + ГруппаОбъектов + "» по коду «" + КодВоВнешСистеме + "»");
			КонецЕсли;
		Иначе
			ВызватьИсключение("Не удалось найти объект из группы объектов «" + ГруппаОбъектов + "» по коду «" + КодВоВнешСистеме + "»");
		КонецЕсли;
	КонецЕсли;	
	
	// закэшируем
	РаботаСКоллекциями.Кэширование_ДобавитьЗначение(КэшОбъектов, КлючПоиска, Выборка.Объект);
	Параметры[ИмяКэша] = КэшОбъектов;
		
	Возврат Выборка.Объект;
	
КонецФункции // ПолучитьОбъектПоКодуВнешнейСистемы

Функция ПолучитьСправочникПоРеквизиту(Параметры, ЗнчРеквизита, ИмяОбъектаМД, ИмяРеквизита)
	
	// первым делом проверим в кэше
	ИмяКэша     = "КэшСправочникиПоРеквизиту";
	КэшОбъектов = Неопределено;
	КлючПоиска  = Новый Структура("ИмяОбъектаМД, ИмяРеквизита, ЗнчРеквизита", ИмяОбъектаМД, ИмяРеквизита, ЗнчРеквизита);
	
	Если Не Параметры.Свойство(ИмяКэша, КэшОбъектов) Тогда
		КэшОбъектов = РаботаСКоллекциями.Кэширование_СоздатьКэш(КлючПоиска);
		Параметры.Вставить(ИмяКэша, КэшОбъектов);
		
	Иначе
		ЗнчНайдено = Неопределено;
		
		ЗнчИзКэша = РаботаСКоллекциями.Кэширование_НайтиЗначение(КэшОбъектов, КлючПоиска, ЗнчНайдено);
		Если ЗнчНайдено Тогда
			Возврат ЗнчИзКэша;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка
		|ИЗ
		|	Справочник." + ИмяОбъектаМД + "
		|ГДЕ
		|	" + ИмяРеквизита + " = &ЗнчРеквизита";
		
	Запрос.УстановитьПараметр("ЗнчРеквизита", ЗнчРеквизита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение("Не удалось найти элемент справочника «" + ИмяОбъектаМД + "» по значению «" + ЗнчРеквизита + "» реквизита «" + ИмяРеквизита + "»");
	КонецЕсли;	
	
	РаботаСКоллекциями.Кэширование_ДобавитьЗначение(КэшОбъектов, КлючПоиска, Выборка.Ссылка);
	Параметры[ИмяКэша] = КэшОбъектов;
	
	Возврат Выборка.Ссылка;
	
КонецФункции // ПолучитьСправочникПоРеквизиту

Функция ПолучитьФункциональнуюРольЮрФизЛица(Параметры, ЮрФизЛицо, ВидФункциональнойРоли) Экспорт
	
	// вместо прямого значения юр. или физ. лицом может быть ссылка на другое поле
	Если ЮрФизЛицо = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если (ТипЗнч(ЮрФизЛицо) = Тип("Строка")) и (ТипЗнч(Параметры) = Тип("Структура")) Тогда
		ЗначенияПолей = Неопределено; 
		Если (Лев(ЮрФизЛицо, 1) = "*") и (Параметры.Свойство("ЗначенияПолей", ЗначенияПолей) <> Неопределено) Тогда
			ИмяПоля = Сред(ЮрФизЛицо, 2);
			Если ЗначенияПолей.Свойство(ИмяПоля, ЮрФизЛицо) = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// первым делом проверим в кэше
	ИмяКэша     = "КэшФункциональныхРолейЮрФизЛица";
	КэшОбъектов = Неопределено;
	КлючПоиска  = Новый Структура("ВидФункциональнойРоли, ЮрФизЛицо", ВидФункциональнойРоли, ЮрФизЛицо);
	
	Если Не Параметры.Свойство(ИмяКэша, КэшОбъектов) Тогда
		КэшОбъектов = РаботаСКоллекциями.Кэширование_СоздатьКэш(КлючПоиска);
		Параметры.Вставить(ИмяКэша, КэшОбъектов);
		
	Иначе
		ЗнчНайдено = Неопределено;
		
		ЗнчИзКэша = РаботаСКоллекциями.Кэширование_НайтиЗначение(КэшОбъектов, КлючПоиска, ЗнчНайдено);
		Если ЗнчНайдено Тогда
			Возврат ЗнчИзКэша;
		КонецЕсли;
	КонецЕсли;
	
	// поиск в базе данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка
		|ИЗ
		|	Справочник." + ВидФункциональнойРоли + "
		|ГДЕ
		|	ЮрФизЛицо = &ЮрФизЛицо";
		
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ФункциональнаяРоль = Справочники[ВидФункциональнойРоли].СоздатьЭлемент();
		ФункциональнаяРоль.ЮрФизЛицо    = ЮрФизЛицо;
		ФункциональнаяРоль.Наименование = ЮрФизЛицо.Наименование;
		ФункциональнаяРоль.Записать();
		
		ФункциональнаяРоль = ФункциональнаяРоль.Ссылка;
	Иначе
		ФункциональнаяРоль = Выборка.Ссылка;
	КонецЕсли;	
	
	// кэширование
	РаботаСКоллекциями.Кэширование_ДобавитьЗначение(КэшОбъектов, КлючПоиска, ФункциональнаяРоль);
	Параметры[ИмяКэша] = КэшОбъектов;
	
	Возврат ФункциональнаяРоль;

КонецФункции // ПолучитьФункциональнуюРольЮрФизЛица

Функция ПолучитьФункциональнуюРольБанка(Параметры, БИК, ЮрФизЛицо)
	
	ФункциональнаяРоль = Неопределено;
	
	// в матрихе для банков-нерезов могут завести БИК, состоящий из нулей
	Если ПустаяСтрока(СтрЗаменить(БИК, "0", "")) Тогда
		Возврат ФункциональнаяРоль;
	КонецЕсли;
	
	// вместо прямого значения юр. лицом может быть ссылка на другое поле
	Если (ТипЗнч(ЮрФизЛицо) = Тип("Строка")) и (ТипЗнч(Параметры) = Тип("Структура")) Тогда
		ЗначенияПолей = Неопределено; 
		Если (Лев(ЮрФизЛицо, 1) = "*") и (Параметры.Свойство("ЗначенияПолей", ЗначенияПолей) <> Неопределено) Тогда
			ИмяПоля = Сред(ЮрФизЛицо, 2);
			Если ЗначенияПолей.Свойство(ИмяПоля, ЮрФизЛицо) = Неопределено Тогда
				ВызватьИсключение("Не удалось получить значение поля «" + ИмяПоля + "»");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// первым делом, проверим значение в кэше
	ИмяКэша     = "КэшФункциональныхРолейБанков";
	КэшОбъектов = Неопределено;
	КлючПоиска  = Новый Структура("БИК, ЮрФизЛицо", БИК, ЮрФизЛицо);
	
	Если НЕ Параметры.Свойство(ИмяКэша, КэшОбъектов) Тогда
		КэшОбъектов = РаботаСКоллекциями.Кэширование_СоздатьКэш(КлючПоиска);
		Параметры.Вставить(ИмяКэша, КэшОбъектов);
		
	Иначе
		ЗнчНайдено = Неопределено;
		
		ЗнчИзКэша = РаботаСКоллекциями.Кэширование_НайтиЗначение(КэшОбъектов, КлючПоиска, ЗнчНайдено);
		Если ЗнчНайдено Тогда
			Возврат ЗнчИзКэша;
		КонецЕсли;
	КонецЕсли;
		
	// поиск в базе данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Банки.Ссылка КАК ФункциональнаяРоль,
		|	Банки.ЮрФизЛицо
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	Банки.Код = &БИК";

	Запрос.УстановитьПараметр("БИК", БИК);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		// ТехДолг: временно для ВТБ отключаем смену юр. лица по БИК 044525187
		//Если Не ЗначениеЗаполнено(Выборка.ЮрФизЛицо) Или Выборка.ЮрФизЛицо <> ЮрФизЛицо Тогда
		Если БИК <> "044525187" И (Не ЗначениеЗаполнено(Выборка.ЮрФизЛицо) Или Выборка.ЮрФизЛицо <> ЮрФизЛицо) Тогда
		
			УстановитьПривилегированныйРежим(Истина);
			
			ФункциональнаяРоль = Выборка.ФункциональнаяРоль.ПолучитьОбъект();
			ФункциональнаяРоль.ЮрФизЛицо = ЮрФизЛицо;
			ФункциональнаяРоль.Записать();
			
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
		ФункциональнаяРоль = Выборка.ФункциональнаяРоль;
		
	Иначе
		// т.к. в Матрихе много ссылок на устаревшую хрень
		//ВызватьИсключение("Не удалось найти банк по БИК «" + БИК + "». Загрузите банки из классификатора и повторите попытку");
	КонецЕсли;

	// кэширование
	РаботаСКоллекциями.Кэширование_ДобавитьЗначение(КэшОбъектов, КлючПоиска, ФункциональнаяРоль);
	Параметры[ИмяКэша] = КэшОбъектов;
	
	Возврат ФункциональнаяРоль;
	
КонецФункции // ПолучитьФункциональнуюРольБанка

Функция ПолучитьНастройкуРасчетаПроцентаВекселя(Параметры, КодИндекса, ПроцентнаяСтавка, БазаРасчета, Периодичность)
	
	Если БазаРасчета <> "193" Тогда //193 - ACT/ACT.ICMA - расчёт по фактическому количеству дней в году 
		ВызватьИсключение "Неизвестная база расчёта векселя " + Параметры.ЗначенияПолей.Вексель;
	КонецЕсли;
	
	Если Периодичность <> "6201" Тогда  //День (ставка на дату) - считаем по датам изменения значений индекса(ключевой ставки), другие варианты это скорее ошибочно заведённые данные.
		ВызватьИсключение "Неизвестная периодичность расчёта процентов векселя " + Параметры.ЗначенияПолей.Вексель;
	КонецЕсли;
	
#Область БлокировкаНастройкиРасчета
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.НастройкиРасчета");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	БлокировкаДанных.Заблокировать();
#КонецОбласти	
	
	Составляющие = Новый Массив;
	
	Если ЗначениеЗаполнено(КодИндекса) Тогда
		БазаРасчета	= ПолучитьОбъектПоКодуВнешнейСистемы(Параметры, КодИндекса, Справочники.ГруппыИмпортируемыхОбъектов.Индексы);
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("ПараметрРасчетаДоля", 	100);
		
		Если ТипЗнч(БазаРасчета) = Тип("СправочникСсылка.БазыРасчета") Тогда
			ПараметрыРасчета.Вставить("БазаРасчета", БазаРасчета);
			
		ИначеЕсли ТипЗнч(БазаРасчета) = Тип("СправочникСсылка.БиржевыеИндексы") Тогда
			ПараметрыРасчета.Вставить("БазаРасчета", Справочники.БазыРасчета.БиржевойИндекс);
			ПараметрыРасчета.Вставить("ПараметрРасчетаБиржевойИндекс", 	БазаРасчета);
			ПараметрыРасчета.Вставить("ПараметрСреднеарифметическое", 	Ложь);
			
		Иначе
			ВызватьИсключение "Для импорта условий расчета процентов векселей нет описания базы расчёта " + БазаРасчета;
		КонецЕсли;
		
		Составляющие.Добавить(ПараметрыРасчета);
	КонецЕсли;	
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("БазаРасчета", 			Справочники.БазыРасчета.ФиксированнаяСтавка);
	ПараметрыРасчета.Вставить("ПараметрРасчетаСтавка", 	ПроцентнаяСтавка);
	
	Составляющие.Добавить(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	
#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиРасчета.Ссылка КАК НастройкаРасчета,
	|	НастройкиРасчетаСоставляющие1.ПараметрыРасчета КАК ПараметрыРасчета1,
	|	НастройкиРасчетаСоставляющие2.ПараметрыРасчета КАК ПараметрыРасчета2,
	|	НастройкиРасчетаСоставляющие3.ПараметрыРасчета КАК ПараметрыРасчета3
	|ИЗ
	|	Справочник.НастройкиРасчета КАК НастройкиРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие1
	|		ПО НастройкиРасчета.Ссылка = НастройкиРасчетаСоставляющие1.Ссылка
	|			И (НастройкиРасчетаСоставляющие1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие2
	|		ПО НастройкиРасчета.Ссылка = НастройкиРасчетаСоставляющие2.Ссылка
	|			И (НастройкиРасчетаСоставляющие2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие3
	|		ПО НастройкиРасчета.Ссылка = НастройкиРасчетаСоставляющие3.Ссылка
	|			И (НастройкиРасчетаСоставляющие3.НомерСтроки = 3)
	|ГДЕ
	|	НастройкиРасчета.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчета.РасчетПроцентнойСтавки)
	|	И ЕСТЬNULL(НастройкиРасчетаСоставляющие1.БазаРасчета, ЗНАЧЕНИЕ(Справочник.БазыРасчета.)) = &БазаРасчета1
	|	И ЕСТЬNULL(НастройкиРасчетаСоставляющие2.БазаРасчета, ЗНАЧЕНИЕ(Справочник.БазыРасчета.)) = &БазаРасчета2
	|	И ЕСТЬNULL(НастройкиРасчетаСоставляющие3.БазаРасчета, ЗНАЧЕНИЕ(Справочник.БазыРасчета.)) = &БазаРасчета3";
#КонецОбласти	

	Для Индекс = 1 По 3 Цикл
		Если Индекс <= Составляющие.Количество() Тогда
			Запрос.УстановитьПараметр("БазаРасчета" + Индекс, Составляющие[Индекс - 1].БазаРасчета);
		Иначе
			Запрос.УстановитьПараметр("БазаРасчета" + Индекс, Справочники.БазыРасчета.ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;

	НастройкаРасчета = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НастройкаНайдена = Истина;
		
		Для Индекс = 1 По Составляющие.Количество() Цикл
			НастройкаНайдена = МИН(НастройкаНайдена,  РаботаСКоллекциями.СтруктурыИдентичны(Выборка["ПараметрыРасчета" + Индекс].Получить(), Составляющие[Индекс - 1], Истина));
		КонецЦикла;
		
		Если НастройкаНайдена Тогда
			НастройкаРасчета = Выборка.НастройкаРасчета;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкаРасчета = Неопределено Тогда
		
		НоваяНастройкаРасчета = Справочники.НастройкиРасчета.СоздатьЭлемент();
		НоваяНастройкаРасчета.ВидРасчета = Перечисления.ВидыРасчета.РасчетПроцентнойСтавки;
		
		Для Каждого ПараметрыРасчета Из Составляющие Цикл
			Составляющая = НоваяНастройкаРасчета.Составляющие.Добавить();
			Составляющая.БазаРасчета 		= ПараметрыРасчета.БазаРасчета;
			Составляющая.ПараметрыРасчета 	= Новый ХранилищеЗначения(Справочники.БазыРасчета.ПолучитьПараметрыРасчета(ПараметрыРасчета.БазаРасчета, ПараметрыРасчета,  Составляющая.Представление), Новый СжатиеДанных(9));
		КонецЦикла;
		
		НоваяНастройкаРасчета.Наименование = Справочники.НастройкиРасчета.СформироватьНаименование(НоваяНастройкаРасчета);
		НоваяНастройкаРасчета.Записать();

		НастройкаРасчета = НоваяНастройкаРасчета.Ссылка;
		
	КонецЕсли;
	
	Возврат НастройкаРасчета;
	
КонецФункции

Процедура СкопироватьРеквизитыГоловнойОрганизацииВФилиалТраста(КодТрастФилиалМосква)
	
	// получим нужных нам юр. лиц
	ДатаЗакрытияФилиала = Дата(2018, 8, 10);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(&Период, ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих) И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код = &Код";
	
	Запрос.УстановитьПараметр("Период", ДатаЗакрытияФилиала);
	Запрос.УстановитьПараметр("Код",    КодТрастФилиалМосква);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТрастФилиалМосква = Выборка.Объект;
	КонецЕсли;
	
	ТрастГолова = РаботаСНормативноСправочнойИнформацией.ПолучитьГоловнуюОрганизацию(ТрастФилиалМосква, ДатаЗакрытияФилиала);
	
	// скопируем реквизиты головы
	РеквизитыЮридическихЛиц = РегистрыСведений.РеквизитыЮридическихЛиц.СоздатьНаборЗаписей();
	
	РеквизитыЮридическихЛиц.Отбор.ЮрФизЛицо.Установить(ТрастФилиалМосква);
	
	РеквизитыЮридическихЛиц.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.*
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыЮридическихЛиц.*
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|ГДЕ
		|	Период > &Период
		|	И ЮрФизЛицо = &ЮрФизЛицо";
	
	Запрос.УстановитьПараметр("Период", ДатаЗакрытияФилиала);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ТрастГолова);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РеквизитыЮридическихЛиц.Добавить();
		
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.Период    = ?(Запись.Период < ДатаЗакрытияФилиала, ДатаЗакрытияФилиала, Запись.Период);
		Запись.ЮрФизЛицо = ТрастФилиалМосква;
				
	КонецЦикла;
	
	РеквизитыЮридическихЛиц.ДополнительныеСвойства.Вставить("ИмпортИзВнешнейСистемы", Истина);
	
	РеквизитыЮридическихЛиц.Записать();
	
	// Скопируем контактную информацию головы
	
	КонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	
	КонтактнаяИнформация.Отбор.Объект.Установить(ТрастФилиалМосква);
	
	КонтактнаяИнформация.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформацияСрезПоследних.*
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(&Период, Объект = &ЮрФизЛицо) КАК КонтактнаяИнформацияСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.*
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	Период > &Период
		|	И Объект = &ЮрФизЛицо";
	
	Запрос.УстановитьПараметр("Период", ДатаЗакрытияФилиала);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ТрастГолова);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = КонтактнаяИнформация.Добавить();
		
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.Период    = ?(Запись.Период < ДатаЗакрытияФилиала, ДатаЗакрытияФилиала, Запись.Период);
		Запись.Объект = ТрастФилиалМосква;
				
	КонецЦикла;
	
	КонтактнаяИнформация.ДополнительныеСвойства.Вставить("ИмпортИзВнешнейСистемы", Истина);
	
	КонтактнаяИнформация.Записать();	
	
	// изменим наименование филиала
	
	Объект = ТрастФилиалМосква.ПолучитьОбъект();
	
	Объект.Наименование = ТрастГолова.Наименование + " (быв. ""Филиал Московский"")";
	
	Объект.ДополнительныеСвойства.Вставить("ИмпортИзВнешнейСистемы", Истина);
	
	Объект.Записать();
	
КонецПроцедуры // СкопироватьРеквизитыГоловнойОрганизацииВФилиалТраста

////////////////////////////////////////////////////////////////////////////////
// ЗАГРУЗКА ДАННЫХ

Процедура ПодготовитьОбъектыДляАвтоматическойЗагрузки()
	
	Если ЭтотОбъект.ИмпортируемыеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	// проверим, что группы правил и объектов заданы
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ГруппаПравил) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задана группа правил. Автоматическа загрузка не произведена.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ГруппаОбъектов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задана группа объектов. Автоматическа загрузка не произведена");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВнешняяСистема = ПолучитьВнешнююСистему(ЭтотОбъект.ГруппаПравил);
	Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правилах импорта для группы правил «" + ЭтотОбъект.ГруппаПравил + "» не задана внешняя система, из которой осуществляется импорт данных.");
		Возврат;
	КонецЕсли;
	
	
	// исключим пустые строки и составим список переданных объектов
	Параметры = Новый Структура("ВнешняяСистема", ВнешняяСистема);
	
	ПереданныеОбъекты = Новый Массив();
	
	Для НомСтр = 1 - ЭтотОбъект.ИмпортируемыеОбъекты.Количество() По 0 Цикл
		СтрокаИмпортируемыеОбъекты = ЭтотОбъект.ИмпортируемыеОбъекты[-НомСтр];
		
		Если Не ЗначениеЗаполнено(СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме)
				И Не ЗначениеЗаполнено(СтрокаИмпортируемыеОбъекты.Объект)
		Тогда
			// пустые строки удаляем
			ЭтотОбъект.ИмпортируемыеОбъекты.Удалить(-НомСтр);
			Продолжить;
				
		ИначеЕсли ЗначениеЗаполнено(СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме)
				И Не ЗначениеЗаполнено(СтрокаИмпортируемыеОбъекты.Объект)
		Тогда
			// попытаемся найти новый объект, если он не будет найден, то ничего страшного - создастся после загрузки
			Попытка
				СтрокаИмпортируемыеОбъекты.Объект = ПолучитьОбъектПоКодуВнешнейСистемы(Параметры,
					СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме, ЭтотОбъект.ГруппаОбъектов);
			Исключение
			КонецПопытки;
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаИмпортируемыеОбъекты.Объект)	Тогда
		    // пока просто заполним коллекцию переданных объектов, а проверим их соответствие кодам единым запросом после цикла
			ПереданныеОбъекты.Добавить(СтрокаИмпортируемыеОбъекты.Объект);
		
		КонецЕсли;
	КонецЦикла;
	
	// получим коды переданных переданных объектов
	Если ПереданныеОбъекты.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыВоВнешнихСистемахСрезПоследних.Объект,
			|	КодыВоВнешнихСистемахСрезПоследних.Код,
			|	ПРЕДСТАВЛЕНИЕ(КодыВоВнешнихСистемахСрезПоследних.Объект) КАК ПредставлениеОбъекта
			|ИЗ
			|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
			|			&Период,
			|			ВнешняяСистема = &ВнешняяСистема
			|				И ГруппаОбъектов = &ГруппаОбъектов
			|				И Объект В (&Объект)) КАК КодыВоВнешнихСистемахСрезПоследних";

		Запрос.УстановитьПараметр("Период",         ТекущаяДата());	
		Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
		Запрос.УстановитьПараметр("ГруппаОбъектов", ЭтотОбъект.ГруппаОбъектов);
		Запрос.УстановитьПараметр("Объект",         ПереданныеОбъекты);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокиИмпортируемыеОбъекты = ЭтотОбъект.ИмпортируемыеОбъекты.НайтиСтроки(Новый Структура("Объект", Выборка.Объект));
			Для каждого СтрокаИмпортируемыеОбъекты Из СтрокиИмпортируемыеОбъекты Цикл
				Если Не ЗначениеЗаполнено(СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме) Тогда
					// либо заполним код, либо исключим объект из импортируемых, если код не задан
					Если ЗначениеЗаполнено(Выборка.Код) Тогда
						СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = Выборка.Код;
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан код объекта «" + Выборка.ПредставлениеОбъекта + "» во внешней системе «" + Строка(ВнешняяСистема) + "». Объект не будет обработан.");
						ЭтотОбъект.ИмпортируемыеОбъекты.Удалить(СтрокаИмпортируемыеОбъекты);
					КонецЕсли;
				Иначе
					// проверим, что переданный код совпадает с текущим сохраненным
					Если СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме <> Выборка.Код Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код «" + Выборка.Код + "» объекта «" + Выборка.ПредставлениеОбъекта + "» во внешней системе «" + Строка(ВнешняяСистема) + "» не совпадает с переданным «" + Строка(СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме) + "». Объект не будет обработан.");
						ЭтотОбъект.ИмпортируемыеОбъекты.Удалить(СтрокаИмпортируемыеОбъекты);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
				
	КонецЕсли;
	
	// исключим из обработки объекты, для которых коды не заданы
	ЕстьИсклОбъекты = Ложь;
	Для НомСтр = 1 - ЭтотОбъект.ИмпортируемыеОбъекты.Количество() По 0 Цикл
		СтрокаИмпортируемыеОбъекты = ЭтотОбъект.ИмпортируемыеОбъекты[-НомСтр];
		Если Не ЗначениеЗаполнено(СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме) Тогда
			ЕстьИсклОбъекты = Истина;
			ЭтотОбъект.ИмпортируемыеОбъекты.Удалить(-НомСтр);
		КонецЕсли;
	КонецЦикла;
	Если ЕстьИсклОбъекты Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Из обработки искл. объекты с пустыми кодами внеш. системы.");
	КонецЕсли;

КонецПроцедуры // ПодготовитьОбъектыДляАвтоматическойЗагрузки

Функция НайтиУстранитьРасхожденияВСправочнике(Объект, НовыеРеквизиты, Реквизиты, ВнешняяСистема, ОписаниеРасхождений = "", РезультатОбновления)
	
	ЕстьРасхождения     = Ложь;
	ОписаниеРасхождений = "";
	
	Для каждого Реквизит Из Реквизиты Цикл
		ТекущееЗначение = ?(ЗначениеЗаполнено(Объект[Реквизит]), Объект[Реквизит], Неопределено); // чтобы избежать расхождения при сравнении пустых значений разных типов
		НовоеЗначение   = ?(ЗначениеЗаполнено(НовыеРеквизиты[Реквизит]), НовыеРеквизиты[Реквизит], Неопределено);
		
		Если ТипЗнч(ТекущееЗначение) = Тип("Булево") Тогда
			НовоеЗначение = ?(ТипЗнч(НовоеЗначение) = Тип("Число"), Булево(НовоеЗначение), Ложь);
		КонецЕсли;
		
		Если ТекущееЗначение <> НовоеЗначение Тогда
			ОписаниеРасхождений = ОписаниеРасхождений + ?(ПустаяСтрока(ОписаниеРасхождений), "", Символы.ПС)
				+ Реквизит + ": [" + СокрЛП(ТекущееЗначение) + "] -> [" + СокрЛП(НовоеЗначение) + "]";
				
			Объект[Реквизит] = НовоеЗначение;
			
			ЕстьРасхождения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьРасхождения Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Объект.ДополнительныеСвойства.Вставить("ИмпортИзВнешнейСистемы", Истина);
	Объект.ДополнительныеСвойства.Вставить("ВнешняяСистема", ВнешняяСистема);
	
	Попытка
		Объект.Записать();
	Исключение
		ТекстСообщения = "Не удалось импортировать элемент справочника '" + Объект.Метаданные().Представление() + "' с кодом '" + НовыеРеквизиты.Идентификатор + "'. Система сообщает: " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Если РезультатОбновления <> Неопределено Тогда
			РезультатОбновления.СообщенияОбОшибках.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // НайтиУстранитьРасхожденияВСправочнике

Функция ПолучитьСтрокуСравнения(ИмяКолонки, ТекущееЗначение, НовоеЗначение, ИмяРегистра, ПериодическийРегистр, СтрокаДанные)

	Если ИмяРегистра = "КодыВТорговыхСистемах" И СтрокаДанные.ВидКода <> Перечисления.ВидыКодовВТорговыхСистемах.CFI Тогда
		Возврат СтрЗаменить(СтрокаДанные.ВидКода, " ", "") + ": [" + СокрЛП(ТекущееЗначение) + "] -> [" + СокрЛП(НовоеЗначение) + "]";
	Иначе
		Возврат ИмяКолонки + ": [" + СокрЛП(ТекущееЗначение) + "] -> [" + СокрЛП(НовоеЗначение) + "]" + ?(ПериодическийРегистр, СтрокаДанные.Период, "");
	КонецЕсли;

КонецФункции

Функция НайтиУстранитьРасхожденияВРегистреСведений(ИмяРегистра, НовыеДанные, КлючевыеПоля, ЗначенияКлючевыхПоля, ОписаниеРасхождений, РезультатОбновления, ВспомогательныеДанные)
	
	РегистрМД = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// определим динамические компоненты запроса для поиска расхождений
	УсловиеОтбора = "";
	Для каждого КлючевоеПоле Из КлючевыеПоля Цикл
		УсловиеОтбора = УсловиеОтбора + ?(ПустаяСтрока(УсловиеОтбора), "", " И ") + КлючевоеПоле + " = &" + КлючевоеПоле;
	КонецЦикла;
		
	// подготовим запрос
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	РегистрСведений.&ИмяРегистра
		|ГДЕ
		|	&УсловиеОтбора";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяРегистра",   ИмяРегистра);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", УсловиеОтбора);
	
	Для каждого КлючевоеПоле Из КлючевыеПоля Цикл
		Запрос.УстановитьПараметр(КлючевоеПоле, ЗначенияКлючевыхПоля[КлючевоеПоле]);
	КонецЦикла;
	
	// найдем расхождения
	ТекущиеДанные = Запрос.Выполнить().Выгрузить();
	
	ЗначенияИзмерений = Новый Структура();
	Для каждого ИзмерениеМД Из РегистрМД.Измерения Цикл
		ЗначенияИзмерений.Вставить(ИзмерениеМД.Имя);
	КонецЦикла;
	ПериодическийРегистр = РегистрМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
	Если ПериодическийРегистр Тогда
		ЗначенияИзмерений.Вставить("Период");
	КонецЕсли;
	
	ЕстьРасхождения = Ложь;
	
	
	// данные могут либо измениться, либо добавиться. 
	// 1-й заход. Сличаем Текущие и Новые данные по совпадающим измерениям 
	// а также данные могут удалиться! есть отмены оферт, возможно еще что-то
	УдаленоЗаписей = 0;
	
	Для каждого СтрокаТекущиеДанные Из ТекущиеДанные Цикл
		ЗаполнитьЗначенияСвойств(ЗначенияИзмерений, СтрокаТекущиеДанные);
		
		СтрокиНовыеДанные = НовыеДанные.НайтиСтроки(ЗначенияИзмерений);
		
		Если СтрокиНовыеДанные.Количество() = 1 Тогда
			СтрокаНовыеДанные = СтрокиНовыеДанные[0];
		ИначеЕсли СтрокиНовыеДанные.Количество() = 0 Тогда
			СтрокаНовыеДанные = Неопределено; // вот случай удаления данных
			УдаленоЗаписей = УдаленоЗаписей + 1;
		Иначе
			// эта ситуация возможна только в одном случае: 
			// 		мы уменьшили количество измерений, но не переделали правила импорта
			СтрокаНовыеДанные = Неопределено; // пока так, по-хорошему нужно исключение вызвать, но вероятность почти нулевая
		КонецЕсли;
		
		Для каждого Колонка Из ТекущиеДанные.Колонки Цикл
			
			Если СтрокаНовыеДанные = Неопределено Тогда // для удаленных выводим измерения, кроме ЦБ
				Если Колонка.Имя = "Облигация" ИЛИ Колонка.Имя = "ЦеннаяБумага" ИЛИ Колонка.Имя = "Объект" Тогда 
					Продолжить; 
				КонецЕсли;
				НовоеЗначение = Неопределено;
			Иначе // для сравнения измерения не выводим	
				Если ЗначенияИзмерений.Свойство(Колонка.Имя) ИЛИ НовыеДанные.Колонки.Найти(Колонка.Имя) = Неопределено  Тогда
					Продолжить;
				КонецЕсли;
				НовоеЗначение   = ?(ЗначениеЗаполнено(СтрокаНовыеДанные[Колонка.Имя]), СтрокаНовыеДанные[Колонка.Имя], Неопределено);
			КонецЕсли;
			
			ТекущееЗначение = ?(ЗначениеЗаполнено(СтрокаТекущиеДанные[Колонка.Имя]), СтрокаТекущиеДанные[Колонка.Имя], Неопределено); // чтобы избежать расхождения при сравнении пустых значений разных типов
			
			Если ТипЗнч(ТекущееЗначение) = Тип("Булево") И ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
				НовоеЗначение = ?(ТипЗнч(НовоеЗначение) = Тип("Число"), Булево(НовоеЗначение), Ложь);
			КонецЕсли;
			
			Если ТекущееЗначение <> НовоеЗначение Тогда
				
				СтрокаСравнения = ПолучитьСтрокуСравнения(Колонка.Имя, ТекущееЗначение, НовоеЗначение, ИмяРегистра, ПериодическийРегистр, СтрокаТекущиеДанные);
				
				ОписаниеРасхождений = ОписаниеРасхождений + ?(ПустаяСтрока(ОписаниеРасхождений), "", Символы.ПС) + СтрокаСравнения;
				
				ЕстьРасхождения = Истина;
				
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЦикла;
	
	// 2-й проход.  возьмем новые записи, которых нет  в текущих
	Если НовыеДанные.Количество() > ТекущиеДанные.Количество() - УдаленоЗаписей Тогда  
		Для Каждого СтрокаНовыеДанные из НовыеДанные Цикл 	
			
			ЗаполнитьЗначенияСвойств(ЗначенияИзмерений, СтрокаНовыеДанные);
			
			СтрокиТекущиеДанные = ТекущиеДанные.НайтиСтроки(ЗначенияИзмерений);
			Если СтрокиТекущиеДанные.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Колонка Из НовыеДанные.Колонки Цикл
				//для новых записей в РС измерений не пропускаем. Пропускаем только измерение со ссылкой на ценную бумагу
				Если Колонка.Имя = "Облигация" ИЛИ Колонка.Имя = "ЦеннаяБумага" ИЛИ Колонка.Имя = "Объект" Тогда 
					Продолжить; 
				КонецЕсли;
				ТекущееЗначение = Неопределено;
				НовоеЗначение   = ?(ЗначениеЗаполнено(СтрокаНовыеДанные[Колонка.Имя]), СтрокаНовыеДанные[Колонка.Имя], Неопределено);
				
				СтрокаСравнения = ПолучитьСтрокуСравнения(Колонка.Имя, ТекущееЗначение, НовоеЗначение, ИмяРегистра, ПериодическийРегистр, СтрокаНовыеДанные);
				
				ОписаниеРасхождений = ОписаниеРасхождений + ?(ПустаяСтрока(ОписаниеРасхождений), "", Символы.ПС) + СтрокаСравнения;
				
			КонецЦикла;	
			
			ЕстьРасхождения = Истина;

		КонецЦикла;		
	КонецЕсли;		
		
	Если Не ЕстьРасхождения Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// устраним расхождения
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	Для каждого КлючевоеПоле Из КлючевыеПоля Цикл
		НаборЗаписей.Отбор[КлючевоеПоле].Установить(ЗначенияКлючевыхПоля[КлючевоеПоле]);
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	// заполним набор новыми записями
	Для каждого СтрокаНовыеДанные Из НовыеДанные Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаНовыеДанные);
	КонецЦикла;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ИмпортИзВнешнейСистемы");
	
	Если ИмяРегистра = "РеквизитыЮридическихЛиц" И ВспомогательныеДанные.Свойство("ЮридическиеЛицаПоДействующимСчетамДУ") Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("ЮридическиеЛицаПоДействующимСчетамДУ", ВспомогательныеДанные.ЮридическиеЛицаПоДействующимСчетамДУ);		
	КонецЕсли;
	
	// описание ключ. полей подготовим сразу, т.к. в исключении не удается получить представление:
	// генерируется исключ. ситуация, которая в транзакции приводит к падению платформы
	ОписаниеКлючевыхПолей = "";
	Для каждого КлючевоеПоле Из КлючевыеПоля Цикл
		ОписаниеКлючевыхПолей = ОписаниеКлючевыхПолей + ?(ПустаяСтрока(ОписаниеКлючевыхПолей), "", ", ") + КлючевоеПоле + " [" + ЗначенияКлючевыхПоля[КлючевоеПоле] + "]";
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = "Не удалось импортировать записи регистра сведений '" + РегистрМД.Представление() + "', относящиеся к " + ОписаниеКлючевыхПолей + ". Система сообщает: " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Если РезультатОбновления <> Неопределено Тогда
			РезультатОбновления.СообщенияОбОшибках.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Возврат Неопределено;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция ИмпортироватьДанные(ТипыДанныхДляОповещения = Неопределено, РезультатОбновления = Неопределено, ГлубинаРекурсии = 0) Экспорт
	
	Ошибки = Новый Массив; // для накопления ошибок по которым будут создаваться задачи
	
	ГлубинаРекурсии = ГлубинаРекурсии + 1;
	
	ПодготовитьОбъектыДляАвтоматическойЗагрузки();
	
	КодТрастФилиалМосква = "222581";
	
	// Для дробной и неиспользуемой акции Интер РАО будем менять наименование
	Если ЭтотОбъект.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.Акции Тогда
		НеиспользуемаяАкцияИнтерРАО				= ОбщегоНазначения.ПолучитьИменованныйОбъект("Акция_ИнтерРАОНеактуальна");
		ВСоставеЕстьНеиспользуемаяАкцияИнтерРАО	= ЭтотОбъект.ИмпортируемыеОбъекты.НайтиСтроки(Новый Структура("Объект", НеиспользуемаяАкцияИнтерРАО)).Количество() > 0;
	КонецЕсли;
	
	// организуем сбор статистики
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ИмпортироватьДанные()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	// получим идентификаторы и ссылки, если объекты были импортированы ранее
	МаксДопДлинаИдентификатора = Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.Ресурсы.Код.Тип.КвалификаторыСтроки.Длина;
	
	ДанныеДляЗагрузки = Новый ТаблицаЗначений;
	ДанныеДляЗагрузки.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(МаксДопДлинаИдентификатора)));
	ДанныеДляЗагрузки.Колонки.Добавить("Объект");
	
	ИдентификаторыВыбранныхОбъектов = Новый Массив();
	
	Для каждого СтрокаИмпортируемыеОбъекты Из ЭтотОбъект.ИмпортируемыеОбъекты Цикл
		СтрокаДанныеДляЗагрузки = ДанныеДляЗагрузки.Добавить();
		СтрокаДанныеДляЗагрузки.Идентификатор = СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме;
		СтрокаДанныеДляЗагрузки.Объект        = СтрокаИмпортируемыеОбъекты.Объект;
		
		ИдентификаторыВыбранныхОбъектов.Добавить(СтрокаДанныеДляЗагрузки.Идентификатор);
	КонецЦикла;		
	
	Если ДанныеДляЗагрузки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны данные для загрузки");
		Возврат Неопределено;
	КонецЕсли;		
		
	ДанныеДляЗагрузки.Индексы.Добавить("Идентификатор");
	
	// получим и проверим правила загрузки данных
	СтрокаСоединения = ПолучитьСтрокуСоединенияССерверомДанных(ЭтотОбъект.ГруппаПравил);
	Если ПустаяСтрока(СтрокаСоединения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правилах импорта для группы правил '" + ЭтотОбъект.ГруппаПравил + "' не задана строка соединения с сервером данных");
		Возврат Неопределено;
	КонецЕсли;
	
	ВнешняяСистема = ПолучитьВнешнююСистему(ЭтотОбъект.ГруппаПравил);
	Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правилах импорта для группы правил '" + ЭтотОбъект.ГруппаПравил + "' не задана внешняя система, из которой осуществляется импорт данных");
		Возврат Неопределено;
	КонецЕсли;
	
	ПравилаИмпорта = ПолучитьПравилаИмпорта(ЭтотОбъект.ГруппаПравил, ЭтотОбъект.ГруппаОбъектов, ИдентификаторыВыбранныхОбъектов);
	Если ПравилаИмпорта.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заданы правила импорта данных для группы объектов '" + ЭтотОбъект.ГруппаОбъектов + "'");
		Возврат Неопределено;
	КонецЕсли;
	
	Для НомПравила = 0 По ПравилаИмпорта.Количество() - 1 Цикл
		ПравилоИмпорта = ПравилаИмпорта[НомПравила]; // это должна быть структура со свойствами "ГруппаОбъектовМД" и "ТекстЗапроса"
		
		Если ПустаяСтрока(ПравилоИмпорта.ПриемникДанных) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан приемник данных в правиле № " + НомПравила);
			Возврат Неопределено;
		КонецЕсли;
		
		Если ПравилоИмпорта.ПриемникДанных <> "*" Тогда // просто запрос, из которого могут быть вызваны поддерживаемые функции, например, ПолучитьФункциональнуюРольБанка
		
			ПозРаздТипаИВидаОбъекта = Найти(ПравилоИмпорта.ПриемникДанных, ".");
			Если ПозРаздТипаИВидаОбъекта = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правиле № " + НомПравила + " приемник данных задан некорректно. Примеры корректных значений: 'Справочники.ЮрФизЛица', 'РегистрыСведений.КонтактнаяИнформация'");
				Возврат Неопределено;
			КонецЕсли;
			
			ИмяТипаОбъектов = НРег(Лев(ПравилоИмпорта.ПриемникДанных, ПозРаздТипаИВидаОбъекта - 1));
			Если (ИмяТипаОбъектов <> "справочники") и (ИмяТипаОбъектов <> "регистрысведений") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правиле № " + НомПравила + " тип приемника данных '" + ИмяТипаОбъектов + "' отличен от поддерживаемых 'Справочники' и 'РегистрыСведений'");
				Возврат Неопределено;
			КонецЕсли;
			
			ИмяВидаОбъекта = НРег(Сред(ПравилоИмпорта.ПриемникДанных, ПозРаздТипаИВидаОбъекта + 1));
			Если Метаданные[ИмяТипаОбъектов].Найти(ИмяВидаОбъекта) = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правиле № " + НомПравила + " указанный вид приемника данных '" + ИмяВидаОбъекта + "' отсутствует в типе объектов '" + ИмяТипаОбъектов + "'");
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбработанныеОбъекты = Новый ТаблицаЗначений;
	ОбработанныеОбъекты.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(МаксДопДлинаИдентификатора)));
	ОбработанныеОбъекты.Колонки.Добавить("Объект");
	ОбработанныеОбъекты.Колонки.Добавить("НовыйОбъект");
	ОбработанныеОбъекты.Колонки.Добавить("ОписаниеДействия");	
	
	ПараметрыВыборкиДанных = Новый Структура();
	ПараметрыВыборкиДанных.Вставить("ОбработанныеОбъекты", ОбработанныеОбъекты);
	ПараметрыВыборкиДанных.Вставить("ГруппаОбъектов",      ЭтотОбъект.ГруппаОбъектов);
	ПараметрыВыборкиДанных.Вставить("Подразделение",       ЭтотОбъект.Подразделение);
	ПараметрыВыборкиДанных.Вставить("Язык",                ЭтотОбъект.Язык);
	ПараметрыВыборкиДанных.Вставить("ВнешняяСистема",      ВнешняяСистема);
	ПараметрыВыборкиДанных.Вставить("ГлубинаРекурсии",     ГлубинаРекурсии);
	
	// последовательно выполним запросы и загрузим полученные данные в базу
	НачатьТранзакцию();
	
	ТипыДанныхДляОповещения = Новый Массив();
	
	Для каждого ПравилоИмпорта Из ПравилаИмпорта Цикл
		Если ПравилоИмпорта.ПриемникДанных = "*" И ПравилоИмпорта.Режим = "ВызовФункции" Тогда // Для данного режима импортировать ничего не требуется
			
			Если       ПравилоИмпорта.ИмяФункции = "СкопироватьРеквизитыГоловнойОрганизацииВФилиалТраста" Тогда
				
				Если ЭтотОбъект.ИмпортируемыеОбъекты.Найти(КодТрастФилиалМосква, "КодВоВнешнейСистеме") <> Неопределено Тогда
					СкопироватьРеквизитыГоловнойОрганизацииВФилиалТраста(КодТрастФилиалМосква);
				КонецЕсли;
				
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		ВнешниеДанные = ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ПравилоИмпорта.ТекстЗапроса, ПараметрыВыборкиДанных, Ошибки);
		
		Если ВнешниеДанные = Неопределено Тогда
			ОтменитьТранзакции(ГлубинаРекурсии);
			ЗарегистрироватьОшибки(Ошибки, РезультатОбновления);
			ТипыДанныхДляОповещения = Неопределено;
			Возврат Неопределено; 
		КонецЕсли;

		ЗарегистрироватьОшибки(Ошибки, РезультатОбновления);
			
		СтрокиСОшибками = ВнешниеДанные.Скопировать(Новый Структура("СодержитОшибки", Истина));
		ВнешниеДанные = ВнешниеДанные.Скопировать(Новый Структура("СодержитОшибки", Ложь));
		
		Если ПравилоИмпорта.ПриемникДанных = "*" Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаОбъектовМД = НРег(Лев(ПравилоИмпорта.ПриемникДанных, Найти(ПравилоИмпорта.ПриемникДанных, ".") - 1));
		ИмяОбъектаМД     = Сред(ПравилоИмпорта.ПриемникДанных, Найти(ПравилоИмпорта.ПриемникДанных, ".") + 1);
		
		ОбъектМД = Метаданные[ГруппаОбъектовМД][ИмяОбъектаМД];
		
		ОбновляемыеРеквизиты = Новый Массив;
		
		Если      ГруппаОбъектовМД = "справочники" Тогда
			Если ТипыДанныхДляОповещения.Найти(Тип("СправочникСсылка." + ИмяОбъектаМД)) = Неопределено Тогда
				ТипыДанныхДляОповещения.Добавить(Тип("СправочникСсылка." + ИмяОбъектаМД));
			КонецЕсли;
			
			Если ИмяОбъектаМД = "Облигации" Тогда
				ПодготовитьОблигации(ВнешниеДанные, ДанныеДляЗагрузки);
			КонецЕсли;
			
			МенеджерОбъекта = Справочники[ИмяОбъектаМД];
			
			ПустаяСсылка = МенеджерОбъекта.ПустаяСсылка();
			
			Для каждого Колонка Из ВнешниеДанные.Колонки Цикл
				Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(ПустаяСсылка, Колонка.Имя) Тогда
					ОбновляемыеРеквизиты.Добавить(Колонка.Имя);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого СтрокаВнешниеДанные Из ВнешниеДанные Цикл
				СсылкаНаОбъект = Неопределено;

				Если Не ПравилоИмпорта.ПодчиненныйСправочник Тогда
					// если это повторная загрузка объекта, то объект должен быть передан в коллекции данных для загрузки
					СтрокаДанныеДляЗагрузки = ДанныеДляЗагрузки.Найти(Строка(СтрокаВнешниеДанные.Идентификатор), "Идентификатор");
					Если СтрокаДанныеДляЗагрузки <> Неопределено Тогда
						СсылкаНаОбъект = СтрокаДанныеДляЗагрузки.Объект;
					КонецЕсли;
						
					Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
						// создадим новый элемент справочника
						СсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку();
						
						СправочникОбъект = МенеджерОбъекта.СоздатьЭлемент();
						СправочникОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
						
						// зафиксируем код объекта во внешней системе
						РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(СсылкаНаОбъект, ВнешняяСистема, ЭтотОбъект.ГруппаОбъектов, СтрокаВнешниеДанные.Идентификатор);
						
					Иначе
						СправочникОбъект = СсылкаНаОбъект.ПолучитьОбъект();
						СправочникОбъект.Заблокировать();
						
					КонецЕсли;
					
				Иначе
					СсылкаНаОбъект = МенеджерОбъекта.НайтиПоРеквизиту(ПравилоИмпорта.ПолеВладельца, СтрокаВнешниеДанные[ПравилоИмпорта.ПолеВладельца]);
					
					Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда // подчиненные справочники не создаем
						Продолжить;
					КонецЕсли;
					
					СправочникОбъект = СсылкаНаОбъект.ПолучитьОбъект();
					СправочникОбъект.Заблокировать();
						
				КонецЕсли;
				
				// заполним реквизиты объекта и запишем его в базу
				ОписаниеРасхождений = "";
				ЭтоНовыйОбъект      = СправочникОбъект.ЭтоНовый();
				
				// Для дробной и неиспользуемой акции Интер РАО меняем наименование
				Если ПравилоИмпорта.ПриемникДанных = "Справочники.Акции"
					И ВСоставеЕстьНеиспользуемаяАкцияИнтерРАО
					И СсылкаНаОбъект = НеиспользуемаяАкцияИнтерРАО Тогда
					СтрокаВнешниеДанные.Наименование = СтрокаВнешниеДанные.Наименование + " (дробная, не используется)";
				КонецЕсли;
				
				Если НайтиУстранитьРасхожденияВСправочнике(СправочникОбъект, СтрокаВнешниеДанные, ОбновляемыеРеквизиты, ВнешняяСистема, ОписаниеРасхождений, РезультатОбновления) = Неопределено Тогда
					// если не удалось записать подчиненный объект - отменим транзакции на всех уровнях вложенности	
					ОтменитьТранзакции(ГлубинаРекурсии); 
					ТипыДанныхДляОповещения = Неопределено;
					Возврат Неопределено;
				КонецЕсли;
				
				Если Не ПравилоИмпорта.ПодчиненныйСправочник Тогда
					НоваяСтрокаОбработанныеОбъекты = ОбработанныеОбъекты.Добавить();
					НоваяСтрокаОбработанныеОбъекты.Идентификатор    = СтрокаВнешниеДанные.Идентификатор;
					НоваяСтрокаОбработанныеОбъекты.Объект           = СсылкаНаОбъект;
					НоваяСтрокаОбработанныеОбъекты.НовыйОбъект      = ЭтоНовыйОбъект;
					НоваяСтрокаОбработанныеОбъекты.ОписаниеДействия = ОписаниеРасхождений;
						
					ПараметрыВыборкиДанных.ОбработанныеОбъекты = ОбработанныеОбъекты;
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ГруппаОбъектовМД = "регистрысведений" Тогда
			Если ТипыДанныхДляОповещения.Найти(Тип("РегистрСведенийКлючЗаписи." + ИмяОбъектаМД)) = Неопределено Тогда
				ТипыДанныхДляОповещения.Добавить(Тип("РегистрСведенийКлючЗаписи." + ИмяОбъектаМД));
			КонецЕсли;
			
			Если ИмяОбъектаМД = "НоминалыЦенныхБумаг" Тогда 
			    РассчитатьНоминалыЦенныхБумаг(ВнешниеДанные);
			ИначеЕсли ИмяОбъектаМД = "СвязанныеЮридическиеЛица" Тогда
				ВнешниеДанные = ПодготовитьСвязанныеЮридическиеЛицаКЗаписи(ВнешниеДанные);
			ИначеЕсли ИмяОбъектаМД = "КупонныйДоходПоОблигациям" Тогда
				ПодготовитьКупонныйДоходПоОблигациям(ВнешниеДанные, Ошибки);
				ЗарегистрироватьОшибки(Ошибки, РезультатОбновления);
			ИначеЕсли ИмяОбъектаМД = "ДефолтыПоОблигациям" Тогда
				// Выделяем строки с техническим дефолтом и с обычным
				ПодготовитьДефолтыПоОблигациям(ВнешниеДанные);
			ИначеЕсли ИмяОбъектаМД = "РасчетныеЦеныПаев" Тогда
				// Исключим из внешних данных цены за периоды нашего ДУ,
				// и дополним внешние данные данными регистра "Расчетные цены паев"
				// за периоды нашего ДУ.
				ПодготовитьРасчетныеЦеныПаев(ВнешниеДанные);
			КонецЕсли; 
					
			// выделим ключевые поля, по которым читать набор записей
			КлючевыеПоля = Новый Массив(); 
			
			Для Каждого Измерение Из ОбъектМД.Измерения Цикл
				
				Если Измерение.Ведущее Тогда
					КлючевыеПоля.Добавить(Измерение.Имя);
				КонецЕсли;
				
			КонецЦикла;
			
			// Данные регистра "КодыВоВнешнихСистемах" импортируются с указанием значения измерения "Внешняя система" = "Матрих"
			// Данные регистра "Перечни объектов" импортируются с указанием значения измерения "Внешняя система" = "Центральный банк РФ".
			// Чтобы не затирать данные этих регистров по другим внешним системам добавим поля Не Ведущих измерений.
			Если ИмяОбъектаМД = "КодыВоВнешнихСистемах" Тогда	
				КлючевыеПоля.Добавить("ВнешняяСистема");
				КлючевыеПоля.Добавить("ГруппаОбъектов");
			ИначеЕсли ИмяОбъектаМД = "ПеречниОбъектов" Тогда
				КлючевыеПоля.Добавить("ВнешняяСистема");		
			КонецЕсли;
			
			КлючевыеПоляСтр = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(КлючевыеПоля, ", ");
			
			ВспомогательныеДанные = Новый Структура;
			//	Для реквизитов юридических лиц заранее формируем список юр. лиц депозитариев, банков, брокеров.
			//  Требуется для формирования оповещений
			Если ИмяОбъектаМД = "РеквизитыЮридическихЛиц" Тогда
				ВспомогательныеДанные.Вставить("ЮридическиеЛицаПоДействующимСчетамДУ", РаботаСНормативноСправочнойИнформацией.ЮридическиеЛицаИспользуемыеДействующимиСчетамДоверительногоУправления(ТекущаяДатаСеанса()));
			КонецЕсли;
			
			// обновим данные регистра сведений
			ВариантыЗначенийКлючевыхПолей = ВнешниеДанные.Скопировать(, КлючевыеПоляСтр);
			ВариантыЗначенийКлючевыхПолей.Свернуть(КлючевыеПоляСтр);
			
			Для Каждого ВариантЗначенийКлючевыхПолей Из ВариантыЗначенийКлючевыхПолей Цикл
				ЗначенияКлючевыхПолей = Новый Структура(КлючевыеПоляСтр);
				ЗаполнитьЗначенияСвойств(ЗначенияКлючевыхПолей, ВариантЗначенийКлючевыхПолей);
				
				ОписаниеРасхождений = "";
				
				Результат = НайтиУстранитьРасхожденияВРегистреСведений(ИмяОбъектаМД, ВнешниеДанные.Скопировать(ЗначенияКлючевыхПолей), КлючевыеПоля, ЗначенияКлючевыхПолей, ОписаниеРасхождений, РезультатОбновления, ВспомогательныеДанные);
				
				Если Результат = Неопределено Тогда
					// если не удалось записать подчиненный объект - отменим транзакции на всех уровнях вложенности	
					ОтменитьТранзакции(ГлубинаРекурсии); 
					ТипыДанныхДляОповещения = Неопределено;
					Возврат Неопределено;
					
				ИначеЕсли Результат = Истина Тогда
					
					СтрокаОбработанныеОбъекты = Неопределено; 
					
					// Изменения регистра "КодыВоВнешнихСистемах" не попадают в отчет с описанием, т.к. количество ключевых полей > 1 (неявный признак).   
					Если КлючевыеПоля.Количество() = 1 Или ИмяОбъектаМД = "ПеречниОбъектов" Тогда
						
						ЗначениеКлюч = ?(КлючевыеПоля.Количество() = 1, ЗначенияКлючевыхПолей[КлючевыеПоля[0]], ЗначенияКлючевыхПолей.Объект); 
						СтрокаОбработанныеОбъекты = ОбработанныеОбъекты.Найти(ЗначениеКлюч, "Объект");
						
						Если СтрокаОбработанныеОбъекты <> Неопределено Тогда
							
							СтрокаОбработанныеОбъекты.ОписаниеДействия = СтрокаОбработанныеОбъекты.ОписаниеДействия
								+ ?(ПустаяСтрока(СтрокаОбработанныеОбъекты.ОписаниеДействия), "", Символы.ПС) + "Изменены записи регистра сведений " + Метаданные.РегистрыСведений[ИмяОбъектаМД].Представление()
								+ Символы.ПС + ОписаниеРасхождений;
								
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокиСОшибками.Свернуть(КлючевыеПоляСтр);
				
		КонецЕсли;
		
		ПрерватьОбработкуПравил = Ложь;
		
		Для каждого СтрокаСОшибками Из СтрокиСОшибками Цикл
		
			Если ГруппаОбъектовМД = "справочники" Тогда
				
				ТекстСообщения = "Не удалось импортировать элемент справочника '" + Метаданные.Справочники[ИмяОбъектаМД].Представление() + "' с кодом '" + СтрокаСОшибками.Идентификатор + ". Ошибка при импорте связанных данных";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, ПрерватьОбработкуПравил);
				
				Если РезультатОбновления <> Неопределено Тогда
					РезультатОбновления.СообщенияОбОшибках.Добавить(ТекстСообщения);
				КонецЕсли;
				
			ИначеЕсли ГруппаОбъектовМД = "регистрысведений" Тогда 
				
				ОписаниеКлючевыхПолей = "";
				Для каждого КлючевоеПоле Из КлючевыеПоля Цикл
					ОписаниеКлючевыхПолей = ОписаниеКлючевыхПолей + ?(ПустаяСтрока(ОписаниеКлючевыхПолей), "", ", ") + КлючевоеПоле + " [" + СтрокаСОшибками[КлючевоеПоле] + "]";
				КонецЦикла;
				
				ТекстСообщения = "Не удалось импортировать записи регистра сведений '" + Метаданные.РегистрыСведений[ИмяОбъектаМД].Представление() + "', относящиеся к " + ОписаниеКлючевыхПолей + ". Ошибка при импорте связанных данных";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				Если РезультатОбновления <> Неопределено Тогда
					РезультатОбновления.СообщенияОбОшибках.Добавить(ТекстСообщения);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла; 
		
		Если ПрерватьОбработкуПравил Тогда
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ТранзакцияАктивна() Тогда
	
		ЗафиксироватьТранзакцию();
	
	КонецЕсли; 
	
	Для каждого СтрокаОбработанныеОбъекты Из ОбработанныеОбъекты Цикл
		
		Если СтрокаОбработанныеОбъекты.НовыйОбъект Тогда
			// по новым объекам загрузим котировки
			Если Метаданные.Обработки.ИмпортКотировокММВБ.Реквизиты.ЦеннаяБумага.Тип.СодержитТип(ТипЗнч(СтрокаОбработанныеОбъекты.Объект)) Тогда
		
				Обработки.ИмпортКотировокММВБ.ИмпортироватьКотировкиПоНовымЦеннымБумагам(СтрокаОбработанныеОбъекты.Объект, ЭтотОбъект.Метаданные().ПолноеИмя());
				
				ДополнительнаяОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_ИмпортРыночныхРисковНКЦ");
				Если ДополнительнаяОбработкаСсылка = Неопределено Тогда
					РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("Не удалось запустить импорт рыночных рисков НКЦ. Обработка '_ИмпортРыночныхРисковНКЦ' не найдена", "Импорт рыночных рисков НКЦ");
					
				Иначе
					
					Параметры = Новый Структура("ЦеннаяБумага", СтрокаОбработанныеОбъекты.Объект);
					
					Параметры.Вставить("ИсточникОшибки",	"Импорт рыночных рисков НКЦ");
					
					Параметры.Вставить("ТекстОшибки",		"Не удалось добавить отложенное задание '_ИмпортРыночныхРисковНКЦ.ИмпортироватьРыночныеРискиНКЦ'.");
					РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ДополнительнаяОбработкаСсылка, "ИмпортироватьРыночныеРискиНКЦ", Параметры, 15, Истина);
					
				КонецЕсли	
				
			КонецЕсли;
			// загрузим расчетные цены НРД
			Если Метаданные.Обработки.ИмпортРасчетныхЦен.Реквизиты.ЦеннаяБумага.Тип.СодержитТип(ТипЗнч(СтрокаОбработанныеОбъекты.Объект)) Тогда
				
				Обработки.ИмпортРасчетныхЦен.ИмпортироватьРасчетныеЦеныПоНовымЦеннымБумагам(СтрокаОбработанныеОбъекты.Объект, ЭтотОбъект.Метаданные().ПолноеИмя());
				
			КонецЕсли;			
			// загрузим рейтинги
			Если Метаданные.Обработки.ИмпортРейтингов.Реквизиты.Субъект.Тип.СодержитТип(ТипЗнч(СтрокаОбработанныеОбъекты.Объект)) 
				И Не (ТипЗнч(СтрокаОбработанныеОбъекты.Объект) = Тип("СправочникСсылка.ЮрФизЛица") И СтрокаОбработанныеОбъекты.Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо) Тогда
				
				УстановитьПривилегированныйРежим(Истина);

				ОбработкаИмпортРейтингов = Обработки.ИмпортРейтингов.Создать();
				ОбработкаИмпортРейтингов.Субъект = СтрокаОбработанныеОбъекты.Объект;
				ОбработкаИмпортРейтингов.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Метаданные().ПолноеИмя());
				ОбработкаИмпортРейтингов.ВыполнитьКоманду("КомандаИмпортировать");
				
				УстановитьПривилегированныйРежим(Ложь);
				
			КонецЕсли;
			
			Если Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.СодержитТип(ТипЗнч(СтрокаОбработанныеОбъекты.Объект)) Тогда
			
				// загрузим обязательства маркет-мейкеров				
				ДополнительнаяОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_ИмпортОбязательствМаркетМейкеров");
				Если ДополнительнаяОбработкаСсылка = Неопределено Тогда
					РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("Не удалось запустить импорт обязательств маркет-мейкеров. Обработка '_ИмпортОбязательствМаркетМейкеров' не найдена", "Импорт обязательств маркет-мейкеров");
					
				Иначе
					
					Параметры = Новый Структура("ЦеннаяБумага", СтрокаОбработанныеОбъекты.Объект);
					
					Параметры.Вставить("ТекстОшибки",		"Не удалось добавить отложенное задание '_ИмпортОбязательствМаркетМейкеров.ИмпортироватьМаркетМейкеровПоЦеннойБумаге'.");
					Параметры.Вставить("ИсточникОшибки",	"Импорт обязательств маркет-мейкеров");
					
					РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ДополнительнаяОбработкаСсылка, "ИмпортироватьМаркетМейкеровПоЦеннойБумаге", Параметры, 15, Истина);					
					
				КонецЕсли;
			
			КонецЕсли;
			
			Если ТипЗнч(СтрокаОбработанныеОбъекты.Объект) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
				
				// загрузим информацию по связанным лицам				
				ДополнительнаяОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_УправлениеСвязаннымиЛицами");
				Если ДополнительнаяОбработкаСсылка = Неопределено Тогда
					РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("Не удалось запустить импорт связанных лиц. Обработка '_УправлениеСвязаннымиЛицами' не найдена", "Импорт связанных лиц");
					
				Иначе
					
					Параметры = Новый Структура("СвязанноеЛицо", СтрокаОбработанныеОбъекты.Объект);
					
					Параметры.Вставить("ИсточникОшибки",	"Импорт связанных лиц");
					
					Параметры.Вставить("ТекстОшибки",		"Не удалось добавить отложенное задание '_УправлениеСвязаннымиЛицами.ИмпортироватьСведенияОСвязанныхЛицах'.");
					РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ДополнительнаяОбработкаСсылка, "ИмпортироватьСведенияОСвязанныхЛицах", Параметры, 15, Истина);
					
					Параметры.Вставить("ТекстОшибки",		"Не удалось добавить отложенное задание '_УправлениеСвязаннымиЛицами.ИмпортСвязанныхЛицИнфинитум'.");
					РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ДополнительнаяОбработкаСсылка, "ИмпортСвязанныхЛицИнфинитум", Параметры, 15, Истина);
					
				КонецЕсли;
				
				Если СтрокаОбработанныеОбъекты.Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
				
					// загрузим обязательства маркет-мейкеров				
					ДополнительнаяОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_ИмпортОбязательствМаркетМейкеров");
					Если ДополнительнаяОбработкаСсылка = Неопределено Тогда
						РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("Не удалось запустить импорт обязательств маркет-мейкеров. Обработка '_ИмпортОбязательствМаркетМейкеров' не найдена", "Импорт обязательств маркет-мейкеров");
						
					Иначе
						
						Параметры = Новый Структура("ЮрФизЛицо", СтрокаОбработанныеОбъекты.Объект);
						
						Параметры.Вставить("ТекстОшибки",		"Не удалось добавить отложенное задание '_ИмпортОбязательствМаркетМейкеров.ИмпортироватьОбязательстваМаркетМейкера'.");
						Параметры.Вставить("ИсточникОшибки",	"Импорт обязательств маркет-мейкеров");
						
						РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ДополнительнаяОбработкаСсылка, "ИмпортироватьОбязательстваМаркетМейкера", Параметры, 15, Истина);					
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли; 
				
		КонецЕсли;
		
	КонецЦикла;
	
	// отобразим импортированные объекты
	Для каждого СтрокаОбработанныеОбъекты Из ОбработанныеОбъекты Цикл
		
		СтрокиИмпортируемыеОбъекты = ЭтотОбъект.ИмпортируемыеОбъекты.НайтиСтроки(Новый Структура("КодВоВнешнейСистеме", СтрокаОбработанныеОбъекты.Идентификатор));
		
		Для каждого СтрокаИмпортируемыеОбъекты Из СтрокиИмпортируемыеОбъекты Цикл
			СтрокаИмпортируемыеОбъекты.Объект = СтрокаОбработанныеОбъекты.Объект;
		КонецЦикла;
		
		НоваяСтрока						= ИнформацияОбОбновлении.Добавить();
		НоваяСтрока.Объект				= СтрокаОбработанныеОбъекты.Объект;
		НоваяСтрока.ГруппаОбъектов		= ЭтотОбъект.ГруппаОбъектов;
		НоваяСтрока.КодВоВнешнейСистеме	= СтрокаОбработанныеОбъекты.Идентификатор;
		
		Если СтрокаОбработанныеОбъекты.НовыйОбъект Тогда
			
			ТекстСообщения = "'" + СтрокаОбработанныеОбъекты.Объект + "' (" + ЭтотОбъект.ГруппаОбъектов + ", " + СтрокаОбработанныеОбъекты.Идентификатор + ") импортирован из " + ВнешняяСистема;
			
			НоваяСтрока.Создан = Истина;
			
		Иначе		
			
			Если ЗначениеЗаполнено(СтрокаОбработанныеОбъекты.ОписаниеДействия) Тогда
				
				ТекстСообщения = "'" + СтрокаОбработанныеОбъекты.Объект + "' (" + ЭтотОбъект.ГруппаОбъектов + ", " + СтрокаОбработанныеОбъекты.Идентификатор + ") обновлен из " + ВнешняяСистема + ":" + Символы.ПС + СтрокаОбработанныеОбъекты.ОписаниеДействия;
				
				НоваяСтрока.Обновлен			= Истина;
				НоваяСтрока.ОписаниеИзменений	= СтрокаОбработанныеОбъекты.ОписаниеДействия;
				
			Иначе
				ТекстСообщения = "Обновление '" + СтрокаОбработанныеОбъекты.Объект + "' (" + ЭтотОбъект.ГруппаОбъектов + ", " + СтрокаОбработанныеОбъекты.Идентификатор + ") из " + ВнешняяСистема + " не требуется";
			КонецЕсли;
			
		КонецЕсли;
		
		Если НоваяСтрока.Создан И Не ЭтотОбъект.НеСообщатьОСозданииНовыхОбъектов
			ИЛИ НоваяСтрока.Обновлен И Не ЭтотОбъект.НеСообщатьОбИзмененииОбъектов
			ИЛИ Не НоваяСтрока.Создан И Не НоваяСтрока.Обновлен И Не ЭтотОбъект.НеСообщатьОбОтсутствииИзменений 
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, СтрокаОбработанныеОбъекты.Объект);
		КонецЕсли;
		
		РегистрыСведений.ОбновленияОбъектовИзВнешнихСистем.ЗарегистрироватьДатуОбновления(СтрокаОбработанныеОбъекты.Объект, ВнешняяСистема, ТекстСообщения);
		
	КонецЦикла;
	
	Если РезультатОбновления = Неопределено Тогда
		Обработки.ИмпортНормативноСправочнойИнформации.ОтправитьОтчетОЗамещающихОблигациях(ИнформацияОбОбновлении);	
		
		Обработки.ИмпортНормативноСправочнойИнформации.СформироватьОтчетОбОбновленииДляБухгалтерии(ИнформацияОбОбновлении);
		
	КонецЕсли;
 
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат ОбработанныеОбъекты.ВыгрузитьКолонку("Объект");
	
КонецФункции // ИмпортироватьДанные

Функция ПолучитьДанныеДляВыбора(СтрокаПоиска = "") Экспорт

	// получим данные из внешней системы
	СтрокаСоединения = ПолучитьСтрокуСоединенияССерверомДанных(ЭтотОбъект.ГруппаПравил);
	Если ПустаяСтрока(СтрокаСоединения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правилах импорта для группы правил «" + ЭтотОбъект.ГруппаПравил + "» не задана строка соединения с сервером данных.");
		Возврат Неопределено;
	КонецЕсли;
	
	ВнешняяСистема = ПолучитьВнешнююСистему(ЭтотОбъект.ГруппаПравил);
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правилах импорта для группы правил «" + ЭтотОбъект.ГруппаПравил + "» не задана внешняя система, из которой осуществляется импорт данных.");
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьЗапросДляВыбораДанных(ЭтотОбъект.ГруппаПравил, ЭтотОбъект.ГруппаОбъектов,, СтрокаПоиска);
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В правилах импорта для группы объектов «" + ЭтотОбъект.ГруппаОбъектов + "» из группы правил «" + ЭтотОбъект.ГруппаПравил + "» не задан текст запроса к серверу данных на получение данных для интерактивного выбора.");
		Возврат Неопределено;
	КонецЕсли;
	
	ВнешниеДанные = ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, Новый Структура);
	Если ВнешниеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// проверим, что в полученной таблице есть поля Идентификатор и Представление
	Если ВнешниеДанные.Колонки.Найти("Идентификатор") = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В данных, полученных для интерактивного выбора, отсутствует поле «Идентификатор»");
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВнешниеДанные.Колонки.Найти("Представление") = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В данных, полученных для интерактивного выбора, отсутствует поле «Представление»");
		Возврат Неопределено;
	КонецЕсли;	
	
	// определим ранее импортированные объекты
	ПоляВнешнихДанных = "";
	Для каждого Колонка Из ВнешниеДанные.Колонки Цикл
		ПоляВнешнихДанных = ПоляВнешнихДанных + ?(ПустаяСтрока(ПоляВнешнихДанных), "", ", ") + Колонка.Имя;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	" + ПоляВнешнихДанных + "
		|ПОМЕСТИТЬ ВнешниеДанные
		|ИЗ
		|	&ВнешниеДанные КАК ВнешниеДанные
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
	    |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ КодыВоВнешнихСистемах
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Период,
		|			ВнешняяСистема = &ВнешняяСистема
		|				И ГруппаОбъектов = &ГруппаОбъектов) КАК КодыВоВнешнихСистемахСрезПоследних
		|ИНДЕКСИРОВАТЬ ПО
		|	Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   ВнешниеДанные.*,
		|	КодыВоВнешнихСистемах.Объект
		|ИЗ
		|	ВнешниеДанные
		|	ЛЕВОЕ СОЕДИНЕНИЕ КодыВоВнешнихСистемах ПО ВнешниеДанные.Идентификатор = КодыВоВнешнихСистемах.Код
		|" + ?(ЭтотОбъект.СкрыватьРанееЗагруженныеДанные, "ГДЕ КодыВоВнешнихСистемах.Объект ЕСТЬ NULL", "") + "
		|УПОРЯДОЧИТЬ ПО
		|	ВнешниеДанные.Представление";
	
	Запрос.УстановитьПараметр("Период",         ТекущаяДата());
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("ГруппаОбъектов", ЭтотОбъект.ГруппаОбъектов);
	Запрос.УстановитьПараметр("ВнешниеДанные",  ВнешниеДанные);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРАВИЛА ЗАГРУЗКИ

Функция ПолучитьГруппыПравил() Экспорт
	
	ГруппыПравил = Новый Массив;
	
	ВыборкаXPath = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил");
	Пока 1 = 1 Цикл
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать
		КонецЕсли;
		
		ИмяГруппыПравил = ЭлементDOM.ПолучитьАтрибут("Имя");
		Если ПустаяСтрока(ИмяГруппыПравил) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано имя группы правил в секции '//ПравилаИмпорта/ГруппаПравил'");
			Продолжить;
		КонецЕсли;
		
		ГруппыПравил.Добавить(ИмяГруппыПравил);
	КонецЦикла;
	
	Возврат ГруппыПравил;

КонецФункции // ПолучитьГруппыПравил

Функция ПолучитьГруппыИмпортируемыхОбъектов(ИмяГруппыПравил, ТолькоПриНаличииВыбора = Истина) Экспорт
	
	ГруппыОбъектов = Новый СписокЗначений;
		
	ВыборкаXPath = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил[@Имя=""" + ИмяГруппыПравил + """]/ПравилоИмпорта");
	Пока 1 = 1 Цикл
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ИмяГруппыОбъектов = ЭлементDOM.ПолучитьАтрибут("ГруппаОбъектов");
		Если ПустаяСтрока(ИмяГруппыОбъектов) Тогда
			Сообщить("Не указана группа объектов в секции 'ПравилоИмпорта'.");
			Продолжить;
		КонецЕсли;
		
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуОбъекта(ИмяГруппыОбъектов);
		Если Не ЗначениеЗаполнено(ГруппаОбъектов) Тогда
			Сообщить("Не удалось получить группу импортируемых объектов по имени «" + ИмяГруппыОбъектов + "»");
			Продолжить;
		КонецЕсли;
		
		Если ТолькоПриНаличииВыбора Тогда
			ВыборкаXPath1 = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил[@Имя=""" + ИмяГруппыПравил + """]/ПравилоИмпорта[@ГруппаОбъектов=""" + ИмяГруппыОбъектов + """]/Выбор");
			Если ВыборкаXPath1.ПолучитьСледующий() = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ГруппыОбъектов.Добавить(ГруппаОбъектов);
	КонецЦикла;
	
	Возврат ГруппыОбъектов;
	
КонецФункции // ПолучитьГруппыИмпортируемыхОбъектов

Функция ПолучитьСтрокуСоединенияССерверомДанных(ИмяГруппыПравил)
	
	СтрокаСоединений = "";
	
	ВыборкаXPath = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил[@Имя=""" + ИмяГруппыПравил + """]");
	Пока 1 = 1 Цикл
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM <> Неопределено Тогда
			СтрокаСоединений = ЭлементDOM.ПолучитьАтрибут("ИсточникДанных");
		КонецЕсли;

		Прервать;
	КонецЦикла;
	
	Возврат СтрокаСоединений;
	
КонецФункции // ПолучитьСтрокуСоединенияССерверомДанных

Функция ПолучитьВнешнююСистему(ИмяГруппыПравил)
	
	ВнешняяСистема = Неопределено;
	
	ВыборкаXPath = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил[@Имя=""" + ИмяГруппыПравил + """]");
	Пока 1 = 1 Цикл
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM <> Неопределено Тогда
			Попытка
				ВнешняяСистема = Справочники.ВнешниеСистемы[ЭлементDOM.ПолучитьАтрибут("ВнешняяСистема")];
			Исключение
			КонецПопытки;
		КонецЕсли;

		Прервать;
	КонецЦикла;
	
	Возврат ВнешняяСистема;
		
КонецФункции // ПолучитьВнешнююСистему

Функция ПолучитьПоляДляПоискаПоСтроке(ЭлементDOM = Неопределено, ИмяГруппыПравил = "", ИмяГруппыОбъектов = "") Экспорт
	
	// получим поля для поиска по строке
	Если ЭлементDOM = Неопределено Тогда
		ВыборкаXPath = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил[@Имя=""" + ИмяГруппыПравил + """]/ПравилоИмпорта[@ГруппаОбъектов=""" + ИмяГруппыОбъектов + """]/Выбор/ПоляДляПоискаПоСтроке");
		ЭлементDOM   = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
		
	ПоляДляПоискаПоСтроке = Новый СписокЗначений;
		
	Для каждого ПодчЭлементDOM Из ЭлементDOM.ДочерниеУзлы Цикл
		Если ПодчЭлементDOM.ТипУзла = ТипУзлаDOM.Элемент И ВРег(ПодчЭлементDOM.ИмяУзла) = ВРег("ПолеДляПоискаПоСтроке") Тогда
			Попытка
				ПоляДляПоискаПоСтроке.Добавить(
					ПодчЭлементDOM.Атрибуты.ПолучитьИменованныйЭлемент("ШаблонПоиска").Значение,
					ПодчЭлементDOM.Атрибуты.ПолучитьИменованныйЭлемент("ИмяПоля").Значение);
			Исключение
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоляДляПоискаПоСтроке
	
КонецФункции // ПолучитьПоляДляПоискаПоСтроке

Функция ПолучитьЗапросДляВыбораДанных(ИмяГруппыПравил, ГруппыОбъектов, ОграничениеКоличестваЗаписей = 0, СтрокаПоиска = "")
	ТекстЗапроса          = Неопределено;
	ПоляДляПоискаПоСтроке = Неопределено;
	
	ВыборкаXPath = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил[@Имя=""" + ИмяГруппыПравил
		+ """]/ПравилоИмпорта[@ГруппаОбъектов=""" + ПолучитьИмяГруппыОбъектов(ГруппаОбъектов) + """]/Выбор");
	Пока Истина Цикл
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		// Среди подчиненных узлов должны быть <ТекстЗапроса> и <ПоляДляПоискаПоСтроке> или просто лежит текст запроса
		Для Каждого ПодчЭлементDOM Из ЭлементDOM.ДочерниеУзлы Цикл
			Если      ПодчЭлементDOM.ТипУзла = ТипУзлаDOM.Текст Тогда
				ТекстЗапроса = СокрЛП(ПодчЭлементDOM.ЗначениеУзла);
				Прервать
			ИначеЕсли ПодчЭлементDOM.ТипУзла = ТипУзлаDOM.Элемент Тогда
				Если      ВРег(ПодчЭлементDOM.ИмяУзла) = ВРег("ТекстЗапроса") Тогда
					ТекстЗапроса = ПолучитьТекстЭлементаDOM(ПодчЭлементDOM);
				ИначеЕсли ВРег(ПодчЭлементDOM.ИмяУзла) = ВРег("ПоляДляПоискаПоСтроке") Тогда
					ПоляДляПоискаПоСтроке = ПолучитьПоляДляПоискаПоСтроке(ПодчЭлементDOM);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Учтём ограничение на кол-во отображаемых записей
	Если (ОграничениеКоличестваЗаписей > 0) И (ВРег(Лев(ТекстЗапроса, 6)) = "SELECT") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "SELECT", "SELECT TOP " + Формат(ОграничениеКоличестваЗаписей, "ЧГ=0"));
	КонецЕсли;
	
	// Дополним запрос данными для поиска
	Если Не ПустаяСтрока(СтрокаПоиска) И ЗначениеЗаполнено(ПоляДляПоискаПоСтроке) Тогда
		УсловиеДляПоиска = "";
		ЭкранированнаяСтрокаПоиска = СтрЗаменить(СтрокаПоиска, "'", "''");
		Для Каждого ЭлементСписка Из ПоляДляПоискаПоСтроке Цикл
			УсловиеДляПоиска = УсловиеДляПоиска + ?(ПустаяСтрока(УсловиеДляПоиска), "", " OR ") + СтрЗаменить(ЭлементСписка.Значение, "&СтрокаПоиска", ЭкранированнаяСтрокаПоиска);
		КонецЦикла;
		
		ВТекстЗапроса       = ВРег(ТекстЗапроса);
		ВЗапросеЕстьУсловие = (Найти(ВТекстЗапроса, Символы.ПС + "WHERE") > 0 Или Найти(ВТекстЗапроса, Символы.Таб + "WHERE") > 0 Или Найти(ВТекстЗапроса, " WHERE") > 0);
		
		Если ВЗапросеЕстьУсловие Тогда
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.Таб + "AND (" + УсловиеДляПоиска + ")";
		Иначе
			ТекстЗапроса = ТекстЗапроса + УсловиеДляПоиска;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции // ПолучитьЗапросДляВыбораДанных

Функция ПолучитьПравилаИмпорта(ИмяГруппыПравил, ГруппаОбъектов, ИдентификаторыВыбранныхОбъектов = "")

	ПравилаИмпорта = Новый Массив();
	
	ВыборкаXPath = ВыполнитьЗапросXPathКПравиламИмпорта("//ПравилаИмпорта/ГруппаПравил[@Имя=""" + ИмяГруппыПравил + """]/ПравилоИмпорта[@ГруппаОбъектов=""" + ПолучитьИмяГруппыОбъектов(ГруппаОбъектов) + """]/Импорт");
	Пока 1 = 1 Цикл
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Для каждого ДочернийУзелDOM Из ЭлементDOM.ДочерниеУзлы Цикл
			ТекстЗапроса      	= "";
			ТипИдентификатора	= "";
			
			Если ДочернийУзелDOM.ЕстьДочерниеУзлы() Тогда
				ТипИдентификатора = ВРег(СокрЛП(?(ДочернийУзелDOM.ПолучитьАтрибут("ТипИдентификатора") = Неопределено, "Число", "Строка")));
				
				Если ДочернийУзелDOM.ПервыйДочерний.ТипУзла = ТипУзлаDOM.Текст Тогда
					ИдентификаторыВыбранныхОбъектовСтрокой = "";
					Для каждого ИдентификаторВыбранногоОбъекта Из ИдентификаторыВыбранныхОбъектов Цикл
						ИдентификаторыВыбранныхОбъектовСтрокой = ИдентификаторыВыбранныхОбъектовСтрокой + ?(ПустаяСтрока(ИдентификаторыВыбранныхОбъектовСтрокой), "", ", ")
							+ ?(ТипИдентификатора = "СТРОКА", "'", "") + ИдентификаторВыбранногоОбъекта + ?(ТипИдентификатора = "СТРОКА", "'", "");
					КонецЦикла;
					
					ТекстЗапроса = СокрЛП(ДочернийУзелDOM.ПервыйДочерний.ЗначениеУзла);
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторыВыбранныхОбъектов", ИдентификаторыВыбранныхОбъектовСтрокой);
				КонецЕсли;
			КонецЕсли;
			
			ПравилоИмпорта = Новый Структура("ПриемникДанных, Режим, ПодчиненныйСправочник, ПолеВладельца, ТекстЗапроса, ТипИдентификатора",
				ДочернийУзелDOM.ПолучитьАтрибут("Приемник"),
				?(ПустаяСтрока(ДочернийУзелDOM.ПолучитьАтрибут("Режим")), "", ДочернийУзелDOM.ПолучитьАтрибут("Режим")),
				?(ВРег(ДочернийУзелDOM.ПолучитьАтрибут("ПодчиненныйСправочник")) = "ДА", Истина, Ложь),
				?(ПустаяСтрока(ДочернийУзелDOM.ПолучитьАтрибут("ПолеВладельца")), "Владелец", ДочернийУзелDOM.ПолучитьАтрибут("ПолеВладельца")),
				ТекстЗапроса,
				ТипИдентификатора);
				
			Если ПравилоИмпорта.Режим = "ВызовФункции" Тогда
				ПравилоИмпорта.Вставить("ИмяФункции", ДочернийУзелDOM.ПолучитьАтрибут("ИмяФункции"));	
			КонецЕсли;
				
			ПравилаИмпорта.Добавить(ПравилоИмпорта);
		КонецЦикла;
	КонецЦикла;

	Возврат ПравилаИмпорта;

КонецФункции // ПолучитьПравилаИмпорта

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Процедура ПодготовитьОблигации(ВнешниеДанные, ДанныеДляЗагрузки)
	
	СкорректироватьДатуПогашенияПропертизФинанс(ВнешниеДанные, ДанныеДляЗагрузки);	
	
	// #359993: из Матрикса должна приходить базовая ставка, но пока не приходит
	
	Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Сбербанк_002P"); // Сбербанк ПАО, 4-02-01481-B-002P, 10000000.00 RUB
	Если Облигация = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаДанныеДляЗагрузки = ДанныеДляЗагрузки.Найти(Облигация, "Объект");
	Если СтрокаДанныеДляЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура("Идентификатор", СтрокаДанныеДляЗагрузки.Идентификатор));
	
	Для Каждого СтрокаОблигации Из НайденныеСтроки Цикл
		Если СтрокаОблигации.БазоваяСтавка = Справочники.БазовыеСтавкиОблигаций.ПустаяСсылка() Тогда
			СтрокаОблигации.БазоваяСтавка = Справочники.БазовыеСтавкиОблигаций.НайтиПоНаименованию("GCurve (OFZ)", Истина);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьРасчетныеЦеныПаев(ВнешниеДанные)
	
	// Включаем привелегированный режим, т.к. будем выбирать данные по организациям,
	// которые пользователю могут быть недоступны.
	УстановитьПривилегированныйРежим(Истина);
	
	// Колонки передаваемой в запрос ТЗ должны быть строго типизированы,
	// поэтому придется создать такую ТЗ и заполнить ее из внешних данных.
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Период",			Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ЦеннаяБумага",		Новый ОписаниеТипов("СправочникСсылка.Паи"));
	ТЗ.Колонки.Добавить("РасчетнаяЦена",	Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("КоличествоПаев",	Новый ОписаниеТипов("Число"));
	
	РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ВнешниеДанные, ТЗ);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Паи",			ИмпортируемыеОбъекты.ВыгрузитьКолонку("Объект"));
	Запрос.УстановитьПараметр("ВнешниеДанные",	ТЗ);
	
	// Запрос получает данные регистра "РасчетныеЦеныПаев" по импортируемым паям за периоды нахождения под нашим ДУ,
	// из внешних данных исключает сведения за периоды нахождения ПИФа под нашим ДУ,
	// в качестве результата вернет объединение этих двух множеств.
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Организации.ЮрФизЛицо КАК ЮрЛицоОрганизации
		|ПОМЕСТИТЬ _ЮрЛицаОрганизаций
		|ИЗ
		|	Справочник.Организации КАК Организации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Паи.ПаевойИнвестиционныйФонд КАК ПИФ,
		|	Паи.Ссылка КАК Пай
		|ПОМЕСТИТЬ _Паи
		|ИЗ
		|	Справочник.Паи КАК Паи
		|ГДЕ
		|	Паи.Ссылка В(&Паи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК ПИФ,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо КАК ЮрЛицоОрганизации
		|ПОМЕСТИТЬ _ИсключаемыеИзПериодовНашегоДУСДУ
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления).Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления)
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Свойство.Ключ = ""УчетНеВедется""
		|	И ЗначенияДополнительныхСведений.Значение = ИСТИНА
		|	И ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|	И КлиентыДоверительногоУправленияСрезПоследних.Клиент В
		|			(ВЫБРАТЬ
		|				_Паи.ПИФ КАК ПИФ
		|			ИЗ
		|				_Паи КАК _Паи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Паи.ПИФ КАК ПИФ,
		|	_Паи.Пай КАК Пай,
		|	РеквизитыПИФ.Период КАК Период,
		|	РеквизитыПИФ.УправляющаяКомпания.ЮрФизЛицо КАК ЮрЛицоУК
		|ПОМЕСТИТЬ _УКПоПаям
		|ИЗ
		|	РегистрСведений.РеквизитыПИФ КАК РеквизитыПИФ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Паи КАК _Паи
		|		ПО РеквизитыПИФ.ПаевойИнвестиционныйФонд = _Паи.ПИФ
		|ГДЕ
		|	РеквизитыПИФ.ПаевойИнвестиционныйФонд В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_Паи.ПИФ КАК ПИФ
		|			ИЗ
		|				_Паи КАК _Паи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УКПоПаям.Пай КАК Пай,
		|	_УКПоПаям.Период КАК Период,
		|	_УКПоПаям.ЮрЛицоУК КАК ЮрЛицоУК
		|ПОМЕСТИТЬ _НачалоНашегоДУ
		|ИЗ
		|	_УКПоПаям КАК _УКПоПаям
		|ГДЕ
		|	_УКПоПаям.ЮрЛицоУК В
		|			(ВЫБРАТЬ
		|				_ЮрЛицаОрганизаций.ЮрЛицоОрганизации КАК ЮрЛицоОрганизации
		|			ИЗ
		|				_ЮрЛицаОрганизаций КАК _ЮрЛицаОрганизаций)
		|	И НЕ (_УКПоПаям.ПИФ, _УКПоПаям.ЮрЛицоУК) В
		|				(ВЫБРАТЬ
		|					_ИсключаемыеИзПериодовНашегоДУСДУ.ПИФ КАК ПИФ,
		|					_ИсключаемыеИзПериодовНашегоДУСДУ.ЮрЛицоОрганизации КАК ЮрЛицоОрганизации
		|				ИЗ
		|					_ИсключаемыеИзПериодовНашегоДУСДУ КАК _ИсключаемыеИзПериодовНашегоДУСДУ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УКПоПаям.Пай КАК Пай,
		|	_УКПоПаям.Период КАК Период,
		|	_УКПоПаям.ЮрЛицоУК КАК ЮрЛицоУК
		|ПОМЕСТИТЬ _НачалоНеНашегоДУ
		|ИЗ
		|	_УКПоПаям КАК _УКПоПаям
		|ГДЕ
		|	(НЕ _УКПоПаям.ЮрЛицоУК В
		|					(ВЫБРАТЬ
		|						_ЮрЛицаОрганизаций.ЮрЛицоОрганизации КАК ЮрЛицоОрганизации
		|					ИЗ
		|						_ЮрЛицаОрганизаций КАК _ЮрЛицаОрганизаций)
		|			ИЛИ (_УКПоПаям.ПИФ, _УКПоПаям.ЮрЛицоУК) В
		|				(ВЫБРАТЬ
		|					_ИсключаемыеИзПериодовНашегоДУСДУ.ПИФ КАК ПИФ,
		|					_ИсключаемыеИзПериодовНашегоДУСДУ.ЮрЛицоОрганизации КАК ЮрЛицоОрганизации
		|				ИЗ
		|					_ИсключаемыеИзПериодовНашегоДУСДУ КАК _ИсключаемыеИзПериодовНашегоДУСДУ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НачалоНашегоДУ.Пай КАК Пай,
		|	_НачалоНашегоДУ.Период КАК Начало,
		|	МИНИМУМ(ЕСТЬNULL(_НачалоНеНашегоДУ.Период, НЕОПРЕДЕЛЕНО)) КАК Окончание
		|ПОМЕСТИТЬ _ПериодыНашегоДУ
		|ИЗ
		|	_НачалоНашегоДУ КАК _НачалоНашегоДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НачалоНеНашегоДУ КАК _НачалоНеНашегоДУ
		|		ПО _НачалоНашегоДУ.Пай = _НачалоНеНашегоДУ.Пай
		|			И _НачалоНашегоДУ.Период < _НачалоНеНашегоДУ.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_НачалоНашегоДУ.Пай,
		|	_НачалоНашегоДУ.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РасчетныеЦеныПаев.Период КАК Период,
		|	РасчетныеЦеныПаев.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РасчетныеЦеныПаев.РасчетнаяЦена КАК РасчетнаяЦена,
		|	РасчетныеЦеныПаев.КоличествоПаев КАК КоличествоПаев
		|ПОМЕСТИТЬ _ДанныеРегистра
		|ИЗ
		|	РегистрСведений.РасчетныеЦеныПаев КАК РасчетныеЦеныПаев
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыНашегоДУ КАК _ПериодыНашегоДУ
		|		ПО (ВЫРАЗИТЬ(РасчетныеЦеныПаев.ЦеннаяБумага КАК Справочник.Паи).Ссылка = _ПериодыНашегоДУ.Пай)
		|			И РасчетныеЦеныПаев.Период >= _ПериодыНашегоДУ.Начало
		|			И (ВЫБОР
		|				КОГДА _ПериодыНашегоДУ.Окончание = НЕОПРЕДЕЛЕНО
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ РасчетныеЦеныПаев.Период < _ПериодыНашегоДУ.Окончание
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ВнешниеДанные.Период КАК ДАТА) КАК Период,
		|	ВЫРАЗИТЬ(ВнешниеДанные.ЦеннаяБумага КАК Справочник.Паи) КАК ЦеннаяБумага,
		|	ВЫРАЗИТЬ(ВнешниеДанные.РасчетнаяЦена КАК ЧИСЛО) КАК РасчетнаяЦена,
		|	ВЫРАЗИТЬ(ВнешниеДанные.КоличествоПаев КАК ЧИСЛО) КАК КоличествоПаев
		|ПОМЕСТИТЬ _ВнешниеДанные
		|ИЗ
		|	&ВнешниеДанные КАК ВнешниеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнешниеДанные.Период КАК Период,
		|	_ВнешниеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВнешниеДанные.РасчетнаяЦена КАК РасчетнаяЦена,
		|	_ВнешниеДанные.КоличествоПаев КАК КоличествоПаев,
		|	СУММА(ВЫБОР
		|			КОГДА _ПериодыНашегоДУ.Пай ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК ПопаданиеВПериодДУ
		|ПОМЕСТИТЬ _ВнешниеДанныеСКоличествомПопаданийВПериодыДУ
		|ИЗ
		|	_ВнешниеДанные КАК _ВнешниеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыНашегоДУ КАК _ПериодыНашегоДУ
		|		ПО _ВнешниеДанные.ЦеннаяБумага = _ПериодыНашегоДУ.Пай
		|			И _ВнешниеДанные.Период >= _ПериодыНашегоДУ.Начало
		|			И (ВЫБОР
		|				КОГДА _ПериодыНашегоДУ.Окончание = НЕОПРЕДЕЛЕНО
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ _ВнешниеДанные.Период < _ПериодыНашегоДУ.Окончание
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВнешниеДанные.Период,
		|	_ВнешниеДанные.ЦеннаяБумага,
		|	_ВнешниеДанные.РасчетнаяЦена,
		|	_ВнешниеДанные.КоличествоПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнешниеДанныеСКоличествомПопаданийВПериодыДУ.Период КАК Период,
		|	_ВнешниеДанныеСКоличествомПопаданийВПериодыДУ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВнешниеДанныеСКоличествомПопаданийВПериодыДУ.РасчетнаяЦена КАК РасчетнаяЦена,
		|	_ВнешниеДанныеСКоличествомПопаданийВПериодыДУ.КоличествоПаев КАК КоличествоПаев
		|ПОМЕСТИТЬ _ВнешниеДанныеКЗагрузке
		|ИЗ
		|	_ВнешниеДанныеСКоличествомПопаданийВПериодыДУ КАК _ВнешниеДанныеСКоличествомПопаданийВПериодыДУ
		|ГДЕ
		|	_ВнешниеДанныеСКоличествомПопаданийВПериодыДУ.ПопаданиеВПериодДУ = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнешниеДанныеКЗагрузке.Период КАК Период,
		|	_ВнешниеДанныеКЗагрузке.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВнешниеДанныеКЗагрузке.РасчетнаяЦена КАК РасчетнаяЦена,
		|	_ВнешниеДанныеКЗагрузке.КоличествоПаев КАК КоличествоПаев
		|ИЗ
		|	_ВнешниеДанныеКЗагрузке КАК _ВнешниеДанныеКЗагрузке
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДанныеРегистра.Период,
		|	_ДанныеРегистра.ЦеннаяБумага,
		|	_ДанныеРегистра.РасчетнаяЦена,
		|	_ДанныеРегистра.КоличествоПаев
		|ИЗ
		|	_ДанныеРегистра КАК _ДанныеРегистра
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеннаяБумага,
		|	Период";
	#КонецОбласти
	
	ВнешниеДанные = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПодготовитьСвязанныеЮридическиеЛицаКЗаписи(СвязанныеЮридическиеЛица)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Период",						Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Колонки.Добавить("ЮридическоеЛицо",				Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	Результат.Колонки.Добавить("РодительскоеЮридическоеЛицо",	Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	Результат.Колонки.Добавить("ТипСвязи",						Новый ОписаниеТипов("СправочникСсылка.ТипыСвязейЮрФизЛиц"));
	Результат.Колонки.Добавить("Действует",						Новый ОписаниеТипов("Булево"));
	
	Для Каждого ТекСтрока Из СвязанныеЮридическиеЛица Цикл
		
		НоваяСтрока = Результат.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		НоваяСтрока.Период		= ТекСтрока.НачалоПериода;
		НоваяСтрока.Действует	= Истина;
		
		Если ЗначениеЗаполнено(ТекСтрока.КонецПериода) Тогда
			
			НоваяСтрока = Результат.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
			НоваяСтрока.Период		= ТекСтрока.КонецПериода;
			НоваяСтрока.Действует	= Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьКупонныйДоходПоОблигациям(КупонныйДоходПоОблигациям, Ошибки)
	
	СкорректироватьКупонныйДоход_АрчерФинанс(КупонныйДоходПоОблигациям);
	
	СкорректироватьКупонныйДоход_Пересвет(КупонныйДоходПоОблигациям);
	
	ЗаполнитьФормулыРасчетаПлавающихСтавок(КупонныйДоходПоОблигациям, Ошибки);	
	
КонецПроцедуры

Процедура СкорректироватьКупонныйДоход_АрчерФинанс(КупонныйДоходПоОблигациям)
	
	// По облигации Арчер Финанс ММВБ предоставляет неверные данные по 8му купонному периоду.
	// Установим их вручную.
	
	АрчерФинанс = Общегоназначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс");
	Если АрчерФинанс = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	НайдСтроки = КупонныйДоходПоОблигациям.НайтиСтроки(Новый Структура("Облигация", АрчерФинанс));
	Если НайдСтроки.Количество() = 0 Тогда
		// В наборе этой облигации нет, поэтому ничего не делаем
		Возврат;
	КонецЕсли;
	
	НайдСтроки = КупонныйДоходПоОблигациям.НайтиСтроки(Новый Структура("Облигация, Период", АрчерФинанс, '20171003'));
	Если НайдСтроки.Количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Во внешней системе изменились данные по купонному периоду облигации Арчер-Финанс! Необходимо проверить результат импорта!");
	Иначе
		ИзменяемаяСтрока = НайдСтроки[0];
		ИзменяемаяСтрока.ДатаОкончанияКупона 	= '20180403';
		ИзменяемаяСтрока.ДатаФиксации 			= '20180402';
		ИзменяемаяСтрока.ДатаВыплатыПлан 		= '20180518';
		ИзменяемаяСтрока.Срок 					= 182;
		ИзменяемаяСтрока.СуммаКупона 			= 0.01;
		ИзменяемаяСтрока.СтавкаКупона			= 0;		
	КонецЕсли;
	
	НайдСтроки = КупонныйДоходПоОблигациям.НайтиСтроки(Новый Структура("Облигация, Период", АрчерФинанс, '20180531'));
	Если НайдСтроки.Количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Во внешней системе изменились данные по купонному периоду облигации Арчер-Финанс! Необходимо проверить результат импорта!");
	Иначе
		ИзменяемаяСтрока = НайдСтроки[0];
		ИзменяемаяСтрока.Период					= '20180403';
		ИзменяемаяСтрока.Срок 					= 3276;
		ИзменяемаяСтрока.СуммаКупона 			= 996.85;
	КонецЕсли;
	
КонецПроцедуры

Процедура СкорректироватьКупонныйДоход_Пересвет(КупонныйДоходПоОблигациям)
	
	// По облигации Пересвет НРД предоставляет неверные по началу купонного периода
	// Установим дату начала вручную.
	
	Пересвет = Общегоназначения.ПолучитьИменованныйОбъект("Облигация_Пересвет");
	Если Пересвет = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	НайдСтроки = КупонныйДоходПоОблигациям.НайтиСтроки(Новый Структура("Облигация", Пересвет));
	Если НайдСтроки.Количество() = 0 Тогда
		// В наборе этой облигации нет, поэтому ничего не делаем
		Возврат;
	КонецЕсли;
	
	НайдСтроки = КупонныйДоходПоОблигациям.НайтиСтроки(Новый Структура("Облигация, Период", Пересвет, '20170214'));
	Если НайдСтроки.Количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Во внешней системе изменились данные по купонному периоду облигации АКБ ПЕРЕСВЕТ ПАО, 40402110B, 329.00 RUB! Необходимо проверить результат импорта!");
	Иначе
		ИзменяемаяСтрока = НайдСтроки[0];
		ИзменяемаяСтрока.Период 	= '20170321';	
	КонецЕсли;
			
КонецПроцедуры

Процедура ПодготовитьДефолтыПоОблигациям(ВнешниеДанные)
	
	// Выделяем отдельные строки с техническим дефолтом и с выходом из дефолта
	ТаблицаИзменена = Ложь;
	
	Для Индекс = 1 - ВнешниеДанные.Количество() По 0 Цикл
		
		ТекСтрокаДефолта = ВнешниеДанные[-Индекс];
			
		Если Не ЗначениеЗаполнено(ТекСтрокаДефолта.Период) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для ценной бумаги [" + ТекСтрокаДефолта.Облигация + "] не удалось загрузить данные о дефолте, статус [" + ТекСтрокаДефолта.СтатусДефолта + "]. В матрих не заполнена дата дефолта план.");
			ВнешниеДанные.Удалить(ТекСтрокаДефолта);
			Продолжить;	
		КонецЕсли;
		
		Если ТекСтрокаДефолта.СтатусДефолта = Перечисления.СтатусыДефолтаПоОблигациям.Дефолт И ЗначениеЗаполнено(ТекСтрокаДефолта.ДатаОкончания) И ТекСтрокаДефолта.Период < ТекСтрокаДефолта.ДатаОкончания Тогда
			 		
			// Добавляем новую строку с периодом дефолта от даты окончания текущей строки
			НайдСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура("Период, Облигация, ТипДефолта", ТекСтрокаДефолта.ДатаОкончания, ТекСтрокаДефолта.Облигация, ТекСтрокаДефолта.ТипДефолта));
			Если НайдСтроки.Количество() = 0 Тогда
				СтрокаДефолта = ВнешниеДанные.Добавить();
			Иначе
				СтрокаДефолта = НайдСтроки[0];
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаДефолта, ТекСтрокаДефолта);
			СтрокаДефолта.Период = ТекСтрокаДефолта.ДатаОкончания;
			
			// В текущей строке устанавливаем технический дефолт  		
			ТекСтрокаДефолта.СтатусДефолта = Перечисления.СтатусыДефолтаПоОблигациям.ТехническийДефолт;		
			
			ТаблицаИзменена = Истина;
			
		ИначеЕсли ТекСтрокаДефолта.СтатусДефолта = Перечисления.СтатусыДефолтаПоОблигациям.ТехническийДефолт И ЗначениеЗаполнено(ТекСтрокаДефолта.ДатаВыходаИзДефолта) И ТекСтрокаДефолта.Период <= ТекСтрокаДефолта.ДатаВыходаИзДефолта Тогда
			
			// Добавляем новую строку с периодом от даты выхода из дефолта текущей строки
			НайдСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура("Период, Облигация, ТипДефолта", ТекСтрокаДефолта.ДатаВыходаИзДефолта, ТекСтрокаДефолта.Облигация, ТекСтрокаДефолта.ТипДефолта));
			Если НайдСтроки.Количество() = 0 Тогда
				СтрокаДефолта = ВнешниеДанные.Добавить();
			Иначе
				СтрокаДефолта = НайдСтроки[0];
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаДефолта, ТекСтрокаДефолта);
			СтрокаДефолта.Период = ТекСтрокаДефолта.ДатаВыходаИзДефолта;
			
			СтрокаДефолта.СтатусДефолта = Перечисления.СтатусыДефолтаПоОблигациям.ВыходИзДефолта;
			
			ТаблицаИзменена = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Если нужно, сворачиваем и сортируем таблицу
	Если ТаблицаИзменена Тогда
		ВнешниеДанные.Сортировать("Период");
	КонецЕсли;
	
КонецПроцедуры 

Функция ВыполнитьЗапросXPathКПравиламИмпорта(ЗапросXPath)
	
	ПравилаЗагрузкиXML = ЭтотОбъект.ПолучитьМакет("ПравилаИмпорта").ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПравилаЗагрузкиXML);
	
	ПостроительDOM = Новый ПостроительDOM;
	
	ДокументDOM  = ПостроительDOM.Прочитать(ЧтениеXML);
	ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath(ЗапросXPath, ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));

	Возврат ВыборкаXPath;
	
КонецФункции // ВыполнитьЗапросXPathКПравиламИмпорта

Функция ПолучитьТекстЭлементаDOM(ЭлементDOM)
	
	Если ЭлементDOM.ЕстьДочерниеУзлы() Тогда
		Если ЭлементDOM.ПервыйДочерний.ТипУзла = ТипУзлаDOM.Текст Тогда
			Возврат СокрЛП(ЭлементDOM.ПервыйДочерний.ЗначениеУзла);
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ПолучитьТекстЭлементаDOM

Функция ПолучитьИмяГруппыОбъектов(ГруппаОбъектов)
	
	ИмяГруппыОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьИмяПредопределенного(ГруппаОбъектов);
	Если ПустаяСтрока(ИмяГруппыОбъектов) Тогда
		ИмяГруппыОбъектов = ГруппаОбъектов.Наименование;
	КонецЕсли;
	
	Возврат ИмяГруппыОбъектов;
	
КонецФункции // ПолучитьИмяГруппыОбъектов

Функция РассчитатьНоминалыЦенныхБумаг(Номиналы)
		
	ТекЦеннаяБумага = Справочники.Облигации.ПустаяСсылка();
	
	Для Каждого СтрокаНоминалы Из Номиналы Цикл
		Если СтрокаНоминалы.Номинал <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекЦеннаяБумага <> СтрокаНоминалы.ЦеннаяБумага Тогда
			ТекЦеннаяБумага = СтрокаНоминалы.ЦеннаяБумага;
			Номинал = СтрокаНоминалы.ЦеннаяБумага.Номинал - СтрокаНоминалы.СуммаИзменения;
		Иначе
			Номинал = Номинал - СтрокаНоминалы.СуммаИзменения;
		КонецЕсли; 
		
		СтрокаНоминалы.Номинал = Номинал;
	КонецЦикла; 

КонецФункции // РассчитатьНоминалыЦенныхБумаг

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	ПараметрыОтчета = Новый Соответствие();
	ПараметрыОтчета.Вставить("ГруппаПравил", ЭтотОбъект.ГруппаПравил);
	ПараметрыОтчета.Вставить("ГруппаОбъектов", ЭтотОбъект.ГруппаОбъектов);
	ПараметрыОтчета.Вставить("Организация", ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("ИмпортируемыеОбъекты.КодВоВнешнейСистеме", ЭтотОбъект.ИмпортируемыеОбъекты.ВыгрузитьКолонку("КодВоВнешнейСистеме"));
	
	Описание =
		"ГруппаПравил: " + ПараметрыОтчета["ГруппаПравил"] + "
		|ГруппаОбъектов: " + ПараметрыОтчета["ГруппаОбъектов"] + "
		|Организация: " + ПараметрыОтчета["Организация"] + "
		|ИмпортируемыеОбъекты.КодВоВнешнейСистеме[" + Формат(ЭтотОбъект.ИмпортируемыеОбъекты.Количество(), "ЧРГ=") + "]: " + РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ПараметрыОтчета["ИмпортируемыеОбъекты.КодВоВнешнейСистеме"], ", ");
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета);
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Процедура СкорректироватьДатуПогашенияПропертизФинанс(ВнешниеДанные, ДанныеДляЗагрузки)
	
	// #339467: у "О1 Пропертиз Финанс АО, 4B02-01-71827-H, 1000.00 RUB" отодвинули дату погашения	
	
	Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_ПропертизФин");
	Если Облигация = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаДанныеДляЗагрузки = ДанныеДляЗагрузки.Найти(Облигация, "Объект");
	Если СтрокаДанныеДляЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ВнешниеДанные.НайтиСтроки(Новый Структура("Идентификатор", СтрокаДанныеДляЗагрузки.Идентификатор));
	
	Для Каждого СтрокаОблигации Из НайденныеСтроки Цикл
		Если СтрокаОблигации.ДатаПогашения = '20201002' Тогда
			СтрокаОблигации.ДатаПогашения = '20240927';	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьФормулыРасчетаПлавающихСтавок(КупонныйДоходПоОблигациям, Ошибки)
	
	// Подгружаем из специального регистра, контролируя, чтобы количество купонных периодов совпадало.
	// Ошибки выдаем только для непогашенных облигаций с плавающей ставкой
	
	ОшибкиОбновления = Новый Соответствие; // ключ - бумага, значение - сообщение об ошибке
	
	КупонныйДоходПоОблигациям.Индексы.Добавить("Облигация, НомерКупона");
	
	НомераКупонов = КупонныйДоходПоОблигациям.Скопировать(Неопределено, "Облигация, НомерКупона");
	РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(НомераКупонов, "Облигация",	Метаданные.РегистрыСведений.ФормулыРасчетаСтавокКупонов.Измерения.Облигация.Тип);
	РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(НомераКупонов, "НомерКупона",	Метаданные.РегистрыСведений.ФормулыРасчетаСтавокКупонов.Измерения.НомерКупона.Тип);
		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.Облигация КАК Облигация,
		|	КупонныйДоходПоОблигациям.НомерКупона КАК НомерКупона
		|ПОМЕСТИТЬ _КупонныйДоходПоОблигациям
		|ИЗ
		|	&КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Облигация,
		|	НомерКупона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КупонныйДоходПоОблигациям.Облигация КАК Облигация,
		|	КодыОблигацийВМатрикс.Код В (&КодыПогашенныхБумаг) КАК ФлагОблигацияПогашена
		|ПОМЕСТИТЬ _ОбновляемыеОблигации
		|ИЗ
		|	_КупонныйДоходПоОблигациям КАК _КупонныйДоходПоОблигациям
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)
		|					И ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И Объект В
		|						(ВЫБРАТЬ
		|							НКД.Облигация
		|						ИЗ
		|							_КупонныйДоходПоОблигациям КАК НКД)) КАК КодыОблигацийВМатрикс
		|		ПО _КупонныйДоходПоОблигациям.Облигация = КодыОблигацийВМатрикс.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбновляемыеОблигации.Облигация КАК Облигация,
		|	_ОбновляемыеОблигации.ФлагОблигацияПогашена КАК ФлагОблигацияПогашена
		|ПОМЕСТИТЬ _КонтролируемыеОблигации
		|ИЗ
		|	_ОбновляемыеОблигации КАК _ОбновляемыеОблигации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО (Облигации.Ссылка = _ОбновляемыеОблигации.Облигация)
		|			И (Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК))
		|			И (Облигации.БазоваяСтавка <> ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиОблигаций.ПустаяСсылка))
		|			И (Облигации.ДатаПогашения >= &Период
		|				ИЛИ Облигации.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктуальныеФормулыРасчетаСтавокКупонов.Облигация КАК Облигация,
		|	АктуальныеФормулыРасчетаСтавокКупонов.НомерКупона КАК НомерКупона,
		|	АктуальныеФормулыРасчетаСтавокКупонов.ФормулаРасчетаСтавки КАК ФормулаРасчетаСтавки,
		|	_ОбновляемыеОблигации.ФлагОблигацияПогашена КАК ФлагОблигацияПогашена
		|ПОМЕСТИТЬ _АктуальныеФормулыРасчетаСтавокКупонов
		|ИЗ
		|	РегистрСведений.ФормулыРасчетаСтавокКупонов.СрезПоследних(
		|			&Период,
		|			Облигация В
		|				(ВЫБРАТЬ
		|					_ОбновляемыеОблигации.Облигация
		|				ИЗ
		|					_ОбновляемыеОблигации)) КАК АктуальныеФормулыРасчетаСтавокКупонов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОбновляемыеОблигации КАК _ОбновляемыеОблигации
		|		ПО АктуальныеФормулыРасчетаСтавокКупонов.Облигация = _ОбновляемыеОблигации.Облигация
		|ГДЕ
		|	АктуальныеФормулыРасчетаСтавокКупонов.Действует
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Облигация,
		|	НомерКупона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_КупонныйДоходПоОблигациям.Облигация, _АктуальныеФормулыРасчетаСтавокКупонов.Облигация) КАК Облигация,
		|	ЕСТЬNULL(_КонтролируемыеОблигации.ФлагОблигацияПогашена, _АктуальныеФормулыРасчетаСтавокКупонов.ФлагОблигацияПогашена) КАК ФлагОблигацияПогашена,
		|	_АктуальныеФормулыРасчетаСтавокКупонов.НомерКупона КАК НомерКупона,
		|	_АктуальныеФормулыРасчетаСтавокКупонов.ФормулаРасчетаСтавки КАК ФормулаРасчетаСтавки
		|ИЗ
		|	_КупонныйДоходПоОблигациям КАК _КупонныйДоходПоОблигациям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КонтролируемыеОблигации КАК _КонтролируемыеОблигации
		|		ПО (_КонтролируемыеОблигации.Облигация = _КупонныйДоходПоОблигациям.Облигация)
		|		ПОЛНОЕ СОЕДИНЕНИЕ _АктуальныеФормулыРасчетаСтавокКупонов КАК _АктуальныеФормулыРасчетаСтавокКупонов
		|		ПО (_АктуальныеФормулыРасчетаСтавокКупонов.Облигация = _КупонныйДоходПоОблигациям.Облигация)
		|			И (_АктуальныеФормулыРасчетаСтавокКупонов.НомерКупона = _КупонныйДоходПоОблигациям.НомерКупона)");
	
	Запрос.УстановитьПараметр("КупонныйДоходПоОблигациям", НомераКупонов);
	Запрос.УстановитьПараметр("Период",					   ТекущаяДата());
	Запрос.УстановитьПараметр("КодыПогашенныхБумаг",       ПолучитьКодыПогашенныхБумаг());
	
	ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗаписей.Следующий() Цикл
				
		СтрокиКупона = КупонныйДоходПоОблигациям.НайтиСтроки(Новый Структура("Облигация, НомерКупона", ВыборкаЗаписей.Облигация, ВыборкаЗаписей.НомерКупона));
		
		Если СтрокиКупона.Количество() = 0 Тогда
			
			Если Не ВыборкаЗаписей.ФлагОблигацияПогашена Тогда 
				ОшибкиОбновления.Вставить(ВыборкаЗаписей.Облигация, СтрШаблон("Не удалось заполнить формулы расчета ставок купонов бумаги '%1'", ВыборкаЗаписей.Облигация));
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокиКупона[0].ФормулаРасчетаСтавки = ВыборкаЗаписей.ФормулаРасчетаСтавки;
		
	КонецЦикла;
	
	// Фиксируем ошибки
	Для Каждого Ошибка Из ОшибкиОбновления Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка.Значение);
		Если Ошибки <> Неопределено Тогда
			ДобавитьОшибкуВМассив(Ошибки, Ошибка.Значение);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьКодыПогашенныхБумаг()
	
	//Исключаем погашенные облигации из сверки. Пока хардкодом
	КодыБумагИсключенныхИзСверки = Новый Массив();
	// Евробонды
	КодыБумагИсключенныхИзСверки.Добавить("590474"); //JPMorgan Chase & Co., US46647PAD87, 1000.00 USD - погашена 25.04.22
	КодыБумагИсключенныхИзСверки.Добавить("590490"); //NatWest Group plc, US780097BF78, 1000.00 USD - погашена 15.05.22
	КодыБумагИсключенныхИзСверки.Добавить("590159"); //Paramount Global, US92553PBD33, 1000.00 USD - погашена 28.02.22	
	КодыБумагИсключенныхИзСверки.Добавить("589660"); //Lenovo Perpetual Securities Limited, XS1575529539, 1000.00 USD - погашена 10.12.2020
	КодыБумагИсключенныхИзСверки.Добавить("590194"); //SSE plc, XS1572343744, 1000.00 USD - погашена 16.06.2022
	КодыБумагИсключенныхИзСверки.Добавить("590203"); //SUEZ SA, FR0013252061, 100000.00 EUR - погашена 19.04.2024 	
	КодыБумагИсключенныхИзСверки.Добавить("590195"); //The Southern Company, US842587CY12, 1000.00 USD - погашена 04.01.2023
	КодыБумагИсключенныхИзСверки.Добавить("590077"); //Skandinaviska Enskilda Banken AB, XS1584880352, 200000.00 USD - погашена 13.05.2022 
	КодыБумагИсключенныхИзСверки.Добавить("590213"); //Burger King France SAS, XS1600481821, 1000.00 EUR - погашена 02.11.2021
	КодыБумагИсключенныхИзСверки.Добавить("590832"); //Morgan Stanley, US61746BEC63, 1000.00 USD - погашена 24.10.2022
	КодыБумагИсключенныхИзСверки.Добавить("65450"); //GPB Eurobond Finance PLC, XS0975320879, 1000.00 USD - погашена 28.12.2018
	КодыБумагИсключенныхИзСверки.Добавить("590327"); //Bank of East Asia, Limited, XS1615078141, 1000.00 USD - погашена 18.05.2022
	КодыБумагИсключенныхИзСверки.Добавить("590338"); //Swedbank AB (publ), XS1617859464, 1000.00 EUR - погашена 22.11.2022
	// Облигации
	КодыБумагИсключенныхИзСверки.Добавить("583436"); //Россельхозбанк АО, 42603349B, 1000.00 RUB - погашена 23.07.2023
	КодыБумагИсключенныхИзСверки.Добавить("583438"); //Россельхозбанк АО, 42503349B, 1000.00 RUB - ДОСРОЧНОЕ ПОГАШЕНИЕ 22.07.2024
	КодыБумагИсключенныхИзСверки.Добавить("583437"); //Россельхозбанк АО, 42403349B, 1000.00 RUB - ДОСРОЧНОЕ ПОГАШЕНИЕ 19.07.2024
	
	
	Возврат КодыБумагИсключенныхИзСверки; 
	
КонецФункции

Процедура ОтменитьТранзакции(ГлубинаРекурсии)

	Для УровеньРекурсии = 1 По ГлубинаРекурсии Цикл
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры
 
Процедура ДобавитьОшибкуВМассив(Ошибки, ТекстОшибки)
	
	Ошибки.Добавить(Новый Структура("ТекстОшибки, Источник", ТекстОшибки, "Обработка.ИмпортНормативноСправочнойИнформации"));
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибки(Ошибки, РезультатОбновления)

	// регистрация ошибок и добавление ошибок в сообщения об ошибках
	Для Каждого ДанныеОшибки Из Ошибки Цикл
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ДанныеОшибки.ТекстОшибки, ДанныеОшибки.Источник);
		Если РезультатОбновления <> Неопределено Тогда
			РезультатОбновления.СообщенияОбОшибках.Добавить(ДанныеОшибки.ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	Ошибки.Очистить();

КонецПроцедуры	