Процедура СформироватьДвижения(Регистратор) Экспорт
	
	Регистратор.Движения.ПлановыеДатыОплат.Записывать = Истина;
	Регистратор.Движения.ПлановыеДатыОплат.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	
	Если ТипЗнч(Регистратор) = Тип("ДокументОбъект.Сделка")
		ИЛИ ТипЗнч(Регистратор) = Тип("ДокументОбъект.СделкаРЕПО") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаЦенныеБумаги.Ссылка.Дата КАК Период,
			|	СделкаЦенныеБумаги.Ссылка КАК Регистратор,
			|	СделкаЦенныеБумаги.Ссылка.Организация КАК Организация,
			|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии) КАК ВидЗадолженности,
			|	СделкаЦенныеБумаги.Ссылка.ВалютаТорговойКомиссии КАК Валюта,
			|	СделкаЦенныеБумаги.Ссылка КАК Основание,
			|	ВЫБОР
			|		КОГДА СделкаЦенныеБумаги.Ссылка.ОтложеннаяОплатаТорговойКомиссии
			|			ТОГДА СделкаЦенныеБумаги.Ссылка.ДатаОплатыТорговойКомиссии
			|		ИНАЧЕ СделкаЦенныеБумаги.Ссылка.Дата
			|	КОНЕЦ КАК ДатаОплаты
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	СделкаЦенныеБумаги.Ссылка.Организация,
			|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления,
			|	СделкаЦенныеБумаги.Ссылка.ВалютаТорговойКомиссии,
			|	СделкаЦенныеБумаги.Ссылка,
			|	ВЫБОР
			|		КОГДА СделкаЦенныеБумаги.Ссылка.ОтложеннаяОплатаТорговойКомиссии
			|			ТОГДА СделкаЦенныеБумаги.Ссылка.ДатаОплатыТорговойКомиссии
			|		ИНАЧЕ СделкаЦенныеБумаги.Ссылка.Дата
			|	КОНЕЦ,
			|	СделкаЦенныеБумаги.Ссылка.Дата,
			|	СделкаЦенныеБумаги.Ссылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(СделкаЦенныеБумаги.ТорговаяКомиссия) > 0";
		
		Если ТипЗнч(Регистратор) = Тип("ДокументОбъект.СделкаРЕПО") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка", "Документ.СделкаРЕПО");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.СделкаСВалютой") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаСВалютой.Дата КАК Период,
			|	СделкаСВалютой.Ссылка КАК Регистратор,
			|	СделкаСВалютой.Организация КАК Организация,
			|	СделкаСВалютой.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии) КАК ВидЗадолженности,
			|	СделкаСВалютой.ВалютаКомиссии КАК Валюта,
			|	СделкаСВалютой.Ссылка КАК Основание,
			|	ВЫБОР
			|		КОГДА СделкаСВалютой.ОтложеннаяОплатаКомиссии
			|			ТОГДА СделкаСВалютой.ДатаОплатыКомиссии
			|		ИНАЧЕ СделкаСВалютой.Дата
			|	КОНЕЦ КАК ДатаОплаты
			|ИЗ
			|	Документ.СделкаСВалютой КАК СделкаСВалютой
			|ГДЕ
			|	СделкаСВалютой.Ссылка = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	СделкаСВалютой.Дата,
			|	СделкаСВалютой.Ссылка,
			|	СделкаСВалютой.Организация,
			|	СделкаСВалютой.СчетДоверительногоУправления,
			|	СделкаСВалютой.ВалютаКомиссии,
			|	СделкаСВалютой.Ссылка,
			|	ВЫБОР
			|		КОГДА СделкаСВалютой.ОтложеннаяОплатаКомиссии
			|			ТОГДА СделкаСВалютой.ДатаОплатыКомиссии
			|		ИНАЧЕ СделкаСВалютой.Дата
			|	КОНЕЦ
			|
			|ИМЕЮЩИЕ
			|	СделкаСВалютой.СуммаКомиссии > 0";
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.НачислениеЗадолженности") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НачислениеЗадолженностиОснования.Ссылка.Дата КАК Период,
			|	НачислениеЗадолженностиОснования.Ссылка КАК Регистратор,
			|	НачислениеЗадолженностиОснования.Ссылка.Организация КАК Организация,
			|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|	НачислениеЗадолженностиОснования.Ссылка.Валюта КАК Валюта,
			|	ВЫБОР
			|		КОГДА НачислениеЗадолженностиОснования.Основание = НЕОПРЕДЕЛЕНО
			|			ТОГДА НачислениеЗадолженностиОснования.Ссылка
			|		ИНАЧЕ НачислениеЗадолженностиОснования.Основание
			|	КОНЕЦ КАК Основание,
			|	НачислениеЗадолженностиОснования.ДатаОплаты КАК ДатаОплаты
			|ИЗ
			|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
			|ГДЕ
			|	НачислениеЗадолженностиОснования.Ссылка = &Регистратор
			|	И НачислениеЗадолженностиОснования.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)";
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.Оплата") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОплатаОснования.Ссылка.Дата КАК Период,
			|	ОплатаОснования.Ссылка КАК Регистратор,
			|	ОплатаОснования.Ссылка.Организация КАК Организация,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОплатаОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|	ОплатаОснования.Валюта КАК Валюта,
			|	ОплатаОснования.Ссылка КАК Основание,
			|	ОплатаОснования.Ссылка.ДатаПлановогоПогашенияЗадолженности КАК ДатаОплаты
			|ИЗ
			|	Документ.Оплата.Основания КАК ОплатаОснования
			|ГДЕ
			|	ОплатаОснования.Ссылка = &Регистратор
			|	И ОплатаОснования.Ссылка.Аванс
			|	И ОплатаОснования.Ссылка.ДатаПлановогоПогашенияЗадолженности <> ДАТАВРЕМЯ(1, 1, 1)";
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.ОперацияНДС") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДвиженияЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности
			|ПОМЕСТИТЬ _ИтогКварталаНДС
			|ИЗ
			|	&ДвиженияЗадолженностиПоДенежнымСредствам КАК ДвиженияЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	ДвиженияЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОперацияНДС.Дата КАК Период,
			|	ОперацияНДС.Ссылка КАК Регистратор,
			|	ОперацияНДС.Организация КАК Организация,
			|	ОперацияНДС.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость) КАК ВидЗадолженности,
			|	&Рубли КАК Валюта,
			|	ОперацияНДС.Ссылка КАК Основание,
			|	ВЫБОР
			|		КОГДА _ИтогКварталаНДС.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|			ТОГДА &ДатаУплатыКредиторкиНДС
			|		ИНАЧЕ &ДатаУплатыДебиторкиНДС
			|	КОНЕЦ КАК ДатаОплаты
			|ИЗ
			|	Документ.ОперацияНДС КАК ОперацияНДС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ИтогКварталаНДС КАК _ИтогКварталаНДС
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ОперацияНДС.Ссылка = &Регистратор";
		
		Запрос.УстановитьПараметр("Рубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
		Запрос.УстановитьПараметр("ДвиженияЗадолженностиПоДенежнымСредствам", Регистратор.Движения.ЗадолженностиПоДенежнымСредствам);
		Запрос.УстановитьПараметр("ДатаУплатыКредиторкиНДС", РаботаСНДС.ПолучитьСрокОплатыНДС(Регистратор.Дата, Справочники.ВидыЗадолженности.НДСТекущегоПериода, Перечисления.ТипыЗадолженности.Кредиторская));
		Запрос.УстановитьПараметр("ДатаУплатыДебиторкиНДС", РаботаСНДС.ПолучитьСрокОплатыНДС(Регистратор.Дата, Справочники.ВидыЗадолженности.НДСТекущегоПериода, Перечисления.ТипыЗадолженности.Дебиторская));
		
	КонецЕсли;
	
	Регистратор.Движения.ПлановыеДатыОплат.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры