

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидОтчетаПриИзменении(Неопределено);
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	ЭтаФорма.ПредопределенныеВарианты.Очистить();
	ЭтаФорма.СохраненныеВарианты.Очистить();
	ЭтаФорма.СохраненныеНастройки.Очистить();
	ЭтаФорма.СистемныеНастройки.Очистить();
	
	ЭтаФорма.КоличествоПредопределенныхВариантов = 0;
	ЭтаФорма.КоличествоСохраненныхВариантов = 0;
	ЭтаФорма.КоличествоСохраненныхНастроек = 0;
	ЭтаФорма.КоличествоКлючей = 0;
	
	ЭлементКлюч = ЭтаФорма.Элементы.КлючОтчета;
	
	Если ЭтаФорма.ВидОтчета = 0 Тогда
		
		ОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255));
		
		ЭлементКлюч.РежимВыбораИзСписка = Истина;
		СписокОтчетов = ПолучитьСписокОтчетов();
		Для каждого Отчет Из СписокОтчетов Цикл
			ЗаполнитьЗначенияСвойств(ЭлементКлюч.СписокВыбора.Добавить(), Отчет);
		КонецЦикла; 		
		
	ИначеЕсли ЭтаФорма.ВидОтчета = 1 Тогда
		
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
		ЭлементКлюч.РежимВыбораИзСписка = Ложь;
		ЭлементКлюч.СписокВыбора.Очистить();
		
	КонецЕсли; 
	
	ЭлементКлюч.ОграничениеТипа = ОписаниеТипов;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючОтчетаПриИзменении(Элемент)
	ЗаполнитьПредопределенныеВарианты();
	ЗаполнитьСохраненныеВарианты();
	ЗаполнитьСохраненныеНастройки();
	ЗаполнитьКлючиТекущихВариантов();
КонецПроцедуры


#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Создать");
	Попытка
		УстановитьДействиеДляВыделенныхСтрок("Создать");
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Обновить");
	Попытка
		УстановитьДействиеДляВыделенныхСтрок("Обновить");
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура Пропустить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Пропустить");
	Попытка
		УстановитьДействиеДляВыделенныхСтрок("Пропустить");
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействия(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ВыполнитьДействия");
	Попытка
		ВыполнитьДействияНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючи(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("УстановитьКлючи");
	Попытка
		УстановитьКлючиНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Заполнить");
	Попытка
		ВыполнитьЗаполнение(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнение(ПараметрыСессии)
	
	Если Не ЗначениеЗаполнено(КлючОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан отчет. Заполнение не возможно", , "КлючОтчета");
		ПараметрыСессии.ТекстОшибки = "Не указан отчет";
		Возврат;
	КонецЕсли; 
	
	ИмяТаблицы = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя, "Страница", "");
	
	Если ИмяТаблицы = "ПредопределенныеВарианты" Тогда
		ЗаполнитьПредопределенныеВарианты();
	ИначеЕсли ИмяТаблицы = "СохраненныеВарианты" Тогда
		ЗаполнитьСохраненныеВарианты();
	ИначеЕсли ИмяТаблицы = "СохраненныеНастройки" Тогда
		ЗаполнитьСохраненныеНастройки();
	Иначе
		ЗаполнитьКлючиТекущихВариантов();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбработатьВстроенныеОтчетыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетов.Ссылка КАК Ссылка,
		|	ВариантыОтчетов.Ключ КАК Ключ,
		|	ВариантыОтчетов.ИмяПредопределенногоВарианта КАК ИмяПредопределенногоВарианта,
		|	ВариантыОтчетов.Организация КАК Организация,
		|	ВариантыОтчетов.Автор КАК Автор,
		|	ВариантыОтчетов.Общий КАК Общий,
		|	ВариантыОтчетов.ПредопределенныйВариант КАК ПредопределенныйВариант,
		|	ВариантыОтчетов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов";
	
	ТекущиеВарианты = Запрос.Выполнить().Выгрузить();
	
	#Область ВстроенныеОтчеты
	
	Для каждого ОтчетМетаданные Из Метаданные.Отчеты Цикл
		
		СхемаКДМетаданные = ОтчетМетаданные.ОсновнаяСхемаКомпоновкиДанных;
		
		Если СхемаКДМетаданные <> Неопределено
			И ОтчетМетаданные.ХранилищеВариантов <> Неопределено Тогда
			
			СхемаКД = Отчеты[ОтчетМетаданные.Имя].ПолучитьМакет(СхемаКДМетаданные.Имя);
			Для Каждого ВариантНастроекКД Из СхемаКД.ВариантыНастроек Цикл
				
				СтруктураВарианта = Новый Структура;
				СтруктураВарианта.Вставить("Ключ", 			ОтчетМетаданные.ПолноеИмя());
				СтруктураВарианта.Вставить("Наименование", 	ВариантНастроекКД.Представление);
				СтруктураВарианта.Вставить("Настройки", 	Новый ХранилищеЗначения(ВариантНастроекКД.Настройки, Новый СжатиеДанных(9)));
				СтруктураВарианта.Вставить("Организация", 	Справочники.Организации.ПустаяСсылка());
				СтруктураВарианта.Вставить("Автор", 		Справочники.Пользователи.ПустаяСсылка());
				СтруктураВарианта.Вставить("Общий", 		Истина);
				СтруктураВарианта.Вставить("ПредопределенныйВариант", Истина);
				СтруктураВарианта.Вставить("ИмяПредопределенногоВарианта", ВариантНастроекКД.Имя);
				
				СоздатьОбновитьВариант(СтруктураВарианта, ТекущиеВарианты);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти 
	
	#Область ДопОтчеты
	
	// дополнительные отчеты
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.Вид = Значение(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(Выборка.Ссылка);
		Попытка
			Отчет = ВнешниеОтчеты.Создать(ИмяПодключенногоОбъекта);
		Исключение
			Сообщить(Выборка.Ссылка);
			Продолжить;
		КонецПопытки;
		
		ОтчетМетаданные = Отчет.Метаданные();
		СхемаКДМетаданные = ОтчетМетаданные.ОсновнаяСхемаКомпоновкиДанных;
		
		Если СхемаКДМетаданные <> Неопределено
			И ОтчетМетаданные.ХранилищеВариантов <> Неопределено Тогда
			
			СхемаКД = Отчет.ПолучитьМакет(СхемаКДМетаданные.Имя);
			Для Каждого ВариантНастроекКД Из СхемаКД.ВариантыНастроек Цикл
				
				СтруктураВарианта = Новый Структура;
				СтруктураВарианта.Вставить("Ключ", 			ОтчетМетаданные.ПолноеИмя());
				СтруктураВарианта.Вставить("Наименование", 	ВариантНастроекКД.Представление);
				СтруктураВарианта.Вставить("Настройки", 	Новый ХранилищеЗначения(ВариантНастроекКД.Настройки, Новый СжатиеДанных(9)));
				СтруктураВарианта.Вставить("Организация", 	Справочники.Организации.ПустаяСсылка());
				СтруктураВарианта.Вставить("Автор", 		Справочники.Пользователи.ПустаяСсылка());
				СтруктураВарианта.Вставить("Общий", 		Истина);
				СтруктураВарианта.Вставить("ПредопределенныйВариант", Истина);
				СтруктураВарианта.Вставить("ИмяПредопределенногоВарианта", ВариантНастроекКД.Имя);
				
				СоздатьОбновитьВариант(СтруктураВарианта, ТекущиеВарианты);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти 
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Организация КАК Организация,
		|	Пользователи.ИдентификаторПользователяИБ КАК УИД
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	
	ТаблицаПользователей = Запрос.Выполнить().Выгрузить();
	
	// варианты отчетов
	Выборка = ХранилищеВариантовОтчетов.Выбрать();
	
	ЕстьСледующий = Истина;
	
	Пока ЕстьСледующий Цикл
	
		Попытка
			
			ЕстьСледующий = Выборка.Следующий();
			Если ЕстьСледующий Тогда
				
				ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Выборка.Пользователь);
				
				Если Не ПользовательИБ = Неопределено Тогда
				
					СтруктураВарианта = Новый Структура;
					СтруктураВарианта.Вставить("Ключ", 			Выборка.КлючОбъекта);
					СтруктураВарианта.Вставить("Наименование", 	Выборка.Представление);
					СтруктураВарианта.Вставить("Настройки", 	Новый ХранилищеЗначения(Выборка.Настройки, Новый СжатиеДанных(9)));
					СтруктураВарианта.Вставить("Общий", 		Ложь);
					СтруктураВарианта.Вставить("ПредопределенныйВариант", Ложь);
					СтруктураВарианта.Вставить("ИмяПредопределенногоВарианта", "");
					
					НайденныеСтроки = ТаблицаПользователей.НайтиСтроки(Новый Структура("УИД", ПользовательИБ.УникальныйИдентификатор));
					
					Для каждого СтрокаПользователь Из НайденныеСтроки Цикл
					
						СтруктураВарианта.Вставить("Организация", 	СтрокаПользователь.Организация);
						СтруктураВарианта.Вставить("Автор", 		СтрокаПользователь.Ссылка);	
						
						СоздатьОбновитьВариант(СтруктураВарианта, ТекущиеВарианты);			
					
					КонецЦикла; 					
				
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла; 
	
	// настройки отчетов
	Выборка = ХранилищеПользовательскихНастроекОтчетов.Выбрать();
	
	ЕстьСледующий = Истина;
	
	Пока ЕстьСледующий Цикл
	
		Попытка
			
			ЕстьСледующий = Выборка.Следующий();
			Если ЕстьСледующий Тогда
				
				ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Выборка.Пользователь);
				
				Если Не ПользовательИБ = Неопределено Тогда
				
					СтруктураВарианта = Новый Структура;
					СтруктураВарианта.Вставить("Ключ", 			Выборка.КлючОбъекта);
					СтруктураВарианта.Вставить("Наименование", 	Выборка.Представление);
					СтруктураВарианта.Вставить("Настройки", 	Новый ХранилищеЗначения(Выборка.Настройки, Новый СжатиеДанных(9)));
					СтруктураВарианта.Вставить("Общий", 		Ложь);
					СтруктураВарианта.Вставить("ПредопределенныйВариант", Ложь);
					СтруктураВарианта.Вставить("ИмяПредопределенногоВарианта", "");
					
					НайденныеСтроки = ТаблицаПользователей.НайтиСтроки(Новый Структура("УИД", ПользовательИБ.УникальныйИдентификатор));
					
					Для каждого СтрокаПользователь Из НайденныеСтроки Цикл
					
						СтруктураВарианта.Вставить("Организация", 	СтрокаПользователь.Организация);
						СтруктураВарианта.Вставить("Автор", 		СтрокаПользователь.Ссылка);	
						
						СоздатьОбновитьВариант(СтруктураВарианта, ТекущиеВарианты);			
					
					КонецЦикла; 					
				
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьОбновитьВариант(СтруктураВарианта, ТекущиеВарианты)

	Отбор = Новый Структура;
	
	Для каждого ЭлементСтруктуры Из СтруктураВарианта Цикл
		//Если Не (ЭлементСтруктуры.Ключ = "Наименование" ИЛИ ЭлементСтруктуры.Ключ = "Настройки") Тогда
		Если Не ЭлементСтруктуры.Ключ = "Настройки" Тогда
			Отбор.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЕсли; 
	КонецЦикла; 
	
	НайденныеСтроки = ТекущиеВарианты.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		Вариант = НайденныеСтроки[0].Ссылка.ПолучитьОбъект();
	Иначе
		Вариант = Справочники.ВариантыОтчетов.СоздатьЭлемент();
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Вариант, СтруктураВарианта);
	
	Вариант.ДополнительныеСвойства.Вставить("ОбновлениеВариантов");
	Вариант.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокОтчетов()

	СписокОтчетов = Новый СписокЗначений;
	Для каждого Отчет Из Метаданные.Отчеты Цикл
	
		СписокОтчетов.Добавить(Отчет.Имя, Отчет.Синоним);
	
	КонецЦикла; 
	СписокОтчетов.СортироватьПоПредставлению();
	Возврат СписокОтчетов;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьПредопределенныеВарианты()

	Для каждого ТекСтрока Из ЭтаФорма.ПредопределенныеВарианты Цикл
	
		Если ЭтоАдресВременногоХранилища(ТекСтрока.АдресНастроек) Тогда
		
			УдалитьИзВременногоХранилища(ТекСтрока.АдресНастроек);
		
		КонецЕсли; 		
	
	КонецЦикла; 
	ЭтаФорма.ПредопределенныеВарианты.Очистить();
	
	Если ВидОтчета = 0 Тогда
	
		ОтчетМетаданные = Метаданные.Отчеты[КлючОтчета];
		
	Иначе
		
		ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(КлючОтчета);
		Попытка
			Отчет = ВнешниеОтчеты.Создать(ИмяПодключенногоОбъекта);
		Исключение
			Сообщить(КлючОтчета + ". " + ОписаниеОшибки());
		КонецПопытки;
		
		ОтчетМетаданные = Отчет.Метаданные();
	
	КонецЕсли; 
	
	СхемаКДМетаданные = ОтчетМетаданные.ОсновнаяСхемаКомпоновкиДанных;
	
	Если СхемаКДМетаданные <> Неопределено Тогда
		
		Если ВидОтчета = 0 Тогда
			СхемаКД = Отчеты[ОтчетМетаданные.Имя].ПолучитьМакет(СхемаКДМетаданные.Имя);
		Иначе
			СхемаКД = Отчет.ПолучитьМакет(СхемаКДМетаданные.Имя);
		КонецЕсли; 
		
		ТаблицаПредопределенных = ЭтаФорма.ПредопределенныеВарианты.Выгрузить();
		
		Для Каждого ВариантНастроекКД Из СхемаКД.ВариантыНастроек Цикл
			
			НоваяСтрока = ТаблицаПредопределенных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВариантНастроекКД);
			//НоваяСтрока.КлючОбъекта = ОтчетМетаданные.ПолноеИмя();
			НоваяСтрока.АдресНастроек = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(ВариантНастроекКД.Настройки, Новый СжатиеДанных(9)), ЭтаФорма.УникальныйИдентификатор);
			НоваяСтрока.Действие = "Пропустить";
			
		КонецЦикла;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПредопределенныеВарианты.Имя КАК Имя,
			|	ПредопределенныеВарианты.Представление КАК Представление,
			|	ПредопределенныеВарианты.ВариантОтчета КАК ВариантОтчета,
			|	ПредопределенныеВарианты.Действие КАК Действие,
			|	ПредопределенныеВарианты.КлючОбъекта КАК КлючОбъекта,
			|	ПредопределенныеВарианты.АдресНастроек КАК АдресНастроек
			|ПОМЕСТИТЬ _ПредопределенныеВарианты
			|ИЗ
			|	&ПредопределенныеВарианты КАК ПредопределенныеВарианты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПредопределенныеВарианты.Имя КАК Имя,
			|	_ПредопределенныеВарианты.Представление КАК Представление,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ВариантОтчета ЕСТЬ NULL
			|			ТОГДА ""Создать""
			|		ИНАЧЕ _ПредопределенныеВарианты.Действие
			|	КОНЕЦ КАК Действие,
			|	&КлючОбъекта КАК КлючОбъекта,
			|	_ПредопределенныеВарианты.АдресНастроек КАК АдресНастроек,
			|	ЕСТЬNULL(ВложенныйЗапрос.ВариантОтчета, ЗНАЧЕНИЕ(Справочник.ВариантыОтчетов.ПустаяСсылка)) КАК ВариантОтчета
			|ИЗ
			|	_ПредопределенныеВарианты КАК _ПредопределенныеВарианты
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_ПредопределенныеВарианты.Имя КАК Имя,
			|			ВЫБОР
			|				КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВариантыОтчетов.Ссылка) = 1
			|					ТОГДА МАКСИМУМ(ВариантыОтчетов.Ссылка)
			|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВариантыОтчетов.ПустаяСсылка)
			|			КОНЕЦ КАК ВариантОтчета
			|		ИЗ
			|			_ПредопределенныеВарианты КАК _ПредопределенныеВарианты
			|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов КАК ВариантыОтчетов
			|				ПО (ВариантыОтчетов.Ключ = &КлючОбъекта)
			|					И (ВариантыОтчетов.ПредопределенныйВариант)
			|					И _ПредопределенныеВарианты.Имя = ВариантыОтчетов.ИмяПредопределенногоВарианта
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_ПредопределенныеВарианты.Имя) КАК ВложенныйЗапрос
			|		ПО _ПредопределенныеВарианты.Имя = ВложенныйЗапрос.Имя
			|
			|УПОРЯДОЧИТЬ ПО
			|	Имя";
		
		Запрос.УстановитьПараметр("ПредопределенныеВарианты", ТаблицаПредопределенных);
		Запрос.УстановитьПараметр("КлючОбъекта", ОтчетМетаданные.ПолноеИмя());
		
		ЭтаФорма.ПредопределенныеВарианты.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	КоличествоПредопределенныхВариантов = ЭтаФорма.ПредопределенныеВарианты.Количество();
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьСохраненныеВарианты()
	
	Для каждого ТекСтрока Из ЭтаФорма.СохраненныеВарианты Цикл
	
		Если ЭтоАдресВременногоХранилища(ТекСтрока.АдресНастроек) Тогда
		
			УдалитьИзВременногоХранилища(ТекСтрока.АдресНастроек);
		
		КонецЕсли; 		
	
	КонецЦикла; 
	ЭтаФорма.СохраненныеВарианты.Очистить();
	
	Если ВидОтчета = 0 Тогда
		КлючОбъекта = "Отчет." + КлючОтчета;
	Иначе
		КлючОбъекта = "ВнешнийОтчет." + КлючОтчета.ИмяОбъекта;
	КонецЕсли; 
	
	Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
	Выборка = ХранилищеВариантовОтчетов.Выбрать(Отбор);
	
	ЕстьСледующий = Истина;
	
	Пока ЕстьСледующий Цикл
	
		Попытка
			
			ЕстьСледующий = Выборка.Следующий();
			Если ЕстьСледующий Тогда
				
				ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Выборка.Пользователь);
					
				НоваяСтрока = ЭтаФорма.СохраненныеВарианты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.АдресНастроек = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(Выборка.Настройки, Новый СжатиеДанных(9)), ЭтаФорма.УникальныйИдентификатор);
				НоваяСтрока.ПользовательУИД = ?(ПользовательИБ = Неопределено, Неопределено, ПользовательИБ.УникальныйИдентификатор);
				НоваяСтрока.Действие = "Пропустить";
				
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	// т.к. во временную таблицу не удается передать УИД - автозаполнение невозможно.
	
	КоличествоСохраненныхВариантов = ЭтаФорма.СохраненныеВарианты.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСохраненныеНастройки()
	
	Для каждого ТекСтрока Из ЭтаФорма.СохраненныеНастройки Цикл
	
		Если ЭтоАдресВременногоХранилища(ТекСтрока.АдресНастроек) Тогда
		
			УдалитьИзВременногоХранилища(ТекСтрока.АдресНастроек);
		
		КонецЕсли; 		
	
	КонецЦикла;
	СохраненныеНастройки.Очистить();
	
	Если ВидОтчета = 0 Тогда
		КлючОбъекта = "Отчет." + КлючОтчета + "/";
	Иначе
		КлючОбъекта = "ВнешнийОтчет." + КлючОтчета.ИмяОбъекта + "/";
	КонецЕсли; 
	
	Выборка = ХранилищеПользовательскихНастроекОтчетов.Выбрать();
	
	ЕстьСледующий = Истина;
	
	Пока ЕстьСледующий Цикл
	
		Попытка
			
			ЕстьСледующий = Выборка.Следующий();
			Если ЕстьСледующий Тогда
				
				Если СтрНачинаетсяС(Выборка.КлючОбъекта, КлючОбъекта) Тогда
					
					ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Выборка.Пользователь);
					
					НоваяСтрока = СохраненныеНастройки.Добавить();					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.АдресНастроек = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(Выборка.Настройки, Новый СжатиеДанных(9)), ЭтаФорма.УникальныйИдентификатор);
					НоваяСтрока.ПользовательУИД = ?(ПользовательИБ = Неопределено, Неопределено, ПользовательИБ.УникальныйИдентификатор);
					НоваяСтрока.Действие = "Пропустить";
					
					МассивКлючей = СтрРазделить(Выборка.КлючОбъекта, "/");
					
					Если МассивКлючей.Количество() = 2 Тогда
					
						НоваяСтрока.КлючОтчета = МассивКлючей[0];
						КлючВарианта = МассивКлючей[1];
						
						Пользовательский = Ложь;
						Попытка
						    УИД = Новый УникальныйИдентификатор(КлючВарианта);
							НайденныеСтроки = ЭтаФорма.СохраненныеВарианты.НайтиСтроки(Новый Структура("КлючНастроек", КлючВарианта));
							Пользовательский = Истина;
						Исключение
							НайденныеСтроки = ЭтаФорма.ПредопределенныеВарианты.НайтиСтроки(Новый Структура("Имя", КлючВарианта));
						КонецПопытки;
						
						Если НайденныеСтроки.Количество() = 1 И ЗначениеЗаполнено(НайденныеСтроки[0].ВариантОтчета) Тогда
							
							Если Пользовательский Тогда
								НоваяСтрока.ПользовательСсылка = НайденныеСтроки[0].ПользовательСсылка;
							КонецЕсли; 
							НоваяСтрока.ВариантОтчета = НайденныеСтроки[0].ВариантОтчета;
							
						КонецЕсли; 
						
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	КоличествоСохраненныхНастроек = СохраненныеНастройки.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлючиТекущихВариантов()

	Если ВидОтчета = 0 Тогда
		КлючОбъекта = "Отчет." + КлючОтчета;
	Иначе
		КлючОбъекта = "ВнешнийОтчет." + КлючОтчета.ИмяОбъекта;
	КонецЕсли; 
	
	// заполним ключи текущих вариантов
	ЭтаФорма.СистемныеНастройки.Очистить();
	Выборка = ХранилищеСистемныхНастроек.Выбрать(Новый Структура("КлючОбъекта", КлючОбъекта + "/КлючТекущегоВарианта"));
	
	ЕстьСледующий = Истина;
	Пока ЕстьСледующий Цикл
	
		Попытка
			ЕстьСледующий = Выборка.Следующий();
			Если ЕстьСледующий Тогда
				
				НоваяСтрока = СистемныеНастройки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.КлючОтчета = КлючОбъекта;
				
				Попытка
					НоваяСтрока.ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(Выборка.Настройки).ПолучитьОбъект().Ссылка;
				Исключение
					НайденныеСтроки = ЭтаФорма.ПредопределенныеВарианты.НайтиСтроки(Новый Структура("Имя", Выборка.Настройки));
					Если НайденныеСтроки.Количество() > 0 Тогда
					    НоваяСтрока.ВариантОтчета = НайденныеСтроки[0].ВариантОтчета;
					Иначе
						НайденныеСтроки = ЭтаФорма.СохраненныеВарианты.НайтиСтроки(Новый Структура("КлючНастроек", Выборка.Настройки));
						Если НайденныеСтроки.Количество() > 0 Тогда
							НоваяСтрока.ВариантОтчета = НайденныеСтроки[0].ВариантОтчета;
						КонецЕсли; 
					КонецЕсли;
				КонецПопытки; 
				
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
	
	КонецЦикла;
	
	// заполним ключи пользовательских настроек по предопределенным вариантам
	Для каждого ПредопределенныйВариант Из ЭтаФорма.ПредопределенныеВарианты Цикл
		ЗаполнитьКлючиПользовательскихНастроек(КлючОбъекта, ПредопределенныйВариант.Имя);
		Если ЗначениеЗаполнено(ПредопределенныйВариант.ВариантОтчета) Тогда
			ЗаполнитьКлючиПользовательскихНастроек(КлючОбъекта, ПредопределенныйВариант.ВариантОтчета.УникальныйИдентификатор());
		КонецЕсли; 
	КонецЦикла; 
	
	// заполним ключи пользовательских настроек по пользовательским вариантам
	Для каждого ПользовательскийВариант Из ЭтаФорма.СохраненныеВарианты Цикл
		ЗаполнитьКлючиПользовательскихНастроек(КлючОбъекта, ПользовательскийВариант.КлючНастроек);
		Если ЗначениеЗаполнено(ПользовательскийВариант.ВариантОтчета) Тогда
			ЗаполнитьКлючиПользовательскихНастроек(КлючОбъекта, ПользовательскийВариант.ВариантОтчета.УникальныйИдентификатор());
		КонецЕсли; 
	КонецЦикла;
	
	ЭтаФорма.КоличествоКлючей = ЭтаФорма.СистемныеНастройки.Количество();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлючиПользовательскихНастроек(КлючОбъекта, ПредставлениеВарианта)

	КлючОтбор = КлючОбъекта + "/" + ПредставлениеВарианта + "/КлючТекущихПользовательскихНастроек";
	Выборка = ХранилищеСистемныхНастроек.Выбрать(Новый Структура("КлючОбъекта", КлючОтбор));

	ЕстьСледующий = Истина;
	Пока ЕстьСледующий Цикл
	
		Попытка
			ЕстьСледующий = Выборка.Следующий();
			Если ЕстьСледующий Тогда
				
				НоваяСтрока = СистемныеНастройки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.КлючОтчета = КлючОбъекта;
				
				Если ЗначениеЗаполнено(Выборка.Настройки) Тогда
				
					Попытка
						НоваяСтрока.ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(Выборка.Настройки).ПолучитьОбъект().Ссылка;
					Исключение 
						НайденныеСтроки = ЭтаФорма.СохраненныеНастройки.НайтиСтроки(Новый Структура("КлючНастроек", Выборка.Настройки));
						Если НайденныеСтроки.Количество() > 0 Тогда
						    НоваяСтрока.ВариантОтчета = НайденныеСтроки[0].НастройкиОтчета;
						КонецЕсли; 
					КонецПопытки;						
				
				КонецЕсли; 
				
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
	
	КонецЦикла;


КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьДействиеДляВыделенныхСтрок(Действие)
	
	ИмяТаблицы = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя, "Страница", "");
	ВыделенныеСтроки = Элементы[ИмяТаблицы].ВыделенныеСтроки;
	
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
	
		ТекСтрока = ЭтаФорма[ИмяТаблицы].НайтиПоИдентификатору(ВыделеннаяСтрока);
		ТекСтрока.Действие = Действие;
	
	КонецЦикла; 		

КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияНаСервере()
	
	ИмяТаблицы = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя, "Страница", "");
	ЭтоПредопределенные = ИмяТаблицы = "ПредопределенныеВарианты";
	ЭтоНастройки = ИмяТаблицы = "СохраненныеНастройки";
	
	Для каждого ТекСтрока Из ЭтаФорма[ИмяТаблицы] Цикл
		
		Если Не ЭтоПредопределенные И Не ЗначениеЗаполнено(ТекСтрока.ПользовательСсылка) Тогда
				
			ТекстОшибки = "Не заполнен пользователь. ";
			Если ЭтоНастройки Тогда
				ТекстОшибки = ТекстОшибки + "Настройка с ключом " + ТекСтрока.КлючНастроек + " пропущена!";
			Иначе
				ТекстОшибки = ТекстОшибки + "Вариант с ключом " + ТекСтрока.КлючНастроек + " пропущен!";
			КонецЕсли; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		
		КонецЕсли; 
		
		Если ЭтоНастройки И Не ЗначениеЗаполнено(ТекСтрока.ВариантОтчета) Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен вариант отчета. Настройка с ключом " + ТекСтрока.КлючНастроек + " пропущена!");
			Продолжить;
		
		КонецЕсли; 
		
		Вариант = Неопределено;
		
		Если ТекСтрока.Действие = "Обновить" И ЗначениеЗаполнено(ТекСтрока.ВариантОтчета) Тогда
			Если ЭтоНастройки Тогда
				Вариант = ТекСтрока.НастройкиОтчета.ПолучитьОбъект();
			Иначе
				Вариант = ТекСтрока.ВариантОтчета.ПолучитьОбъект();
			КонецЕсли; 
		КонецЕсли; 
		
		Если ТекСтрока.Действие = "Создать" Тогда
			Вариант = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		КонецЕсли; 
		
		Если Не Вариант = Неопределено Тогда
		
			Если ЭтоНастройки Тогда
				Вариант.Ключ = ТекСтрока.КлючОтчета + "/" + ТекСтрока.ВариантОтчета.УникальныйИдентификатор();
				Вариант.Родитель = ТекСтрока.ВариантОтчета;
			Иначе
				Вариант.Ключ = ТекСтрока.КлючОбъекта;
			КонецЕсли;
			
			Вариант.Наименование = ТекСтрока.Представление;
			Если ЭтоАдресВременногоХранилища(ТекСтрока.АдресНастроек) Тогда
				Вариант.Настройки = ПолучитьИзВременногоХранилища(ТекСтрока.АдресНастроек);
			КонецЕсли; 
					
			Если ЭтоПредопределенные Тогда
			    
				Вариант.Общий = Истина;
				Вариант.ПредопределенныйВариант = Истина;
				Вариант.ИмяПредопределенногоВарианта = ТекСтрока.Имя;
				
				Вариант.Автор = Справочники.Пользователи.ПустаяСсылка();
				Вариант.Организация = Справочники.Организации.ПустаяСсылка();
				
			Иначе
				
				Вариант.Общий = Ложь;
				Вариант.ПредопределенныйВариант = Ложь;
				Вариант.ИмяПредопределенногоВарианта = "";
				
				Вариант.Автор = ТекСтрока.ПользовательСсылка;
				Если ЗначениеЗаполнено(Вариант.Автор) Тогда
					Вариант.Организация = Вариант.Автор.Организация;
				КонецЕсли; 
				
			КонецЕсли;
			
			Вариант.ДополнительныеСвойства.Вставить("ОбновлениеВариантов");
			Вариант.Записать();
			
			Если ЭтоНастройки Тогда
				ТекСтрока.НастройкиОтчета = Вариант.Ссылка;
			Иначе
				ТекСтрока.ВариантОтчета = Вариант.Ссылка;
			КонецЕсли;
							
		КонецЕсли; 
	
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Процедура УстановитьКлючиНаСервере()
	
	Для каждого ТекСтрока Из ЭтаФорма.СистемныеНастройки Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.ВариантОтчета) Тогда
			МассивКлючей = СтрРазделить(ТекСтрока.КлючОбъекта, "/");
			Если МассивКлючей.Количество() = 3 Тогда
				//Это КлючТекущихПользовательскихНастроек, заменяем УИД стандартного хранилища на новый
				НовыйКлюч = МассивКлючей[0] + "/" + ТекСтрока.ВариантОтчета.Родитель.УникальныйИдентификатор() + "/" + МассивКлючей[2];
				ХранилищеСистемныхНастроек.Удалить(ТекСтрока.КлючОбъекта, Неопределено, ТекСтрока.Пользователь);		
			Иначе	
				НовыйКлюч = ТекСтрока.КлючОбъекта;
			КонецЕсли; 
			ХранилищеСистемныхНастроек.Сохранить(НовыйКлюч, , ТекСтрока.ВариантОтчета.УникальныйИдентификатор(), , ТекСтрока.Пользователь)
		Иначе
			ХранилищеСистемныхНастроек.Удалить(ТекСтрока.КлючОбъекта, Неопределено, ТекСтрока.Пользователь);		
		КонецЕсли; 
	
	КонецЦикла; 
		
КонецПроцедуры

#КонецОбласти 

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
