
&НаСервере
Процедура ВывестиРеквизитыЮрФизЛицаНаСервере()
	
	РаботаСНормативноСправочнойИнформацией.ВывестиРеквизитыЮрФизЛица(Объект.ЮрФизЛицо, ЭтаФорма, "ГруппаРеквизитыЮрФизЛица");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВывестиРеквизитыЮрФизЛицаНаСервере();
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервереБезКонтекста
Процедура ПроверитьСоединениеСБазойБухгалтерии(Организация)
	
	ВремяНачалаПодключения = ТекущаяДатаСеанса();
	
	Если РаботаСВнешнимиСистемами.ПолучитьCOMСоединениеСБухгалтерией(Организация) <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Соединение успешно установлено. Время подключения составило: " + (ТекущаяДатаСеанса() - ВремяНачалаПодключения) + " сек.");
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоединениеСБазойБухгалтерии

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНаименованиеФункциональнойРоли(Объект);

КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьСоединениеСБазойБухгалтерии(Команда)
	
	ПроверитьСоединениеСБазойБухгалтерии(Объект.Ссылка);
	
КонецПроцедуры
