&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОтчетОСверке = ВыполнитьСверкуССанкционнымСпискомНедружественныхГосударств();
	
	Если ОтчетОСверке = Неопределено Тогда
		ПоказатьПредупреждение(, "При выполнении сверки прозошли ошибки!");
		Возврат;	
	КонецЕсли;
	ОтчетОСверке.Показать("Результат сверки с санкционным списком недружественных государств");	
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЖурналСверкиСоСписками"));
КонецПроцедуры

&НаСервере
Функция ВыполнитьСверкуССанкционнымСпискомНедружественныхГосударств()
	ОтчетОСверке = Новый ТабличныйДокумент;

	Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком(Организация,,, ОтчетОСверке, Справочники.ВидыПеречнейОбъектов.СанкционныйСписокНедружественныхГосударств);
	
	Возврат ОтчетОСверке;
КонецФункции