
Функция ПолучитьПредставлениеСтрокиБанковскойВыписки(СтрокаБанковскойВыписки) Экспорт
	
	Если ЗначениеЗаполнено(СтрокаБанковскойВыписки) Тогда
		
		РеквизитыВыписки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаБанковскойВыписки, "Дата, Организация, ВидПлатежногоДокумента, НомерПлатежногоДокумента, ДатаПлатежногоДокумента");
		ДатаАкцептования = РаботаСДокументами.ПолучитьДатуАкцептования(СтрокаБанковскойВыписки, РеквизитыВыписки.Организация);
		
		Возврат Строка(РеквизитыВыписки.ВидПлатежногоДокумента) + " № " + РеквизитыВыписки.НомерПлатежногоДокумента
			+ " от " + Формат(РеквизитыВыписки.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy")
			+ ?(ДатаАкцептования <> Неопределено, ", Акц. " + Формат(ДатаАкцептования, "ДЛФ=DT"), "")
			+ ?(НачалоДня(РеквизитыВыписки.Дата) <> РеквизитыВыписки.ДатаПлатежногоДокумента, " (выписка от " + Формат(РеквизитыВыписки.Дата, "ДФ=dd.MM.yyyy") + ")", "");
		
	КонецЕсли;
	
	Возврат "Выбрать строку банковской выписки";
	
КонецФункции // ПолучитьПредставлениеСтрокиБанковскойВыписки

Функция ПолучитьСписокПлатежныхДокументов(ВидДвижения) Экспорт
	
	СписокПлатежныхДокументов = Новый СписокЗначений;
	
	Если      ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход") Тогда
		СписокПлатежныхДокументов.Добавить("ВводДенежныхСредств",						"Ввод денежных средств");
		СписокПлатежныхДокументов.Добавить("ПриходПроцентовМНО",						"Приход процентов МНО");
		СписокПлатежныхДокументов.Добавить("ПриходПроцентовПоКредитномуИнструменту",	"Приход % по кредитному инструменту");
		СписокПлатежныхДокументов.Добавить("ЗакрытиеКредитногоИнструмента",				"Закрытие кредитного инструмента");
		СписокПлатежныхДокументов.Добавить("Аванс",										"Аванс");
		
	ИначеЕсли ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход") Тогда
		СписокПлатежныхДокументов.Добавить("ВыводДенежныхСредств",						"Вывод денежных средств");
		СписокПлатежныхДокументов.Добавить("РазмещениеКредитногоИнструмента",			"Размещение д/с на кредитном инструменте");
		
	КонецЕсли;
	
	// могут быть как приходными, так и расходными
	СписокПлатежныхДокументов.Добавить("Оплата");
	СписокПлатежныхДокументов.Добавить("ПереводДенежныхСредств",						"Перевод денежных средств");
	
	Возврат СписокПлатежныхДокументов;
	
КонецФункции // ПолучитьСписокПлатежныхДокументов

&НаКлиенте
Процедура ВыполнитьДействиеСоСтрокойБанковскойВыписки(РеквизитыПлатежногоДокумента, ИмяСтрокиБанковскойВыписки = "СтрокаБанковскойВыписки", Форма, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если Форма.Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ был изменен. Перед открытием или выбором строки банковской выписки его необходимо записать");
		Возврат;
	КонецЕсли;
	
	СтрокаБанковскойВыписки = Форма.Объект[ИмяСтрокиБанковскойВыписки];
	
	// если прав на редактирование документа нет, то ссылка работает как обычная ссылка
	Если Не РаботаСПользователями.ЕстьПраваНаРедактированиеДокумента(Форма.Объект.Ссылка) Тогда
		ОткрытьЗначение(СтрокаБанковскойВыписки);
		Возврат;
	КонецЕсли;
	
	РеквизитыПлатежногоДокумента.Вставить(ИмяСтрокиБанковскойВыписки, СтрокаБанковскойВыписки);
		
	Если ЗначениеЗаполнено(СтрокаБанковскойВыписки) Тогда
		СписокДействий = Новый СписокЗначений();
		СписокДействий.Добавить("Открыть");
		СписокДействий.Добавить("Изменить");
		СписокДействий.Добавить("Очистить");
		
		ВыбДействие = Форма.ВыбратьИзМеню(СписокДействий, Форма.Элементы[ИмяСтрокиБанковскойВыписки]);
		
		Если      ВыбДействие = Неопределено Тогда
			Возврат;
			
		ИначеЕсли ВыбДействие.Значение = "Открыть" Тогда
			ОткрытьЗначение(СтрокаБанковскойВыписки);
			
		ИначеЕсли ВыбДействие.Значение = "Изменить" Тогда
			ПараметрыВыбора = Новый Структура("РежимВыбора, ИсточникВыбора, Отбор, ТекущиеДанные",
				Истина,
				ИмяСтрокиБанковскойВыписки,
				РеквизитыПлатежногоДокумента,
				Новый Структура(?(РеквизитыПлатежногоДокумента.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход"), "Поступление", "Списание"), РеквизитыПлатежногоДокумента.Сумма));
				
			ОткрытьФормуМодально("Документ.СтрокаБанковскойВыписки.ФормаВыбора", ПараметрыВыбора, Форма);
			
		ИначеЕсли ВыбДействие.Значение = "Очистить" Тогда
			Форма.Объект[ИмяСтрокиБанковскойВыписки] = Неопределено;
			Форма[ИмяСтрокиБанковскойВыписки]        = ПолучитьПредставлениеСтрокиБанковскойВыписки(Неопределено);
			
			Форма.Модифицированность = Истина;
			
		КонецЕсли;
		
	Иначе
		ПараметрыВыбора = Новый Структура("РежимВыбора, ИсточникВыбора, Отбор, ТекущиеДанные",
			Истина,
			ИмяСтрокиБанковскойВыписки,
			РеквизитыПлатежногоДокумента,
			Новый Структура(?(РеквизитыПлатежногоДокумента.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход"), "Поступление", "Списание"), РеквизитыПлатежногоДокумента.Сумма));
				
		ОткрытьФормуМодально("Документ.СтрокаБанковскойВыписки.ФормаВыбора", ПараметрыВыбора, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоответствиеСтрокиБанковскойВыпискиИПлатежногоДокумента(РеквизитыПлатежногоДокумента, СтрокаБанковскойВыписки, ВидДвижения, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(СтрокаБанковскойВыписки) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСтрокиБанковскойВыписки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаБанковскойВыписки,
		"Организация, Дата, ДатаПлатежногоДокумента, ВидДвижения, РасчетныйСчет, Контрагент, РасчетныйСчетКонтрагента");
	
	// организация, дата и р/счет есть в шапке каждого платежного документа
	Если РеквизитыПлатежногоДокумента.Организация <> РеквизитыСтрокиБанковскойВыписки.Организация Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Различаются организации в документе и в строке банковской выписки", РеквизитыПлатежногоДокумента, "Организация",, Отказ);
	КонецЕсли;
	
	Если РеквизитыСтрокиБанковскойВыписки.Дата < РеквизитыСтрокиБанковскойВыписки.ДатаПлатежногоДокумента Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Странная выписка. Дата платежного документа не может быть позже даты выписки", РеквизитыПлатежногоДокумента,,, Отказ);
	КонецЕсли; 
	
	Если НачалоДня(РеквизитыПлатежногоДокумента.Дата) <> НачалоДня(РеквизитыСтрокиБанковскойВыписки.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Различаются даты документа и строки банковской выписки", РеквизитыПлатежногоДокумента, "Дата",, Отказ);
	КонецЕсли;
	
	Если РеквизитыПлатежногоДокумента.РасчетныйСчет <> РеквизитыСтрокиБанковскойВыписки.РасчетныйСчет Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Различаются р/счета в документе и в строке банковской выписки", РеквизитыПлатежногоДокумента, "РасчетныйСчет",, Отказ);
	КонецЕсли;
	
	// вид движения есть не всегда, но его в обязательном порядке передают отдельным параметром
	Если ВидДвижения <> РеквизитыСтрокиБанковскойВыписки.ВидДвижения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Различаются виды движения в документе и в строке банковской выписки", РеквизитыПлатежногоДокумента, "ВидДвижения",, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоответствиеСтрокиБанковскойВыпискиИПлатежногоДокумента
