&НаСервере
Процедура СформироватьСписокРазделовОтчета()
	
	ЭтаФорма.РазделыОтчета.Очистить();
	
	ЭтаФорма.СохраняемыеРазделы = Отчеты.РегламентированныйОтчетФинансовыеОперацииНПФ.СформироватьСписокРазделовОтчета(ЭтаФорма.ИмяФормы);
	
	Для Каждого Раздел Из ЭтаФорма.СохраняемыеРазделы Цикл
		ДобавитьРазделОтчета(РазделыОтчета, Раздел.Значение, Раздел.Представление, Раздел.Значение = "МногострочныйРаздел");
		Раздел.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРазделОтчета(РазделыОтчета, ИмяРаздела, Представление, МногострочныйРаздел = Ложь)

	НоваяСтрока = РазделыОтчета.Добавить();
	
	НоваяСтрока.ИмяРаздела = ИмяРаздела;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.МногострочныйРаздел = МногострочныйРаздел;

КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	ЭтаФорма.СтруктураРеквизитовФормы = Отчеты.РегламентированныйОтчетФинансовыеОперацииНПФ.ПолучитьСтруктуруПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиСервер()
	
	СформироватьСписокРазделовОтчета();
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);

	ИмяМакетаСоставаПоказателей = КонсолидированнаяОтчетность.ПолучитьИмяМакетаСоставаПоказателей("РегламентированныйОтчетФинансовыеОперацииНПФ", СтруктураРеквизитовФормы);	
	МакетСоставаПоказателей = Отчеты[СтруктураНаименованийОтчета.ИсточникОтчета].ПолучитьМакет(ИмяМакетаСоставаПоказателей);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МакетСоставаПоказателей", МакетСоставаПоказателей);
	СтруктураПараметров.Вставить("мТаблицаСоставПоказателей", мТаблицаСоставПоказателей);
	СтруктураПараметров.Вставить("УникальныйИдентификатор", ЭтаФорма.УникальныйИдентификатор);
	
	СтруктураПараметров.Вставить("Адрес_мСтруктураЦветовРаскраски", Адрес_мСтруктураЦветовРаскраски);
	СтруктураПараметров.Вставить("Адрес_мСтруктураВариантыЗаполнения", Адрес_мСтруктураВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаВариантыЗаполнения", Адрес_мТаблицаВариантыЗаполнения);
	
	КонсолидированнаяОтчетность.ЗаполнитьНачальныеНастройкиСервер(СтруктураПараметров);
	
	Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		Если Лев(ЭлементСтруктуры.Ключ, 6) = "Адрес_" Тогда
			ЭтаФорма[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено Тогда
		
		СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
		СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
		СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
		
		ЗаполнитьТабличныеДокументыИзМакетов();
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
           И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
        	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

		КонецЕсли;
		
	Иначе
		
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			// документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе
			// Это новый документ.
			
			Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
				СтруктураРеквизитовФормы.ВалютаДокумента  		  	= ЭтаФорма.НастройкиОтчета.ВалютаДокумента;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         	= ЭтаФорма.НастройкиОтчета.ЕдиницаИзмерения;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	= ЭтаФорма.НастройкиОтчета.ТочностьЕдиницыИзмерения;
				ЭтаФорма.Подписант 									= ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
			Иначе	
				СтруктураРеквизитовФормы.ВалютаДокумента  		  = СтруктураРеквизитовФормы.Организация.ВалютаУчета;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			КонецЕсли; 
			
			СтруктураРеквизитовФормы.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
			
			ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
			СтараяРедакцияФормы = КонсолидированнаяОтчетность.ПолучитьПредыдущуюФорму(ИсточникОтчета, СтруктураРеквизитовФормы);
			СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода = КонсолидированнаяОтчетность.ПолучитьОтчетНаКонецПредыдущегоПериода(СтруктураРеквизитовФормы, ИсточникОтчета, , СтараяРедакцияФормы);
			ЭтаФорма.СтатусОтчета = "Черновик";
			
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьТабличныеДокументыИзМакетов();
		ЗаполнитьДенежныйПоказательСРазмерностью();
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НаимСчетаДоверительногоУправления = СтруктураРеквизитовФормы.СчетДоверительногоУправления.Наименование;
	
	Если Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 1 Тогда 
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	ИначеЕсли СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = "период с " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	Иначе
		СтруктураРеквизитовФормы.СтрПериодОтчета = "Январь - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	КонецЕсли;
	
	//чтобы при ручном добавлении не выбрать тип
	ЭтаФорма.Элементы.МногострочныйРазделСчетУчета.ВыбиратьТип = Ложь;
	ТипПланСчетов = Новый Массив;
	Если СтруктураРеквизитовФормы.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда 
		ТипПланСчетов.Добавить(Тип("ПланСчетовСсылка.Единый"));
	Иначе
		ТипПланСчетов.Добавить(Тип("ПланСчетовСсылка.Основной"));
	КонецЕсли;	
	ЭтаФорма.Элементы.МногострочныйРазделСчетУчета.ОграничениеТипа = Новый ОписаниеТипов(ТипПланСчетов);
	
	ИнициализироватьСтруктуруЗаголовковОтчетов();
	
	мСкопированаФорма = Неопределено;
	Параметры.Свойство("мСкопированаФорма", мСкопированаФорма);
	Если ЗначениеЗаполнено(мСкопированаФорма) Тогда 
		Модифицированность = Истина;
	КонецЕсли;
	
	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);
	Элементы.НомерКорректировки.Видимость = ЭтаФорма.СтатусОтчета = "Корректировка";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерностьВалюту()
	
	ЕдиницаИзмеренияНадпись = "";
	ПредставлениеВалютыДокумента = ?(ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента), СтруктураРеквизитовФормы.ВалютаДокумента, "руб");
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		ЕдиницаИзмеренияНадпись ="в "+ ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		ЕдиницаИзмеренияНадпись ="в тысячах " + ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		ЕдиницаИзмеренияНадпись = "в миллионах " + ПредставлениеВалютыДокумента;
	КонецЕсли;
	
	Возврат ЕдиницаИзмеренияНадпись;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДенежныйПоказательСРазмерностью()
	
	ДенежныйПоказательСРазмерностью = КонсолидированнаяОтчетность.ПолучитьДенежныйПоказательСРазмерностью(СтруктураРеквизитовФормы, ЭтаФорма);
	
	РазмерностьДокумента = ПолучитьРазмерностьВалюту();
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		ИмяРаздела = ТекСтрока.ИмяРаздела;
		
		Если ТекСтрока.МногострочныйРаздел Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Попытка
			ТекРаздел = ТекСтрока.ТабличныйДокумент;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если НЕ ТекРаздел.Области.Найти("ДенежныйПоказательСРазмерностью") = Неопределено
			и ТекРаздел.Области.ДенежныйПоказательСРазмерностью.СодержитЗначение
			Тогда
			ТекРаздел.Области.ДенежныйПоказательСРазмерностью.Значение = ДенежныйПоказательСРазмерностью;
		КонецЕсли;
		Если НЕ ТекРаздел.Области.Найти("НаименованиеВалютыОтчета") = Неопределено 
			и ТекРаздел.Области.НаименованиеВалютыОтчета.СодержитЗначение
			Тогда
			ТекРаздел.Области.НаименованиеВалютыОтчета.Значение = РазмерностьДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруЗаголовковОтчетов()
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов = Новый Соответствие;
	
	КонецПредыдущегоГода = КонецГода(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	ГодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ = 'гггг'");
	ГодПредыдущий = Формат(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12), "ДФ = 'гггг'");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодОтчетногоГода", "за " + ГодОтчета + "г.");
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодПредыдущегоГода", "за " + ГодПредыдущий + "г.");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаОтчетнуюДату", "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD"));
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаКонецПредыдущегоГода", "На " + Формат(КонецПредыдущегоГода, "ДЛФ=DD"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьГруппировкиТитульнойСтраницы(ТабличныйДокумент)
	
	ТабличныйДокумент.Область("R18:R78").Сгруппировать();  		//1.1	
	ТабличныйДокумент.Область("R80:R137").Сгруппировать();  	//1.2
	ТабличныйДокумент.Область("R139:R227").Сгруппировать();	 	//1.3
	ТабличныйДокумент.Область("R230:R294").Сгруппировать();	   	//2.1
	ТабличныйДокумент.Область("R296:R310").Сгруппировать();		//2.2
	ТабличныйДокумент.Область("R312:R324").Сгруппировать();     //2.3
	
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры	

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ПоказателиОтчета;
	Перем РазделыСРучнойКорректировкой;
	
	СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
	
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         	 = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	 = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.ВалютаДокумента			 = СтруктураРеквизитовФормы.мСохраненныйДок.ВалютаДокумента;
	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода	 = СтруктураРеквизитовФормы.мСохраненныйДок.ОтчетНаКонецПрошлогоГода;
	СтруктураРеквизитовФормы.ВидУчета					 = СтруктураРеквизитовФормы.мСохраненныйДок.ВидУчета;
	Комментарий                                        	 = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтатусОтчета                                         = СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета;
	НомерКорректировки                                 	 = СтруктураРеквизитовФормы.мСохраненныйДок.НомерКорректировки;

	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", 				ПоказателиОтчета);
	СписокСохранения.Свойство("РазделыСРучнойКорректировкой", 	РазделыСРучнойКорректировкой);
	СписокСохранения.Свойство("Подписант", ЭтаФорма.Подписант);
	
	Для Каждого ТекСтрока из ЭтаФорма.РазделыОтчета Цикл
		Если Не РазделыСРучнойКорректировкой.Найти(ТекСтрока.ИмяРаздела) = Неопределено Тогда
			ТекСтрока.РучнаяКорректировка = Истина;
		КонецЕсли;
		Если ТекСтрока.МногострочныйРаздел Тогда
			Попытка
				
				ЭтаФорма[ТекСтрока.ИмяРаздела].Загрузить(СписокСохранения[ТекСтрока.ИмяРаздела]);
				
				Если Не РазделыСРучнойКорректировкой.Найти(ТекСтрока.ИмяРаздела) = Неопределено Тогда
					Элементы["Таблица" + ТекСтрока.ИмяРаздела + "РучнаяКорректировка"].ТолькоПросмотр = Ложь;
					Элементы["Таблица" + ТекСтрока.ИмяРаздела].ТолькоПросмотр = Ложь;
				КонецЕсли;
				
			Исключение
			КонецПопытки;
		КонецЕсли; 
		
		Если ТекСтрока.ИмяРаздела = "ОтчетТитульнаяСтраница2020" Тогда 			
			УстановитьГруппировкиТитульнойСтраницы(ТекСтрока.ТабличныйДокумент);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого ТекСтрока из ПоказателиОтчета Цикл
		Попытка
			ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекСтрока.ИмяРаздела);
			ТабДок.Области[ТекСтрока.ИмяПоказателя].Значение = ТекСтрока.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеДокументыИзМакетов(ЭтоНовый = Истина)
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		Попытка
			
			Если ТекСтрока.ИмяРаздела = "ОтчетТитульнаяСтраница2020" Тогда
				КонсолидированнаяОтчетность.ЗаполнитьТабличныйДокументИзМакета(ЭтаФорма, ТекСтрока, "Макет" + ТекСтрока.ИмяРаздела);
			КонецЕсли; 
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦветФонаЯчейки(ИмяТекРаздела = "", ТекРаздел = Неопределено)

	КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяТекРаздела, ТекРаздел);
	Если ЗначениеЗаполнено(ТекРаздел = Неопределено) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяТекРаздела);
	Иначе
		ЭтаФорма.ТабличныйДокумент = ТекРаздел;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодСтроки()
	
	ТекСтрока = ЭтаФорма.МногострочныйРаздел.НайтиПоИдентификатору(Элементы.ТаблицаМногострочныйРаздел.ТекущаяСтрока);
	КодыСтрок = ПолучитьТаблицуКодыСтрок();
	ТекСтрока.КодСтроки = ПолучитьКодСтроки(ТекСтрока, КодыСтрок, СтруктураРеквизитовФормы.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления);

КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуКодыСтрок()

	Если ЗначениеЗаполнено(Адрес_ТаблицаКодыСтрок) Тогда
	
		Возврат ПолучитьИзВременногоХранилища(Адрес_ТаблицаКодыСтрок);
		
	Иначе
		
		МакетКодыСтрок = Отчеты.РегламентированныйОтчетФинансовыеОперацииНПФ.ПолучитьМакет("КодыСтрок");
	
		КодыСтрок = Новый ТаблицаЗначений;
		КодыСтрок.Колонки.Добавить("ВидДоговора", 	Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления"));
		КодыСтрок.Колонки.Добавить("Раздел", 		Новый ОписаниеТипов("Строка"));
		КодыСтрок.Колонки.Добавить("Резидент", 		Новый ОписаниеТипов("Булево"));
		КодыСтрок.Колонки.Добавить("ВидЮрФизЛица", 	Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЮрФизЛиц"));
		КодыСтрок.Колонки.Добавить("ГосОрган", 		Новый ОписаниеТипов("Булево"));
		КодыСтрок.Колонки.Добавить("Сектор", 		Новый ОписаниеТипов("СправочникСсылка.ВидыПеречнейОбъектов"));
		КодыСтрок.Колонки.Добавить("КодСтроки", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)));
		
		Для НомерСтроки = 2 По МакетКодыСтрок.ВысотаТаблицы Цикл
		
			Сектор = МакетКодыСтрок.Область(НомерСтроки, 6, НомерСтроки, 6).Текст;
			
			НоваяСтрока = КодыСтрок.Добавить();
			НоваяСтрока.ВидДоговора 	= Перечисления.ВидыДоговоровДоверительногоУправления[МакетКодыСтрок.Область(НомерСтроки, 1, НомерСтроки, 1).Текст];
			НоваяСтрока.Раздел 			= МакетКодыСтрок.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
			НоваяСтрока.Резидент 		= Булево(Число(МакетКодыСтрок.Область(НомерСтроки, 3, НомерСтроки, 3).Текст));
			НоваяСтрока.ВидЮрФизЛица 	= Перечисления.ВидыЮрФизЛиц[МакетКодыСтрок.Область(НомерСтроки, 4, НомерСтроки, 4).Текст];
			НоваяСтрока.ГосОрган 		= Булево(Число(МакетКодыСтрок.Область(НомерСтроки, 5, НомерСтроки, 5).Текст));
			НоваяСтрока.Сектор 			= ?(ЗначениеЗаполнено(Сектор), Справочники.ВидыПеречнейОбъектов[Сектор], Справочники.ВидыПеречнейОбъектов.ПустаяСсылка());
			НоваяСтрока.КодСтроки 		= МакетКодыСтрок.Область(НомерСтроки, 7, НомерСтроки, 7).Текст;
		
		КонецЦикла;
		
		Адрес_ТаблицаКодыСтрок = ПоместитьВоВременноеХранилище(КодыСтрок, УникальныйИдентификатор);
		Возврат КодыСтрок;
	
	КонецЕсли; 

КонецФункции

&НаСервере
Функция ПолучитьКодСтроки(Выборка, КодыСтрок, ВидДоговораДоверительногоУправления)

	СтруктураПоиска = Новый Структура("ВидДоговора, Раздел", 
		ВидДоговораДоверительногоУправления, 
		Выборка.Раздел);
		
	РазделыСАнализомСекторов = Новый Массив;
	РазделыСАнализомСекторов.Добавить("Долговые");
	РазделыСАнализомСекторов.Добавить("Долевые");
	РазделыСАнализомСекторов.Добавить("БрокерскиеСчета");
	РазделыСАнализомСекторов.Добавить("КупонныйДоход");
	РазделыСАнализомСекторов.Добавить("ДебиторскаяЗадолженность");
	РазделыСАнализомСекторов.Добавить("ДебиторскаяЗадолженностьРЕПО");
	
	Если Не РазделыСАнализомСекторов.Найти(Выборка.Раздел) = Неопределено Тогда
	
		СтруктураПоиска.Вставить("Резидент", Выборка.Резидент);
		СтруктураПоиска.Вставить("ГосОрган", Выборка.ГосОрган);
		
		Если Выборка.Резидент Тогда
			СтруктураПоиска.Вставить("ВидЮрФизЛица", Выборка.ЮрФизЛицо.ВидЮрФизЛица);
			Если СтруктураПоиска.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
				СтруктураПоиска.Вставить("Сектор", Выборка.Сектор);
				Если Выборка.Сектор = Неопределено Тогда
				
					Возврат 0;
				
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
	
	КонецЕсли; 
	
	НайденныеСтроки = КодыСтрок.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
	
		Возврат НайденныеСтроки[0].КодСтроки;
		
	Иначе 
		
		Если СтруктураПоиска.Свойство("Сектор") Тогда
			
			СтруктураПоиска.Удалить("Сектор");
			НайденныеСтроки = КодыСтрок.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Возврат НайденныеСтроки[0].КодСтроки;
			КонецЕсли;
			
		КонецЕсли; 
		
		Возврат Выборка.КодСтроки;
	
	КонецЕсли; 

КонецФункции

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
		
		ЗаполнитьАвто();
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
			ЭтаФорма.СтатусОтчета = "Черновик";
		КонецЕсли; 
		
		Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
			Записать(Неопределено);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьФорму Тогда
		ЭтаФорма.Открыть();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить() Экспорт
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	ЗаполнитьАвто();
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
		ЭтаФорма.СтатусОтчета = "Черновик";
	КонецЕсли; 
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьСтруктуруРеквизитовФормы();
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы, Параметры);
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	ЗаполнитьНачальныеНастройкиСервер();
	Инициализация(Параметры.БезОткрытияФормы);
	
	ИмяОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].ИмяРаздела;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	КонсолидированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонсолидированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета) Тогда
	
		ПредыдущаяСтрока = ЭтаФорма.РазделыОтчета.НайтиПоИдентификатору(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета);
		Если Не ПредыдущаяСтрока = Неопределено И Не ПредыдущаяСтрока.МногострочныйРаздел Тогда
		
			ПредыдущаяСтрока.ТабличныйДокумент = ЭтаФорма.ТабличныйДокумент;
		
		КонецЕсли; 
	
	КонецЕсли; 
		
	ТекДанные = Элемент.ТекущиеДанные;
	ЭтаФорма.РучнаяКорректировка = ТекДанные.РучнаяКорректировка;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ТекДанные.ИмяРаздела;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраница2020" Тогда
		Элементы.РучнаяКорректировка.Доступность = Ложь;
	Иначе
		Элементы.РучнаяКорректировка.Доступность = Истина;
	КонецЕсли; 	
	
	Если ТекДанные.Многострочныйраздел Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМногострочныйРаздел;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ТаблДок;
		ЭтаФорма.ТабличныйДокумент = Элемент.ТекущиеДанные.ТабличныйДокумент;
		Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	КонецЕсли; 
	
	Если МодифицированностьМногострочногоРаздела Тогда
	
		Если Вопрос("Многострочный раздел изменен. Перезаполнить титульный лист?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
		
			ЗаполнитьАвто("ОтчетТитульнаяСтраница2020");
		
		КонецЕсли; 
	
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Истина;
		Элементы.ТаблицаМногострочныйРазделРучнаяКорректировка.ТолькоПросмотр = Ложь;
		Элементы.ТаблицаМногострочныйРаздел.ТолькоПросмотр = Ложь;
		
	Иначе
		
		ЭтаФорма.РучнаяКорректировка = Истина;
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РучнаяКорректировкаПриИзмененииВопросЗавершение",
		ЭтотОбъект,)
		,
		НСтр("ru = 'Будет произведено автоматическое заполнение закладки. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзмененииВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Ложь;
	ЭтаФорма.РучнаяКорректировка = Ложь;
	Элементы.ТаблицаМногострочныйРазделРучнаяКорректировка.ТолькоПросмотр = Истина;
	Элементы.ТаблицаМногострочныйРаздел.ТолькоПросмотр = Истина;
	ЗаполнитьАвто(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Расчет(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМногострочныйРазделВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "МногострочныйРазделАктив" Тогда
		Значение = ЭтаФорма.МногострочныйРаздел.НайтиПоИдентификатору(ВыбраннаяСтрока).Актив;
	ИначеЕсли Поле.Имя = "МногострочныйРазделЮрФизЛицо" Тогда
		Значение = ЭтаФорма.МногострочныйРаздел.НайтиПоИдентификатору(ВыбраннаяСтрока).ЮрФизЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ОткрытьЗначение(Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМногострочныйРазделПриИзменении(Элемент)
	МодифицированностьМногострочногоРаздела = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МногострочныйРазделСекторПриИзменении(Элемент)
	ЗаполнитьКодСтроки();
КонецПроцедуры

&НаКлиенте
Процедура МногострочныйРазделРезидентПриИзменении(Элемент)
	ЗаполнитьКодСтроки();
КонецПроцедуры


#КонецОбласти 

#Область ЗаполнениеОтчета

&НаСервереБезКонтекста
Функция ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет)
	Возврат РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет);
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьАвто(ИмяРаздела = "")

	Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(,"Необходимо указать валюту отчета!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВидУчета) Тогда
		ПоказатьПредупреждение(,"Необходимо указать вид учета!");
		Возврат;
	КонецЕсли;
	
	Если Не (ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")) Тогда
		ЭтаФорма.НастройкиОтчета = ПолучитьНастройкиОтчета(
			ЭтаФорма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, 
			ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления,
			"РегламентированныйОтчетФинансовыеОперацииНПФ");		
	КонецЕсли; 
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета - 1);
	
	СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода    = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	КонсолидированнаяОтчетностьКлиент.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	// Очистка разделов
	Очистить(ИмяРаздела);
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	нСч = 0;
	ПредставлениеОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].Представление;
	// Заполнение разделов
	Если ИмяРаздела = "" Тогда
		
		Всего = ЭтаФорма.РазделыОтчета.Количество();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				
				Состояние("Заполняется раздел: " + ТекСтрока.Представление, нСч/Всего * 100, "Заполнение...");
				Выполнить("Подключаемый_ЗаполнитьРаздел_" + ТекСтрока.ИмяРаздела + "()");
				нСч = нСч + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяРаздела + "()");
		КонецЕсли;
		
	КонецЕсли;
	
	Если нСч Тогда
		Состояние("Заполняется раздел: " + ПредставлениеОсновногоРаздела, нСч/Всего * 100, "Заполнение...");
	КонецЕсли;
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		Очистить(ИмяОсновногоРаздела);
	КонецЕсли;
	
	Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
	
	Если нСч Тогда
		Состояние();
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекСтрока = ЭтаФорма.РазделыОтчета[0];
	ЭтаФорма.ТабличныйДокумент = ТекСтрока.ТабличныйДокумент;
	
	УстановитьГруппировкиТитульнойСтраницы(ЭтаФорма.ТабличныйДокумент);
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);

КонецПроцедуры

 &НаСервере
Процедура Очистить(ИмяРаздела = "")
	
	Если ИмяРаздела = "" Тогда
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если ТекСтрока.МногострочныйРаздел Тогда
				ЭтаФорма[ТекСтрока.ИмяРаздела].Очистить();
				РучнаяКорректировкаПриОчисткеРаздела(ТекСтрока.ИмяРаздела);
			Иначе
				ОчиститьТабличноеПоле(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе
		
		ТекСтрока = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела))[0];
		
		Если ТекСтрока.МногострочныйРаздел Тогда
			ЭтаФорма[ТекСтрока.ИмяРаздела].Очистить();
			РучнаяКорректировкаПриОчисткеРаздела(ТекСтрока.ИмяРаздела);
		Иначе
			ОчиститьТабличноеПоле(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ИмяРаздела = "ОтчетТитульнаяСтраница2020" Тогда
	
		ЗаполнитьЗаголовки(ИмяРаздела);
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела)
	
	Если ИмяРаздела = "ОтчетТитульнаяСтраница2020" Тогда
		Возврат;	
	КонецЕсли; 
	
	НайденныеСтроки = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела));
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
		
			ТекСтрока.РучнаяКорректировка = Ложь;
			
			Если ТекСтрока.МногострочныйРаздел Тогда
			
				Элементы["Таблица" + ТекСтрока.ИмяРаздела + "РучнаяКорректировка"].ТолькоПросмотр = Истина;
				Элементы["Таблица" + ТекСтрока.ИмяРаздела].ТолькоПросмотр = Истина;
				
			Иначе
				
				УстановитьЦветФонаЯчейки(ТекСтрока.ИмяРаздела);
			
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела Тогда
	
		ЭтаФорма.РучнаяКорректировка = Ложь;
	
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПоле(ВыбТабличныйДокумент, ИмяРаздела)
	
	Для Каждого ТекОбласть Из ВыбТабличныйДокумент.Области Цикл
			
		Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Не ТекОбласть.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка макета: раздел " + ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		ТекОбласть.Очистить();
		
	КонецЦикла;
	
	РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела);
	
КонецПроцедуры // ОчиститьТабличноеПоле()

&НаСервереБезКонтекста
Функция ВернутьЛицензиюНПФ(Период, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛицензийСрезПоследних.Лицензия.Номер КАК ЛицензияНомер
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лицензии КАК Лицензии
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(&Период, Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)) КАК СтатусыЛицензийСрезПоследних
	|			ПО Лицензии.Ссылка = СтатусыЛицензийСрезПоследних.Лицензия
	|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = Лицензии.ЮрФизЛицо
	|			И (Лицензии.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоПенсионномуСтрахованию))";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЛицензияНомер;
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьЗаголовки(ИмяРаздела = "")
	//#ЗаполнениеЗаголовков
	
	Если ИмяРаздела = "" Тогда
		мМассивРазделов = ЭтаФорма.РазделыОтчета.Выгрузить(, "ИмяРаздела").ВыгрузитьКолонку(0);
	Иначе
		мМассивРазделов = Новый Массив;
		мМассивРазделов.Добавить(ИмяРаздела);
	КонецЕсли;
	
	Для Каждого ТекИмяРаздела из мМассивРазделов Цикл
		Если ТекИмяРаздела = "Настройка"
			или ТекИмяРаздела = "Проверка"
			или ТекИмяРаздела = "ПроверкаПротоколОшибок"
			Тогда
			Продолжить;
		КонецЕсли;
		
		ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекИмяРаздела);
		
		// Настройки заполнения шапки: Текущий период
		Если НЕ ТекРаздел.Области.Найти("ТекущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
		КонецЕсли;
		
		// Настройки заполнения шапки: Предыдущий период
		Если НЕ ТекРаздел.Области.Найти("ПредыдущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ПредыдущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		КонецЕсли;
		
		// Настройки для заголовков периодов
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокНачалоПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокНачалоПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокКонецПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокКонецПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		// Настройки для титульного листа
		Если ТекИмяРаздела = "ОтчетТитульнаяСтраница2020" Тогда
			Если НЕ ТекРаздел.Области.Найти("ТекущийПериод1") = Неопределено Тогда
				ТекРаздел.Области.ТекущийПериод1.Значение = "за " + КонсолидированнаяОтчетность.ПредставлениеФинансовогоПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, Ложь)
			КонецЕсли;
			
			СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
			Если НЕ СведенияОбОрганизации = Неопределено Тогда
			
				Если НЕ ТекРаздел.Области.Найти("Организация") = Неопределено Тогда
					ТекРаздел.Области.Организация.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
						СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
						СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				
				Если НЕ ТекРаздел.Области.Найти("ПочтовыйАдресОрганизации") = Неопределено Тогда
					ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдрес;
				КонецЕсли;	
				
				Если НЕ ТекРаздел.Области.Найти("КодПоОКТМО") = Неопределено Тогда
					ТекРаздел.Области.КодПоОКТМО.Значение = СведенияОбОрганизации.КодПоОКТМО;
				КонецЕсли;	
				
				Если НЕ ТекРаздел.Области.Найти("КодПоОКПО") = Неопределено Тогда
					ТекРаздел.Области.КодПоОКПО.Значение = СведенияОбОрганизации.КодПоОКПО;
				КонецЕсли;	
				
				Если НЕ ТекРаздел.Области.Найти("ИНН") = Неопределено Тогда
					ТекРаздел.Области.ИНН.Значение = СведенияОбОрганизации.ИНН;
				КонецЕсли;	
				
				Если НЕ ТекРаздел.Области.Найти("Лицензия") = Неопределено Тогда
					ТекРаздел.Области.Лицензия.Значение = ВернутьЛицензиюНПФ(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления);
				КонецЕсли;	
						
			КонецЕсли; 
						
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#Область ОбщиеПроцедурыЗаполнения



#КонецОбласти 

#Область ПроцедурыЗаполненияРазделов

&НаСервере 
Функция ЗаполнитьРаздел_МногострочныйРазделРСБУСервер()

	ЭтаФорма.МногострочныйРаздел.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);	
	Запрос.УстановитьПараметр("грКонецПериода", Новый Граница(КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", 	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("Организация", 	СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	
	ТаблицаМногострочныйРаздел = ЭтаФорма.МногострочныйРаздел.Выгрузить().СкопироватьКолонки();
	
	ЗаполнитьРаздел_ДенежныеСредстваНаСчетахУправляющегоСервер(Запрос, ТаблицаМногострочныйРаздел, Истина); // Для РСБУ исправлю потом
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Актив,
		|	Банки.ЮрФизЛицо КАК ЮрФизЛицо,
		|	""Депозиты"" КАК Раздел,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчетаИСертификаты)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО БанковскиеСчета.Банк = Банки.Ссылка
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДепозитныеВклады).БанковскийСчет = БанковскиеСчета.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	""Долговые"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ГосударственныеОблигации), ЗНАЧЕНИЕ(ПланСчетов.Основной.КорпоративныеОблигации), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаКорпоративныхОблигацийТело), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаГосударственныхОблигацийТело)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	ЕСТЬNULL(Эмитенты.ЮрФизЛицо, РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо),
		|	""Долевые"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПаиИАкции), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаАкций)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент = Эмитенты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто3,
		|	БрокерскиеКомпании.ЮрФизЛицо,
		|	""БрокерскиеСчета"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокера),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БрокерскиеКомпании КАК БрокерскиеКомпании
		|		ПО ((ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БрокерскиеКомпании)) = БрокерскиеКомпании.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	Банки.ЮрФизЛицо,
		|	""НачисленныеПроцентыПоДепозитам"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоДепозитнымВкладам),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО БанковскиеСчета.Банк = Банки.Ссылка
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДепозитныеВклады).БанковскийСчет = БанковскиеСчета.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	""КупонныйДоход"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.КупонУплаченныйПриПокупке), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЦенныхБумагКорпоративныеОблигацииКупонНачисленный), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЦенныхБумагГосударственныеОблигацииКупонНачисленный)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	""ДебиторскаяЗадолженность"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.АвансыПоЧастичномуПогашениюОблигаций)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	Банки.ЮрФизЛицо,
		|	""МНО"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО БанковскиеСчета.Банк = Банки.Ссылка
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто1 КАК Документ.МНО).РасчетныйСчет = БанковскиеСчета.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО,
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	""ДебиторскаяЗадолженность"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокеров), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссии), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоПретензиям), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоПричитающимсяДивидендам)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	""ПенсионныеРезервыНакопления"",
		|	-ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ВнутрихозяйственныеРасчеты)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО,
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	""ДругиеОбязательстваВознаграждение"",
		|	-ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						Т.ЮрФизЛицо
		|					ИЗ
		|						Справочник.УправляющиеКомпании КАК Т
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						Т.ЮрФизЛицо
		|					ИЗ
		|						Справочник.ДепозитарныеКомпании КАК Т)) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО,
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	""ДругиеОбязательстваОплатаРасходов"",
		|	-ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НЕ Субконто1 В
		|						(ВЫБРАТЬ
		|							Т.ЮрФизЛицо
		|						ИЗ
		|							Справочник.УправляющиеКомпании КАК Т
		|			
		|						ОБЪЕДИНИТЬ ВСЕ
		|			
		|						ВЫБРАТЬ
		|							Т.ЮрФизЛицо
		|						ИЗ
		|							Справочник.ДепозитарныеКомпании КАК Т)) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО,
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	""ДругиеОбязательства"",
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|					И БухгалтерскийУчетОстатки.Валюта = БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ БухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокКт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
		|				И БухгалтерскийУчетОстатки.Валюта <> БухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокКт
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСКонтрагентами)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.Актив КАК Актив,
		|	_ИтоговаяТаблица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокРуб) КАК КонечныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокВал) КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	_ИтоговаяТаблица.Раздел КАК Раздел
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИтоговаяТаблица.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.Актив,
		|	_ИтоговаяТаблица.ЮрФизЛицо,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	_ИтоговаяТаблица.Раздел
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяТаблица";
	
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
			
	КонецЦикла;
				   
	ЗаполнитьСектора(ТаблицаМногострочныйРаздел);
	
	КодыСтрок = ПолучитьТаблицуКодыСтрок();
		
	Для каждого ТекСтрока Из ТаблицаМногострочныйРаздел Цикл
	
		ТекСтрока.КодСтроки = ПолучитьКодСтроки(ТекСтрока, КодыСтрок, СтруктураРеквизитовФормы.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления);
	
	КонецЦикла; 
	
	ТаблицаМногострочныйРаздел.Сортировать("КодСтроки, ЮрФизЛицо, Актив");
		
	ЭтаФорма.МногострочныйРаздел.Загрузить(ТаблицаМногострочныйРаздел);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРаздел_МногострочныйРазделСервер()
	
	ИмяРаздела = "МногострочныйРазделТаблица";
	
	ЭтаФорма.МногострочныйРаздел.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);	
	Запрос.УстановитьПараметр("грКонецПериода", Новый Граница(КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", 	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("Организация", 	СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	
	СчетаУчетаЦенныхБумаг = КонсолидированнаяОтчетность.ПолучитьСчетаУчетаЦенныхБумаг();
	
	Запрос.УстановитьПараметр("СчетаДолговых", СчетаУчетаЦенныхБумаг.СчетаДолговых);
	Запрос.УстановитьПараметр("СчетаДолевых", СчетаУчетаЦенныхБумаг.СчетаДолевых);
	Запрос.УстановитьПараметр("СчетаПереоценкиДолговых", СчетаУчетаЦенныхБумаг.СчетаПереоценкиДолговых);
	Запрос.УстановитьПараметр("СчетаПереоценкиДолевых", СчетаУчетаЦенныхБумаг.СчетаПереоценкиДолевых);
	Запрос.УстановитьПараметр("СчетаКорректировкиДолговых", СчетаУчетаЦенныхБумаг.СчетаКорректировкиДолговых);
	Запрос.УстановитьПараметр("СчетаКорректировкиДолевых", СчетаУчетаЦенныхБумаг.СчетаКорректировкиДолевых);
	
	Запрос.УстановитьПараметр("СчетаРезервовДолевых", СчетаУчетаЦенныхБумаг.СчетаРезервовДолевых);
	Запрос.УстановитьПараметр("СчетаРезервовДолговых", СчетаУчетаЦенныхБумаг.СчетаРезервовДолговых);
	
	ТаблицаМногострочныйРаздел = ЭтаФорма.МногострочныйРаздел.Выгрузить().СкопироватьКолонки();    
	
	Если СтруктураРеквизитовФормы.НестандартныйПериод И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда 
		ОтчетСНачалаГода = Ложь;
	Иначе
		ОтчетСНачалаГода = Истина;
	КонецЕсли; 
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	
	ПодготовитьВременныеТаблицыПереходаНаМСФО9(Запрос);
	
	ЗаполнитьРаздел_ДенежныеСредстваНаСчетахУправляющегоСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_ДепозитыСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_ДолговыеЦенныеБумагиСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_ДолевыеЦенныеБумагиСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_ДенежныеСредстваУБрокеровСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);

	ЗаполнитьРаздел_НачисленныеПроцентыПоДепозитамСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_КупонныйДоходСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_ДебиторскаяЗадолженностьСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_ПенсионныеРезервыНакопленияСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_ДругиеОбязательстваСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода);
	
	ЗаполнитьРаздел_НераспределеннаяПрибыльУбытокСервер(Запрос, ТаблицаМногострочныйРаздел);
	
	ЗаполнитьСектора(ТаблицаМногострочныйРаздел);
	
	КодыСтрок = ПолучитьТаблицуКодыСтрок();
		
	Для каждого ТекСтрока Из ТаблицаМногострочныйРаздел Цикл
	
		ТекСтрока.КодСтроки = ПолучитьКодСтроки(ТекСтрока, КодыСтрок, СтруктураРеквизитовФормы.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления);
	
	КонецЦикла; 
	
	ТаблицаМногострочныйРаздел.Сортировать("КодСтроки, ЮрФизЛицо, Актив");
		
	ЭтаФорма.МногострочныйРаздел.Загрузить(ТаблицаМногострочныйРаздел);
	
КонецПроцедуры

&НаСервере 
Процедура ПодготовитьВременныеТаблицыПереходаНаМСФО9(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияРезерв.СчетУчета КАК СчетУчета,
		|	ДвиженияРезерв.КорСчет КАК КорСчет,
		|	ДвиженияРезерв.Актив КАК Актив,
		|	ДвиженияРезерв.КорАктив КАК КорАктив,
		|	ДвиженияРезерв.Приход КАК Приход,
		|	ДвиженияРезерв.Расход КАК Расход,
		|	ДвиженияРезерв.Иное КАК Иное
		|ПОМЕСТИТЬ _РезервПереходНаМСФО9
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчет.СчетКт КАК СчетУчета,
		|		ЕдиныйБухгалтерскийУчет.СчетДт КАК КорСчет,
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчет.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15)
		|				ТОГДА ЕдиныйБухгалтерскийУчет.ЛицевойСчетКт.Субконто2
		|			КОГДА ЕдиныйБухгалтерскийУчет.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17)
		|				ТОГДА ЕдиныйБухгалтерскийУчет.ЛицевойСчетКт.Субконто2
		|			КОГДА ЕдиныйБухгалтерскийУчет.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчет.ЛицевойСчетКт.Субконто1
		|		КОНЕЦ КАК Актив,
		|		ЕдиныйБухгалтерскийУчет.ЛицевойСчетДт.Субконто1 КАК КорАктив,
		|		ЕдиныйБухгалтерскийУчет.Сумма КАК Приход,
		|		0 КАК Расход,
		|		ЕдиныйБухгалтерскийУчет.Сумма КАК Иное
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет КАК ЕдиныйБухгалтерскийУчет
		|	ГДЕ
		|		ЕдиныйБухгалтерскийУчет.Организация = &Организация
		|		И ЕдиныйБухгалтерскийУчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|		И ЕдиныйБухгалтерскийУчет.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ЕдиныйБухгалтерскийУчет.Активность
		|		И ЕдиныйБухгалтерскийУчет.Регистратор В
		|				(ВЫБРАТЬ
		|					НачислениеСписаниеРезервов.Ссылка КАК Ссылка
		|				ИЗ
		|					Документ.НачислениеСписаниеРезервов КАК НачислениеСписаниеРезервов
		|				ГДЕ
		|					НачислениеСписаниеРезервов.ПереходНаМСФО9
		|					И НачислениеСписаниеРезервов.Организация = &Организация
		|					И НачислениеСписаниеРезервов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И НАЧАЛОПЕРИОДА(НачислениеСписаниеРезервов.Дата, ДЕНЬ) = &НачалоПериода
		|					И НачислениеСписаниеРезервов.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ЕдиныйПланСчетов))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчет.СчетДт,
		|		ЕдиныйБухгалтерскийУчет.СчетКт,
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15)
		|				ТОГДА ЕдиныйБухгалтерскийУчет.ЛицевойСчетДт.Субконто2
		|			КОГДА ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17)
		|				ТОГДА ЕдиныйБухгалтерскийУчет.ЛицевойСчетДт.Субконто2
		|			КОГДА ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчет.ЛицевойСчетДт.Субконто1
		|		КОНЕЦ,
		|		ЕдиныйБухгалтерскийУчет.ЛицевойСчетКт.Субконто1,
		|		0,
		|		ЕдиныйБухгалтерскийУчет.Сумма,
		|		-ЕдиныйБухгалтерскийУчет.Сумма
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет КАК ЕдиныйБухгалтерскийУчет
		|	ГДЕ
		|		ЕдиныйБухгалтерскийУчет.Организация = &Организация
		|		И ЕдиныйБухгалтерскийУчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ЕдиныйБухгалтерскийУчет.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ЕдиныйБухгалтерскийУчет.Активность
		|		И ЕдиныйБухгалтерскийУчет.Регистратор В
		|				(ВЫБРАТЬ
		|					НачислениеСписаниеРезервов.Ссылка КАК Ссылка
		|				ИЗ
		|					Документ.НачислениеСписаниеРезервов КАК НачислениеСписаниеРезервов
		|				ГДЕ
		|					НачислениеСписаниеРезервов.ПереходНаМСФО9
		|					И НачислениеСписаниеРезервов.Организация = &Организация
		|					И ЕдиныйБухгалтерскийУчет.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|					И НачислениеСписаниеРезервов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И НАЧАЛОПЕРИОДА(НачислениеСписаниеРезервов.Дата, ДЕНЬ) = &НачалоПериода
		|					И НачислениеСписаниеРезервов.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ЕдиныйПланСчетов))) КАК ДвиженияРезерв
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияРекласс.СчетУчета КАК СчетУчета,
		|	ДвиженияРекласс.Актив КАК Актив,
		|	СУММА(ДвиженияРекласс.Приход) КАК Приход,
		|	СУММА(ДвиженияРекласс.Расход) КАК Расход,
		|	СУММА(ДвиженияРекласс.Иное) КАК Иное,
		|	ДвиженияРекласс.ДополнительнаяАналитика КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _РеклассификацияАктивовДолговые
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчет.СчетДт КАК СчетУчета,
		|		ЕдиныйБухгалтерскийУчет.ЛицевойСчетДт.Субконто1 КАК Актив,
		|		ЕдиныйБухгалтерскийУчет.Сумма КАК Приход,
		|		0 КАК Расход,
		|		ЕдиныйБухгалтерскийУчет.Сумма КАК Иное,
		|		ЕдиныйБухгалтерскийУчет.ДополнительнаяАналитикаДт КАК ДополнительнаяАналитика
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет КАК ЕдиныйБухгалтерскийУчет
		|	ГДЕ
		|		ЕдиныйБухгалтерскийУчет.Организация = &Организация
		|		И ЕдиныйБухгалтерскийУчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ЕдиныйБухгалтерскийУчет.СчетДт В ИЕРАРХИИ (&СчетаДолговых, &СчетаРезервовДолговых, &СчетаПереоценкиДолговых, &СчетаКорректировкиДолговых)
		|		И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчет.Регистратор) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|		И ЕдиныйБухгалтерскийУчет.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ЕдиныйБухгалтерскийУчет.Активность
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчет.СчетКт,
		|		ЕдиныйБухгалтерскийУчет.ЛицевойСчетКт.Субконто1,
		|		0,
		|		ЕдиныйБухгалтерскийУчет.Сумма,
		|		-ЕдиныйБухгалтерскийУчет.Сумма,
		|		ЕдиныйБухгалтерскийУчет.ДополнительнаяАналитикаКт
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет КАК ЕдиныйБухгалтерскийУчет
		|	ГДЕ
		|		ЕдиныйБухгалтерскийУчет.Организация = &Организация
		|		И ЕдиныйБухгалтерскийУчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ЕдиныйБухгалтерскийУчет.СчетКт В ИЕРАРХИИ (&СчетаДолговых, &СчетаРезервовДолговых, &СчетаПереоценкиДолговых, &СчетаКорректировкиДолговых)
		|		И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчет.Регистратор) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|		И ЕдиныйБухгалтерскийУчет.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ЕдиныйБухгалтерскийУчет.Активность) КАК ДвиженияРекласс
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияРекласс.СчетУчета,
		|	ДвиженияРекласс.Актив,
		|	ДвиженияРекласс.ДополнительнаяАналитика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03) КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|			ТОГДА ЕдиныйБухгалтерскийУчет.ЛицевойСчетДт.Субконто1
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчет.ЛицевойСчетКт.Субконто1
		|	КОНЕЦ КАК Актив,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|			ТОГДА ЕдиныйБухгалтерскийУчет.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчет.Сумма
		|	КОНЕЦ КАК Расход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|			ТОГДА ЕдиныйБухгалтерскийУчет.Сумма
		|		ИНАЧЕ -ЕдиныйБухгалтерскийУчет.Сумма
		|	КОНЕЦ КАК Иное
		|ПОМЕСТИТЬ _Реклассификация47903
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет КАК ЕдиныйБухгалтерскийУчет
		|ГДЕ
		|	ЕдиныйБухгалтерскийУчет.Организация = &Организация
		|	И ЕдиныйБухгалтерскийУчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (ЕдиныйБухгалтерскийУчет.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|			ИЛИ ЕдиныйБухгалтерскийУчет.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03))
		|	И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчет.Регистратор) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|	И ЕдиныйБухгалтерскийУчет.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЕдиныйБухгалтерскийУчет.Активность";
	
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСектора(ТаблицаДокумента)
	
	КонецПериода = КонсолидированнаяОтчетность.ПолучитьДатуПеречняФинансовыхОрганизаций(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ЭтаФорма.Комментарий = "При построении отчета использован перечень организаций финансового сектора по состоянию на " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДокумента.Актив КАК Актив,
		|	ТаблицаДокумента.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.Сектор КАК Сектор,
		|	ТаблицаДокумента.Резидент КАК Резидент,
		|	ТаблицаДокумента.КодСтроки КАК КодСтроки,
		|	ТаблицаДокумента.НачальныйОстатокРуб КАК НачальныйОстатокРуб,
		|	ТаблицаДокумента.НачальныйОстатокВал КАК НачальныйОстатокВал,
		|	ТаблицаДокумента.Приход КАК Приход,
		|	ТаблицаДокумента.Расход КАК Расход,
		|	ТаблицаДокумента.Переоценка КАК Переоценка,
		|	ТаблицаДокумента.Иное КАК Иное,
		|	ТаблицаДокумента.КонечныйОстатокРуб КАК КонечныйОстатокРуб,
		|	ТаблицаДокумента.КонечныйОстатокВал КАК КонечныйОстатокВал,
		|	ТаблицаДокумента.Раздел КАК Раздел
		|ПОМЕСТИТЬ _ТаблицаДокумента
		|ИЗ
		|	&ТаблицаДокумента КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПеречниОбъектов.Объект КАК Объект,
		|	ПеречниОбъектов.ВидПеречня КАК ВидПеречня
		|ПОМЕСТИТЬ _ПеречниОбъектов
		|ИЗ
		|	РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
		|ГДЕ
		|	ПеречниОбъектов.Включен
		|	И НЕ ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ИнвестиционныеФонды)
		|	И ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
		|	И ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора)
		|	И ПеречниОбъектов.Объект В
		|			(ВЫБРАТЬ
		|				_ТаблицаДокумента.ЮрФизЛицо
		|			ИЗ
		|				_ТаблицаДокумента КАК _ТаблицаДокумента)
		|	И ПеречниОбъектов.Период = &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПеречниОбъектов.Объект КАК Объект,
		|	ПеречниОбъектов.ВидПеречня КАК ВидПеречня
		|ПОМЕСТИТЬ _ИнвестиционныеФонды
		|ИЗ
		|	РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
		|ГДЕ
		|	ПеречниОбъектов.Включен
		|	И ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ИнвестиционныеФонды)
		|	И ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
		|	И ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора)
		|	И ПеречниОбъектов.Объект В
		|			(ВЫБРАТЬ
		|				_ТаблицаДокумента.ЮрФизЛицо
		|			ИЗ
		|				_ТаблицаДокумента КАК _ТаблицаДокумента)
		|	И ПеречниОбъектов.Период = &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПеречниОбъектов.Объект КАК Объект,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПеречниОбъектов.ВидПеречня) КАК ВидПеречня
		|ПОМЕСТИТЬ _ОрганизацииВходящиеВНесколькоСекторов
		|ИЗ
		|	_ПеречниОбъектов КАК _ПеречниОбъектов
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПеречниОбъектов.Объект
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПеречниОбъектов.ВидПеречня) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИнвестиционныеФонды.Объект КАК Объект,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ИнвестиционныеФонды.ВидПеречня) КАК ВидПеречня
		|ПОМЕСТИТЬ _ОрганизацииВходящиеВНесколькоФондов
		|ИЗ
		|	_ИнвестиционныеФонды КАК _ИнвестиционныеФонды
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИнвестиционныеФонды.Объект
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ИнвестиционныеФонды.ВидПеречня) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Эмитенты.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ОрганыГосударственногоУправления
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО Облигации.Эмитент = Эмитенты.Ссылка
		|ГДЕ
		|	Облигации.Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ЮрФизЛицо_Автодор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ЮрФизЛицо_РОСНАНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаДокумента.Актив КАК Актив,
		|	_ТаблицаДокумента.ЮрФизЛицо КАК ЮрФизЛицо,
		|	_ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	_ТаблицаДокумента.Резидент КАК Резидент,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_ТаблицаДокумента.Актив КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫБОР
		|					КОГДА _ТаблицаДокумента.ЮрФизЛицо В
		|							(ВЫБРАТЬ
		|								_ОрганизацииВходящиеВНесколькоФондов.Объект
		|							ИЗ
		|								_ОрганизацииВходящиеВНесколькоФондов КАК _ОрганизацииВходящиеВНесколькоФондов)
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ ЕСТЬNULL(_ИнвестиционныеФонды.ВидПеречня, ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ПустаяСсылка))
		|				КОНЕЦ
		|		КОГДА _ТаблицаДокумента.ЮрФизЛицо В
		|				(ВЫБРАТЬ
		|					_ОрганизацииВходящиеВНесколькоСекторов.Объект
		|				ИЗ
		|					_ОрганизацииВходящиеВНесколькоСекторов КАК _ОрганизацииВходящиеВНесколькоСекторов)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(_ПеречниОбъектов.ВидПеречня, ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ПустаяСсылка))
		|	КОНЕЦ КАК Сектор,
		|	_ТаблицаДокумента.КодСтроки КАК КодСтроки,
		|	_ТаблицаДокумента.НачальныйОстатокРуб КАК НачальныйОстатокРуб,
		|	_ТаблицаДокумента.НачальныйОстатокВал КАК НачальныйОстатокВал,
		|	_ТаблицаДокумента.Приход КАК Приход,
		|	_ТаблицаДокумента.Расход КАК Расход,
		|	_ТаблицаДокумента.Переоценка КАК Переоценка,
		|	_ТаблицаДокумента.Иное КАК Иное,
		|	_ТаблицаДокумента.КонечныйОстатокРуб КАК КонечныйОстатокРуб,
		|	_ТаблицаДокумента.КонечныйОстатокВал КАК КонечныйОстатокВал,
		|	_ТаблицаДокумента.Раздел КАК Раздел,
		|	_ТаблицаДокумента.ЮрФизЛицо В
		|		(ВЫБРАТЬ
		|			_ОрганыГосударственногоУправления.ЮрФизЛицо
		|		ИЗ
		|			_ОрганыГосударственногоУправления КАК _ОрганыГосударственногоУправления) КАК ГосОрган
		|ИЗ
		|	_ТаблицаДокумента КАК _ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПеречниОбъектов КАК _ПеречниОбъектов
		|		ПО _ТаблицаДокумента.ЮрФизЛицо = _ПеречниОбъектов.Объект
		|			И (НЕ _ПеречниОбъектов.Объект В
		|					(ВЫБРАТЬ
		|						_ОрганизацииВходящиеВНесколькоСекторов.Объект
		|					ИЗ
		|						_ОрганизацииВходящиеВНесколькоСекторов КАК _ОрганизацииВходящиеВНесколькоСекторов))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИнвестиционныеФонды КАК _ИнвестиционныеФонды
		|		ПО _ТаблицаДокумента.ЮрФизЛицо = _ИнвестиционныеФонды.Объект
		|			И (НЕ _ИнвестиционныеФонды.Объект В
		|					(ВЫБРАТЬ
		|						_ОрганизацииВходящиеВНесколькоФондов.Объект
		|					ИЗ
		|						_ОрганизацииВходящиеВНесколькоФондов КАК _ОрганизацииВходящиеВНесколькоФондов))";
		
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаДокумента);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода); 
	
	// #384614 - хардкод по задаче: согласно приказу росстата считаем в регламентированной отчетности росавтодор и роснано госорганизациями и их бумаги госбумагами
	Запрос.УстановитьПараметр("ЮрФизЛицо_Автодор", ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Автодор")); 
	Запрос.УстановитьПараметр("ЮрФизЛицо_РОСНАНО", ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_РОСНАНО")); 
	
	
	ТаблицаДокумента = Запрос.Выполнить().Выгрузить();
				
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьРаздел_ДенежныеСредстваНаСчетахУправляющегоСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РезервПереходНаМСФО9.СчетУчета КАК СчетУчета,
		|	_РезервПереходНаМСФО9.Актив КАК Актив,
		|	СУММА(_РезервПереходНаМСФО9.Приход) КАК Приход,
		|	СУММА(_РезервПереходНаМСФО9.Расход) КАК Расход,
		|	СУММА(_РезервПереходНаМСФО9.Иное) КАК Иное
		|ПОМЕСТИТЬ _РезервПереход
		|ИЗ
		|	_РезервПереходНаМСФО9 КАК _РезервПереходНаМСФО9
		|ГДЕ
		|	_РезервПереходНаМСФО9.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05)
		|
		|СГРУППИРОВАТЬ ПО
		|	_РезервПереходНаМСФО9.СчетУчета,
		|	_РезервПереходНаМСФО9.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &УчитыватьМНОкакПроценты
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета08))
		|			ТОГДА 34
		|		ИНАЧЕ 5
		|	КОНЕЦ КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Актив,
		|	Банки.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
		|	КОНЕЦ КАК Расход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ + ЕСТЬNULL(_РезервПереход.Иное, 0) КАК Переоценка,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ - ЕСТЬNULL(_РезервПереход.Иное, 0) КАК Иное,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	ВЫБОР
		|		КОГДА &УчитыватьМНОкакПроценты
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета08))
		|			ТОГДА ""НачисленныеПроцентыПоДепозитам""
		|		ИНАЧЕ ""ДенежныеСредства""
		|	КОНЕЦ КАК Раздел
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&КонецПериода,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО Банки.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.БанковскиеСчета).Банк = Банки.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РезервПереход КАК _РезервПереход
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = _РезервПереход.Актив
		|			И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = _РезервПереход.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РезервПереход";
		
	Если СтруктураРеквизитовФормы.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		Запрос.УстановитьПараметр("Счет", ПланыСчетов.Единый.РасчетныеСчета);	
	Иначе
		Запрос.УстановитьПараметр("Счет", ПланыСчетов.Основной.РасчетныеСчета);	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕдиныйБухгалтерскийУчет", "БухгалтерскийУчет");
	КонецЕсли; 	
	
	Запрос.УстановитьПараметр("УчитыватьМНОкакПроценты", ?(ЭтаФорма.НастройкиОтчета.УчитыватьМНОкакПроцентыПоДепозитам = ИСТИНА, ИСТИНА, ЛОЖЬ));  
    Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДепозитыСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РезервПереходНаМСФО9.СчетУчета КАК СчетУчета,
		|	_РезервПереходНаМСФО9.Актив КАК Актив,
		|	СУММА(_РезервПереходНаМСФО9.Приход) КАК Приход,
		|	СУММА(_РезервПереходНаМСФО9.Расход) КАК Расход,
		|	СУММА(_РезервПереходНаМСФО9.Иное) КАК Иное
		|ПОМЕСТИТЬ _РезервПереход
		|ИЗ
		|	_РезервПереходНаМСФО9 КАК _РезервПереходНаМСФО9
		|ГДЕ
		|	_РезервПереходНаМСФО9.СчетУчета = &СчетРезервы
		|
		|СГРУППИРОВАТЬ ПО
		|	_РезервПереходНаМСФО9.СчетУчета,
		|	_РезервПереходНаМСФО9.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	7 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Актив,
		|	Банки.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК Приход,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК Расход,
		|	0 КАК Переоценка,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Иное,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	""Депозиты"" КАК Раздел
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			&МассивСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&КонецПериода,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО Банки.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.БанковскиеСчета).Банк = Банки.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	Банки.ЮрФизЛицо,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт + ЕСТЬNULL(_РезервПереход.Иное, 0),
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ - ЕСТЬNULL(_РезервПереход.Иное, 0),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	""Депозиты""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет = &СчетРезервы,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&КонецПериода,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО Банки.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк = Банки.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РезервПереход КАК _РезервПереход
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 = _РезервПереход.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РезервПереход";
	МассивСубконто = Новый Массив;	
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Единый.Депозиты01);	
	Запрос.УстановитьПараметр("СчетРезервы", ПланыСчетов.Единый.Депозиты15);	
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);	
    Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	Выборка = Запрос.Выполнить().Выбрать();
	// у счета 20615 состав субконто отличается от прочих счетов 206*. поэтому резервы собираются отдельно 
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДолговыеЦенныеБумагиСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РезервПереходНаМСФО9.СчетУчета КАК СчетУчета,
		|	_РезервПереходНаМСФО9.Актив КАК Актив,
		|	СУММА(_РезервПереходНаМСФО9.Приход) КАК Приход,
		|	СУММА(_РезервПереходНаМСФО9.Расход) КАК Расход,
		|	СУММА(_РезервПереходНаМСФО9.Иное) КАК Иное
		|ПОМЕСТИТЬ _РезервПереход
		|ИЗ
		|	_РезервПереходНаМСФО9 КАК _РезервПереходНаМСФО9
		|ГДЕ
		|	_РезервПереходНаМСФО9.СчетУчета В(&СчетаРезервовДолговых)
		|
		|СГРУППИРОВАТЬ ПО
		|	_РезервПереходНаМСФО9.СчетУчета,
		|	_РезервПереходНаМСФО9.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Актив,
		|	Эмитенты.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстатки.Валюта = ЕдиныйБухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстатки.Валюта <> ЕдиныйБухгалтерскийУчетОстатки.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	0 КАК Приход,
		|	0 КАК Расход,
		|	0 КАК Переоценка,
		|	0 КАК Иное,
		|	0 КАК КонечныйОстатокРуб,
		|	0 КАК КонечныйОстатокВал,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДначисленныйКакДолговые
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДпогашенныйНеКупонныйДоход
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДУплаченныйКакКупонныйДоход
		|						ТОГДА ""КупонныйДоход""
		|					ИНАЧЕ ""Долговые""
		|				КОНЕЦ
		|		ИНАЧЕ ""Долговые""
		|	КОНЕЦ КАК Раздел,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчета
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&НачалоПериода,
		|			Счет В (&СчетаДолговых, &СчетаРезервовДолговых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстатки.Валюта = ЕдиныйБухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстатки.Валюта <> ЕдиныйБухгалтерскийУчетОстатки.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДначисленныйКакДолговые
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДпогашенныйНеКупонныйДоход
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДУплаченныйКакКупонныйДоход
		|						ТОГДА ""КупонныйДоход""
		|					ИНАЧЕ ""Долговые""
		|				КОНЕЦ
		|		ИНАЧЕ ""Долговые""
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В (&СчетаДолговых, &СчетаРезервовДолговых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет В (&СчетаРезервовДолговых)
		|				И НЕ ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) В (ТИП(Документ.ВводЦенныхБумаг), ТИП(Документ.ВыводЦенныхБумаг))
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет В (&СчетаРезервовДолговых)
		|				И НЕ ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) В (ТИП(Документ.ВводЦенныхБумаг), ТИП(Документ.ВыводЦенныхБумаг))
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет В (&СчетаРезервовДолговых)
		|				И НЕ ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) В (ТИП(Документ.ВводЦенныхБумаг), ТИП(Документ.ВыводЦенныхБумаг))
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДначисленныйКакДолговые
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДпогашенныйНеКупонныйДоход
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДУплаченныйКакКупонныйДоход
		|						ТОГДА ""КупонныйДоход""
		|					ИНАЧЕ ""Долговые""
		|				КОНЕЦ
		|		ИНАЧЕ ""Долговые""
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			Регистратор,
		|			Счет В (&СчетаДолговых, &СчетаРезервовДолговых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			,
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	0,
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДначисленныйКакДолговые
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДпогашенныйНеКупонныйДоход
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДУплаченныйКакКупонныйДоход
		|						ТОГДА ""КупонныйДоход""
		|					ИНАЧЕ ""Долговые""
		|				КОНЕЦ
		|		ИНАЧЕ ""Долговые""
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В (&СчетаПереоценкиДолговых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	0,
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДначисленныйКакДолговые
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДпогашенныйНеКупонныйДоход
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДУплаченныйКакКупонныйДоход
		|						ТОГДА ""КупонныйДоход""
		|					ИНАЧЕ ""Долговые""
		|				КОНЕЦ
		|		ИНАЧЕ ""Долговые""
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В (&СчетаКорректировкиДолговых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	Эмитенты.ЮрФизЛицо,
		|	0,
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДначисленныйКакДолговые
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДпогашенныйНеКупонныйДоход
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДУплаченныйКакКупонныйДоход
		|						ТОГДА ""КупонныйДоход""
		|					ИНАЧЕ ""Долговые""
		|				КОНЕЦ
		|		ИНАЧЕ ""Долговые""
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В (&СчетаДолговых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.Дисконт), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.Премия)),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	_РеклассификацияАктивов.Актив,
		|	Эмитенты.ЮрФизЛицо,
		|	0,
		|	0,
		|	-_РеклассификацияАктивов.Приход,
		|	-_РеклассификацияАктивов.Расход,
		|	0,
		|	_РеклассификацияАктивов.Иное,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА _РеклассификацияАктивов.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДначисленныйКакДолговые
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА _РеклассификацияАктивов.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДпогашенныйНеКупонныйДоход
		|						ТОГДА ""Долговые""
		|					ИНАЧЕ ""КупонныйДоход""
		|				КОНЕЦ
		|		КОГДА _РеклассификацияАктивов.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ВЫБОР
		|					КОГДА &НКДУплаченныйКакКупонныйДоход
		|						ТОГДА ""КупонныйДоход""
		|					ИНАЧЕ ""Долговые""
		|				КОНЕЦ
		|		ИНАЧЕ ""Долговые""
		|	КОНЕЦ,
		|	_РеклассификацияАктивов.СчетУчета
		|ИЗ
		|	_РеклассификацияАктивовДолговые КАК _РеклассификацияАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(_РеклассификацияАктивов.Актив КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(_РеклассификацияАктивов.Актив КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	_РезервПереход.Актив,
		|	Эмитенты.ЮрФизЛицо,
		|	0,
		|	0,
		|	0,
		|	0,
		|	_РезервПереход.Иное,
		|	-_РезервПереход.Иное,
		|	0,
		|	0,
		|	""Долговые"",
		|	_РезервПереход.СчетУчета
		|ИЗ
		|	_РезервПереход КАК _РезервПереход
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(_РезервПереход.Актив КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(_РезервПереход.Актив КАК Справочник.Облигации).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.КодСтроки КАК КодСтроки,
		|	_ИтоговаяТаблица.Актив КАК Актив,
		|	_ИтоговаяТаблица.СчетУчета КАК СчетУчета,
		|	_ИтоговаяТаблица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокРуб) КАК НачальныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокВал) КАК НачальныйОстатокВал,
		|	СУММА(_ИтоговаяТаблица.Приход) КАК Приход,
		|	СУММА(_ИтоговаяТаблица.Расход) КАК Расход,
		|	СУММА(_ИтоговаяТаблица.Переоценка) КАК Переоценка,
		|	СУММА(_ИтоговаяТаблица.Иное) КАК Иное,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокРуб) КАК КонечныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокВал) КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	_ИтоговаяТаблица.Раздел КАК Раздел
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИтоговаяТаблица.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.ЮрФизЛицо,
		|	_ИтоговаяТаблица.Актив,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	_ИтоговаяТаблица.КодСтроки,
		|	_ИтоговаяТаблица.Раздел,
		|	_ИтоговаяТаблица.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РезервПереход
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяТаблица";
		
	Запрос.УстановитьПараметр("НКДначисленныйКакДолговые", ?(ЭтаФорма.НастройкиОтчета.НКДначисленныйКакДолговые = ИСТИНА, ИСТИНА, ЛОЖЬ));
	Запрос.УстановитьПараметр("НКДпогашенныйНеКупонныйДоход", ?(ЭтаФорма.НастройкиОтчета.НКДпогашенныйНеКупонныйДоход = ИСТИНА, ИСТИНА, ЛОЖЬ));
	Запрос.УстановитьПараметр("НКДУплаченныйКакКупонныйДоход", ?(ЭтаФорма.НастройкиОтчета.НКДУплаченныйКакКупонныйДоход = ИСТИНА, ИСТИНА, ЛОЖЬ));
	Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();    
		
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДолевыеЦенныеБумагиСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Актив,
		|	ЕСТЬNULL(Эмитенты.ЮрФизЛицо, РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо) КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет В (&СчетаРезервовДолевых)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет В (&СчетаРезервовДолевых)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
		|	КОНЕЦ КАК Расход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет В (&СчетаРезервовДолевых)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Переоценка,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Иное,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В (&СчетаДолевых, &СчетаРезервовДолевых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.Акции).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕСТЬNULL(Эмитенты.ЮрФизЛицо, РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо),
		|	0,
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	0,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В (&СчетаПереоценкиДолевых),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Акции).Эмитент = Эмитенты.Ссылка
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.КодСтроки КАК КодСтроки,
		|	_ИтоговаяТаблица.Актив КАК Актив,
		|	_ИтоговаяТаблица.СчетУчета КАК СчетУчета,
		|	_ИтоговаяТаблица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокРуб) КАК НачальныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокВал) КАК НачальныйОстатокВал,
		|	СУММА(_ИтоговаяТаблица.Приход) КАК Приход,
		|	СУММА(_ИтоговаяТаблица.Расход) КАК Расход,
		|	СУММА(_ИтоговаяТаблица.Переоценка) КАК Переоценка,
		|	СУММА(_ИтоговаяТаблица.Иное) КАК Иное,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокРуб) КАК КонечныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокВал) КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	""Долевые"" КАК Раздел
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИтоговаяТаблица.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	_ИтоговаяТаблица.ЮрФизЛицо,
		|	_ИтоговаяТаблица.Актив,
		|	_ИтоговаяТаблица.КодСтроки,
		|	_ИтоговаяТаблица.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяТаблица";
	
	Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДенежныеСредстваУБрокеровСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РезервПереходНаМСФО9.СчетУчета КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_РезервПереходНаМСФО9.Актив) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|			ТОГДА ВЫРАЗИТЬ(_РезервПереходНаМСФО9.Актив КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо,
		|	СУММА(_РезервПереходНаМСФО9.Приход) КАК Приход,
		|	СУММА(_РезервПереходНаМСФО9.Расход) КАК Расход,
		|	СУММА(_РезервПереходНаМСФО9.Иное) КАК Иное
		|ПОМЕСТИТЬ _РезервПереход
		|ИЗ
		|	_РезервПереходНаМСФО9 КАК _РезервПереходНаМСФО9
		|ГДЕ
		|	_РезервПереходНаМСФО9.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07), ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10))
		|
		|СГРУППИРОВАТЬ ПО
		|	_РезервПереходНаМСФО9.СчетУчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_РезервПереходНаМСФО9.Актив) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|			ТОГДА ВЫРАЗИТЬ(_РезервПереходНаМСФО9.Актив КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Актив,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета,
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
		|	КОНЕЦ КАК Расход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ + ЕСТЬNULL(_РезервПереход.Иное, 0) КАК Переоценка,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ - ЕСТЬNULL(_РезервПереход.Иное, 0) КАК Иное,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	ВЫБОР
		|		КОГДА &БрокерскиеСчетаВДС
		|			ТОГДА ""ДенежныеСредства""
		|		ИНАЧЕ ""БрокерскиеСчета""
		|	КОНЕЦ КАК Раздел
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо = ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|				КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 ССЫЛКА Справочник.Договоры
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.Договоры).Контрагент
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РезервПереход КАК _РезервПереход
		|		ПО (РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо = _РезервПереход.ЮрФизЛицо)
		|			И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = _РезервПереход.СчетУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	&КонтрагентНКЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	&КонтрагентНКЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ + ЕСТЬNULL(_РезервПереход.Иное, 0),
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ - ЕСТЬNULL(_РезервПереход.Иное, 0),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ИСТИНА,
		|	ВЫБОР
		|		КОГДА &БрокерскиеСчетаВДС
		|			ТОГДА ""ДенежныеСредства""
		|		ИНАЧЕ ""БрокерскиеСчета""
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга24), ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РезервПереход КАК _РезервПереход
		|		ПО (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10))
		|			И (_РезервПереход.ЮрФизЛицо = НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РезервПереход";
	
	СчетаБрокера = Новый Массив;
	СчетаБрокера.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами02);
	СчетаБрокера.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами07);
	
	Запрос.УстановитьПараметр("Счет", СчетаБрокера);	
	Запрос.УстановитьПараметр("БрокерскиеСчетаВДС", ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС = ИСТИНА, ИСТИНА, ЛОЖЬ));   //м.б. неопределено   
	Запрос.УстановитьПараметр("КонтрагентНКЦ", ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ")); 
	Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_НачисленныеПроцентыПоДепозитамСервер(Запрос, ТаблицаМногострочныйРаздел,  ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Актив,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК Приход,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК Расход,
		|	0 КАК Переоценка,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Иное,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.РезидентРФ, РеквизитыБанковСрезПоследних.РезидентРФ) КАК Резидент,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА ВЫБОР
		|					КОГДА &УчитыватьМНОкакПроценты
		|						ТОГДА ""НачисленныеПроцентыПоДепозитам""
		|					ИНАЧЕ ""МНО""
		|				КОНЕЦ
		|		ИНАЧЕ ""НачисленныеПроцентыПоДепозитам""
		|	КОНЕЦ КАК Раздел
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|					ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&КонецПериода,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыБанковСрезПоследних
		|			ПО Банки.ЮрФизЛицо = РеквизитыБанковСрезПоследних.ЮрФизЛицо
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.БанковскиеСчета).Банк = Банки.Ссылка
		|			КОНЕЦ)";
		
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Единый.Депозиты03);
	МассивСчетов.Добавить(ПланыСчетов.Единый.Депозиты09);
	МассивСчетов.Добавить(ПланыСчетов.Единый.Депозиты11);
	Запрос.УстановитьПараметр("Счет", МассивСчетов);
	Запрос.УстановитьПараметр("УчитыватьМНОкакПроценты", ?(ЭтаФорма.НастройкиОтчета.УчитыватьМНОкакПроцентыПоДепозитам = ИСТИНА, ИСТИНА, ЛОЖЬ));  
    Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_КупонныйДоходСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Актив,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|					И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК Приход,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК Расход,
		|	0 КАК Переоценка,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Иное,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	ВЫБОР
		|		КОГДА &НКДпогашенныйНеКупонныйДоход
		|			ТОГДА ""ДебиторскаяЗадолженность""
		|		ИНАЧЕ ""КупонныйДоход""
		|	КОНЕЦ КАК Раздел
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела))) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо";
		
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Единый.Расчеты23);	
	Запрос.УстановитьПараметр("НКДпогашенныйНеКупонныйДоход", ?(ЭтаФорма.НастройкиОтчета.НКДпогашенныйНеКупонныйДоход = ИСТИНА, ИСТИНА, ЛОЖЬ));
	Выборка = Запрос.Выполнить().Выбрать();
	Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДебиторскаяЗадолженностьСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РезервПереходНаМСФО9.СчетУчета КАК СчетУчета,
		|	_РезервПереходНаМСФО9.Актив КАК Актив,
		|	СУММА(_РезервПереходНаМСФО9.Приход) КАК Приход,
		|	СУММА(_РезервПереходНаМСФО9.Расход) КАК Расход,
		|	СУММА(_РезервПереходНаМСФО9.Иное) КАК Иное
		|ПОМЕСТИТЬ _РезервПереход
		|ИЗ
		|	_РезервПереходНаМСФО9 КАК _РезервПереходНаМСФО9
		|ГДЕ
		|	_РезервПереходНаМСФО9.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17)
		|
		|СГРУППИРОВАТЬ ПО
		|	_РезервПереходНаМСФО9.СчетУчета,
		|	_РезервПереходНаМСФО9.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Актив,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК Приход,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК Расход,
		|	0 КАК Переоценка,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Иное,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК Резидент,
		|	""ДебиторскаяЗадолженность"" КАК Раздел
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			&МассивСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	0,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	""ДебиторскаяЗадолженность""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&СчетПрочие),
		|			&МассивСубконтоПрочие,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ВЫБОР
		|		КОГДА &КомиссияРЕПОПоКонтрагенту
		|			ТОГДА &КонтрагентНКЦ
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = &СчетПрочиеСредства17
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = &СчетПрочиеСредства17
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = &СчетПрочиеСредства17
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ + ЕСТЬNULL(_РезервПереход.Иное, 0),
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ - ЕСТЬNULL(_РезервПереход.Иное, 0),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	1,
		|	""ДебиторскаяЗадолженностьРЕПО""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&СчетПрочиеСредства)
		|				И НЕ Счет = &СчетПрочиеСредства18,
		|			&МассивСубконтоПрочие,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РезервПереход КАК _РезервПереход
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 = _РезервПереход.Актив
		|			И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет = _РезервПереход.СчетУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	Организации.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	0,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	1,
		|	""ДебиторскаяЗадолженность""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02), ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ05)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО СчетаДоверительногоУправления.Организация = Организации.Ссылка
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = СчетаДоверительногоУправления.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	0,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.МНО)
		|			ТОГДА ВЫБОР
		|					КОГДА &УчитыватьМНОкакПроценты
		|						ТОГДА ""НачисленныеПроцентыПоДепозитам""
		|					ИНАЧЕ ""МНО""
		|				КОНЕЦ
		|		ИНАЧЕ ""ДебиторскаяЗадолженность""
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&СчетРасчеты23),
		|			&МассивСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВозвратСтраховойПремии)
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	0,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	""ДебиторскаяЗадолженность""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&СчетРасчеты23),
		|			&МассивСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВозвратСтраховойПремии)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1.Банк.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	0,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	""ДебиторскаяЗадолженность""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты07)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РезервПереход";
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами12);
	МассивСчетов.Добавить(ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами23);
	МассивСчетов.Добавить(ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами47);
	МассивСчетов.Добавить(ПланыСчетов.Единый.Расчеты08);
	
	МассивСубконтоПрочие = Новый Массив;
	МассивСубконтоПрочие.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	МассивСубконтоПрочие.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	Запрос.УстановитьПараметр("МассивСубконто", ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	Запрос.УстановитьПараметр("МассивСубконтоПрочие", МассивСубконтоПрочие);
	Запрос.УстановитьПараметр("Счет", МассивСчетов);	
	Запрос.УстановитьПараметр("СчетПрочие", ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05);
	Запрос.УстановитьПараметр("СчетПрочиеСредства", ПланыСчетов.Единый.ПрочиеСредства);
	Запрос.УстановитьПараметр("СчетПрочиеСредства18", ПланыСчетов.Единый.ПрочиеСредства18);
	Запрос.УстановитьПараметр("СчетПрочиеСредства17", ПланыСчетов.Единый.ПрочиеСредства17);
	Запрос.УстановитьПараметр("СчетРасчеты23", ПланыСчетов.Единый.Расчеты23);	
	Запрос.УстановитьПараметр("УчитыватьМНОкакПроценты", ?(ЭтаФорма.НастройкиОтчета.УчитыватьМНОкакПроцентыПоДепозитам = ИСТИНА, ИСТИНА, ЛОЖЬ));
	
	Запрос.УстановитьПараметр("КонтрагентНКЦ", ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	Запрос.УстановитьПараметр("КомиссияРЕПОПоКонтрагенту", ?(ЭтаФорма.НастройкиОтчета.УчитыватьКомиссиюРЕПОПоКонтрагенту = ИСТИНА, ИСТИНА, ЛОЖЬ));
	Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ПенсионныеРезервыНакопленияСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	//#397180 
	// _Обороты47903 для вводов/выводов ЦБ по пассивным счетам приход - это расход, 700-е счета считаем как активные
	// _Остатки47903. Могут быть разные валюты, поэтому сворачиваем. Для валют нужен только остаток в рублевом эквиваленте.
	// _ИтоговаяТаблица. Остатки и обороты 47903, отнять обороты по 700-м счетам. 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияПереходМСФО9.СчетУчета КАК СчетУчета,
		|	ДвиженияПереходМСФО9.Актив КАК Актив,
		|	СУММА(ДвиженияПереходМСФО9.Приход) КАК Приход,
		|	СУММА(ДвиженияПереходМСФО9.Расход) КАК Расход,
		|	СУММА(ДвиженияПереходМСФО9.Иное) КАК Иное
		|ПОМЕСТИТЬ _ПереходНаМСФО9
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РезервПереходНаМСФО9.КорСчет КАК СчетУчета,
		|		_РезервПереходНаМСФО9.КорАктив КАК Актив,
		|		_РезервПереходНаМСФО9.Приход КАК Приход,
		|		_РезервПереходНаМСФО9.Расход КАК Расход,
		|		_РезервПереходНаМСФО9.Иное КАК Иное
		|	ИЗ
		|		_РезервПереходНаМСФО9 КАК _РезервПереходНаМСФО9
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_Реклассификация47903.СчетУчета,
		|		_Реклассификация47903.Актив,
		|		_Реклассификация47903.Приход,
		|		_Реклассификация47903.Расход,
		|		_Реклассификация47903.Иное
		|	ИЗ
		|		_Реклассификация47903 КАК _Реклассификация47903) КАК ДвиженияПереходМСФО9
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияПереходМСФО9.СчетУчета,
		|	ДвиженияПереходМСФО9.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Актив,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Регистратор ССЫЛКА Документ.ВводЦенныхБумаг
		|				И НЕ ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (&МассивСчетов)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|						ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
		|				И НЕ ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (&МассивСчетов)
		|				И ЕдиныйБухгалтерскийУчетОбороты.КорСчет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
		|				И НЕ ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (&МассивСчетов)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|						ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
		|				КОНЕЦ
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Регистратор ССЫЛКА Документ.ВводЦенныхБумаг
		|				И НЕ ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (&МассивСчетов)
		|				И ЕдиныйБухгалтерскийУчетОбороты.КорСчет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
		|	КОНЕЦ КАК Расход,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет.Вид КАК КорСчетВид,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _Обороты47903
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			Регистратор,
		|			Счет = &Счет,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НЕ ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)),
		|			,
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Актив,
		|	СУММА(-ВЫБОР
		|			КОГДА &ОтчетСНачалаГода
		|					И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|							И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|						ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачальныйОстатокРуб,
		|	СУММА(-ВЫБОР
		|			КОГДА &ОтчетСНачалаГода
		|					И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачальныйОстатокВал,
		|	СУММА(-ВЫБОР
		|			КОГДА НЕ &ОтчетСНачалаГода
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Иное,
		|	СУММА(-ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КонечныйОстатокРуб,
		|	СУММА(-ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КонечныйОстатокВал,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета
		|ПОМЕСТИТЬ _Остатки47903
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НЕ ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего))) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	254 КАК КодСтроки,
		|	_Остатки47903.Актив КАК Актив,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК ЮрФизЛицо,
		|	_Остатки47903.НачальныйОстатокРуб КАК НачальныйОстатокРуб,
		|	_Остатки47903.НачальныйОстатокВал КАК НачальныйОстатокВал,
		|	ВЫБОР
		|		КОГДА Обороты.Приход - ЕСТЬNULL(_ПереходНаМСФО9.Приход, 0) > 0
		|			ТОГДА Обороты.Приход - ЕСТЬNULL(_ПереходНаМСФО9.Приход, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Обороты.Расход - ЕСТЬNULL(_ПереходНаМСФО9.Расход, 0) < 0
		|			ТОГДА -(Обороты.Расход - ЕСТЬNULL(_ПереходНаМСФО9.Расход, 0))
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР
		|		КОГДА Обороты.Расход - ЕСТЬNULL(_ПереходНаМСФО9.Расход, 0) > 0
		|			ТОГДА Обороты.Расход - ЕСТЬNULL(_ПереходНаМСФО9.Расход, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Обороты.Приход - ЕСТЬNULL(_ПереходНаМСФО9.Приход, 0) < 0
		|			ТОГДА -(Обороты.Приход - ЕСТЬNULL(_ПереходНаМСФО9.Приход, 0))
		|	КОНЕЦ КАК Расход,
		|	0 КАК Переоценка,
		|	_Остатки47903.Иное + ЕСТЬNULL(_ПереходНаМСФО9.Иное, 0) КАК Иное,
		|	_Остатки47903.КонечныйОстатокРуб КАК КонечныйОстатокРуб,
		|	_Остатки47903.КонечныйОстатокВал КАК КонечныйОстатокВал,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ КАК Резидент,
		|	""ПенсионныеРезервыНакопления"" КАК Раздел,
		|	_Остатки47903.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Остатки47903 КАК _Остатки47903
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_Обороты47903.Счет КАК Счет,
		|			_Обороты47903.Актив КАК Актив,
		|			СУММА(_Обороты47903.Приход) КАК Приход,
		|			СУММА(_Обороты47903.Расход) КАК Расход
		|		ИЗ
		|			_Обороты47903 КАК _Обороты47903
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_Обороты47903.Счет,
		|			_Обороты47903.Актив) КАК Обороты
		|		ПО _Остатки47903.СчетУчета = Обороты.Счет
		|			И _Остатки47903.Актив = Обороты.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|					&КонецПериода,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ПО _Остатки47903.Актив = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереходНаМСФО9 КАК _ПереходНаМСФО9
		|		ПО _Остатки47903.СчетУчета = _ПереходНаМСФО9.СчетУчета
		|			И _Остатки47903.Актив = _ПереходНаМСФО9.Актив
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	254,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	0,
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОбороты.Валюта = ЕдиныйБухгалтерскийУчетОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ,
		|	""ПенсионныеРезервыНакопления"",
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НЕ ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)),
		|			КорСчет В ИЕРАРХИИ (&МассивСчетов),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|					&КонецПериода,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ПО ЕдиныйБухгалтерскийУчетОбороты.Субконто1 = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.КодСтроки КАК КодСтроки,
		|	_ИтоговаяТаблица.Актив КАК Актив,
		|	_ИтоговаяТаблица.СчетУчета КАК СчетУчета,
		|	_ИтоговаяТаблица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокРуб) КАК НачальныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокВал) КАК НачальныйОстатокВал,
		|	СУММА(_ИтоговаяТаблица.Приход) КАК Приход,
		|	СУММА(_ИтоговаяТаблица.Расход) КАК Расход,
		|	СУММА(_ИтоговаяТаблица.Переоценка) КАК Переоценка,
		|	СУММА(_ИтоговаяТаблица.Иное) КАК Иное,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокРуб) КАК КонечныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокВал) КАК КонечныйОстатокВал,
		|	_ИтоговаяТаблица.Резидент КАК Резидент,
		|	_ИтоговаяТаблица.Раздел КАК Раздел
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.КодСтроки,
		|	_ИтоговаяТаблица.Актив,
		|	_ИтоговаяТаблица.ЮрФизЛицо,
		|	_ИтоговаяТаблица.Резидент,
		|	_ИтоговаяТаблица.Раздел,
		|	_ИтоговаяТаблица.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяТаблица";
		
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеРасходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Единый.АктивыВДУ03);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДругиеОбязательстваСервер(Запрос, ТаблицаМногострочныйРаздел, ОтчетСНачалаГода)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	257 КАК КодСтроки,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Актив,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК СчетУчета,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК ЮрФизЛицо,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокРуб,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачальныйОстатокВал,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК Приход,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК Расход,
		|	0 КАК Переоценка,
		|	-ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Иное,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал,
		|	ИСТИНА КАК Резидент,
		|	""ДругиеОбязательстваВознаграждение"" КАК Раздел
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего))) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	257,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	0,
		|	-ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеСпецдепозитария))
		|			ТОГДА ""ДругиеОбязательстваВознаграждение""
		|		ИНАЧЕ ""ДругиеОбязательстваОплатаРасходов""
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						Т.ЮрФизЛицо
		|					ИЗ
		|						Справочник.УправляющиеКомпании КАК Т
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						Т.ЮрФизЛицо
		|					ИЗ
		|						Справочник.ДепозитарныеКомпании КАК Т)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|					ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	258,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	0,
		|	-ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеСпецдепозитария))
		|			ТОГДА ""ДругиеОбязательстваВознаграждение""
		|		ИНАЧЕ ""ДругиеОбязательстваОплатаРасходов""
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НЕ Субконто1 В
		|						(ВЫБРАТЬ
		|							Т.ЮрФизЛицо
		|						ИЗ
		|							Справочник.УправляющиеКомпании КАК Т
		|			
		|						ОБЪЕДИНИТЬ ВСЕ
		|			
		|						ВЫБРАТЬ
		|							Т.ЮрФизЛицо
		|						ИЗ
		|							Справочник.ДепозитарныеКомпании КАК Т)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|					ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	262,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	0,
		|	-ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ИСТИНА,
		|	""ДругиеОбязательства""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты07)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	0,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	1,
		|	""ДругиеОбязательства""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет = &СчетПрочиеСредства18,
		|			&МассивСубконтоПрочие,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	267,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	0,
		|	-ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ИСТИНА,
		|	""ДругиеОбязательства""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РезервыОценочныеОбязательстваНекредитногоХарактера),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	267,
		|	"""",
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	0,
		|	-ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	""ДругиеОбязательства""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыПоНалогуНаПрибыль),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НЕ Субконто1 В
		|						(ВЫБРАТЬ
		|							Т.ЮрФизЛицо
		|						ИЗ
		|							Справочник.УправляющиеКомпании КАК Т
		|			
		|						ОБЪЕДИНИТЬ ВСЕ
		|			
		|						ВЫБРАТЬ
		|							Т.ЮрФизЛицо
		|						ИЗ
		|							Справочник.ДепозитарныеКомпании КАК Т)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|					ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2 = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1.Банк.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|						И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|					ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ОтчетСНачалаГода
		|				И (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт,
		|	0,
		|	ВЫБОР
		|		КОГДА НЕ &ОтчетСНачалаГода
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ,
		|	""ДругиеОбязательства""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты05)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо";
		
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами11);
	МассивСчетов.Добавить(ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами22);
	
	МассивСубконтоПрочие = Новый Массив;
	МассивСубконтоПрочие.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	МассивСубконтоПрочие.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	Запрос.УстановитьПараметр("СчетПрочиеСредства18", ПланыСчетов.Единый.ПрочиеСредства18);
	Запрос.УстановитьПараметр("Счет", МассивСчетов);		
	Запрос.УстановитьПараметр("МассивСубконтоПрочие", МассивСубконтоПрочие);
	Запрос.УстановитьПараметр("ОтчетСНачалаГода", ОтчетСНачалаГода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_НераспределеннаяПрибыльУбытокСервер(Запрос, ТаблицаМногострочныйРаздел)  
	// ОтчетСНачалаГода не нужно добавлять. т.к. нет Начального остатка в запросе
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	261 КАК КодСтроки,
		|	НЕОПРЕДЕЛЕНО КАК Актив,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК СчетУчета,
		|	0 КАК НачальныйОстатокРуб,
		|	0 КАК НачальныйОстатокВал,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот КАК Приход,
		|	0 КАК Расход,
		|	0 КАК Переоценка,
		|	0 КАК Иное,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОбороты.Валюта = ЕдиныйБухгалтерскийУчетОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокРуб,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КонечныйОстатокВал
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			НЕ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	261,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	0,
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	0,
		|	0,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|					И ЕдиныйБухгалтерскийУчетОбороты.Валюта = ЕдиныйБухгалтерскийУчетОбороты.Организация.ВалютаУчета
		|				ИЛИ НЕ ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОбороты.Валюта <> ЕдиныйБухгалтерскийУчетОбороты.Организация.ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчетКор.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.КодСтроки КАК КодСтроки,
		|	_ИтоговаяТаблица.Актив КАК Актив,
		|	_ИтоговаяТаблица.СчетУчета КАК СчетУчета,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокРуб) КАК НачальныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.НачальныйОстатокВал) КАК НачальныйОстатокВал,
		|	СУММА(_ИтоговаяТаблица.Приход) КАК Приход,
		|	СУММА(_ИтоговаяТаблица.Расход) КАК Расход,
		|	СУММА(_ИтоговаяТаблица.Переоценка) КАК Переоценка,
		|	СУММА(_ИтоговаяТаблица.Иное) КАК Иное,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокРуб) КАК КонечныйОстатокРуб,
		|	СУММА(_ИтоговаяТаблица.КонечныйОстатокВал) КАК КонечныйОстатокВал,
		|	""НераспределеннаяПрибыль"" КАК Раздел
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.Актив,
		|	_ИтоговаяТаблица.КодСтроки,
		|	_ИтоговаяТаблица.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяТаблица";
		
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	МассивСчетов.Добавить(ПланыСчетов.Единый.НалогНаПрибыль);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);  
	
	Запрос.УстановитьПараметр("Счет", МассивСчетов);		
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(ТаблицаМногострочныйРаздел.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти 

#Область ПодключаемыеПроцедуры


&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОтчетТитульнаяСтраница2020()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОтчетТитульнаяСтраница2020"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	РасчетРаздела_ОтчетТитульнаяСтраница2020(ТекРаздел, ИмяРаздела);
		
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	МодифицированностьМногострочногоРаздела = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_МногострочныйРаздел()
	
	НовыйНомерСтроки = 1;
	Если СтруктураРеквизитовФормы.ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет") Тогда
	
		ЗаполнитьРаздел_МногострочныйРазделСервер();
		
	Иначе
		
		ЗаполнитьРаздел_МногострочныйРазделРСБУСервер();
	
	КонецЕсли; 
	
	
	
КонецПроцедуры
#КонецОбласти 

#Область ПроцедурыРасчета

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРаздела, ИмяЯчейки, Ячейка)
	// #ЧисткаИтогов
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейкуНачало

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейку(ИмяРазделаРезультат, РазделРезультат, ИмяЯчейкиРезультат, ИмяРазделаИсточник, ИмяЯчейкиИсточник, Множитель = 1, ИмяПоказателяРезультат = "", ИмяПоказателяИсточник = "", ДобавитьКРасчетномуЗначению = ЛОЖЬ)
	
	ИмяПоказателяИсточник_исх = ИмяПоказателяИсточник;
	ИмяПоказателяРезультат = ?(ИмяПоказателяРезультат = "", "Ячейка " + ИмяЯчейкиРезультат, ИмяПоказателяРезультат);
	ИмяПоказателяИсточник = ?(ИмяПоказателяИсточник = "", "Ячейка " + ИмяЯчейкиИсточник, ИмяПоказателяИсточник);
	
	// Определим ячейку-результат
	Попытка
		ЯчейкаРезультат = РазделРезультат.Области[ИмяЯчейкиРезультат];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: не найдена ячейка %2'"),
		ИмяРазделаРезультат,
		ИмяЯчейкиРезультат);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// #ЧисткаИтогов
	Если НЕ ДобавитьКРасчетномуЗначению Тогда
		ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРазделаРезультат, ИмяЯчейкиРезультат, ЯчейкаРезультат); 
	КонецЕсли;
	
	// Табличный документ-источник
	Если ТипЗнч(ИмяРазделаИсточник) = Тип("Строка") Тогда
		
		Попытка
			РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаИсточник))[0];
			ТабИсточник = РазделОтчета.ТабличныйДокумент;
		Исключение
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Расчет итогов по разделу %1: не найден раздел %2'"),
			ИмяРазделаРезультат,
			ИмяРазделаИсточник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	Иначе
		
		// Если передан табличный документ, значит заполнение идет с текущего раздела
		ТабИсточник = ИмяРазделаИсточник;
		РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаРезультат))[0];
		
	КонецЕсли;
	СтраницаИсточник = РазделОтчета;
	
	// Определим ячейку-источник
	Попытка
		ЯчейкаИсточник = ТабИсточник.Области[ИмяЯчейкиИсточник];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: в разделе %2 не найдена ячейка %3'"),
		ИмяРазделаРезультат,
		ИмяРазделаИсточник,
		ИмяЯчейкиИсточник);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// Определим значение - источник, умноженное на "Множитель"
	ЗначениеИсточник = ЯчейкаИсточник.Значение * Множитель;
	
	// Лобавим к значению в ячейке-результат новое значение
	ЯчейкаРезультат.Значение = ЯчейкаРезультат.Значение + КонсолидированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЗначениеИсточник, СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения, СтруктураРеквизитовФормы.мДелитель);
	
	// Определим какой должен быть знак (+/-) в расшифровке
	ЗнакВРасшифровке = ?(Множитель > 0, "+", "-");
	
	Если ИмяПоказателяИсточник_исх = ""
		и Множитель <> 1 и Множитель <> -1 
		Тогда
		МножительБезЗнака = ?(Множитель > 0, Множитель, -Множитель);
		ИмяПоказателяИсточник = ИмяПоказателяИсточник + " * " + МножительБезЗнака;
	КонецЕсли;
	
	// Сформируем текст расшифровки по шаблону: "Закладка ...., имя показателя"
	ТекстРасшифровки = "Закладка «" + СтраницаИсточник.Представление + "»";
	Если ЗначениеЗаполнено(ИмяПоказателяИсточник) Тогда
		ТекстРасшифровки = ТекстРасшифровки + ", " + ИмяПоказателяИсточник;
	КонецЕсли;
	
	// Заменим служебные команды по периоду
	стрИмяПоказателяРезультат = СтрЗаменить(ИмяПоказателяРезультат, "#ПериодТекущий#", СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода);
	стрИмяПоказателяРезультат = СтрЗаменить(стрИмяПоказателяРезультат, "#ПериодПредыдущий#", СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода);
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейку

&НаСервере
Процедура Расчет(ИмяРаздела = "")
	
	КонсолидированнаяОтчетностьКлиентСервер.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	Если ИмяРаздела = "" Тогда
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				Выполнить("РасчетРаздела_" + ТекСтрока.ИмяРаздела + "(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела)");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
			Выполнить("РасчетРаздела_" + ИмяРаздела + "(ТекРаздел, ИмяРаздела)");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ КонсолидированнаяОтчетностьКлиентСервер.НуженПересчетОсновногоРаздела("ТабличныйДокумент" + ИмяРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет основного раздела
	Очистить(ИмяОсновногоРаздела);
	ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяОсновногоРаздела);
	Выполнить("РасчетРаздела_" + ИмяОсновногоРаздела + "(ТекРаздел, ИмяРаздела)");
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОтчетТитульнаяСтраница2020(ТекРаздел, ИмяРаздела)
	
	РасчетРаздела_ОтчетТитульнаяСтраница2020Сервер(ТекРаздел);
	
	Для НомКол = 1 По 8 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П42" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П43" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П35" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П35" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П47" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П47" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П47" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П47" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П47" + СтрНомКол, ТекРаздел, "П52" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П47" + СтрНомКол, ТекРаздел, "П53" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П47" + СтрНомКол, ТекРаздел, "П54" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П45" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П45" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П55" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П56" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П59" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П60" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П61" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П62" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П63" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П67" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П68" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П69" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П70" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П71" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П72" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П73" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П74" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П64" + СтрНомКол, ТекРаздел, "П65" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П64" + СтрНомКол, ТекРаздел, "П66" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П78" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П79" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П80" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П81" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П82" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П83" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П84" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П85" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П77" + СтрНомКол, ТекРаздел, "П86" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П75" + СтрНомКол, ТекРаздел, "П76" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П75" + СтрНомКол, ТекРаздел, "П77" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П93" + СтрНомКол, ТекРаздел, "П94" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П93" + СтрНомКол, ТекРаздел, "П95" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П93" + СтрНомКол, ТекРаздел, "П96" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П93" + СтрНомКол, ТекРаздел, "П97" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П93" + СтрНомКол, ТекРаздел, "П98" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П93" + СтрНомКол, ТекРаздел, "П99" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П91" + СтрНомКол, ТекРаздел, "П92" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П91" + СтрНомКол, ТекРаздел, "П93" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П110" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П101" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П101" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П87" + СтрНомКол, ТекРаздел, "П88" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П87" + СтрНомКол, ТекРаздел, "П89" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П87" + СтрНомКол, ТекРаздел, "П90" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П87" + СтрНомКол, ТекРаздел, "П91" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П87" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П87" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П111" + СтрНомКол, ТекРаздел, "П58" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П111" + СтрНомКол, ТекРаздел, "П64" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П111" + СтрНомКол, ТекРаздел, "П75" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П111" + СтрНомКол, ТекРаздел, "П87" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П112" + СтрНомКол, ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П112" + СтрНомКол, ТекРаздел, "П114" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П112" + СтрНомКол, ТекРаздел, "П115" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П112" + СтрНомКол, ТекРаздел, "П116" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П112" + СтрНомКол, ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П112" + СтрНомКол, ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П112" + СтрНомКол, ТекРаздел, "П119" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П123" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П124" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П125" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П126" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П127" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П128" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П129" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П130" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П120" + СтрНомКол, ТекРаздел, "П121" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П120" + СтрНомКол, ТекРаздел, "П122" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П133" + СтрНомКол, ТекРаздел, "П134" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П133" + СтрНомКол, ТекРаздел, "П135" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П133" + СтрНомКол, ТекРаздел, "П136" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П133" + СтрНомКол, ТекРаздел, "П137" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П133" + СтрНомКол, ТекРаздел, "П138" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П133" + СтрНомКол, ТекРаздел, "П139" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П133" + СтрНомКол, ТекРаздел, "П140" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П131" + СтрНомКол, ТекРаздел, "П132" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П131" + СтрНомКол, ТекРаздел, "П133" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П144" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П145" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П146" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П147" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П148" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П149" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П150" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П151" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П143" + СтрНомКол, ТекРаздел, "П152" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П141" + СтрНомКол, ТекРаздел, "П142" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П141" + СтрНомКол, ТекРаздел, "П143" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П153" + СтрНомКол, ТекРаздел, "П154" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П153" + СтрНомКол, ТекРаздел, "П155" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П153" + СтрНомКол, ТекРаздел, "П156" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П153" + СтрНомКол, ТекРаздел, "П157" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П153" + СтрНомКол, ТекРаздел, "П158" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П165" + СтрНомКол, ТекРаздел, "П166" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П165" + СтрНомКол, ТекРаздел, "П167" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П165" + СтрНомКол, ТекРаздел, "П168" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П165" + СтрНомКол, ТекРаздел, "П169" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П165" + СтрНомКол, ТекРаздел, "П170" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П165" + СтрНомКол, ТекРаздел, "П171" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П163" + СтрНомКол, ТекРаздел, "П164" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П163" + СтрНомКол, ТекРаздел, "П165" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П174" + СтрНомКол, ТекРаздел, "П175" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П174" + СтрНомКол, ТекРаздел, "П176" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П174" + СтрНомКол, ТекРаздел, "П177" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П174" + СтрНомКол, ТекРаздел, "П178" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П174" + СтрНомКол, ТекРаздел, "П179" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П174" + СтрНомКол, ТекРаздел, "П180" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П174" + СтрНомКол, ТекРаздел, "П181" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П172" + СтрНомКол, ТекРаздел, "П173" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П172" + СтрНомКол, ТекРаздел, "П174" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П186" + СтрНомКол, ТекРаздел, "П187" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П186" + СтрНомКол, ТекРаздел, "П188" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П186" + СтрНомКол, ТекРаздел, "П189" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П186" + СтрНомКол, ТекРаздел, "П190" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П186" + СтрНомКол, ТекРаздел, "П191" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П186" + СтрНомКол, ТекРаздел, "П192" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П186" + СтрНомКол, ТекРаздел, "П193" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П184" + СтрНомКол, ТекРаздел, "П185" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П184" + СтрНомКол, ТекРаздел, "П186" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П160" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П161" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П162" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П163" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П172" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П182" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П183" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П159" + СтрНомКол, ТекРаздел, "П184" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П120" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П131" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П141" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П153" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П159" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П194" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П196" + СтрНомКол, ТекРаздел, "П195" + СтрНомКол, 1);

		Если НомКол <> 5 Тогда
		
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П201" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П202" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П203" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П204" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П205" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П206" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П207" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П208" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П200" + СтрНомКол, ТекРаздел, "П209" + СтрНомКол, 1);

			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П198" + СтрНомКол, ТекРаздел, "П199" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П198" + СтрНомКол, ТекРаздел, "П200" + СтрНомКол, 1);

			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П197" + СтрНомКол, ТекРаздел, "П198" + СтрНомКол, 1);
			//ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П197" + СтрНомКол, ТекРаздел, "П210" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П197" + СтрНомКол, ТекРаздел, "П211" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П197" + СтрНомКол, ТекРаздел, "П212" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П197" + СтрНомКол, ТекРаздел, "П213" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П197" + СтрНомКол, ТекРаздел, "П214" + СтрНомКол, 1);

		КонецЕсли;

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П218" + СтрНомКол, ТекРаздел, "П219" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П218" + СтрНомКол, ТекРаздел, "П220" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П218" + СтрНомКол, ТекРаздел, "П221" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П218" + СтрНомКол, ТекРаздел, "П222" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П218" + СтрНомКол, ТекРаздел, "П223" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П218" + СтрНомКол, ТекРаздел, "П224" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П218" + СтрНомКол, ТекРаздел, "П225" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П216" + СтрНомКол, ТекРаздел, "П217" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П216" + СтрНомКол, ТекРаздел, "П218" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П233" + СтрНомКол, ТекРаздел, "П234" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П233" + СтрНомКол, ТекРаздел, "П235" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П238" + СтрНомКол, ТекРаздел, "П239" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П238" + СтрНомКол, ТекРаздел, "П240" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П238" + СтрНомКол, ТекРаздел, "П241" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П238" + СтрНомКол, ТекРаздел, "П242" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П238" + СтрНомКол, ТекРаздел, "П243" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П238" + СтрНомКол, ТекРаздел, "П244" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П236" + СтрНомКол, ТекРаздел, "П237" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П236" + СтрНомКол, ТекРаздел, "П238" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П247" + СтрНомКол, ТекРаздел, "П248" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П247" + СтрНомКол, ТекРаздел, "П249" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П247" + СтрНомКол, ТекРаздел, "П250" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П247" + СтрНомКол, ТекРаздел, "П251" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П247" + СтрНомКол, ТекРаздел, "П252" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П247" + СтрНомКол, ТекРаздел, "П253" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П247" + СтрНомКол, ТекРаздел, "П254" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П245" + СтрНомКол, ТекРаздел, "П246" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П245" + СтрНомКол, ТекРаздел, "П247" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П232" + СтрНомКол, ТекРаздел, "П233" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П232" + СтрНомКол, ТекРаздел, "П236" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П232" + СтрНомКол, ТекРаздел, "П245" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П232" + СтрНомКол, ТекРаздел, "П255" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П216" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П226" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П227" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П228" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П229" + СтрНомКол, 1);

		Если НомКол <> 5 Тогда
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П230" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П231" + СтрНомКол, 1);
		КонецЕсли;

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П232" + СтрНомКол, 1);

		Если НомКол <> 5 Тогда
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П215" + СтрНомКол, ТекРаздел, "П256" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П257" + СтрНомКол, ТекРаздел, "П197" + СтрНомКол, 1);
		КонецЕсли;

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П257" + СтрНомКол, ТекРаздел, "П215" + СтрНомКол, 1);

		Если НомКол <> 5 Тогда
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П258" + СтрНомКол, ТекРаздел, "П259" + СтрНомКол, 1);
		КонецЕсли;

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П258" + СтрНомКол, ТекРаздел, "П260" + СтрНомКол, 1);

		Если НомКол <> 5 Тогда
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П261" + СтрНомКол, ТекРаздел, "П262" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П261" + СтрНомКол, ТекРаздел, "П263" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П261" + СтрНомКол, ТекРаздел, "П264" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П261" + СтрНомКол, ТекРаздел, "П265" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П261" + СтрНомКол, ТекРаздел, "П266" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П261" + СтрНомКол, ТекРаздел, "П267" + СтрНомКол, 1);
		КонецЕсли;

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П268" + СтрНомКол, ТекРаздел, "П258" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П268" + СтрНомКол, ТекРаздел, "П261" + СтрНомКол, 1);

		Если НомКол <> 5 Тогда
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П270" + СтрНомКол, ТекРаздел, "П271" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П270" + СтрНомКол, ТекРаздел, "П272" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П270" + СтрНомКол, ТекРаздел, "П273" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П270" + СтрНомКол, ТекРаздел, "П274" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П270" + СтрНомКол, ТекРаздел, "П275" + СтрНомКол, 1);
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П270" + СтрНомКол, ТекРаздел, "П276" + СтрНомКол, 1);

			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П277" + СтрНомКол, ТекРаздел, "П269" + СтрНомКол, 1);
		КонецЕсли;

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П277" + СтрНомКол, ТекРаздел, "П270" + СтрНомКол, 1);
		
	КонецЦикла;
	
	УстановитьГруппировкиТитульнойСтраницы(ТекРаздел);
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОтчетТитульнаяСтраница2020Сервер(ТекРаздел)
	
	//заполним шапку документа
	ТекРаздел.Области["ТекущийПериод1"].Значение = "за " + КонсолидированнаяОтчетность.ПредставлениеФинансовогоПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, Ложь);
	
	СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	
	Если НЕ ТекРаздел.Области.Найти("Организация") = Неопределено Тогда
		ТекРаздел.Области.Организация.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
			СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
			СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если НЕ ТекРаздел.Области.Найти("ПочтовыйАдресОрганизации") = Неопределено Тогда
		ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдрес;
	КонецЕсли;
	
	Для каждого СтрокаРаздела Из ЭтаФорма.МногострочныйРаздел Цикл
	
		Если СтрокаРаздела.КодСтроки = 0 Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Для актива: " + СтрокаРаздела.Актив + 
				" не заполнена колонка ""Код строки"". Строка пропущена.", , "МногострочныйРаздел[" + (СтрокаРаздела.ПолучитьИдентификатор()) + "].КодСтроки", );
		
		КонецЕсли; 
			
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МногострочныйРаздел", ЭтаФорма.МногострочныйРаздел.Выгрузить());
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода) И НЕ СтруктураРеквизитовФормы.НестандартныйПериод Тогда
	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МногострочныйРаздел.КодСтроки,
			|	МногострочныйРаздел.НачальныйОстатокРуб,
			|	МногострочныйРаздел.НачальныйОстатокВал,
			|	МногострочныйРаздел.Приход,
			|	МногострочныйРаздел.Расход,
			|	МногострочныйРаздел.Переоценка,
			|	МногострочныйРаздел.Иное,
			|	МногострочныйРаздел.КонечныйОстатокРуб,
			|	МногострочныйРаздел.КонечныйОстатокВал
			|ПОМЕСТИТЬ МногострочныйРаздел
			|ИЗ
			|	&МногострочныйРаздел КАК МногострочныйРаздел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МногострочныйРаздел.КодСтроки,
			|	СУММА(МногострочныйРаздел.НачальныйОстатокРуб) КАК НачальныйОстатокРуб,
			|	СУММА(МногострочныйРаздел.НачальныйОстатокВал) КАК НачальныйОстатокВал,
			|	СУММА(МногострочныйРаздел.Приход) КАК Приход,
			|	СУММА(МногострочныйРаздел.Расход) КАК Расход,
			|	СУММА(МногострочныйРаздел.Переоценка) КАК Переоценка,
			|	СУММА(МногострочныйРаздел.Иное) КАК Иное,
			|	СУММА(МногострочныйРаздел.КонечныйОстатокРуб) КАК КонечныйОстатокРуб,
			|	СУММА(МногострочныйРаздел.КонечныйОстатокВал) КАК КонечныйОстатокВал
			|ПОМЕСТИТЬ МногострочныйРазделГруппировка
			|ИЗ
			|	МногострочныйРаздел КАК МногострочныйРаздел
			|
			|СГРУППИРОВАТЬ ПО
			|	МногострочныйРаздел.КодСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МногострочныйРазделПрошлогоГода.КодСтроки,
			|	МногострочныйРазделПрошлогоГода.КонечныйОстатокРуб КАК КонечныйОстатокРуб,
			|	МногострочныйРазделПрошлогоГода.КонечныйОстатокВал КАК КонечныйОстатокВал
			|ПОМЕСТИТЬ _ДанныеПрошлогоГода
			|ИЗ
			|	&МногострочныйРазделПрошлогоГода КАК МногострочныйРазделПрошлогоГода
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеПрошлогоГода.КодСтроки,
			|	СУММА(_ДанныеПрошлогоГода.КонечныйОстатокРуб) КАК КонечныйОстатокРуб,
			|	СУММА(_ДанныеПрошлогоГода.КонечныйОстатокВал) КАК КонечныйОстатокВал
			|ПОМЕСТИТЬ МногострочныйРазделПрошлыйГод
			|ИЗ
			|	_ДанныеПрошлогоГода КАК _ДанныеПрошлогоГода
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДанныеПрошлогоГода.КодСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(МногострочныйРазделГруппировка.КодСтроки, МногострочныйРазделПрошлыйГод.КодСтроки) КАК КодСтроки,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделПрошлыйГод.КонечныйОстатокРуб, 0)) КАК _01,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделПрошлыйГод.КонечныйОстатокВал, 0)) КАК _02,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделГруппировка.Приход, 0)) КАК _03,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделГруппировка.Расход, 0)) КАК _04,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделГруппировка.Переоценка, 0)) КАК _05,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделГруппировка.НачальныйОстатокРуб, 0) - ЕСТЬNULL(МногострочныйРазделПрошлыйГод.КонечныйОстатокРуб, 0) + ЕСТЬNULL(МногострочныйРазделГруппировка.Иное, 0)) КАК _06,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделГруппировка.КонечныйОстатокРуб, 0)) КАК _07,
			|	СУММА(ЕСТЬNULL(МногострочныйРазделГруппировка.КонечныйОстатокВал, 0)) КАК _08
			|ИЗ
			|	МногострочныйРазделГруппировка КАК МногострочныйРазделГруппировка
			|		ПОЛНОЕ СОЕДИНЕНИЕ МногострочныйРазделПрошлыйГод КАК МногострочныйРазделПрошлыйГод
			|		ПО МногострочныйРазделГруппировка.КодСтроки = МногострочныйРазделПрошлыйГод.КодСтроки
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(МногострочныйРазделГруппировка.КодСтроки, МногострочныйРазделПрошлыйГод.КодСтроки)";
			
		ДанныеОтчета = СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода.ДанныеОтчета.Получить();
		МногострочныйРазделПрошлогоГода = Неопределено;
		Если ДанныеОтчета.Свойство("МногострочныйРаздел", МногострочныйРазделПрошлогоГода) Тогда
			Запрос.УстановитьПараметр("МногострочныйРазделПрошлогоГода", МногострочныйРазделПрошлогоГода);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В отчете на конец предыдущего года отсутствуют данные для заполнения");
		КонецЕсли;
			
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МногострочныйРаздел.КодСтроки,
			|	МногострочныйРаздел.НачальныйОстатокРуб,
			|	МногострочныйРаздел.НачальныйОстатокВал,
			|	МногострочныйРаздел.Приход,
			|	МногострочныйРаздел.Расход,
			|	МногострочныйРаздел.Переоценка,
			|	МногострочныйРаздел.Иное,
			|	МногострочныйРаздел.КонечныйОстатокРуб,
			|	МногострочныйРаздел.КонечныйОстатокВал
			|ПОМЕСТИТЬ МногострочныйРаздел
			|ИЗ
			|	&МногострочныйРаздел КАК МногострочныйРаздел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МногострочныйРаздел.КодСтроки КАК КодСтроки,
			|	СУММА(МногострочныйРаздел.НачальныйОстатокРуб) КАК _01,
			|	СУММА(МногострочныйРаздел.НачальныйОстатокВал) КАК _02,
			|	СУММА(МногострочныйРаздел.Приход) КАК _03,
			|	СУММА(МногострочныйРаздел.Расход) КАК _04,
			|	СУММА(МногострочныйРаздел.Переоценка) КАК _05,
			|	СУММА(МногострочныйРаздел.Иное) КАК _06,
			|	СУММА(МногострочныйРаздел.КонечныйОстатокРуб) КАК _07,
			|	СУММА(МногострочныйРаздел.КонечныйОстатокВал) КАК _08
			|ИЗ
			|	МногострочныйРаздел КАК МногострочныйРаздел
			|
			|СГРУППИРОВАТЬ ПО
			|	МногострочныйРаздел.КодСтроки";
			
	КонецЕсли; 

	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		КодСтроки = ?(Выборка.КодСтроки < 10, "0" + Выборка.КодСтроки, "" + Выборка.КодСтроки);
		Для каждого Колонка Из Результат.Колонки Цикл
			Если Не Колонка.Имя = "КодСтроки" Тогда
				ИмяОбласти = "П" + КодСтроки + Прав(Колонка.Имя, 2);
				Попытка
					Если ТекРаздел.Области[ИмяОбласти].СодержитЗначение Тогда
					
						ТекРаздел.Области[ИмяОбласти].Значение = Выборка[Колонка.Имя];
					
					КонецЕсли; 
				Исключение
				КонецПопытки;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
		
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область НастройкиОтчета

&НаКлиенте
Процедура ОткрытьФормуНастроекЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЕдиницаИзмерения 			= ДополнительныеПараметры.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= ДополнительныеПараметры.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= ДополнительныеПараметры.ВалютаДокумента;
	ИсходныйПодписант 			= ДополнительныеПараметры.Подписант;
	ВидУчета 					= ДополнительныеПараметры.ВидУчета;
	
	Модифицированность = Истина;
	
	Если ЕдиницаИзмерения <> СтруктураРеквизитовФормы.ЕдиницаИзмерения Тогда
		
		ЕдиницаИзмеренияПриИзменении();
		
	КонецЕсли;
	
	Если ТочностьЕдиницыИзмерения <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		
		ТочностьЕдиницыИзмеренияПриИзменении();
		
	КонецЕсли;
	
	Если ВалютаДокумента <> СтруктураРеквизитовФормы.ВалютаДокумента Тогда
		
		ВалютаДокументаПриИзменении();
		
	КонецЕсли;
	
	Если ИсходныйПодписант <> ЭтаФорма.Подписант Тогда
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
		
	КонецЕсли;
	
	Если ВидУчета <> СтруктураРеквизитовФормы.ВидУчета Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	Модифицированность = Истина;
	
	ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета[0].ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВывода()

	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении()
	
	ТекстСообщения = НСтр("ru = 'Изменена валюта представления отчетности.
	|Перезаполнить документ?'");
	
	ПоказатьВопрос(
	Новый ОписаниеОповещения(
	"ВалютаДокументаПриИзмененииЗавершение",
	ЭтотОбъект),
	ТекстСообщения,
	РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвто();
	КонецЕсли;
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в рублях точность не может превышать 2 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в тысячах рублей точность не может превышать 3 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в миллионах рублей точность не может превышать 6 знаков'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьТочность()
	
#КонецОбласти 

#Область ЗаписьОтчета

&НаКлиенте
Процедура СохранитьНаКлиенте(ВыполняемоеОповещение=Неопределено) Экспорт

	Если МодифицированностьМногострочногоРаздела Тогда
	
		Если Вопрос("Многострочный раздел изменен. Перезаполнить титульный лист?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
		
			ЗаполнитьАвто("ОтчетТитульнаяСтраница2020");
		
		КонецЕсли; 
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		ИмяСобытия = "ЗаписьРегламентированногоОтчета";
	Иначе
		ИмяСобытия = "ЗаписьНовогоРегламентированногоОтчета";
	КонецЕсли; 

	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
    //при ручной правке подписант может пропасть. При сохранении вернем его
	
	ЗаполнитьПоказатели();
	ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
	
		Модифицированность = Ложь;
	
		ИсторияРаботыПользователя.Добавить(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок);
		
		Оповестить(ИмяСобытия, Новый Структура("Ключ", СтруктураРеквизитовФормы.мСохраненныйДок));
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	КонсолидированнаяОтчетность.ЗаписатьОтчет(ЭтаФорма);

КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьПоказатели()

	ЭтаФорма.Показатели.Очистить();
		
	Для Каждого ТекСтрока Из РазделыОтчета Цикл
		
		Если ТекСтрока.Многострочныйраздел Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Попытка
			ОбластиРаздела = ТекСтрока.ТабличныйДокумент.Области;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого ТекОбласть Из ОбластиРаздела Цикл
			
			Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Если Не ТекОбласть.СодержитЗначение Тогда
					Продолжить;
				КонецЕсли;
			Исключение
				ТекстСообщения = "Ошибка макета: раздел " + ТекСтрока.ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(ТекОбласть.Значение) Тогда
			
				Продолжить;
			
			КонецЕсли; 
			
			НоваяСтрока = ЭтаФорма.Показатели.Добавить();
			НоваяСтрока.ИмяРаздела 		= ТекСтрока.ИмяРаздела;
			НоваяСтрока.ИмяПоказателя 	= ТекОбласть.Имя;
			НоваяСтрока.Значение 		= ТекОбласть.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтаФорма.Показатели.Сортировать("ИмяРаздела, ИмяПоказателя");
	
КонецПроцедуры

#КонецОбласти 

#Область Расшифровка

&НаКлиенте
Процедура РасшифровкаНажатиеВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатиеЗавершение(Знач Адрес_Расшифровка, Знач ИмяРаздела, ИмяЯчейки)
	
	
КонецПроцедуры

&НаСервере
Функция РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка)
	
	
КонецФункции

&НаСервере
Процедура ВывестиРасшифровкуСервер(ТабДок, ИмяСтраницы)
	
	
КонецПроцедуры


#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьНажатие(Команда)
	
	ЗаполнитьАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	ЗаполнитьАвто(ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНажатие(Команда)
	
	Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Очистить(ИмяРаздела);
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		
		Очистить(ИмяОсновногоРаздела);
		Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо сохранить документ.");
		Возврат;
	
	КонецЕсли; 
	
	ИмяФайла = "Форма 1-ФС на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD");
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогСохраненияФайла.Фильтр             = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок          = "Укажите файл";
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.СохранитьРегламентированныйОтчетВExcel(ЭтаФорма, ДиалогСохраненияФайла.ПолноеИмяФайла, ЭтаФорма.СохраняемыеРазделы);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНаКлиенте();
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", 					СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", 			СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения", 	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	ПараметрыФормы.Вставить("ОтчетНаКонецПрошлогоГода", 	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	ПараметрыФормы.Вставить("Подписант", 					ЭтаФорма.Подписант);
	ПараметрыФормы.Вставить("ИсточникОтчета",				СтруктураНаименованийОтчета.ИсточникОтчета);
	ПараметрыФормы.Вставить("ВидУчета",						СтруктураРеквизитовФормы.ВидУчета);
	
	ФормаНастройкиОтчета = ПолучитьФорму("Отчет." + СтруктураНаименованийОтчета.ИсточникОтчета + ".Форма.НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ЕдиницаИзмерения 			= СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= СтруктураРеквизитовФормы.ВалютаДокумента;
	Подписант 					= ЭтаФорма.Подписант;
	ВидУчета					= СтруктураРеквизитовФормы.ВидУчета;
	
	ДополнительныеПараметры = Новый Структура("ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ВидУчета", ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ВидУчета);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуНастроекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.СтатусОтчета = "Корректировка" Тогда
		Элементы.НомерКорректировки.Видимость = Истина;
		ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
		ЭтаФорма.НомерКорректировки = ПолучитьНомерКорректировки(ЭтаФорма.СтруктураРеквизитовФормы, ИсточникОтчета);
	Иначе
		Элементы.НомерКорректировки.Видимость = Ложь;
		ЭтаФорма.НомерКорректировки = 0;
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерКорректировки(СтруктураРеквизитовФормы, ИсточникОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕстьNULL(МАКСИМУМ(РегламентированныйОтчет.НомерКорректировки), 0) КАК НомерКорректировки
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Организация = &Организация
		|	И РегламентированныйОтчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РегламентированныйОтчет.ВидУчета = &ВидУчета
		|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
		|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
		|	И РегламентированныйОтчет.ВалютаДокумента = &ВалютаДокумента
		|	И РегламентированныйОтчет.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И РегламентированныйОтчет.ТочностьЕдиницыИзмерения = &ТочностьЕдиницыИзмерения
		|	И РегламентированныйОтчет.ОтчетНаКонецПрошлогоГода = &ОтчетНаКонецПрошлогоГода
		|	И РегламентированныйОтчет.ОтчетЗаПоследнийКвартал = &ОтчетЗаПоследнийКвартал
		|	И РегламентированныйОтчет.ВыбраннаяФорма = &ВыбраннаяФорма
		|	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
		|	И РегламентированныйОтчет.СтатусОтчета = &СтатусОтчета";
	
	Запрос.УстановитьПараметр("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВидУчета", 						СтруктураРеквизитовФормы.ВидУчета);
	Запрос.УстановитьПараметр("ВыбраннаяФорма", 				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", 					НачалоДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", 				СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ИсточникОтчета", 				ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", 					СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ОтчетЗаПоследнийКвартал", 		Ложь);
	Запрос.УстановитьПараметр("ОтчетНаКонецПрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	Запрос.УстановитьПараметр("СтатусОтчета", 					"Корректировка");
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТочностьЕдиницыИзмерения", 		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерКорректировки = 0;
	Если Выборка.Следующий() Тогда
		НомерКорректировки = Выборка.НомерКорректировки;
	КонецЕсли;
	Возврат НомерКорректировки + 1;		
		
КонецФункции

&НаКлиенте
Процедура НомерКорректировкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры
 
#КонецОбласти 


