&НаСервере
Функция СфомироватьДокументыСЭД(Организация, СчетаДоверительногоУправления, Период, КаталогФайлов, Подписант, ПодписантДолжность, Макет) Экспорт
				
	// Подготовим параметры для передачи в обработку выгрузки
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования) КАК ДатаЗапретаРедактирования,
	|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _ДатыЗапретаЕПС
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Организация = &Организация
	|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
	|	И ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
	|	И ДатыЗапретаРедактирования.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыЗапретаРедактирования.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегистрацияСтоимостиАктивов.Ссылка КАК Регистратор,
	|	РегистрацияСтоимостиАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ДатыЗапретаЕПС.ДатаЗапретаРедактирования ЕСТЬ NULL КАК ПартииНеПроведены
	|ИЗ
	|	Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыЗапретаЕПС КАК _ДатыЗапретаЕПС
	|		ПО РегистрацияСтоимостиАктивов.СчетДоверительногоУправления = _ДатыЗапретаЕПС.СчетДоверительногоУправления
	|			И (_ДатыЗапретаЕПС.ДатаЗапретаРедактирования >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))
	|ГДЕ
	|	РегистрацияСтоимостиАктивов.Организация = &Организация
	|	И РегистрацияСтоимостиАктивов.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
	|	И РегистрацияСтоимостиАктивов.Проведен
	|	И НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ) = &Период";
	
	Запрос.УстановитьПараметр("Период", 					  Период);
	Запрос.УстановитьПараметр("Организация", 				  Организация);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДоверительногоУправления);
	
	МассивДокументов = Новый Массив;			
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьСчетаДУСНепроведеннымЕПС = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПартииНеПроведены Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По счету ДУ " + СокрЛП(Выборка.СчетДоверительногоУправления) + " не проведен бухгалтерский учет (ЕПС). Файл выгрузки по нему не сформирован");
			ЕстьСчетаДУСНепроведеннымЕПС = Истина;
			Продолжить;
		КонецЕсли;
		
		ТекДокумент = Выборка.Регистратор;
		МассивДокументов.Добавить(ТекДокумент);
		
	КонецЦикла;   	
	
	КоличествоДокументовКВыгрузке = МассивДокументов.Количество();
	Если ЕстьСчетаДУСНепроведеннымЕПС И КоличествоДокументовКВыгрузке = 0 Тогда
		// Об ошибке сообщили ранее
		Возврат Ложь;
	ИначеЕсли КоличествоДокументовКВыгрузке = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На выбранную дату отсутствуют документы 'Регистрация стоимости активов'");
		Возврат Ложь;	
	КонецЕсли;
	
	ЭтаФорма.МакетXSDСхемы = Макет; 
	
	ОбработкаВыгрузки = Обработки.ПечатьИВыгрузка_СЧА_РСА.Создать();  		
	ОбработкаВыгрузки.ДатаИВремяФормирования = ТекущаяДата();
	
	Разрядность = 5;
				
	// сформируем файл данных
	ПолноеИмяФайла = КаталогФайлов + ?(Прав(КаталогФайлов, 1) = "\", "", "\");
	Результат = ОбработкаВыгрузки.ПолучитьРезультатВыгрузкиСЧАИнфинитум_20200401(МассивДокументов, Подписант, ПодписантДолжность, Разрядность);

	Если Результат.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРезультата Из Результат Цикл		
		СформироватьXML(СтрокаРезультата, ПолноеИмяФайла + СтрокаРезультата.ИмяФайла);
	КонецЦикла;	
		
	Возврат Истина;
			
КонецФункции

&НаСервере
Процедура СформироватьXML(ПакетДанных, ИмяФайлаXML)
	
	Если ПакетДанных.Свойство("Отказ") Тогда Возврат; КонецЕсли;
	
	ИмяФайлаXSDСхемы = ПолучитьИмяВременногоФайла("xsd");
	ЭтаФорма.МакетXSDСхемы.Записать(ИмяФайлаXSDСхемы);
	
	ФайлыXSD = Новый Массив;
	ФайлыXSD.Добавить(ИмяФайлаXSDСхемы);
	
	НоваяФабрикаXDTO = СоздатьФабрикуXDTO(ФайлыXSD);
	
	УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаXSDСхемы);
	
	ЗаписьXML = Новый ЗаписьXML;
		
	Попытка
		ЗаписьXML.ОткрытьФайл(ИмяФайлаXML, "UTF-16");	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("NetAssetValue"); 
	 
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://www.w3.org/2001/XMLSchema-instance"); 
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
	
	URLПространстваИмен = "";
	
	Для Каждого ПакетXDTO Из НоваяФабрикаXDTO.Пакеты Цикл
		Если ПакетXDTO.URIПространстваИмен = "http://www.w3.org/2001/XMLSchema" Тогда
			Продолжить;
		КонецЕсли;
		URLПространстваИмен = ПакетXDTO.URIПространстваИмен;
	КонецЦикла;	
	
	ОбщиеРеквизиты = ПакетДанных.ОбщиеРеквизиты;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("MetaData");         	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Report_Title");
	Если ОбщиеРеквизиты.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда
		ЗаписьXML.ЗаписатьТекст("1");
	Иначе
		ЗаписьXML.ЗаписатьТекст("2");
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Date");
	ЗаписьXML.ЗаписатьТекст(Формат(ОбщиеРеквизиты.ДатаОтчетаДата, "ДФ=yyyy-MM-dd"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Creation_Time");
	ЗаписьXML.ЗаписатьТекст("23:59:59");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ext_Fond_Code");
	ЗаписьXML.ЗаписатьТекст(ОбщиеРеквизиты.Ext_Fond_Code);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("VAT_Registration_No_Fond");
	ЗаписьXML.ЗаписатьТекст(ОбщиеРеквизиты.ИННФонда);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ext_UK_Сode");
	ЗаписьXML.ЗаписатьТекст(ОбщиеРеквизиты.Ext_UK_Сode);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("VAT_Registration_No_UK");
	ЗаписьXML.ЗаписатьТекст(ОбщиеРеквизиты.ИННОрганизации);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("No_Agreement");
	ЗаписьXML.ЗаписатьТекст(ОбщиеРеквизиты.НомерДоговора);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Date_Agreement");
	ЗаписьXML.ЗаписатьТекст(Формат(ОбщиеРеквизиты.ДатаДоговора, "ДФ=yyyy-MM-dd"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Sections");
	ЕстьСекция6 = Ложь;
	ЕстьСекция7 = Ложь;
		
	Для Каждого ЭлементыОтчета Из ПакетДанных.Отчет Цикл
		
		Если Лев(ЭлементыОтчета.Ключ, 9) <> "Section_6" И ЕстьСекция6 Тогда
			ЗаписьXML.ЗаписатьКонецЭлемента();	
			ЕстьСекция6 = Ложь;
		КонецЕсли;
		
		Если Лев(ЭлементыОтчета.Ключ, 9) <> "Section_7" И ЕстьСекция7 Тогда
			ЗаписьXML.ЗаписатьКонецЭлемента();	
			ЕстьСекция7 = Ложь;
		КонецЕсли;
		
		Если Лев(ЭлементыОтчета.Ключ, 9) = "Section_6" И (Не ЕстьСекция6) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Sections_6");	
			ЕстьСекция6 = Истина;
		КонецЕсли;
		
		Если Лев(ЭлементыОтчета.Ключ, 9) = "Section_7" И (Не ЕстьСекция7) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Sections_7");	
			ЕстьСекция7 = Истина;
		КонецЕсли;
				
		ЗаписьXML.ЗаписатьНачалоЭлемента(ЭлементыОтчета.Ключ);
		
		СвойстваОбъектаXDTO = НоваяФабрикаXDTO.Тип(URLПространстваИмен, ПолучитьТипПоУзлу(ЭлементыОтчета.Ключ)).Свойства;
		Для Каждого ТекСвойствоОбъектаXDTO Из СвойстваОбъектаXDTO Цикл
					
			Если ТекСвойствоОбъектаXDTO.Имя = "Header" Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Header");
				СвойстваЗаголовкаТаблицы = ТекСвойствоОбъектаXDTO.Тип.Свойства;
				Для Каждого ТекСвойствоЗаголовка Из СвойстваЗаголовкаТаблицы Цикл
					ЗаписьXML.ЗаписатьНачалоЭлемента(ТекСвойствоЗаголовка.Имя);
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЦикла;				
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				Продолжить;
			КонецЕсли;
			
			Если ЭлементыОтчета.Значение = Неопределено Тогда
				// Запись пустой секции (только заголовки)
				ЗаписьXML.ЗаписатьКонецЭлемента();
				Продолжить;
			КонецЕсли;
			
			ТипОбъектаXDTO = ТекСвойствоОбъектаXDTO.Тип;
			
			Если ТипЗнч(ЭлементыОтчета.Значение) = Тип("Массив") Тогда
				Для Каждого ЭлементМассива Из ЭлементыОтчета.Значение Цикл
					НоваяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, 
												ПреобразоватьЗначениеВXML(ЭлементМассива, ТекСвойствоОбъектаXDTO.Имя, НоваяФабрикаXDTO, ТипОбъектаXDTO)
												, 
												ТекСвойствоОбъектаXDTO.Имя,, 											
												ФормаXML.Элемент, НазначениеТипаXML.Неявное);
				КонецЦикла;								
			Иначе
				
				НоваяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, 
											ПреобразоватьЗначениеВXML(ЭлементыОтчета.Значение, ТекСвойствоОбъектаXDTO.Имя, НоваяФабрикаXDTO, ТипОбъектаXDTO)
											, 
											ТекСвойствоОбъектаXDTO.Имя,, 
											ФормаXML.Элемент, НазначениеТипаXML.Неявное);
			КонецЕсли;  								
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЕстьСекция6 Или ЕстьСекция7 Тогда
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();		
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Total_By_Report");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Amount");
	ЗаписьXML.ЗаписатьТекст(Формат(ОбщиеРеквизиты.ОбщаяСумма, "ЧРД=.; ЧН=0.00; ЧГ="));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СведенияДолжнЛицоСостОтчет");
	ЗаписьXML.ЗаписатьНачалоЭлемента("FIO");	
	ЗаписьXML.ЗаписатьТекст(ОбщиеРеквизиты.ФИОПодписанта); 
	ЗаписьXML.ЗаписатьКонецЭлемента();      
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Position");	
	ЗаписьXML.ЗаписатьТекст(ОбщиеРеквизиты.Position); 
	ЗаписьXML.ЗаписатьКонецЭлемента();      
	
	ЗаписьXML.ЗаписатьКонецЭлемента();      
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	// Заменяем пространства имен на исходные (с исходными пакеты XTDO не считываются)
	ТекстФайла = Новый ТекстовыйДокумент;
	ТекстФайла.Прочитать(ИмяФайлаXML, "UTF-16");
		
	Кавычки = Символ(34);
	
	ЗаменяемаяСтрока = "<NetAssetValue xmlns='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema'>";
	ЗаменяемаяСтрока = СтрЗаменить(ЗаменяемаяСтрока, "'", Кавычки);
	СтрокаЗамены = "<NetAssetValue xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' version='1'>";
	СтрокаЗамены = СтрЗаменить(СтрокаЗамены, "'", Кавычки);
		
	ТекстФайла.ЗаменитьСтроку(2, СтрокаЗамены);
	
	Попытка 
		ТекстФайла.Записать(ИмяФайлаXML, "UTF-16");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка сохранения файла " + ИмяФайлаXML + ": " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипПоУзлу(ИмяУзла)
		
	Если ИмяУзла = "Section_6_1" Или ИмяУзла = "Section_6_2" Тогда
		Возврат "Section_6-1_6-2_t";
	ИначеЕсли ИмяУзла = "Section_6_3" Или ИмяУзла = "Section_6_4" Тогда
		Возврат "Section_6-3_6-4_t";	
	ИначеЕсли ИмяУзла = "Section_6_5" Тогда
		Возврат "Section_6-5_t";		
	ИначеЕсли ИмяУзла = "Section_6_6" Тогда
		Возврат "Section_6-6_t";
	ИначеЕсли ИмяУзла = "Section_7_1" Тогда
		Возврат "Section_7-1_t";	
	ИначеЕсли ИмяУзла = "Section_7_2" Тогда
		Возврат "Section_7-2_t";	
	ИначеЕсли ИмяУзла = "Section_7_3" Тогда
		Возврат "Section_7-3_t";		
	Иначе 
		Возврат ИмяУзла  + "_t";	
	КонецЕсли;	
		
КонецФункции

&НаСервере
Функция ПреобразоватьЗначениеВXML(ПакетДанных, ИмяЭлемента, НоваяФабрикаXDTO, ТипОбъектаXDTO = "")
	
	ТипЗначения = ТипЗнч(ПакетДанных);
	
	Если ТипЗначения = Тип("Структура")  Тогда
		ОбъектXDTO		= НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO);

		Для Каждого ЭлементПакета Из ПакетДанных Цикл
			Если ТипЗнч(ЭлементПакета.Значение) = Тип("Массив") Тогда
				Для Каждого ЭлементМассива Из ЭлементПакета.Значение Цикл	
					Для Каждого ЭлементСтруктуры Из ЭлементМассива Цикл
						Если ЭлементСтруктуры.Ключ = "Sections" Тогда 
							Продолжить;
						КонецЕсли;
						ОбъектXDTO[ЭлементСтруктуры.Ключ].Добавить(ПреобразоватьЗначениеВXML(ЭлементСтруктуры, ЭлементСтруктуры.Ключ, НоваяФабрикаXDTO, ТипОбъектаXDTO.Свойства.Получить(ЭлементСтруктуры.Ключ).Тип));
					КонецЦикла;				
				КонецЦикла;
			Иначе
				Если ЭлементПакета.Ключ = "Sections" Тогда 
					Продолжить;
				КонецЕсли;
				ОбъектXDTO[ЭлементПакета.Ключ] = ПреобразоватьЗначениеВXML(ЭлементПакета.Значение, ЭлементПакета.Ключ, НоваяФабрикаXDTO, ТипОбъектаXDTO.Свойства.Получить(ЭлементПакета.Ключ).Тип);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("Массив")  Тогда
		ОбъектXDTO		= НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO);

		Для Каждого ЭлементМассива Из ПакетДанных Цикл			
			Для Каждого ЭлементСтруктуры Из ЭлементМассива Цикл
				Если ЭлементСтруктуры.Ключ = "Sections" Тогда 
					Продолжить;
				КонецЕсли;
				ОбъектXDTO[ЭлементСтруктуры.Ключ] = ПреобразоватьЗначениеВXML(ЭлементСтруктуры.Значение, ЭлементСтруктуры.Ключ, НоваяФабрикаXDTO, ТипОбъектаXDTO.Свойства.Получить(ЭлементСтруктуры.Ключ).Тип);
			КонецЦикла;		
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ТипОбъектаXDTO) = тип("ТипОбъектаXDTO") Тогда
		ОбъектXDTO = ПолучитьЗначениеПеречисления(ТипОбъектаXDTO, НоваяФабрикаXDTO, ИмяЭлемента, ПакетДанных);
	
	ИначеЕсли ТипОбъектаXDTO.Имя = "decimal" ИЛИ ТипОбъектаXDTO.Имя = "Double" Тогда		
		
		ОбъектXDTO = НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO, ПакетДанных);
	Иначе
		ОбъектXDTO = НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO, ПакетДанных);
		
	КонецЕсли;
	
	Возврат ОбъектXDTO;
	
КонецФункции	

&НаСервере
Функция ПолучитьЗначениеПеречисления(ТипОбъектаXDTO, НоваяФабрикаXDTO, ИмяЭлемента, Знач ЗначениеПеречисления)
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПеречисления) Тогда 
		Возврат НоваяФабрикаXDTO.Создать(ТипОбъектаXDTO);
	КонецЕсли;
		
КонецФункции
