
Функция СубъектРФПоКодуСубъекта(КодСубъекта) Экспорт
	
	Макет = Обработки.ВводКонтактнойИнформации.ПолучитьМакет("РегионыРФ");
		
	СтрокаЗначения = Макет.НайтиТекст(КодСубъекта,,, Ложь);
	
	Если СтрокаЗначения <> Неопределено Тогда		
		Возврат Макет.Область(СтрокаЗначения.Верх, 2, СтрокаЗначения.Верх, 2).Текст;		
	Иначе
		ВызватьИсключение "Не найден регион по коду " + КодСубъекта;
	КонецЕсли;
	
КонецФункции

Функция СубъектРФПоНаименованию(Знач НаименованиеСубъекта) Экспорт
	
	Макет = Обработки.ВводКонтактнойИнформации.ПолучитьМакет("РегионыРФ");
	
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "г ", "");
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "г. ", "");
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "край", "");
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "Республика", "");
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "Респ", "");
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "область", "");
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "обл", "");
	НаименованиеСубъекта = СтрЗаменить(НаименованиеСубъекта, "обл.", "");
	
	НаименованиеСубъекта = СокрЛП(НаименованиеСубъекта);
	
	СтрокаЗначения = Макет.НайтиТекст(НаименованиеСубъекта,,, Ложь, Ложь);
	
	Если СтрокаЗначения <> Неопределено Тогда		
		Возврат Новый Структура("КодСубъекта, Субъект",
			Макет.Область(СтрокаЗначения.Верх, 1, СтрокаЗначения.Верх, 1).Текст,
			Макет.Область(СтрокаЗначения.Верх, 2, СтрокаЗначения.Верх, 2).Текст);
	Иначе
		ВызватьИсключение "Не найден регион по наименованию " + НаименованиеСубъекта;
	КонецЕсли;
	
КонецФункции
