Перем КратностьЕдиницыИзмерения;
Перем ФорматСуммы;

#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчетность в ПФР",
		"1.80",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
		
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

// Отчет об инвестировании средств пенсионных накоплений
#Область Инвестирование_средств_пенсионных_накоплений

Функция ПолучитьДанные_ИнвестированиеСредствПенсионныхНакоплений(ЕдиницаИзмерения = "Тысячи") Экспорт
	
	ПакетДанных = Новый Структура;     
	ПакетДанных.Вставить("ИмяОтчета"			, "ИнвестированиеСредствПенсионныхНакоплений");
	ПакетДанных.Вставить("Отчет"				, Новый Структура);
	
	ПакетОтчетность = Новый Структура;
	
	ИспользоватьДанныеБэкОфиса = ЭтотОбъект.Период.ДатаНачала >= '20190101';
	
	// Сумму начисленных процентов по депозитам получим как разницу между данными СЧА на конец и начало периода
	Проценты 				= 0;
	Проценты_СНачалаГода 	= 0;
	Если ИспользоватьДанныеБэкОфиса И ЭтотОбъект.Период.ДатаОкончания < '20250101' Тогда	
		Проценты 				= ПолучитьПроцентыПоДепозитуИзСЧА(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
		Проценты_СНачалаГода 	= ПолучитьПроцентыПоДепозитуИзСЧА(ЭтотОбъект.СчетДоверительногоУправления, НачалоГода(ЭтотОбъект.Период.ДатаНачала), ЭтотОбъект.Период.ДатаОкончания);
	КонецЕсли;
	
	ГруппыДоходовИРасходов = ПолучитьСоставГруппДоходовИРасходов(ИспользоватьДанныеБэкОфиса);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачала"						, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаНачалаГода"					, ?(Год(ЭтотОбъект.Период.ДатаНачала) <> Год(ЭтотОбъект.Период.ДатаОкончания), ЭтотОбъект.Период.ДатаНачала, НачалоГода(ЭтотОбъект.Период.ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания"					, КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация"						, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления"	, ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидПоказателя"   				, Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок);
	Запрос.УстановитьПараметр("Руководитель"					, "");
	Запрос.УстановитьПараметр("Контролер"						, "");
	Запрос.УстановитьПараметр("Тыс"								, ?(ЕдиницаИзмерения = "Тысячи", "Тыс. ", ""));
	Запрос.УстановитьПараметр("ФинансовыйРезультатОтРеализации"			, ГруппыДоходовИРасходов.ФинансовыйРезультатОтРеализации);
	Запрос.УстановитьПараметр("ДивидендыИПроцентыПоЦБ"					, ГруппыДоходовИРасходов.ДивидендыИПроцентыПоЦБ);
	Запрос.УстановитьПараметр("ПроцентыПоДепозитам"						, ГруппыДоходовИРасходов.ПроцентыПоДепозитам);
	Запрос.УстановитьПараметр("ФинансовыйРезультатОтПереоценкиАктивов"	, ГруппыДоходовИРасходов.ФинансовыйРезультатОтПереоценкиАктивов);
	Запрос.УстановитьПараметр("ДругиеВидыДоходов"						, ГруппыДоходовИРасходов.ДругиеВидыДоходов);
	Запрос.УстановитьПараметр("ОплатаУслугСпецДепозитария"				, ГруппыДоходовИРасходов.ОплатаУслугСпецДепозитария);
	Запрос.УстановитьПараметр("ОплатаУслугПрофУчастниковРынкаЦБ"		, ГруппыДоходовИРасходов.ОплатаУслугПрофУчастниковРынкаЦБ);
	Запрос.УстановитьПараметр("ОплатаУслугАудитора"						, ГруппыДоходовИРасходов.ОплатаУслугАудитора);
	Запрос.УстановитьПараметр("ВознаграждениеУправляющейКомпании"		, ГруппыДоходовИРасходов.ВознаграждениеУправляющейКомпании);
	Запрос.УстановитьПараметр("РасходыНаОбязательноеСтрахование"		, ГруппыДоходовИРасходов.РасходыНаОбязательноеСтрахование);
	Запрос.УстановитьПараметр("ОплатаПрочихУслуг"						, ГруппыДоходовИРасходов.ОплатаПрочихУслуг);
	Запрос.УстановитьПараметр("ИсключенныеДоходыИРасходы"				, ГруппыДоходовИРасходов.ИсключенныеДоходыИРасходы);
	Запрос.УстановитьПараметр("ИспользоватьДанныеБэкОфиса"				, ИспользоватьДанныеБэкОфиса);
	Запрос.УстановитьПараметр("ПроцентыПоДепозитамИзСЧА"				, Проценты);
	Запрос.УстановитьПараметр("ПроцентыПоДепозитамИзСЧА_СНачалаГода"	, Проценты_СНачалаГода);
	Запрос.УстановитьПараметр("КонецПредыдущегоГода"				    , КонецГода(ДобавитьМесяц(ЭтотОбъект.Период.ДатаОкончания, -12)));
	
	МассивВидовОперацийВводаАктивов = Новый Массив;
	МассивВидовОперацийВводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР);
	МассивВидовОперацийВводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление);
	
	Запрос.УстановитьПараметр("ВидыОперацийВводаАктивов", МассивВидовОперацийВводаАктивов); 
	
	МассивВидовОперацийВыводаАктивов = Новый Массив;
	МассивВидовОперацийВыводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению);
	МассивВидовОперацийВыводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР);
	
	Запрос.УстановитьПараметр("ВидыОперацийВыводаАктивов", МассивВидовОперацийВыводаАктивов); 
		
	ПакетОтчетаДоходностьОтИнвестирования = ПолучитьДанные_ДоходыОтИнвестированияСредствПенсионныхНакоплений(ЕдиницаИзмерения, Проценты, Проценты_СНачалаГода);
	ДоходОтИнвестирования = 0;
	ДоходОтИнвестирования_СНачалаГода = 0;
	ВознаграждениеУК = 0;
	ВознаграждениеУК_СНачалаГода = 0;
	Если ПакетОтчетаДоходностьОтИнвестирования.Отчет.Раздел1_ДоходыОтИнвестированияСредствПенсионныхНакоплений.Таб_Отчет.Количество() > 0 Тогда
		СтрокаДанных = ПакетОтчетаДоходностьОтИнвестирования.Отчет.Раздел1_ДоходыОтИнвестированияСредствПенсионныхНакоплений.Таб_Отчет[0];
		ДоходОтИнвестирования = СтрокаДанных.ДоходОтИнвестирования;
		ДоходОтИнвестирования_СНачалаГода = СтрокаДанных.ДоходОтИнвестирования_СНачалаГода;
		ВознаграждениеУК = СтрокаДанных.ВознаграждениеУправляющейКомпании;
		ВознаграждениеУК_СНачалаГода = СтрокаДанных.ВознаграждениеУправляющейКомпании_СНачалаГода;
	КонецЕсли;
	
	ПакетТаблица = Новый Структура;
	ДанныеОтчетаОбИнвестировании = ПолучитьДанные_ИнвестированиеСредствПенсионныхНакоплений_МассивСтрок(Запрос);
	ПроверкаСЧАВыполнена = Истина;
	Если ДанныеОтчетаОбИнвестировании.Количество() > 0 Тогда
		СтрокаДанныхОтчетаОбИнвестировании = ДанныеОтчетаОбИнвестировании[0];
		СтрокаДанныхОтчетаОбИнвестировании.Вставить("ФинРезультат", ДоходОтИнвестирования);
		СтрокаДанныхОтчетаОбИнвестировании.Вставить("ФинРезультат_СНачалаГода", ДоходОтИнвестирования_СНачалаГода);
		
		// Проверим регистрацию СЧА на начало и конец периода
		ДатыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ДатаЗаключения,ДатаРасторжения");
		
		Если ДатыДоговора.ДатаЗаключения <= ЭтотОбъект.Период.ДатаНачала 
				И СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивов = Null Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не зарегистрирована СЧА на начало периода отчета");
			ПакетДанных.Вставить("Отказ", Истина);
			Возврат ПакетДанных;
		ИначеЕсли СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивов = Null Тогда 
			СтрокаДанныхОтчетаОбИнвестировании.Вставить("СтоимЧистАктивов", 0);
		КонецЕсли;
		
		Если (ДатыДоговора.ДатаРасторжения = '00010101' Или КонецДня(ДатыДоговора.ДатаРасторжения) >= КонецДня(ЭтотОбъект.Период.ДатаОкончания)) 
				И СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивовНаКонецОтчПериода = Null Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не зарегистрирована СЧА на конец периода отчета");
			ПакетДанных.Вставить("Отказ", Истина);
			Возврат ПакетДанных;
		ИначеЕсли СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивовНаКонецОтчПериода = Null Тогда 
			СтрокаДанныхОтчетаОбИнвестировании.Вставить("СтоимЧистАктивовНаКонецОтчПериода", 0);
		КонецЕсли;
		
		// Проверяем итоги с начала года
		РасчетнаяСЧА = СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивов_НачалоГода 
								+ СтрокаДанныхОтчетаОбИнвестировании.ПоступлениеАктивов_СНачалаГода 
								+ СтрокаДанныхОтчетаОбИнвестировании.ФинРезультат_СНачалаГода 
								- СтрокаДанныхОтчетаОбИнвестировании.ИзъятиеАктивов_СНачалаГода 
								- СтрокаДанныхОтчетаОбИнвестировании.НеобходимыеРасходыУК_СНачалаГода
								- ВознаграждениеУК_СНачалаГода;
								
		СтоимЧистАктивовНаКонецОтчПериода = СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивовНаКонецОтчПериода;
		ПроверкаСЧАВыполнена = РасчетнаяСЧА = СтоимЧистАктивовНаКонецОтчПериода;
		
		СтрокаДанныхОтчетаОбИнвестировании.Вставить("ВознаграждениеУК", ВознаграждениеУК);
		СтрокаДанныхОтчетаОбИнвестировании.Вставить("ВознаграждениеУК_СНачалаГода", ВознаграждениеУК_СНачалаГода);
				
		Если Не ПроверкаСЧАВыполнена Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Зарегистрированная СЧА на конец периода (" + Формат(СтоимЧистАктивовНаКонецОтчПериода, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ") отличается от СЧА (" + Формат(РасчетнаяСЧА, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + "), рассчитанной по формуле 
			|<СЧА на начало года> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивов_НачалоГода,"ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
			|+ <Вводы активов с начала года> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.ПоступлениеАктивов_СНачалаГода, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
			|– <Выводы активов с начала года> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.ИзъятиеАктивов_СНачалаГода, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ") 
			|+ <Доход от инвестирования по бух. учету с начала года> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.ФинРезультат_СНачалаГода, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
			|- <Необходимые расходы УК с начала года> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.НеобходимыеРасходыУК_СНачалаГода, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
			|- <Вознаграждение УК с начала года> (" + Формат(ВознаграждениеУК_СНачалаГода, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")");
			СтрокаДанныхОтчетаОбИнвестировании.Вставить("СтоимЧистАктивовНаКонецОтчПериода", СтоимЧистАктивовНаКонецОтчПериода);
		КонецЕсли;  		
		
		// Проверяем итоги за отчетный квартал; если это первый квартал, не проверяем (итоги совпадают с итогами с начала года)		
		Если ЭтотОбъект.Период.ДатаНачала <> НачалоГода(ЭтотОбъект.Период.ДатаНачала) Тогда
			ПроверкаСЧАВыполнена = Истина;
			
			РасчетнаяСЧА = СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивов 
									+ СтрокаДанныхОтчетаОбИнвестировании.ПоступлениеАктивов 
									+ СтрокаДанныхОтчетаОбИнвестировании.ФинРезультат 
									- СтрокаДанныхОтчетаОбИнвестировании.ИзъятиеАктивов 
									- СтрокаДанныхОтчетаОбИнвестировании.НеобходимыеРасходыУК
									- ВознаграждениеУК;
			ПроверкаСЧАВыполнена = РасчетнаяСЧА = СтоимЧистАктивовНаКонецОтчПериода;
							
			Если Не ПроверкаСЧАВыполнена Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Зарегистрированная СЧА на конец периода (" + Формат(СтоимЧистАктивовНаКонецОтчПериода, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ") отличается от СЧА (" + Формат(РасчетнаяСЧА, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + "), рассчитанной по формуле 
				|<СЧА на начало периода> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.СтоимЧистАктивов,"ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
				|+ <Вводы активов> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.ПоступлениеАктивов, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
				|– <Выводы активов> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.ИзъятиеАктивов, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ") 
				|+ <Доход от инвестирования по бух. учету> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.ФинРезультат, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
				|- <Необходимые расходы УК> (" + Формат(СтрокаДанныхОтчетаОбИнвестировании.НеобходимыеРасходыУК, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")
				|- <Вознаграждение УК> (" + Формат(ВознаграждениеУК, "ЧДЦ=2; ЧН=0; ЧГ=3,0") + ")");
				СтрокаДанныхОтчетаОбИнвестировании.Вставить("СтоимЧистАктивовНаКонецОтчПериода", СтоимЧистАктивовНаКонецОтчПериода);
			КонецЕсли; 		
		КонецЕсли;	
			
	КонецЕсли;
							
	ПакетТаблица.Вставить("Таб_Отчет", ДанныеОтчетаОбИнвестировании);
		
	ПакетДанных.Отчет.Вставить("Раздел1_ИнвестированиеСредствПенсионныхНакоплений", ПакетТаблица);
	
	ПодписьРуководителяУКНПФ = Новый Структура;
	ПодписьРуководителяУКНПФ.Вставить("ФИО"	, ?(ЭтотОбъект.УказатьРуководителя, Лев(СокрЛП(ЭтотОбъект.Руководитель_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Руководитель_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Руководитель_Фамилия), Лев(СокрЛП(ЭтотОбъект.Исполнитель_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Исполнитель_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Исполнитель_Фамилия)));
	
	ПакетДанных.Отчет.Вставить("ПодписьРуководителяУКНПФ", ПодписьРуководителяУКНПФ);
	
	ПодписьУполномоченногоЛица = Новый Структура;
	ПодписьУполномоченногоЛица.Вставить("ФИО2"	, Лев(СокрЛП(ЭтотОбъект.Контролер_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Контролер_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Контролер_Фамилия));
	
	ПакетДанных.Отчет.Вставить("ПодписьУполномоченногоЛица", ПодписьУполномоченногоЛица);
	
	Возврат ПакетДанных;
	
КонецФункции
	
Функция ПолучитьДанные_ИнвестированиеСредствПенсионныхНакоплений_МассивСтрок(Запрос)
	
	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос.МенеджерВременныхТаблиц,, "_ДанныеКалендаря");
	Запрос.Текст = ПолучитьТекстЗапроса_ИнвестированиеСредствПенсионныхНакоплений();
	
	Пакет	= Запрос.ВыполнитьПакет();
	
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат").ПолучитьДанные().Выгрузить();
	
	ФорматныеСтроки = Новый Структура;
			
	Возврат СформироватьМассивСтрок(Данные, ФорматныеСтроки, "", , , Ложь);
	
КонецФункции

Процедура ЗаполнитьПечатнуюФорму_ИнвестированиеСредствПенсионныхНакоплений(Знач ПакетДанных, Результат, ЕдиницаИзмерения = "Тысячи") Экспорт
	
	ПакетОтчет = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из ПакетДанных.Отчет Цикл
		Если ЭлементСтруктуры.Ключ = "Раздел1_ИнвестированиеСредствПенсионныхНакоплений" Тогда
			ПакетОтчет.Вставить(ЭлементСтруктуры.Ключ, Новый Структура);
		Иначе	
			ПакетОтчет.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;	                                                              		
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры Из ПакетДанных.Отчет.Раздел1_ИнвестированиеСредствПенсионныхНакоплений Цикл
		ТекЗначение = ?(ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Массив"), ПереопределитьМассив(ЭлементСтруктуры.Значение), ЭлементСтруктуры.Значение);
		ПакетОтчет.Раздел1_ИнвестированиеСредствПенсионныхНакоплений.Вставить(ЭлементСтруктуры.Ключ, ТекЗначение);
	КонецЦикла;
			
	Результат.Очистить();
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Результат.Автомасштаб = Истина;
	
	Макет = ПолучитьМакет(ПакетДанных.ИмяОтчета);
	
	ОбластьШапка						= Макет.ПолучитьОбласть("Шапка");
		
	ОбластьШапка.Параметры.Период		= Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	Результат.Вывести(ОбластьШапка);
	
	ФорматныеСтроки = ПолучитьСтруктуруФорматныхСтрок("ИнвестированиеСредствПенсионныхНакоплений", ЕдиницаИзмерения);
	
 	ВывестиРаздел(,, "Раздел1_ИнвестированиеСредствПенсионныхНакоплений.Таб_Отчет", ПакетОтчет, Макет, Результат, ФорматныеСтроки);

	ОбластьПодвал						   		 = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.ФИОРуководителя      = ПакетОтчет.ПодписьРуководителяУКНПФ.ФИО; 	
	ОбластьПодвал.Параметры.ФИОУполномоченногоСД = ПакетОтчет.ПодписьУполномоченногоЛица.ФИО2;
	
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса_ИнвестированиеСредствПенсионныхНакоплений()
	
	#Область ТекстЗапроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|				ТОГДА 0
		|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиНаНачалоГода
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = НАЧАЛОПЕРИОДА(&КонецПредыдущегоГода, ДЕНЬ)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|				ТОГДА 0
		|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиНаНачалоОтчетногоКвартала
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|				ТОГДА 0
		|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиНаКонецОтчетногоКвартала
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг""
		|					ИНАЧЕ ""ДругиеВидыДоходов""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|				ИНАЧЕ ""ДругиеВидыДоходов""
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель,
		|	СУММА(ВЫБОР
		|			КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|					ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|				ТОГДА БухгалтерскийУчетОбороты.СуммаОборотКт
		|			ИНАЧЕ БухгалтерскийУчетОбороты.СуммаОборотДт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоДоход
		|ПОМЕСТИТЬ _РасходыОбщие
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка), ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|ГДЕ
		|	НЕ БухгалтерскийУчетОбороты.Субконто1 В (&ИсключенныеДоходыИРасходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг""
		|					ИНАЧЕ ""ДругиеВидыДоходов""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|				ИНАЧЕ ""ДругиеВидыДоходов""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ФинансовыйРезультатОтПереоценкиАктивов"",
		|	ВЫБОР
		|		КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|			ТОГДА 0
		|		ИНАЧЕ &ПроцентыПоДепозитамИзСЧА
		|	КОНЕЦ,
		|	ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДругиеВидыДоходов"",
		|	ЕСТЬNULL(_ОстаткиНаКонецОтчетногоКвартала.Сумма, 0) - ЕСТЬNULL(_ОстаткиНаНачалоОтчетногоКвартала.Сумма, 0),
		|	ИСТИНА
		|ИЗ
		|	_ОстаткиНаКонецОтчетногоКвартала КАК _ОстаткиНаКонецОтчетногоКвартала
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоОтчетногоКвартала КАК _ОстаткиНаНачалоОтчетногоКвартала
		|		ПО _ОстаткиНаКонецОтчетногоКвартала.СчетДоверительногоУправления = _ОстаткиНаНачалоОтчетногоКвартала.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|					ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|				ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель,
		|	СУММА(ВЫБОР
		|			КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|					ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|				ТОГДА БухгалтерскийУчетОбороты.СуммаОборотКт
		|			ИНАЧЕ БухгалтерскийУчетОбороты.СуммаОборотДт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоДоход
		|ПОМЕСТИТЬ _РасходыОбщие_СНачалаГода
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&ДатаНачалаГода,
		|			&ДатаОкончания,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка), ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|ГДЕ
		|	НЕ БухгалтерскийУчетОбороты.Субконто1 В (&ИсключенныеДоходыИРасходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|					ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|				ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода"",
		|	ВЫБОР
		|		КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|			ТОГДА 0
		|		ИНАЧЕ &ПроцентыПоДепозитамИзСЧА_СНачалаГода
		|	КОНЕЦ,
		|	ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДругиеВидыДоходов_СНачалаГода"",
		|	ЕСТЬNULL(_ОстаткиНаКонецОтчетногоКвартала.Сумма, 0) - ЕСТЬNULL(_ОстаткиНаНачалоГода.Сумма, 0),
		|	ИСТИНА
		|ИЗ
		|	_ОстаткиНаКонецОтчетногоКвартала КАК _ОстаткиНаКонецОтчетногоКвартала
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоГода КАК _ОстаткиНаНачалоГода
		|		ПО _ОстаткиНаКонецОтчетногоКвартала.СчетДоверительногоУправления = _ОстаткиНаНачалоГода.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасходыОбщие.Показатель КАК Показатель,
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|						И _РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"")
		|					ТОГДА -_РасходыОбщие.Сумма
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|					ТОГДА _РасходыОбщие.Сумма
		|				КОГДА _РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"", ""ВознаграждениеУправляющейКомпании"")
		|					ТОГДА _РасходыОбщие.Сумма
		|				ИНАЧЕ -_РасходыОбщие.Сумма
		|			КОНЕЦ, 0)) КАК Сумма
		|ПОМЕСТИТЬ _РасходыБУ
		|ИЗ
		|	_РасходыОбщие КАК _РасходыОбщие
		|ГДЕ
		|	НЕ _РасходыОбщие.Показатель ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасходыОбщие.Показатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_РасходыОбщие_СНачалаГода.Показатель,
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|						И _РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"")
		|					ТОГДА -_РасходыОбщие_СНачалаГода.Сумма
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|					ТОГДА _РасходыОбщие_СНачалаГода.Сумма
		|				КОГДА _РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"", ""ВознаграждениеУправляющейКомпании_СНачалаГода"")
		|					ТОГДА _РасходыОбщие_СНачалаГода.Сумма
		|				ИНАЧЕ -_РасходыОбщие_СНачалаГода.Сумма
		|			КОНЕЦ, 0))
		|ИЗ
		|	_РасходыОбщие_СНачалаГода КАК _РасходыОбщие_СНачалаГода
		|ГДЕ
		|	НЕ _РасходыОбщие_СНачалаГода.Показатель ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасходыОбщие_СНачалаГода.Показатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходОтИнвестирования"",
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|					ТОГДА _РасходыОбщие.Сумма
		|				ИНАЧЕ -_РасходыОбщие.Сумма
		|			КОНЕЦ, 0))
		|ИЗ
		|	_РасходыОбщие КАК _РасходыОбщие
		|ГДЕ
		|	НЕ _РасходыОбщие.Показатель ЕСТЬ NULL
		|	И НЕ _РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РасходыВсего"",
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|					ТОГДА -_РасходыОбщие.Сумма
		|				ИНАЧЕ _РасходыОбщие.Сумма
		|			КОНЕЦ, 0))
		|ИЗ
		|	_РасходыОбщие КАК _РасходыОбщие
		|ГДЕ
		|	_РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходОтИнвестирования_СНачалаГода"",
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|					ТОГДА _РасходыОбщие_СНачалаГода.Сумма
		|				ИНАЧЕ -_РасходыОбщие_СНачалаГода.Сумма
		|			КОНЕЦ, 0))
		|ИЗ
		|	_РасходыОбщие_СНачалаГода КАК _РасходыОбщие_СНачалаГода
		|ГДЕ
		|	НЕ _РасходыОбщие_СНачалаГода.Показатель ЕСТЬ NULL
		|	И НЕ _РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РасходыВсего_СНачалаГода"",
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|					ТОГДА -_РасходыОбщие_СНачалаГода.Сумма
		|				ИНАЧЕ _РасходыОбщие_СНачалаГода.Сумма
		|			КОНЕЦ, 0))
		|ИЗ
		|	_РасходыОбщие_СНачалаГода КАК _РасходыОбщие_СНачалаГода
		|ГДЕ
		|	_РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(-ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВводовВыводовАктивов,
		|	0 КАК СуммаВводовВыводовАктивов_СНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПоступлениеАктивов,
		|	0 КАК ПоступлениеАктивов_СНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИзъятиеАктивов,
		|	0 КАК ИзъятиеАктивов_СНачалаГода,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ВводыВыводыРазвернуто
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	СУММА(-ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачалаГода,
		|			&ДатаОкончания,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток * ЕСТЬNULL(КурсыВалют.Курс, 0) / ЕСТЬNULL(КурсыВалют.Кратность, 1),
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток * ЕСТЬNULL(КурсыВалют.Курс, 0) / ЕСТЬNULL(КурсыВалют.Кратность, 1),
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
		|			&ДатаОкончания,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВЫРАЗИТЬ(Основание КАК Документ.ПоручениеНаДвижениеДенежныхСредств).СпособПередачи <> ЗНАЧЕНИЕ(Перечисление.СпособыПередачиПоручений.ВнутренняяСистема)) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Валюта = КурсыВалют.Валюта
		|			И (КурсыВалют.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_ВводыВыводыРазвернуто.СуммаВводовВыводовАктивов) КАК СуммаВводовВыводовАктивов,
		|	СУММА(_ВводыВыводыРазвернуто.СуммаВводовВыводовАктивов_СНачалаГода) КАК СуммаВводовВыводовАктивов_СНачалаГода,
		|	СУММА(_ВводыВыводыРазвернуто.ПоступлениеАктивов) КАК ПоступлениеАктивов,
		|	СУММА(_ВводыВыводыРазвернуто.ПоступлениеАктивов_СНачалаГода) КАК ПоступлениеАктивов_СНачалаГода,
		|	СУММА(_ВводыВыводыРазвернуто.ИзъятиеАктивов) КАК ИзъятиеАктивов,
		|	СУММА(_ВводыВыводыРазвернуто.ИзъятиеАктивов_СНачалаГода) КАК ИзъятиеАктивов_СНачалаГода,
		|	_ВводыВыводыРазвернуто.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	_ВводыВыводыРазвернуто КАК _ВводыВыводыРазвернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВводыВыводыРазвернуто.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасходыБУ.Сумма КАК НеобходимыеРасходыУК,
		|	0 КАК НеобходимыеРасходыУК_СНачалаГода,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _РасходыИВознаграждениеУКРазвернуто
		|ИЗ
		|	_РасходыБУ КАК _РасходыБУ
		|ГДЕ
		|	_РасходыБУ.Показатель = ""РасходыВсего""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	_РасходыБУ.Сумма,
		|	&СчетДоверительногоУправления
		|ИЗ
		|	_РасходыБУ КАК _РасходыБУ
		|ГДЕ
		|	_РасходыБУ.Показатель = ""РасходыВсего_СНачалаГода""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_РасходыИВознаграждениеУКРазвернуто.НеобходимыеРасходыУК) КАК НеобходимыеРасходыУК,
		|	СУММА(_РасходыИВознаграждениеУКРазвернуто.НеобходимыеРасходыУК_СНачалаГода) КАК НеобходимыеРасходыУК_СНачалаГода,
		|	_РасходыИВознаграждениеУКРазвернуто.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _РасходыИВознаграждениеУК
		|ИЗ
		|	_РасходыИВознаграждениеУКРазвернуто КАК _РасходыИВознаграждениеУКРазвернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасходыИВознаграждениеУКРазвернуто.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК ПолнНаимУК,
		|	РеквизитыОрганизации.ИНН КАК ИНН_УК,
		|	РеквизитыОрганизации.КПП КАК КПП_УК,
		|	РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК ПолноеНаименНПФ,
		|	РеквизитыКлиента.ИНН КАК ИНН_НПФ,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключДоговора,
		|	_ВводыВыводы.ПоступлениеАктивов КАК ПоступлениеАктивов,
		|	_ВводыВыводы.ПоступлениеАктивов_СНачалаГода КАК ПоступлениеАктивов_СНачалаГода,
		|	_ВводыВыводы.ИзъятиеАктивов КАК ИзъятиеАктивов,
		|	_ВводыВыводы.ИзъятиеАктивов_СНачалаГода КАК ИзъятиеАктивов_СНачалаГода,
		|	ФинансовыеПоказатели_НачалоГода.Значение КАК СтоимЧистАктивов_НачалоГода,
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК СтоимЧистАктивов,
		|	ФинансовыеПоказатели_ОтчетнаяДата.Значение КАК СтоимЧистАктивовНаКонецОтчПериода,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	_РасходыИВознаграждениеУК.НеобходимыеРасходыУК КАК НеобходимыеРасходыУК,
		|	_РасходыИВознаграждениеУК.НеобходимыеРасходыУК_СНачалаГода КАК НеобходимыеРасходыУК_СНачалаГода,
		|	ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) - ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов, 0) + ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов, 0) + ЕСТЬNULL(_РасходыИВознаграждениеУК.НеобходимыеРасходыУК, 0) КАК ФинРезультат,
		|	ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0) - ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов_СНачалаГода, 0) + ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов_СНачалаГода, 0) + ЕСТЬNULL(_РасходыИВознаграждениеУК.НеобходимыеРасходыУК_СНачалаГода, 0) КАК ФинРезультат_СНачалаГода
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&ДатаОкончания,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиента
		|		ПО (РеквизитыКлиента.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО (РеквизитыОрганизации.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_ОтчетнаяДата
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели_ОтчетнаяДата.СубъектАналитики
		|			И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели_ОтчетнаяДата.Организация
		|			И (ФинансовыеПоказатели_ОтчетнаяДата.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|			И (ФинансовыеПоказатели_ОтчетнаяДата.ВидПоказателя = &ВидПоказателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_НачалоГода
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели_НачалоГода.СубъектАналитики
		|			И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели_НачалоГода.Организация
		|			И (ФинансовыеПоказатели_НачалоГода.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ), ДЕНЬ, -1))
		|			И (ФинансовыеПоказатели_НачалоГода.ВидПоказателя = &ВидПоказателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|				КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1), ДЕНЬ),
		|				Организация = &Организация
		|					И ВидПоказателя = &ВидПоказателя) КАК ФинансовыеПоказатели
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
		|			И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыИВознаграждениеУК КАК _РасходыИВознаграждениеУК
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = _РасходыИВознаграждениеУК.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = _ВводыВыводы.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу,
		|	РеквизитыОрганизации.ИНН,
		|	РеквизитыОрганизации.КПП,
		|	РеквизитыКлиента.ПолноеНаименованиеПоУставу,
		|	РеквизитыКлиента.ИНН,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения,
		|	ФинансовыеПоказатели_НачалоГода.Значение,
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0),
		|	ФинансовыеПоказатели_ОтчетнаяДата.Значение,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	_ВводыВыводы.ПоступлениеАктивов,
		|	_ВводыВыводы.ПоступлениеАктивов_СНачалаГода,
		|	_ВводыВыводы.ИзъятиеАктивов,
		|	_ВводыВыводы.ИзъятиеАктивов_СНачалаГода,
		|	_РасходыИВознаграждениеУК.НеобходимыеРасходыУК,
		|	_РасходыИВознаграждениеУК.НеобходимыеРасходыУК_СНачалаГода,
		|	ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) - ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов, 0) + ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов, 0) + ЕСТЬNULL(_РасходыИВознаграждениеУК.НеобходимыеРасходыУК, 0),
		|	ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0) - ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов_СНачалаГода, 0) + ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов_СНачалаГода, 0) + ЕСТЬNULL(_РасходыИВознаграждениеУК.НеобходимыеРасходыУК_СНачалаГода, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.ПолнНаимУК КАК ПолнНаимУК,
		|	ВТ_Данные.ИНН_УК КАК ИНН_УК,
		|	ВТ_Данные.КПП_УК КАК КПП_УК,
		|	ВТ_Данные.ИНН_УК + ""/"" + ВТ_Данные.КПП_УК КАК ПечИННКПП,
		|	ВТ_Данные.ПолноеНаименНПФ КАК ПолноеНаименНПФ,
		|	ВТ_Данные.ИНН_НПФ КАК ИНН_НПФ,
		|	ВТ_Данные.НомерДоговораУправления КАК НомерДоговораУправления,
		|	ВТ_Данные.ДатаЗаключДоговора КАК ДатаЗаключДоговора,
		|	&Тыс КАК Тыс,
		|	ЕСТЬNULL(ВТ_Данные.ПоступлениеАктивов, 0) КАК ПоступлениеАктивов,
		|	ЕСТЬNULL(ВТ_Данные.ПоступлениеАктивов_СНачалаГода, 0) КАК ПоступлениеАктивов_СНачалаГода,
		|	ЕСТЬNULL(ВТ_Данные.ИзъятиеАктивов, 0) КАК ИзъятиеАктивов,
		|	ЕСТЬNULL(ВТ_Данные.СтоимЧистАктивов, 0) КАК СтоимЧистАктивов,
		|	ЕСТЬNULL(ВТ_Данные.ИзъятиеАктивов_СНачалаГода, 0) КАК ИзъятиеАктивов_СНачалаГода,
		|	ВТ_Данные.СтоимЧистАктивов_НачалоГода КАК СтоимЧистАктивов_НачалоГода,
		|	ВТ_Данные.СтоимЧистАктивовНаКонецОтчПериода КАК СтоимЧистАктивовНаКонецОтчПериода,
		|	ЕСТЬNULL(ВТ_Данные.НеобходимыеРасходыУК, 0) КАК НеобходимыеРасходыУК,
		|	ЕСТЬNULL(ВТ_Данные.НеобходимыеРасходыУК_СНачалаГода, 0) КАК НеобходимыеРасходыУК_СНачалаГода,
		|	ЕСТЬNULL(ВТ_Данные.ФинРезультат, 0) КАК ФинРезультат,
		|	ЕСТЬNULL(ВТ_Данные.ФинРезультат_СНачалаГода, 0) КАК ФинРезультат_СНачалаГода,
		|	КВАРТАЛ(&ДатаОкончания) КАК Квартал,
		|	ГОД(&ДатаОкончания) КАК Год
		|ПОМЕСТИТЬ _Результат
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Руководитель КАК RukovodUKFIO
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Контролер КАК UpolnLiczoSpecDepFIO,
		|	ВТ_Данные.ПолноеНаименНПФ КАК ID_NPFTaxis
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
	    				
#КонецОбласти

	Возврат ТекстЗапроса;
	
КонецФункции	

#КонецОбласти

// Отчет о доходах от инвестирования средств пенсионных накоплений
#Область Доходы_от_инвестирования_средств_пенсионных_накоплений

Процедура ПодготовитьДанныеДляЗапроса(Запрос, ЕдиницаИзмерения, ПроцентыПоДепозитамИзСЧА = Неопределено, ПроцентыПоДепозитамИзСЧА_СНачалаГода = Неопределено)
	
	ИспользоватьДанныеБэкОфиса = ЭтотОбъект.Период.ДатаНачала >= '20190101';
	
	// Сумму начисленных процентов по депозитам получим как разницу между данными СЧА на конец и начало периода
	Если ПроцентыПоДепозитамИзСЧА = Неопределено И ИспользоватьДанныеБэкОфиса И ЭтотОбъект.Период.ДатаОкончания < '20250101' Тогда
		ПроцентыПоДепозитамИзСЧА = ПолучитьПроцентыПоДепозитуИзСЧА(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
		ПроцентыПоДепозитамИзСЧА_СНачалаГода = ПолучитьПроцентыПоДепозитуИзСЧА(ЭтотОбъект.СчетДоверительногоУправления, НачалоГода(ЭтотОбъект.Период.ДатаНачала), ЭтотОбъект.Период.ДатаОкончания);
	КонецЕсли;
	
	ПакетОтчетность = Новый Структура;
		
	ГруппыДоходовИРасходов = ПолучитьСоставГруппДоходовИРасходов(ИспользоватьДанныеБэкОфиса);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачала"								, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаНачалаГода"							, ?(Год(ЭтотОбъект.Период.ДатаНачала) <> Год(ЭтотОбъект.Период.ДатаОкончания), ЭтотОбъект.Период.ДатаНачала, НачалоГода(ЭтотОбъект.Период.ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания"							, КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация"								, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления"			, ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидПоказателя"   						, Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок);
	
	Запрос.УстановитьПараметр("ФинансовыйРезультатОтРеализации"			, ГруппыДоходовИРасходов.ФинансовыйРезультатОтРеализации);
	Запрос.УстановитьПараметр("ДивидендыИПроцентыПоЦБ"					, ГруппыДоходовИРасходов.ДивидендыИПроцентыПоЦБ);
	Запрос.УстановитьПараметр("ПроцентыПоДепозитам"						, ГруппыДоходовИРасходов.ПроцентыПоДепозитам);
	Запрос.УстановитьПараметр("ФинансовыйРезультатОтПереоценкиАктивов"	, ГруппыДоходовИРасходов.ФинансовыйРезультатОтПереоценкиАктивов);
	Запрос.УстановитьПараметр("ДругиеВидыДоходов"						, ГруппыДоходовИРасходов.ДругиеВидыДоходов);
	Запрос.УстановитьПараметр("ОплатаУслугСпецДепозитария"				, ГруппыДоходовИРасходов.ОплатаУслугСпецДепозитария);
	Запрос.УстановитьПараметр("ОплатаУслугПрофУчастниковРынкаЦБ"		, ГруппыДоходовИРасходов.ОплатаУслугПрофУчастниковРынкаЦБ);
	Запрос.УстановитьПараметр("ОплатаУслугАудитора"						, ГруппыДоходовИРасходов.ОплатаУслугАудитора);
	Запрос.УстановитьПараметр("ВознаграждениеУправляющейКомпании"		, ГруппыДоходовИРасходов.ВознаграждениеУправляющейКомпании);
	Запрос.УстановитьПараметр("РасходыНаОбязательноеСтрахование"		, ГруппыДоходовИРасходов.РасходыНаОбязательноеСтрахование);
	Запрос.УстановитьПараметр("ОплатаПрочихУслуг"						, ГруппыДоходовИРасходов.ОплатаПрочихУслуг);
	Запрос.УстановитьПараметр("ИсключенныеДоходыИРасходы"				, ГруппыДоходовИРасходов.ИсключенныеДоходыИРасходы);
	
	Запрос.УстановитьПараметр("СтавкаВознаграждения"					, ЭтотОбъект.СтавкаВознагражденияУК);
	Запрос.УстановитьПараметр("СтавкаСпецдепозитария"					, ЭтотОбъект.СтавкаУслугСпецдепозитария);		
	Запрос.УстановитьПараметр("Руководитель"							, "");
	Запрос.УстановитьПараметр("Контролер"								, "");
	Запрос.УстановитьПараметр("Тыс"										, ?(ЕдиницаИзмерения = "Тысячи", "Тыс. ", ""));
	Запрос.УстановитьПараметр("ИспользоватьДанныеБэкОфиса"				, ИспользоватьДанныеБэкОфиса);
	Запрос.УстановитьПараметр("ПроцентыПоДепозитамИзСЧА"				, ?(ПроцентыПоДепозитамИзСЧА = Неопределено, 0, ПроцентыПоДепозитамИзСЧА));
	Запрос.УстановитьПараметр("ПроцентыПоДепозитамИзСЧА_СНачалаГода"	, ?(ПроцентыПоДепозитамИзСЧА_СНачалаГода = Неопределено, 0, ПроцентыПоДепозитамИзСЧА_СНачалаГода));
	Запрос.УстановитьПараметр("КонецПредыдущегоКвартала"				, КонецКвартала(ДобавитьМесяц(ЭтотОбъект.Период.ДатаОкончания, -3)));
	Запрос.УстановитьПараметр("КонецПредыдущегоГода"				    , КонецГода(ДобавитьМесяц(ЭтотОбъект.Период.ДатаОкончания, -12)));
	
	МассивВидовОперацийВводаАктивов = Новый Массив;
	МассивВидовОперацийВводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР);
	МассивВидовОперацийВводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление);
	
	Запрос.УстановитьПараметр("ВидыОперацийВводаАктивов", МассивВидовОперацийВводаАктивов); 
	
	МассивВидовОперацийВыводаАктивов = Новый Массив;
	МассивВидовОперацийВыводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению);
	МассивВидовОперацийВыводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР);
	
	Запрос.УстановитьПараметр("ВидыОперацийВыводаАктивов", МассивВидовОперацийВыводаАктивов); 
	
	Справочники.Календари.ПоместитьВЗапросДанныеКалендаря(
		ЭтотОбъект.СчетДоверительногоУправления, 
		ЭтотОбъект.ДатаОтчетности,
		Справочники.Календари.Общероссийский,
		Неопределено,
		НачалоГода(ЭтотОбъект.Период.ДатаНачала),
		ЭтотОбъект.Период.ДатаОкончания,
		Запрос.МенеджерВременныхТаблиц,
		"_ДанныеКалендаря",
		Истина);

КонецПроцедуры

Функция ПолучитьДанные_ДоходыОтИнвестированияСредствПенсионныхНакоплений(ЕдиницаИзмерения = "Тысячи", ПроцентыПоДепозитамИзСЧА = Неопределено, ПроцентыПоДепозитамИзСЧА_СНачалаГода = Неопределено) Экспорт
	
	ПакетДанных = Новый Структура;     
	ПакетДанных.Вставить("ИмяОтчета"			, "ДоходыОтИнвестированияСредствПенсионныхНакоплений");
	ПакетДанных.Вставить("Отчет"				, Новый Структура);
	
	Запрос = Новый Запрос;
	ПодготовитьДанныеДляЗапроса(Запрос, ЕдиницаИзмерения, ПроцентыПоДепозитамИзСЧА, ПроцентыПоДепозитамИзСЧА_СНачалаГода);
	
	ПакетТаблица = Новый Структура;

	ПакетТаблица.Вставить("Таб_Отчет", ПолучитьДанные_ДоходыОтИнвестированияСредствПенсионныхНакоплений_МассивСтрок(Запрос));
		
	ПакетДанных.Отчет.Вставить("Раздел1_ДоходыОтИнвестированияСредствПенсионныхНакоплений", ПакетТаблица);
	
	ПодписьРуководителяУКНПФ = Новый Структура;
	ПодписьРуководителяУКНПФ.Вставить("ФИО"	, ?(ЭтотОбъект.УказатьРуководителя, Лев(СокрЛП(ЭтотОбъект.Руководитель_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Руководитель_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Руководитель_Фамилия), Лев(СокрЛП(ЭтотОбъект.Исполнитель_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Исполнитель_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Исполнитель_Фамилия)));
	
	ПакетДанных.Отчет.Вставить("ПодписьРуководителяУКНПФ", ПодписьРуководителяУКНПФ);
	
	ПодписьУполномоченногоЛица = Новый Структура;
	ПодписьУполномоченногоЛица.Вставить("ФИО2"	, Лев(СокрЛП(ЭтотОбъект.Контролер_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Контролер_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Контролер_Фамилия));
	
	ПакетДанных.Отчет.Вставить("ПодписьУполномоченногоЛица", ПодписьУполномоченногоЛица);
	
	Возврат ПакетДанных;
	
КонецФункции
	
Функция ПолучитьДанные_ДоходыОтИнвестированияСредствПенсионныхНакоплений_МассивСтрок(Запрос)	
	
	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос.МенеджерВременныхТаблиц,, "_ДанныеКалендаря");
	Запрос.Текст = ПолучитьТекстЗапроса_ДоходыОтИнвестированияСредствПенсионныхНакоплений();
	
	МассивДанных = Новый Массив;
	
	ФорматныеСтроки = Новый Структура;
			
	Пакет	= Запрос.ВыполнитьПакет();
	//Данные	= Пакет[16].Выгрузить(); 
	
	// данные по месяцам
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат_ДанныеПоМесяцам").ПолучитьДанные().Выгрузить();
	
	МассивДанных = СформироватьМассивСтрок(Данные, ФорматныеСтроки, "", , , Ложь);
		
	//Данные = Пакет[18].Выгрузить();
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат_ДоходыРасходы").ПолучитьДанные().Выгрузить();
	
	Для Каждого СтрокаДанных Из Данные Цикл  		
		МассивДанных[0].Вставить(СтрокаДанных.Показатель, СтрокаДанных.Сумма);
	КонецЦикла;

	//Данные = Пакет[19].Выгрузить();
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат_Реквизиты").ПолучитьДанные().Выгрузить();
	
	ФорматныеСтроки = Новый Структура;
	МассивСтрок = СформироватьМассивСтрок(Данные, ФорматныеСтроки, "", , , Ложь);
	Для Каждого СтрокаДанных Из МассивСтрок[0] Цикл  		
		МассивДанных[0].Вставить(СтрокаДанных.Ключ, СтрокаДанных.Значение);
	КонецЦикла;
	
	//Данные = Пакет[20].Выгрузить();
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат_ВводАктивов").ПолучитьДанные().Выгрузить();
	Если Данные.Количество() > 0 Тогда
	    СтрокаДанных = Данные[0];
		МассивДанных[0].Вставить("СуммаВводаАктивов", Данные[0].СуммаВводаАктивов);	
	КонецЕсли;
	
	//Данные = Пакет[17].Выгрузить();
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат_СЧА").ПолучитьДанные().Выгрузить();
	
	ДополнитьСтруктуруОтсутствующимиСвойствами(МассивДанных[0]);
	
	СредняяСЧА 							= 0;
	СредняяСЧАЗаВычетомВводовВыводов 	= 0;
	Если Данные.Количество() > 0 Тогда
		СтрокаДанных = Данные[0];		
		СредняяСЧА = Окр(СтрокаДанных.СЧА / СтрокаДанных.Количество, 2, 1); 	
		СредняяСЧАЗаВычетомВводовВыводов = Окр(СтрокаДанных.СЧАБезУчетаВновьПоступившихСредств / СтрокаДанных.Количество, 2, 1); 	
	КонецЕсли;	
	
	// Учтем среднюю СЧА в предельных суммах вознаграждения УК и расходов на спецдеп
	МассивДанных[0].Вставить("СуммаВознаграждения", 	МассивДанных[0].СуммаВознаграждения + Окр(СредняяСЧАЗаВычетомВводовВыводов * ЭтотОбъект.СтавкаВознагражденияУК / 100, 2, 1));
	МассивДанных[0].Вставить("СуммаРасходовНаСпецдеп",	МассивДанных[0].СуммаРасходовНаСпецдеп + Окр(СредняяСЧАЗаВычетомВводовВыводов * ЭтотОбъект.СтавкаУслугСпецдепозитария / 100, 2, 1));
	
	МассивДанных[0].Вставить("СредняяСЧАЗаВычетомВводовВыводов", СредняяСЧАЗаВычетомВводовВыводов);
	
	РазницаПоРасходамУК						= 0;
	РазницаПоРасходамСпецдепа				= 0;
	ДоходОтИнвестированияВПроцентахОтСЧА    = 0;
	ВознаграждениеУКВПроцентахОтДохода		= 0;
	ВознаграждениеУКВПроцентахКОтСЧА        = 0;
	
	РазницаПоРасходамУК = МассивДанных[0].СуммаВознаграждения - МассивДанных[0].РасходыВсего_СНачалаГода;
	РазницаПоРасходамСпецдепа = МассивДанных[0].СуммаРасходовНаСпецдеп - МассивДанных[0].ОплатаУслугСпецДепозитария_СНачалаГода;
	ДоходОтИнвестированияВПроцентахОтСЧА = ?(СредняяСЧА = 0, 0, Окр(МассивДанных[0].ДоходОтИнвестирования_СНачалаГода / СредняяСЧА * 100, 2, 1));
	
	Если МассивДанных[0].Свойство("ВознаграждениеУправляющейКомпании_СНачалаГода") Тогда
		ВознаграждениеУКВПроцентахОтДохода = Окр(МассивДанных[0].ВознаграждениеУправляющейКомпании_СНачалаГода / МассивДанных[0].ДоходОтИнвестирования_СНачалаГода * 100, 2, 1);
		ВознаграждениеУКВПроцентахКОтСЧА = ?(СредняяСЧА = 0, 0, Окр(МассивДанных[0].ВознаграждениеУправляющейКомпании_СНачалаГода  / СредняяСЧА * 100, 2, 1));
	КонецЕсли;	
		
	МассивДанных[0].Вставить("РазницаПоРасходамУК", 					РазницаПоРасходамУК);
	МассивДанных[0].Вставить("РазницаПоРасходамСпецдепа", 				РазницаПоРасходамСпецдепа);
	МассивДанных[0].Вставить("ДоходОтИнвестированияВПроцентахОтСЧА",	ДоходОтИнвестированияВПроцентахОтСЧА);
	МассивДанных[0].Вставить("ВознаграждениеУКВПроцентахОтДохода", 		ВознаграждениеУКВПроцентахОтДохода);
	МассивДанных[0].Вставить("ВознаграждениеУКВПроцентахКОтСЧА", 		ВознаграждениеУКВПроцентахКОтСЧА);
				
	Возврат МассивДанных; 
	
КонецФункции

Функция ПолучитьТекстЗапроса_ДоходыОтИнвестированияСредствПенсионныхНакоплений()
	
#Область ТекстЗапроса

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ЕСТЬNULL(ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВводаАктивов,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК Дата
		|ПОМЕСТИТЬ _ВводыПоДатам
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачалаГода,
		|			&ДатаОкончания,
		|			День,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ВводыПоДатам.СуммаВводаАктивов <> 0
		|			ТОГДА ВЫРАЗИТЬ(_ВводыПоДатам.СуммаВводаАктивов * &СтавкаВознаграждения / 100 * (РАЗНОСТЬДАТ(_ВводыПоДатам.Дата, КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД), КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) КАК ЧИСЛО(19, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВознаграждения,
		|	_ВводыПоДатам.Дата КАК Дата
		|ПОМЕСТИТЬ _ВознаграждениеОтВводовПоДатам
		|ИЗ
		|	_ВводыПоДатам КАК _ВводыПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ВводыПоДатам.СуммаВводаАктивов <> 0
		|			ТОГДА ВЫРАЗИТЬ(_ВводыПоДатам.СуммаВводаАктивов * &СтавкаСпецдепозитария / 100 * (РАЗНОСТЬДАТ(_ВводыПоДатам.Дата, КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД), КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) КАК ЧИСЛО(19, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРасходовНаСпецдеп,
		|	_ВводыПоДатам.Дата КАК Дата
		|ПОМЕСТИТЬ _РасходыНаСпецдепОтВводовПоДатам
		|ИЗ
		|	_ВводыПоДатам КАК _ВводыПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(-ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВводовВыводовАктивов,
		|	0 КАК СуммаВводовВыводовАктивов_СНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПоступлениеАктивов,
		|	0 КАК ПоступлениеАктивов_СНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИзъятиеАктивов,
		|	0 КАК ИзъятиеАктивов_СНачалаГода,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ВводыВыводыРазвернуто
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	СУММА(-ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачалаГода,
		|			&ДатаОкончания,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты_СНачалаГода.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток * ЕСТЬNULL(КурсыВалют.Курс, 0) / ЕСТЬNULL(КурсыВалют.Кратность, 1),
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток * ЕСТЬNULL(КурсыВалют.Курс, 0) / ЕСТЬNULL(КурсыВалют.Кратность, 1),
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
		|			&ДатаОкончания,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВЫРАЗИТЬ(Основание КАК Документ.ПоручениеНаДвижениеДенежныхСредств).СпособПередачи <> ЗНАЧЕНИЕ(Перечисление.СпособыПередачиПоручений.ВнутренняяСистема)) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Валюта = КурсыВалют.Валюта
		|			И (КурсыВалют.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_ВводыВыводыРазвернуто.СуммаВводовВыводовАктивов) КАК СуммаВводовВыводовАктивов,
		|	СУММА(_ВводыВыводыРазвернуто.СуммаВводовВыводовАктивов_СНачалаГода) КАК СуммаВводовВыводовАктивов_СНачалаГода,
		|	СУММА(_ВводыВыводыРазвернуто.ПоступлениеАктивов) КАК ПоступлениеАктивов,
		|	СУММА(_ВводыВыводыРазвернуто.ПоступлениеАктивов_СНачалаГода) КАК ПоступлениеАктивов_СНачалаГода,
		|	СУММА(_ВводыВыводыРазвернуто.ИзъятиеАктивов) КАК ИзъятиеАктивов,
		|	СУММА(_ВводыВыводыРазвернуто.ИзъятиеАктивов_СНачалаГода) КАК ИзъятиеАктивов_СНачалаГода,
		|	_ВводыВыводыРазвернуто.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	_ВводыВыводыРазвернуто КАК _ВводыВыводыРазвернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВводыВыводыРазвернуто.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|				ТОГДА ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеобходимыеРасходыУК,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|				ТОГДА ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВознаграждениеУК,
		|	0 КАК НеобходимыеРасходыУК_СНачалаГода,
		|	0 КАК ВознаграждениеУК_СНачалаГода,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _РасходыИВознаграждениеУКРазвернуто
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.УслугиДоверительногоУправления), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Прочее))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты_СНачалаГода.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|				ТОГДА ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОбороты_СНачалаГода.СуммаРасход, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты_СНачалаГода.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|				ТОГДА ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОбороты_СНачалаГода.СуммаРасход, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	ЗадолженностиПоДенежнымСредствамОбороты_СНачалаГода.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&ДатаНачалаГода,
		|			&ДатаОкончания,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.УслугиДоверительногоУправления), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Прочее))) КАК ЗадолженностиПоДенежнымСредствамОбороты_СНачалаГода
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты_СНачалаГода.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_РасходыИВознаграждениеУКРазвернуто.НеобходимыеРасходыУК) КАК НеобходимыеРасходыУК,
		|	СУММА(_РасходыИВознаграждениеУКРазвернуто.ВознаграждениеУК) КАК ВознаграждениеУК,
		|	СУММА(_РасходыИВознаграждениеУКРазвернуто.НеобходимыеРасходыУК_СНачалаГода) КАК НеобходимыеРасходыУК_СНачалаГода,
		|	СУММА(_РасходыИВознаграждениеУКРазвернуто.ВознаграждениеУК_СНачалаГода) КАК ВознаграждениеУК_СНачалаГода,
		|	_РасходыИВознаграждениеУКРазвернуто.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _РасходыИВознаграждениеУК
		|ИЗ
		|	_РасходыИВознаграждениеУКРазвернуто КАК _РасходыИВознаграждениеУКРазвернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасходыИВознаграждениеУКРазвернуто.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|				ТОГДА 0
		|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиНаНачалоГода
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = НАЧАЛОПЕРИОДА(&КонецПредыдущегоГода, ДЕНЬ)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|				ТОГДА 0
		|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиНаНачалоОтчетногоКвартала
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|				ТОГДА 0
		|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиНаКонецОтчетногоКвартала
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	т1.ПолнНаимУК КАК ПолнНаимУК,
		|	т1.ИНН_УК КАК ИНН_УК,
		|	т1.КПП_УК КАК КПП_УК,
		|	т1.ПолноеНаименНПФ КАК ПолноеНаименНПФ,
		|	т1.ИНН_НПФ КАК ИНН_НПФ,
		|	т1.НомерДоговораУправления КАК НомерДоговораУправления,
		|	т1.ДатаЗаключДоговора КАК ДатаЗаключДоговора,
		|	ЕСТЬNULL(т1.ПоступлениеАктивов, 0) КАК ПоступлениеАктивов,
		|	ЕСТЬNULL(т1.ПоступлениеАктивов_СНачалаГода, 0) КАК ПоступлениеАктивов_СНачалаГода,
		|	ЕСТЬNULL(т1.ИзъятиеАктивов, 0) КАК ИзъятиеАктивов,
		|	ЕСТЬNULL(т1.ИзъятиеАктивов_СНачалаГода, 0) КАК ИзъятиеАктивов_СНачалаГода,
		|	ЕСТЬNULL(т1.СтоимЧистАктивов_НачалоГода, 0) КАК СтоимЧистАктивов_НачалоГода,
		|	ЕСТЬNULL(т1.СтоимЧистАктивов, 0) КАК СтоимЧистАктивов,
		|	ЕСТЬNULL(т1.СтоимЧистАктивовНаКонецОтчПериода, 0) КАК СтоимЧистАктивовНаКонецОтчПериода,
		|	т1.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	т1.Клиент КАК Клиент,
		|	ЕСТЬNULL(т1.НеобходимыеРасходыУК, 0) КАК НеобходимыеРасходыУК,
		|	ЕСТЬNULL(т1.НеобходимыеРасходыУК_СНачалаГода, 0) КАК НеобходимыеРасходыУК_СНачалаГода,
		|	ЕСТЬNULL(т1.ВознаграждениеУК, 0) КАК ВознаграждениеУК,
		|	ЕСТЬNULL(т1.ВознаграждениеУК_СНачалаГода, 0) КАК ВознаграждениеУК_СНачалаГода,
		|	ЕСТЬNULL(т1.ФинРезультат, 0) КАК ФинРезультат,
		|	ЕСТЬNULL(т1.ФинРезультат_СНачалаГода, 0) КАК ФинРезультат_СНачалаГода
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК ПолнНаимУК,
		|		РеквизитыОрганизации.ИНН КАК ИНН_УК,
		|		РеквизитыОрганизации.КПП КАК КПП_УК,
		|		РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК ПолноеНаименНПФ,
		|		РеквизитыКлиента.ИНН КАК ИНН_НПФ,
		|		КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораУправления,
		|		КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключДоговора,
		|		_ВводыВыводы.ПоступлениеАктивов КАК ПоступлениеАктивов,
		|		_ВводыВыводы.ПоступлениеАктивов_СНачалаГода КАК ПоступлениеАктивов_СНачалаГода,
		|		_ВводыВыводы.ИзъятиеАктивов КАК ИзъятиеАктивов,
		|		_ВводыВыводы.ИзъятиеАктивов_СНачалаГода КАК ИзъятиеАктивов_СНачалаГода,
		|		ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0) КАК СтоимЧистАктивов_НачалоГода,
		|		ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК СтоимЧистАктивов,
		|		ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) КАК СтоимЧистАктивовНаКонецОтчПериода,
		|		КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|		_РасходыИВознаграждениеУК.НеобходимыеРасходыУК КАК НеобходимыеРасходыУК,
		|		_РасходыИВознаграждениеУК.НеобходимыеРасходыУК_СНачалаГода КАК НеобходимыеРасходыУК_СНачалаГода,
		|		_РасходыИВознаграждениеУК.ВознаграждениеУК КАК ВознаграждениеУК,
		|		_РасходыИВознаграждениеУК.ВознаграждениеУК_СНачалаГода КАК ВознаграждениеУК_СНачалаГода,
		|		ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) + ЕСТЬNULL(_ВводыВыводы.СуммаВводовВыводовАктивов, 0) КАК ФинРезультат,
		|		ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0) + ЕСТЬNULL(_ВводыВыводы.СуммаВводовВыводовАктивов_СНачалаГода, 0) КАК ФинРезультат_СНачалаГода
		|	ИЗ
		|		РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&ДатаОкончания,
		|				СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|					&ДатаОкончания,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиента
		|			ПО (РеквизитыКлиента.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|					&ДатаОкончания,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|			ПО (РеквизитыОрганизации.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_ОтчетнаяДата
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели_ОтчетнаяДата.СубъектАналитики
		|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели_ОтчетнаяДата.Организация
		|				И (ФинансовыеПоказатели_ОтчетнаяДата.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|				И (ФинансовыеПоказатели_ОтчетнаяДата.ВидПоказателя = &ВидПоказателя)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_НачалоГода
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели_НачалоГода.СубъектАналитики
		|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели_НачалоГода.Организация
		|				И (ФинансовыеПоказатели_НачалоГода.Период = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачалаГода, ДЕНЬ, -1), ДЕНЬ))
		|				И (ФинансовыеПоказатели_НачалоГода.ВидПоказателя = &ВидПоказателя)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
		|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели.Организация
		|				И (ФинансовыеПоказатели.Период = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1), ДЕНЬ))
		|				И (ФинансовыеПоказатели.ВидПоказателя = &ВидПоказателя)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РасходыИВознаграждениеУК КАК _РасходыИВознаграждениеУК
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = _РасходыИВознаграждениеУК.СчетДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = _ВводыВыводы.СчетДоверительногоУправления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РеквизитыОрганизации.ПолноеНаименованиеПоУставу,
		|		РеквизитыОрганизации.ИНН,
		|		РеквизитыОрганизации.КПП,
		|		РеквизитыКлиента.ПолноеНаименованиеПоУставу,
		|		РеквизитыКлиента.ИНН,
		|		КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора,
		|		КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения,
		|		ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0),
		|		ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0),
		|		ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0),
		|		КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
		|		КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|		ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) + ЕСТЬNULL(_ВводыВыводы.СуммаВводовВыводовАктивов, 0),
		|		ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) - ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0) + ЕСТЬNULL(_ВводыВыводы.СуммаВводовВыводовАктивов_СНачалаГода, 0),
		|		_ВводыВыводы.ПоступлениеАктивов,
		|		_ВводыВыводы.ПоступлениеАктивов_СНачалаГода,
		|		_ВводыВыводы.ИзъятиеАктивов,
		|		_ВводыВыводы.ИзъятиеАктивов_СНачалаГода,
		|		_РасходыИВознаграждениеУК.НеобходимыеРасходыУК,
		|		_РасходыИВознаграждениеУК.НеобходимыеРасходыУК_СНачалаГода,
		|		_РасходыИВознаграждениеУК.ВознаграждениеУК,
		|		_РасходыИВознаграждениеУК.ВознаграждениеУК_СНачалаГода) КАК т1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(т1.СуммаВознаграждения, 0) КАК СуммаВознаграждения,
		|	ЕСТЬNULL(т1.СуммаРасходовНаСпецдеп, 0) КАК СуммаРасходовНаСпецдеп
		|ПОМЕСТИТЬ _РасходыУК
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(_ВознаграждениеОтВводовПоДатам.СуммаВознаграждения) КАК СуммаВознаграждения,
		|		СУММА(_РасходыНаСпецдепОтВводовПоДатам.СуммаРасходовНаСпецдеп) КАК СуммаРасходовНаСпецдеп
		|	ИЗ
		|		_ВознаграждениеОтВводовПоДатам КАК _ВознаграждениеОтВводовПоДатам
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РасходыНаСпецдепОтВводовПоДатам КАК _РасходыНаСпецдепОтВводовПоДатам
		|			ПО _ВознаграждениеОтВводовПоДатам.Дата = _РасходыНаСпецдепОтВводовПоДатам.Дата) КАК т1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг""
		|					ИНАЧЕ ""ДругиеВидыДоходов""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|				ИНАЧЕ ""ДругиеВидыДоходов""
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель,
		|	СУММА(ВЫБОР
		|			КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|					ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|				ТОГДА БухгалтерскийУчетОбороты.СуммаОборотКт
		|			ИНАЧЕ БухгалтерскийУчетОбороты.СуммаОборотДт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоДоход,
		|	БухгалтерскийУчетОбороты.КорСубконто1 КАК КорСубконто1,
		|	БухгалтерскийУчетОбороты.КорСубконто2 КАК КорСубконто2,
		|	БухгалтерскийУчетОбороты.Регистратор КАК Регистратор,
		|	БухгалтерскийУчетОбороты.Субконто2 КАК Субконто2
		|ПОМЕСТИТЬ _РасходыОбщие
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка), ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|ГДЕ
		|	НЕ БухгалтерскийУчетОбороты.Субконто1 В (&ИсключенныеДоходыИРасходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг""
		|					ИНАЧЕ ""ДругиеВидыДоходов""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов""
		|				ИНАЧЕ ""ДругиеВидыДоходов""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	БухгалтерскийУчетОбороты.КорСубконто1,
		|	БухгалтерскийУчетОбороты.КорСубконто2,
		|	БухгалтерскийУчетОбороты.Регистратор,
		|	БухгалтерскийУчетОбороты.Субконто2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ФинансовыйРезультатОтПереоценкиАктивов"",
		|	ВЫБОР
		|		КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|			ТОГДА 0
		|		ИНАЧЕ &ПроцентыПоДепозитамИзСЧА
		|	КОНЕЦ,
		|	ИСТИНА,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДругиеВидыДоходов"",
		|	ЕСТЬNULL(_ОстаткиНаКонецОтчетногоКвартала.Сумма, 0) - ЕСТЬNULL(_ОстаткиНаНачалоОтчетногоКвартала.Сумма, 0),
		|	ИСТИНА,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	_ОстаткиНаКонецОтчетногоКвартала КАК _ОстаткиНаКонецОтчетногоКвартала
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоОтчетногоКвартала КАК _ОстаткиНаНачалоОтчетногоКвартала
		|		ПО _ОстаткиНаКонецОтчетногоКвартала.СчетДоверительногоУправления = _ОстаткиНаНачалоОтчетногоКвартала.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|					ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|				ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель,
		|	СУММА(ВЫБОР
		|			КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|					ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|				ТОГДА БухгалтерскийУчетОбороты.СуммаОборотКт
		|			ИНАЧЕ БухгалтерскийУчетОбороты.СуммаОборотДт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоДоход,
		|	БухгалтерскийУчетОбороты.Субконто2 КАК Субконто2,
		|	БухгалтерскийУчетОбороты.КорСубконто1 КАК КорСубконто1,
		|	БухгалтерскийУчетОбороты.КорСубконто2 КАК КорСубконто2,
		|	БухгалтерскийУчетОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _РасходыОбщие_СНачалаГода
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&ДатаНачалаГода,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка), ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|ГДЕ
		|	НЕ БухгалтерскийУчетОбороты.Субконто1 В (&ИсключенныеДоходыИРасходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|						ТОГДА ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|						ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|						ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|						ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|						ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|						ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|						ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|						ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|						ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|					КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|						ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|					ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугСпецДепозитария)
		|					ТОГДА ""ОплатаУслугСпецДепозитария_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугПрофУчастниковРынкаЦБ)
		|					ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаУслугАудитора)
		|					ТОГДА ""ОплатаУслугАудитора_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&РасходыНаОбязательноеСтрахование)
		|					ТОГДА ""РасходыНаОбязательноеСтрахование_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ВознаграждениеУправляющейКомпании)
		|					ТОГДА ""ВознаграждениеУправляющейКомпании_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ОплатаПрочихУслуг)
		|					ТОГДА ""ОплатаПрочихУслуг_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтРеализации)
		|					ТОГДА ВЫБОР
		|							КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
		|								ТОГДА ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода""
		|							ИНАЧЕ ""ФинансовыйРезультатОтРеализации_СНачалаГода""
		|						КОНЕЦ
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ДивидендыИПроцентыПоЦБ)
		|					ТОГДА ""ДивидендыИПроцентыПоЦБ_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ПроцентыПоДепозитам)
		|					ТОГДА ""ПроцентыПоДепозитам_СНачалаГода""
		|				КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&ФинансовыйРезультатОтПереоценкиАктивов)
		|					ТОГДА ""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""
		|				ИНАЧЕ ""ДругиеВидыДоходов_СНачалаГода""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)
		|				ИЛИ БухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	БухгалтерскийУчетОбороты.Субконто2,
		|	БухгалтерскийУчетОбороты.КорСубконто1,
		|	БухгалтерскийУчетОбороты.КорСубконто2,
		|	БухгалтерскийУчетОбороты.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода"",
		|	ВЫБОР
		|		КОГДА &ИспользоватьДанныеБэкОфиса = ЛОЖЬ
		|			ТОГДА 0
		|		ИНАЧЕ &ПроцентыПоДепозитамИзСЧА_СНачалаГода
		|	КОНЕЦ,
		|	ИСТИНА,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДругиеВидыДоходов_СНачалаГода"",
		|	ЕСТЬNULL(_ОстаткиНаКонецОтчетногоКвартала.Сумма, 0) - ЕСТЬNULL(_ОстаткиНаНачалоГода.Сумма, 0),
		|	ИСТИНА,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	_ОстаткиНаКонецОтчетногоКвартала КАК _ОстаткиНаКонецОтчетногоКвартала
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоГода КАК _ОстаткиНаНачалоГода
		|		ПО _ОстаткиНаКонецОтчетногоКвартала.СчетДоверительногоУправления = _ОстаткиНаНачалоГода.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниСЧАРазвернуто
		|ИЗ
		|	_ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, -1), ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеКалендаря.Дата
		|ИЗ
		|	_ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ) <> КОНЕЦПЕРИОДА(&ДатаОкончания, КВАРТАЛ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеКалендаря.Дата
		|ИЗ
		|	_ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДниСЧАРазвернуто.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниСЧА
		|ИЗ
		|	_ДниСЧАРазвернуто КАК _ДниСЧАРазвернуто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК СЧА
		|ПОМЕСТИТЬ _СЧАПоДням
		|ИЗ
		|	_ДниСЧА КАК ДанныеКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО ДанныеКалендаря.Дата = ФинансовыеПоказатели.Период
		|ГДЕ
		|	(ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И ФинансовыеПоказатели.ВидПоказателя = &ВидПоказателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СЧАПоДням.Дата КАК Дата,
		|	СУММА(ЕСТЬNULL(_ВводыПоДатамИтоговые.СуммаВводаАктивов, 0)) КАК СуммаВводаАктивов
		|ПОМЕСТИТЬ _ИтогиВводовПоДатам
		|ИЗ
		|	_ВводыПоДатам КАК _ВводыПоДатамИтоговые
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СЧАПоДням КАК _СЧАПоДням
		|		ПО _ВводыПоДатамИтоговые.Дата <= _СЧАПоДням.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧАПоДням.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_СЧАПоДням.Дата, _ВводыПоДатам.Дата) КАК Дата,
		|	ЕСТЬNULL(_СЧАПоДням.СЧА, 0) КАК СЧА,
		|	ЕСТЬNULL(_ИтогиВводовПоДатам.СуммаВводаАктивов, 0) КАК СуммаВновьПоступившихСредств,
		|	ЕСТЬNULL(_СЧАПоДням.СЧА, 0) - ЕСТЬNULL(_ИтогиВводовПоДатам.СуммаВводаАктивов, 0) КАК СЧАБезУчетаВновьПоступившихСредств,
		|	ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0) КАК ПоступлениеСредствВТечениеОтчетногоГода,
		|	РАЗНОСТЬДАТ(ЕСТЬNULL(_СЧАПоДням.Дата, _ВводыПоДатам.Дата), КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1 КАК КоличествоПолныхДнейВДУ
		|ПОМЕСТИТЬ _ТаблицаСЧА
		|ИЗ
		|	_СЧАПоДням КАК _СЧАПоДням
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ВводыПоДатам КАК _ВводыПоДатам
		|		ПО _СЧАПоДням.Дата = _ВводыПоДатам.Дата
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ИтогиВводовПоДатам КАК _ИтогиВводовПоДатам
		|		ПО _СЧАПоДням.Дата = _ИтогиВводовПоДатам.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ДанныеПоМесяцам.Январь, 0) КАК Январь,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Февраль, 0) КАК Февраль,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Март, 0) КАК Март,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Апрель, 0) КАК Апрель,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Май, 0) КАК Май,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Июнь, 0) КАК Июнь,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Июль, 0) КАК Июль,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Август, 0) КАК Август,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Сентябрь, 0) КАК Сентябрь,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Октябрь, 0) КАК Октябрь,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Ноябрь, 0) КАК Ноябрь,
		|	ЕСТЬNULL(ДанныеПоМесяцам.Декабрь, 0) КАК Декабрь
		|ПОМЕСТИТЬ _Результат_ДанныеПоМесяцам
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 1
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Январь,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 2
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Февраль,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 3
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Март,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 4
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Апрель,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 5
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Май,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 6
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Июнь,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 7
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Июль,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 8
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Август,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 9
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Сентябрь,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 10
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Октябрь,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 11
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Ноябрь,
		|		СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(_ВводыПоДатам.Дата) = 12
		|					ТОГДА ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Декабрь
		|	ИЗ
		|		_ВводыПоДатам КАК _ВводыПоДатам) КАК ДанныеПоМесяцам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(1) КАК Количество,
		|	СУММА(_ТаблицаСЧА.СЧА) КАК СЧА,
		|	СУММА(_ТаблицаСЧА.СуммаВновьПоступившихСредств) КАК СуммаВновьПоступившихСредств,
		|	СУММА(_ТаблицаСЧА.СЧАБезУчетаВновьПоступившихСредств) КАК СЧАБезУчетаВновьПоступившихСредств
		|ПОМЕСТИТЬ _Результат_СЧА
		|ИЗ
		|	_ТаблицаСЧА КАК _ТаблицаСЧА
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(СУММА(1), 0) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасходыОбщие.Показатель КАК Показатель,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|						И _РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"", ""ВознаграждениеУправляющейКомпании"")
		|					ТОГДА -_РасходыОбщие.Сумма
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|					ТОГДА _РасходыОбщие.Сумма
		|				КОГДА _РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"", ""ВознаграждениеУправляющейКомпании"")
		|					ТОГДА _РасходыОбщие.Сумма
		|				ИНАЧЕ -_РасходыОбщие.Сумма
		|			КОНЕЦ), 0) КАК Сумма
		|ПОМЕСТИТЬ _Результат_ДоходыРасходы
		|ИЗ
		|	_РасходыОбщие КАК _РасходыОбщие
		|ГДЕ
		|	НЕ _РасходыОбщие.Показатель ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасходыОбщие.Показатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_РасходыОбщие_СНачалаГода.Показатель,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|						И _РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"", ""ВознаграждениеУправляющейКомпании_СНачалаГода"")
		|					ТОГДА -_РасходыОбщие_СНачалаГода.Сумма
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|					ТОГДА _РасходыОбщие_СНачалаГода.Сумма
		|				КОГДА _РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"", ""ВознаграждениеУправляющейКомпании_СНачалаГода"")
		|					ТОГДА _РасходыОбщие_СНачалаГода.Сумма
		|				ИНАЧЕ -_РасходыОбщие_СНачалаГода.Сумма
		|			КОНЕЦ), 0)
		|ИЗ
		|	_РасходыОбщие_СНачалаГода КАК _РасходыОбщие_СНачалаГода
		|ГДЕ
		|	НЕ _РасходыОбщие_СНачалаГода.Показатель ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасходыОбщие_СНачалаГода.Показатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходОтИнвестирования"",
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|					ТОГДА _РасходыОбщие.Сумма
		|				ИНАЧЕ -_РасходыОбщие.Сумма
		|			КОНЕЦ), 0)
		|ИЗ
		|	_РасходыОбщие КАК _РасходыОбщие
		|ГДЕ
		|	НЕ _РасходыОбщие.Показатель ЕСТЬ NULL
		|	И НЕ _РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"", ""ВознаграждениеУправляющейКомпании"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РасходыВсего"",
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _РасходыОбщие.ЭтоДоход
		|					ТОГДА -_РасходыОбщие.Сумма
		|				ИНАЧЕ _РасходыОбщие.Сумма
		|			КОНЕЦ), 0)
		|ИЗ
		|	_РасходыОбщие КАК _РасходыОбщие
		|ГДЕ
		|	_РасходыОбщие.Показатель В (""ОплатаУслугСпецДепозитария"", ""ОплатаУслугПрофУчастниковРынкаЦБ"", ""ОплатаУслугАудитора"", ""РасходыНаОбязательноеСтрахование"", ""ОплатаПрочихУслуг"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходОтИнвестирования_СНачалаГода"",
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|					ТОГДА _РасходыОбщие_СНачалаГода.Сумма
		|				ИНАЧЕ -_РасходыОбщие_СНачалаГода.Сумма
		|			КОНЕЦ), 0)
		|ИЗ
		|	_РасходыОбщие_СНачалаГода КАК _РасходыОбщие_СНачалаГода
		|ГДЕ
		|	НЕ _РасходыОбщие_СНачалаГода.Показатель ЕСТЬ NULL
		|	И НЕ _РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"", ""ВознаграждениеУправляющейКомпании_СНачалаГода"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РасходыВсего_СНачалаГода"",
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _РасходыОбщие_СНачалаГода.ЭтоДоход
		|					ТОГДА -_РасходыОбщие_СНачалаГода.Сумма
		|				ИНАЧЕ _РасходыОбщие_СНачалаГода.Сумма
		|			КОНЕЦ), 0)
		|ИЗ
		|	_РасходыОбщие_СНачалаГода КАК _РасходыОбщие_СНачалаГода
		|ГДЕ
		|	_РасходыОбщие_СНачалаГода.Показатель В (""ОплатаУслугСпецДепозитария_СНачалаГода"", ""ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода"", ""ОплатаУслугАудитора_СНачалаГода"", ""РасходыНаОбязательноеСтрахование_СНачалаГода"", ""ОплатаПрочихУслуг_СНачалаГода"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""СуммаВознаграждения"",
		|	ЕСТЬNULL(_РасходыУК.СуммаВознаграждения, 0)
		|ИЗ
		|	_РасходыУК КАК _РасходыУК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""СуммаРасходовНаСпецдеп"",
		|	ЕСТЬNULL(_РасходыУК.СуммаРасходовНаСпецдеп, 0)
		|ИЗ
		|	_РасходыУК КАК _РасходыУК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.ПолнНаимУК КАК ПолнНаимУК,
		|	ВТ_Данные.ИНН_УК КАК ИНН_УК,
		|	ВТ_Данные.ИНН_УК + ""/"" + ВТ_Данные.КПП_УК КАК ПечИННКПП,
		|	ВТ_Данные.ПолноеНаименНПФ КАК ПолноеНаименНПФ,
		|	ВТ_Данные.ИНН_НПФ КАК ИНН_НПФ,
		|	&Тыс КАК Тыс,
		|	ВТ_Данные.НомерДоговораУправления КАК НомерДоговораУправления,
		|	КВАРТАЛ(&ДатаОкончания) КАК Квартал,
		|	ГОД(&ДатаОкончания) КАК Год,
		|	ВТ_Данные.ДатаЗаключДоговора КАК ДатаЗаключДоговора
		|ПОМЕСТИТЬ _Результат_Реквизиты
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(т1.СуммаВводаАктивов, 0) КАК СуммаВводаАктивов
		|ПОМЕСТИТЬ _Результат_ВводАктивов
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(_ВводыПоДатам.СуммаВводаАктивов) КАК СуммаВводаАктивов
		|	ИЗ
		|		_ВводыПоДатам КАК _ВводыПоДатам) КАК т1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Руководитель КАК RukovodUKFIO
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Контролер КАК UpolnLiczoSpecDepFIO,
		|	ВТ_Данные.ПолноеНаименНПФ КАК ID_NPFTaxis
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
	    				
#КонецОбласти

	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура ЗаполнитьПечатнуюФорму_ДоходыОтИнвестированияСредствПенсионныхНакоплений(ПакетДанных, Результат, ЕдиницаИзмерения = "Тысячи") Экспорт
	
	ПакетОтчет = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из ПакетДанных.Отчет Цикл
		Если ЭлементСтруктуры.Ключ = "Раздел1_ДоходыОтИнвестированияСредствПенсионныхНакоплений" Тогда
			ПакетОтчет.Вставить(ЭлементСтруктуры.Ключ, Новый Структура);
		Иначе	
			ПакетОтчет.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;	                                                              		
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры Из ПакетДанных.Отчет.Раздел1_ДоходыОтИнвестированияСредствПенсионныхНакоплений Цикл
		ТекЗначение = ?(ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Массив"), ПереопределитьМассив(ЭлементСтруктуры.Значение), ЭлементСтруктуры.Значение);
		ПакетОтчет.Раздел1_ДоходыОтИнвестированияСредствПенсионныхНакоплений.Вставить(ЭлементСтруктуры.Ключ, ТекЗначение);
	КонецЦикла;
		
	Результат.Очистить();
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Результат.Автомасштаб = Истина;
	
	Макет = ПолучитьМакет(ПакетДанных.ИмяОтчета);
	
	ОбластьШапка						= Макет.ПолучитьОбласть("Шапка");
		
	ОбластьШапка.Параметры.Период		= Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	Результат.Вывести(ОбластьШапка);
	
	ФорматныеСтроки = ПолучитьСтруктуруФорматныхСтрок("ДоходыОтИнвестированияСредствПенсионныхНакоплений", ЕдиницаИзмерения);
	
	ВывестиРаздел(,, "Раздел1_ДоходыОтИнвестированияСредствПенсионныхНакоплений.Таб_Отчет", ПакетОтчет, Макет, Результат, ФорматныеСтроки);

	ОбластьПодвал						   		 = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.ФИОРуководителя      = ПакетОтчет.ПодписьРуководителяУКНПФ.ФИО; 	
	ОбластьПодвал.Параметры.ФИОУполномоченногоСД = ПакетОтчет.ПодписьУполномоченногоЛица.ФИО2;
	
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

#КонецОбласти

// Расчет допустимого размера необходимых расходов (средняя СЧА)
#Область Расчет_допустимого_размера_необходимых_расходов

Функция ПолучитьДанные_РасчетДопустимогоРазмераНеобходимыхРасходов(ЕдиницаИзмерения = "Тысячи") Экспорт
	
	ПакетДанных = Новый Структура;     
	ПакетДанных.Вставить("ИмяОтчета"			, "РасчетДопустимогоРазмераНеобходимыхРасходов");
	ПакетДанных.Вставить("Отчет"				, Новый Структура);
	
	ПакетОтчетность = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачала"								, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаНачалаГода"							, ?(Год(ЭтотОбъект.Период.ДатаНачала) <> Год(ЭтотОбъект.Период.ДатаОкончания), ЭтотОбъект.Период.ДатаНачала, НачалоГода(ЭтотОбъект.Период.ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания"							, КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация"								, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления"			, ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидПоказателя"   						, Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок);
	Запрос.УстановитьПараметр("СтавкаВознаграждения"					, ЭтотОбъект.СтавкаВознагражденияУК);
	Запрос.УстановитьПараметр("СтавкаСпецдепозитария"					, ЭтотОбъект.СтавкаУслугСпецдепозитария);		
	Запрос.УстановитьПараметр("Руководитель"							, "");
	Запрос.УстановитьПараметр("Контролер"								, "");
	Запрос.УстановитьПараметр("Тыс"										, ?(ЕдиницаИзмерения = "Тысячи", "Тыс. ", ""));
	
	МассивВидовОперацийВводаАктивов = Новый Массив;
	МассивВидовОперацийВводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР);
	МассивВидовОперацийВводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление);
	
	Запрос.УстановитьПараметр("ВидыОперацийВводаАктивов", МассивВидовОперацийВводаАктивов); 
	
	МассивВидовОперацийВыводаАктивов = Новый Массив;
	МассивВидовОперацийВыводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению);
	МассивВидовОперацийВыводаАктивов.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР);
	
	Запрос.УстановитьПараметр("ВидыОперацийВыводаАктивов", МассивВидовОперацийВыводаАктивов); 
	
	Справочники.Календари.ПоместитьВЗапросДанныеКалендаря(
		ЭтотОбъект.СчетДоверительногоУправления, 
		ЭтотОбъект.ДатаОтчетности,
		Справочники.Календари.Общероссийский,
		Неопределено,
		НачалоГода(ЭтотОбъект.Период.ДатаНачала),
		ЭтотОбъект.Период.ДатаОкончания,
		Запрос.МенеджерВременныхТаблиц,
		"_ДанныеКалендаря",
		Истина);
	
	ПакетТаблица = Новый Структура;

	СтруктураРезультата = ПолучитьДанные_РасчетДопустимогоРазмераНеобходимыхРасходов_СтруктураРезультата(Запрос, ЕдиницаИзмерения);
	ПакетТаблица.Вставить("Таб_Отчет", СтруктураРезультата.МассивСтрок);
	ПакетТаблица.Вставить("СтруктураШапкиИПодвала", СтруктураРезультата.СтруктураШапкиИПодвала);
		
	ПакетДанных.Отчет.Вставить("Раздел1_РасчетДопустимогоРазмераНеобходимыхРасходов", ПакетТаблица);
	
	ПодписьРуководителяУКНПФ = Новый Структура;
	ПодписьРуководителяУКНПФ.Вставить("ФИО"	, ?(ЭтотОбъект.УказатьРуководителя, Лев(СокрЛП(ЭтотОбъект.Руководитель_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Руководитель_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Руководитель_Фамилия), Лев(СокрЛП(ЭтотОбъект.Исполнитель_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Исполнитель_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Исполнитель_Фамилия)));
	
	ПакетДанных.Отчет.Вставить("ПодписьРуководителяУКНПФ", ПодписьРуководителяУКНПФ);
	
	ПодписьУполномоченногоЛица = Новый Структура;
	ПодписьУполномоченногоЛица.Вставить("ФИО2"	, Лев(СокрЛП(ЭтотОбъект.Контролер_Имя), 1) + " " + Лев(СокрЛП(ЭтотОбъект.Контролер_Отчество), 1) + " " + СокрЛП(ЭтотОбъект.Контролер_Фамилия));
	
	ПакетДанных.Отчет.Вставить("ПодписьУполномоченногоЛица", ПодписьУполномоченногоЛица);
	
	Возврат ПакетДанных;
	
КонецФункции
	
Функция ПолучитьДанные_РасчетДопустимогоРазмераНеобходимыхРасходов_СтруктураРезультата(Запрос, ЕдиницаИзмерения = "Тысячи")	
	
	СтруктураРезультата = Новый Структура;
	
	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос.МенеджерВременныхТаблиц,, "_ДанныеКалендаря");
	Запрос.Текст = ПолучитьТекстЗапроса_РасчетДопустимогоРазмераНеобходимыхРасходов();
	
	МассивДанных = Новый Массив;
	
	ФорматныеСтроки = ПолучитьСтруктуруФорматныхСтрок("РасчетДопустимогоРазмераНеобходимыхРасходов", ЕдиницаИзмерения);
				
	Пакет	= Запрос.ВыполнитьПакет();
	//Данные	= Пакет[13].Выгрузить(); 
	
	// данные по дням
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат_ДанныеПоДням").ПолучитьДанные().Выгрузить();
	
	Данные.Сортировать("Дата");
	
	МассивДанных = СформироватьМассивСтрок(Данные, ФорматныеСтроки, "", , , Истина);
	
	СтруктураРезультата.Вставить("МассивСтрок", МассивДанных);
	
	//Данные = Пакет[14].Выгрузить();
	Данные	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Результат_ШапкаИПодвал").ПолучитьДанные().Выгрузить();
	
	МассивДанных = СформироватьМассивСтрок(Данные, ФорматныеСтроки, "", , , Истина);
	
	Если МассивДанных.Количество() = 0 Тогда
		СтруктураРезультата.Вставить("СтруктураШапкиИПодвала", Новый Структура);
	Иначе
		СтруктураРезультата.Вставить("СтруктураШапкиИПодвала", МассивДанных[0]);
	КонецЕсли;
			
	Возврат СтруктураРезультата; 
	
КонецФункции

Функция ПолучитьТекстЗапроса_РасчетДопустимогоРазмераНеобходимыхРасходов()
	
#Область ТекстЗапроса

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВводаАктивов,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК Дата
		|ПОМЕСТИТЬ _ВводыПоДатам
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			День,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ВводыПоДатам.СуммаВводаАктивов <> 0
		|			ТОГДА ВЫРАЗИТЬ(_ВводыПоДатам.СуммаВводаАктивов * &СтавкаВознаграждения / 100 * (РАЗНОСТЬДАТ(_ВводыПоДатам.Дата, КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД), КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) КАК ЧИСЛО(19, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВознаграждения,
		|	_ВводыПоДатам.Дата КАК Дата
		|ПОМЕСТИТЬ _ВознаграждениеОтВводовПоДатам
		|ИЗ
		|	_ВводыПоДатам КАК _ВводыПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ВводыПоДатам.СуммаВводаАктивов <> 0
		|			ТОГДА ВЫРАЗИТЬ(_ВводыПоДатам.СуммаВводаАктивов * &СтавкаСпецдепозитария / 100 * (РАЗНОСТЬДАТ(_ВводыПоДатам.Дата, КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД), КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1) КАК ЧИСЛО(19, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРасходовНаСпецдеп,
		|	_ВводыПоДатам.Дата КАК Дата
		|ПОМЕСТИТЬ _РасходыНаСпецдепОтВводовПоДатам
		|ИЗ
		|	_ВводыПоДатам КАК _ВводыПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ - ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|							И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (&ВидыОперацийВыводаАктивов)
		|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
		|				ТОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВводовВыводовАктивов
		|ПОМЕСТИТЬ _ВводыВыводыОбщиеРазвернуто
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	-ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток * ЕСТЬNULL(КурсыВалют.Курс, 0) / ЕСТЬNULL(КурсыВалют.Кратность, 1)
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
		|			&ДатаОкончания,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВЫРАЗИТЬ(Основание КАК Документ.ПоручениеНаДвижениеДенежныхСредств).СпособПередачи <> ЗНАЧЕНИЕ(Перечисление.СпособыПередачиПоручений.ВнутренняяСистема)) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Валюта = КурсыВалют.Валюта
		|			И (КурсыВалют.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_ВводыВыводыОбщиеРазвернуто.СуммаВводовВыводовАктивов) КАК СуммаВводовВыводовАктивов
		|ПОМЕСТИТЬ _ВводыВыводыОбщие
		|ИЗ
		|	_ВводыВыводыОбщиеРазвернуто КАК _ВводыВыводыОбщиеРазвернуто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниСЧАРазвернуто
		|ИЗ
		|	_ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, -1), ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеКалендаря.Дата
		|ИЗ
		|	_ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ) <> КОНЕЦПЕРИОДА(&ДатаОкончания, КВАРТАЛ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеКалендаря.Дата
		|ИЗ
		|	_ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДниСЧАРазвернуто.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниСЧА
		|ИЗ
		|	_ДниСЧАРазвернуто КАК _ДниСЧАРазвернуто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК СЧА
		|ПОМЕСТИТЬ _СЧАПоДням
		|ИЗ
		|	_ДниСЧА КАК ДанныеКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО ДанныеКалендаря.Дата = ФинансовыеПоказатели.Период
		|ГДЕ
		|	(ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаГода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И ФинансовыеПоказатели.ВидПоказателя = &ВидПоказателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК ПолнНаимУК,
		|	РеквизитыОрганизации.ИНН КАК ИНН_УК,
		|	РеквизитыОрганизации.КПП КАК КПП_УК,
		|	РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК ПолноеНаименНПФ,
		|	РеквизитыКлиента.ИНН КАК ИНН_НПФ,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключДоговора,
		|	ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0) КАК СтоимЧистАктивов_НачалоГода,
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК СтоимЧистАктивов,
		|	ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0) КАК СтоимЧистАктивовНаКонецОтчПериода,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&ДатаОкончания,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиента
		|		ПО (РеквизитыКлиента.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО (РеквизитыОрганизации.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_ОтчетнаяДата
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели_ОтчетнаяДата.СубъектАналитики
		|			И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели_ОтчетнаяДата.Организация
		|			И (ФинансовыеПоказатели_ОтчетнаяДата.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|			И (ФинансовыеПоказатели_ОтчетнаяДата.ВидПоказателя = &ВидПоказателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_НачалоГода
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели_НачалоГода.СубъектАналитики
		|			И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели_НачалоГода.Организация
		|			И (ФинансовыеПоказатели_НачалоГода.Период = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1), ДЕНЬ))
		|			И (ФинансовыеПоказатели_НачалоГода.ВидПоказателя = &ВидПоказателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
		|			И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация = ФинансовыеПоказатели.Организация
		|			И (ФинансовыеПоказатели.Период = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1), ДЕНЬ))
		|			И (ФинансовыеПоказатели.ВидПоказателя = &ВидПоказателя)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу,
		|	РеквизитыОрганизации.ИНН,
		|	РеквизитыОрганизации.КПП,
		|	РеквизитыКлиента.ПолноеНаименованиеПоУставу,
		|	РеквизитыКлиента.ИНН,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения,
		|	ЕСТЬNULL(ФинансовыеПоказатели_НачалоГода.Значение, 0),
		|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0),
		|	ЕСТЬNULL(ФинансовыеПоказатели_ОтчетнаяДата.Значение, 0),
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ВознаграждениеОтВводовПоДатам.Дата, _РасходыНаСпецдепОтВводовПоДатам.Дата) КАК Дата,
		|	СУММА(ЕСТЬNULL(_ВознаграждениеОтВводовПоДатам.СуммаВознаграждения, 0)) КАК СуммаВознаграждения,
		|	СУММА(ЕСТЬNULL(_РасходыНаСпецдепОтВводовПоДатам.СуммаРасходовНаСпецдеп, 0)) КАК СуммаРасходовНаСпецдеп
		|ПОМЕСТИТЬ _РасходыУК
		|ИЗ
		|	_ВознаграждениеОтВводовПоДатам КАК _ВознаграждениеОтВводовПоДатам
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РасходыНаСпецдепОтВводовПоДатам КАК _РасходыНаСпецдепОтВводовПоДатам
		|		ПО _ВознаграждениеОтВводовПоДатам.Дата = _РасходыНаСпецдепОтВводовПоДатам.Дата
		|ГДЕ
		|	ЕСТЬNULL(_РасходыНаСпецдепОтВводовПоДатам.СуммаРасходовНаСпецдеп, 0) + ЕСТЬNULL(_РасходыНаСпецдепОтВводовПоДатам.СуммаРасходовНаСпецдеп, 0) <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(_ВознаграждениеОтВводовПоДатам.Дата, _РасходыНаСпецдепОтВводовПоДатам.Дата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(1) КАК Количество,
		|	СУММА(_СЧАПоДням.СЧА) КАК СЧА
		|ПОМЕСТИТЬ _КоличествоСтрок
		|ИЗ
		|	_СЧАПоДням КАК _СЧАПоДням
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СЧАПоДням.Дата КАК Дата,
		|	СУММА(ЕСТЬNULL(_ВводыПоДатамИтоговые.СуммаВводаАктивов, 0)) КАК СуммаВводаАктивов
		|ПОМЕСТИТЬ _ИтогиВводовПоДатам
		|ИЗ
		|	_ВводыПоДатам КАК _ВводыПоДатамИтоговые
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СЧАПоДням КАК _СЧАПоДням
		|		ПО _ВводыПоДатамИтоговые.Дата <= _СЧАПоДням.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧАПоДням.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_СЧАПоДням.Дата, _ВводыПоДатам.Дата) КАК Дата,
		|	ЕСТЬNULL(_СЧАПоДням.СЧА, 0) КАК СЧА,
		|	ЕСТЬNULL(_ИтогиВводовПоДатам.СуммаВводаАктивов, 0) КАК СуммаВновьПоступившихСредств,
		|	ЕСТЬNULL(_СЧАПоДням.СЧА, 0) - ЕСТЬNULL(_ИтогиВводовПоДатам.СуммаВводаАктивов, 0) КАК СЧАБезУчетаВновьПоступившихСредств,
		|	ЕСТЬNULL(_ВводыПоДатам.СуммаВводаАктивов, 0) КАК ПоступлениеСредствВТечениеОтчетногоГода,
		|	РАЗНОСТЬДАТ(ЕСТЬNULL(_СЧАПоДням.Дата, _ВводыПоДатам.Дата), КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1 КАК КоличествоПолныхДнейВДУ,
		|	ЕСТЬNULL(_РасходыУК.СуммаВознаграждения, 0) КАК РазмерНеобходимыхРасходовУКПоНовымСредствам,
		|	ЕСТЬNULL(_РасходыУК.СуммаРасходовНаСпецдеп, 0) КАК ПредельныйРазмерВознагражденияСДПоНовымСредствам
		|ПОМЕСТИТЬ _ТаблицаСЧА
		|ИЗ
		|	_СЧАПоДням КАК _СЧАПоДням
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РасходыУК КАК _РасходыУК
		|		ПО _СЧАПоДням.Дата = _РасходыУК.Дата
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ВводыПоДатам КАК _ВводыПоДатам
		|		ПО _СЧАПоДням.Дата = _ВводыПоДатам.Дата
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ИтогиВводовПоДатам КАК _ИтогиВводовПоДатам
		|		ПО _СЧАПоДням.Дата = _ИтогиВводовПоДатам.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_ТаблицаСЧА.СЧА) КАК ИТОГО_СЧА,
		|	СУММА(_ТаблицаСЧА.СЧАБезУчетаВновьПоступившихСредств) КАК ИТОГО_СЧАБезУчетаВновьПоступившихСредств,
		|	СУММА(_ТаблицаСЧА.РазмерНеобходимыхРасходовУКПоНовымСредствам) КАК ИТОГО_РазмерНеобходимыхРасходовУКПоНовымСредствам,
		|	СУММА(_ТаблицаСЧА.ПредельныйРазмерВознагражденияСДПоНовымСредствам) КАК ИТОГО_ПредельныйРазмерВознагражденияСДПоНовымСредствам
		|ПОМЕСТИТЬ _Итоги
		|ИЗ
		|	_ТаблицаСЧА КАК _ТаблицаСЧА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаСЧА.Дата КАК Дата,
		|	_ТаблицаСЧА.СЧА КАК СЧА,
		|	_ТаблицаСЧА.СуммаВновьПоступившихСредств КАК СуммаВновьПоступившихСредств,
		|	_ТаблицаСЧА.СЧАБезУчетаВновьПоступившихСредств КАК СЧАБезУчетаВновьПоступившихСредств,
		|	_ТаблицаСЧА.ПоступлениеСредствВТечениеОтчетногоГода КАК ПоступлениеСредствВТечениеОтчетногоГода,
		|	_ТаблицаСЧА.КоличествоПолныхДнейВДУ КАК КоличествоПолныхДнейВДУ,
		|	_ТаблицаСЧА.РазмерНеобходимыхРасходовУКПоНовымСредствам КАК РазмерНеобходимыхРасходовУКПоНовымСредствам,
		|	_ТаблицаСЧА.ПредельныйРазмерВознагражденияСДПоНовымСредствам КАК ПредельныйРазмерВознагражденияСДПоНовымСредствам
		|ПОМЕСТИТЬ _Результат_ДанныеПоДням
		|ИЗ
		|	_ТаблицаСЧА КАК _ТаблицаСЧА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.ПолнНаимУК КАК ПолнНаимУК,
		|	ВТ_Данные.ИНН_УК КАК ИНН_УК,
		|	ВТ_Данные.ИНН_УК + ""/"" + ВТ_Данные.КПП_УК КАК ПечИННКПП,
		|	ВТ_Данные.ПолноеНаименНПФ КАК ПолноеНаименНПФ,
		|	ВТ_Данные.ИНН_НПФ КАК ИНН_НПФ,
		|	&Тыс КАК Тыс,
		|	ВТ_Данные.НомерДоговораУправления КАК НомерДоговораУправления,
		|	ВТ_Данные.ДатаЗаключДоговора КАК ДатаЗаключДоговора,
		|	_Итоги.ИТОГО_СЧА КАК ИТОГО_СЧА,
		|	_Итоги.ИТОГО_СЧАБезУчетаВновьПоступившихСредств КАК ИТОГО_СЧАБезУчетаВновьПоступившихСредств,
		|	_Итоги.ИТОГО_РазмерНеобходимыхРасходовУКПоНовымСредствам КАК ИТОГО_РазмерНеобходимыхРасходовУКПоНовымСредствам,
		|	_Итоги.ИТОГО_ПредельныйРазмерВознагражденияСДПоНовымСредствам КАК ИТОГО_ПредельныйРазмерВознагражденияСДПоНовымСредствам,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_КоличествоСтрок.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Итоги.ИТОГО_СЧАБезУчетаВновьПоступившихСредств / _КоличествоСтрок.Количество КАК ЧИСЛО(19, 2))
		|	КОНЕЦ КАК СредняяСЧАБезУчетаВновьПоступившихСредств,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_КоличествоСтрок.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Итоги.ИТОГО_СЧА / _КоличествоСтрок.Количество КАК ЧИСЛО(19, 2))
		|	КОНЕЦ КАК СредняяСЧА,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_КоличествоСтрок.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Итоги.ИТОГО_СЧАБезУчетаВновьПоступившихСредств / _КоличествоСтрок.Количество * &СтавкаВознаграждения / 100 КАК ЧИСЛО(19, 2))
		|	КОНЕЦ КАК НеобходимыеРасходыВПроцентахОтСЧА,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_КоличествоСтрок.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Итоги.ИТОГО_СЧАБезУчетаВновьПоступившихСредств / _КоличествоСтрок.Количество * &СтавкаВознаграждения / 100 КАК ЧИСЛО(19, 2))
		|	КОНЕЦ + _Итоги.ИТОГО_РазмерНеобходимыхРасходовУКПоНовымСредствам КАК НеобходимыеРасходы
		|ПОМЕСТИТЬ _Результат_ШапкаИПодвал
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные,
		|	_Итоги КАК _Итоги,
		|	_КоличествоСтрок КАК _КоличествоСтрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Руководитель КАК RukovodUKFIO
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Контролер КАК UpolnLiczoSpecDepFIO,
		|	ВТ_Данные.ПолноеНаименНПФ КАК ID_NPFTaxis
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
	    				
#КонецОбласти

	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура ЗаполнитьПечатнуюФорму_РасчетДопустимогоРазмераНеобходимыхРасходов(ПакетДанных, Результат, ЕдиницаИзмерения = "Тысячи") Экспорт
	
	ПакетОтчет = ПакетДанных.Отчет;
		
	Результат.Очистить();
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Результат.Автомасштаб = Истина;
	
	Макет = ПолучитьМакет(ПакетДанных.ИмяОтчета);
	
	ОбластьШапка						= Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Заполнить(ПакетОтчет.Раздел1_РасчетДопустимогоРазмераНеобходимыхРасходов.СтруктураШапкиИПодвала);
	ОбластьШапка.Параметры.Период		= Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	Результат.Вывести(ОбластьШапка);
	
	ВывестиРаздел(,, "Раздел1_РасчетДопустимогоРазмераНеобходимыхРасходов.Таб_Отчет", ПакетОтчет, Макет, Результат);

	ОбластьПодвал						   		 = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.Заполнить(ПакетОтчет.Раздел1_РасчетДопустимогоРазмераНеобходимыхРасходов.СтруктураШапкиИПодвала);
	//ОбластьПодвал.Параметры.ФИОРуководителя      = ПакетОтчет.ПодписьРуководителяУКНПФ.ФИО; 	
	//ОбластьПодвал.Параметры.ФИОУполномоченногоСД = ПакетОтчет.ПодписьУполномоченногоЛица.ФИО2;
	
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

#КонецОбласти


#Область Дополнительные_процедуры_и_функции

Процедура ПолучитьФорматированныеДанныеДляПечати(ВариантОтчета, СтруктураДанных, ЕдиницаИзмерения) Экспорт
	
	ФорматныеСтроки = ПолучитьСтруктуруФорматныхСтрок(ВариантОтчета, ЕдиницаИзмерения, Истина);
	Для Каждого КлючИЗначение Из СтруктураДанных Цикл                                                                               		
		СтруктураДанных.Вставить(КлючИЗначение.Ключ, СериализоватьЗначение(СтруктураДанных, КлючИЗначение.Ключ, ФорматныеСтроки));
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруФорматныхСтрок(ВариантОтчета, ЕдиницаИзмерения, ДляВыгрузки = Ложь)
	
	Если ЕдиницаИзмерения = "Тысячи" Тогда
		ФорматЧисла = ?(ДляВыгрузки, "ЧДЦ=5; ЧС=3; ЧРД=.; ЧН=; ЧГ=0", "ЧДЦ=5; ЧС=3; ЧРД=,; ЧН=; ЧГ=3,0");
	Иначе
		ФорматЧисла = ?(ДляВыгрузки, "ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0", "ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=3,0");
	КонецЕсли;
	
	ФорматДаты = ?(ДляВыгрузки, "ДФ=yyyy-MM-dd", "ДФ=dd.MM.yyyy");
	
	ФорматныеСтроки = Новый Структура;
	
	Если ВариантОтчета = "ИнвестированиеСредствПенсионныхНакоплений" Тогда
			
		ФорматныеСтроки.Вставить("ПоступлениеАктивов",					ФорматЧисла);
		ФорматныеСтроки.Вставить("ПоступлениеАктивов_СНачалаГода",		ФорматЧисла);
		ФорматныеСтроки.Вставить("ИзъятиеАктивов", 						ФорматЧисла);
		ФорматныеСтроки.Вставить("ИзъятиеАктивов_СНачалаГода", 			ФорматЧисла);
		ФорматныеСтроки.Вставить("СтоимЧистАктивов", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("СтоимЧистАктивов_НачалоГода", 		ФорматЧисла);
		ФорматныеСтроки.Вставить("СтоимЧистАктивовНаКонецОтчПериода", 	ФорматЧисла);
		ФорматныеСтроки.Вставить("НеобходимыеРасходыУК", 				ФорматЧисла);
		ФорматныеСтроки.Вставить("НеобходимыеРасходыУК_СНачалаГода", 	ФорматЧисла);
		ФорматныеСтроки.Вставить("ВознаграждениеУК", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("ВознаграждениеУК_СНачалаГода", 		ФорматЧисла);
		ФорматныеСтроки.Вставить("ФинРезультат", 						ФорматЧисла);
		ФорматныеСтроки.Вставить("ФинРезультат_СНачалаГода", 			ФорматЧисла);
		ФорматныеСтроки.Вставить("Квартал",					 			"ЧГ=0");
		ФорматныеСтроки.Вставить("Год",						 			"ЧГ=0");   
		ФорматныеСтроки.Вставить("ДатаЗаключДоговора",					ФорматДаты);
		
	ИначеЕсли ВариантОтчета = "ДоходыОтИнвестированияСредствПенсионныхНакоплений" Тогда
		
		ФорматЧислаПроцент = ?(ДляВыгрузки, "ЧДЦ=5; ЧРД=.; ЧН=; ЧГ=0", "ЧДЦ=5; ЧРД=,; ЧН=; ЧГ=0");
		
		ФорматныеСтроки.Вставить("Январь",												ФорматЧисла);
		ФорматныеСтроки.Вставить("Февраль",												ФорматЧисла);
		ФорматныеСтроки.Вставить("Март", 												ФорматЧисла);
		ФорматныеСтроки.Вставить("Апрель", 												ФорматЧисла);
		ФорматныеСтроки.Вставить("Май", 												ФорматЧисла);
		ФорматныеСтроки.Вставить("Июнь", 												ФорматЧисла);
		ФорматныеСтроки.Вставить("Июль", 												ФорматЧисла);
		ФорматныеСтроки.Вставить("Август", 												ФорматЧисла);
		ФорматныеСтроки.Вставить("Сентябрь", 											ФорматЧисла);
		ФорматныеСтроки.Вставить("Октябрь", 											ФорматЧисла);
		ФорматныеСтроки.Вставить("Ноябрь", 												ФорматЧисла);
		ФорматныеСтроки.Вставить("Декабрь", 											ФорматЧисла);
		
		ФорматныеСтроки.Вставить("Квартал",					 							"ЧДЦ=; ЧГ=0");
		ФорматныеСтроки.Вставить("Год",						 							"ЧДЦ=; ЧГ=0"); 
		ФорматныеСтроки.Вставить("ДатаЗаключДоговора",									ФорматДаты);

		ФорматныеСтроки.Вставить("ДоходОтИнвестирования",								ФорматЧисла);
		ФорматныеСтроки.Вставить("ДоходОтИнвестирования_СНачалаГода", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("ФинансовыйРезультатОтРеализации", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("ФинансовыйРезультатОтРеализации_СНачалаГода", 		ФорматЧисла);
		ФорматныеСтроки.Вставить("ДивидендыИПроцентыПоЦБ", 								ФорматЧисла);
		ФорматныеСтроки.Вставить("ДивидендыИПроцентыПоЦБ_СНачалаГода", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("ПроцентыПоДепозитам", 								ФорматЧисла);
		ФорматныеСтроки.Вставить("ПроцентыПоДепозитам_СНачалаГода", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("ФинансовыйРезультатОтПереоценкиАктивов", 				ФорматЧисла);
		ФорматныеСтроки.Вставить("ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода",	ФорматЧисла);
		ФорматныеСтроки.Вставить("ДругиеВидыДоходов", 									ФорматЧисла);
		ФорматныеСтроки.Вставить("ДругиеВидыДоходов_СНачалаГода", 						ФорматЧисла);
		ФорматныеСтроки.Вставить("РасходыВсего", 										ФорматЧисла);
		ФорматныеСтроки.Вставить("РасходыВсего_СНачалаГода", 							ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаУслугСпецДепозитария", 							ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаУслугСпецДепозитария_СНачалаГода", 				ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаУслугПрофУчастниковРынкаЦБ", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода", 		ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаУслугАудитора", 								ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаУслугАудитора_СНачалаГода", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("РасходыНаОбязательноеСтрахование", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("РасходыНаОбязательноеСтрахование_СНачалаГода", 		ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаПрочихУслуг", 									ФорматЧисла);
		ФорматныеСтроки.Вставить("ОплатаПрочихУслуг_СНачалаГода", 						ФорматЧисла);
		ФорматныеСтроки.Вставить("ВознаграждениеУправляющейКомпании", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("ВознаграждениеУправляющейКомпании_СНачалаГода", 		ФорматЧисла);
		ФорматныеСтроки.Вставить("СредняяСЧАЗаВычетомВводовВыводов", 					ФорматЧисла);
		ФорматныеСтроки.Вставить("СуммаВводаАктивов", 									ФорматЧисла);
		ФорматныеСтроки.Вставить("СуммаВознаграждения", 								ФорматЧисла);
		ФорматныеСтроки.Вставить("СуммаРасходовНаСпецдеп", 								ФорматЧисла);
		ФорматныеСтроки.Вставить("ДоходОтИнвестированияВПроцентахОтСЧА", 				ФорматЧислаПроцент);
		ФорматныеСтроки.Вставить("РазницаПоРасходамУК", 								ФорматЧисла);
		ФорматныеСтроки.Вставить("РазницаПоРасходамСпецдепа", 							ФорматЧисла);
		ФорматныеСтроки.Вставить("ВознаграждениеУКВПроцентахОтДохода", 					ФорматЧислаПроцент);
		ФорматныеСтроки.Вставить("ВознаграждениеУКВПроцентахКОтСЧА", 					ФорматЧислаПроцент);
		
	ИначеЕсли ВариантОтчета = "РасчетДопустимогоРазмераНеобходимыхРасходов" Тогда
	
		ФорматЧисла = ?(ЕдиницаИзмерения = "Тысячи", "ЧДЦ=5; ЧС=3; ЧРД=,; ЧН=; ЧГ=3,0", "ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=3,0");
	
		ФорматныеСтроки.Вставить("Дата",													"ДФ=dd.MM.yyyy");
		ФорматныеСтроки.Вставить("СЧА",														ФорматЧисла);
		ФорматныеСтроки.Вставить("СуммаВновьПоступившихСредств",							ФорматЧисла);
		ФорматныеСтроки.Вставить("СЧАБезУчетаВновьПоступившихСредств",						ФорматЧисла);
		ФорматныеСтроки.Вставить("ПоступлениеСредствВТечениеОтчетногоГода",					ФорматЧисла);
		ФорматныеСтроки.Вставить("РазмерНеобходимыхРасходовУКПоНовымСредствам",				ФорматЧисла);
		ФорматныеСтроки.Вставить("ПредельныйРазмерВознагражденияСДПоНовымСредствам",		ФорматЧисла);
		ФорматныеСтроки.Вставить("КоличествоПолныхДнейВДУ",									"ЧДЦ=0; ЧРД=,;");
		ФорматныеСтроки.Вставить("ИТОГО_СЧА",												ФорматЧисла);
		ФорматныеСтроки.Вставить("ИТОГО_СЧАБезУчетаВновьПоступившихСредств",				ФорматЧисла);
		ФорматныеСтроки.Вставить("ИТОГО_РазмерНеобходимыхРасходовУКПоНовымСредствам",		ФорматЧисла);
		ФорматныеСтроки.Вставить("ИТОГО_ПредельныйРазмерВознагражденияСДПоНовымСредствам",	ФорматЧисла);
		ФорматныеСтроки.Вставить("СредняяСЧАБезУчетаВновьПоступившихСредств",				ФорматЧисла);
		ФорматныеСтроки.Вставить("СредняяСЧА",												ФорматЧисла);
		ФорматныеСтроки.Вставить("НеобходимыеРасходыВПроцентахОтСЧА",						ФорматЧисла);
		ФорматныеСтроки.Вставить("НеобходимыеРасходы",										ФорматЧисла);

	КонецЕсли;
	
	Возврат ФорматныеСтроки;
		
КонецФункции	
	
Процедура ДополнитьСтруктуруОтсутствующимиСвойствами(СтрокаСтруктуры)
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("ДоходОтИнвестирования");
	МассивСвойств.Добавить("ДоходОтИнвестирования_СНачалаГода");
	МассивСвойств.Добавить("ФинансовыйРезультатОтРеализации");
	МассивСвойств.Добавить("ФинансовыйРезультатОтРеализации_СНачалаГода");
	МассивСвойств.Добавить("ДивидендыИПроцентыПоЦБ_СНачалаГода");
	МассивСвойств.Добавить("ПроцентыПоДепозитам");
	МассивСвойств.Добавить("ПроцентыПоДепозитам_СНачалаГода");
	МассивСвойств.Добавить("ФинансовыйРезультатОтПереоценкиАктивов");
	МассивСвойств.Добавить("ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода");
	МассивСвойств.Добавить("ДругиеВидыДоходов");
	МассивСвойств.Добавить("ДругиеВидыДоходов_СНачалаГода");
	МассивСвойств.Добавить("РасходыВсего");
	МассивСвойств.Добавить("РасходыВсего_СНачалаГода");
	МассивСвойств.Добавить("ОплатаУслугСпецДепозитария");
	МассивСвойств.Добавить("ОплатаУслугСпецДепозитария_СНачалаГода");
	МассивСвойств.Добавить("ОплатаУслугПрофУчастниковРынкаЦБ");
	МассивСвойств.Добавить("ОплатаУслугПрофУчастниковРынкаЦБ_СНачалаГода");
	МассивСвойств.Добавить("ОплатаУслугАудитора");
	МассивСвойств.Добавить("ОплатаУслугАудитора_СНачалаГода");
	МассивСвойств.Добавить("РасходыНаОбязательноеСтрахование");
	МассивСвойств.Добавить("РасходыНаОбязательноеСтрахование_СНачалаГода");
	МассивСвойств.Добавить("ОплатаПрочихУслуг");
	МассивСвойств.Добавить("ОплатаПрочихУслуг_СНачалаГода");
	МассивСвойств.Добавить("ВознаграждениеУправляющейКомпании");
	МассивСвойств.Добавить("ВознаграждениеУправляющейКомпании_СНачалаГода");
	МассивСвойств.Добавить("СредняяСЧАЗаВычетомВводовВыводов");
	МассивСвойств.Добавить("СуммаВводаАктивов");
	МассивСвойств.Добавить("СуммаВознаграждения");
	МассивСвойств.Добавить("СуммаРасходовНаСпецдеп");
	
	Для Каждого ТекСвойство Из МассивСвойств Цикл
		Если СтрокаСтруктуры.Свойство(ТекСвойство) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСтруктуры.Вставить(ТекСвойство, 0);
	КонецЦикла;
	
КонецПроцедуры

Функция СериализоватьЗначение(СтрокаДанных, Колонка, ФорматныеСтроки)
	
	ФорматнаяСтрока = "";
	Значение = СтрокаДанных[Колонка];
	
	Если Колонка = "Кол5_Таб1_1НомерФилиала" ИЛИ Колонка = "Кол5_Таб1_2НомерФилиала" Тогда
		Значение = ?(Найти(Значение, "/") > 0, Сред(Значение, Найти(Значение, "/") + 1), "0");
		
	ИначеЕсли Колонка = "Кол4_Таб1_1РегНомер" ИЛИ Колонка = "Кол4_Таб1_2РегНомер" Тогда
		Значение = ?(Найти(Значение, "/") > 0, Лев(Значение, Найти(Значение, "/") - 1), Значение);
	КонецЕсли;
	
	Если Значение = ЭтотОбъект.ПустоеЗначение Тогда
		Возврат Значение;
		
	ИначеЕсли Колонка = "Кол3_Таб34_2ОснованиеЗадолж" Тогда
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") Тогда
			Возврат "Соглашение о брокерском обслуживании №" + Значение.НомерДоговора + " от " + Формат(Значение.ДатаЗаключения, "ДФ=dd.MM.yy");
		ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Договоры") Тогда
			Если Значение.ВидДоговора = Перечисления.ВидыДоговоров.БрокерскогоОбслуживания Тогда
				Возврат "Соглашение о брокерском обслуживании №" + Значение.НомерДоговора + " от " + Формат(Значение.ДатаЗаключения, "ДФ=dd.MM.yy");
			Иначе
				Возврат "Договор " + Значение.НомерДоговора + " от " + Формат(Значение.ДатаЗаключения, "ДФ=dd.MM.yy");	
			КонецЕсли;
		Иначе
			Возврат Значение;
		КонецЕсли;
	ИначеЕсли Колонка = "Кол65_Таб1_3НаименЭмитента" ИЛИ Колонка = "Кол95_Таб1_4НаименЭмитента" Тогда
		Если ТипЗнч(СтрокаДанных.ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
			РеквизитыПая = РаботаСОтчетами.ПолучитьРеквизитыЦеннойБумаги(СтрокаДанных.ЦеннаяБумага, ЭтотОбъект.Период.ДатаОкончания);
			Возврат Значение + "(" + РеквизитыПая.ПолноеНаименованиеЭмитента + ")";
		Иначе
			Возврат Значение;
		КонецЕсли;
		
	ИначеЕсли Колонка = "Кол114_Таб2_1СрокПлатежа" ИЛИ Колонка = "Кол161_Таб2_3СрокПлатежа" Тогда
		Если СтрокаДанных.ВариантПогашения = Перечисления.ВариантыПогашенияВекселей.НаДату Тогда
			Возврат Формат(СтрокаДанных.ДатаПогашения, "ДФ=dd.MM.yyyy");
		ИначеЕсли СтрокаДанных.ВариантПогашения = Перечисления.ВариантыПогашенияВекселей.ПоПредъявлении Тогда
			Возврат "По предъявлении";
		ИначеЕсли СтрокаДанных.ВариантПогашения = Перечисления.ВариантыПогашенияВекселей.ПоПредъявленииНоНеРанее Тогда
			Возврат "По предъявлении, но не ранее " + Формат(СтрокаДанных.ДатаПогашения, "ДФ=dd.MM.yyyy");
		ИначеЕсли СтрокаДанных.ВариантПогашения = Перечисления.ВариантыПогашенияВекселей.ПоПредъявленииНоНеПозднее Тогда
			Возврат "По предъявлении, но не ранее " + Формат(СтрокаДанных.ДатаПогашения, "ДФ=dd.MM.yyyy") + ?(ЗначениеЗаполнено(СтрокаДанных.ПогаситьНеПозднее), " и не позднее " + Формат(СтрокаДанных.ПогаситьНеПозднее, "ДФ=dd.MM.yyyy"), "");
		ИначеЕсли СтрокаДанных.ВариантПогашения = Перечисления.ВариантыПогашенияВекселей.ЧерезNДнейОтДатыСоставления Тогда
			Если ЗначениеЗаполнено(СтрокаДанных.ПогаситьНеПозднее) Тогда
				Возврат "По предъявлении, но не ранее " + Формат(СтрокаДанных.ДнейДоПогашения, "ЧГ=0") + " дня и не позднее " + Формат(СтрокаДанных.ПогаситьНеПозднее, "ДФ=dd.MM.yyyy");
			Иначе
				Возврат "Через " + Формат(СтрокаДанных.ДнейДоПогашения, "ЧГ=0") + " дней от даты составления (" + Формат(СтрокаДанных.ДатаПогашения, "ДФ=dd.MM.yyyy") + ")";
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли Колонка = "Кол165_Таб2_3Основания" Тогда
		Возврат "Договор ДУ " + СтрокаДанных.НомерДоговораДУ;//  + " от " + Формат(СтрокаДанных.ДатаДоговораДУ, "ДФ=dd.MM.yyyy");
		
	ИначеЕсли Колонка = "Кол130_Таб2_1ОсновНахожВекселя" Тогда
		Если ЗначениеЗаполнено(СтрокаДанных.НомерДоговораДепозитарногоОбслуживания) Тогда
			Возврат "Депозитарный договор " + СтрокаДанных.НомерДоговораДепозитарногоОбслуживания + " от " + Формат(СтрокаДанных.ДатаДоговораДепозитарногоОбслуживания, "ДФ=dd.MM.yyyy");
		Иначе	
			Возврат ЭтотОбъект.ПустоеЗначение;
		КонецЕсли;
		
	ИначеЕсли ФорматныеСтроки.Свойство(Колонка, ФорматнаяСтрока) Тогда
		
		Если ТипЗнч(Значение) = Тип("Число") Тогда
			Если Найти(ФорматнаяСтрока, "ЧДЦ=0; ") > 0 Тогда
				Если Значение <> Цел(Значение) Тогда
					ФорматнаяСтрока = СтрЗаменить(ФорматнаяСтрока, "ЧДЦ=0; ", "");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Формат(Значение, ФорматнаяСтрока);
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") И (Колонка = "Кол_ДатаЗаключДоговора") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") И (Колонка = "Кол_ДтаВремяСделки") Тогда	
		Результат = Формат(Значение, "ДЛФ=DT");
		Возврат СтрЗаменить(Результат, ":", "-");
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧДЦ=5; ЧРД=,; ЧН=0; ЧГ=0");
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=dd.MM.yyyy; ДП='" + ЭтотОбъект.ПустоеЗначение + "'");	
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") И НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат ЭтотОбъект.ПустоеЗначение;
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.СтраныМира") Тогда
		Возврат Значение.КодАльфа3;
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

Функция СформироватьМассивСтрок(Данные, ФорматныеСтроки = "", ПрефиксКолонки = "Кол", ИмяТаблицы = "", ЗаполнятьПустымиЗначениями = Истина, Сериализовать = Истина)
	
	МассивСтрок		= Новый Массив;
	МассивКолонок	= Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ФорматныеСтроки) Тогда
		ФорматныеСтроки = Новый Структура;
	КонецЕсли;
	
	Для Каждого Колонка Из Данные.Колонки Цикл
		Если Лев(Колонка.Имя, СтрДлина(ПрефиксКолонки)) = ПрефиксКолонки ИЛИ НЕ ЗначениеЗаполнено(ПрефиксКолонки) Тогда
			МассивКолонок.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из Данные Цикл
		ДанныеСтроки = Новый Структура;
		
		Для Каждого Колонка Из МассивКолонок Цикл
			ДанныеСтроки.Вставить(Колонка, ?(Сериализовать, СериализоватьЗначение(СтрокаДанных, Колонка, ФорматныеСтроки), СтрокаДанных[Колонка]));

			Если Найти(Колонка, "НомерСтроки") > 0
				ИЛИ Найти(Колонка, "НомСтроки") > 0
				ИЛИ Найти(Колонка, "НомерСтр") > 0
				ИЛИ Колонка = "Кол1_Таб3НомерГрафы"
				ИЛИ Колонка = "Кол1_Таб34_1НомерГрафы"
				ИЛИ Колонка = "Кол1_Таб1_2НомерГрафы" Тогда
				ДанныеСтроки.Вставить(Колонка, МассивСтрок.Количество() + 1);
			КонецЕсли;	
		КонецЦикла;
		
		МассивСтрок.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Если МассивСтрок.Количество() = 0 И ЗаполнятьПустымиЗначениями Тогда
		МассивСтрок.Добавить("ЗаполнитьПустымиЗначениями");
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции

Процедура ВывестиРаздел(ИмяРаздела = "", ПутьКШапке = "", ПутьКСтроке, Пакет, Макет, Результат, ФорматныеСтроки = Неопределено, ПризнакОтформатированныхКолонок = "")
	
	Если ФорматныеСтроки = Неопределено Тогда
		ФорматныеСтроки = Новый Структура;
	КонецЕсли;
	
	МассивПутьКШапке	= РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьКШапке	, ".");
	МассивПутьКСтроке	= РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьКСтроке	, ".");
	
	ДанныеШапки = Пакет;
	ДанныеТЧ	= Пакет;
	
	Для Каждого ИмяДанныхШапки Из МассивПутьКШапке Цикл
		ДанныеШапки = ДанныеШапки[ИмяДанныхШапки];
	КонецЦикла;
	
	Для Каждого ИмяСтроки Из МассивПутьКСтроке Цикл
		ДанныеТЧ = ДанныеТЧ[ИмяСтроки]; 		
	КонецЦикла;
	
	Если ФорматныеСтроки.Количество() > 0 Тогда
		Для Каждого ЭлементМассива Из ДанныеТЧ Цикл
			Для Каждого ЭлементСтруктуры Из ЭлементМассива Цикл
				ЭлементМассива.Вставить(ЭлементСтруктуры.Ключ + ПризнакОтформатированныхКолонок, СериализоватьЗначение(ЭлементМассива, ЭлементСтруктуры.Ключ, ФорматныеСтроки)); 
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяРаздела) Тогда
		ОбластьШапка	= Макет.ПолучитьОбласть(ИмяРаздела);
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеШапки);
		Результат.Вывести(ОбластьШапка);	
	КонецЕсли;	
	
	ОбластьСтрока	= Макет.ПолучитьОбласть(ИмяСтроки);
	НомерСтроки = 1;
	Для Каждого СтрокаДанных Из ДанныеТЧ Цикл
		Если СтрокаДанных = "ЗаполнитьПустымиЗначениями" Тогда
			Для Индекс = 0 По ОбластьСтрока.Параметры.Количество() - 1 Цикл
				ОбластьСтрока.Параметры.Установить(Индекс, ЭтотОбъект.ПустоеЗначение);
			КонецЦикла;
		Иначе
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаДанных); 
			ОбластьСтрока.Параметры.Заполнить(Новый Структура("НомерСтроки", НомерСтроки));
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНастройкиВидимостиРеквизитов() Экспорт
	
	НастройкиВидимостиРеквизитов = Новый Структура;
	
	МакетВидимостьРеквизитов = ПолучитьМакет("ВидимостьРеквизитов");
	
	Для НомерСтроки = 2 По МакетВидимостьРеквизитов.ВысотаТаблицы Цикл
		ИмяПакета = СокрЛП(МакетВидимостьРеквизитов.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		НастройкиВидимостиРеквизитов.Вставить(ИмяПакета, Новый Структура);
		
		Для НомерКолонки = 2 По МакетВидимостьРеквизитов.ШиринаТаблицы Цикл
			ИмяРеквизита	= СокрЛП(МакетВидимостьРеквизитов.Область(1, НомерКолонки, 1, НомерКолонки).Текст);
			Видимость		= (СокрЛП(МакетВидимостьРеквизитов.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст) = "ДА");
			НастройкиВидимостиРеквизитов[ИмяПакета].Вставить(ИмяРеквизита, Видимость);
		КонецЦикла;
	КонецЦикла;
	
	Возврат НастройкиВидимостиРеквизитов;
	
КонецФункции

Функция ПолучитьСоставГруппДоходовИРасходов(ИспользоватьДанныеБэкОфиса)
	
	// Техдолг: сделать хранение в отдельном регистре или реквизите справочника и вынести в общий модуль, использовать в форме 512/513 Отчетности ЦБ
	СоставГруппДоходовИРасходов = Новый Структура("ФинансовыйРезультатОтРеализации, 
			|ДивидендыИПроцентыПоЦБ, 
			|ПроцентыПоДепозитам, 
			|ФинансовыйРезультатОтПереоценкиАктивов, 
			|ДругиеВидыДоходов, 
			|ОплатаУслугСпецДепозитария, 
			|ОплатаУслугПрофУчастниковРынкаЦБ, 
			|ОплатаУслугАудитора, 
			|РасходыНаОбязательноеСтрахование, 
			|ВознаграждениеУправляющейКомпании,
			|ИсключенныеДоходыИРасходы,
			|ОплатаПрочихУслуг", Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив,
			Новый Массив);
	
	МакетСписокДоходовРасходов = ПолучитьМакет("ГруппыДоходовИРасходов");
	
	ТаблицаДоходовРасходов = Новый	ТаблицаЗначений;
	
	КС = Новый КвалификаторыСтроки(150);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , , , КС);
	
	ТаблицаДоходовРасходов.Колонки.Добавить("Код", ОписаниеТиповСтрока);
	ТаблицаДоходовРасходов.Колонки.Добавить("ИмяПредопределенныхДанных", ОписаниеТиповСтрока);
	ТаблицаДоходовРасходов.Колонки.Добавить("ГруппаДоходовИРасходов", ОписаниеТиповСтрока);
	
	Для НомерСтроки = 2 По МакетСписокДоходовРасходов.ВысотаТаблицы Цикл
		
		ИмяПредопределенныхДанных 	= СокрЛП(МакетСписокДоходовРасходов.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		Код 						= СокрЛП(МакетСписокДоходовРасходов.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);		
		ГруппаДоходовИРасходов 		= СокрЛП(МакетСписокДоходовРасходов.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		Исключить 					= СокрЛП(МакетСписокДоходовРасходов.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
		ДатаОкончания 				= СокрЛП(МакетСписокДоходовРасходов.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);
				
		Если ГруппаДоходовИРасходов = "" Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаОкончания = ?(ПустаяСтрока(ДатаОкончания), '39990101', Дата(ДатаОкончания)); 
		Если Исключить = "Да" И ИспользоватьДанныеБэкОфиса И ЭтотОбъект.Период.ДатаОкончания < ДатаОкончания Тогда
			ГруппаДоходовИРасходов = "ИсключенныеДоходыИРасходы";
		КонецЕсли;
		
		Если ИмяПредопределенныхДанных <> "" Тогда
			СоставГруппДоходовИРасходов[ГруппаДоходовИРасходов].Добавить(Справочники.ПрочиеДоходыИРасходы[ИмяПредопределенныхДанных]);
		Иначе	
			НоваяСтрока = ТаблицаДоходовРасходов.Добавить();		
			НоваяСтрока.Код 					= Код;
			НоваяСтрока.ГруппаДоходовИРасходов	= ГруппаДоходовИРасходов;
		КонецЕсли;
		
	КонецЦикла;
	
	// Определим ссылки на элементы справочника
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ТаблицаДоходовРасходов.Код КАК Код,
	|	_ТаблицаДоходовРасходов.ГруппаДоходовИРасходов КАК ГруппаДоходовИРасходов
	|ПОМЕСТИТЬ _ТаблицаСтатей
	|ИЗ
	|	&ТаблицаДоходовРасходов КАК _ТаблицаДоходовРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка,
	|	_ТаблицаСтатей.ГруппаДоходовИРасходов КАК ГруппаДоходовИРасходов
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаСтатей КАК _ТаблицаСтатей
	|		ПО ПрочиеДоходыИРасходы.Код = _ТаблицаСтатей.Код
	|ГДЕ
	|	НЕ ПрочиеДоходыИРасходы.Предопределенный
	|	И НЕ ПрочиеДоходыИРасходы.ЭтоГруппа
	|	И НЕ ПрочиеДоходыИРасходы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТаблицаДоходовРасходов", ТаблицаДоходовРасходов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоставГруппДоходовИРасходов[Выборка.ГруппаДоходовИРасходов].Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ВозвратРасходовПрошлогоПериода = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ВозвратРасхода"); 
	СоставГруппДоходовИРасходов["РасходыНаОбязательноеСтрахование"].Добавить(ВозвратРасходовПрошлогоПериода);

	Возврат СоставГруппДоходовИРасходов;
	
КонецФункции

Функция ПолучитьПроцентыПоДепозитуИзСЧА(СчетДоверительногоУправления, НачалоПериода, КонецПериода)
	
	СтоимостиДепозитныхВкладов_НачалоПериода = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляРСА(
		СчетДоверительногоУправления,
		НачалоПериода-1,
		Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад,
		Ложь);
		
	СтоимостиДепозитныхВкладов_КонецПериода = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляРСА(
		СчетДоверительногоУправления,
		КонецДня(КонецПериода),
		Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад,
		Ложь);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(СтоимостиДепозитныхВкладов_НачалоПериода.Проценты КАК ЧИСЛО(19, 2)) КАК Проценты,
	|	СтоимостиДепозитныхВкладов_НачалоПериода.КредитныйИнструмент КАК ДепозитныйВклад
	|ПОМЕСТИТЬ _ДепозитыНаНачалоПериода
	|ИЗ
	|	&СтоимостиДепозитныхВкладов_НачалоПериода КАК СтоимостиДепозитныхВкладов_НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(СтоимостиДепозитныхВкладов_КонецПериода.Проценты КАК ЧИСЛО(19, 2)) КАК Проценты,
	|	СтоимостиДепозитныхВкладов_КонецПериода.КредитныйИнструмент КАК ДепозитныйВклад
	|ПОМЕСТИТЬ _ДепозитыНаКонецПериода
	|ИЗ
	|	&СтоимостиДепозитныхВкладов_КонецПериода КАК СтоимостиДепозитныхВкладов_КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ЕСТЬNULL(_ДепозитыНаКонецПериода.Проценты, 0) - ЕСТЬNULL(_ДепозитыНаНачалоПериода.Проценты, 0)), 0) КАК Проценты
	|ИЗ
	|	_ДепозитыНаКонецПериода КАК _ДепозитыНаКонецПериода
	|		ПОЛНОЕ СОЕДИНЕНИЕ _ДепозитыНаНачалоПериода КАК _ДепозитыНаНачалоПериода
	|		ПО _ДепозитыНаКонецПериода.ДепозитныйВклад = _ДепозитыНаНачалоПериода.ДепозитныйВклад";
	
	Запрос.УстановитьПараметр("СтоимостиДепозитныхВкладов_НачалоПериода",	СтоимостиДепозитныхВкладов_НачалоПериода);
	Запрос.УстановитьПараметр("СтоимостиДепозитныхВкладов_КонецПериода",	СтоимостиДепозитныхВкладов_КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Проценты;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПереопределитьМассив(ТекМассив)
	
	Результат = Новый Массив;
	Для Каждого ЭлементМассива Из ТекМассив Цикл
		Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда           			
			Результат.Добавить(ПереопределитьСтруктуру(ЭлементМассива));				
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

Функция ПереопределитьСтруктуру(Знач ТекСтруктура)
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из ТекСтруктура Цикл                 		
		Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Формирование_расшифровки

Функция ПолучитьВыборкуРасшифровкиЯчейки(ПолеРасшифровки, СНачалаГода = Ложь, ЕдиницаИзмерения) Экспорт
		
	Запрос = Новый Запрос;
	ПодготовитьДанныеДляЗапроса(Запрос, ЕдиницаИзмерения);
	ТекстЗапроса = ПолучитьТекстЗапроса_ДоходыОтИнвестированияСредствПенсионныхНакоплений();
		
	ДополнитьТекстЗапросаТаблицейРасшифровки(ТекстЗапроса, ПолеРасшифровки, СНачалаГода);
			
	Запрос.Текст = ТекстЗапроса;
		
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ДополнитьТекстЗапросаТаблицейРасшифровки(ТекстЗапроса, ПолеРасшифровки, СНачалаГода) 
			
	Если ПолеРасшифровки = "011" Тогда 
		// Финансовый результат от реализации 				
		ТекстЗапроса = ТекстЗапроса + "; 
			|";
		
		#Область Текст_запроса
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РасходыОбщие.Сумма КАК Сумма,
			|	_РасходыОбщие.ЭтоДоход КАК ЭтоДоход,
			|	_РасходыОбщие.КорСубконто1 КАК КорСубконто1,
			|	_РасходыОбщие.КорСубконто2 КАК КорСубконто2,
			|	_РасходыОбщие.Субконто2 КАК ЦеннаяБумага,
			|	_РасходыОбщие.Регистратор КАК Регистратор,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_РасходыОбщие.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
			|			ТОГДА ВЫРАЗИТЬ(_РасходыОбщие.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
			|		КОГДА ТИПЗНАЧЕНИЯ(_РасходыОбщие.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
			|			ТОГДА ВЫРАЗИТЬ(_РасходыОбщие.Регистратор КАК Документ.СписаниеЦеннойБумаги).ПогашениеЦеннойБумаги
			|		ИНАЧЕ _РасходыОбщие.Регистратор
			|	КОНЕЦ КАК Сделка
			|ПОМЕСТИТЬ _Расшифровка_Развернуто
			|ИЗ
			|	_РасходыОбщие КАК _РасходыОбщие
			|ГДЕ
			|	_РасходыОбщие.Показатель = &СтрокаПоказателя
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ВЫБОР
			|			КОГДА _Расшифровка_Развернуто.ЭтоДоход
			|				ТОГДА _Расшифровка_Развернуто.Сумма
			|			ИНАЧЕ -_Расшифровка_Развернуто.Сумма
			|		КОНЕЦ) КАК Сумма,
			|	_Расшифровка_Развернуто.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_Расшифровка_Развернуто.Сделка КАК Сделка
			|ПОМЕСТИТЬ _Расшифровка
			|ИЗ
			|	_Расшифровка_Развернуто КАК _Расшифровка_Развернуто
			|ГДЕ
			|	_Расшифровка_Развернуто.Сумма <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	_Расшифровка_Развернуто.ЦеннаяБумага,
			|	_Расшифровка_Развернуто.Сделка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Расшифровка.Сумма КАК ФинансовыйРезультат,
			|	_Расшифровка.Сделка КАК Сделка,
			|	_Расшифровка.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|			ТОГДА ""Акция ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Векселя)
			|			ТОГДА ""Вексель ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
			|			ТОГДА ""ДепозитарнаяРасписка ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|			ТОГДА ""Доля ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|			ТОГДА ""Ипотечный сертификат участия ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|			ТОГДА ""Облигация ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|			ТОГДА ""Пай ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
			|						ТОГДА ""Фьючерс""
			|					КОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
			|						ТОГДА ""Опцион""
			|					ИНАЧЕ """"
			|				КОНЕЦ
			|		ИНАЧЕ """"
			|	КОНЕЦ + РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Наименование,
			|	_Расшифровка.Сделка.Дата КАК ДатаВремяСделки,
			|	_Расшифровка.Сделка.НомерСделки КАК НомерСделки,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.Сделка) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|			ТОГДА ""Погашение""
			|		ИНАЧЕ _Расшифровка.Сделка.ВидСделки
			|	КОНЕЦ КАК ВидСделки,
			|	КодыВТорговыхСистемахСрезПоследнихISIN.Код КАК ISIN,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ГосударственныйРегистрационныйНомер,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.Сделка) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.Сделка КАК Документ.ПогашениеЦеннойБумаги).Количество
			|		ИНАЧЕ УсловияСделокСрезПоследних.Количество
			|	КОНЕЦ КАК Количество,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.Сделка) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.Сделка КАК Документ.ПогашениеЦеннойБумаги).Сумма
			|		ИНАЧЕ УсловияСделокСрезПоследних.Сумма
			|	КОНЕЦ * КурсыВалют.Курс / КурсыВалют.Кратность КАК СуммаСделки,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.Сделка) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.Сделка КАК Документ.ПогашениеЦеннойБумаги).Сумма
			|		ИНАЧЕ УсловияСделокСрезПоследних.Сумма
			|	КОНЕЦ * КурсыВалют.Курс / КурсыВалют.Кратность - _Расшифровка.Сумма КАК БалансоваяСтоимость,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.Сделка) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|			ТОГДА ВЫБОР
			|					КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|						ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
			|					КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Векселя)
			|						ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
			|					КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
			|						ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
			|					КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|						ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала
			|					КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|						ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
			|					КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|						ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
			|					КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|						ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
			|				КОНЕЦ
			|		ИНАЧЕ _Расшифровка.Сделка.ВалютаСделки
			|	КОНЕЦ КАК ВалютаСделки
			|ИЗ
			|	_Расшифровка КАК _Расшифровка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних
			|		ПО (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
			|				ИНАЧЕ ЛОЖЬ
			|			КОНЕЦ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&ДатаОкончания,
			|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
			|		ПО (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Векселя)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
			|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
			|		ПО _Расшифровка.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
			|				&ДатаОкончания,
			|				Организация = &Организация
			|					И Сделка.СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокСрезПоследних
			|		ПО _Расшифровка.Сделка = УсловияСделокСрезПоследних.Сделка
			|			И _Расшифровка.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|		ПО (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.Сделка) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|					ТОГДА ВЫБОР
			|								КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|									ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
			|								КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Векселя)
			|									ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
			|								КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
			|									ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
			|								КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|									ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала
			|								КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|									ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
			|								КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|									ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
			|								КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|									ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
			|							КОНЕЦ = КурсыВалют.Валюта
			|							И НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(_Расшифровка.Сделка КАК Документ.ПогашениеЦеннойБумаги).Дата, ДЕНЬ) = КурсыВалют.Период
			|				ИНАЧЕ УсловияСделокСрезПоследних.Сделка.ВалютаСделки = КурсыВалют.Валюта
			|						И УсловияСделокСрезПоследних.ДатаИсполнения = КурсыВалют.Период
			|			КОНЕЦ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаВремяСделки
			|ИТОГИ
			|	СУММА(ФинансовыйРезультат),
			|	СУММА(СуммаСделки),
			|	СУММА(БалансоваяСтоимость)
			|ПО
			|	ОБЩИЕ";

		#КонецОбласти
		
		Если СНачалаГода Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_РасходыОбщие КАК", "_РасходыОбщие_СНачалаГода КАК");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаПоказателя", """ФинансовыйРезультатОтРеализации_СНачалаГода""");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаПоказателя", """ФинансовыйРезультатОтРеализации""");
		КонецЕсли; 		
				
	Иначе
		
		// Финансовый результат от переоценки активов				
		ТекстЗапроса = ТекстЗапроса + "; 
			|";
		
		#Область Текст_запроса
		
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РасходыОбщие.Сумма КАК Сумма,
			|	_РасходыОбщие.ЭтоДоход КАК ЭтоДоход,
			|	_РасходыОбщие.КорСубконто1 КАК КорСубконто1,
			|	_РасходыОбщие.КорСубконто2 КАК КорСубконто2,
			|	_РасходыОбщие.Субконто2 КАК ЦеннаяБумага,
			|	_РасходыОбщие.Регистратор КАК Переоценка
			|ПОМЕСТИТЬ _Расшифровка_Развернуто
			|ИЗ
			|	_РасходыОбщие КАК _РасходыОбщие
			|ГДЕ
			|	_РасходыОбщие.Показатель = &СтрокаПоказателя
			|	И ТИПЗНАЧЕНИЯ(_РасходыОбщие.Регистратор) = ТИП(Документ.ПереоценкаЦенныхБумаг)
			|	И _РасходыОбщие.Сумма <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА _РасходыОбщие.ЭтоДоход
			|			ТОГДА _РасходыОбщие.Сумма
			|		ИНАЧЕ -_РасходыОбщие.Сумма
			|	КОНЕЦ КАК Сумма,
			|	_РасходыОбщие.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ _Расшифровка_НеЦБ
			|ИЗ
			|	_РасходыОбщие КАК _РасходыОбщие
			|ГДЕ
			|	_РасходыОбщие.Показатель = &СтрокаПоказателя
			|	И ТИПЗНАЧЕНИЯ(_РасходыОбщие.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
			|	И _РасходыОбщие.Сумма <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ВЫБОР
			|			КОГДА _Расшифровка_Развернуто.ЭтоДоход
			|				ТОГДА _Расшифровка_Развернуто.Сумма
			|			ИНАЧЕ -_Расшифровка_Развернуто.Сумма
			|		КОНЕЦ) КАК Сумма,
			|	_Расшифровка_Развернуто.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_Расшифровка_Развернуто.Переоценка КАК Переоценка
			|ПОМЕСТИТЬ _Расшифровка
			|ИЗ
			|	_Расшифровка_Развернуто КАК _Расшифровка_Развернуто
			|ГДЕ
			|	_Расшифровка_Развернуто.Сумма <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	_Расшифровка_Развернуто.ЦеннаяБумага,
			|	_Расшифровка_Развернуто.Переоценка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПартииЦенныхБумаг.Регистратор КАК Регистратор,
			|	ПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(ПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ФинансовыйРезультат
			|ПОМЕСТИТЬ _ПартииЦБ
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК ПартииЦенныхБумаг
			|ГДЕ
			|	ПартииЦенныхБумаг.Организация = &Организация
			|	И ПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
			|	И ПартииЦенныхБумаг.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ГОД) И &ДатаОкончания
			|	И ТИПЗНАЧЕНИЯ(ПартииЦенныхБумаг.Регистратор) = ТИП(Документ.ПереоценкаЦенныхБумаг)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПартииЦенныхБумаг.ЦеннаяБумага,
			|	ПартииЦенныхБумаг.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
			|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) КАК СправедливаяСтоимость,
			|	СтоимостьПереоценки.Регистратор КАК Ссылка,
			|	СтоимостьПереоценки.Регистратор.Дата КАК ДатаПереоценки,
			|	СУММА(_ПартииЦБ.ФинансовыйРезультат) КАК ФинансовыйРезультат
			|ПОМЕСТИТЬ _ПереоценкаЦБ
			|ИЗ
			|	_ПартииЦБ КАК _ПартииЦБ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
			|		ПО (СтоимостьПереоценки.Регистратор = _ПартииЦБ.Регистратор)
			|			И (СтоимостьПереоценки.ЦеннаяБумага = _ПартииЦБ.ЦеннаяБумага)
			|ГДЕ
			|	СтоимостьПереоценки.Организация = &Организация
			|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.БухгалтерскийУчет)
			|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаПереоценки)
			|	И СтоимостьПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
			|	И СтоимостьПереоценки.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ГОД) И &ДатаОкончания
			|	И СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	СтоимостьПереоценки.ЦеннаяБумага,
			|	СтоимостьПереоценки.Регистратор,
			|	СтоимостьПереоценки.Регистратор.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Расшифровка.Сумма КАК ФинансовыйРезультат,
			|	ЕСТЬNULL(_ПереоценкаЦБ.ФинансовыйРезультат, 0) КАК Переоценка,
			|	ЕСТЬNULL(_ПереоценкаЦБ.СправедливаяСтоимость, 0) КАК СправедливаяСтоимость,
			|	_Расшифровка.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|			ТОГДА ""Акция ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Векселя)
			|			ТОГДА ""Вексель ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
			|			ТОГДА ""ДепозитарнаяРасписка ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|			ТОГДА ""Доля ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|			ТОГДА ""Ипотечный сертификат участия ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|			ТОГДА ""Облигация ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|			ТОГДА ""Пай ""
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
			|						ТОГДА ""Фьючерс""
			|					КОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
			|						ТОГДА ""Опцион""
			|					ИНАЧЕ """"
			|				КОНЕЦ
			|		ИНАЧЕ """"
			|	КОНЕЦ + РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Наименование,
			|	_ПереоценкаЦБ.ДатаПереоценки КАК ДатаПереоценки,
			|	КодыВТорговыхСистемахСрезПоследнихISIN.Код КАК ISIN,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
			|		КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|			ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ГосударственныйРегистрационныйНомер,
			|	_ПереоценкаЦБ.Количество КАК Количество,
			|	ЕСТЬNULL(_ПереоценкаЦБ.СправедливаяСтоимость, 0) - _Расшифровка.Сумма КАК БалансоваяСтоимость
			|ИЗ
			|	_Расшифровка КАК _Расшифровка
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦБ КАК _ПереоценкаЦБ
			|		ПО _Расшифровка.Переоценка = _ПереоценкаЦБ.Ссылка
			|			И _Расшифровка.ЦеннаяБумага = _ПереоценкаЦБ.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних
			|		ПО (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
			|				ИНАЧЕ ЛОЖЬ
			|			КОНЕЦ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&ДатаОкончания,
			|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
			|		ПО (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Векселя)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_Расшифровка.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|					ТОГДА ВЫРАЗИТЬ(_Расшифровка.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
			|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
			|		ПО _Расшифровка.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_Расшифровка_НеЦБ.Сумма,
			|	NULL,
			|	NULL,
			|	NULL,
			|	_Расшифровка_НеЦБ.Регистратор,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL
			|ИЗ
			|	_Расшифровка_НеЦБ КАК _Расшифровка_НеЦБ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПереоценки
			|ИТОГИ
			|	СУММА(ФинансовыйРезультат),
			|	СУММА(СправедливаяСтоимость),
			|	СУММА(БалансоваяСтоимость)
			|ПО
			|	ОБЩИЕ";    
		
		#КонецОбласти
		
		Если СНачалаГода Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_РасходыОбщие КАК", "_РасходыОбщие_СНачалаГода КАК");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаПоказателя", """ФинансовыйРезультатОтПереоценкиАктивов_СНачалаГода""");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаПоказателя", """ФинансовыйРезультатОтПереоценкиАктивов""");
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

























