
&НаСервереБезКонтекста
Функция СериализоватьЗначение(Значение)
	
	Если      ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧРД=.; ЧН=0; ЧГ=");
	Иначе
		Возврат СокрЛП(Значение);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СфомироватьДокументыСЭД(Организация, СчетДоверительногоУправления, Период, КаталогФайлов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрПлатежей.СтрокаБанковскойВыписки КАК _СтрокаБанковскойВыписки,
		|	ДокументСтрокаБанковскойВыписки.НомерПлатежногоДокумента КАК PaymentNumber,
		|	ДокументСтрокаБанковскойВыписки.ДатаПлатежногоДокумента КАК PayDate,
		|	ДокументСтрокаБанковскойВыписки.Сумма КАК PayAmount,
		|	ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Валюта.ПараметрыПрописиНаРусском КАК PayAmountStr,
		|	ДокументСтрокаБанковскойВыписки.НазначениеПлатежа КАК PurposeOfPay,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Договор.НаименованиеВладельцаДляДокументов
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ЮрФизЛицоКонтрагента.ПолноеНаименованиеПоУставу
		|	КОНЕЦ КАК Payer,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ЮрЛицоОрганизации.ИНН
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ЮрФизЛицоКонтрагента.ИНН
		|	КОНЕЦ КАК INNPayer,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ЮрЛицоОрганизации.КПП
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ЮрФизЛицоКонтрагента.КПП
		|	КОНЕЦ КАК KPPPayer,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.НомерСчета
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.НомерСчета
		|	КОНЕЦ КАК PayerAccount,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Банк.Код
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.Банк.Код
		|	КОНЕЦ КАК BIKPayer,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Банк.КоррСчет
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.Банк.КоррСчет
		|	КОНЕЦ КАК PayerBankAccount,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Банк)
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.Банк)
		|	КОНЕЦ КАК PayerBank,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Договор.НаименованиеВладельцаДляДокументов
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ЮрФизЛицоКонтрагента.ПолноеНаименованиеПоУставу
		|	КОНЕЦ КАК Receiver,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ЮрЛицоОрганизации.ИНН
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ЮрФизЛицоКонтрагента.ИНН
		|	КОНЕЦ КАК INNReceiver,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ЮрЛицоОрганизации.КПП
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ЮрФизЛицоКонтрагента.КПП
		|	КОНЕЦ КАК KPPReceiver,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.НомерСчета
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.НомерСчета
		|	КОНЕЦ КАК ReceiverAccount,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Банк.Код
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.Банк.Код
		|	КОНЕЦ КАК BIKReceiver,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Банк.КоррСчет
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.Банк.КоррСчет
		|	КОНЕЦ КАК ReceiverBankAccount,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДокументСтрокаБанковскойВыписки.РасчетныйСчет.Банк)
		|		КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДокументСтрокаБанковскойВыписки.РасчетныйСчетКонтрагента.Банк)
		|	КОНЕЦ КАК BankReceiver,
		|	ВЫБОР
		|		КОГДА ДокументСтрокаБанковскойВыписки.ВидПлатежногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхДокументов.БанковскийОрдер)
		|			ТОГДА ""17""
		|		КОГДА ДокументСтрокаБанковскойВыписки.ВидПлатежногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхДокументов.ПлатежноеПоручение)
		|			ТОГДА ""01""
		|	КОНЕЦ КАК OperKind,
		|	""Электронно"" КАК PayKind,
		|	""как копия первичного документа"" КАК Purpose,
		|	""5"" КАК OrderOfPayments,
		|	""01"" КАК PayerStatus,
		|	""810"" КАК IDCurrency,
		|	ДокументСтрокаБанковскойВыписки.Дата КАК WriteOffDate,
		|	ЗначенияДополнительныхСведений.Значение КАК IDInvestcase
		|ИЗ
		|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтрокаБанковскойВыписки КАК ДокументСтрокаБанковскойВыписки
		|		ПО РеестрПлатежей.СтрокаБанковскойВыписки = ДокументСтрокаБанковскойВыписки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК ЮрЛицоОрганизации
		|		ПО РеестрПлатежей.Организация.ЮрФизЛицо = ЮрЛицоОрганизации.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК ЮрФизЛицоКонтрагента
		|		ПО (ДокументСтрокаБанковскойВыписки.Контрагент = ЮрФизЛицоКонтрагента.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО (ЗначенияДополнительныхСведений.Свойство.Ключ = &Ключ)
		|			И РеестрПлатежей.СчетДоверительногоУправления = ЗначенияДополнительныхСведений.Объект
		|ГДЕ
		|	РеестрПлатежей.ДатаПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И РеестрПлатежей.Организация = &Организация
		|	И РеестрПлатежей.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("Ключ",                       "ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.ИнвестСчет");
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьXML = Новый ЗаписьXML;
		
		Попытка
			ЗаписьXML.ОткрытьФайл(КаталогФайлов + ?(Прав(КаталогФайлов, 1) = "\", "", "\") + "527\" + СтрЗаменить(СокрЛП(СчетДоверительногоУправления), """", "") + ", " + Выборка._СтрокаБанковскойВыписки.Номер + ".xml", "WINDOWS-1251");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() + ". Выгрузка отменена по счету ДУ " + СокрЛП(СчетДоверительногоУправления));
			Прервать;
		КонецПопытки;
		
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("EDO_ODKF527");
		
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Если Лев(Колонка.Имя, 1) = "_" Тогда
				Продолжить;
			КонецЕсли;
			
			Если Колонка.Имя = "PayAmountStr" Тогда
				ТекстЭлемента = ЧислоПрописью(Выборка.PayAmount,, Выборка.PayAmountStr);
			Иначе
				ТекстЭлемента = СериализоватьЗначение(Выборка[Колонка.Имя]);
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента(Колонка.Имя);
			ЗаписьXML.ЗаписатьТекст(ТекстЭлемента);
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Колонка.Имя
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // EDO_ODKF
		ЗаписьXML.Закрыть();
	КонецЦикла;
	
КонецФункции