Функция ПолучитьДанныеРеклассификаций(НачалоПериода, ОкончаниеПериода, Организация, СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеклассификацияАктивовЕПС.Ссылка КАК Ссылка,
		|	РеклассификацияАктивовЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РеклассификацияАктивовЕПС.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	РеклассификацияАктивовЕПС.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПСРодитель,
		|	РеклассификацияАктивовЕПС.КорректировкаЭСПРазницаППРезервВПереоценку КАК КорректировкаЭСПРазницаППРезервВПереоценку,
		|	РеклассификацияАктивовЕПСПартии.Партия КАК Партия,
		|	РеклассификацияАктивовЕПСПартии.СтрокаПартии КАК СтрокаПартии,
		|	РеклассификацияАктивовЕПСПартии.Количество КАК Количество,
		|	РеклассификацияАктивовЕПСПартии.Стоимость КАК Стоимость,
		|	РеклассификацияАктивовЕПСПартии.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.Переоценка КАК Переоценка,
		|	РеклассификацияАктивовЕПСПартии.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремия КАК ДисконтПремия,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.КорректировкаЭСП КАК КорректировкаЭСП,
		|	РеклассификацияАктивовЕПСПартии.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаПоПрофсуждению КАК ДооценкаПоПрофсуждению,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаПоПрофсуждениюВВалютеУчета КАК ДооценкаПоПрофсуждениюВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаКупона КАК ДооценкаКупона,
		|	РеклассификацияАктивовЕПСПартии.ДооценкаКупонаВВалютеУчета КАК ДооценкаКупонаВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеДисконтаПремии КАК ДоначислениеДисконтаПремии,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеДисконтаПремииВВалютеУчета КАК ДоначислениеДисконтаПремииВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеКорректировкиЭСП КАК ДоначислениеКорректировкиЭСП,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеКорректировкиЭСПВВалютеУчета КАК ДоначислениеКорректировкиЭСПВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеРазницаПервоначальногоПризнания КАК ДоначислениеРазницаПервоначальногоПризнания,
		|	РеклассификацияАктивовЕПСПартии.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета КАК ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение
		|ИЗ
		|	Документ.РеклассификацияАктивовЕПС КАК РеклассификацияАктивовЕПС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО (РеклассификацияАктивовЕПСПартии.Ссылка = РеклассификацияАктивовЕПС.Ссылка)
		|			И (РеклассификацияАктивовЕПС.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			И (РеклассификацияАктивовЕПС.Организация = &Организация)
		|			И (РеклассификацияАктивовЕПС.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (РеклассификацияАктивовЕПС.Проведен)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
