Процедура УстановитьБлокировки()
	
	//Если МонопольныйРежим() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//БлокировкаДанных = Новый БлокировкаДанных;
	//
	//ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ГипотетическийБэкофисныйРегистрДляРеклассификаций");
	//ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	//ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	//ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",                 ЭтотОбъект.ЦеннаяБумага);
	//
	//БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	//УстановитьБлокировки();
	//
	//РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	//
	//Движения.ГипотетическийБэкофисныйРегистрДляРеклассификаций.Записывать = Истина;
	
	Движения.ОперацииСЦеннымиБумагами.Записывать   = Истина;
	
	Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
	Движение.Операция                     = ЭтотОбъект.Ссылка;
	Движение.ВидДвижения                  = Перечисления.ВидыДвижений.Расход;
	Движение.Организация                  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.Рынок 						  = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ЭтотОбъект.ЦеннаяБумага);
	Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумага;
	Движение.ДатаПоставки                 = ЭтотОбъект.Дата;
	Движение.Количество                   = ЭтотОбъект.Партии.Итог("Количество");
	Движение.Сумма                        = ЭтотОбъект.Партии.Итог("СтоимостьВВалютеУчета")
											+ ЭтотОбъект.Партии.Итог("ПереоценкаВВалютеУчета")
											+ ЭтотОбъект.Партии.Итог("ДисконтПремияНачисленныйВВалютеУчета")
											+ ЭтотОбъект.Партии.Итог("КорректировкаЭСПВВалютеУчета")
											+ ЭтотОбъект.Партии.Итог("РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета");
	Движение.СуммаКупона                  = 0;
	Движение.ДатаОперации                 = ЭтотОбъект.Дата;
	Движение.Валюта						  = ЭтотОбъект.Организация.ВалютаУчета;
	Движение.СтрокаПартии                 = 0;
	Движение.ДатаПокупки				  = ЭтотОбъект.Дата;
	
		
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, Отказ) Экспорт
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	МассивУчетныхАктивов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Переоценка КАК Переоценка,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС1,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГодаОстаток
		|ПОМЕСТИТЬ _ДвиженияПереоценки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|					И Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
		|		ПО БухПартииЦенныхБумаг.Партия = БухПартииЦенныхБумагОстатки.Партия
		|			И БухПартииЦенныхБумаг.СтрокаПартии = БухПартииЦенныхБумагОстатки.СтрокаПартии
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.Количество = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремия
		|		КОНЕЦ) КАК Дисконт,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия <= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремия
		|		КОНЕЦ) КАК Премия,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|		КОНЕЦ) КАК ДисконтНачисленный,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия <= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|		КОНЕЦ) КАК ПремияНачисленная,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|		КОНЕЦ) КАК ДисконтНачисленныйВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия <= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|		КОНЕЦ) КАК ПремияНачисленнаяВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСП) КАК КорректировкаЭСП,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета) КАК КорректировкаЭСПВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрок) КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	СУММА(БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета) КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.СчетУчета КАК УчетныйАктивЕПС_СчетУчета,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаСписанияПремии КАК УчетныйАктивЕПС_АналитикаСписанияПремии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаПроцентныхДоходов КАК УчетныйАктивЕПС_АналитикаПроцентныхДоходов,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаДоходовОтПереоценки КАК УчетныйАктивЕПС_АналитикаДоходовОтПереоценки,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаРасходовОтПереоценки КАК УчетныйАктивЕПС_АналитикаРасходовОтПереоценки,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК УчетныйАктивЕПС_СчетУчетаПереоценкиА,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК УчетныйАктивЕПС_СчетУчетаПереоценкиП
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.Количество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ВидДвижения,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.СчетУчета,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.СчетУчетаПереоценкиА,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.СчетУчетаПереоценкиП,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаСписанияПремии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаПроцентныхДоходов,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаДоходовОтПереоценки,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаРасходовОтПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС КАК УчетныйАктивЕПС_Расход,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчета КАК УчетныйАктивЕПС_Расход_СчетУчета,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиА,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиП,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаКорректировокА КАК УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаКорректировокП КАК УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаРезервов КАК УчетныйАктивЕПС_Расход_СчетУчетаРезервов,
		|	_ДвиженияПартийРасход.Количество КАК Количество,
		|	_ДвиженияПартийРасход.СтоимостьКупона КАК СтоимостьКупона,
		|	_ДвиженияПартийРасход.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	_ДвиженияПартийРасход.ПереоценкаКупона КАК ПереоценкаКупона,
		|	_ДвиженияПартийРасход.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	_ДвиженияПартийРасход.ПогашениеКупонаНеИсполненноеВСрок КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	_ДвиженияПартийРасход.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	_ДвиженияПартийРасход.Стоимость КАК Стоимость_Расход,
		|	_ДвиженияПартийРасход.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.Переоценка КАК Переоценка_Расход,
		|	_ДвиженияПартийРасход.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.ДисконтНачисленный КАК ДисконтНачисленный_Расход,
		|	_ДвиженияПартийРасход.ДисконтНачисленныйВВалютеУчета КАК ДисконтНачисленныйВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.ПремияНачисленная КАК ПремияНачисленная_Расход,
		|	_ДвиженияПартийРасход.ПремияНачисленнаяВВалютеУчета КАК ПремияНачисленнаяВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.КорректировкаЭСП КАК КорректировкаЭСП_Расход,
		|	_ДвиженияПартийРасход.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход,
		|	_ДвиженияПартийРасход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение_Расход,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС КАК УчетныйАктивЕПС_Приход,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчета КАК УчетныйАктивЕПС_Приход_СчетУчета,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаКорректировокА КАК УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаКорректировокП КАК УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаРезервов КАК УчетныйАктивЕПС_Приход_СчетУчетаРезервов,
		|	_ДвиженияПартийПриход.Стоимость КАК Стоимость_Приход,
		|	_ДвиженияПартийПриход.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.Переоценка КАК Переоценка_Приход,
		|	_ДвиженияПартийПриход.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.ДисконтНачисленный КАК ДисконтНачисленный_Приход,
		|	_ДвиженияПартийПриход.ДисконтНачисленныйВВалютеУчета КАК ДисконтНачисленныйВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.ПремияНачисленная КАК ПремияНачисленная_Приход,
		|	_ДвиженияПартийПриход.ПремияНачисленнаяВВалютеУчета КАК ПремияНачисленнаяВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.КорректировкаЭСП КАК КорректировкаЭСП_Приход,
		|	_ДвиженияПартийПриход.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход,
		|	_ДвиженияПартийПриход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение_Приход,
		|	_ДвиженияПартийПриход.Партия КАК Партия_Приход,
		|	_ДвиженияПартийПриход.СтрокаПартии КАК СтрокаПартии_Приход,
		|	_ДвиженияПартийРасход.Партия КАК Партия_Расход,
		|	_ДвиженияПартийРасход.СтрокаПартии КАК СтрокаПартии_Расход
		|ИЗ
		|	Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДвиженияПартий КАК _ДвиженияПартийРасход
		|		ПО РеклассификацияАктивовЕПСПартии.Партия = _ДвиженияПартийРасход.Партия
		|			И РеклассификацияАктивовЕПСПартии.СтрокаПартии = _ДвиженияПартийРасход.СтрокаПартии
		|			И (_ДвиженияПартийРасход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДвиженияПартий КАК _ДвиженияПартийПриход
		|		ПО (_ДвиженияПартийПриход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И РеклассификацияАктивовЕПСПартии.Ссылка = _ДвиженияПартийПриход.Партия
		|					И РеклассификацияАктивовЕПСПартии.НомерСтроки = _ДвиженияПартийПриход.СтрокаПартии
		|				ИЛИ _ДвиженияПартийПриход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И РеклассификацияАктивовЕПСПартии.Партия = _ДвиженияПартийПриход.Партия
		|					И РеклассификацияАктивовЕПСПартии.СтрокаПартии = _ДвиженияПартийПриход.СтрокаПартии)
		|ГДЕ
		|	РеклассификацияАктивовЕПСПартии.Ссылка = &Регистратор";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	ПараметрыПроводки = Новый Структура;
	
	ПараметрыПроводки.Вставить("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	ПараметрыПроводки.Вставить("ВалютаНоминала", ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала);
	ПараметрыПроводки.Вставить("ПереноситьЧерезСчет000", Истина);
	
	НакопленнаяДельта = 0;
	НакопленнаяДельтаВВалютеУчета = 0;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы", ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ПараметрыНачисления = Новый Структура;
	
	ПараметрыНачисления.Вставить("НастройкиУчета",	НастройкиУчета);
	
	ПараметрыНачисления.Вставить("ЦеннаяБумага",	ЭтотОбъект.ЦеннаяБумага);
	ПараметрыНачисления.Вставить("ВалютаНоминала",	ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала);
	
	
	// сначала начислим переоценку, купон, дисконт/премию
	ТаблицаДвиженийПереоценки = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДвиженияПереоценки"].ПолучитьДанные().Выгрузить();
	Для каждого ДвижениеПереоценки Из ТаблицаДвиженийПереоценки Цикл
		
		Если МассивУчетныхАктивов.Найти(ДвижениеПереоценки.УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(ДвижениеПереоценки.УчетныйАктивЕПС);
		КонецЕсли;
		
		ПараметрыНачисления.Вставить("Партия",			ДвижениеПереоценки.Партия);
		ПараметрыНачисления.Вставить("СтрокаПартии",	ДвижениеПереоценки.СтрокаПартии);
		ПараметрыНачисления.Вставить("Количество",		0);
		ПараметрыНачисления.Вставить("ПроверитьПарные",	"");
		
		// дисконт-премия	
		ПараметрыНачисления.Вставить("Сумма",				ДвижениеПереоценки.ДисконтПремияНачисленный);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ДвижениеПереоценки.УчетныйАктивЕПС.СчетУчета);
		Если ДвижениеПереоценки.ДисконтПремияНачисленный < 0 Тогда
			ПараметрыНачисления.Вставить("Содержание",			"Списание премии");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы04);
			ПараметрыНачисления.Вставить("ГФУ",					ДвижениеПереоценки.УчетныйАктивЕПС_АналитикаСписанияПремии);
		Иначе
			ПараметрыНачисления.Вставить("Содержание",			"Начисление дисконта");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы01);
			ПараметрыНачисления.Вставить("ГФУ",					ДвижениеПереоценки.УчетныйАктивЕПС_АналитикаПроцентныхДоходов);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
			
		// ННКД	
		ПараметрыНачисления.Вставить("Сумма",				ДвижениеПереоценки.ПереоценкаКупона);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ДвижениеПереоценки.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Переоценка купона");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
		ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы01);
		ПараметрыНачисления.Вставить("ГФУ",					ДвижениеПереоценки.УчетныйАктивЕПС_АналитикаПроцентныхДоходов);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// переоценка
		БалансоваяПереоценка = ДвижениеПереоценки.ПереоценкаОстаток;
		БалансоваяПереоценкаВВалютеУчета = ДвижениеПереоценки.ПереоценкаВВалютеУчетаОстаток;
		
		ПараметрыНачисления.Вставить("Сумма",				ДвижениеПереоценки.Переоценка);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ДвижениеПереоценки.ПереоценкаВВалютеУчета);
		ПараметрыНачисления.Вставить("СуммаСНачалаГода",	ДвижениеПереоценки.ПереоценкаСНачалаГодаОстаток + ДвижениеПереоценки.ПереоценкаВВалютеУчета);
		ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяПереоценка);
		ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяПереоценкаВВалютеУчета);
		
		ПараметрыНачисления.Вставить("Содержание",			"Переоценка");
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
		
		ПараметрыНачисления.Вставить("ПроверитьПарные",		"Переоценка");
		
		Если (БалансоваяПереоценкаВВалютеУчета > 0)ИЛИ(БалансоваяПереоценкаВВалютеУчета = 0 И ДвижениеПереоценки.ПереоценкаВВалютеУчета > 0) Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ДвижениеПереоценки.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ДвижениеПереоценки.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ДвижениеПереоценки.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ДвижениеПереоценки.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
		КонецЕсли;
		
		Если (ДвижениеПереоценки.ПереоценкаСНачалаГодаОстаток > 0)ИЛИ(ДвижениеПереоценки.ПереоценкаСНачалаГодаОстаток = 0 И ДвижениеПереоценки.ПереоценкаВВалютеУчета > 0) Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ДвижениеПереоценки.УчетныйАктивЕПС));
			ПараметрыНачисления.Вставить("ГФУ",				ДвижениеПереоценки.УчетныйАктивЕПС_АналитикаДоходовОтПереоценки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ДвижениеПереоценки.УчетныйАктивЕПС, Ложь));
			ПараметрыНачисления.Вставить("ГФУПарный",		ДвижениеПереоценки.УчетныйАктивЕПС_АналитикаРасходовОтПереоценки);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ДвижениеПереоценки.УчетныйАктивЕПС, Ложь));
			ПараметрыНачисления.Вставить("ГФУ",				ДвижениеПереоценки.УчетныйАктивЕПС_АналитикаРасходовОтПереоценки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ДвижениеПереоценки.УчетныйАктивЕПС));
			ПараметрыНачисления.Вставить("ГФУПарный",		ДвижениеПереоценки.УчетныйАктивЕПС_АналитикаДоходовОтПереоценки);
		КонецЕсли;
			
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
	КонецЦикла;
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыПроводки.Вставить("Партия_Приход", ВыборкаДетальныеЗаписи.Партия_Приход);
		ПараметрыПроводки.Вставить("СтрокаПартии_Приход", ВыборкаДетальныеЗаписи.СтрокаПартии_Приход);
		
		ПараметрыПроводки.Вставить("Партия_Расход", ВыборкаДетальныеЗаписи.Партия_Расход);
		ПараметрыПроводки.Вставить("СтрокаПартии_Расход", ВыборкаДетальныеЗаписи.СтрокаПартии_Расход);
		
		// теперь будем переносить
		// 
		// при любом варианте рекласса перенесем:
		//	1. Неизменяемые части стоимости: УНКД, ННКД, просроченный НКД
		//	2. Перенесем части стоимости, которые уходят целиком, но потом могут быть откорректированы: Тело, ДисконтПремияНачисленный
		
		ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчета);
		ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
		
		// сначала перенесем Стоимость 1к1
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
		ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.Стоимость_Расход);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Расход);
		ПараметрыПроводки.Вставить("Количество", ВыборкаДетальныеЗаписи.Количество);
		
		ПараметрыПроводки.Вставить("Содержание", "Тело ценной бумаги");
		СоздатьПроводкуПереноса(ПараметрыПроводки);
		
		ПараметрыПроводки.Вставить("Количество", 0);
		
		// также 1к1 перенесем СтоимостьКупона
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
		ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.СтоимостьКупона);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета);
		
		ПараметрыПроводки.Вставить("Содержание", "Купон, уплаченный при покупке");
		СоздатьПроводкуПереноса(ПараметрыПроводки);
		
		// также 1к1 перенесем ПереоценкаКупона
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
		ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ПереоценкаКупона);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета);
		
		ПараметрыПроводки.Вставить("Содержание", "Купон начисленный");
		СоздатьПроводкуПереноса(ПараметрыПроводки);
		
		// также 1к1 перенесем ПогашениеКупонаНеИсполненноеВСрок
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок);
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок);
		ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ПогашениеКупонаНеИсполненноеВСрок);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета);
		
		ПараметрыПроводки.Вставить("Содержание", "Погашение купона не исполненное в срок");
		СоздатьПроводкуПереноса(ПараметрыПроводки);
		
		// аналогично ДисконтНачисленный
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
		ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ДисконтНачисленный_Расход);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Расход);
		
		ПараметрыПроводки.Вставить("Содержание", "Дисконт");
		СоздатьПроводкуПереноса(ПараметрыПроводки);
		
		// и ПремияНачисленная
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
		ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ПремияНачисленная_Расход);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Расход);
		
		ПараметрыПроводки.Вставить("Содержание", "Премия");
		СоздатьПроводкуПереноса(ПараметрыПроводки);
		
		// остальное
		Если ВыборкаДетальныеЗаписи.Переоценка_Расход <> 0 Тогда // СС → АС
			
			// при такой реклассификации (СС → АС) наша задача распихать переоценку и мы действуем так:
			//		0. Корректировку ПП в корректировку ЭСП - это ради одного случая сделано
			//		1. Пихаем сколько нужно в тело (если нужно, конечно)
			//		2. Пихаем сколько нужно в ДисконтПремияНачисленный (если нужно, конечно)  - это пока отключил ибо нелогично совсем
			//		3. Пихаем сколько нужно в КорректировкуПП (если нужно, конечно)
			//		4. Пихаем сколько ОСТАЛОСЬ переоценки в КорректировкуЭСП (если нужно, конечно)
			//		5. Если после предыдущего шага КорректировкаЭСП еще не доросла до нужной суммы - доначисляем
			
			НачислитьКорректировкаЭСП = 0;
			НачислитьКорректировкаЭСПВВалютеУчета = 0;
			
			Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход <> 0
				И ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход = 0 Тогда // вся корректировка ПП в корректировку ЭСП
				
				НачислитьКорректировкаЭСП = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход;
				НачислитьКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход;
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
				Если НачислитьКорректировкаЭСП > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
				КонецЕсли;
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
				Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
				КонецЕсли;
				
				ПараметрыПроводки.Вставить("Сумма", НачислитьКорректировкаЭСП);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьКорректировкаЭСПВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос корректировку ПП в корректировку ЭСП");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
			КонецЕсли;
			
			
			ОсталосьПереоценки = ВыборкаДетальныеЗаписи.Переоценка_Расход;
			ОсталосьПереоценкиВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход;
			
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			Если ОсталосьПереоценки > 0 Тогда
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиА);
			Иначе
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиП);
			КонецЕсли;
			ПараметрыПроводки.Вставить("Содержание", "Переоценка");
			
			Если ВыборкаДетальныеЗаписи.Стоимость_Расход <> ВыборкаДетальныеЗаписи.Стоимость_Приход Тогда // ага, нужно стоимость добить
			
				НачислитьСтоимость = ВыборкаДетальныеЗаписи.Стоимость_Приход - ВыборкаДетальныеЗаписи.Стоимость_Расход;
				НачислитьСтоимостьВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Расход;
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
				
				ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в тело ценной бумаги");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				ОсталосьПереоценки = ОсталосьПереоценки - НачислитьСтоимость;
				ОсталосьПереоценкиВВалютеУчета = ОсталосьПереоценкиВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
			КонецЕсли;
			
			//Если ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Расход <> ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Приход Тогда // дисконт/премию добиваем
			//
			//	НачислитьДисконтПремияНачисленный = ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Приход - ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Расход;
			//	НачислитьДисконтПремияНачисленныйВВалютеУчета = ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчета_Расход;
			//	
			//	Если ВыборкаДетальныеЗаписи.ДисконтПремия_Приход > 0 Тогда
			//		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
			//	Иначе
			//		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
			//	КонецЕсли;
			//	ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
			//	
			//	ПараметрыПроводки.Вставить("Сумма", НачислитьДисконтПремияНачисленный);
			//	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьДисконтПремияНачисленныйВВалютеУчета);
			//	
			//	ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в дисконт");
			//	СоздатьПроводкуПереноса(ПараметрыПроводки);
			//	
			//	ОсталосьПереоценки = ОсталосьПереоценки - НачислитьДисконтПремияНачисленный;
			//	ОсталосьПереоценкиВВалютеУчета = ОсталосьПереоценкиВВалютеУчета - НачислитьДисконтПремияНачисленныйВВалютеУчета;
			//	
			//КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход - НачислитьКорректировкаЭСП <> ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход Тогда // корректировку ПП добиваем
			
				НачислитьРазницаПервоначальногоПризнания = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход + + НачислитьКорректировкаЭСП;
				НачислитьРазницаПервоначальногоПризнанияВВалютеУчета = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход + НачислитьКорректировкаЭСПВВалютеУчета;
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
				Если НачислитьРазницаПервоначальногоПризнания > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
				КонецЕсли;
				
				ПараметрыПроводки.Вставить("Сумма", НачислитьРазницаПервоначальногоПризнания);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьРазницаПервоначальногоПризнанияВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в корректировку ПП");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				ОсталосьПереоценки = ОсталосьПереоценки - НачислитьРазницаПервоначальногоПризнания;
				ОсталосьПереоценкиВВалютеУчета = ОсталосьПереоценкиВВалютеУчета - НачислитьРазницаПервоначальногоПризнанияВВалютеУчета;
				
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход <> ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход - НачислитьКорректировкаЭСП Тогда // корректировку ЭСП добиваем
				
				НадоНачислитьКорректировкаЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - НачислитьКорректировкаЭСП;
				НадоНачислитьКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход - НачислитьКорректировкаЭСПВВалютеУчета;
				
				НачислитьКорректировкаЭСП = ОсталосьПереоценки;
				НачислитьКорректировкаЭСПВВалютеУчета = ОсталосьПереоценкиВВалютеУчета;
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
				Если НачислитьКорректировкаЭСП > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
				КонецЕсли;
				
				ПараметрыПроводки.Вставить("Сумма", НачислитьКорректировкаЭСП);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьКорректировкаЭСПВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в корректировку ЭСП");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				ДоначислитьКорректировкаЭСП = НадоНачислитьКорректировкаЭСП - НачислитьКорректировкаЭСП;
				ДоначислитьКорректировкаЭСПВВалютеУчета = НадоНачислитьКорректировкаЭСПВВалютеУчета - НачислитьКорректировкаЭСПВВалютеУчета;
				
				ПараметрыСписания = Новый Структура;
				
				ПараметрыСписания.Вставить("Показатель", "КорректировкаЭСП");
				ПараметрыСписания.Вставить("СуммаВал", ДоначислитьКорректировкаЭСП);
				ПараметрыСписания.Вставить("СуммаУчета", ДоначислитьКорректировкаЭСПВВалютеУчета);
				ПараметрыСписания.Вставить("ВалютаУчета", ЭтотОбъект.Организация.ВалютаУчета);
				ПараметрыСписания.Вставить("УчетныйАктив", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход);
				ПараметрыСписания.Вставить("ЦеннаяБумага", ПараметрыПроводки.ЦеннаяБумага);
				ПараметрыСписания.Вставить("ВалютаНоминала", ПараметрыПроводки.ВалютаНоминала);
				ПараметрыСписания.Вставить("Сделка", Неопределено);
				ПараметрыСписания.Вставить("ПереоценкаПослеВводаНачальныхОстатков", Ложь);
				
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
				
			КонецЕсли;
			
		Иначе // АС → СС
			
			//Для Обратной совместимости оставим старый код до 31.12.23
			
			Если ЭтотОбъект.Дата <= '20231231235959' Тогда
				
				// при такой реклассификации (АС → СС) наша задача распихать резервы и корректировку ЭСП (её опционально) и мы действуем так:
				//		1. Пихаем корректировку ЭСП сколько нужно в тело 
				//		2. Пихаем корректировку ЭСП сколько нужно в переоценку 
				//		3. Пихаем резерв сколько нужно в тело 
				//		4. Пихаем резерв сколько нужно в переоценку 
				
				ОсталосьКорректировкиЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход;
				ОсталосьКорректировкиЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход - ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Приход;
				
				ОсталосьРезервов = ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход - ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Приход;
				ОсталосьРезервовВВалютеУчета = ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход - ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Приход;
				
				ДобитьСтоимость = ВыборкаДетальныеЗаписи.Стоимость_Приход - ВыборкаДетальныеЗаписи.Стоимость_Расход;
				ДобитьСтоимостьВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Расход;
				
				ДобитьПереоценку = ВыборкаДетальныеЗаписи.Переоценка_Приход;
				ДобитьПереоценкуВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Приход;
				
				
				Если ДобитьСтоимость <> 0 И ОсталосьКорректировкиЭСП <> 0 Тогда // сколько можем корректировки - в тело
					
					НачислитьСтоимость = Мин(ДобитьСтоимость, ОсталосьКорректировкиЭСП);
					НачислитьСтоимостьВВалютеУчета = Мин(ДобитьСтоимостьВВалютеУчета, ОсталосьКорректировкиЭСПВВалютеУчета);
					
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
					
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
					ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
					ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
					
					ПараметрыПроводки.Вставить("Содержание", "Перенос корректировки в тело ценной бумаги");
					СоздатьПроводкуПереноса(ПараметрыПроводки);
					
					ДобитьСтоимость = ДобитьСтоимость - НачислитьСтоимость;
					ДобитьСтоимостьВВалютеУчета = ДобитьСтоимостьВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
					ОсталосьКорректировкиЭСП = ОсталосьКорректировкиЭСП - НачислитьСтоимость;
					ОсталосьКорректировкиЭСПВВалютеУчета = ОсталосьКорректировкиЭСПВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
				КонецЕсли;
				
				Если ДобитьПереоценку <> 0 И ОсталосьКорректировкиЭСП <> 0 Тогда // сколько можем корректировки - в переоценку
					
					НачислитьСтоимость = Мин(ДобитьПереоценку, ОсталосьКорректировкиЭСП);
					НачислитьСтоимостьВВалютеУчета = Мин(ДобитьПереоценкуВВалютеУчета, ОсталосьКорректировкиЭСПВВалютеУчета);
					
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
					
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
					ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
					ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
					
					ПараметрыПроводки.Вставить("Содержание", "Перенос корректировки в переоценку");
					СоздатьПроводкуПереноса(ПараметрыПроводки);
					
					ДобитьПереоценку = ДобитьПереоценку - НачислитьСтоимость;
					ДобитьПереоценкуВВалютеУчета = ДобитьПереоценкуВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
					ОсталосьКорректировкиЭСП = ОсталосьКорректировкиЭСП - НачислитьСтоимость;
					ОсталосьКорректировкиЭСПВВалютеУчета = ОсталосьКорректировкиЭСПВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
				КонецЕсли;
				
				Если ДобитьСтоимость <> 0 И ОсталосьРезервов <> 0 Тогда // сколько можем резервов - в тело
					
					НачислитьСтоимость = Мин(ДобитьСтоимость, ОсталосьРезервов);
					НачислитьСтоимостьВВалютеУчета = Мин(ДобитьСтоимостьВВалютеУчета, ОсталосьРезервовВВалютеУчета);
					
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаРезервов);
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
					
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
					ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
					ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
					
					ПараметрыПроводки.Вставить("Содержание", "Перенос резервов в тело ценной бумаги");
					СоздатьПроводкуПереноса(ПараметрыПроводки);
					
					ДобитьСтоимость = ДобитьСтоимость - НачислитьСтоимость;
					ДобитьСтоимостьВВалютеУчета = ДобитьСтоимостьВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
					ОсталосьРезервов = ОсталосьРезервов - НачислитьСтоимость;
					ОсталосьРезервовВВалютеУчета = ОсталосьРезервовВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
				КонецЕсли;
				
				Если ДобитьПереоценку <> 0 И ОсталосьРезервов <> 0 Тогда // сколько можем резервов - в переоценку
					
					НачислитьСтоимость = Мин(ДобитьПереоценку, ОсталосьРезервов);
					НачислитьСтоимостьВВалютеУчета = Мин(ДобитьПереоценкуВВалютеУчета, ОсталосьРезервов);
					
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаРезервов);
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
					
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
					ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
					ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
					
					ПараметрыПроводки.Вставить("Содержание", "Перенос резервов в переоценку");
					СоздатьПроводкуПереноса(ПараметрыПроводки);
					
					ДобитьПереоценку = ДобитьПереоценку - НачислитьСтоимость;
					ДобитьПереоценкуВВалютеУчета = ДобитьПереоценкуВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
					ОсталосьРезервов = ОсталосьРезервов - НачислитьСтоимость;
					ОсталосьРезервовВВалютеУчета = ОсталосьРезервовВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
					
				КонецЕсли;
				
			Иначе
				// с 31.12.2023 будет другой порядок, всё переносится 1:1 
				// при такой реклассификации (АС → СС) корректировка ЭСП в корректировку ЭСП и т.д.:
					
				// КорректировкаЭСП_Расход
				Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
				КонецЕсли;
				Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
					Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход > 0 Тогда
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
					Иначе	
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП);
					КонецЕсли;
				Иначе	
					Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход > 0 Тогда
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
					Иначе	
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
					КонецЕсли;
				КонецЕсли;
				
				Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда 
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				Иначе
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
				КонецЕсли;	
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
				ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход);
				
				ПараметрыПроводки.Вставить("Содержание", "Корректировка ЭСП");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				// Переоценка_Расход
				Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиП);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП);
				КонецЕсли;
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.Переоценка_Расход);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход);
				
				ПараметрыПроводки.Вставить("Содержание", "Переоценка");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				// РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход
				Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
				КонецЕсли;
				Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
					Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
					Иначе	
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП);
					КонецЕсли;
				Иначе	
					Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
					Иначе	
						ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
					КонецЕсли;
				КонецЕсли;
				
				Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда 
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				Иначе
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
				КонецЕсли;	
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
				ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход);
				
				ПараметрыПроводки.Вставить("Содержание", "РазницаПервоначальногоПризнания");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				//ИндексацияНоминала_Расход
				//Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
				//	ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
				//Иначе	
				//	ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
				//КонецЕсли;
				//Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
				//	ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
				//Иначе	
				//	ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
				//КонецЕсли;
				//
				//ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала);
				//ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала);
				//ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход);
				//ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход);
				//
				//ПараметрыПроводки.Вставить("Содержание", "ИндексацияНоминала");
				//СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				//СуммаРезервовПодОбесценение_Расход,
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаРезервов);
				Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
				Иначе
					//ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаРезервов);
				КонецЕсли;	
				
				Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда 
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				Иначе
					ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
				КонецЕсли;	
				//ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
				ПараметрыПроводки.Вставить("Сумма", -ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", -ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход);
				
				ПараметрыПроводки.Вставить("Содержание", "Резерв");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				// Проверка контрольных соотношений
				Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
					
					РазностьСуммаПереоценкаНа47903 = ВыборкаДетальныеЗаписи.Переоценка_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход - (-ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход); //Резервы под обесценение в регистрах хранятся с противоположным знаком
					РазностьСуммаПереоценкаВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход - (-ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход); //Резервы под обесценение в регистрах хранятся с противоположным знаком
					
					Если ЗначениеЗаполнено(РазностьСуммаПереоценкаНа47903) Тогда
						ВызватьИсключение "Сумма переоценки в проводках на " + Формат(РазностьСуммаПереоценкаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(РазностьСуммаПереоценкаВВалютеУчетаНа47903) Тогда
						ВызватьИсключение "Сумма переоценки в валюте в проводках на " + Формат(РазностьСуммаПереоценкаВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					//
					//ДисконтНачисленный
					//ДисконтНачисленныйВВалютеУчета
					
					ДисконтНачисленныйНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленный_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленный_Расход;
					ДисконтНачисленныйВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Расход;
					
					Если ЗначениеЗаполнено(ДисконтНачисленныйНа47903) Тогда
						ВызватьИсключение "Сумма дисконт начисленный в проводках на " + Формат(ДисконтНачисленныйНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(ДисконтНачисленныйВВалютеУчетаНа47903) Тогда
						ВызватьИсключение "Сумма дисконт начисленный в валюте в проводках на " + Формат(ДисконтНачисленныйВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					//
					//ПремияНачисленная
					//ПремияНачисленнаяВВалютеУчета
					
					ПремияНачисленнаяНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленная_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленная_Расход;
					ПремияНачисленнаяВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Расход;
					
					Если ЗначениеЗаполнено(ПремияНачисленнаяНа47903) Тогда
						ВызватьИсключение "Сумма премия начисленный в проводках на " + Формат(ПремияНачисленнаяНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(ПремияНачисленнаяВВалютеУчетаНа47903) Тогда
						ВызватьИсключение "Сумма премия начисленный в валюте в проводках на " + Формат(ПремияНачисленнаяВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					
				Иначе
					//Переоценка
					//ПереоценкаВВалютеУчета
					СуммаПереоценкаНа47903 = ВыборкаДетальныеЗаписи.Переоценка_Приход - ВыборкаДетальныеЗаписи.Переоценка_Расход;
					ПереоценкаВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход;
					Если ЗначениеЗаполнено(СуммаПереоценкаНа47903) Тогда
						ВызватьИсключение "Сумма переоценки в проводках на " + Формат(СуммаПереоценкаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(ПереоценкаВВалютеУчетаНа47903) Тогда
						ВызватьИсключение "Сумма переоценки в валюте в проводках на " + Формат(ПереоценкаВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					//
					//ДисконтНачисленный
					//ДисконтНачисленныйВВалютеУчета
					
					ДисконтНачисленныйНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленный_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленный_Расход;
					ДисконтНачисленныйВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Расход;
					
					Если ЗначениеЗаполнено(ДисконтНачисленныйНа47903) Тогда
						ВызватьИсключение "Сумма дисконт начисленный в проводках на " + Формат(ДисконтНачисленныйНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(ДисконтНачисленныйВВалютеУчетаНа47903) Тогда
						ВызватьИсключение "Сумма дисконт начисленный в валюте в проводках на " + Формат(ДисконтНачисленныйВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					//
					//ПремияНачисленная
					//ПремияНачисленнаяВВалютеУчета
					
					ПремияНачисленнаяНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленная_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленная_Расход;
					ПремияНачисленнаяВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Расход;
					
					Если ЗначениеЗаполнено(ПремияНачисленнаяНа47903) Тогда
						ВызватьИсключение "Сумма премия начисленный в проводках на " + Формат(ПремияНачисленнаяНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(ПремияНачисленнаяВВалютеУчетаНа47903) Тогда
						ВызватьИсключение "Сумма премия начисленный в валюте в проводках на " + Формат(ПремияНачисленнаяВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					//
					//КорректировкаЭСП
					//КорректировкаЭСПВВалютеУчета
					//КорректировкаЭСПНа47903 = ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход;
					//КорректировкаЭСПВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход;
					
					//
					//РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные
					//РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
					РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНа47903 = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход;
					РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход;
					
					Если ЗначениеЗаполнено(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНа47903) Тогда
						ВызватьИсключение "Сумма разница первоначального признания в проводках на " + Формат(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаНа47903) Тогда
						ВызватьИсключение "Сумма разница первоначального признания в валюте в проводках на " + Формат(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивУчетныхАктивов.Добавить(ЭтотОбъект.УчетныйАктивЕПС);
	
	МассивЦенныхБумаг = Новый Массив;
	МассивЦенныхБумаг.Добавить(ЭтотОбъект.ЦеннаяБумага);
	
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Истина, Истина, МассивЦенныхБумаг, Отказ);
	
КонецПроцедуры // ПроведениеПоРегиструЕПС

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);	
	
	Если НастройкиУчета.ОтражатьПартииНаЛицевыхСчетах Тогда
	
		ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, Отказ);
		Возврат;
	
	КонецЕсли;
	
	
	МассивУчетныхАктивов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Переоценка КАК Переоценка,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета
		|ПОМЕСТИТЬ _ДвиженияПереоценки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.Количество = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремия
		|		КОНЕЦ) КАК Дисконт,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия <= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремия
		|		КОНЕЦ) КАК Премия,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|		КОНЕЦ) КАК ДисконтНачисленный,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия <= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|		КОНЕЦ) КАК ПремияНачисленная,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|		КОНЕЦ) КАК ДисконтНачисленныйВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия <= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|		КОНЕЦ) КАК ПремияНачисленнаяВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСП) КАК КорректировкаЭСП,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета) КАК КорректировкаЭСПВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрок) КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	СУММА(БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета) КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.Количество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ВидДвижения,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС КАК УчетныйАктивЕПС_Расход,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчета КАК УчетныйАктивЕПС_Расход_СчетУчета,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиА,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиП,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаКорректировокА КАК УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаКорректировокП КАК УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП,
		|	_ДвиженияПартийРасход.УчетныйАктивЕПС.СчетУчетаРезервов КАК УчетныйАктивЕПС_Расход_СчетУчетаРезервов,
		|	_ДвиженияПартийРасход.Количество КАК Количество,
		|	_ДвиженияПартийРасход.СтоимостьКупона КАК СтоимостьКупона,
		|	_ДвиженияПартийРасход.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	_ДвиженияПартийРасход.ПереоценкаКупона КАК ПереоценкаКупона,
		|	_ДвиженияПартийРасход.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	_ДвиженияПартийРасход.ПогашениеКупонаНеИсполненноеВСрок КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	_ДвиженияПартийРасход.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	_ДвиженияПартийРасход.Стоимость КАК Стоимость_Расход,
		|	_ДвиженияПартийРасход.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.Переоценка КАК Переоценка_Расход,
		|	_ДвиженияПартийРасход.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.ДисконтНачисленный КАК ДисконтНачисленный_Расход,
		|	_ДвиженияПартийРасход.ДисконтНачисленныйВВалютеУчета КАК ДисконтНачисленныйВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.ПремияНачисленная КАК ПремияНачисленная_Расход,
		|	_ДвиженияПартийРасход.ПремияНачисленнаяВВалютеУчета КАК ПремияНачисленнаяВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.КорректировкаЭСП КАК КорректировкаЭСП_Расход,
		|	_ДвиженияПартийРасход.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход,
		|	_ДвиженияПартийРасход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход,
		|	_ДвиженияПартийРасход.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение_Расход,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС КАК УчетныйАктивЕПС_Приход,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчета КАК УчетныйАктивЕПС_Приход_СчетУчета,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаКорректировокА КАК УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаКорректировокП КАК УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП,
		|	_ДвиженияПартийПриход.УчетныйАктивЕПС.СчетУчетаРезервов КАК УчетныйАктивЕПС_Приход_СчетУчетаРезервов,
		|	_ДвиженияПартийПриход.Стоимость КАК Стоимость_Приход,
		|	_ДвиженияПартийПриход.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.Переоценка КАК Переоценка_Приход,
		|	_ДвиженияПартийПриход.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.ДисконтНачисленный КАК ДисконтНачисленный_Приход,
		|	_ДвиженияПартийПриход.ДисконтНачисленныйВВалютеУчета КАК ДисконтНачисленныйВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.ПремияНачисленная КАК ПремияНачисленная_Приход,
		|	_ДвиженияПартийПриход.ПремияНачисленнаяВВалютеУчета КАК ПремияНачисленнаяВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.КорректировкаЭСП КАК КорректировкаЭСП_Приход,
		|	_ДвиженияПартийПриход.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход,
		|	_ДвиженияПартийПриход.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Приход,
		|	_ДвиженияПартийПриход.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение_Приход
		|ИЗ
		|	_ДвиженияПартий КАК _ДвиженияПартийРасход
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДвиженияПартий КАК _ДвиженияПартийПриход
		|		ПО (_ДвиженияПартийРасход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (_ДвиженияПартийПриход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	ПараметрыПроводки = Новый Структура;
	
	ПараметрыПроводки.Вставить("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	ПараметрыПроводки.Вставить("ВалютаНоминала", ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала);
	
	НакопленнаяДельта = 0;
	НакопленнаяДельтаВВалютеУчета = 0;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы", ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// сначала начислим переоценку, купон, дисконт/премию
	ТаблицаДвиженийПереоценки = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДвиженияПереоценки"].ПолучитьДанные().Выгрузить();
	Для Каждого ДвижениеПереоценки Из ТаблицаДвиженийПереоценки Цикл
		
		Если МассивУчетныхАктивов.Найти(ДвижениеПереоценки.УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(ДвижениеПереоценки.УчетныйАктивЕПС);
		КонецЕсли;
		
		ПараметрыНачисления = Новый Структура;
		
		ПараметрыНачисления.Вставить("СуммаУчета", ДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета);
		ПараметрыНачисления.Вставить("СуммаВал", ДвижениеПереоценки.ПереоценкаКупона);
		ПараметрыНачисления.Вставить("ВалютаУчета", ЭтотОбъект.Организация.ВалютаУчета);
		ПараметрыНачисления.Вставить("УчетныйАктив", ДвижениеПереоценки.УчетныйАктивЕПС);
		ПараметрыНачисления.Вставить("ЦеннаяБумага", ПараметрыПроводки.ЦеннаяБумага);
		ПараметрыНачисления.Вставить("ВалютаНоминала", ПараметрыПроводки.ВалютаНоминала);
		ПараметрыНачисления.Вставить("ПереоценкаПослеВводаНачальныхОстатков", ?(ЭтотОбъект.ОтноситьПереоценкуНаАктивыВДУ03, Истина, Ложь));
		ПараметрыНачисления.Вставить("Аналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
		
		БухгалтерскийУчетЕПС.НачислитьНКД(ЭтотОбъект, ПараметрыНачисления, Отказ);
		
			
		ПараметрыНачисления.Вставить("СуммаВал", ДвижениеПереоценки.ДисконтПремияНачисленный);
		ПараметрыНачисления.Вставить("СуммаУчета", ДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета);
		Если ДвижениеПереоценки.ДисконтПремияНачисленный > 0 Тогда
			ПараметрыНачисления.Вставить("Аналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
			ПараметрыНачисления.Вставить("Доход", Истина);
		Иначе			
			ПараметрыНачисления.Вставить("Аналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
			ПараметрыНачисления.Вставить("Доход", Ложь);
		КонецЕсли;
			
		БухгалтерскийУчетЕПС.НачислитьДисконтПремию(ЭтотОбъект, ПараметрыНачисления, Отказ);
		
		
		ПараметрыНачисления.Вставить("Показатель", "Переоценка");
		ПараметрыНачисления.Вставить("СуммаВал", ДвижениеПереоценки.Переоценка);
		ПараметрыНачисления.Вставить("СуммаУчета", ДвижениеПереоценки.ПереоценкаВВалютеУчета);
		ПараметрыНачисления.Вставить("Сделка", Неопределено);
		
		БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыНачисления, Отказ);
		
		
		ПараметрыНачисления.Вставить("Показатель", "КорректировкаЭСП");
		ПараметрыНачисления.Вставить("СуммаВал", ДвижениеПереоценки.КорректировкаЭСП);
		ПараметрыНачисления.Вставить("СуммаУчета", ДвижениеПереоценки.КорректировкаЭСПВВалютеУчета);
		
		БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыНачисления, Отказ);
		
		
		ПараметрыНачисления.Вставить("Показатель", "РазницаПервоначальногоПризнания");
		ПараметрыНачисления.Вставить("СуммаВал", ДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
		ПараметрыНачисления.Вставить("СуммаУчета", ДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета);
		
		БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыНачисления, Отказ);
		
	КонецЦикла;
	
	
	// теперь будем переносить
	// 
	// при любом варианте рекласса перенесем:
	//	1. Неизменяемые части стоимости: УНКД, ННКД, просроченный НКД
	//	2. Перенесем части стоимости, которые уходят целиком, но потом могут быть откорректированы: Тело, ДисконтПремияНачисленный
	
	ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчета);
	ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
	
	// сначала перенесем Стоимость 1к1
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
	ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.Стоимость_Расход);
	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Расход);
	ПараметрыПроводки.Вставить("Количество", ВыборкаДетальныеЗаписи.Количество);
	
	ПараметрыПроводки.Вставить("Содержание", "Тело ценной бумаги");
	СоздатьПроводкуПереноса(ПараметрыПроводки);
	
	ПараметрыПроводки.Вставить("Количество", 0);
	
	// также 1к1 перенесем СтоимостьКупона
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.СтоимостьКупона);
	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета);
	
	ПараметрыПроводки.Вставить("Содержание", "Купон, уплаченный при покупке");
	СоздатьПроводкуПереноса(ПараметрыПроводки);
	
	// также 1к1 перенесем ПереоценкаКупона
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ПереоценкаКупона);
	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета);
	
	ПараметрыПроводки.Вставить("Содержание", "Купон начисленный");
	СоздатьПроводкуПереноса(ПараметрыПроводки);
	
	// также 1к1 перенесем ПогашениеКупонаНеИсполненноеВСрок
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок);
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок);
	ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ПогашениеКупонаНеИсполненноеВСрок);
	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета);
	
	ПараметрыПроводки.Вставить("Содержание", "Погашение купона не исполненное в срок");
	СоздатьПроводкуПереноса(ПараметрыПроводки);
	
	// аналогично ДисконтНачисленный
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ДисконтНачисленный_Расход);
	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Расход);
	
	ПараметрыПроводки.Вставить("Содержание", "Дисконт");
	СоздатьПроводкуПереноса(ПараметрыПроводки);
	
	// и ПремияНачисленная
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.ПремияНачисленная_Расход);
	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Расход);
	
	ПараметрыПроводки.Вставить("Содержание", "Премия");
	СоздатьПроводкуПереноса(ПараметрыПроводки);
	
	// остальное
	Если ВыборкаДетальныеЗаписи.Переоценка_Расход <> 0 Тогда // СС → АС
		
		// при такой реклассификации (СС → АС) наша задача распихать переоценку и мы действуем так:
		//		0. Корректировку ПП в корректировку ЭСП - это ради одного случая сделано
		//		1. Пихаем сколько нужно в тело (если нужно, конечно)
		//		2. Пихаем сколько нужно в ДисконтПремияНачисленный (если нужно, конечно)  - это пока отключил ибо нелогично совсем
		//		3. Пихаем сколько нужно в КорректировкуПП (если нужно, конечно)
		//		4. Пихаем сколько ОСТАЛОСЬ переоценки в КорректировкуЭСП (если нужно, конечно)
		//		5. Если после предыдущего шага КорректировкаЭСП еще не доросла до нужной суммы - доначисляем
		
		НачислитьКорректировкаЭСП = 0;
		НачислитьКорректировкаЭСПВВалютеУчета = 0;
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход <> 0
			И ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход = 0 Тогда // вся корректировка ПП в корректировку ЭСП
			
			НачислитьКорректировкаЭСП = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход;
			НачислитьКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход;
			
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
			Если НачислитьКорректировкаЭСП > 0 Тогда
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
			КонецЕсли;
			
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход > 0 Тогда
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
			КонецЕсли;
			
			ПараметрыПроводки.Вставить("Сумма", НачислитьКорректировкаЭСП);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьКорректировкаЭСПВВалютеУчета);
			
			ПараметрыПроводки.Вставить("Содержание", "Перенос корректировку ПП в корректировку ЭСП");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
		КонецЕсли;
		
		
		ОсталосьПереоценки = ВыборкаДетальныеЗаписи.Переоценка_Расход;
		ОсталосьПереоценкиВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход;
		
		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
		Если ОсталосьПереоценки > 0 Тогда
			ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиА);
		Иначе
			ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиП);
		КонецЕсли;
		ПараметрыПроводки.Вставить("Содержание", "Переоценка");
		
		Если ВыборкаДетальныеЗаписи.Стоимость_Расход <> ВыборкаДетальныеЗаписи.Стоимость_Приход Тогда // ага, нужно стоимость добить
		
			НачислитьСтоимость = ВыборкаДетальныеЗаписи.Стоимость_Приход - ВыборкаДетальныеЗаписи.Стоимость_Расход;
			НачислитьСтоимостьВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Расход;
			
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
			ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
			
			ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
			
			ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в тело ценной бумаги");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			ОсталосьПереоценки = ОсталосьПереоценки - НачислитьСтоимость;
			ОсталосьПереоценкиВВалютеУчета = ОсталосьПереоценкиВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
			
		КонецЕсли;
		
		//Если ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Расход <> ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Приход Тогда // дисконт/премию добиваем
		//
		//	НачислитьДисконтПремияНачисленный = ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Приход - ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный_Расход;
		//	НачислитьДисконтПремияНачисленныйВВалютеУчета = ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчета_Расход;
		//	
		//	Если ВыборкаДетальныеЗаписи.ДисконтПремия_Приход > 0 Тогда
		//		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
		//	Иначе
		//		ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
		//	КонецЕсли;
		//	ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
		//	
		//	ПараметрыПроводки.Вставить("Сумма", НачислитьДисконтПремияНачисленный);
		//	ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьДисконтПремияНачисленныйВВалютеУчета);
		//	
		//	ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в дисконт");
		//	СоздатьПроводкуПереноса(ПараметрыПроводки);
		//	
		//	ОсталосьПереоценки = ОсталосьПереоценки - НачислитьДисконтПремияНачисленный;
		//	ОсталосьПереоценкиВВалютеУчета = ОсталосьПереоценкиВВалютеУчета - НачислитьДисконтПремияНачисленныйВВалютеУчета;
		//	
		//КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход - НачислитьКорректировкаЭСП <> ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход Тогда // корректировку ПП добиваем
		
			НачислитьРазницаПервоначальногоПризнания = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход + + НачислитьКорректировкаЭСП;
			НачислитьРазницаПервоначальногоПризнанияВВалютеУчета = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход + НачислитьКорректировкаЭСПВВалютеУчета;
			
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			Если НачислитьРазницаПервоначальногоПризнания > 0 Тогда
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
			КонецЕсли;
			
			ПараметрыПроводки.Вставить("Сумма", НачислитьРазницаПервоначальногоПризнания);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьРазницаПервоначальногоПризнанияВВалютеУчета);
			
			ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в корректировку ПП");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			ОсталосьПереоценки = ОсталосьПереоценки - НачислитьРазницаПервоначальногоПризнания;
			ОсталосьПереоценкиВВалютеУчета = ОсталосьПереоценкиВВалютеУчета - НачислитьРазницаПервоначальногоПризнанияВВалютеУчета;
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход <> ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход - НачислитьКорректировкаЭСП Тогда // корректировку ЭСП добиваем
			
			НадоНачислитьКорректировкаЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - НачислитьКорректировкаЭСП;
			НадоНачислитьКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход - НачислитьКорректировкаЭСПВВалютеУчета;
			
			НачислитьКорректировкаЭСП = ОсталосьПереоценки;
			НачислитьКорректировкаЭСПВВалютеУчета = ОсталосьПереоценкиВВалютеУчета;
			
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
			Если НачислитьКорректировкаЭСП > 0 Тогда
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
			КонецЕсли;
			
			ПараметрыПроводки.Вставить("Сумма", НачислитьКорректировкаЭСП);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьКорректировкаЭСПВВалютеУчета);
			
			ПараметрыПроводки.Вставить("Содержание", "Перенос переоценки в корректировку ЭСП");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			ДоначислитьКорректировкаЭСП = НадоНачислитьКорректировкаЭСП - НачислитьКорректировкаЭСП;
			ДоначислитьКорректировкаЭСПВВалютеУчета = НадоНачислитьКорректировкаЭСПВВалютеУчета - НачислитьКорректировкаЭСПВВалютеУчета;
			
			ПараметрыСписания = Новый Структура;
			
			ПараметрыСписания.Вставить("Показатель", "КорректировкаЭСП");
			ПараметрыСписания.Вставить("СуммаВал", ДоначислитьКорректировкаЭСП);
			ПараметрыСписания.Вставить("СуммаУчета", ДоначислитьКорректировкаЭСПВВалютеУчета);
			ПараметрыСписания.Вставить("ВалютаУчета", ЭтотОбъект.Организация.ВалютаУчета);
			ПараметрыСписания.Вставить("УчетныйАктив", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход);
			ПараметрыСписания.Вставить("ЦеннаяБумага", ПараметрыПроводки.ЦеннаяБумага);
			ПараметрыСписания.Вставить("ВалютаНоминала", ПараметрыПроводки.ВалютаНоминала);
			ПараметрыСписания.Вставить("Сделка", Неопределено);
			ПараметрыСписания.Вставить("ПереоценкаПослеВводаНачальныхОстатков", Ложь);
			
			БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
			
		КонецЕсли;
		
	Иначе // АС → СС
		
		//Для Обратной совместимости оставим старый код до 31.12.23
		
		Если ЭтотОбъект.Дата <= '20231231235959' Тогда
			
			// при такой реклассификации (АС → СС) наша задача распихать резервы и корректировку ЭСП (её опционально) и мы действуем так:
			//		1. Пихаем корректировку ЭСП сколько нужно в тело 
			//		2. Пихаем корректировку ЭСП сколько нужно в переоценку 
			//		3. Пихаем резерв сколько нужно в тело 
			//		4. Пихаем резерв сколько нужно в переоценку 
			
			ОсталосьКорректировкиЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход;
			ОсталосьКорректировкиЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход - ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Приход;
			
			ОсталосьРезервов = ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход - ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Приход;
			ОсталосьРезервовВВалютеУчета = ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход - ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Приход;
			
			ДобитьСтоимость = ВыборкаДетальныеЗаписи.Стоимость_Приход - ВыборкаДетальныеЗаписи.Стоимость_Расход;
			ДобитьСтоимостьВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета_Расход;
			
			ДобитьПереоценку = ВыборкаДетальныеЗаписи.Переоценка_Приход;
			ДобитьПереоценкуВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Приход;
			
			
			Если ДобитьСтоимость <> 0 И ОсталосьКорректировкиЭСП <> 0 Тогда // сколько можем корректировки - в тело
				
				НачислитьСтоимость = Мин(ДобитьСтоимость, ОсталосьКорректировкиЭСП);
				НачислитьСтоимостьВВалютеУчета = Мин(ДобитьСтоимостьВВалютеУчета, ОсталосьКорректировкиЭСПВВалютеУчета);
				
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
				ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос корректировки в тело ценной бумаги");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				ДобитьСтоимость = ДобитьСтоимость - НачислитьСтоимость;
				ДобитьСтоимостьВВалютеУчета = ДобитьСтоимостьВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
				ОсталосьКорректировкиЭСП = ОсталосьКорректировкиЭСП - НачислитьСтоимость;
				ОсталосьКорректировкиЭСПВВалютеУчета = ОсталосьКорректировкиЭСПВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
			КонецЕсли;
			
			Если ДобитьПереоценку <> 0 И ОсталосьКорректировкиЭСП <> 0 Тогда // сколько можем корректировки - в переоценку
				
				НачислитьСтоимость = Мин(ДобитьПереоценку, ОсталосьКорректировкиЭСП);
				НачислитьСтоимостьВВалютеУчета = Мин(ДобитьПереоценкуВВалютеУчета, ОсталосьКорректировкиЭСПВВалютеУчета);
				
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
				ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос корректировки в переоценку");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				ДобитьПереоценку = ДобитьПереоценку - НачислитьСтоимость;
				ДобитьПереоценкуВВалютеУчета = ДобитьПереоценкуВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
				ОсталосьКорректировкиЭСП = ОсталосьКорректировкиЭСП - НачислитьСтоимость;
				ОсталосьКорректировкиЭСПВВалютеУчета = ОсталосьКорректировкиЭСПВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
			КонецЕсли;
			
			Если ДобитьСтоимость <> 0 И ОсталосьРезервов <> 0 Тогда // сколько можем резервов - в тело
				
				НачислитьСтоимость = Мин(ДобитьСтоимость, ОсталосьРезервов);
				НачислитьСтоимостьВВалютеУчета = Мин(ДобитьСтоимостьВВалютеУчета, ОсталосьРезервовВВалютеУчета);
				
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаРезервов);
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчета);
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
				ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос резервов в тело ценной бумаги");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				ДобитьСтоимость = ДобитьСтоимость - НачислитьСтоимость;
				ДобитьСтоимостьВВалютеУчета = ДобитьСтоимостьВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
				ОсталосьРезервов = ОсталосьРезервов - НачислитьСтоимость;
				ОсталосьРезервовВВалютеУчета = ОсталосьРезервовВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
			КонецЕсли;
			
			Если ДобитьПереоценку <> 0 И ОсталосьРезервов <> 0 Тогда // сколько можем резервов - в переоценку
				
				НачислитьСтоимость = Мин(ДобитьПереоценку, ОсталосьРезервов);
				НачислитьСтоимостьВВалютеУчета = Мин(ДобитьПереоценкуВВалютеУчета, ОсталосьРезервов);
				
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаРезервов);
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
				
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
				ПараметрыПроводки.Вставить("Сумма", НачислитьСтоимость);
				ПараметрыПроводки.Вставить("СуммаВВалютеУчета", НачислитьСтоимостьВВалютеУчета);
				
				ПараметрыПроводки.Вставить("Содержание", "Перенос резервов в переоценку");
				СоздатьПроводкуПереноса(ПараметрыПроводки);
				
				ДобитьПереоценку = ДобитьПереоценку - НачислитьСтоимость;
				ДобитьПереоценкуВВалютеУчета = ДобитьПереоценкуВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
				ОсталосьРезервов = ОсталосьРезервов - НачислитьСтоимость;
				ОсталосьРезервовВВалютеУчета = ОсталосьРезервовВВалютеУчета - НачислитьСтоимостьВВалютеУчета;
				
			КонецЕсли;
			
		Иначе
			// с 31.12.2023 будет другой порядок, всё переносится 1:1 
			// при такой реклассификации (АС → СС) корректировка ЭСП в корректировку ЭСП и т.д.:
			// Уже нет. Еще возможен вариант что всё в переоценку
			
			// КорректировкаЭСП_Расход
			Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход > 0 Тогда
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
			КонецЕсли;
			Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
				Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП);
				КонецЕсли;
			Иначе	
				Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда 
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			Иначе
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
			КонецЕсли;	
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
			ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход);
			
			ПараметрыПроводки.Вставить("Содержание", "Корректировка ЭСП");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			// Переоценка_Расход
			Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход > 0 Тогда
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаПереоценкиП);
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход > 0 Тогда
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП);
			КонецЕсли;
			
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.Переоценка_Расход);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход);
			
			ПараметрыПроводки.Вставить("Содержание", "Переоценка");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			// РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход
			Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
			Иначе	
				ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
			КонецЕсли;
			Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
				Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиП);
				КонецЕсли;
			Иначе	
				Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
				Иначе	
					ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда 
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			Иначе
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			КонецЕсли;	
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход);
			
			ПараметрыПроводки.Вставить("Содержание", "РазницаПервоначальногоПризнания");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			//ИндексацияНоминала_Расход
			//Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
			//	ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокА);
			//Иначе	
			//	ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаКорректировокП);
			//КонецЕсли;
			//Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход > 0 Тогда
			//	ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
			//Иначе	
			//	ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокП);
			//КонецЕсли;
			//
			//ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала);
			//ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала);
			//ПараметрыПроводки.Вставить("Сумма", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход);
			//ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход);
			//
			//ПараметрыПроводки.Вставить("Содержание", "ИндексацияНоминала");
			//СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			//СуммаРезервовПодОбесценение_Расход,
			ПараметрыПроводки.Вставить("СчетСписания", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Расход_СчетУчетаРезервов);
			Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаПереоценкиА);
			Иначе
				//ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаКорректировокА);
				ПараметрыПроводки.Вставить("СчетЗачисления", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС_Приход_СчетУчетаРезервов);
			КонецЕсли;	
			
			Если ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда 
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			Иначе
				ПараметрыПроводки.Вставить("ДополнительнаяАналитикаДт", Неопределено);
			КонецЕсли;	
			//ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			ПараметрыПроводки.Вставить("ДополнительнаяАналитикаКт", Неопределено);
			ПараметрыПроводки.Вставить("Сумма", -ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход);
			ПараметрыПроводки.Вставить("СуммаВВалютеУчета", -ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход);
			
			ПараметрыПроводки.Вставить("Содержание", "Резерв");
			СоздатьПроводкуПереноса(ПараметрыПроводки);
			
			// Проверка контрольных соотношений
			ПроизводитьПроверку = НЕ (ЭтотОбъект.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финконсалт")); // у это бумаги вообше все части стоимостей про профсуждениям и баланс не сходится
			
			Если ПроизводитьПроверку И ЭтотОбъект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
				
				РазностьСуммаПереоценкаНа47903 = ВыборкаДетальныеЗаписи.Переоценка_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход - (-ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход); //Резервы под обесценение в регистрах хранятся с противоположным знаком
				РазностьСуммаПереоценкаВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход - (-ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение_Расход); //Резервы под обесценение в регистрах хранятся с противоположным знаком
				
				Если ЗначениеЗаполнено(РазностьСуммаПереоценкаНа47903) Тогда
					ВызватьИсключение "Сумма переоценки в проводках на " + Формат(РазностьСуммаПереоценкаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(РазностьСуммаПереоценкаВВалютеУчетаНа47903) Тогда
					ВызватьИсключение "Сумма переоценки в валюте в проводках на " + Формат(РазностьСуммаПереоценкаВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				//
				//ДисконтНачисленный
				//ДисконтНачисленныйВВалютеУчета
				
				ДисконтНачисленныйНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленный_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленный_Расход;
				ДисконтНачисленныйВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Расход;
				
				Если ЗначениеЗаполнено(ДисконтНачисленныйНа47903) Тогда
					ВызватьИсключение "Сумма дисконт начисленный в проводках на " + Формат(ДисконтНачисленныйНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ДисконтНачисленныйВВалютеУчетаНа47903) Тогда
					ВызватьИсключение "Сумма дисконт начисленный в валюте в проводках на " + Формат(ДисконтНачисленныйВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				//
				//ПремияНачисленная
				//ПремияНачисленнаяВВалютеУчета
				
				ПремияНачисленнаяНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленная_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленная_Расход;
				ПремияНачисленнаяВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Расход;
				
				Если ЗначениеЗаполнено(ПремияНачисленнаяНа47903) Тогда
					ВызватьИсключение "Сумма премия начисленный в проводках на " + Формат(ПремияНачисленнаяНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ПремияНачисленнаяВВалютеУчетаНа47903) Тогда
					ВызватьИсключение "Сумма премия начисленный в валюте в проводках на " + Формат(ПремияНачисленнаяВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				
			ИначеЕсли ПроизводитьПроверку Тогда 
				//Переоценка
				//ПереоценкаВВалютеУчета
				СуммаПереоценкаНа47903 = ВыборкаДетальныеЗаписи.Переоценка_Приход - ВыборкаДетальныеЗаписи.Переоценка_Расход;
				ПереоценкаВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета_Расход;
				Если ЗначениеЗаполнено(СуммаПереоценкаНа47903) Тогда
					ВызватьИсключение "Сумма переоценки в проводках на " + Формат(СуммаПереоценкаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ПереоценкаВВалютеУчетаНа47903) Тогда
					ВызватьИсключение "Сумма переоценки в валюте в проводках на " + Формат(ПереоценкаВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				//
				//ДисконтНачисленный
				//ДисконтНачисленныйВВалютеУчета
				
				ДисконтНачисленныйНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленный_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленный_Расход;
				ДисконтНачисленныйВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета_Расход;
				
				Если ЗначениеЗаполнено(ДисконтНачисленныйНа47903) Тогда
					ВызватьИсключение "Сумма дисконт начисленный в проводках на " + Формат(ДисконтНачисленныйНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ДисконтНачисленныйВВалютеУчетаНа47903) Тогда
					ВызватьИсключение "Сумма дисконт начисленный в валюте в проводках на " + Формат(ДисконтНачисленныйВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				//
				//ПремияНачисленная
				//ПремияНачисленнаяВВалютеУчета
				
				ПремияНачисленнаяНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленная_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленная_Расход;
				ПремияНачисленнаяВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета_Расход;
				
				Если ЗначениеЗаполнено(ПремияНачисленнаяНа47903) Тогда
					ВызватьИсключение "Сумма премия начисленный в проводках на " + Формат(ПремияНачисленнаяНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ПремияНачисленнаяВВалютеУчетаНа47903) Тогда
					ВызватьИсключение "Сумма премия начисленный в валюте в проводках на " + Формат(ПремияНачисленнаяВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				//
				//КорректировкаЭСП
				//КорректировкаЭСПВВалютеУчета
				//КорректировкаЭСПНа47903 = ВыборкаДетальныеЗаписи.КорректировкаЭСП_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСП_Расход;
				//КорректировкаЭСПВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета_Расход;
				
				//
				//РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные
				//РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
				РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНа47903 = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные_Расход;
				РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаНа47903 = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Приход - ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета_Расход;
				
				Если ЗначениеЗаполнено(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНа47903) Тогда
					ВызватьИсключение "Сумма разница первоначального признания в проводках на " + Формат(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаНа47903) Тогда
					ВызватьИсключение "Сумма разница первоначального признания в валюте в проводках на " + Формат(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаНа47903, "ЧЦ=15; ЧДЦ=2") + " не совпадает с партиями необходимо обратиться к разработчикам 1С.";	
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	МассивУчетныхАктивов.Добавить(ЭтотОбъект.УчетныйАктивЕПС);
	
	МассивЦенныхБумаг = Новый Массив;
	МассивЦенныхБумаг.Добавить(ЭтотОбъект.ЦеннаяБумага);
	
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Истина, Истина, МассивЦенныхБумаг, Отказ);
	
КонецПроцедуры // ПроведениеПоРегиструЕПС

Процедура СоздатьПроводкуПереноса(ПараметрыПроводки)

	Если ПараметрыПроводки.СуммаВВалютеУчета = 0 И ПараметрыПроводки.Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПереноситьЧерезСчет000 = Ложь;
	Если НЕ ПараметрыПроводки.Свойство("ПереноситьЧерезСчет000", ПереноситьЧерезСчет000) Тогда
	    ПереноситьЧерезСчет000 = Ложь;
	КонецЕсли;
	
	Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
		
		ПроводкаПереноса = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		ПроводкаПереноса.СчетДт = ПараметрыПроводки.СчетЗачисления;
		
		Если ПроводкаПереноса.СчетДт = ПланыСчетов.Единый.АктивыВДУ03 Тогда
			ПроводкаПереноса.СубконтоДт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
		Иначе	
			ПроводкаПереноса.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
			ЕстьСубконтоДтРезервы = (ПроводкаПереноса.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Резервы) <> Неопределено);
			
			Если ЕстьСубконтоДтРезервы Тогда
				ПроводкаПереноса.СубконтоДт.Резервы = Справочники.Резервы.РезервПодОбесценениеМСФО39;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ПроводкаПереноса.СчетДт.Валютный Тогда
			ПроводкаПереноса.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаПереноса.ВалютнаяСуммаДт = ПараметрыПроводки.Сумма;
		КонецЕсли;
		
		ПроводкаПереноса.КоличествоДт = ПараметрыПроводки.Количество;
		
		Если ПараметрыПроводки.ДополнительнаяАналитикаДт <> Неопределено Тогда
			ПроводкаПереноса.ДополнительнаяАналитикаДт = ПараметрыПроводки.ДополнительнаяАналитикаДт;
		КонецЕсли;
		
		Если ПереноситьЧерезСчет000 Тогда
		
			ПроводкаПереноса.СчетКт = ПланыСчетов.Единый.Вспомогательный;
			
			ПроводкаПереноса.Партия = ПараметрыПроводки.Партия_Приход;
			ПроводкаПереноса.СтрокаПартии = ПараметрыПроводки.СтрокаПартии_Приход;
			
			
			ПроводкаПереноса = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
			
			ПроводкаПереноса.СчетДт = ПланыСчетов.Единый.Вспомогательный;
			
			ПроводкаПереноса.Партия = ПараметрыПроводки.Партия_Расход;
			ПроводкаПереноса.СтрокаПартии = ПараметрыПроводки.СтрокаПартии_Расход;
			
		КонецЕсли;
		
		// кредит
		ПроводкаПереноса.СчетКт = ПараметрыПроводки.СчетСписания;
		
		ПроводкаПереноса.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		ЕстьСубконтоКтРезервы = (ПроводкаПереноса.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Резервы) <> Неопределено);
		
		Если ЕстьСубконтоКтРезервы Тогда
			ПроводкаПереноса.СубконтоКт.Резервы = Справочники.Резервы.РезервПодОбесценениеМСФО39;
		КонецЕсли;	
		
		Если ПроводкаПереноса.СчетКт.Валютный Тогда
			ПроводкаПереноса.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаПереноса.ВалютнаяСуммаКт = ПараметрыПроводки.Сумма;
		КонецЕсли;
		
		ПроводкаПереноса.КоличествоКт = ПараметрыПроводки.Количество;
		
		Если ПараметрыПроводки.ДополнительнаяАналитикаКт <> Неопределено Тогда
			ПроводкаПереноса.ДополнительнаяАналитикаКт = ПараметрыПроводки.ДополнительнаяАналитикаКт;
		КонецЕсли;
		
	Иначе
		
		ПроводкаПереноса = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		ПроводкаПереноса.СчетДт = ПараметрыПроводки.СчетСписания;
		
		ПроводкаПереноса.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		ЕстьСубконтоДтРезервы = (ПроводкаПереноса.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Резервы) <> Неопределено);
		
		Если ЕстьСубконтоДтРезервы Тогда
			ПроводкаПереноса.СубконтоДт.Резервы = Справочники.Резервы.РезервПодОбесценениеМСФО39;
		КонецЕсли;	
		
		Если ПроводкаПереноса.СчетДт.Валютный Тогда
			ПроводкаПереноса.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаПереноса.ВалютнаяСуммаДт = -ПараметрыПроводки.Сумма;
		КонецЕсли;
		
		ПроводкаПереноса.КоличествоДт = ПараметрыПроводки.Количество;
		
		Если ПараметрыПроводки.ДополнительнаяАналитикаКт <> Неопределено Тогда
			ПроводкаПереноса.ДополнительнаяАналитикаДт = ПараметрыПроводки.ДополнительнаяАналитикаКт;
		КонецЕсли;
		
		Если ПереноситьЧерезСчет000 Тогда
		
			ПроводкаПереноса.СчетКт = ПланыСчетов.Единый.Вспомогательный;
			
			ПроводкаПереноса.Партия = ПараметрыПроводки.Партия_Расход;
			ПроводкаПереноса.СтрокаПартии = ПараметрыПроводки.СтрокаПартии_Расход;
			
			
			ПроводкаПереноса = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
			
			ПроводкаПереноса.СчетДт = ПланыСчетов.Единый.Вспомогательный;
			
			ПроводкаПереноса.Партия = ПараметрыПроводки.Партия_Приход;
			ПроводкаПереноса.СтрокаПартии = ПараметрыПроводки.СтрокаПартии_Приход;
			
		КонецЕсли;
		
		// кредит
		ПроводкаПереноса.СчетКт = ПараметрыПроводки.СчетЗачисления;
		Если ПроводкаПереноса.СчетКт = ПланыСчетов.Единый.АктивыВДУ03 Тогда
			ПроводкаПереноса.СубконтоКт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
		Иначе	
			ПроводкаПереноса.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
			ЕстьСубконтоКтРезервы = (ПроводкаПереноса.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Резервы) <> Неопределено);
			
			Если ЕстьСубконтоКтРезервы Тогда
				ПроводкаПереноса.СубконтоКт.Резервы = Справочники.Резервы.РезервПодОбесценениеМСФО39;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ПроводкаПереноса.СчетКт.Валютный Тогда
			ПроводкаПереноса.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаПереноса.ВалютнаяСуммаКт = -ПараметрыПроводки.Сумма;
		КонецЕсли;
		
		ПроводкаПереноса.КоличествоКт = ПараметрыПроводки.Количество;
		
		Если ПараметрыПроводки.ДополнительнаяАналитикаДт <> Неопределено Тогда
			ПроводкаПереноса.ДополнительнаяАналитикаКт = ПараметрыПроводки.ДополнительнаяАналитикаДт;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Возврат; // пока нет
		
КонецПроцедуры // ПроведениеПоРегиструБухгалтерии

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

