
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДепозитныйВклад") Тогда
			
			СрезПоследних = РегистрыСведений.УсловияКредитныхИнструментов.СрезПоследних(?(ДанныеЗаполнения.Свойство("Период"), ДанныеЗаполнения.Период, ТекущаяДата()), Новый Структура("КредитныйИнструмент", ДанныеЗаполнения.ДепозитныйВклад));
			СрезПоследних.Сортировать("ДатаНачалаДействияУсловий УБЫВ");
			ЗаполнилиПоСрезу = Ложь;
			Для Каждого ДанныеСреза Из СрезПоследних Цикл
				Если НЕ ДанныеСреза.Действует Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого Колонка Из СрезПоследних.Колонки Цикл
					Если Колонка.Имя = "КредитныйИнструмент" 
						ИЛИ Колонка.Имя = "Комментарий" 
						ИЛИ Колонка.Имя = "Период" 
						ИЛИ Колонка.Имя = "ДатаНачалаДействияУсловий" Тогда 
						Продолжить; 
					КонецЕсли;
					Если ДанныеЗаполнения.Свойство(Колонка.Имя) И ЗначениеЗаполнено(ДанныеЗаполнения[Колонка.Имя])	Тогда 
						Продолжить; 
					КонецЕсли;
					
					ДанныеЗаполнения.Вставить(Колонка.Имя, ДанныеСреза[Колонка.Имя]);
				КонецЦикла;
				
				ЗаполнилиПоСрезу = Истина;
				Прервать;
			КонецЦикла;
			Если НЕ ЗаполнилиПоСрезу Тогда
				ДанныеЗаполнения.Вставить("Период", ДанныеЗаполнения.ДепозитныйВклад.ДатаРегистрации);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)

	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "ДепозитныйВклад");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Справочники.ДепозитныеВклады.БылиДвиженияПоДепозиту(Запись.ДепозитныйВклад, Запись.Организация) Тогда
			
			РеквизитыОповещения = Новый Структура;
			РеквизитыОповещения.Вставить("Организация",								Запись.Организация);
			РеквизитыОповещения.Вставить("Депозит",									Запись.ДепозитныйВклад);
			РеквизитыОповещения.Вставить("ИспользоватьЭффективнуюПроцентнуюСтавку",	Запись.ИспользоватьЭффективнуюПроцентнуюСтавку);
			РеквизитыОповещения.Вставить("ЭффективнаяСтавкаПроцента",				Запись.ЭффективнаяСтавкаПроцента);
			РеквизитыОповещения.Вставить("СчетДоверительногоУправления",			Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
				|ИЗ
				|	РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
				|			&Период,
				|			Договор В
				|				(ВЫБРАТЬ ПЕРВЫЕ 1
				|					ДепозитныеВклады.БанковскийСчет.Договор КАК БанковскийСчетДоговор
				|				ИЗ
				|					Справочник.ДепозитныеВклады КАК ДепозитныеВклады
				|				ГДЕ
				|					ДепозитныеВклады.Ссылка = &ДепозитныйВклад)) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних";
			
			Запрос.УстановитьПараметр("ДепозитныйВклад", Запись.ДепозитныйВклад);
			Запрос.УстановитьПараметр("Период", Запись.Период);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РеквизитыОповещения.Вставить("СчетДоверительногоУправления", ВыборкаДетальныеЗаписи.СчетДоверительногоУправления);
			КонецЦикла;
			
			Справочники.Оповещения.СформироватьОповещения("РегистрСведений.РасчетныеПоказателиДепозитногоВклада", Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

