Перем ОшибкиОбработки;

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если ОшибкиОбработки.Найти(ТекстОшибки) = Неопределено Тогда
		ОшибкиОбработки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках()
	
	Если ОшибкиОбработки.Количество() > 0 Тогда
		
		ТекстОшибки = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ОшибкиОбработки, Символы.ПС);
	
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
			
			ТекстОшибки = ?(ЗначениеЗаполнено(ЭтотОбъект.Субъект), "Ошибка импорта рейтингов. Объект [" + ЭтотОбъект.Субъект + "].", "") + Символы.ПС + ТекстОшибки;
			
			РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ТекстОшибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
			
		ОшибкиОбработки.Очистить();
			
	КонецЕсли;
	
КонецПроцедуры  // ОповеститьОбОшибках

////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьДатуНачалаВеденияУчета() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(МИНИМУМ(МинимальныеДаты.Период), ГОД) КАК Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(ОстаткиДенежныхСредств.Период) КАК Период
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МИНИМУМ(ОстаткиЦенныхБумаг.Период)
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг) КАК МинимальныеДаты";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Период;		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьДатуНачалаВеденияУчета

Функция ПолучитьПараметрыДляСбораСтатистики(ИмяКоманды)
	
	СтрСохраняемыеДанные = "Команда,ДатаНачалаУчета" + ?(ЗначениеЗаполнено(ЭтотОбъект.Субъект), ",Субъект","") + ?(ЗначениеЗаполнено(ЭтотОбъект.ПолучателиПротоколаОбИзмененияхРейтингов), ",ПолучателиПротоколаОбИзмененияхРейтингов", "");
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, ЭтотОбъект);
	ПараметрыОтчета.Команда = ИмяКоманды;
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Функция НайтиРасхождения()
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаНачалаУчета) Тогда
		ЭтотОбъект.ДатаНачалаУчета = ПолучитьДатуНачалаВеденияУчета();
	КонецЕсли;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	#Область Запрос_кодов_загружаемых_из_матрикса_объектов
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код,
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов
		|ПОМЕСТИТЬ _КодыВоВнешнихСистемахСрезПоследних
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Период,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.РейтинговыеАгентства))) КАК КодыВоВнешнихСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	_КодыВоВнешнихСистемахСрезПоследних.Код КАК КодВМатрих,
		|	_КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица) КАК ЭтоЮридическоеЛицо
		|ПОМЕСТИТЬ _КодыМатрих
		|ИЗ
		|	_КодыВоВнешнихСистемахСрезПоследних КАК _КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	_КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица))
		|	И (_КодыВоВнешнихСистемахСрезПоследних.Объект = &Объект_1С
		|			ИЛИ &Объект_1С = НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыМатрих.КодВМатрих КАК КодВМатрих
		|ПОМЕСТИТЬ _КодыЦенныхБумаг
		|ИЗ
		|	_КодыМатрих КАК _КодыМатрих
		|ГДЕ
		|	НЕ _КодыМатрих.ЭтоЮридическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыВоВнешнихСистемахСрезПоследних.Код КАК КодВМатрих
		|ПОМЕСТИТЬ _КодыРейтинговыхАгентств
		|ИЗ
		|	_КодыВоВнешнихСистемахСрезПоследних КАК _КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	_КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.РейтинговыеАгентства)
		|	И _КодыВоВнешнихСистемахСрезПоследних.Объект В (&РейтинговыеАгентства)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыМатрих.КодВМатрих КАК КодВМатрих
		|ИЗ
		|	_КодыМатрих КАК _КодыМатрих
		|ГДЕ
		|	_КодыМатрих.ЭтоЮридическоеЛицо";

	РейтинговыеАгентства = Новый Массив;
	РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.АКРА);
	РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.FitchRatings);
	РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.Moodys);
	РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.RAEX);
	РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.StandardAndPoors);
	РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.НРА);
	РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.НКР);
	
	Запрос.УстановитьПараметр("Период",					ТекущаяДата());
	Запрос.УстановитьПараметр("Объект_1С",				ЭтотОбъект.Субъект);
	Запрос.УстановитьПараметр("РейтинговыеАгентства",	РейтинговыеАгентства);
	
	#КонецОбласти
	
	КодыЮрЛиц       = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КодВМатрих");
	КодыЦенныхБумаг = Запрос.МенеджерВременныхТаблиц.Таблицы["_КодыЦенныхБумаг"].ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("КодВМатрих");
	КодыАгентств    = Запрос.МенеджерВременныхТаблиц.Таблицы["_КодыРейтинговыхАгентств"].ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("КодВМатрих");
	
	ПолучитьДанныеИзМатрих(КодыЮрЛиц, КодыЦенныхБумаг, КодыАгентств, МВТ);
	
	СверитьРейтингиИШкалыРуДата(МВТ);
	
	ОповеститьОбОшибках();	
	
	#Область Запрос_новых_или_измененных_рейтингов
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата()); 
	Запрос.УстановитьПараметр("ПредыдущийРабочийДень", Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()) - 24*60*60));
	
	ИностранныеАгенства = Новый Массив;
	ИностранныеАгенства.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Агентство_FITCH"));
	ИностранныеАгенства.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Агентство_MOODYS"));
	ИностранныеАгенства.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Агентство_SP"));	
	
	Запрос.УстановитьПараметр("ИностранныеАгенства", ИностранныеАгенства); 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Рейтинги.Rating_date КАК Период,
		|	ВЫБОР
		|		КОГДА _Рейтинги.Subject_Type = ""Shares""
		|			ТОГДА КодыАкцийВМатрихеСрезПоследних.Объект
		|		КОГДА _Рейтинги.Subject_Type = ""Bonds""
		|			ТОГДА КодыОблигацийВМатрихеСрезПоследних.Объект
		|		КОГДА _Рейтинги.Subject_Type = ""Partner""
		|			ТОГДА КодыЮрЛицВМатрихеСрезПоследних.Объект
		|	КОНЕЦ КАК Субъект,
		|	КодыРейтинговыхАгентствВСрезПоследних.Объект КАК РейтинговоеАгентство,
		|	КодыШкалВСрезПоследних.Объект КАК Шкала,
		|	_Рейтинги.Rating КАК Рейтинг,
		|	_Рейтинги.Subject_Id КАК Subject_Id,
		|	_Рейтинги.Subject_Type КАК Subject_Type,
		|	_Рейтинги.Subject_Id_Type КАК Subject_Id_Type,
		|	ЗначенияРейтингов.Ссылка КАК ЗначениеРейтинга,
		|	_Рейтинги.Rating КАК Rating,
		|	ВЫБОР
		|		КОГДА _Рейтинги.Outlook_Type_UID = ""Ratings.Outlook.Negative""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Негативный)
		|		КОГДА _Рейтинги.Outlook_Type_UID = ""Ratings.Outlook.Positive""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Позитивный)
		|		КОГДА _Рейтинги.Outlook_Type_UID = ""Ratings.Outlook.Stable""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Стабильный)
		|		КОГДА _Рейтинги.Outlook_Type_UID = ""Ratings.Outlook.Undefined""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.НеОпределен)
		|		КОГДА _Рейтинги.Outlook_Type_UID = ""Ratings.Outlook.Review""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.НаПересмотре)
		|		КОГДА _Рейтинги.Outlook_Type_UID = ""Ratings.Outlook.Upcoming""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Развивающийся)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.ПустаяСсылка)
		|	КОНЕЦ КАК ПрогнозРуДата,
		|	_Рейтинги.Ratings_Is_Archive КАК Ratings_Is_Archive
		|ПОМЕСТИТЬ _РейтингиРуДата
		|ИЗ
		|	_РейтингиВнешниеДанные КАК _Рейтинги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)) КАК КодыЮрЛицВМатрихеСрезПоследних
		|		ПО (_Рейтинги.Subject_Type = ""Partner"")
		|			И _Рейтинги.Subject_Id = КодыЮрЛицВМатрихеСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)) КАК КодыАкцийВМатрихеСрезПоследних
		|		ПО (_Рейтинги.Subject_Type = ""Shares"")
		|			И _Рейтинги.Subject_Id = КодыАкцийВМатрихеСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)) КАК КодыОблигацийВМатрихеСрезПоследних
		|		ПО (_Рейтинги.Subject_Type = ""Bonds"")
		|			И _Рейтинги.Subject_Id = КодыОблигацийВМатрихеСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.РейтинговыеАгентства)) КАК КодыРейтинговыхАгентствВСрезПоследних
		|		ПО _Рейтинги.Agency_ID = КодыРейтинговыхАгентствВСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ШкалыРейтинговыхАгентств)) КАК КодыШкалВСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыРейтинговыхАгентств КАК ШкалыРейтинговыхАгентств
		|			ПО КодыШкалВСрезПоследних.Объект = ШкалыРейтинговыхАгентств.Ссылка
		|		ПО _Рейтинги.Scale_ID = КодыШкалВСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРейтингов КАК ЗначенияРейтингов
		|		ПО _Рейтинги.Rating = ЗначенияРейтингов.Наименование
		|			И (ШкалыРейтинговыхАгентств.Ссылка = ЗначенияРейтингов.Владелец)
		|ГДЕ
		|	ШкалыРейтинговыхАгентств.Агрегатор = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.РуДата)
		|	И НЕ КодыШкалВСрезПоследних.Объект ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РейтингиРуДата.Период КАК Период,
		|	_РейтингиРуДата.Субъект КАК Субъект,
		|	_РейтингиРуДата.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	_РейтингиРуДата.Шкала КАК Шкала,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _РейтингиРуДата.ЗначениеРейтинга) КАК ЗначениеРейтинга
		|ПОМЕСТИТЬ _РейтингиДвойники
		|ИЗ
		|	_РейтингиРуДата КАК _РейтингиРуДата
		|
		|СГРУППИРОВАТЬ ПО
		|	_РейтингиРуДата.Период,
		|	_РейтингиРуДата.РейтинговоеАгентство,
		|	_РейтингиРуДата.Шкала,
		|	_РейтингиРуДата.Субъект
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _РейтингиРуДата.ЗначениеРейтинга) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.Период КАК Период,
		|	РейтингиСрезПоследних.Агрегатор КАК Агрегатор,
		|	РейтингиСрезПоследних.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	РейтингиСрезПоследних.Шкала КАК Шкала,
		|	РейтингиСрезПоследних.Субъект КАК Субъект,
		|	РейтингиСрезПоследних.Рейтинг КАК Рейтинг,
		|	РейтингиСрезПоследних.ЗначениеРейтинга КАК ЗначениеРейтинга,
		|	РейтингиСрезПоследних.ЗначениеРейтинга.Оценка КАК УровеньРейтинга,
		|	РейтингиСрезПоследних.ПрогнозРейтинга КАК ПрогнозРейтинга,
		|	РейтингиСрезПоследних.ДатаПереходаВАрхив КАК ДатаПереходаВАрхив
		|ПОМЕСТИТЬ _ПоследниеРейтинги
		|ИЗ
		|	РегистрСведений.Рейтинги.СрезПоследних(
		|			&Период,
		|			НЕ РейтинговоеАгентство В (&ИностранныеАгенства)
		|				И Период >= ДАТАВРЕМЯ(2022, 1, 1)
		|				И Шкала.ВидРейтинга = ЗНАЧЕНИЕ(Перечисление.ВидыРейтингов.Кредитный)
		|				И НЕ ЗначениеРейтинга.РейтингСнят) КАК РейтингиСрезПоследних
		|ГДЕ
		|	РейтингиСрезПоследних.ЗначениеРейтинга.Оценка <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_ПоследниеРейтинги.Период) КАК Период,
		|	_ПоследниеРейтинги.Субъект КАК Субъект,
		|	МИНИМУМ(_ПоследниеРейтинги.УровеньРейтинга) КАК УровеньРейтинга
		|ПОМЕСТИТЬ _ПоследниеРейтингиПоСубъекту
		|ИЗ
		|	_ПоследниеРейтинги КАК _ПоследниеРейтинги
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеРейтинги.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_ПоследниеРейтинги.Период) КАК Период,
		|	_ПоследниеРейтинги.Субъект КАК ЮрЛицо,
		|	МИНИМУМ(_ПоследниеРейтинги.УровеньРейтинга) КАК УровеньРейтинга
		|ПОМЕСТИТЬ _ПоследниеРейтингиПоЮрЛицу
		|ИЗ
		|	_ПоследниеРейтинги КАК _ПоследниеРейтинги
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_ПоследниеРейтинги.Субъект) = ТИП(Справочник.ЮрФизЛица)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеРейтинги.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Рейтинги1С.Субъект, _РейтингиРуДата.Субъект) ССЫЛКА Справочник.Акции
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(Рейтинги1С.Субъект, _РейтингиРуДата.Субъект) ССЫЛКА Справочник.Облигации
		|			ТОГДА 1
		|		КОГДА ЕСТЬNULL(Рейтинги1С.Субъект, _РейтингиРуДата.Субъект) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА 2
		|	КОНЕЦ КАК Порядок,
		|	ЕСТЬNULL(Рейтинги1С.РейтинговоеАгентство, _РейтингиРуДата.РейтинговоеАгентство) КАК РейтинговоеАгентство,
		|	ЕСТЬNULL(Рейтинги1С.Шкала, _РейтингиРуДата.Шкала) КАК Шкала,
		|	ЕСТЬNULL(Рейтинги1С.Субъект, _РейтингиРуДата.Субъект) КАК Субъект,
		|	ЕСТЬNULL(Рейтинги1С.Период, _РейтингиРуДата.Период) КАК Период,
		|	Рейтинги1С.ЗначениеРейтинга КАК ЗначениеРейтингаТекущее,
		|	_РейтингиРуДата.ЗначениеРейтинга КАК ЗначениеРейтингаЗагружаемое,
		|	ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.РуДата) КАК Агрегатор,
		|	Рейтинги1С.ЗначениеРейтинга.Наименование КАК Рейтинг1С,
		|	ВЫРАЗИТЬ(_РейтингиРуДата.ЗначениеРейтинга КАК Справочник.ЗначенияРейтингов).Наименование КАК РейтингРуДата,
		|	ЕСТЬNULL(Рейтинги1С.ПрогнозРейтинга, ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.ПустаяСсылка)) КАК Прогноз1С,
		|	_РейтингиРуДата.ПрогнозРуДата КАК ПрогнозРуДата,
		|	_РейтингиРуДата.Ratings_Is_Archive КАК Ratings_Is_Archive,
		|	ВЫБОР
		|		КОГДА Рейтинги1С.ДатаПереходаВАрхив <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Ratings_Is_Archive_1С,
		|	Рейтинги1С.ДатаПереходаВАрхив КАК ДатаПереходаВАрхив_1С,
		|	Рейтинги1СПредыдущиеПоОднойШкале.Период КАК ДатаПредыдущегоРейтинга1сПоОднойШкале,
		|	Рейтинги1СПредыдущиеПоОднойШкале.ЗначениеРейтинга КАК ЗначениеПредыдущегоРейтинга1СПоОднойШкале,
		|	_ПоследниеРейтингиПоСубъекту.Период КАК Дата_ПоследниеРейтингиПоСубъекту,
		|	_ПоследниеРейтингиПоСубъекту.УровеньРейтинга КАК УровеньРейтинга_ПоследниеРейтингиПоСубъекту,
		|	_ПоследниеРейтингиПоЮрЛицу.Период КАК Дата_ПоследниеРейтингиПоЮрЛицу,
		|	_ПоследниеРейтингиПоЮрЛицу.УровеньРейтинга КАК УровеньРейтинга_ПоследниеРейтингиПоЮрЛицу,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Рейтинги1С.Период, _РейтингиРуДата.Период) = &ПредыдущийРабочийДень
		|			ТОГДА ЛОЖЬ
		|		КОГДА _РейтингиРуДата.Шкала.ВидРейтинга = ЗНАЧЕНИЕ(Перечисление.ВидыРейтингов.Прочий)
		|			ТОГДА ЛОЖЬ
		|		КОГДА ЕСТЬNULL(Рейтинги1С.РейтинговоеАгентство, _РейтингиРуДата.РейтинговоеАгентство) В (&ИностранныеАгенства)
		|			ТОГДА ЛОЖЬ
		|		КОГДА ЕСТЬNULL(Рейтинги1С.Период, _РейтингиРуДата.Период) < ДАТАВРЕМЯ(2022, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		КОГДА _РейтингиРуДата.ЗначениеРейтинга = Рейтинги1СПредыдущиеПоОднойШкале.ЗначениеРейтинга
		|			ТОГДА ЛОЖЬ
		|		КОГДА _РейтингиРуДата.ЗначениеРейтинга.Оценка = _ПоследниеРейтингиПоСубъекту.УровеньРейтинга
		|			ТОГДА ЛОЖЬ
		|		КОГДА _РейтингиРуДата.ЗначениеРейтинга.Оценка = _ПоследниеРейтингиПоЮрЛицу.УровеньРейтинга
		|			ТОГДА ЛОЖЬ
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Рейтинги1С.Субъект, _РейтингиРуДата.Субъект)) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Рейтинги1С.Субъект, _РейтингиРуДата.Субъект) КАК Справочник.Облигации).ДатаПогашения = ЕСТЬNULL(Рейтинги1С.Период, _РейтингиРуДата.Период)
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ТребуетсяПроверка
		|ИЗ
		|	РегистрСведений.Рейтинги КАК Рейтинги1С
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РейтингиРуДата КАК _РейтингиРуДата
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеРейтинги КАК Рейтинги1СПредыдущиеПоОднойШкале
		|			ПО _РейтингиРуДата.Период >= Рейтинги1СПредыдущиеПоОднойШкале.Период
		|				И _РейтингиРуДата.Субъект = Рейтинги1СПредыдущиеПоОднойШкале.Субъект
		|				И _РейтингиРуДата.Шкала = Рейтинги1СПредыдущиеПоОднойШкале.Шкала
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеРейтингиПоСубъекту КАК _ПоследниеРейтингиПоСубъекту
		|			ПО _РейтингиРуДата.Период >= _ПоследниеРейтингиПоСубъекту.Период
		|				И _РейтингиРуДата.Субъект = _ПоследниеРейтингиПоСубъекту.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеРейтингиПоЮрЛицу КАК _ПоследниеРейтингиПоЮрЛицу
		|			ПО _РейтингиРуДата.Период >= _ПоследниеРейтингиПоЮрЛицу.Период
		|				И (ВЫБОР
		|					КОГДА _РейтингиРуДата.Субъект ССЫЛКА Справочник.Акции
		|						ТОГДА ВЫРАЗИТЬ(_РейтингиРуДата.Субъект КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|					КОГДА _РейтингиРуДата.Субъект ССЫЛКА Справочник.Облигации
		|						ТОГДА ВЫРАЗИТЬ(_РейтингиРуДата.Субъект КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|					КОГДА _РейтингиРуДата.Субъект ССЫЛКА Справочник.ЮрФизЛица
		|						ТОГДА _РейтингиРуДата.Субъект
		|				КОНЕЦ = _ПоследниеРейтингиПоЮрЛицу.ЮрЛицо)
		|		ПО (_РейтингиРуДата.Период = Рейтинги1С.Период)
		|			И (_РейтингиРуДата.Субъект = Рейтинги1С.Субъект)
		|			И (_РейтингиРуДата.Шкала = Рейтинги1С.Шкала)
		|ГДЕ
		|	(Рейтинги1С.Субъект В
		|				(ВЫБРАТЬ
		|					_КодыМатрих.Объект
		|				ИЗ
		|					_КодыМатрих КАК _КодыМатрих)
		|			ИЛИ Рейтинги1С.Субъект ЕСТЬ NULL)
		|	И (Рейтинги1С.ЗначениеРейтинга <> _РейтингиРуДата.ЗначениеРейтинга
		|			ИЛИ Рейтинги1С.ЗначениеРейтинга ЕСТЬ NULL
		|			ИЛИ Рейтинги1С.ПрогнозРейтинга <> _РейтингиРуДата.ПрогнозРуДата
		|			ИЛИ _РейтингиРуДата.Ratings_Is_Archive <> ВЫБОР
		|				КОГДА Рейтинги1С.ДатаПереходаВАрхив <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|	И (Рейтинги1С.Агрегатор = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.РуДата)
		|			ИЛИ Рейтинги1С.Агрегатор ЕСТЬ NULL)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Субъект,
		|	Период,
		|	Агрегатор,
		|	РейтинговоеАгентство,
		|	Шкала,
		|	Рейтинг1С,
		|	РейтингРуДата";
	
	#КонецОбласти
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	РейтингиДвойники = МВТ.Таблицы.Найти("_РейтингиДвойники").ПолучитьДанные().Выгрузить();
	
	Для Каждого СтрокаДвойники из РейтингиДвойники Цикл 		
		ЗарегистрироватьОшибку("По рейтинговому агентству " + СтрокаДвойники.РейтинговоеАгентство + " у " 
		+ СтрокаДвойники.Субъект + ", шкала " + СтрокаДвойники.Шкала + " на " +  Формат(СтрокаДвойники.Период, "ДФ=dd.MM.yyyy") + 
		" зарегистрировано " + СтрокаДвойники.ЗначениеРейтинга + " различных значения рейтинга");
	КонецЦикла;	
		
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДопустимостьПрогноза(Прогноз, Агентство)
		
	Если Агентство = Справочники.РейтинговыеАгентства.АКРА
		ИЛИ Агентство = Справочники.РейтинговыеАгентства.RAEX
	Тогда
		
		Возврат Прогноз = Перечисления.ПрогнозыРейтингов.Негативный
			ИЛИ Прогноз = Перечисления.ПрогнозыРейтингов.Позитивный
			ИЛИ Прогноз = Перечисления.ПрогнозыРейтингов.Стабильный
			ИЛИ Прогноз = Перечисления.ПрогнозыРейтингов.Развивающийся
			ИЛИ Прогноз = Перечисления.ПрогнозыРейтингов.НеОпределен
			ИЛИ Прогноз = Перечисления.ПрогнозыРейтингов.НаПересмотре;

	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьКоманду(ИмяКоманды) Экспорт
	
	ДанныеДляОтчета = Неопределено;
	
	ПараметрыДляСбораСтатистики = ПолучитьПараметрыДляСбораСтатистики(ИмяКоманды);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыДляСбораСтатистики.Хранилище,
		ПараметрыДляСбораСтатистики.Описание);
		
	Расхождения = НайтиРасхождения();
	
	Если ИмяКоманды = "КомандаНайтиРасхождения" Тогда
	
		ДанныеДляОтчета = Расхождения;
		
	ИначеЕсли ИмяКоманды = "КомандаИмпортировать" Тогда
	
		Протокол = Расхождения.Скопировать(Новый Структура("Субъект", Неопределено));
		
		Протокол.Колонки.Добавить("Действие", Новый ОписаниеТипов("Строка"));
		
		РуДата = Справочники.ВнешниеСистемы.РуДата;
		
		ПустойРейтинг = Справочники.ЗначенияРейтингов.ПустаяСсылка();
		ПустойПрогноз = Перечисления.ПрогнозыРейтингов.ПустаяСсылка();

		
		Для Каждого СтрокаРасхождения Из Расхождения Цикл
			
			НовоеЗначениеРейтинга = СтрокаРасхождения.ЗначениеРейтингаЗагружаемое;
			
			НоваяСтрокаПротокол = Протокол.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПротокол, СтрокаРасхождения);
			
			Запись						= РегистрыСведений.Рейтинги.СоздатьМенеджерЗаписи();
			Запись.Агрегатор 			= РуДата;
			Запись.Период               = СтрокаРасхождения.Период;
			Запись.РейтинговоеАгентство = СтрокаРасхождения.РейтинговоеАгентство;
			Запись.Шкала                = СтрокаРасхождения.Шкала;
			Запись.Субъект              = СтрокаРасхождения.Субъект;
			Запись.Прочитать();
			
			Если НЕ Запись.Выбран() 
				И (НовоеЗначениеРейтинга <> ПустойРейтинг Или СтрокаРасхождения.Прогноз1с <> СтрокаРасхождения.ПрогнозРуДата Или СтрокаРасхождения.Ratings_Is_Archive <> СтрокаРасхождения.Ratings_Is_Archive_1С) Тогда
				
				Запись.Период               = СтрокаРасхождения.Период;
				Запись.Агрегатор 			= РуДата;
				Запись.РейтинговоеАгентство = СтрокаРасхождения.РейтинговоеАгентство;
				Запись.Шкала                = СтрокаРасхождения.Шкала;
				Запись.Субъект              = СтрокаРасхождения.Субъект;
				Запись.ЗначениеРейтинга     = НовоеЗначениеРейтинга;
				Запись.Рейтинг				= СтрокаРасхождения.РейтингРуДата;
				
				Если СтрокаРасхождения.Ratings_Is_Archive Тогда
					Если Не ЗначениеЗаполнено(СтрокаРасхождения.Ratings_Is_Archive_1С) Тогда
						Запись.ДатаПереходаВАрхив = НачалоДня(ТекущаяДатаСеанса());
					КонецЕсли;	
				Иначе
					Если ЗначениеЗаполнено(СтрокаРасхождения.ДатаПереходаВАрхив_1С) Тогда
						ЗарегистрироватьОшибку("По рейтингу '" + Запись.ЗначениеРейтинга + "', '" + Запись.РейтинговоеАгентство + "', '" + Запись.Шкала + "', '" + Запись.Субъект + "', '" + Запись.Период + "'" + " в Матриксе снят флаг Архивный, установленный по данным 1С  " + Формат(СтрокаРасхождения.ДатаПереходаВАрхив_1С, "ДФ=dd.MM.yyyy"));
					КонецЕсли;	
				КонецЕсли;	
				
				
				ЭтоДопустимыйПрогноз = ПроверитьДопустимостьПрогноза(СтрокаРасхождения.ПрогнозРуДата, СтрокаРасхождения.РейтинговоеАгентство);
				Если СтрокаРасхождения.ПрогнозРуДата <> ПустойПрогноз и ЭтоДопустимыйПрогноз Тогда 
					Запись.ПрогнозРейтинга			= СтрокаРасхождения.ПрогнозРуДата;
				ИначеЕсли СтрокаРасхождения.ПрогнозРуДата <> ПустойПрогноз и Не ЭтоДопустимыйПрогноз  Тогда
					ЗарегистрироватьОшибку("Прогноз " + СтрокаРасхождения.ПрогнозРуДата + " недопустим для агентства " + СтрокаРасхождения.РейтинговоеАгентство + ". Субъект " + СтрокаРасхождения.Субъект);
				КонецЕсли;
				
				Попытка
					Запись.Записать();
				Исключение
					ЗарегистрироватьОшибку("Не удалось записать '" + Запись.ЗначениеРейтинга + "', '" + Запись.РейтинговоеАгентство + "', '" + Запись.Шкала + "', '" + Запись.Субъект + "', '" + Запись.Период + "'." +
					Символы.ПС + "Система сообщает: " + ОписаниеОшибки());
				КонецПопытки;
				
				Если НовоеЗначениеРейтинга <> СтрокаРасхождения.ЗначениеПредыдущегоРейтинга1СПоОднойШкале Тогда
					НоваяСтрокаПротокол.Действие = "Новый рейтинг РуДата " + НовоеЗначениеРейтинга;
				Иначе
					НоваяСтрокаПротокол.Действие = "Обновлен рейтинг РуДата " + НовоеЗначениеРейтинга;
				КонецЕсли; 
				НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + ", уровень рейтинга " + СтрокаРасхождения.ЗначениеРейтингаЗагружаемое.Оценка;
				Если ЭтоДопустимыйПрогноз Тогда 					
					Если СтрокаРасхождения.Прогноз1с <> СтрокаРасхождения.ПрогнозРуДата 
						И СтрокаРасхождения.Прогноз1с <> ПустойПрогноз Тогда
						НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + "; изменен прогноз " + СтрокаРасхождения.Прогноз1с + " на " + СтрокаРасхождения.ПрогнозРуДата; 
					ИначеЕсли СтрокаРасхождения.Прогноз1с <> СтрокаРасхождения.ПрогнозРуДата 
						И СтрокаРасхождения.Прогноз1с = ПустойПрогноз Тогда	
						НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + "; установлен прогноз " + СтрокаРасхождения.ПрогнозРуДата; 					
					КонецЕсли;	
				КонецЕсли;	
				//Рейтинг Снят у погашенной облигации - не дергаемся. 
				Если ТипЗнч(СтрокаРасхождения.Субъект) = Тип("СправочникСсылка.Облигации") 
					И СтрокаРасхождения.Период = СтрокаРасхождения.Субъект.ДатаПогашения Тогда 
					НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + Символы.ПС + "Облигация погашена!"; 
				Иначе
					//инфа о старом рейтинге  
					Если СтрокаРасхождения.Шкала.ВидРейтинга = Перечисления.ВидыРейтингов.Прочий Тогда 
						НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + Символы.ПС + "Вид рейтинга 'Прочий'.";
						//этот Оценка собственной кредитоспособности. Является элементом рейтинга, но не самим рейтингом. 
						//проверяем только Вид рейтинга = Кредитный
					Иначе					
						Если ЗначениеЗаполнено(СтрокаРасхождения.ЗначениеПредыдущегоРейтинга1СПоОднойШкале) Тогда
							НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + Символы.ПС + "Предыдущий рейтинг по этой шкале " + СтрокаРасхождения.ЗначениеПредыдущегоРейтинга1СПоОднойШкале + " от " + Формат(СтрокаРасхождения.ДатаПредыдущегоРейтинга1сПоОднойШкале, "ДФ=dd.MM.yyyy");
						КонецЕсли;	
						Если ЗначениеЗаполнено(СтрокаРасхождения.УровеньРейтинга_ПоследниеРейтингиПоСубъекту) Тогда
							НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + Символы.ПС + "Последний установленный рейтинг по субъекту" 
							+ " от " + Формат(СтрокаРасхождения.Дата_ПоследниеРейтингиПоСубъекту, "ДФ=dd.MM.yyyy") 
							+ ", Уровень рейтинга " + СтрокаРасхождения.УровеньРейтинга_ПоследниеРейтингиПоСубъекту; 
						КонецЕсли; 
						
						Если ЗначениеЗаполнено(СтрокаРасхождения.УровеньРейтинга_ПоследниеРейтингиПоЮрЛицу) 
							И ТипЗнч(СтрокаРасхождения.Субъект) <> Тип("СправочникСсылка.ЮрФизЛица") Тогда
							НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + Символы.ПС + "Последний установленный рейтинг по Юрлицу (Эмитенту)" 
							+ " от " + Формат(СтрокаРасхождения.Дата_ПоследниеРейтингиПоЮрЛицу, "ДФ=dd.MM.yyyy") 
							+ ", Уровень рейтинга " + СтрокаРасхождения.УровеньРейтинга_ПоследниеРейтингиПоЮрЛицу; 
						КонецЕсли; 
					КонецЕсли;
				КонецЕсли;  
			ИначеЕсли НовоеЗначениеРейтинга = ПустойРейтинг  Тогда
				
				Запись.Удалить();
				
				НоваяСтрокаПротокол.Действие = "Удален рейтинг РуДата " + НоваяСтрокаПротокол.Рейтинг1С;
				
				//рейтинг удален, прозноз уже не интересен
				
			ИначеЕсли НоваяСтрокаПротокол.ЗначениеРейтингаТекущее = НовоеЗначениеРейтинга И СтрокаРасхождения.Ratings_Is_Archive <> СтрокаРасхождения.Ratings_Is_Archive_1С Тогда 
								
				Если СтрокаРасхождения.Ratings_Is_Archive Тогда
					Запись.ДатаПереходаВАрхив = НачалоДня(ТекущаяДатаСеанса());
					НоваяСтрокаПротокол.Действие = "Рейтинг перенесен в архив с " + Формат(Запись.ДатаПереходаВАрхив, "ДФ=dd.MM.yyyy") ; 
				Иначе
					ЗарегистрироватьОшибку("По рейтингу '" + Запись.ЗначениеРейтинга + "', '" + Запись.РейтинговоеАгентство + "', '" + Запись.Шкала + "', '" + Запись.Субъект + "', '" + Запись.Период + "'" + " в Матриксе снят флаг Архивный, установленный по данным 1С  " + Формат(СтрокаРасхождения.ДатаПереходаВАрхив_1С, "ДФ=dd.MM.yyyy"))
				КонецЕсли;	    
				
				Запись.Записать();
				
			Иначе
				
				Запись.ЗначениеРейтинга	= НовоеЗначениеРейтинга;
				Запись.Рейтинг			= СтрокаРасхождения.РейтингРуДата;
				
				ЭтоДопустимыйПрогноз = ПроверитьДопустимостьПрогноза(СтрокаРасхождения.ПрогнозРуДата, СтрокаРасхождения.РейтинговоеАгентство);
				Если СтрокаРасхождения.ПрогнозРуДата <> ПустойПрогноз  и ЭтоДопустимыйПрогноз Тогда 
					Запись.ПрогнозРейтинга			= СтрокаРасхождения.ПрогнозРуДата;
				ИначеЕсли СтрокаРасхождения.ПрогнозРуДата <> ПустойПрогноз и Не ЭтоДопустимыйПрогноз Тогда
					ЗарегистрироватьОшибку("Прогноз " + СтрокаРасхождения.ПрогнозРуДата + " недопустим для агентства " + СтрокаРасхождения.РейтинговоеАгентство + ". Субъект " + СтрокаРасхождения.Субъект);
				ИначеЕсли СтрокаРасхождения.ПрогнозРуДата = ПустойПрогноз И СтрокаРасхождения.Прогноз1с <> ПустойПрогноз Тогда
					Запись.ПрогнозРейтинга			= СтрокаРасхождения.ПрогнозРуДата;
				КонецЕсли;
				
				Запись.Записать();  
			
				Если НовоеЗначениеРейтинга <> СтрокаРасхождения.ЗначениеРейтингаТекущее Тогда
					НоваяСтрокаПротокол.Действие = "Рейтинг РуДата " + НоваяСтрокаПротокол.Рейтинг1С + " изменен на " + НовоеЗначениеРейтинга; 
				Иначе 
					НоваяСтрокаПротокол.Действие = "Рейтинг не изменился";
				КонецЕсли;
				Если ЭтоДопустимыйПрогноз Тогда
					Если СтрокаРасхождения.Прогноз1с <> СтрокаРасхождения.ПрогнозРуДата 
						И СтрокаРасхождения.Прогноз1с <> ПустойПрогноз Тогда
						НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + ", изменен прогноз " + СтрокаРасхождения.Прогноз1с + " на " + СтрокаРасхождения.ПрогнозРуДата; 
					ИначеЕсли СтрокаРасхождения.Прогноз1с <> СтрокаРасхождения.ПрогнозРуДата 
						И СтрокаРасхождения.Прогноз1с = ПустойПрогноз Тогда	
						НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + ", установлен прогноз " + СтрокаРасхождения.ПрогнозРуДата;
					КонецЕсли;
				Иначе // отработаем пустой рейтинг 
					Если СтрокаРасхождения.ПрогнозРуДата = ПустойПрогноз И СтрокаРасхождения.Прогноз1с <> ПустойПрогноз Тогда
						НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + ", снят прогноз " + СтрокаРасхождения.Прогноз1с;
					КонецЕсли;
				КонецЕсли;   
			КонецЕсли; 
			Если СтрокаРасхождения.ТребуетсяПроверка Тогда
				НоваяСтрокаПротокол.Действие = НоваяСтрокаПротокол.Действие + Символы.ПС + "НЕОБХОДИМО ПРОВЕРИТЬ ДРУГИЕ ПАРАМЕТРЫ!";
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ПустаяСтрока(ЭтотОбъект.ПолучателиПротоколаОбИзмененияхРейтингов) И (ОшибкиОбработки.Количество() > 0 Или Расхождения.Количество() > 0) Тогда
			ОтправитьПротоколИмпортаПоЭлектроннойПочте(Протокол); 
		КонецЕсли;

		ДанныеДляОтчета = Протокол;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В обработке импорта рейтингов не прописаны действия для команды [" + ИмяКоманды + "].");	
	КонецЕсли;
	
	ОповеститьОбОшибках();
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат ДанныеДляОтчета;
	
КонецФункции // ИмпортироватьРейтинги

Процедура ПолучитьДанныеИзМатрих(КодыПартнеров, КодыЦенныхБумаг, КодыАгентств, МВТ)
	
	РейтингиВнешниеДанные          = Неопределено;
	ЗначенияРейтинговВнешниеДанные = Неопределено;
	КодыАгентствСтрока             = "";
		
	Для Каждого КодАгентства Из КодыАгентств Цикл
		КодыАгентствСтрока = КодыАгентствСтрока + ?(ПустаяСтрока(КодыАгентствСтрока), "", ", ") + "'" + КодАгентства + "'";
	КонецЦикла;
	
	СтрокаСоединения = РаботаСВнешнимиСистемами.СтрокаСоединенияСМатрих();
	
	СтруктураТаблицыРейтингов = Новый Структура();
	СтруктураТаблицыРейтингов.Вставить("Rating_Date"    , Новый ОписаниеТипов("Дата"));
	СтруктураТаблицыРейтингов.Вставить("Subject_Type"   , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	СтруктураТаблицыРейтингов.Вставить("Subject_Id_Type", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	СтруктураТаблицыРейтингов.Вставить("Subject_Id"     , Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.Ресурсы.Код.Тип);
	СтруктураТаблицыРейтингов.Вставить("Agency_ID"      , Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.Ресурсы.Код.Тип);
	СтруктураТаблицыРейтингов.Вставить("Scale_ID"       , Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.Ресурсы.Код.Тип);
	СтруктураТаблицыРейтингов.Вставить("Rating"         , Метаданные.РегистрыСведений.Рейтинги.Ресурсы.Рейтинг.Тип);
	СтруктураТаблицыРейтингов.Вставить("Scale_Type_UID" , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(128)));
	СтруктураТаблицыРейтингов.Вставить("Kind_UID"       , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(128)));
	СтруктураТаблицыРейтингов.Вставить("Type_UID"       , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(128)));
	СтруктураТаблицыРейтингов.Вставить("Description"    , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	СтруктураТаблицыРейтингов.Вставить("Is_Archive"     , Новый ОписаниеТипов("Булево"));
	СтруктураТаблицыРейтингов.Вставить("Name"           , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	СтруктураТаблицыРейтингов.Вставить("ISO_Num"        , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(3)));
	СтруктураТаблицыРейтингов.Вставить("Outlook_Type_UID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(30)));
	СтруктураТаблицыРейтингов.Вставить("Ratings_Is_Archive", Новый ОписаниеТипов("Булево"));
	
	СтруктураТаблицыЗначенийРейтингов = Новый Структура();
	СтруктураТаблицыЗначенийРейтингов.Вставить("Scale_UID"  , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
	СтруктураТаблицыЗначенийРейтингов.Вставить("Rating"     , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	СтруктураТаблицыЗначенийРейтингов.Вставить("Grade"      , Новый ОписаниеТипов("Число"));
	СтруктураТаблицыЗначенийРейтингов.Вставить("Description", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(1000)));
	СтруктураТаблицыЗначенийРейтингов.Вставить("Is_Archive"	, Новый ОписаниеТипов("Булево"));
	
	// получим рейтинги из Матрих-а (выбираем все рейтинги за период и один предшествующий рейтинг)
#Область ТЕКСТ_ЗАПРОСА
	ТекстЗапроса =
		"SELECT
		|	All_Ratings.Rating_Date As Rating_Date,
		|	All_Ratings.Subject_Type As Subject_Type,
		|	All_Ratings.Subject_Id_Type As Subject_Id_Type,
		|	All_Ratings.Subject_Id As Subject_Id,
		|	All_Ratings.Agency_Type_UID As Agency_ID,
		|	All_Ratings.Scale_Type_UID As Scale_ID,
		|	All_Ratings.Kind_UID As Kind_UID,
		|	All_Ratings.Type_UID As Type_UID,
		|	All_Ratings.Rating As Rating,
		|	Scales.Scale_Type_UID As Scale_Type_UID,
		|	Scales.Description As Description,
		|	Scales.Name As Name,
		|	Scales.Is_Archive As Is_Archive,
		|	Countries.ISO_Num As ISO_Num, 
		|	All_Ratings.Outlook_Type_UID As Outlook_Type_UID,
		|	All_Ratings.Is_Archive As Ratings_Is_Archive
		|FROM
		|	(SELECT
		|		r.Rating_Date As Rating_Date,
		|		r.Subject_Type As Subject_Type,
		|		r.Subject_Id_Type As Subject_Id_Type,
		|		r.Subject_Id As Subject_Id,
		|		r.Agency_Type_UID As Agency_Type_UID,
		|		r.Scale_Type_UID As Scale_Type_UID,
		|		r.Scale_ID As Scale_ID,
		|		r.Kind_UID As Kind_UID,
		|		r.Type_UID As Type_UID,
		|		r.Rating As Rating,
		|		r.Status_Type As Status_Type,
		|		r.Outlook_Type_UID As Outlook_Type_UID,
		|		r.Is_Archive As Is_Archive
		|	FROM
		|		[Migration].[AM].[udf_All_Ratings]('@Partners_Id_List', '@Securities_Id_List', '@Agency_Id_List', @date) [r]
		|	) [All_Ratings]
		|	LEFT JOIN [Migration].[AM].[vw_Enums_Values] [Rating_Status]
		|	ON Rating_Status.Enum_UID = 'Ratings.Advanced'
		|		AND Rating_Status.ID = All_Ratings.Status_Type
		|	LEFT JOIN [Migration].[AM].[vw_Ratings_Scales] Scales
		|	ON All_Ratings.Scale_ID = Scales.ID
		|		LEFT JOIN [Migration].[AM].[vw_Countries] Countries
		|		ON Scales.Country_ID = Countries.CountryID 
		|WHERE
		|	ISNULL(Rating_Status.UID, '') <> 'Ratings.Advanced.Expected' 
		| 	AND Scales.Scale_Type_UID <> 'Ratings.Scale.Other'";
	
#КонецОбласти
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "@Partners_Id_List"  ,	НаборЗначенийВФорматеSQL(КодыПартнеров));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "@Securities_Id_List",	НаборЗначенийВФорматеSQL(КодыЦенныхБумаг));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "@Agency_Id_List"    , НаборЗначенийВФорматеSQL(КодыАгентств));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "@date"              , ДатаВФорматеSQL(ЭтотОбъект.ДатаНачалаУчета));
					
	РейтингиВнешниеДанные = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, СтруктураТаблицыРейтингов);
	
	Если РейтингиВнешниеДанные = Неопределено Тогда
		
		РейтингиВнешниеДанные = Новый ТаблицаЗначений;
		
		Для Каждого Элемент Из СтруктураТаблицыРейтингов Цикл
			РейтингиВнешниеДанные.Колонки.Добавить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;	
		
	Иначе //Получим данные для сверки значений рейтинговых шкал
		
		КодыШкал = РейтингиВнешниеДанные.Скопировать(,"Scale_Id");
		КодыШкал.Свернуть("Scale_Id");
		
		КодыШкалСтрока = "";
		
		Для Каждого СтрокаТаблицы Из КодыШкал Цикл
			КодыШкалСтрока = КодыШкалСтрока + ?(ПустаяСтрока(КодыШкалСтрока), "", ", ") + "'" + СтрокаТаблицы.Scale_Id + "'";
		КонецЦикла;	
		//Исключены шкалы с типом прочее ('Ratings.Scale.Other') и шкалы с незаполненным сроком (P.Type_UID IS NOT NULL) 
		ЗначенияРейтинговВнешниеДанные = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения,
			"SELECT P.Scale_UID, P.Rating, P.Grade, P.Description, P.Is_Archive  
			|FROM [Migration].[AM].[vw_Ratings_Scales_Points] P
			|WHERE P.Scale_ID >= 30 AND P.Scale_Type_UID <> 'Ratings.Scale.Other' AND P.Type_UID IS NOT NULL
			|	AND" + ?(КодыШкалСтрока = "", " FALSE", " P.Scale_UID IN (" + КодыШкалСтрока + ")") + "
			|	AND" + ?(КодыАгентствСтрока = "", " FALSE", " P.Agency_Type_UID IN (" + КодыАгентствСтрока + ")"), СтруктураТаблицыЗначенийРейтингов);
		
				
	КонецЕсли;
	
	Если ЗначенияРейтинговВнешниеДанные = Неопределено Тогда
		
		ЗначенияРейтинговВнешниеДанные = Новый ТаблицаЗначений;
		Для Каждого Элемент Из СтруктураТаблицыЗначенийРейтингов Цикл
			ЗначенияРейтинговВнешниеДанные.Колонки.Добавить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиВнешниеДанные.Rating_Date КАК Rating_Date,
		|	РейтингиВнешниеДанные.Subject_Type КАК Subject_Type,
		|	РейтингиВнешниеДанные.Subject_Id_Type КАК Subject_Id_Type,
		|	РейтингиВнешниеДанные.Subject_Id КАК Subject_Id,
		|	РейтингиВнешниеДанные.Agency_ID КАК Agency_ID,
		|	РейтингиВнешниеДанные.Scale_ID КАК Scale_ID,
		|	РейтингиВнешниеДанные.Kind_UID КАК Kind_UID,
		|	РейтингиВнешниеДанные.Type_UID КАК Type_UID,
		|	РейтингиВнешниеДанные.Rating КАК Rating,
		|	РейтингиВнешниеДанные.Scale_Type_UID КАК Scale_Type_UID,
		|	РейтингиВнешниеДанные.Description КАК Description,
		|	РейтингиВнешниеДанные.Is_Archive КАК Is_Archive,
		|	РейтингиВнешниеДанные.Name КАК Name,
		|	РейтингиВнешниеДанные.ISO_Num КАК ISO_Num,
		|	РейтингиВнешниеДанные.Outlook_Type_UID,
		|	РейтингиВнешниеДанные.Ratings_Is_Archive
		|ПОМЕСТИТЬ _РейтингиВнешниеДанные
		|ИЗ 
		|	&РейтингиВнешниеДанные КАК РейтингиВнешниеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗначенияРейтингов.Scale_UID КАК Scale_UID,
		|	ЗначенияРейтингов.Rating КАК Rating,
		|	ЗначенияРейтингов.Grade КАК Grade,
		|	ЗначенияРейтингов.Is_Archive КАК Is_Archive,
		|	ЗначенияРейтингов.Description КАК Description
		|ПОМЕСТИТЬ _ЗначенияРейтинговВнешниеДанные
		|ИЗ
		|	&ЗначенияРейтингов КАК ЗначенияРейтингов";
	
	Запрос.УстановитьПараметр("РейтингиВнешниеДанные", РейтингиВнешниеДанные);
	Запрос.УстановитьПараметр("ЗначенияРейтингов"    , ЗначенияРейтинговВнешниеДанные);
	Запрос.Выполнить();	
			
КонецПроцедуры


Процедура СверитьРейтингиИШкалыРуДата(МВТ)
			
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РейтинговыеШкалы_Матрих.Scale_ID КАК Scale_ID,
		|	_РейтинговыеШкалы_Матрих.Agency_ID КАК Agency_ID,
		|	_РейтинговыеШкалы_Матрих.Scale_Type_UID КАК Scale_Type_UID,
		|	ВЫБОР
		|		КОГДА _РейтинговыеШкалы_Матрих.Scale_Type_UID = ""Ratings.Scale.National""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная)
		|		КОГДА _РейтинговыеШкалы_Матрих.Scale_Type_UID = ""Ratings.Scale.National.LC""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.НациональнаяНацВалюта)
		|		КОГДА _РейтинговыеШкалы_Матрих.Scale_Type_UID = ""Ratings.Scale.National.FC""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.НациональнаяИнВалюта)
		|		КОГДА _РейтинговыеШкалы_Матрих.Scale_Type_UID = ""Ratings.Scale.International.FC""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|		КОГДА _РейтинговыеШкалы_Матрих.Scale_Type_UID = ""Ratings.Scale.International.LC""
		|				ИЛИ _РейтинговыеШкалы_Матрих.Scale_Type_UID = ""Ratings.Scale.International.LC.Alt""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|		КОГДА _РейтинговыеШкалы_Матрих.Scale_Type_UID = ""Ratings.Scale.International""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Международная)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.ПустаяСсылка)
		|	КОНЕЦ КАК ТипШкалы_Матрих,
		|	_РейтинговыеШкалы_Матрих.Kind_UID КАК Kind_UID,
		|	ВЫБОР
		|		КОГДА _РейтинговыеШкалы_Матрих.Kind_UID = ""Ratings.Kind.Credit""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРейтингов.Кредитный)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРейтингов.Прочий)
		|	КОНЕЦ КАК ВидРейтинга_Матрих,
		|	_РейтинговыеШкалы_Матрих.Type_UID КАК Type_UID,
		|	ВЫБОР
		|		КОГДА _РейтинговыеШкалы_Матрих.Type_UID = ""Ratings.Type.LT""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СрокиРейтингов.Долгосрочный)
		|		КОГДА _РейтинговыеШкалы_Матрих.Type_UID = ""Ratings.Type.ST""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СрокиРейтингов.Краткосрочный)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СрокиРейтингов.ПустаяСсылка)
		|	КОНЕЦ КАК СрокРейтинга_Матрих,
		|	_РейтинговыеШкалы_Матрих.Description + "". "" + _РейтинговыеШкалы_Матрих.Name КАК НаименованиеШкалы_Матрих,
		|	_РейтинговыеШкалы_Матрих.Is_Archive КАК Is_Archive,
		|	_РейтинговыеШкалы_Матрих.ISO_Num КАК ISO_Num,
		|	КодыШкалСрезПоследних.Объект КАК ШкалаСсылка,
		|	КодыШкалСрезПоследних.Объект.Владелец КАК ВладелецШкалы,
		|	КодыШкалСрезПоследних.Объект.ТипШкалы КАК ТипШкалы_1С,
		|	КодыШкалСрезПоследних.Объект.Страна КАК СтранаШкалы_1С,
		|	КодыШкалСрезПоследних.Объект.ВидРейтинга КАК ВидРейтинга_1С,
		|	КодыШкалСрезПоследних.Объект.Срок КАК СрокРейтинга_1С,
		|	ВЫБОР
		|		КОГДА КодыШкалСрезПоследних.Объект.ДатаПереходаВАрхив <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Is_Archive_1С,
		|	КодыШкалСрезПоследних.Объект.ДатаПереходаВАрхив КАК ДатаПереходаВАрхив_1С,
		|	КодыШкалСрезПоследних.Объект.Наименование КАК Наименование_1С,
		|	КодыАгенствСрезПоследних.Объект КАК Агентство_Матрих,
		|	ЕСТЬNULL(СтраныМира.Ссылка, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК Страна_Матрих
		|ПОМЕСТИТЬ _ДанныеРейтинговыхШкал
		|ИЗ
		|	_РейтингиВнешниеДанные КАК _РейтинговыеШкалы_Матрих
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = &Шкалы
		|					И ВЫРАЗИТЬ(Объект КАК Справочник.ШкалыРейтинговыхАгентств).Агрегатор = &Агрегатор) КАК КодыШкалСрезПоследних
		|		ПО _РейтинговыеШкалы_Матрих.Scale_ID = КодыШкалСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = &Агенства) КАК КодыАгенствСрезПоследних
		|		ПО _РейтинговыеШкалы_Матрих.Agency_ID = КодыАгенствСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|		ПО _РейтинговыеШкалы_Матрих.ISO_Num = СтраныМира.Код
		|			И (_РейтинговыеШкалы_Матрих.Scale_Type_UID В (""Ratings.Scale.National"", ""Ratings.Scale.National.LC"", ""Ratings.Scale.National.FC""))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеРейтинговыхШкал.Scale_ID КАК Scale_ID,
		|	_ДанныеРейтинговыхШкал.Agency_ID КАК Agency_ID,
		|	_ДанныеРейтинговыхШкал.Scale_Type_UID КАК Scale_Type_UID,
		|	_ДанныеРейтинговыхШкал.ТипШкалы_Матрих КАК ТипШкалы_Матрих,
		|	_ДанныеРейтинговыхШкал.ВидРейтинга_Матрих КАК ВидРейтинга_Матрих,
		|	_ДанныеРейтинговыхШкал.СрокРейтинга_Матрих КАК СрокРейтинга_Матрих,
		|	_ДанныеРейтинговыхШкал.НаименованиеШкалы_Матрих КАК НаименованиеШкалы_Матрих,
		|	_ДанныеРейтинговыхШкал.ISO_Num КАК ISO_Num,
		|	_ДанныеРейтинговыхШкал.Is_Archive КАК Is_Archive,
		|	_ДанныеРейтинговыхШкал.ДатаПереходаВАрхив_1С КАК ДатаПереходаВАрхив_1С,
		|	_ДанныеРейтинговыхШкал.ШкалаСсылка КАК ШкалаСсылка,
		|	_ДанныеРейтинговыхШкал.Агентство_Матрих КАК Агентство_Матрих,
		|	_ДанныеРейтинговыхШкал.Страна_Матрих КАК Страна_Матрих,
		|	ВЫБОР
		|		КОГДА _ДанныеРейтинговыхШкал.ШкалаСсылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НоваяШкала
		|ИЗ
		|	_ДанныеРейтинговыхШкал КАК _ДанныеРейтинговыхШкал
		|ГДЕ
		|	(_ДанныеРейтинговыхШкал.ШкалаСсылка ЕСТЬ NULL
		|			ИЛИ _ДанныеРейтинговыхШкал.ТипШкалы_Матрих = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.ПустаяСсылка)
		|			ИЛИ _ДанныеРейтинговыхШкал.ТипШкалы_Матрих <> _ДанныеРейтинговыхШкал.ТипШкалы_1С
		|			ИЛИ _ДанныеРейтинговыхШкал.ВидРейтинга_Матрих <> _ДанныеРейтинговыхШкал.ВидРейтинга_1С
		|			ИЛИ _ДанныеРейтинговыхШкал.СрокРейтинга_Матрих <> _ДанныеРейтинговыхШкал.СрокРейтинга_1С
		|			ИЛИ _ДанныеРейтинговыхШкал.Страна_Матрих <> _ДанныеРейтинговыхШкал.СтранаШкалы_1С
		|			ИЛИ _ДанныеРейтинговыхШкал.Is_Archive <> _ДанныеРейтинговыхШкал.Is_Archive_1С
		|			ИЛИ _ДанныеРейтинговыхШкал.НаименованиеШкалы_Матрих <> _ДанныеРейтинговыхШкал.Наименование_1С)";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Агрегатор", Справочники.ВнешниеСистемы.РуДата);
	Запрос.УстановитьПараметр("Период"   , КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Шкалы"    , Справочники.ГруппыИмпортируемыхОбъектов.ШкалыРейтинговыхАгентств);
	Запрос.УстановитьПараметр("Агенства" , Справочники.ГруппыИмпортируемыхОбъектов.РейтинговыеАгентства);
	
	ВыборкаШкал = Запрос.Выполнить().Выбрать();
		
	Пока ВыборкаШкал.Следующий() Цикл
		
		Если ВыборкаШкал.НоваяШкала Тогда
			
			Если Не ЗначениеЗаполнено(ВыборкаШкал.Агентство_Матрих) Тогда
				ЗарегистрироватьОшибку("Не удалось найти рейтинговое агенство по коду матрикс [" + ВыборкаШкал.Agency_ID + "]");
				Продолжить;
			КонецЕсли;
			
			ШкалаОбъект = Справочники.ШкалыРейтинговыхАгентств.СоздатьЭлемент();
			
		Иначе	
			ШкалаОбъект = ВыборкаШкал.ШкалаСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаШкал.Страна_Матрих) И ВыборкаШкал.ТипШкалы_Матрих = Перечисления.ТипыШкалРейтинговыхАгенств.Национальная Тогда 
			ЗарегистрироватьОшибку("Не удалось найти страну по коду ISO [" + ВыборкаШкал.ISO_Num + "] для рейтинговой шкалы [" + ВыборкаШкал.Scale_ID + "]");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаШкал.ТипШкалы_Матрих) Тогда
			ЗарегистрироватьОшибку("Не удалось определить тип шкалы по коду матрикс [" + ВыборкаШкал.Scale_Type_UID + "]");
		КонецЕсли;
								
		ШкалаОбъект.ТипШкалы     = ВыборкаШкал.ТипШкалы_Матрих;
		ШкалаОбъект.ВидРейтинга  = ВыборкаШкал.ВидРейтинга_Матрих;
		ШкалаОбъект.Срок         = ВыборкаШкал.СрокРейтинга_Матрих;
		ШкалаОбъект.Страна       = ВыборкаШкал.Страна_Матрих;
		ШкалаОбъект.Наименование = ВыборкаШкал.НаименованиеШкалы_Матрих;
		
		Если ВыборкаШкал.Is_Archive Тогда
			Если Не ЗначениеЗаполнено(ВыборкаШкал.ДатаПереходаВАрхив_1С) Тогда
				ШкалаОбъект.ДатаПереходаВАрхив = НачалоДня(ТекущаяДатаСеанса());
			КонецЕсли;	
		Иначе
			Если ЗначениеЗаполнено(ВыборкаШкал.ДатаПереходаВАрхив_1С) Тогда
				ЗарегистрироватьОшибку("По шкале " + ВыборкаШкал.НаименованиеШкалы_Матрих + " в Матриксе снят флаг Архивный, установленный по данным 1С  " + Формат(ВыборкаШкал.ДатаПереходаВАрхив_1С, "ДФ=dd.MM.yyyy"));
			КонецЕсли;	
		КонецЕсли;	
		
		Если ВыборкаШкал.НоваяШкала Тогда
			
			ШкалаОбъект.Владелец  = ВыборкаШкал.Агентство_Матрих;
			ШкалаОбъект.Агрегатор = Справочники.ВнешниеСистемы.РуДата;
			
		КонецЕсли;
		
		ШкалаОбъект.Записать();
		
		Если ВыборкаШкал.НоваяШкала Тогда
			
			КодВоВнешнейСистеме                = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьМенеджерЗаписи();
			КодВоВнешнейСистеме.Период         = Дата(1980, 1, 1);
			КодВоВнешнейСистеме.ВнешняяСистема = Справочники.ВнешниеСистемы.Матрих;
			КодВоВнешнейСистеме.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ШкалыРейтинговыхАгентств;
			КодВоВнешнейСистеме.Объект         = ШкалаОбъект.Ссылка;
			КодВоВнешнейСистеме.Код            = ВыборкаШкал.Scale_ID;
			КодВоВнешнейСистеме.Записать();
			
		КонецЕсли;
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЗначенияРейтинговВнешниеДанные.Scale_UID КАК Scale_UID,
		|	_ЗначенияРейтинговВнешниеДанные.Rating КАК Rating,
		|	_ЗначенияРейтинговВнешниеДанные.Grade КАК Grade,
		|	_ЗначенияРейтинговВнешниеДанные.Is_Archive КАК Is_Archive,
		|	_ЗначенияРейтинговВнешниеДанные.Description КАК Description,
		|	КодыШкалСрезПоследних.Объект КАК Шкала
		|ПОМЕСТИТЬ _ЗначенияРейтингов_Матрих
		|ИЗ
		|	_ЗначенияРейтинговВнешниеДанные КАК _ЗначенияРейтинговВнешниеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = &Шкалы
		|					И ВЫРАЗИТЬ(Объект КАК Справочник.ШкалыРейтинговыхАгентств).Агрегатор = &Агрегатор) КАК КодыШкалСрезПоследних
		|		ПО _ЗначенияРейтинговВнешниеДанные.Scale_UID = КодыШкалСрезПоследних.Код
		|ГДЕ
		|	НЕ КодыШкалСрезПоследних.Объект ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗначенияРейтингов_Матрих.Rating КАК Rating,
		|	_ЗначенияРейтингов_Матрих.Grade КАК Grade,
		|	_ЗначенияРейтингов_Матрих.Description КАК Description,
		|	_ЗначенияРейтингов_Матрих.Is_Archive КАК Is_Archive,
		|	_ЗначенияРейтингов_Матрих.Шкала КАК Шкала_Матрих,
		|	ВЫБОР
		|		КОГДА ЗначенияРейтингов.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НовыйРейтинг,
		|	ЗначенияРейтингов.Ссылка КАК РейтингСсылка,
		|	ЗначенияРейтингов.ДатаПереходаВАрхив КАК ДатаПереходаВАрхив_1С,
		|	ПРЕДСТАВЛЕНИЕ(_ЗначенияРейтингов_Матрих.Шкала) КАК ШкалаПредставление
		|ИЗ
		|	_ЗначенияРейтингов_Матрих КАК _ЗначенияРейтингов_Матрих
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРейтингов КАК ЗначенияРейтингов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыРейтинговыхАгентств КАК ШкалыРейтинговыхАгентств
		|			ПО ЗначенияРейтингов.Владелец = ШкалыРейтинговыхАгентств.Ссылка
		|				И (ШкалыРейтинговыхАгентств.Агрегатор = &Агрегатор)
		|		ПО _ЗначенияРейтингов_Матрих.Шкала = ЗначенияРейтингов.Владелец
		|			И _ЗначенияРейтингов_Матрих.Rating = ЗначенияРейтингов.Наименование
		|ГДЕ
		|	(ЗначенияРейтингов.Ссылка ЕСТЬ NULL
		|			ИЛИ _ЗначенияРейтингов_Матрих.Grade <> ЗначенияРейтингов.Оценка
		|			ИЛИ _ЗначенияРейтингов_Матрих.Description <> ЗначенияРейтингов.Описание
		|			ИЛИ _ЗначенияРейтингов_Матрих.Is_Archive <> ВЫБОР
		|				КОГДА ЗначенияРейтингов.ДатаПереходаВАрхив <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Агрегатор", Справочники.ВнешниеСистемы.РуДата);
	Запрос.УстановитьПараметр("Период"   , КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Шкалы"    , Справочники.ГруппыИмпортируемыхОбъектов.ШкалыРейтинговыхАгентств);
	
	ВыборкаЗначенийРейтингов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗначенийРейтингов.Следующий() Цикл
				
		Если ВыборкаЗначенийРейтингов.НовыйРейтинг Тогда
			
			ЗначениеОбъект = Справочники.ЗначенияРейтингов.СоздатьЭлемент();
			ЗначениеОбъект.Владелец     = ВыборкаЗначенийРейтингов.Шкала_Матрих;
			ЗначениеОбъект.Наименование = ВыборкаЗначенийРейтингов.Rating;
			
		Иначе 
			ЗначениеОбъект = ВыборкаЗначенийРейтингов.РейтингСсылка.ПолучитьОбъект();
		КонецЕсли;
			
		ЗначениеОбъект.Оценка   = ВыборкаЗначенийРейтингов.Grade;
		ЗначениеОбъект.Описание = ВыборкаЗначенийРейтингов.Description;
		
		Если (СокрЛП(ВыборкаЗначенийРейтингов.Rating) = "Снят") ИЛИ (СокрЛП(ВыборкаЗначенийРейтингов.Rating) = "Withdrawn") Тогда 
			ЗначениеОбъект.РейтингСнят = Истина;
		КонецЕсли;
		
		Если ВыборкаЗначенийРейтингов.Is_Archive Тогда
			Если Не ЗначениеЗаполнено(ВыборкаЗначенийРейтингов.ДатаПереходаВАрхив_1С) Тогда
				ЗначениеОбъект.ДатаПереходаВАрхив = НачалоДня(ТекущаяДатаСеанса());
			КонецЕсли;	
		Иначе
			Если ЗначениеЗаполнено(ВыборкаЗначенийРейтингов.ДатаПереходаВАрхив_1С) Тогда
				ЗарегистрироватьОшибку("По значению рейтинга " + СокрЛП(ВыборкаЗначенийРейтингов.Rating) + "шкалы " + ВыборкаЗначенийРейтингов.ШкалаПредставление + " в Матриксе снят флаг Архивный, установленный по данным 1С  " + Формат(ВыборкаЗначенийРейтингов.ДатаПереходаВАрхив_1С, "ДФ=dd.MM.yyyy"));
			КонецЕсли;	
		КонецЕсли;		
		ЗначениеОбъект.Записать();
								
	КонецЦикла;
	
КонецПроцедуры

Функция ДатаВФорматеSQL(Дт)
	
	Возврат "convert(DateTime, '" + Формат(Дт, "ДФ=dd.MM.yyyy") + "', 104)";
	
КонецФункции // ДатаВФорматеSQL

Функция НаборЗначенийВФорматеSQL(НаборЗначений, ПустоеЗначение = 0)
	
	Если НаборЗначений.Количество() = 0 Тогда
		НаборЗначенийSQL = Строка(ПустоеЗначение);
	Иначе
		НаборЗначенийSQL = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(НаборЗначений);
	КонецЕсли;
	
	Возврат НаборЗначенийSQL;
	
КонецФункции // НаборЗначенийВФорматеSQL

Функция ОтправитьПротоколИмпортаПоЭлектроннойПочте(Протокол)
	
	ОшибкиHTML = "";
	
	Если ОшибкиОбработки.Количество() > 0 Тогда
		ОшибкиHTML =
			"<div class=""error""><h3>Ошибки импорта</h3>
			|<ul>";
		
		Для каждого ТекстОшибки Из ОшибкиОбработки Цикл
			ОшибкиHTML = ОшибкиHTML + Символы.ПС + Символы.Таб + "<li>" + ТекстОшибки + "</li>";
		КонецЦикла;
		
		ОшибкиHTML = ОшибкиHTML + Символы.ПС + "</ul></div>";
	КонецЕсли;	
	
	ТекстПисьма = "";
		
	Для каждого СтрокаПротокол Из Протокол Цикл
		ТекстПисьма = ТекстПисьма +
			"<tr>
			|	<td>" + ?(ЗначениеЗаполнено(СтрокаПротокол.Период),               Формат(СтрокаПротокол.Период, "ДФ=dd.MM.yyyy"), "&nbsp;") + "</td>
			|	<td>" + ?(ЗначениеЗаполнено(СтрокаПротокол.Субъект),              СтрокаПротокол.Субъект, "&nbsp;") + "</td>
			|	<td>" + ?(ЗначениеЗаполнено(СтрокаПротокол.РейтинговоеАгентство), СтрокаПротокол.РейтинговоеАгентство, "&nbsp;") + "</td>
			|	<td>" + ?(ЗначениеЗаполнено(СтрокаПротокол.Шкала),                СтрокаПротокол.Шкала, "&nbsp;") + "</td>
			|	<td>" + ?(ЗначениеЗаполнено(СтрокаПротокол.Действие),             СтрокаПротокол.Действие, "&nbsp;") + "</td>
			|</tr>";
	КонецЦикла;
	
	ТекстПисьма =
		"<html>
		|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
		|	<style>
		|		body {
		|			font: 12pt sans-serif;
		|		}
		|		table {
		|			border-spacing: 0;
		|			border-collapse: collapse;
		|		}
		|		td {
		|			border: 1px solid lightgray;
		|			padding: 5px;
		|		}
		|		.caption {
		|			font-weight: bolder;
		|			font-size: 17px;
		|		}
		|		.error {
		|			background-color: #ffffb3;
		|			font: 10pt sans-serif;
		|		}
		|	</style>
		|</head>
		|<body>
		|" + ОшибкиHTML + "
		|<table cols=""5"">		
		|<tr class=""caption"">
		|	<td>Период</td>
		|	<td>Субъект</td>
		|	<td>Агентство</td>
		|	<td>Шкала</td>
		|	<td>Действие</td>
		|</tr>
		|" + ТекстПисьма + "
		|</table></body></html>";		
		
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста",
		ЭтотОбъект.ПолучателиПротоколаОбИзмененияхРейтингов,
		"Отчет об изменениях рейтингов",
		ТекстПисьма,
		"HTML");
	
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
	
КонецФункции // ОтправитьПротоколИмпортаПоЭлектроннойПочте

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
ОшибкиОбработки = Новый Массив;

