
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		МассивДоступныхСхем = РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПолучитьМассивДоступныхСхем(Запись.ВидАктива);
		
		Если МассивДоступныхСхем.Найти(Запись.СхемаПроверкиСущественностиОтклонений) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Схема: '" + Запись.СхемаПроверкиСущественностиОтклонений + "' не может быть использована для вида актива '" + Запись.ВидАктива + "'",,,, Отказ);
		КонецЕсли;
		
		ПроверкаЗаполненияЗаписи(Запись, Отказ);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПроверкаЗаполненияЗаписи(Запись, Отказ)
	
	СписокИспользуемыхИзмеренийИРесурсов = РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИспользуемыеИзмеренияИРесурсы(Запись);
	
	//Ресурсы могут быть пустыми, исключаем из проверки	
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьГраницДиапазонаРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ОтклонениеКредитногоСпреда"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьЭСП"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("СмещениеСтандартногоОтклонения"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокАктиваДляИспользованияСхемы"));
	
	//Если ресурс используется, он должен быть заполнен. Если нет, должен быть пустым
	Для Каждого Ресурс Из СписокИспользуемыхИзмеренийИРесурсов Цикл
		УниверсальныеМеханизмы.ПроверкаЗаполненияИзмеренияИлиРесурса(ЭтотОбъект, Запись, Ресурс.Значение, Отказ, Ресурс.Пометка);
	КонецЦикла;
	
	Если Запись.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке
	   И Запись.ВариантОтклоненияОтРыночнойСтавки <> Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.Фиксированный Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для схемы '" + Запись.СхемаПроверкиСущественностиОтклонений + "' доступен только фиксированный вариант отклонения по рыночной ставке",,,, Отказ);
	КонецЕсли;
	
#Область РассчитыватьЛинейноНерыночныеАктивы

	Если Запись.РассчитыватьЛинейноНерыночныеАктивы И Запись.ВидАктива <> Перечисления.ВидыАктивовДляПроверкиНаРыночность.Депозиты Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Линейный расчёт нерыночных активов доступ только для депозитов",,,, Отказ);
	КонецЕсли;	
	
#КонецОбласти

КонецПроцедуры















