
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Контроль остатков ценных бумаг",
		"1.57",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Вариант = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта;
	
	Если Вариант = "СЧА" Тогда
		
		ПроверяемыеРеквизиты.Добавить("ПериодИнтервал");
		ПроверяемыеРеквизиты.Добавить("ВидУчета");
		
		Если ЭтотОбъект.РежимОтбора = 0 Тогда
			ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
		ИначеЕсли ЭтотОбъект.РежимОтбора = 1 Тогда
			ПроверяемыеРеквизиты.Добавить("ВидЛицензии");
		ИначеЕсли ЭтотОбъект.РежимОтбора = 2 Тогда
			ПроверяемыеРеквизиты.Добавить("ВидДоговора");
		КонецЕсли;
		
	ИначеЕсли Вариант = "СверкаСДаннымиНСД" Тогда	
		
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Вариант = РаботаСОтчетамиКлиентСервер.ПолучитьКлючВариантаОтчета(ЭтотОбъект);
	
	СвойстваОбъектаДляСтатистики = "Период, Организация, СчетДоверительногоУправления";
	
	#Область Заполняем_параметры_с_учетом_вариантов_отчета
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЭтотОбъект.Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериодаГраницаДня",	новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Настройки.ПараметрыДанных.Элементы.Найти("ПериодИнтервал").Использование	= Ложь;
	Настройки.ПараметрыДанных.Элементы.Найти("Календарь").Использование			= Ложь;
	Настройки.ПараметрыДанных.Элементы.Найти("ВидЛицензии").Использование		= Ложь;
	Настройки.ПараметрыДанных.Элементы.Найти("ВидДоговора").Использование		= Ложь;
	
	Если Вариант = "ФинРез" Тогда
	
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",				ЭтотОбъект.ПериодИнтервал.ДатаНачала);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода",			НачалоДня(ЭтотОбъект.ПериодИнтервал.ДатаОкончания));
		
	ИначеЕсли Вариант = "СверкаПоДС" Тогда
		
		ЗаполнитьНастройкиСверкаПоДС(Настройки, ЭтотОбъект.СхемаКомпоновкиДанных);
		
	ИначеЕсли Вариант = "ПартииРСБУ_НУ" ИЛИ Вариант = "ПоКоличествуИВидуУчета" Тогда
		
		ЗаполнитьНастройкиПартииРСБУ_НУ(Настройки);	
		
	ИначеЕсли Вариант = "ЕПС" ИЛИ Вариант = "СверкаЕПСДляПартийНаЛицевыхСчетах" Тогда
		
		Если Вариант = "СверкаЕПСДляПартийНаЛицевыхСчетах"
			И ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) 
			И НЕ БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Период, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "ОтражатьПартииНаЛицевыхСчетах") Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для данного счет Д/у учет партий на лицевых счетах не ведется!");
			
			ОшибкаФормирования = Истина;
		
		КонецЕсли;
		
		СчетаУчета = Новый Массив;
		СчетаУчета.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
		СчетаУчета.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
		СчетаУчета.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
		СчетаУчета.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
		СчетаУчета.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
		СчетаУчета.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
		СчетаУчета.Добавить(ПланыСчетов.Единый.УчастиеВДочернихОбществахИПаевыхФондах);
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетаУчета",	СчетаУчета);
		
		МассивСчетовСПравильнымУчетомПП = Новый Массив;
		
		// Аквилон
		МассивСчетовАквилон = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
			ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Аквилон"),
			ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"),
			ТекущаяДата());

		РаботаСКоллекциями.ДополнитьМассив(МассивСчетовСПравильнымУчетомПП, МассивСчетовАквилон, Ложь);

		// Национальный
		МассивСчетовНациональный = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
			ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Национальный"),
			ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"),
			ТекущаяДата());

		РаботаСКоллекциями.ДополнитьМассив(МассивСчетовСПравильнымУчетомПП, МассивСчетовНациональный, Ложь);
		
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МассивСчетовСПравильнымУчетомПП",	МассивСчетовСПравильнымУчетомПП);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Облигация_Автодор_002",				ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Автодор_002"));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДУ_РЭМ",				ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_РЭМ"));
		
	ИначеЕсли Вариант = "СЧА" Тогда
		
		#Область Настройки_варианта_СЧА
		
		Если ЭтотОбъект.ВидУчета <> Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
			НаборыДанныхСверкаПоСЧА = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Найти("СверкаПоСЧА");
			НаборыДанныхСверкаПоСЧА.Запрос = СтрЗаменить(
				НаборыДанныхСверкаПоСЧА.Запрос,
				"РегистрБухгалтерии.БухгалтерскийУчет",
				"РегистрБухгалтерии." + РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета)
			);
		КонецЕсли;
		
		// Для сверки по СЧА определим выбранные поля
		ТекущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки();

		//Отображать ЦБ из бух.партий
		ОтображатьДанныеИзБухПартий = ПолучитьИспользованиеЭлементаУсловногоОформления(ТекущиеНастройки, "Отображать ЦБ из бух.партий");
		УстановитьИспользованиеВыбранногоПоля(КомпоновщикНастроек.Настройки, "Сумма_Партии", ОтображатьДанныеИзБухПартий);
		УстановитьИспользованиеВыбранногоПоля(КомпоновщикНастроек.Настройки, "НКД_Партии", ОтображатьДанныеИзБухПартий);
		УстановитьИспользованиеВыбранногоПоля(КомпоновщикНастроек.Настройки, "СЧА_Партии", ОтображатьДанныеИзБухПартий);
		УстановитьИспользованиеВыбранногоПоля(КомпоновщикНастроек.Настройки, "Количество_Партии", ОтображатьДанныеИзБухПартий);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтображатьДанныеИзБухПартий", ОтображатьДанныеИзБухПартий);
		
		// Отображать ЦБ из остатков на счетах БУ (58, 76.П)
		ОтображатьДанныеИзОстатковНаСчетахБУ = ПолучитьИспользованиеЭлементаУсловногоОформления(ТекущиеНастройки, "Отображать тело и купон ЦБ");
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтображатьДанныеИзОстатковНаСчетахБУ", ОтображатьДанныеИзОстатковНаСчетахБУ);

		//Отображать для ЦБ только итоги
		ОтображатьДляЦБТолькоИтоги = НЕ ОтображатьДанныеИзОстатковНаСчетахБУ;
		
		КоличествоЭлементов = Настройки.Выбор.Элементы.Количество();
		Для сц =0 по КоличествоЭлементов-1 Цикл
			ЭлементВыбора = Настройки.Выбор.Элементы.Получить(сц);
			Если ЭлементВыбора.Заголовок = "Сумма" 
				ИЛИ ЭлементВыбора.Заголовок = "НКД"
			Тогда
				ЭлементВыбора.Использование = НЕ ОтображатьДляЦБТолькоИтоги;
			КонецЕсли;
		КонецЦикла;

		// Установим параметры
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидУчета",					ЭтотОбъект.ВидУчета);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЦельРасчета",				Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаФормирования",			КонецДня(ЭтотОбъект.ПериодИнтервал.ДатаОкончания));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",				ЭтотОбъект.ПериодИнтервал.ДатаНачала);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода",			НачалоДня(ЭтотОбъект.ПериодИнтервал.ДатаОкончания));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериодаКонецДня",	Новый Граница(КонецДня(ЭтотОбъект.ПериодИнтервал.ДатаОкончания), ВидГраницы.Включая));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодИнтервал",				ЭтотОбъект.ПериодИнтервал);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Календарь",					Справочники.Календари.Общероссийский);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводимыеДни",				ЭтотОбъект.ВыводимыеДни);	
		
		Настройки.ПараметрыДанных.Элементы.Найти("Период").Использование = Ложь;
		Настройки.ПараметрыДанных.Элементы.Найти("СчетДоверительногоУправления").Использование = Ложь;
		
		Если ЭтотОбъект.РежимОтбора = 0 Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ИначеЕсли ЭтотОбъект.РежимОтбора = 1 Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидЛицензии", ЭтотОбъект.ВидЛицензии);
		ИначеЕсли ЭтотОбъект.РежимОтбора = 2 Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидДоговора", ЭтотОбъект.ВидДоговора);
		КонецЕсли;
		
		// Следующие настройки определяю костыльным образом в запросе,
		// при добавлении хранимых (не расчетных) настроек запрос следует скорректировать:
		//	УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария
		//	УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего
		//	УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего
		
		#КонецОбласти
		
	ИначеЕсли Вариант = "СверкаСДаннымиНСД" Тогда
		
		// Исключаем период, т.к. он определяется из данных файла
		
		СвойстваОбъектаДляСтатистики = "Организация, СчетДоверительногоУправления"; 
		
		Настройки.ПараметрыДанных.Элементы.Найти("Период").Использование					 = Ложь;
		Настройки.ПараметрыДанных.Элементы.Найти("ОкончаниеПериодаГраницаДня").Использование = Ложь;
		
	ИначеЕсли Вариант = "Сверка7раздел" Тогда 
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КлиентСургут",				ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сургутнефтегаз"));
		//хардкод в запрросе  _КорректировкаПредварительно. У сургутов стоит настройка ОтражатьПартииНаЛицевыхСчетах = Да, но на Корретировке нет партий. суммы надо сворачивать. 
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Регистрируем_новую_сессию_статистики
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, СвойстваОбъектаДляСтатистики, Новый Структура("Вариант", Вариант));
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
		
	ДополнительныеПараметрыСтатистикиПоРезультатамРаботы = Новый Структура;
	
	#КонецОбласти
	
	ОшибкаФормирования = Ложь;	
	ВнешниеНаборыДанных = Неопределено;
	
	Если Вариант = "СверкаСуммБУ_НУ" Тогда
		
		#Область Сверка_сумм_РСБУ_НУ					
		
		ОстаткиПартийСверка = Неопределено;
		
		ЗаполнитьНастройкиПартииСверкаСуммБУ_НУ(Настройки, ОстаткиПартийСверка);
		
		ВнешниеНаборыДанных = Новый Структура("ДанныеСверкиРСБУ", ОстаткиПартийСверка);
		
		#КонецОбласти		
		
	ИначеЕсли Вариант = "СверкаСПереоценкой" Тогда
		
		#Область Сверка_с_переоценкой			
		
		СтрокиПереоценкиСверка = Неопределено;	
		
		ЗаполнитьНастройкиПартииСверкаСПереоценкой(Настройки, СтрокиПереоценкиСверка);	
					
		ВнешниеНаборыДанных = Новый Структура("ДанныеСверкиСПереоценкой", СтрокиПереоценкиСверка);
		
		#КонецОбласти		
		
	ИначеЕсли Вариант = "СверкаРЕПО" Тогда
		
		#Область Сверка_РЕПО
		
		ДанныеСверкиПоРЕПО = Неопределено;
		
		ЗаполнитьНастройкиПартииСверкаРЕПО(Настройки, ДанныеСверкиПоРЕПО);
		
		ВнешниеНаборыДанных = Новый Структура("ДанныеСверкиПоРЕПО", ДанныеСверкиПоРЕПО);
		
		#КонецОбласти		

	ИначеЕсли Вариант = "СверкаСДаннымиНСД" Тогда
			
		#Область Сверка_с_данными_НСД
		
		АдресФайлаНСД	= КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.АдресФайлаНСД;
		ИмяФайлаНСД		= ПолучитьИмяВременногоФайла("XLSX");
		
		ДвоичныеДанныеФайлаНСД = ПолучитьИзВременногоХранилища(АдресФайлаНСД);	
		ДвоичныеДанныеФайлаНСД.Записать(ИмяФайлаНСД);
		
		ДанныеНСД = Новый ТабличныйДокумент;
		
		Попытка
			ДанныеНСД.Прочитать(ИмяФайлаНСД);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка чтения файла: " + ОписаниеОшибки(), , , , ОшибкаФормирования);
		КонецПопытки;
		
		УдалитьФайлы(ИмяФайлаНСД);
		
		Если Не ОшибкаФормирования Тогда
			
			ИскомыйПрефиксОтчета = "Справка по расчету стоимости облигации";
			ПрефиксОтчета		 = ДанныеНСД.Область(2, 2).Текст; 
			
			ИскомыйПрефиксДаты	= "Отчетная дата:";
			ПрефиксДаты			= ДанныеНСД.Область(3, 2).Текст; 
			
			Если Не СтрНачинаетсяС(ПрефиксОтчета, ИскомыйПрефиксОтчета) ИЛИ Не СтрНачинаетсяС(ПрефиксДаты, ИскомыйПрефиксДаты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формат отчета не соответствует ожидаемому.", , , , ОшибкаФормирования);
			КонецЕсли;
			
			Если Не ОшибкаФормирования Тогда
			
				// Получаем бумагу
				
				ОписаниеБумаги			= Сред(ПрефиксОтчета, СтрДлина(ИскомыйПрефиксОтчета) + 1);
				РазделительКодаБумаги	= СтрНайти(ОписаниеБумаги, "/");
				КодБумаги				= СокрЛП(?(РазделительКодаБумаги > 0, Сред(ОписаниеБумаги, 1, РазделительКодаБумаги - 1), ОписаниеБумаги));
				
				ЦеннаяБумага = Справочники.Облигации.НайтиПоРеквизиту("ГосударственныйРегистрационныйНомер", КодБумаги);
			
				Если ЗначениеЗаполнено(ЦеннаяБумага) Тогда
					ДополнительныеПараметрыСтатистикиПоРезультатамРаботы.Вставить("ЦеннаяБумага", ЦеннаяБумага);		
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось найти бумагу по коду '%1'", КодБумаги), , , , ОшибкаФормирования);
				КонецЕсли;
				
				Если Не ОшибкаФормирования Тогда
				
					// Получаем дату отчета
					
					ДатаСтрокой = СокрЛП(Сред(ПрефиксДаты, СтрДлина(ИскомыйПрефиксДаты) + 1));
					
					Попытка
						ЭтотОбъект.Период = Дата(ДатаСтрокой + " 00:00:00");
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось определить отчетную дату по строке '%1'", ДатаСтрокой), , , , ОшибкаФормирования);
					КонецПопытки;
					
					Если Не ОшибкаФормирования Тогда
						
						Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЭтотОбъект.Период);
						
						ДополнительныеПараметрыСтатистикиПоРезультатамРаботы.Вставить("Период", ЭтотОбъект.Период);		
						
						// Ищем ключевые колонки и заполняем таблицу данных
						
						ШапкаТаблицы = ДанныеНСД.Область(5, , 6);
						
						Колонки = Новый Структура;
						Колонки.Вставить("КодМетода",								Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Код метода")); // Чтобы понять окончание таблицы в файле
						Колонки.Вставить("ИдентификаторПартии",						Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Идентификатор партии", , "Строка",										"СтрокаДанных1С.НомерСделки"));
						Колонки.Вставить("Количество",								Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Количество", , "Число",													"СтрокаДанных1С.Количество"));
						Колонки.Вставить("ПремияДисконтПриПП",						Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Премия/дисконт при первоначальном признании", , "Число",					"СтрокаДанных1С.ДисконтПремияПокупки"));
						Колонки.Вставить("КорректировкаПриПП",						Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Корректировка при первоначальном признании", , "Число",					"СтрокаДанных1С.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная"));
						Колонки.Вставить("СправедливаяСтоимостьНаДатуПризнания",	Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Справедливая стоимость на дату признания", , "Число",					"СтрокаДанных1С.СтоимостьПокупки + СтрокаДанных1С.РасходыПриПокупкеВСтоимости"));
						Колонки.Вставить("ПремияДисконтНаОтчетнуюДату",				Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Премия/дисконт на отчетную дату", , "Число",								"?(СтрокаДанных1С.ДисконтПремияПокупки < 0, СтрокаДанных1С.ДисконтПремияПокупки + СтрокаДанных1С.ДисконтПремияНачисленный, СтрокаДанных1С.ДисконтПремияНачисленный)"));
						Колонки.Вставить("ВеличинаСписанияПремииДисконта",			Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Величина списания премии/дисконта", , "Число",							"?(СтрокаДанных1С.ДисконтПремияПокупки < 0, -СтрокаДанных1С.ДисконтПремияНачисленный, СтрокаДанных1С.ДисконтПремияПокупки - СтрокаДанных1С.ДисконтПремияНачисленный)"));
						Колонки.Вставить("ПремияДисконтПриППСУчетомВывода",			Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Премия/дисконт при первонач. признании (с учетом вывода)", ,	"Число",	"СтрокаДанных1С.ДисконтПремия"));
						Колонки.Вставить("ОстатокПремииДисконта",					Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Остаток премии/дисконта", , "Число",										"?(СтрокаДанных1С.ДисконтПремияПокупки < 0, СтрокаДанных1С.ДисконтПремияПокупки + СтрокаДанных1С.ДисконтПремияНачисленный, СтрокаДанных1С.ДисконтПремияНачисленный)"));
						Колонки.Вставить("ОценочнаяСтоимостьНаОтчетнуюДату",		Новый Структура("ИмяКолонки, НомерКолонки, Тип, Формула", "Оценочная стоимость на отчетную дату", , "Число",						"СтрокаДанных1С.Стоимость + СтрокаДанных1С.ДисконтПремияНачисленный + СтрокаДанных1С.КорректировкаЭСП + СтрокаДанных1С.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные"));
						
						СверяемыеДанные = Новый ТаблицаЗначений;
						СверяемыеДанные.Колонки.Добавить("Примечание",		Новый ОписаниеТипов("Строка"));
						СверяемыеДанные.Колонки.Добавить("Партия",			Метаданные.ОпределяемыеТипы.Партия.Тип);
						СверяемыеДанные.Колонки.Добавить("СтрокаПартии",	Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
						
						НенайденныеКолонки = Новый Массив;
						
						Для Каждого Колонка Из Колонки Цикл
							
							СверяемыеДанные.Колонки.Добавить(Колонка.Ключ, ?(Колонка.Значение.Тип = Неопределено, Неопределено, Новый ОписаниеТипов(Колонка.Значение.Тип)));
							Если ЗначениеЗаполнено(Колонка.Значение.Формула) Тогда
								СверяемыеДанные.Колонки.Добавить(Колонка.Ключ + "1С",			 	СверяемыеДанные.Колонки[Колонка.Ключ].ТипЗначения);
								СверяемыеДанные.Колонки.Добавить(Колонка.Ключ + "1С_Расшифровка",	Новый ОписаниеТипов("ХранилищеЗначения"));
							КонецЕсли;
							
							Область = ДанныеНСД.НайтиТекст(Колонка.Значение.ИмяКолонки, , ШапкаТаблицы, , Истина, , Истина);
							
							Если Область = Неопределено Тогда
								НенайденныеКолонки.Добавить(Колонка.Значение.ИмяКолонки);		
							Иначе
								Колонка.Значение.НомерКолонки = Область.Лево;
							КонецЕсли;
							
						КонецЦикла;
						
						Если НенайденныеКолонки.Количество() > 0 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось найти поля: " + СтрСоединить(НенайденныеКолонки, ", "), , , , ОшибкаФормирования);
						КонецЕсли;
						
						Если Не ОшибкаФормирования Тогда
						
							#Область Заполняем_таблицу_данных_НСД
							
							Для СтрокаДанныхНСД = 7 По ДанныеНСД.ВысотаТаблицы Цикл
								
								Если ПустаяСтрока(ДанныеНСД.Область(СтрокаДанныхНСД, Колонки.КодМетода.НомерКолонки).Текст) Тогда
									Прервать;
								КонецЕсли;
								
								СтрокаДанных = СверяемыеДанные.Добавить();
								
								Для Каждого Колонка Из Колонки Цикл
									
									Если Колонка.Ключ <> "КодМетода" Тогда
										
										ЗначениеНСД = ДанныеНСД.Область(СтрокаДанныхНСД, Колонка.Значение.НомерКолонки).Текст;
										
										Если Колонка.Значение.Тип = "Число" Тогда // Проверим корректность числового значения
											
											Попытка
												СтрокаДанных[Колонка.Ключ] = Число(ЗначениеНСД);
											Исключение
												СтрокаДанных.Примечание = ?(ПустаяСтрока(СтрокаДанных.Примечание), "", СтрокаДанных.Примечание + Символы.ПС)
													+ СтрШаблон("Поле '%1' в строке %2 содержит нечисловые данные: '%3'", Колонка.Значение.ИмяКолонки, Формат(СтрокаДанныхНСД, "ЧГ="), ЗначениеНСД);
											КонецПопытки;

										Иначе
											СтрокаДанных[Колонка.Ключ] = ЗначениеНСД;
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЦикла;
								
							КонецЦикла;
							
							Колонки.Удалить("КодМетода"); // больше не нужен
							
							#КонецОбласти
							
							#Область Заполняем_таблицу_данных_УК
							
							Запрос = Новый Запрос(
								"ВЫБРАТЬ РАЗРЕШЕННЫЕ
								|	ОстаткиПартий.Партия КАК Партия,
								|	ОстаткиПартий.СтрокаПартии КАК СтрокаПартии,
								|	ОстаткиПартий.КоличествоОстаток КАК Количество,
								|	ВЫБОР
								|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиПартий.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
								|			ТОГДА РеклассификацияАктивовЕПСПартии.СуммаПокупки
								|		ИНАЧЕ ОстаткиПартий.СтоимостьПокупкиОстаток
								|	КОНЕЦ КАК СтоимостьПокупки,
								|	ОстаткиПартий.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимости,
								|	ОстаткиПартий.СтоимостьВВалютеУчетаОстаток КАК Стоимость,
								|	ОстаткиПартий.ДисконтПремияОстаток КАК ДисконтПремия,
								|	ОстаткиПартий.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупки,
								|	ОстаткиПартий.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК ДисконтПремияНачисленный,
								|	ОстаткиПартий.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСП,
								|	ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальнаяОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
								|	ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
								|	ВЫБОР
								|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиПартий.Партия) = ТИП(Документ.Сделка)
								|			ТОГДА ВЫРАЗИТЬ(ОстаткиПартий.Партия КАК Документ.Сделка).НомерСделки
								|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиПартий.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
								|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОстаткиПартий.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
								|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиПартий.Партия) = ТИП(Документ.ВводЦенныхБумаг)
								|			ТОГДА ВЫБОР
								|					КОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки <> """"
								|						ТОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки
								|					ИНАЧЕ """"
								|				КОНЕЦ
								|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиПартий.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
								|			ТОГДА ВЫБОР
								|					КОГДА РеклассификацияАктивовЕПСПартии.НомерСделки <> """"
								|						ТОГДА РеклассификацияАктивовЕПСПартии.НомерСделки
								|					ИНАЧЕ """"
								|				КОНЕЦ
								|		ИНАЧЕ """"
								|	КОНЕЦ КАК НомерСделки,
								|	ВЫБОР
								|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиПартий.Партия) = ТИП(Документ.ВводЦенныхБумаг)
								|				И ОстаткиПартий.Партия.Дата >= &ДатаЕПС
								|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
								|		ИНАЧЕ НАЧАЛОПЕРИОДА(ОстаткиПартий.Партия.Дата, ДЕНЬ)
								|	КОНЕЦ КАК ДатаПокупки
								|ИЗ
								|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
								|			&Период,
								|			Организация = &Организация
								|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
								|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
								|				И Рынок = &Рынок
								|				И ЦеннаяБумага = &ЦеннаяБумага
								|				И (НЕ &ТолькоБумагиПоАС
								|					ИЛИ УчетныйАктивЕПС В (&УчетныеАктивыОцениваемыеПоАС))) КАК ОстаткиПартий
								|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
								|		ПО ОстаткиПартий.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
								|			И ОстаткиПартий.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
								|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
								|		ПО ОстаткиПартий.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
								|			И ОстаткиПартий.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
								|
								|УПОРЯДОЧИТЬ ПО
								|	ДатаПокупки,
								|	Партия,
								|	СтрокаПартии");
							
							ПредставлениеОтбора			 = "Только бумаги, оцениваемые по амортизированной стоимости";
							ТолькоБумагиПоАС			 = ПолучитьИспользованиеЭлементаОтбора(КомпоновщикНастроек.ПолучитьНастройки(), ПредставлениеОтбора);
							УчетныеАктивыОцениваемыеПоАС = ?(ТолькоБумагиПоАС, Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости(), Неопределено);
							
							Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
							Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
							Запрос.УстановитьПараметр("Рынок",							РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ЦеннаяБумага));
							Запрос.УстановитьПараметр("ЦеннаяБумага",					ЦеннаяБумага);
							Запрос.УстановитьПараметр("Период",							Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
							Запрос.УстановитьПараметр("ДатаЕПС",						РегистрыСведений.НастройкиУчетаОбщие.ПолучитьДатуНачалаНеобходимостиДанныхЕПСВоВводахЦБ(ЭтотОбъект.СчетДоверительногоУправления));
							
							Запрос.УстановитьПараметр("ТолькоБумагиПоАС",				ТолькоБумагиПоАС);
							Запрос.УстановитьПараметр("УчетныеАктивыОцениваемыеПоАС",	УчетныеАктивыОцениваемыеПоАС);
							
							Данные1С = Запрос.Выполнить().Выгрузить();
							Данные1С.Индексы.Добавить("НомерСделки");
							Данные1С.Индексы.Добавить("Количество");
							
							Если ТолькоБумагиПоАС Тогда
								ДополнительныеПараметрыСтатистикиПоРезультатамРаботы.Вставить("Отбор", ПредставлениеОтбора);
							КонецЕсли;
							
							#КонецОбласти

							#Область Сопоставляем_данные_НСД_и_УК
							
							// Сопоставляем данные:
							// 1. сначала по номеру сделки, 
							// 2. потом по количеству
							// 3. затем переносим несопоставленные данные 1С
							
							Для ШагСопоставления = 1 По 3 Цикл
								
								Если ШагСопоставления = 1 Тогда
									Поле			= "ИдентификаторПартии";
									Поле1С			= "НомерСделки";
									ИсточникДанных	= СверяемыеДанные;
								ИначеЕсли ШагСопоставления = 2 Тогда
									Поле			= "Количество";
									Поле1С			= "Количество";
									ИсточникДанных	= СверяемыеДанные;
								Иначе
									ИсточникДанных	= Данные1С;
								КонецЕсли;
								
								ИндексСтроки			= 0;
								КоличествоСтрок			= ИсточникДанных.Количество();
								ПродолжитьСопоставление = (Данные1С.Количество() > 0) И ИндексСтроки < КоличествоСтрок;
								
								Пока ПродолжитьСопоставление Цикл
									
									Если ШагСопоставления = 3 Тогда
										СтрокаДанных	= СверяемыеДанные.Добавить();
										СтрокаДанных1С	= ИсточникДанных.Получить(ИндексСтроки);
									Иначе
										СтрокаДанных	= ИсточникДанных.Получить(ИндексСтроки);
										СтрокаДанных1С	= ?(ЗначениеЗаполнено(СтрокаДанных[Поле]), Данные1С.Найти(СтрокаДанных[Поле], Поле1С), Неопределено); 
									КонецЕсли;
									
									Если СтрокаДанных1С <> Неопределено Тогда
										
										ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаДанных1С, "Партия, СтрокаПартии");
										
										Для каждого Колонка Из Колонки Цикл
											Если ЗначениеЗаполнено(Колонка.Значение.Формула) Тогда
												СтрокаДанных[Колонка.Ключ + "1С"]				= Вычислить(Колонка.Значение.Формула);
												СтрокаДанных[Колонка.Ключ + "1С_Расшифровка"]	= Новый ХранилищеЗначения(Новый Структура("Формула, СтрокаДанных1С", Колонка.Значение.Формула, РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(СтрокаДанных1С)));
											КонецЕсли;
										КонецЦикла;
										
										Если ШагСопоставления <> 3 Тогда
											Данные1С.Удалить(СтрокаДанных1С);
										КонецЕсли;
										
									КонецЕсли;
									
									ИндексСтроки = ИндексСтроки + 1;
									
									ПродолжитьСопоставление = (Данные1С.Количество() > 0) И ИндексСтроки < КоличествоСтрок;
										
								КонецЦикла;
								
							КонецЦикла;

							#КонецОбласти
							
							// Добавляем результаты сверки во внешние данные
							
							Для Каждого Колонка Из СверяемыеДанные.Колонки Цикл
								Колонка.Имя = "СверкаСДаннымиНСД_" + Колонка.Имя;							
							КонецЦикла;
							
							ВнешниеНаборыДанных = Новый Структура("СверкаСДаннымиНСД", СверяемыеДанные);
							
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	// При ошибке формирования прерываем построение отчета 
	
	Если ОшибкаФормирования Тогда
			
		СтандартнаяОбработка = Ложь;
		
	Иначе
		
		// Выполняем программную компоновку
		
		ДополнительныеПараметры = Новый Структура("РегистрацияСтатистики", Ложь);
		
		РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,, ВнешниеНаборыДанных, ДополнительныеПараметры);	
		
		#Область Сворачиваем_группировки
		
		Если Вариант = "СЧА" Тогда
			
			СворачиватьГруппировки = ПолучитьИспользованиеЭлементаУсловногоОформления(КомпоновщикНастроек.ПолучитьНастройки(), "Сворачивать группы строк");
			Если СворачиватьГруппировки Тогда
				ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);
				ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
			КонецЕсли;
			
		ИначеЕсли Вариант = "СверкаРЕПО" Тогда
			
			ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2);		
			
		КонецЕсли;
		
		#КонецОбласти
		
		// Заполняем настройки печати	
		
		РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());		
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, , ДополнительныеПараметрыСтатистикиПоРезультатамРаботы);	
	
КонецПроцедуры

#Область Вспомогательные_функции

Функция НайтиВыбранноеПоле(ВсеПоля, Поле)
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		ИскомоеПоле = Новый ПолеКомпоновкиДанных(Поле);
	Иначе
		ИскомоеПоле = Поле;
	КонецЕсли;
	
	Для Каждого ВыбранноеПоле Из ВсеПоля Цикл
		Если ТипЗнч(ВыбранноеПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			НайденноеПоле = НайтиВыбранноеПоле(ВыбранноеПоле.Элементы, ИскомоеПоле);
			Если НайденноеПоле <> Неопределено Тогда
				Возврат НайденноеПоле;
			КонецЕсли;
		ИначеЕсли ВыбранноеПоле.Поле = ИскомоеПоле Тогда
			Возврат ВыбранноеПоле;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Процедура УстановитьИспользованиеВыбранногоПоля(Настройки, Поле, Использование)
	ВыбранноеПоле = НайтиВыбранноеПоле(Настройки.Выбор.Элементы, Поле);
	Если ВыбранноеПоле <> Неопределено Тогда
		ВыбранноеПоле.Использование = Использование;
	КонецЕсли;		
КонецПроцедуры

Функция ПолучитьИспользованиеЭлементаУсловногоОформления(Настройки, ПредставлениеЭлемента)
	
	Возврат ПолучитьИспользованиеЭлементаНастроекПоПредставлению(Настройки.УсловноеОформление, ПредставлениеЭлемента);
	
КонецФункции

Функция ПолучитьИспользованиеЭлементаОтбора(Настройки, ПредставлениеЭлемента)
	
	Возврат ПолучитьИспользованиеЭлементаНастроекПоПредставлению(Настройки.Отбор, ПредставлениеЭлемента);
	
КонецФункции

Функция ПолучитьИспользованиеЭлементаНастроекПоПредставлению(Настройки, ПредставлениеЭлемента)
	
	Для Каждого ЭлементНастроек Из Настройки.Элементы Цикл
		Если ЭлементНастроек.Представление = ПредставлениеЭлемента Тогда
			Возврат ЭлементНастроек.Использование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

Функция ПолучитьУчетныеАктивы(Купоны = Ложь)
	
	Результат = новый Массив;
	
	Если НЕ Купоны Тогда
		Результат.Добавить(Справочники.УчетныеАктивы.Акции);
		Результат.Добавить(Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов);
		Результат.Добавить(Справочники.УчетныеАктивы.ВекселяДисконтные);
		Результат.Добавить(Справочники.УчетныеАктивы.ВекселяПроцентные);
		Результат.Добавить(Справочники.УчетныеАктивы.Еврооблигации);
		Результат.Добавить(Справочники.УчетныеАктивы.ИпотечныеСертификатыУчастия);
		Результат.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные);
		Результат.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте);
		Результат.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративные);
		Результат.Добавить(Справочники.УчетныеАктивы.Паи);
		Результат.Добавить(Справочники.УчетныеАктивы.ПаиИностранныхЭмитентов);
		Результат.Добавить(Справочники.УчетныеАктивы.Доли);
	Иначе
		Результат.Добавить(Справочники.УчетныеАктивы.ЕврооблигацииКупон);
		Результат.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон);
		Результат.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон);
		Результат.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНастройкиСверкаПоДС(Настройки, СхемаКомпоновкиДанных)
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Рубли",				ЭтотОбъект.Организация.ВалютаУчета);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидУчета",			ЭтотОбъект.ВидУчета);
	
	Если ЭтотОбъект.ВидУчета <> Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
		
		//НаборыДанныхСверкаПоДС = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Найти("СверкаПоДС");
		НаборыДанныхСверкаПоДС = СхемаКомпоновкиДанных.НаборыДанных.Найти("СверкаПоДС");
		
		НаборыДанныхСверкаПоДС.Запрос = СтрЗаменить(
		НаборыДанныхСверкаПоДС.Запрос,
		"БухгалтерскийУчет",
		РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета)
		);
	КонецЕсли;
	
КонецПроцедуры 	

Процедура ЗаполнитьНастройкиПартииРСБУ_НУ(Настройки)
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидУчета", ЭтотОбъект.ВидУчета);
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПартииСверкаСуммБУ_НУ(Настройки, ОстаткиПартийСверка)
	
	Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВложенныйЗапрос.Рынок КАК Рынок,
			|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(ВложенныйЗапрос.СтоимостьВВалютеУчетаОстаток) КАК СтоимостьВВалютеУчетаОстаток,
			|	СУММА(ВложенныйЗапрос.ПереоценкаВВалютеУчетаОстаток) КАК ПереоценкаВВалютеУчетаОстаток,
			|	СУММА(ВложенныйЗапрос.СтоимостьКупонаВВалютеУчетаОстаток) КАК СтоимостьКупонаВВалютеУчетаОстаток,
			|	СУММА(ВложенныйЗапрос.ПереоценкаКупонаВВалютеУчетаОстаток) КАК ПереоценкаКупонаВВалютеУчетаОстаток,
			|	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток,
			|	СУММА(ВложенныйЗапрос.ИндексацияНоминалаОстаток) КАК ИндексацияНоминалаОстаток,
			|	СУММА(ВложенныйЗапрос.ИндексацияНоминалаЗаВремяВладенияОстаток) КАК ИндексацияНоминалаЗаВремяВладенияОстаток,
			|	СУММА(ВложенныйЗапрос.СтоимостьОстаток) КАК СтоимостьОстаток,
			|	СУММА(ВложенныйЗапрос.ПереоценкаОстаток) КАК ПереоценкаОстаток,
			|	СУММА(ВложенныйЗапрос.СтоимостьКупонаОстаток) КАК СтоимостьКупонаОстаток,
			|	СУММА(ВложенныйЗапрос.ПереоценкаКупонаОстаток) КАК ПереоценкаКупонаОстаток,
			|	ВложенныйЗапрос.ПроданоВРЕПО КАК ПроданоВРЕПО,
			|	ВложенныйЗапрос.КупленоПоРЕПО КАК КупленоПоРЕПО
			|ИЗ
			|	(ВЫБРАТЬ
			|		БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
			|		БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|		СУММА(БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток) КАК СтоимостьВВалютеУчетаОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток) КАК ПереоценкаВВалютеУчетаОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток) КАК СтоимостьКупонаВВалютеУчетаОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток) КАК ПереоценкаКупонаВВалютеУчетаОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.КоличествоОстаток) КАК КоличествоОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток) КАК ИндексацияНоминалаОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.ИндексацияНоминалаЗаВремяВладенияОстаток) КАК ИндексацияНоминалаЗаВремяВладенияОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.СтоимостьОстаток) КАК СтоимостьОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.ПереоценкаОстаток) КАК ПереоценкаОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток) КАК СтоимостьКупонаОстаток,
			|		СУММА(БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток) КАК ПереоценкаКупонаОстаток,
			|		ЛОЖЬ КАК ПроданоВРЕПО,
			|		ЛОЖЬ КАК КупленоПоРЕПО
			|	ИЗ
			|		РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|				&ОкончаниеПериодаКонецДня,
			|				Организация = &Организация
			|					И ВидУчета = &ВидУчета
			|					И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК БухПартииЦенныхБумагОстатки
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
			|					&ОкончаниеПериодаКонецДня,
			|					Организация = &Организация
			|						И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|							ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК НастройкиУчетаОбщиеСрезПоследних
			|			ПО БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
			|				И (ВЫБОР
			|					КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
			|						ТОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет
			|					КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
			|						ТОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет
			|					ИНАЧЕ ЛОЖЬ
			|				КОНЕЦ)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления,
			|		БухПартииЦенныхБумагОстатки.Рынок,
			|		БухПартииЦенныхБумагОстатки.ЦеннаяБумага
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		БухПартииЦенныхБумагПроданныеВРепоОстатки.СчетДоверительногоУправления,
			|		БухПартииЦенныхБумагПроданныеВРепоОстатки.Рынок,
			|		БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага,
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.КоличествоОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаЗаВремяВладенияОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаОстаток),
			|		СУММА(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаОстаток),
			|		ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.СделкаРЕПО)
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ,
			|		ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.СделкаРЕПО)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|	ИЗ
			|		РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо.Остатки(
			|				&ОкончаниеПериодаКонецДня,
			|				Организация = &Организация
			|					И ВидУчета = &ВидУчета
			|					И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК БухПартииЦенныхБумагПроданныеВРепоОстатки
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
			|					&ОкончаниеПериодаКонецДня,
			|					Организация = &Организация
			|						И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|							ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК НастройкиУчетаОбщиеСрезПоследних
			|			ПО БухПартииЦенныхБумагПроданныеВРепоОстатки.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
			|				И (ВЫБОР
			|					КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
			|						ТОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет
			|					КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
			|						ТОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет
			|					ИНАЧЕ ЛОЖЬ
			|				КОНЕЦ)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		БухПартииЦенныхБумагПроданныеВРепоОстатки.СчетДоверительногоУправления,
			|		БухПартииЦенныхБумагПроданныеВРепоОстатки.Рынок,
			|		БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага,
			|		ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.СделкаРЕПО)
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ,
			|		ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.СделкаРЕПО)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		БухПартииЦенныхБумагКупленныеПоРепоОстатки.СчетДоверительногоУправления,
			|		БухПартииЦенныхБумагКупленныеПоРепоОстатки.Рынок,
			|		БухПартииЦенныхБумагКупленныеПоРепоОстатки.ЦеннаяБумага,
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.СтоимостьВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.ПереоценкаВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.СтоимостьКупонаВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.ПереоценкаКупонаВВалютеУчетаОстаток),
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.КоличествоОстаток),
			|		0,
			|		0,
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.СтоимостьОстаток),
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.ПереоценкаОстаток),
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.СтоимостьКупонаОстаток),
			|		СУММА(БухПартииЦенныхБумагКупленныеПоРепоОстатки.ПереоценкаКупонаОстаток),
			|		ЛОЖЬ,
			|		ИСТИНА
			|	ИЗ
			|		РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
			|				&ОкончаниеПериодаКонецДня,
			|				Организация = &Организация
			|					И ВидУчета = &ВидУчета
			|					И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК БухПартииЦенныхБумагКупленныеПоРепоОстатки
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
			|					&ОкончаниеПериодаКонецДня,
			|					Организация = &Организация
			|						И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|							ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК НастройкиУчетаОбщиеСрезПоследних
			|			ПО БухПартииЦенныхБумагКупленныеПоРепоОстатки.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
			|				И (ВЫБОР
			|					КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
			|						ТОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет
			|					КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
			|						ТОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет
			|					ИНАЧЕ ЛОЖЬ
			|				КОНЕЦ)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		БухПартииЦенныхБумагКупленныеПоРепоОстатки.СчетДоверительногоУправления,
			|		БухПартииЦенныхБумагКупленныеПоРепоОстатки.Рынок,
			|		БухПартииЦенныхБумагКупленныеПоРепоОстатки.ЦеннаяБумага) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.СчетДоверительногоУправления,
			|	ВложенныйЗапрос.Рынок,
			|	ВложенныйЗапрос.ЦеннаяБумага,
			|	ВложенныйЗапрос.ПроданоВРЕПО,
			|	ВложенныйЗапрос.КупленоПоРЕПО";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
		Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
		Запрос.УстановитьПараметр("ОкончаниеПериодаКонецДня", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		ОстаткиПартий = Запрос.Выполнить().Выгрузить();
		
		ОстаткиПартий.Колонки.Добавить("УчетныйАктив", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивы"));
		ОстаткиПартий.Колонки.Добавить("УчетныйАктивКупон", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивы"));
		
		РынокОблигации = Перечисления.РынкиЦенныхБумаг.Облигации;
		
		Для каждого СтрокаОстаткиПартий Из ОстаткиПартий Цикл
		
			СтрокаОстаткиПартий.УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Период, СтрокаОстаткиПартий.Рынок, СтрокаОстаткиПартий.ЦеннаяБумага, ЛОЖЬ);
			Если СтрокаОстаткиПартий.Рынок = РынокОблигации Тогда
				СтрокаОстаткиПартий.УчетныйАктивКупон = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Период, СтрокаОстаткиПартий.Рынок, СтрокаОстаткиПартий.ЦеннаяБумага, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкиПоВидуУчетаСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НастройкиПоВидуУчетаСрезПоследних.ВариантУчетаИндексацииНоминала КАК ВариантУчетаИндексацииНоминала
			|ПОМЕСТИТЬ _НастройкаУчетНоминала
			|ИЗ
			|	РегистрСведений.НастройкиПоВидуУчета.СрезПоследних(
			|			&ОкончаниеПериодаКонецДня,
			|			Организация = &Организация
			|				И ВидУчета = &ВидУчета
			|				И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК НастройкиПоВидуУчетаСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиПартийНачальные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиПартийНачальные.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ОстаткиПартийНачальные.Рынок КАК Рынок,
			|	ОстаткиПартийНачальные.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчетаОстаток,
			|	ОстаткиПартийНачальные.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
			|	ОстаткиПартийНачальные.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток,
			|	ОстаткиПартийНачальные.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
			|	ОстаткиПартийНачальные.КоличествоОстаток КАК КоличествоОстаток,
			|	ОстаткиПартийНачальные.ИндексацияНоминалаОстаток КАК ИндексацияНоминалаОстаток,
			|	ОстаткиПартийНачальные.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладенияОстаток,
			|	ОстаткиПартийНачальные.СтоимостьОстаток КАК СтоимостьОстаток,
			|	ОстаткиПартийНачальные.ПереоценкаОстаток КАК ПереоценкаОстаток,
			|	ОстаткиПартийНачальные.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
			|	ОстаткиПартийНачальные.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
			|	ОстаткиПартийНачальные.УчетныйАктив КАК УчетныйАктив,
			|	ОстаткиПартийНачальные.УчетныйАктивКупон КАК УчетныйАктивКупон,
			|	ОстаткиПартийНачальные.ПроданоВРЕПО КАК ПроданоВРЕПО,
			|	ОстаткиПартийНачальные.КупленоПоРЕПО КАК КупленоПоРЕПО
			|ПОМЕСТИТЬ ОстаткиПартийНачальные
			|ИЗ
			|	&ОстаткиПартий КАК ОстаткиПартийНачальные
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Еврооблигации) КАК УчетныйАктив,
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЕврооблигацииКупон) КАК УчетныйАктивКупон
			|ПОМЕСТИТЬ _СоответствиеАктивовИКупонов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные),
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте),
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративные),
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ОстаткиПартий.СчетДоверительногоУправления, ЕСТЬNULL(НастройкиУчетаАктивовСрезПоследних.СчетДоверительногоУправления, НастройкиУчетаАктивовКупонСрезПоследних.СчетДоверительногоУправления)) КАК СчетДоверительногоУправления,
			|	ЕСТЬNULL(ОстаткиПартий.УчетныйАктив, ЕСТЬNULL(НастройкиУчетаАктивовСрезПоследних.УчетныйАктив, НастройкиУчетаАктивовКупонСрезПоследних.УчетныйАктив)) КАК УчетныйАктив,
			|	ОстаткиПартий.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ОстаткиПартий.Рынок КАК Рынок,
			|	ОстаткиПартий.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчетаОстаток,
			|	ОстаткиПартий.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
			|	ОстаткиПартий.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток,
			|	ОстаткиПартий.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
			|	ОстаткиПартий.КоличествоОстаток КАК КоличествоОстаток,
			|	ОстаткиПартий.ИндексацияНоминалаОстаток КАК ИндексацияНоминалаОстаток,
			|	ОстаткиПартий.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладенияОстаток,
			|	ОстаткиПартий.СтоимостьОстаток КАК СтоимостьОстаток,
			|	ОстаткиПартий.ПереоценкаОстаток КАК ПереоценкаОстаток,
			|	ОстаткиПартий.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
			|	ОстаткиПартий.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
			|	ВЫБОР
			|		КОГДА ОстаткиПартий.ПроданоВРЕПО
			|			ТОГДА НастройкиУчетаАктивовСрезПоследних.СчетУчетаВЗалоге
			|		КОГДА ОстаткиПартий.КупленоПоРЕПО
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаТело)
			|		ИНАЧЕ НастройкиУчетаАктивовСрезПоследних.СчетУчета
			|	КОНЕЦ КАК СчетУчета,
			|	ВЫБОР
			|		КОГДА ОстаткиПартий.ПроданоВРЕПО
			|			ТОГДА НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценкиВЗалоге
			|		КОГДА ОстаткиПартий.КупленоПоРЕПО
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|		ИНАЧЕ НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки
			|	КОНЕЦ КАК СчетУчетаПереоценки,
			|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаИндексацииНоминала КАК СчетУчетаИндексацииНоминала,
			|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаИндексацииНоминалаЗаВремяВладения КАК СчетУчетаИндексацииНоминалаЗаВремяВладения,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ОстаткиПартий.ПроданоВРЕПО
			|				ТОГДА НастройкиУчетаАктивовКупонСрезПоследних.СчетУчетаВЗалоге
			|			КОГДА ОстаткиПартий.КупленоПоРЕПО
			|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаКупон)
			|			ИНАЧЕ НастройкиУчетаАктивовКупонСрезПоследних.СчетУчета
			|		КОНЕЦ, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) КАК СчетУчетаКупона,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ОстаткиПартий.ПроданоВРЕПО
			|				ТОГДА НастройкиУчетаАктивовКупонСрезПоследних.СчетУчетаПереоценкиВЗалоге
			|			КОГДА ОстаткиПартий.КупленоПоРЕПО
			|				ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|			ИНАЧЕ НастройкиУчетаАктивовКупонСрезПоследних.СчетУчетаПереоценки
			|		КОНЕЦ, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) КАК СчетУчетаПереоценкиКупона,
			|	ОстаткиПартий.ПроданоВРЕПО КАК ПроданоВРЕПО,
			|	_СоответствиеАктивовИКупонов.УчетныйАктивКупон КАК УчетныйАктивКупон,
			|	ОстаткиПартий.КупленоПоРЕПО КАК КупленоПоРЕПО,
			|	_НастройкаУчетНоминала.ВариантУчетаИндексацииНоминала КАК ВариантУчетаИндексацииНоминала
			|ПОМЕСТИТЬ ОстаткиПартийСчетаУчета
			|ИЗ
			|	ОстаткиПартийНачальные КАК ОстаткиПартий
			|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
			|				&Период,
			|				ВидУчета = &ВидУчета
			|					И УчетныйАктив В (&УчетныеАктивыБумаги)
			|					И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК НастройкиУчетаАктивовСрезПоследних
			|			ЛЕВОЕ СОЕДИНЕНИЕ _СоответствиеАктивовИКупонов КАК _СоответствиеАктивовИКупонов
			|			ПО НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = _СоответствиеАктивовИКупонов.УчетныйАктив
			|		ПО ОстаткиПартий.СчетДоверительногоУправления = НастройкиУчетаАктивовСрезПоследних.СчетДоверительногоУправления
			|			И ОстаткиПартий.УчетныйАктив = НастройкиУчетаАктивовСрезПоследних.УчетныйАктив
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
			|				&Период,
			|				ВидУчета = &ВидУчета
			|					И УчетныйАктив В (&УчетныеАктивыКупоны)
			|					И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК НастройкиУчетаАктивовКупонСрезПоследних
			|		ПО (НастройкиУчетаАктивовСрезПоследних.СчетДоверительногоУправления = НастройкиУчетаАктивовКупонСрезПоследних.СчетДоверительногоУправления)
			|			И (_СоответствиеАктивовИКупонов.УчетныйАктивКупон = НастройкиУчетаАктивовКупонСрезПоследних.УчетныйАктив)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкаУчетНоминала КАК _НастройкаУчетНоминала
			|		ПО (ЕСТЬNULL(ОстаткиПартий.СчетДоверительногоУправления, ЕСТЬNULL(НастройкиУчетаАктивовСрезПоследних.СчетДоверительногоУправления, НастройкиУчетаАктивовКупонСрезПоследних.СчетДоверительногоУправления)) = _НастройкаУчетНоминала.СчетДоверительногоУправления)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НастройкиУчетаОбщие.СчетДоверительногоУправления,
			|	_СоответствиеАктивовИКупонов.УчетныйАктив,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаТело),
			|	NULL,
			|	NULL,
			|	NULL,
			|	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаКупон),
			|	NULL,
			|	ЛОЖЬ,
			|	_СоответствиеАктивовИКупонов.УчетныйАктивКупон,
			|	ИСТИНА,
			|	_НастройкаУчетНоминала.ВариантУчетаИндексацииНоминала
			|ИЗ
			|	_СоответствиеАктивовИКупонов КАК _СоответствиеАктивовИКупонов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие КАК НастройкиУчетаОбщие
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкаУчетНоминала КАК _НастройкаУчетНоминала
			|		ПО (НастройкиУчетаОбщие.СчетДоверительногоУправления = _НастройкаУчетНоминала.СчетДоверительногоУправления)
			|ГДЕ
			|	(НастройкиУчетаОбщие.ВестиБухгалтерскийУчет
			|				И &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
			|			ИЛИ НастройкиУчетаОбщие.ВестиНалоговыйУчет
			|				И &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет))
			|	И (НастройкиУчетаОбщие.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|			ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОстаткиПартийСчетаУчета.СчетУчета КАК СчетУчета,
			|	ОстаткиПартийСчетаУчета.УчетныйАктив КАК УчетныйАктив
			|ПОМЕСТИТЬ СчетаУчета
			|ИЗ
			|	ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета
			|ГДЕ
			|	ОстаткиПартийСчетаУчета.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаПереоценки,
			|	ОстаткиПартийСчетаУчета.УчетныйАктив
			|ИЗ
			|	ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета
			|ГДЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаПереоценки <> ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминала,
			|	ОстаткиПартийСчетаУчета.УчетныйАктив
			|ИЗ
			|	ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета
			|ГДЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминала <> ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминалаЗаВремяВладения,
			|	ОстаткиПартийСчетаУчета.УчетныйАктив
			|ИЗ
			|	ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета
			|ГДЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминалаЗаВремяВладения <> ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаКупона,
			|	ОстаткиПартийСчетаУчета.УчетныйАктивКупон
			|ИЗ
			|	ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета
			|ГДЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаКупона <> ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаПереоценкиКупона,
			|	ОстаткиПартийСчетаУчета.УчетныйАктивКупон
			|ИЗ
			|	ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета
			|ГДЕ
			|	ОстаткиПартийСчетаУчета.СчетУчетаПереоценкиКупона <> ЗНАЧЕНИЕ(ПланСчетов.Основной.)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаТело),
			|	NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаКупон),
			|	NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	БухгалтерскийУчетОстатки.Счет КАК Счет,
			|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
			|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
			|	ВЫБОР
			|		КОГДА БухгалтерскийУчетОстатки.Счет.Валютный
			|			ТОГДА БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|		ИНАЧЕ БухгалтерскийУчетОстатки.СуммаОстаток
			|	КОНЕЦ КАК ВалютнаяСуммаОстаток,
			|	БухгалтерскийУчетОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ПОМЕСТИТЬ ОстаткиПоСчетамУчета
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&ОкончаниеПериодаКонецДня,
			|			Счет В
			|				(ВЫБРАТЬ
			|					СчетаУчета.СчетУчета
			|				ИЗ
			|					СчетаУчета КАК СчетаУчета),
			|			,
			|			Организация = &Организация
			|				И (СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					ИЛИ &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА НЕ ОстаткиПартийСчетаУчета.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА ОстаткиПартийСчетаУчета.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстатки.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстатки.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстаткиКупон.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиКупон.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценка.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценка.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценкаКупона.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценкаКупона.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетИндексацияНоминалаОстатки.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетИндексацияНоминалаОстатки.СчетДоверительногоУправления
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СчетДоверительногоУправления,
			|	ЕСТЬNULL(ОстаткиПартийСчетаУчета.УчетныйАктив, ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.)) КАК УчетныйАктив,
			|	ЕСТЬNULL(ОстаткиПартийСчетаУчета.Рынок, ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.)) КАК Рынок,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ОстаткиПартийСчетаУчета.ПроданоВРЕПО, ЛОЖЬ)
			|			ТОГДА ""Проданы в РЕПО""
			|		КОГДА ЕСТЬNULL(ОстаткиПартийСчетаУчета.КупленоПоРЕПО, ЛОЖЬ)
			|			ТОГДА ""Куплены по РЕПО""
			|		КОГДА ЕСТЬNULL(ОстаткиПартийСчетаУчета.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаТело)
			|				ИЛИ ЕСТЬNULL(ОстаткиПартийСчетаУчета.СчетУчетаКупона, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаКупон)
			|				ИЛИ ЕСТЬNULL(БухгалтерскийУчетОстатки.Счет, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаТело)
			|				ИЛИ ЕСТЬNULL(БухгалтерскийУчетОстаткиКупон.Счет, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаКупон)
			|			ТОГДА ""Куплены по РЕПО""
			|		ИНАЧЕ ""Собственные""
			|	КОНЕЦ КАК Местонахождение,
			|	ВЫБОР
			|		КОГДА НЕ ОстаткиПартийСчетаУчета.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА ОстаткиПартийСчетаУчета.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстатки.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстатки.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстаткиКупон.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиКупон.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценка.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценка.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценкаКупона.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценкаКупона.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетИндексацияНоминалаОстатки.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетИндексацияНоминалаОстатки.ЦеннаяБумага
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЦеннаяБумага,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.СтоимостьВВалютеУчетаОстаток, 0)) КАК СтоимостьВВалютеУчетаПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.ПереоценкаВВалютеУчетаОстаток, 0)) КАК ПереоценкаВВалютеУчетаПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.СтоимостьКупонаВВалютеУчетаОстаток, 0)) КАК СтоимостьКупонаВВалютеУчетаПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.ПереоценкаКупонаВВалютеУчетаОстаток, 0)) КАК ПереоценкаКупонаВВалютеУчетаПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.КоличествоОстаток, 0)) КАК КоличествоПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.ИндексацияНоминалаОстаток, 0)) КАК ИндексацияНоминалаПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.ИндексацияНоминалаЗаВремяВладенияОстаток, 0)) КАК ИндексацияНоминалаЗаВремяВладенияПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.СтоимостьОстаток, 0)) КАК СтоимостьПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.ПереоценкаОстаток, 0)) КАК ПереоценкаПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.СтоимостьКупонаОстаток, 0)) КАК СтоимостьКупонаПартии,
			|	СУММА(ЕСТЬNULL(ОстаткиПартийСчетаУчета.ПереоценкаКупонаОстаток, 0)) КАК ПереоценкаКупонаПартии,
			|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстатки.КоличествоОстаток, 0)) КАК КоличествоБУ,
			|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстаток, 0)) КАК СтоимостьВВалютеУчетаБУ,
			|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0)) КАК СтоимостьБУ,
			|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстаткиКупон.СуммаОстаток, 0)) КАК СтоимостьКупонаВВалютеУчетаБУ,
			|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстаткиКупон.ВалютнаяСуммаОстаток, 0)) КАК СтоимостьКупонаБУ,
			|	СУММА(ВЫБОР
			|			КОГДА ОстаткиПартийСчетаУчета.ВариантУчетаИндексацииНоминала = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаИндексированногоНоминала.ОтНачальногоНоминала)
			|				ТОГДА ЕСТЬNULL(БухгалтерскийУчетИндексацияНоминалаОстатки.СуммаОстаток, 0)
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ИндексацияНоминалаБУ,
			|	СУММА(ЕСТЬNULL(БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки.СуммаОстаток, 0)) КАК ИндексацияНоминалаЗаВремяВладенияБУ,
			|	СУММА(ВЫБОР
			|			КОГДА ОстаткиПартийСчетаУчета.СчетУчета = ОстаткиПартийСчетаУчета.СчетУчетаПереоценки
			|				ТОГДА 0
			|			ИНАЧЕ ЕСТЬNULL(БухгалтерскийУчетОстаткиПереоценка.СуммаОстаток, 0)
			|		КОНЕЦ) КАК ПереоценкаВВалютеУчетаБУ,
			|	СУММА(ВЫБОР
			|			КОГДА ОстаткиПартийСчетаУчета.СчетУчета = ОстаткиПартийСчетаУчета.СчетУчетаПереоценки
			|				ТОГДА 0
			|			ИНАЧЕ ЕСТЬNULL(БухгалтерскийУчетОстаткиПереоценка.ВалютнаяСуммаОстаток, 0)
			|		КОНЕЦ) КАК ПереоценкаБУ,
			|	СУММА(ВЫБОР
			|			КОГДА ОстаткиПартийСчетаУчета.СчетУчетаКупона = ОстаткиПартийСчетаУчета.СчетУчетаПереоценкиКупона
			|				ТОГДА 0
			|			ИНАЧЕ ЕСТЬNULL(БухгалтерскийУчетОстаткиПереоценкаКупона.СуммаОстаток, 0)
			|		КОНЕЦ) КАК ПереоценкаКупонаВВалютеУчетаБУ,
			|	СУММА(ВЫБОР
			|			КОГДА ОстаткиПартийСчетаУчета.СчетУчетаКупона = ОстаткиПартийСчетаУчета.СчетУчетаПереоценкиКупона
			|				ТОГДА 0
			|			ИНАЧЕ ЕСТЬNULL(БухгалтерскийУчетОстаткиПереоценкаКупона.ВалютнаяСуммаОстаток, 0)
			|		КОНЕЦ) КАК ПереоценкаКупонаБУ
			|ПОМЕСТИТЬ ОстаткиВсе
			|ИЗ
			|	ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета
			|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамУчета КАК БухгалтерскийУчетОстатки
			|		ПО ОстаткиПартийСчетаУчета.СчетДоверительногоУправления = БухгалтерскийУчетОстатки.СчетДоверительногоУправления
			|			И ОстаткиПартийСчетаУчета.СчетУчета = БухгалтерскийУчетОстатки.Счет
			|			И ОстаткиПартийСчетаУчета.ЦеннаяБумага = БухгалтерскийУчетОстатки.ЦеннаяБумага
			|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамУчета КАК БухгалтерскийУчетОстаткиПереоценка
			|		ПО ОстаткиПартийСчетаУчета.СчетДоверительногоУправления = БухгалтерскийУчетОстаткиПереоценка.СчетДоверительногоУправления
			|			И ОстаткиПартийСчетаУчета.СчетУчетаПереоценки = БухгалтерскийУчетОстаткиПереоценка.Счет
			|			И ОстаткиПартийСчетаУчета.ЦеннаяБумага = БухгалтерскийУчетОстаткиПереоценка.ЦеннаяБумага
			|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамУчета КАК БухгалтерскийУчетОстаткиКупон
			|		ПО ОстаткиПартийСчетаУчета.СчетДоверительногоУправления = БухгалтерскийУчетОстаткиКупон.СчетДоверительногоУправления
			|			И ОстаткиПартийСчетаУчета.СчетУчетаКупона = БухгалтерскийУчетОстаткиКупон.Счет
			|			И ОстаткиПартийСчетаУчета.ЦеннаяБумага = БухгалтерскийУчетОстаткиКупон.ЦеннаяБумага
			|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамУчета КАК БухгалтерскийУчетОстаткиПереоценкаКупона
			|		ПО ОстаткиПартийСчетаУчета.СчетДоверительногоУправления = БухгалтерскийУчетОстаткиПереоценкаКупона.СчетДоверительногоУправления
			|			И ОстаткиПартийСчетаУчета.СчетУчетаПереоценкиКупона = БухгалтерскийУчетОстаткиПереоценкаКупона.Счет
			|			И ОстаткиПартийСчетаУчета.ЦеннаяБумага = БухгалтерскийУчетОстаткиПереоценкаКупона.ЦеннаяБумага
			|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамУчета КАК БухгалтерскийУчетИндексацияНоминалаОстатки
			|		ПО ОстаткиПартийСчетаУчета.СчетДоверительногоУправления = БухгалтерскийУчетИндексацияНоминалаОстатки.СчетДоверительногоУправления
			|			И ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминала = БухгалтерскийУчетИндексацияНоминалаОстатки.Счет
			|			И ОстаткиПартийСчетаУчета.ЦеннаяБумага = БухгалтерскийУчетИндексацияНоминалаОстатки.ЦеннаяБумага
			|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамУчета КАК БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки
			|		ПО ОстаткиПартийСчетаУчета.СчетДоверительногоУправления = БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки.СчетДоверительногоУправления
			|			И ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминалаЗаВремяВладения = БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки.Счет
			|			И ОстаткиПартийСчетаУчета.ЦеннаяБумага = БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки.ЦеннаяБумага
			|ГДЕ
			|	(БухгалтерскийУчетОстатки.Счет ЕСТЬ NULL
			|			ИЛИ (БухгалтерскийУчетОстатки.СчетДоверительногоУправления, БухгалтерскийУчетОстатки.Счет) В
			|				(ВЫБРАТЬ
			|					ОстаткиПартийСчетаУчета.СчетДоверительногоУправления,
			|					ОстаткиПартийСчетаУчета.СчетУчета
			|				ИЗ
			|					ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета))
			|	И (БухгалтерскийУчетОстаткиПереоценка.Счет ЕСТЬ NULL
			|			ИЛИ (БухгалтерскийУчетОстаткиПереоценка.СчетДоверительногоУправления, БухгалтерскийУчетОстаткиПереоценка.Счет) В
			|				(ВЫБРАТЬ
			|					ОстаткиПартийСчетаУчета.СчетДоверительногоУправления,
			|					ОстаткиПартийСчетаУчета.СчетУчетаПереоценки
			|				ИЗ
			|					ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета))
			|	И (БухгалтерскийУчетОстаткиКупон.Счет ЕСТЬ NULL
			|			ИЛИ (БухгалтерскийУчетОстаткиКупон.СчетДоверительногоУправления, БухгалтерскийУчетОстаткиКупон.Счет) В
			|				(ВЫБРАТЬ
			|					ОстаткиПартийСчетаУчета.СчетДоверительногоУправления,
			|					ОстаткиПартийСчетаУчета.СчетУчетаКупона
			|				ИЗ
			|					ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета))
			|	И (БухгалтерскийУчетОстаткиПереоценкаКупона.Счет ЕСТЬ NULL
			|			ИЛИ (БухгалтерскийУчетОстаткиПереоценкаКупона.СчетДоверительногоУправления, БухгалтерскийУчетОстаткиПереоценкаКупона.Счет) В
			|				(ВЫБРАТЬ
			|					ОстаткиПартийСчетаУчета.СчетДоверительногоУправления,
			|					ОстаткиПартийСчетаУчета.СчетУчетаПереоценкиКупона
			|				ИЗ
			|					ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета))
			|	И (БухгалтерскийУчетИндексацияНоминалаОстатки.Счет ЕСТЬ NULL
			|			ИЛИ (БухгалтерскийУчетИндексацияНоминалаОстатки.СчетДоверительногоУправления, БухгалтерскийУчетИндексацияНоминалаОстатки.Счет) В
			|				(ВЫБРАТЬ
			|					ОстаткиПартийСчетаУчета.СчетДоверительногоУправления,
			|					ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминала
			|				ИЗ
			|					ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета))
			|	И (БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки.Счет ЕСТЬ NULL
			|			ИЛИ (БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки.СчетДоверительногоУправления, БухгалтерскийУчетИндексацияНоминалаЗаВремяВладенияОстатки.Счет) В
			|				(ВЫБРАТЬ
			|					ОстаткиПартийСчетаУчета.СчетДоверительногоУправления,
			|					ОстаткиПартийСчетаУчета.СчетУчетаИндексацииНоминалаЗаВремяВладения
			|				ИЗ
			|					ОстаткиПартийСчетаУчета КАК ОстаткиПартийСчетаУчета))
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА НЕ ОстаткиПартийСчетаУчета.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА ОстаткиПартийСчетаУчета.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстатки.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстатки.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстаткиКупон.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиКупон.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценка.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценка.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценкаКупона.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценкаКупона.СчетДоверительногоУправления
			|		КОГДА НЕ БухгалтерскийУчетИндексацияНоминалаОстатки.СчетДоверительногоУправления ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетИндексацияНоминалаОстатки.СчетДоверительногоУправления
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ЕСТЬNULL(ОстаткиПартийСчетаУчета.УчетныйАктив, ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.)),
			|	ЕСТЬNULL(ОстаткиПартийСчетаУчета.Рынок, ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.)),
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ОстаткиПартийСчетаУчета.ПроданоВРЕПО, ЛОЖЬ)
			|			ТОГДА ""Проданы в РЕПО""
			|		КОГДА ЕСТЬNULL(ОстаткиПартийСчетаУчета.КупленоПоРЕПО, ЛОЖЬ)
			|			ТОГДА ""Куплены по РЕПО""
			|		КОГДА ЕСТЬNULL(ОстаткиПартийСчетаУчета.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаТело)
			|				ИЛИ ЕСТЬNULL(ОстаткиПартийСчетаУчета.СчетУчетаКупона, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаКупон)
			|				ИЛИ ЕСТЬNULL(БухгалтерскийУчетОстатки.Счет, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаТело)
			|				ИЛИ ЕСТЬNULL(БухгалтерскийУчетОстаткиКупон.Счет, ЗНАЧЕНИЕ(ПланСчетов.Основной.)) = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПартииРЕПОПокупкаКупон)
			|			ТОГДА ""Куплены по РЕПО""
			|		ИНАЧЕ ""Собственные""
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ ОстаткиПартийСчетаУчета.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА ОстаткиПартийСчетаУчета.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстатки.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстатки.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстаткиКупон.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиКупон.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценка.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценка.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетОстаткиПереоценкаКупона.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстаткиПереоценкаКупона.ЦеннаяБумага
			|		КОГДА НЕ БухгалтерскийУчетИндексацияНоминалаОстатки.ЦеннаяБумага ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетИндексацияНоминалаОстатки.ЦеннаяБумага
			|		ИНАЧЕ 0
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиВсе.СчетДоверительногоУправления КАК СчетДоверительногоУправленияСверкаРСБУ,
			|	ОстаткиВсе.Рынок КАК Рынок,
			|	ОстаткиВсе.УчетныйАктив КАК УчетныйАктивСверкаРСБУ,
			|	ОстаткиВсе.ЦеннаяБумага КАК ЦеннаяБумагаСверкаРСБУ,
			|	ОстаткиВсе.КоличествоПартии КАК КоличествоПартииСверкаРСБУ,
			|	ОстаткиВсе.КоличествоБУ КАК КоличествоБУСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьВВалютеУчетаПартии КАК СтоимостьВВалютеУчетаПартииСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьВВалютеУчетаБУ КАК СтоимостьВВалютеУчетаБУСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьПартии КАК СтоимостьПартииСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьБУ КАК СтоимостьБУСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаВВалютеУчетаПартии КАК ПереоценкаВВалютеУчетаПартииСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаВВалютеУчетаБУ КАК ПереоценкаВВалютеУчетаБУСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаПартии КАК ПереоценкаПартииСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаБУ КАК ПереоценкаБУСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьКупонаВВалютеУчетаПартии КАК СтоимостьКупонаВВалютеУчетаПартииСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьКупонаВВалютеУчетаБУ КАК СтоимостьКупонаВВалютеУчетаБУСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьКупонаПартии КАК СтоимостьКупонаПартииСверкаРСБУ,
			|	ОстаткиВсе.СтоимостьКупонаБУ КАК СтоимостьКупонаБУСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаКупонаВВалютеУчетаПартии КАК ПереоценкаКупонаВВалютеУчетаПартииСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаКупонаВВалютеУчетаБУ КАК ПереоценкаКупонаВВалютеУчетаБУСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаКупонаПартии КАК ПереоценкаКупонаПартииСверкаРСБУ,
			|	ОстаткиВсе.ПереоценкаКупонаБУ КАК ПереоценкаКупонаБУСверкаРСБУ,
			|	ОстаткиВсе.Местонахождение КАК Местонахождение,
			|	ОстаткиВсе.ИндексацияНоминалаПартии КАК ИндексацияНоминалаПартииСверкаРСБУ,
			|	ОстаткиВсе.ИндексацияНоминалаЗаВремяВладенияПартии КАК ИндексацияНоминалаЗаВремяВладенияПартииСверкаРСБУ,
			|	ОстаткиВсе.ИндексацияНоминалаБУ КАК ИндексацияНоминалаБУСверкаРСБУ,
			|	ОстаткиВсе.ИндексацияНоминалаЗаВремяВладенияБУ КАК ИндексацияНоминалаЗаВремяВладенияБУСверкаРСБУ
			|ИЗ
			|	ОстаткиВсе КАК ОстаткиВсе
			|ГДЕ
			|	ОстаткиВсе.ЦеннаяБумага <> 0";
		
		Если ЭтотОбъект.ВидУчета <> Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				"РегистрБухгалтерии.БухгалтерскийУчет",
				"РегистрБухгалтерии." + РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета)
			);
		КонецЕсли;
		
		УчетныеАктивыБумаги = ПолучитьУчетныеАктивы(Ложь);
		УчетныеАктивыКупоны = ПолучитьУчетныеАктивы(Истина);
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
		Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
		Запрос.УстановитьПараметр("ОкончаниеПериодаКонецДня", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ОстаткиПартий", ОстаткиПартий);
		Запрос.УстановитьПараметр("УчетныеАктивыБумаги", УчетныеАктивыБумаги);
		Запрос.УстановитьПараметр("УчетныеАктивыКупоны", УчетныеАктивыКупоны);
			
		ОстаткиПартийСверка = Запрос.Выполнить().Выгрузить();
		
		СтрокиБезУчетногоАктива = ОстаткиПартийСверка.НайтиСтроки(новый Структура("УчетныйАктивСверкаРСБУ", Справочники.УчетныеАктивы.ПустаяСсылка()));
		
		Для Каждого СтрокаБезУчетногоАктива из СтрокиБезУчетногоАктива Цикл
			
			ТипЦБ = ТипЗнч(СтрокаБезУчетногоАктива.ЦеннаяБумагаСверкаРСБУ);
			Если ТипЦБ = Тип("СправочникСсылка.Облигации") Тогда
				СтрокаБезУчетногоАктива.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
			ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Акции") Тогда
				СтрокаБезУчетногоАктива.Рынок = Перечисления.РынкиЦенныхБумаг.Акции;
			ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Паи") Тогда
				СтрокаБезУчетногоАктива.Рынок = Перечисления.РынкиЦенныхБумаг.Паи;
			КонецЕсли;
			СтрокаБезУчетногоАктива.УчетныйАктивСверкаРСБУ = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Период, СтрокаБезУчетногоАктива.Рынок, СтрокаБезУчетногоАктива.ЦеннаяБумагаСверкаРСБУ, ЛОЖЬ);
			
		КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПартииСверкаСПереоценкой(Настройки, СтрокиПереоценкиСверка)
	
	СтрокиПереоценкиСверка = новый ТаблицаЗначений;
	СтрокиПереоценкиСверка.Колонки.Добавить("СчетДоверительногоУправленияСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ЦеннаяБумагаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("МестонахождениеСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("БалансоваяСуммаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("БалансоваяСуммаВВалютеУчетаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("БалансоваяСуммаКупонаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("БалансоваяСуммаКупонаВВалютеУчетаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ОценочнаяСуммаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ОценочнаяСуммаВВалютеУчетаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ОценочнаяСуммаКупонаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ОценочнаяСуммаКупонаВВалютеУчетаСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ПолеЦеныСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ИсточникЦеныСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ДатаКотировкиСверкаСПереоценкой");
	СтрокиПереоценкиСверка.Колонки.Добавить("ДатаКотировкиКупонаСверкаСПереоценкой");
	
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ЭтотОбъект.ВидУчета);
	
	ДокументПереоценка = Новый Структура;
	ДокументПереоценка.Вставить("Дата", КонецДня(ЭтотОбъект.Период));
	ДокументПереоценка.Вставить("Организация", ЭтотОбъект.Организация);
	ДокументПереоценка.Вставить("ВидУчета", ЭтотОбъект.ВидУчета);
	ДокументПереоценка.Вставить("ПереоцениватьНаОснованииНастроекУчета", Истина);
	ДокументПереоценка.Вставить("ЦенныеБумаги", Новый ТаблицаЗначений);
	ДокументПереоценка.Вставить("ЦельРасчета", ЦельРасчета);
	ДокументПереоценка.Вставить("РассчитыватьПроцентныеПоказатели", Ложь);
	
	СписокСчетовДУ = Новый Массив;
	Если ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) Тогда
		СписокСчетовДУ.Добавить(ЭтотОбъект.СчетДоверительногоУправления);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет КАК ВестиБухгалтерскийУчет
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&Период, Организация = &Организация) КАК НастройкиУчетаОбщиеСрезПоследних
		|ГДЕ
		|	НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
		Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", "НалоговыйУчет");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокСчетовДУ.Добавить(ВыборкаДетальныеЗаписи.СчетДоверительногоУправления);
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ТекущийСчетДоверительногоУправления из СписокСчетовДУ Цикл
		
		НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(ЭтотОбъект.Период, ЭтотОбъект.Организация, ТекущийСчетДоверительногоУправления, ЦельРасчета);
		
		Если НЕ ЗначениеЗаполнено(НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументПереоценка.Вставить("СчетДоверительногоУправления", ТекущийСчетДоверительногоУправления);
		ДокументПереоценка.Вставить("ВариантРасчетаОценочнойСтоимости", НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости);
		
		//РаботаСПереоценкой.ПолучитьЦенныеБумаги(ЭтотОбъект, МенеджерВТ, "ТаблицаПартийЦБ", ПараметрыПолученияПартий.УчестьПартииКПолучению, ПараметрыПолученияПартий.УчестьБумагиТПлюс, ПараметрыПолученияПартий.УчестьБумагиПоРЕПО, , , РасшифровкаРасчета);
		//
		//Запрос = Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	ТаблицаПартийЦБ.Рынок КАК Рынок,
		//	|	ТаблицаПартийЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		//	|	СУММА(ТаблицаПартийЦБ.Количество) КАК Количество
		//	|ИЗ
		//	|	ТаблицаПартийЦБ КАК ТаблицаПартийЦБ
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ТаблицаПартийЦБ.Рынок,
		//	|	ТаблицаПартийЦБ.ЦеннаяБумага";
		//
		//ТаблицаЦБ = Запрос.Выполнить().Выгрузить();
		
		Отказ = Ложь;
		
		РаботаСПереоценкой.ПолучитьТабличнуюЧастьПереоценки(ДокументПереоценка, Неопределено, Отказ);
		
		ЦенныеБумагиПереоценки = ДокументПереоценка.ЦенныеБумаги;
		Если ЦенныеБумагиПереоценки.Колонки.Количество() <> 0 Тогда
			
			//округлим "4 знака"
			Если НастройкиЦелиРасчета.ТочностьЦеныОценки > 2 ИЛИ НастройкиЦелиРасчета.ТочностьЦеныКупона > 2 Тогда
				Для каждого СтрокаПереоценки из ЦенныеБумагиПереоценки Цикл
					СтрокаПереоценки.ОценочнаяСумма = Окр(СтрокаПереоценки.ОценочнаяСумма, 2);
					СтрокаПереоценки.ОценочнаяСуммаВВалютеУчета = Окр(СтрокаПереоценки.ОценочнаяСуммаВВалютеУчета, 2);
					СтрокаПереоценки.ОценочнаяСуммаКупона = Окр(СтрокаПереоценки.ОценочнаяСуммаКупона, 2);
					СтрокаПереоценки.ОценочнаяСуммаКупонаВВалютеУчета = Окр(СтрокаПереоценки.ОценочнаяСуммаКупонаВВалютеУчета, 2);
				КонецЦикла;
			КонецЕсли;
			
			ЦенныеБумагиПереоценки.Свернуть("ЦеннаяБумага,ПолеЦены,ИсточникЦены,ДатаКотировки,ДатаКотировкиКупона", "БалансоваяСумма,БалансоваяСуммаВВалютеУчета,БалансоваяСуммаКупона,БалансоваяСуммаКупонаВВалютеУчета,ОценочнаяСумма,ОценочнаяСуммаВВалютеУчета,ОценочнаяСуммаКупона,ОценочнаяСуммаКупонаВВалютеУчета");
			Для каждого СтрокаПереоценки из ЦенныеБумагиПереоценки Цикл
				СтрокаОтчета = СтрокиПереоценкиСверка.Добавить();
				СтрокаОтчета.СчетДоверительногоУправленияСверкаСПереоценкой = ДокументПереоценка.СчетДоверительногоУправления;
				СтрокаОтчета.ЦеннаяБумагаСверкаСПереоценкой = СтрокаПереоценки.ЦеннаяБумага;
				СтрокаОтчета.МестонахождениеСверкаСПереоценкой = "Собственные";
				СтрокаОтчета.БалансоваяСуммаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСумма;
				СтрокаОтчета.БалансоваяСуммаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСуммаВВалютеУчета;
				СтрокаОтчета.БалансоваяСуммаКупонаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСуммаКупона;
				СтрокаОтчета.БалансоваяСуммаКупонаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСуммаКупонаВВалютеУчета;
				СтрокаОтчета.ОценочнаяСуммаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСумма;
				СтрокаОтчета.ОценочнаяСуммаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСуммаВВалютеУчета;
				СтрокаОтчета.ОценочнаяСуммаКупонаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСуммаКупона;
				СтрокаОтчета.ОценочнаяСуммаКупонаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСуммаКупонаВВалютеУчета;
				Если СтрокаПереоценки.ПолеЦены = Перечисления.ИсточникиЦеныДляПереоценки.БалансоваяЦена Тогда
					СтрокаОтчета.ПолеЦеныСверкаСПереоценкой = СтрокаПереоценки.ПолеЦены;
					СтрокаОтчета.ИсточникЦеныСверкаСПереоценкой = "";
					СтрокаОтчета.ДатаКотировкиСверкаСПереоценкой = "";
				Иначе
					СтрокаОтчета.ПолеЦеныСверкаСПереоценкой = СтрокаПереоценки.ПолеЦены;
					СтрокаОтчета.ИсточникЦеныСверкаСПереоценкой = СтрокаПереоценки.ИсточникЦены;
					СтрокаОтчета.ДатаКотировкиСверкаСПереоценкой = СтрокаПереоценки.ДатаКотировки;
				КонецЕсли;
				СтрокаОтчета.ДатаКотировкиКупонаСверкаСПереоценкой = СтрокаПереоценки.ДатаКотировкиКупона;
			КонецЦикла;
			
		КонецЕсли;
		
		ДокументПереоценка.ЦенныеБумаги.Колонки.Очистить(); 
		
		МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
		Документы.ПереоценкаЦенныхБумаг.ЗаполнитьЦенныеБумагиПроданныеВРЕПО(ДокументПереоценка, МенеджерВременныхТаблиц, "ТаблицаПартийЦБ", Отказ);
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заполнить партии, проданные в РЕПО для " + ДокументПереоценка.СчетДоверительногоУправления);
			Продолжить;
		КонецЕсли; 
		СообщенияОбОценочнойСтоимости = Неопределено;
		РаботаСПереоценкой.ЗаполнитьКотировки(ДокументПереоценка, МенеджерВременныхТаблиц, СообщенияОбОценочнойСтоимости, Отказ);
		
		Документы.ПереоценкаЦенныхБумаг.ПрименитьПолитикуУчетаПереоценкиПроданныеВРЕПО(ДокументПереоценка, Ложь, СообщенияОбОценочнойСтоимости, Организация.ВалютаУчета, Отказ);
		
		
		ЦенныеБумагиПереоценки = ДокументПереоценка.ЦенныеБумаги;
		Если ЦенныеБумагиПереоценки.Колонки.Количество() <> 0 Тогда
			
			//округлим "4 знака"
			Если НастройкиЦелиРасчета.ТочностьЦеныОценки > 2 ИЛИ НастройкиЦелиРасчета.ТочностьЦеныКупона > 2 Тогда
				Для каждого СтрокаПереоценки из ЦенныеБумагиПереоценки Цикл
					СтрокаПереоценки.ОценочнаяСумма = Окр(СтрокаПереоценки.ОценочнаяСумма, 2);
					СтрокаПереоценки.ОценочнаяСуммаВВалютеУчета = Окр(СтрокаПереоценки.ОценочнаяСуммаВВалютеУчета, 2);
					СтрокаПереоценки.ОценочнаяСуммаКупона = Окр(СтрокаПереоценки.ОценочнаяСуммаКупона, 2);
					СтрокаПереоценки.ОценочнаяСуммаКупонаВВалютеУчета = Окр(СтрокаПереоценки.ОценочнаяСуммаКупонаВВалютеУчета, 2);
				КонецЦикла;
			КонецЕсли;
			
			ЦенныеБумагиПереоценки.Свернуть("ЦеннаяБумага,ПолеЦены,ИсточникЦены,ДатаКотировки,ДатаКотировкиКупона", "БалансоваяСумма,БалансоваяСуммаВВалютеУчета,БалансоваяСуммаКупона,БалансоваяСуммаКупонаВВалютеУчета,ОценочнаяСумма,ОценочнаяСуммаВВалютеУчета,ОценочнаяСуммаКупона,ОценочнаяСуммаКупонаВВалютеУчета");
			Для каждого СтрокаПереоценки из ЦенныеБумагиПереоценки Цикл
				СтрокаОтчета = СтрокиПереоценкиСверка.Добавить();
				СтрокаОтчета.СчетДоверительногоУправленияСверкаСПереоценкой = ДокументПереоценка.СчетДоверительногоУправления;
				СтрокаОтчета.ЦеннаяБумагаСверкаСПереоценкой = СтрокаПереоценки.ЦеннаяБумага;
				СтрокаОтчета.МестонахождениеСверкаСПереоценкой = "Проданы в РЕПО";
				СтрокаОтчета.БалансоваяСуммаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСумма;
				СтрокаОтчета.БалансоваяСуммаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСуммаВВалютеУчета;
				СтрокаОтчета.БалансоваяСуммаКупонаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСуммаКупона;
				СтрокаОтчета.БалансоваяСуммаКупонаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.БалансоваяСуммаКупонаВВалютеУчета;
				СтрокаОтчета.ОценочнаяСуммаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСумма;
				СтрокаОтчета.ОценочнаяСуммаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСуммаВВалютеУчета;
				СтрокаОтчета.ОценочнаяСуммаКупонаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСуммаКупона;
				СтрокаОтчета.ОценочнаяСуммаКупонаВВалютеУчетаСверкаСПереоценкой = СтрокаПереоценки.ОценочнаяСуммаКупонаВВалютеУчета;
				Если СтрокаПереоценки.ПолеЦены = Перечисления.ИсточникиЦеныДляПереоценки.БалансоваяЦена Тогда
					СтрокаОтчета.ПолеЦеныСверкаСПереоценкой = СтрокаПереоценки.ПолеЦены;
					СтрокаОтчета.ИсточникЦеныСверкаСПереоценкой = 0;
					СтрокаОтчета.ДатаКотировкиСверкаСПереоценкой = 0;
				Иначе
					СтрокаОтчета.ПолеЦеныСверкаСПереоценкой = СтрокаПереоценки.ПолеЦены;
					СтрокаОтчета.ИсточникЦеныСверкаСПереоценкой = СтрокаПереоценки.ИсточникЦены;
					СтрокаОтчета.ДатаКотировкиСверкаСПереоценкой = СтрокаПереоценки.ДатаКотировки;
				КонецЕсли;
				СтрокаОтчета.ДатаКотировкиКупонаСверкаСПереоценкой = СтрокаПереоценки.ДатаКотировкиКупона;
			КонецЦикла;
			
		КонецЕсли;		
	КонецЦикла;
	//СтрокиПереоценкиСверка = ДокументПереоценка.ЦенныеБумаги.Скопировать(,"ЦеннаяБумага,БалансоваяСумма,БалансоваяСуммаВВалютеУчета,БалансоваяСуммаКупона,БалансоваяСуммаКупонаВВалютеУчета,ОценочнаяСумма,ОценочнаяСуммаВВалютеУчета,ОценочнаяСуммаКупона,ОценочнаяСуммаКупонаВВалютеУчета");		
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПартииСверкаРЕПО(Настройки, ДанныеСверкиПоРЕПО)
	
	Отказ = Ложь;
		
		СуммыЗаймовПоПериодам = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.РассчитатьПроцентыПоРЕПО(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, КонецДня(ЭтотОбъект.Период), ЭтотОбъект.ВидУчета,, Отказ);
		
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось рассчитать проценты по сделкам РЕПО");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СуммыЗаймовПоПериодам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СуммыЗаймовПоПериодам.Основание КАК СделкаРЕПО,
			|	СуммыЗаймовПоПериодам.ВидСделки КАК ВидСделкиРЕПО,
			|	СуммыЗаймовПоПериодам.Контрагент КАК Контрагент,
			|	СуммыЗаймовПоПериодам.ВалютаСделки КАК ВалютаСделки,
			|	СуммыЗаймовПоПериодам.ДатаРЕПО КАК ДатаРЕПО,
			|	СуммыЗаймовПоПериодам.ДатаЗакрытияРЕПО КАК ДатаЗакрытияРЕПО,
			|	СуммыЗаймовПоПериодам.СуммаРЕПО КАК СуммаРЕПО,
			|	СуммыЗаймовПоПериодам.СуммаЗакрытияРЕПО КАК СуммаЗакрытияРЕПО,
			|	СуммыЗаймовПоПериодам.ПериодС КАК ПериодС,
			|	СуммыЗаймовПоПериодам.ПериодПо КАК ПериодПо,
			|	СуммыЗаймовПоПериодам.СуммаПериода КАК СуммаПериода,
			|	СуммыЗаймовПоПериодам.СуммаВЗалоге КАК СуммаВЗалоге,
			|	СуммыЗаймовПоПериодам.СуммаПроцентов КАК СуммаПроцентов
			|ПОМЕСТИТЬ _СуммыЗаймовПоПериодамИзПереоценки
			|ИЗ
			|	&СуммыЗаймовПоПериодам КАК СуммыЗаймовПоПериодам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СуммыЗаймовПоПериодамИзПереоценки.СделкаРЕПО КАК СделкаРЕПО,
			|	МАКСИМУМ(_СуммыЗаймовПоПериодамИзПереоценки.ДатаЗакрытияРЕПО) КАК ДатаЗакрытияРЕПО,
			|	СУММА(_СуммыЗаймовПоПериодамИзПереоценки.СуммаПроцентов) КАК СуммаПроцентов
			|ПОМЕСТИТЬ _СделкиРЕПО
			|ИЗ
			|	_СуммыЗаймовПоПериодамИзПереоценки КАК _СуммыЗаймовПоПериодамИзПереоценки
			|
			|СГРУППИРОВАТЬ ПО
			|	_СуммыЗаймовПоПериодамИзПереоценки.СделкаРЕПО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СуммыЗаймовПоПериодамИзПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СделкиРЕПО.СделкаРЕПО КАК СделкаРЕПО,
			|	_СуммыЗаймовПоПериодамИзПереоценки.ВидСделкиРЕПО КАК ВидСделкиРЕПО,
			|	_СуммыЗаймовПоПериодамИзПереоценки.Контрагент КАК Контрагент,
			|	_СуммыЗаймовПоПериодамИзПереоценки.ВалютаСделки КАК ВалютаСделки,
			|	_СуммыЗаймовПоПериодамИзПереоценки.ДатаРЕПО КАК ДатаРЕПО,
			|	_СделкиРЕПО.ДатаЗакрытияРЕПО КАК ДатаЗакрытияРЕПО,
			|	_СуммыЗаймовПоПериодамИзПереоценки.СуммаРЕПО КАК СуммаРЕПО,
			|	_СуммыЗаймовПоПериодамИзПереоценки.СуммаЗакрытияРЕПО КАК СуммаЗакрытияРЕПО,
			|	_СуммыЗаймовПоПериодамИзПереоценки.ПериодС КАК ПериодС,
			|	_СуммыЗаймовПоПериодамИзПереоценки.ПериодПо КАК ПериодПо,
			|	_СуммыЗаймовПоПериодамИзПереоценки.СуммаПериода КАК СуммаПериода,
			|	_СуммыЗаймовПоПериодамИзПереоценки.СуммаВЗалоге КАК СуммаВЗалоге,
			|	_СделкиРЕПО.СуммаПроцентов КАК СуммаПроцентов
			|ПОМЕСТИТЬ _СуммыЗаймовПоПериодам
			|ИЗ
			|	_СделкиРЕПО КАК _СделкиРЕПО
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СуммыЗаймовПоПериодамИзПереоценки КАК _СуммыЗаймовПоПериодамИзПереоценки
			|		ПО _СделкиРЕПО.СделкаРЕПО = _СуммыЗаймовПоПериодамИзПереоценки.СделкаРЕПО
			|			И _СделкиРЕПО.ДатаЗакрытияРЕПО = _СуммыЗаймовПоПериодамИзПереоценки.ДатаЗакрытияРЕПО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(НалоговыйУчетОстатки.СуммаОстаток, 0) КАК НачисленныеПроцентыПоРЕПОВВалютеУчета,
			|	ЕСТЬNULL(НалоговыйУчетОстатки.ВалютнаяСуммаОстаток, 0) КАК НачисленныеПроцентыПоРЕПО,
			|	НалоговыйУчетОстатки.Субконто1 КАК СделкаРЕПО,
			|	НалоговыйУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВЫРАЗИТЬ(НалоговыйУчетОстатки.Субконто1 КАК Документ.СделкаРЕПО).ВидСделки КАК ВидСделкиРЕПО,
			|	ВЫРАЗИТЬ(НалоговыйУчетОстатки.Субконто1 КАК Документ.СделкаРЕПО).ВалютаСделки КАК ВалютаСделки,
			|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(НалоговыйУчетОстатки.Субконто1 КАК Документ.СделкаРЕПО).Дата, ДЕНЬ) КАК ДатаРЕПО
			|ПОМЕСТИТЬ _ПроцентыПоРЕПО
			|ИЗ
			|	РегистрБухгалтерии.НалоговыйУчет.Остатки(
			|			&Период,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоКраткосрочнымКредитам)
			|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.СделкаРЕПО),
			|			Организация = &Организация
			|				И (СчетДоверительногоУправления В (&СписокСтратегий)
			|					ИЛИ &ПоВсемСчетамДУ)) КАК НалоговыйУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(НалоговыйУчетОстатки.СуммаОстаток, 0) КАК СуммаЗаймаВВалютеУчета,
			|	ЕСТЬNULL(НалоговыйУчетОстатки.ВалютнаяСуммаОстаток, 0) КАК СуммаЗайма,
			|	НалоговыйУчетОстатки.Субконто1 КАК СделкаРЕПО,
			|	НалоговыйУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВЫРАЗИТЬ(НалоговыйУчетОстатки.Субконто1 КАК Документ.СделкаРЕПО).ВидСделки КАК ВидСделкиРЕПО,
			|	ВЫРАЗИТЬ(НалоговыйУчетОстатки.Субконто1 КАК Документ.СделкаРЕПО).ВалютаСделки КАК ВалютаСделки,
			|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(НалоговыйУчетОстатки.Субконто1 КАК Документ.СделкаРЕПО).Дата, ДЕНЬ) КАК ДатаРЕПО
			|ПОМЕСТИТЬ _СуммыЗаймов
			|ИЗ
			|	РегистрБухгалтерии.НалоговыйУчет.Остатки(
			|			&Период,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
			|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.КраткосрочныеКредиты),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.СделкаРЕПО),
			|			Организация = &Организация
			|				И (СчетДоверительногоУправления В (&СписокСтратегий)
			|					ИЛИ &ПоВсемСчетамДУ)) КАК НалоговыйУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(_СуммыЗаймовПоПериодам.ПериодС) КАК ПериодС,
			|	_СуммыЗаймовПоПериодам.СделкаРЕПО КАК СделкаРЕПО,
			|	_СуммыЗаймовПоПериодам.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _МаксимальныйПериод
			|ИЗ
			|	_СуммыЗаймовПоПериодам КАК _СуммыЗаймовПоПериодам
			|
			|СГРУППИРОВАТЬ ПО
			|	_СуммыЗаймовПоПериодам.СчетДоверительногоУправления,
			|	_СуммыЗаймовПоПериодам.СделкаРЕПО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.СчетДоверительногоУправления, ЕСТЬNULL(_ПроцентыПоРЕПО.СчетДоверительногоУправления, _СуммыЗаймов.СчетДоверительногоУправления)) КАК СверкаРЕПОСчетДоверительногоУправления,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.ВидСделкиРЕПО, ЕСТЬNULL(_ПроцентыПоРЕПО.ВидСделкиРЕПО, _СуммыЗаймов.ВидСделкиРЕПО)) КАК СверкаРЕПОВидСделкиРЕПО,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.СделкаРЕПО, ЕСТЬNULL(_ПроцентыПоРЕПО.СделкаРЕПО, _СуммыЗаймов.СделкаРЕПО)) КАК СверкаРЕПОСделкаРЕПО,
			|	_СуммыЗаймовПоПериодам.Контрагент КАК СверкаРЕПОКонтрагент,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.ВалютаСделки, ЕСТЬNULL(_ПроцентыПоРЕПО.ВалютаСделки, _СуммыЗаймов.ВалютаСделки)) КАК СверкаРЕПОВалютаСделки,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.ДатаРЕПО, ЕСТЬNULL(_ПроцентыПоРЕПО.ДатаРЕПО, _СуммыЗаймов.ДатаРЕПО)) КАК СверкаРЕПОДатаРЕПО,
			|	_СуммыЗаймовПоПериодам.ДатаЗакрытияРЕПО КАК СверкаРЕПОДатаЗакрытияРЕПО,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.СуммаРЕПО, 0) КАК СверкаРЕПОСуммаРЕПО,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.СуммаЗакрытияРЕПО, 0) КАК СверкаРЕПОСуммаЗакрытияРЕПО,
			|	_СуммыЗаймовПоПериодам.ПериодС КАК СверкаРЕПОПериодС,
			|	_СуммыЗаймовПоПериодам.ПериодПо КАК СверкаРЕПОПериодПо,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.СуммаПериода, 0) КАК СверкаРЕПОСуммаПериода,
			|	ЕСТЬNULL(_СуммыЗаймовПоПериодам.СуммаПроцентов, 0) КАК СверкаРЕПОСуммаПроцентов,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(_СуммыЗаймовПоПериодам.СуммаПроцентов, 0) * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(19, 2)) КАК СверкаРЕПОСуммаПроцентовВВалютеУчета,
			|	ЕСТЬNULL(_СуммыЗаймов.СуммаЗайма, 0) КАК СверкаРЕПОСуммаЗаймаНаСчетахУчета,
			|	ЕСТЬNULL(_СуммыЗаймов.СуммаЗаймаВВалютеУчета, 0) КАК СверкаРЕПОСуммаЗаймаНаСчетахУчетаВВалютеУчета,
			|	ЕСТЬNULL(_ПроцентыПоРЕПО.НачисленныеПроцентыПоРЕПО, 0) КАК СверкаРЕПОНачисленныеПроцентыПоРЕПОНаСчетахУчета,
			|	ЕСТЬNULL(_ПроцентыПоРЕПО.НачисленныеПроцентыПоРЕПОВВалютеУчета, 0) КАК СверкаРЕПОНачисленныеПроцентыПоРЕПОНаСчетахУчетаВВалютеУчета,
			|	ВЫБОР
			|		КОГДА _МаксимальныйПериод.ПериодС ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ _СуммыЗаймовПоПериодам.СуммаВЗалоге
			|	КОНЕЦ КАК СверкаРЕПОСуммаТекущегоПериода,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА _МаксимальныйПериод.ПериодС ЕСТЬ NULL
			|				ТОГДА 0
			|			ИНАЧЕ _СуммыЗаймовПоПериодам.СуммаВЗалоге
			|		КОНЕЦ * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(19, 2)) КАК СверкаРЕПОСуммаТекущегоПериодаВВалютеУчета
			|ИЗ
			|	_СуммыЗаймовПоПериодам КАК _СуммыЗаймовПоПериодам
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ПроцентыПоРЕПО КАК _ПроцентыПоРЕПО
			|		ПО _СуммыЗаймовПоПериодам.СделкаРЕПО = _ПроцентыПоРЕПО.СделкаРЕПО
			|		ПОЛНОЕ СОЕДИНЕНИЕ _СуммыЗаймов КАК _СуммыЗаймов
			|		ПО _СуммыЗаймовПоПериодам.СделкаРЕПО = _СуммыЗаймов.СделкаРЕПО
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|		ПО (ЕСТЬNULL(_СуммыЗаймовПоПериодам.ВалютаСделки, ЕСТЬNULL(_ПроцентыПоРЕПО.ВалютаСделки, _СуммыЗаймов.ВалютаСделки)) = КурсыВалют.Валюта)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МаксимальныйПериод КАК _МаксимальныйПериод
			|		ПО _СуммыЗаймовПоПериодам.СделкаРЕПО = _МаксимальныйПериод.СделкаРЕПО
			|			И _СуммыЗаймовПоПериодам.ПериодС = _МаксимальныйПериод.ПериодС
			|ГДЕ
			|	КурсыВалют.Период = &ДатаПереоценки";
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ЭтотОбъект.Период));
		СписокСтратегий = Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);
		Запрос.УстановитьПараметр("ПоВсемСчетамДУ", СписокСтратегий.Количество() = 0);
		Запрос.УстановитьПараметр("СуммыЗаймовПоПериодам", СуммыЗаймовПоПериодам);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидУчета));
		
		ДанныеСверкиПоРЕПО = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры

#КонецОбласти

#Область Отладка

Функция Проверка(ПараметрыПроверки) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ВнешнийНаборДанных = Неопределено;	
	
	ЭтотОбъект.Организация = ПараметрыПроверки.Организация;      
	ЭтотОбъект.Период = ПараметрыПроверки.Период; 
	ЭтотОбъект.СчетДоверительногоУправления = ПараметрыПроверки.Счет;
	ЭтотОбъект.ВидУчета = ПараметрыПроверки.ВидУчета;
		
	ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(ПараметрыПроверки.Настройка);
		
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЭтотОбъект.Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериодаГраницаДня",	новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Настройки.ПараметрыДанных.Элементы.Найти("ПериодИнтервал").Использование	= Ложь;
	Настройки.ПараметрыДанных.Элементы.Найти("Календарь").Использование			= Ложь;
	Настройки.ПараметрыДанных.Элементы.Найти("ВидЛицензии").Использование		= Ложь;
	Настройки.ПараметрыДанных.Элементы.Найти("ВидДоговора").Использование		= Ложь;
			
	Вариант = ПараметрыПроверки.Вариант;
	
	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Если Вариант = "СверкаПоДС" Тогда
		
		ЗаполнитьНастройкиСверкаПоДС(Настройки, СхемаКомпоновкиДанных);
		
	ИначеЕсли Вариант = "ПартииРСБУ_НУ" ИЛИ Вариант = "ПоКоличествуИВидуУчета" Тогда
				
		ЗаполнитьНастройкиПартииРСБУ_НУ(Настройки);
		
	КонецЕсли;
	
	Если Вариант = "СверкаСуммБУ_НУ" Тогда
					
		ОстаткиПартийСверка = Неопределено;	
		ЗаполнитьНастройкиПартииСверкаСуммБУ_НУ(Настройки, ОстаткиПартийСверка);
		ВнешнийНаборДанных = Новый Структура("ДанныеСверкиРСБУ", ОстаткиПартийСверка);		

	ИначеЕсли Вариант = "СверкаСПереоценкой" Тогда	
			
		СтрокиПереоценкиСверка = Неопределено;
		ЗаполнитьНастройкиПартииСверкаСПереоценкой(Настройки, СтрокиПереоценкиСверка);				
		ВнешнийНаборДанных = Новый Структура("ДанныеСверкиСПереоценкой", СтрокиПереоценкиСверка);		
		
	ИначеЕсли Вариант = "СверкаРЕПО" Тогда
		
		ДанныеСверкиПоРЕПО = Неопределено;
		ЗаполнитьНастройкиПартииСверкаРЕПО(Настройки, ДанныеСверкиПоРЕПО);				
		ВнешнийНаборДанных = Новый Структура("ДанныеСверкиПоРЕПО", ДанныеСверкиПоРЕПО);		

	КонецЕсли;
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ОстатокБэкОфис", Новый ОписаниеТипов("Число"));
	
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
	ИмяКолонкиСчетДУ = ИмяКолонкиСчетДоверительногоУправления(ТЗ);
						
	Если ТЗ.Количество() = 0 ИЛИ
		
		//ИТОГО
		(ТЗ.Количество() = 1 И (НЕ ЗначениеЗаполнено(ТЗ[0][ИмяКолонкиСчетДУ]))) Тогда
		       		
		//Группировка по счету
		
		Возврат Истина;
	Иначе
		Возврат Ложь;							
	КонецЕсли;
	
КонецФункции

Функция ИмяКолонкиСчетДоверительногоУправления(ТЗ)
	
	Для Каждого Колонка ИЗ ТЗ.Колонки Цикл
		Если СтрНайти(Колонка.Имя, "СчетДоверительногоУправления") > 0 Тогда
			Возврат Колонка.Имя;
		КонецЕсли;					
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗаписатьРезультатВФайлы(СКД = Неопределено, Настройки = Неопределено, МакетКомпоновки = Неопределено, Постфикс = "", СохранятьРезультатВФайлы = Ложь) Экспорт

	Файл = Новый Файл("\\ap69\Developers\Виктор\КИД\");
	Если Не СохранятьРезультатВФайлы Или Файл.Существует() Тогда
		
		СтруктураХМЛ = Новый Структура;
		
		Если Не СКД = Неопределено Тогда
		
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СКД, "DataCompositionSchema", "http://v8.1c.ru/8.1/data-composition-system/schema");
			СтруктураХМЛ.Вставить("Схема", ЗаписьXML.Закрыть());
		
		КонецЕсли; 
		
		Если Не Настройки = Неопределено Тогда
		
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Настройки, "Settings", "http://v8.1c.ru/8.1/data-composition-system/settings");
			СтруктураХМЛ.Вставить("Настройки", ЗаписьXML.Закрыть());
			
		КонецЕсли;
		
		Если Не МакетКомпоновки = Неопределено Тогда
			
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, МакетКомпоновки, "DataCompositionTemplate", "http://v8.1c.ru/8.1/data-composition-system/composition-template");
			СтруктураХМЛ.Вставить("Макет", ЗаписьXML.Закрыть());
					
		КонецЕсли; 
		
		Если СохранятьРезультатВФайлы Тогда
			
			Для каждого Элемент Из СтруктураХМЛ Цикл
				
				ИмяФайла = Файл.ПолноеИмя + "\" + Элемент.Ключ + ?(Постфикс = "", "", "-" + Постфикс) + ".xml";
				ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
				ЗаписьТекста.Записать(Элемент.Значение);
				ЗаписьТекста.Закрыть();
			
			КонецЦикла; 
		
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СтруктураХМЛ;

КонецФункции

#КонецОбласти
