#Область Оповещения_при_записи_задач

Процедура ОповещенияПриЗаписиЗадач(Источник, Отказ) Экспорт
	
	РеквизитыОповещения = Неопределено;
	
	ЭтоНовыйЭлемент = Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") И Источник.ДополнительныеСвойства.ЭтоНовый;
	
	Если ТипЗнч(Источник) = Тип("ЗадачаОбъект.ОшибкиРегламентыхЗаданий") Тогда
		
		РеквизитыОповещения = Новый Структура("Номер, Дата, Выполнена, ПометкаУдаления, Источник, ТекстЗадачи, ДатаВыполнения, Исполнитель, КомментарийКВыполнению");
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		ЗаменитьНомераЗадачНаСсылки(РеквизитыОповещения.КомментарийКВыполнению);
		
		Если ЗначениеЗаполнено(Источник.Пользователь) Тогда
			Пользователь = "Пользователь: " + Источник.Пользователь + "<br>";
		Иначе
			Пользователь = "";
		КонецЕсли; 
		
		РеквизитыОповещения.Вставить("Пользователь", Пользователь);
		РеквизитыОповещения.Вставить("ТекстЗадачи", "<pre>" + Источник.ТекстЗадачи + "</pre>");
		
		РеквизитыОповещения.Вставить("Ссылка",		  ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Источник));
		РеквизитыОповещения.Вставить("ПохожиеЗадачи", ПолучитьПохожиеЗадачи(Источник));
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ЗадачаОбъект.ЗадачаИсполнителя") 		
		И (ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев")
			Или ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ЗачислениеПаев")
			Или ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ПогашениеПаев")
			Или ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ОбменПаев")) Тогда
			
		Если ЭтоНовыйЭлемент	
			И Источник.ГруппаИсполнителей.Родитель <> ОбщегоНазначения.ПолучитьИменованныйОбъект("СистемныеПользователи") Тогда
			
			РеквизитыОповещения = Новый Структура("Наименование, Дата, Организация, Основание, ТекстЗадачи, Комментарий, ТочкаМаршрута, ГруппаИсполнителей, Выполнена");
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
			РеквизитыОповещения.Вставить("ДополнительныеПолучатели", Задачи.ЗадачаИсполнителя.ПолучитьЭлектронныеАдресаИсполнителейЗадачи(Источник, Отказ));	
			РеквизитыОповещения.Вставить("ЗадачаДляСистемногоПользователя", Ложь);
			
		Иначе
			
			РеквизитыОповещения = Новый Структура("Наименование, Дата, Организация, Основание, ГруппаИсполнителей, ТочкаМаршрута, Выполнена");
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
			РеквизитыОповещения.Вставить("ЗадачаДляСистемногоПользователя", Истина);
						
		КонецЕсли;
		
		ЗаявкаПайщика = ?(ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ЗачислениеПаев"), 
								ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.БизнесПроцесс, "ЗаявкаПайщика"),
								Источник.Основание);
		РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
							ЗаявкаПайщика,
							"Пайщик, ПаевойИнвестиционныйФонд, ВидЗаявки");
							
		РеквизитыОповещения.Вставить("ЗаявкаПайщика",				ЗаявкаПайщика);
		РеквизитыОповещения.Вставить("Пайщик",						РеквизитыЗаявки.Пайщик);
		РеквизитыОповещения.Вставить("ПаевойИнвестиционныйФонд",	РеквизитыЗаявки.ПаевойИнвестиционныйФонд);
		РеквизитыОповещения.Вставить("ВидЗаявки",					РеквизитыЗаявки.ВидЗаявки);
			
		РеквизитыОповещения.Вставить("Ссылка", ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Источник.Ссылка));
		
		РеквизитыОповещения.Вставить("НомерООВП",	Источник.НомерОтчетаОВозможностиЗачисленияПаев);
		РеквизитыОповещения.Вставить("ОтветООВП",	Источник.ОтветОВозможностиЗачисленияПаев);
		РеквизитыОповещения.Вставить("ЕстьООВП",	ЗначениеЗаполнено(Источник.ОтветОВозможностиЗачисленияПаев));
		
		РеквизитыОповещения.Вставить("ЗадачаПоРозницеПИФ", Истина);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ЗадачаОбъект.ЗадачаИсполнителя") Тогда
		
		РеквизитыОповещения = Новый Структура("Номер, Наименование, Дата, ПометкаУдаления, ТочкаМаршрута, Выполнена, Организация, Основание, ДатаВыполнения, ТекстЗадачи, Комментарий, ГруппаИсполнителей, Исполнитель");
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		
		РеквизитыОповещения.Вставить("Ссылка", ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Источник.Ссылка));
		РеквизитыОповещения.Вставить("ДополнительныеПолучатели", Задачи.ЗадачаИсполнителя.ПолучитьЭлектронныеАдресаИсполнителейЗадачи(Источник, Отказ));
		
		Если ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.ОбучениеСотрудников") Тогда
			РеквизитыОповещения.Вставить("ВидПеречня", Источник.Основание.ВидПеречня);
		КонецЕсли;
		
		РеквизитыОповещения.Вставить("ЭтоНовыйЭлемент",	?(ЭтоНовыйЭлемент, "Новая", "Изменилась"));
		РеквизитыОповещения.Вставить("СрокИсполнения",	Формат(Источник.СрокИсполнения, "ДФ=dd.MM.yyyy"));
		
		РеквизитыОповещения.Вставить("ДатаЗадачиБольшеТекущейДаты", Источник.Дата > ТекущаяДата());
		РеквизитыОповещения.Вставить("ИзменилсяИсполнительИлиГруппаИсполнителей", ЭтоНовыйЭлемент);
		
		ЗаполнитьИзмененияРеквизитов(Источник, РеквизитыОповещения);
		
		Если Источник.ДополнительныеСвойства.Свойство("ПредЗначенияРеквизитов") Тогда
			Если Источник.Исполнитель <> Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов.Исполнитель
			 ИЛИ Источник.ГруппаИсполнителей <> Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов.ГруппаИсполнителей Тогда 
				РеквизитыОповещения.Вставить("ИзменилсяИсполнительИлиГруппаИсполнителей", Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РеквизитыОповещения <> Неопределено Тогда
		
		Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиЗадачи, РеквизитыОповещения);
		
		// #ТехДолг
		// Это временное решение. После реализации механизма фиксации формирования и отправки / выгрузки отчетов, код можно удалить
		// Если ошибка содержит упоминание о формировании отчетности, уведомим бухгалтерию
		Если СтрНайти(Источник.ТекстЗадачи, "ВнешняяОбработка._ФормированиеОтчетности") Тогда
			Справочники.Оповещения.СформироватьОповещения("ОповещениеБухгалтерииОбОшибкахПриФормированииОтчетности", Перечисления.ТипыСобытий.ПриЗаписиЗадачи, РеквизитыОповещения);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ОповещенияПриЗаписиЗадач

Процедура ЗаменитьНомераЗадачНаСсылки(КомментарийКВыполнению)

	RegExp = Новый COMОбъект("VBScript.RegExp");
	
	RegExp.Global     = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.MultiLine  = Истина;

	RegExp.Pattern = "#\d{6}";
	Совпадения = RegExp.Execute(КомментарийКВыполнению);

	Ссылка = "<A href=""http://1f.g1.lan/MaintaskForm.aspx?TaskID=НомерЗадачи"">#НомерЗадачи</A>";
	Для Каждого Совпадение Из Совпадения Цикл	
		КомментарийКВыполнению = СтрЗаменить(КомментарийКВыполнению, Совпадение.Value, СтрЗаменить(Ссылка, "НомерЗадачи", Сред(Совпадение.Value, 2)));
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьПохожиеЗадачи(Источник)

	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОшибкиРегламентыхЗаданий.Ссылка КАК Ссылка,
		|	ОшибкиРегламентыхЗаданий.ДатаВыполнения КАК ДатаВыполнения,
		|	ОшибкиРегламентыхЗаданий.Исполнитель КАК Исполнитель,
		|	ОшибкиРегламентыхЗаданий.КомментарийКВыполнению КАК КомментарийКВыполнению,
		|	ОшибкиРегламентыхЗаданий.Выполнена КАК Выполнена,
		|	ОшибкиРегламентыхЗаданий.Дата КАК Дата,
		|	ОшибкиРегламентыхЗаданий.Номер КАК Номер
		|ПОМЕСТИТЬ _ПохожиеЗадачи
		|ИЗ
		|	Задача.ОшибкиРегламентыхЗаданий КАК ОшибкиРегламентыхЗаданий
		|ГДЕ
		|	ОшибкиРегламентыхЗаданий.ТекстЗадачи ПОДОБНО &ТекстЗадачи + ""%"" СПЕЦСИМВОЛ ""/""
		|	И ОшибкиРегламентыхЗаданий.Ссылка <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПохожиеЗадачи.ВсегоПохожих КАК ВсегоПохожих,
		|	ПоследняяВыполненная.ДатаВыполнения КАК ДатаВыполнения,
		|	ПоследняяВыполненная.Исполнитель КАК Исполнитель,
		|	ПоследняяВыполненная.КомментарийКВыполнению КАК КомментарийКВыполнению,
		|	ЕСТЬNULL(Пользователи.АдресЭлектроннойПочты, """") КАК АдресЭлектроннойПочты,
		|	ПоследняяВыполненная.Ссылка КАК Ссылка,
		|	ПоследняяВыполненная.Дата КАК Дата,
		|	ПоследняяВыполненная.Номер КАК Номер
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПохожиеЗадачи.Ссылка) КАК ВсегоПохожих
		|	ИЗ
		|		_ПохожиеЗадачи КАК _ПохожиеЗадачи) КАК ПохожиеЗадачи
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			_ПохожиеЗадачи.ДатаВыполнения КАК ДатаВыполнения,
		|			_ПохожиеЗадачи.Исполнитель КАК Исполнитель,
		|			_ПохожиеЗадачи.КомментарийКВыполнению КАК КомментарийКВыполнению,
		|			_ПохожиеЗадачи.Ссылка КАК Ссылка,
		|			_ПохожиеЗадачи.Дата КАК Дата,
		|			_ПохожиеЗадачи.Номер КАК Номер
		|		ИЗ
		|			_ПохожиеЗадачи КАК _ПохожиеЗадачи
		|		ГДЕ
		|			_ПохожиеЗадачи.Выполнена
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			ДатаВыполнения УБЫВ) КАК ПоследняяВыполненная
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО (ПоследняяВыполненная.Исполнитель = Пользователи.Ссылка)";		
	#КонецОбласти 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ТекстЗадачи = Источник.ТекстЗадачи;
	СпецСимволы = Новый Массив;
	СпецСимволы.Добавить("[");
	СпецСимволы.Добавить("]");
	СпецСимволы.Добавить("%");
	СпецСимволы.Добавить("_");
	Для каждого СпецСимвол Из СпецСимволы Цикл
		ТекстЗадачи = СтрЗаменить(ТекстЗадачи, СпецСимвол, "/" + СпецСимвол);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ТекстЗадачи", Лев(ТекстЗадачи, 1000));
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ВсегоПохожих > 0 Тогда
		
		Если Не Выборка.Исполнитель = Null Тогда
			
			ПохожиеЗадачи = "Параметры последней" 
				+ ?(Выборка.ВсегоПохожих > 1, " (из " + Выборка.ВсегоПохожих + ")", "") 
				+ " похожей ошибки " + ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Выборка) + Символы.ПС
				+ "Исполнитель: " + Выборка.Исполнитель + " (" + Выборка.АдресЭлектроннойПочты + ")" + Символы.ПС
				+ "Дата выполнения: " + Выборка.ДатаВыполнения + Символы.ПС
				+ "Комментарий к выполнению: " + Выборка.КомментарийКВыполнению;
				
			ЗаменитьНомераЗадачНаСсылки(ПохожиеЗадачи);
			
		Иначе
			
			ПохожиеЗадачи = "Похожих ошибок " + Символ(8211) + " " + Выборка.ВсегоПохожих + ", отработанные похожие ошибки отсутствуют";
						
		КонецЕсли; 		
		
	Иначе
		
		ПохожиеЗадачи = "Похожие ошибки не найдены";
		
	КонецЕсли;
	
	Возврат СтрЗаменить(ПохожиеЗадачи, Символы.ПС, "<br>");
	
КонецФункции

#КонецОбласти 

Процедура ОповещенияПриПроведенииДокументов(Источник, Отказ, РежимПроведения) Экспорт
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	
	Если ДополнительныеСвойства.Свойство("ГрупповоеПроведение") И ДополнительныеСвойства.ГрупповоеПроведение = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовыйДокумент		= ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый
			Или ДополнительныеСвойства.Свойство("ЗагрузкаБанковскойВыписки") И ДополнительныеСвойства.ЗагрузкаБанковскойВыписки;
			
	ЭтоПервыйВводАктивов 	= ДополнительныеСвойства.Свойство("ЭтоПервыйВводАктивов") И ДополнительныеСвойства.ЭтоПервыйВводАктивов;
	ЭтоПервоеПроведение		= (ЭтоНовыйДокумент
								ИЛИ ДополнительныеСвойства.Свойство("ПредЗначенияРеквизитовШапки") 
									И ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.Свойство("Проведен") 
									И НЕ ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.Проведен);
									
	ИзмененныеРеквизиты = Новый Массив;
	
	// Оповестим о проведении документов после расторжения договора д/у
	Если Не ДополнительныеСвойства.Свойство("НеОповещатьПриПроведенииДокументаПослеРасторженияДоговора") Тогда
		ОповещенияПриПроведенииДокументовПослеРасторженияДоговора(Источник);
	КонецЕсли;
	
	// Заполним персонифицированные реквизиты, зависящие от вида обрабатываемого документа
	
	РеквизитыОповещения = Неопределено;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ВводДенежныхСредств")
			Или ТипЗнч(Источник) = Тип("ДокументОбъект.ВыводДенежныхСредств")
	Тогда
	
		Если Не ЭтоНовыйДокумент
				И Не РаботаСДокументами.ИзмененыРеквизитыШапкиДокумента(Источник, "Дата, СчетДоверительногоУправления, Сумма")
				И Источник.РасчетныйСчет.Валюта = ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.РасчетныйСчет.Валюта
		Тогда
			Возврат;
		КонецЕсли;
		
		РеквизитыОповещения = Новый Структура;
		РеквизитыОповещения.Вставить("ВидДвиженияДС"	, ?(ТипЗнч(Источник) = Тип("ДокументОбъект.ВводДенежныхСредств"), "ввод д/с", "вывод д/с"));
		РеквизитыОповещения.Вставить("Сумма"			, Источник.Сумма);
		РеквизитыОповещения.Вставить("Валюта"			, Источник.РасчетныйСчет.Валюта);
		
		РеквизитыСчета = Новый Структура("НомерСчета, Валюта, Банк, БанкДляРасчетов");
		ЗаполнитьЗначенияСвойств(РеквизитыСчета, Источник.РасчетныйСчет);		
		РеквизитыОповещения.Вставить("РасчетныйСчет"	, Справочники.БанковскиеСчета.СформироватьНаименование(РеквизитыСчета));
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ВводДенежныхСредств") Тогда
			РеквизитыКлиента = Справочники.СчетаДоверительногоУправления.ПолучитьРеквизитыКлиента(Источник.СчетДоверительногоУправления, Источник.Дата);
			РеквизитыОповещения.Вставить("Клиент", РеквизитыКлиента.ПолноеНаименование);
			РеквизитыОповещения.Вставить("ДополнительныеПолучатели", РеквизитыКлиента.АдресЭлектроннойПочты);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ВводКредитногоИнструмента")
			Или ТипЗнч(Источник) = Тип("ДокументОбъект.ВыводКредитногоИнструмента")
	Тогда
		ЭтоДепозитныйВклад = ТипЗнч(Источник.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
		Если ЭтоДепозитныйВклад Тогда
			РеквизитыОповещения = Новый Структура("КредитныйИнструмент, СуммаПроцентов");
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
			
			РеквизитыОповещения.Вставить("ЭтоВводДепозитногоВклада"	, ?(ТипЗнч(Источник) = Тип("ДокументОбъект.ВводКредитногоИнструмента"), " ввод " + ?(ЭтоДепозитныйВклад,"депозитного вклада ", "займа "), " вывод "+?(ЭтоДепозитныйВклад,"депозитного вклада ", "займа ")) );
			РеквизитыОповещения.Вставить("Номинал"					, РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(Источник.КредитныйИнструмент, Новый Граница(Источник.МоментВремени(), ВидГраницы.Включая)).Номинал);
			РеквизитыОповещения.Вставить("Валюта"					, Источник.КредитныйИнструмент.БанковскийСчет.Валюта);
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ВводЦенныхБумаг")
			Или ТипЗнч(Источник) = Тип("ДокументОбъект.ВыводЦенныхБумаг")
	Тогда
		ЭтоВводЦенныхБумаг = (ТипЗнч(Источник) = Тип("ДокументОбъект.ВводЦенныхБумаг"));		
		
		РеквизитыОповещения = Новый Структура;
		РеквизитыОповещения.Вставить("ЭтоВводЦенныхБумаг"	, ?(ЭтоВводЦенныхБумаг, "ввод ц/б", "вывод ц/б"));
		РеквизитыОповещения.Вставить("Сумма"				, ?(ЭтоВводЦенныхБумаг, Источник.ЦенныеБумаги.Итог("Сумма"), Источник.ЦенныеБумаги.Итог("СуммаРынок")));		

	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РазмещениеКредитногоИнструмента")
		И ПараметрыСеанса.ФормированиеДвиженийПоРегистрамБэкОфиса	// только при бэкофисном проведении
		И (ЭтоНовыйДокумент ИЛИ РаботаСДокументами.ИзмененыРеквизитыШапкиДокумента(Источник, "Дата, СчетДоверительногоУправления, КредитныйИнструмент, Сумма")) Тогда 
		
		РеквизитыОповещения = Новый Структура;
		РеквизитыОповещения.Вставить("КредитныйИнструмент", Источник.КредитныйИнструмент);
		РеквизитыОповещения.Вставить("Сумма",				Источник.Сумма);
		РеквизитыОповещения.Вставить("Довнесение",			Источник.Довнесение);
		
		Если ЭтоНовыйДокумент ИЛИ Источник.СчетДоверительногоУправления = ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.СчетДоверительногоУправления Тогда
			РеквизитыОповещения.Вставить("СчетДоверительногоУправленияСтарый",	"");
		Иначе
			РеквизитыОповещения.Вставить("СчетДоверительногоУправленияСтарый",	ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.СчетДоверительногоУправления);
		КонецЕсли;
		Если ЭтоНовыйДокумент ИЛИ Источник.КредитныйИнструмент = ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.КредитныйИнструмент Тогда
			РеквизитыОповещения.Вставить("КредитныйИнструментСтарый",			"");
		Иначе
			РеквизитыОповещения.Вставить("КредитныйИнструментСтарый",			ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.КредитныйИнструмент);
		КонецЕсли;
		Если ЭтоНовыйДокумент ИЛИ Источник.Сумма = ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.Сумма Тогда
			РеквизитыОповещения.Вставить("СуммаСтарая",			"");
		Иначе
			РеквизитыОповещения.Вставить("СуммаСтарая",							ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.Сумма);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Оплата") Тогда
		
		РеквизитыОповещения = Новый Структура;
		
		СуммаОплаты = Источник.Основания.Итог("Сумма") + Источник.Основания.Итог("СуммаОплатыКупона");
		
		РеквизитыОповещения.Вставить("ВидЗадолженности"			, Источник.ВидЗадолженности);
		РеквизитыОповещения.Вставить("ВидЗадолженностиРодитель"	, Источник.ВидЗадолженности.Родитель);
		РеквизитыОповещения.Вставить("Сумма"					, СуммаОплаты);
		РеквизитыОповещения.Вставить("Валюта"					, Источник.ВалютаОплаты);
		РеквизитыОповещения.Вставить("Контрагент"				, Источник.Контрагент);
		РеквизитыОповещения.Вставить("ВидЮрФизЛица"				, Источник.Контрагент.ВидЮрФизЛица);
		РеквизитыОповещения.Вставить("ВидДвижения"				, Источник.ВидДвижения);
		
		Если Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовАкции
			ИЛИ Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки
			ИЛИ Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия
			ИЛИ Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовПаи Тогда
			
			//Определим задолженность.
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Валюта = ОплатаОснования.Ссылка.ВалютаОплаты
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
			|			ИНАЧЕ (ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток) * КурсыВалют.Курс / КурсыВалют.Кратность / КурсыВалютОплаты.Курс * КурсыВалютОплаты.Кратность
			|		КОНЕЦ) КАК СуммаЗадолженности,
			|	СУММА(ОплатаОснования.СуммаОплаты + ОплатаОснования.СуммаОплатыКупона) КАК СуммаОплаты,
			|	НачислениеДивидендов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК РезидентРФ
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&Период,
			|			ВидЗадолженности = &ВидЗадолженности
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И Основание В
			|					(ВЫБРАТЬ
			|						Документ.Оплата.Основания.Основание
			|					ИЗ
			|						Документ.Оплата.Основания
			|					ГДЕ
			|						Документ.Оплата.Основания.Ссылка = &Оплата)) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
			|			И (КурсыВалют.Период = &ПериодДень)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютОплаты
			|			ПО ОплатаОснования.Ссылка.ВалютаОплаты = КурсыВалютОплаты.Валюта
			|				И (КурсыВалютОплаты.Период = &ПериодДень)
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = ОплатаОснования.Основание
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних КАК РеквизитыПИФСрезПоследних
			|			ПО (НачислениеДивидендов.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи))
			|				И (ВЫРАЗИТЬ(НачислениеДивидендов.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних КАК РеквизитыЮридическихЛицСрезПоследних
			|			ПО (ВЫБОР
			|					КОГДА НачислениеДивидендов.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
			|						ТОГДА ВЫРАЗИТЬ(НачислениеДивидендов.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
			|					КОГДА НачислениеДивидендов.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
			|						ТОГДА ВЫРАЗИТЬ(НачислениеДивидендов.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
			|					КОГДА НачислениеДивидендов.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
			|						ТОГДА ВЫРАЗИТЬ(НачислениеДивидендов.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
			|					КОГДА НачислениеДивидендов.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
			|						ТОГДА ВЫРАЗИТЬ(НачислениеДивидендов.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
			|					КОГДА НачислениеДивидендов.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
			|						ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
			|				КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
			|				И (РеквизитыЮридическихЛицСрезПоследних.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = НачислениеДивидендов.Ссылка
			|ГДЕ
			|	ОплатаОснования.Ссылка = &Оплата
			|
			|СГРУППИРОВАТЬ ПО
			|	НачислениеДивидендов.ЦеннаяБумага,
			|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ";
			
			Запрос.УстановитьПараметр("ВидЗадолженности", Источник.ВидЗадолженности);
			Запрос.УстановитьПараметр("Оплата", Источник.Ссылка);
 			Запрос.УстановитьПараметр("Период", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая)); 
			Запрос.УстановитьПараметр("ПериодДень", НачалоДня(Источник.Дата));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда   
				Если МатематическиеФункции.МодульЧисла(Выборка.СуммаЗадолженности - Выборка.СуммаОплаты) <= 0.01 
					ИЛИ НЕ Выборка.РезидентРФ Тогда  
					РеквизитыОповещения.Вставить("ВажноДляНДФЛ", Истина);
				
				Текст = "УК: " + Источник.Организация + "
				|Документ: " + Источник + "
				|Клиент: " + Источник.СчетДоверительногоУправления + "
				|Сумма задолженности: " + Выборка.СуммаЗадолженности + "
				|Сумма оплаты:        " + Выборка.СуммаОплаты + "
				|Ценная бумага:       " + Выборка.ЦеннаяБумага + "
				|" + ?(Выборка.РезидентРФ, "", "Эмитент не является резидентом РФ.");

				РеквизитыОповещения.Вставить("Текст", Текст);
			КонецЕсли;
		КонецЕсли;
			
		КонецЕсли;	
		Если ДополнительныеСвойства.Свойство("ПредЗначенияРеквизитовШапки") Тогда
			ПредОснования	= ДополнительныеСвойства.ПредЗначенияРеквизитовШапки.Основания.Выгрузить();
			ПредСуммаОплаты	= ПредОснования.Итог("Сумма") + ПредОснования.Итог("СуммаОплатыКупона");
			Если ПредСуммаОплаты <> СуммаОплаты Тогда
				СтруктураИзмененияРеквизита = Новый Структура;
				СтруктураИзмененияРеквизита.Вставить("Ключ"			, "Сумма");
				СтруктураИзмененияРеквизита.Вставить("Значение"		, СуммаОплаты);
				СтруктураИзмененияРеквизита.Вставить("ПредЗначение"	, ПредСуммаОплаты);
				ИзмененныеРеквизиты.Добавить(СтруктураИзмененияРеквизита);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.АнкетаФизическогоЛица") Тогда
		
		РеквизитыОповещения = Новый Структура(	
			"РезидентРФ,
			|НалоговыйРезидентИностранногоГосударства,
			|РезидентПо173ФЗ,
			|РаспространениеЗаконодательстваСША,
			|ИностранныйНалогоплательщик,
			|СогласиеНаПередачуИнформации,
			|ЮрФизЛицо,
			|ДатаСмерти");
		
		
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		
		
		РеквизитыОповещения.Вставить("ЕстьАдресФактическогоПроживанияВИностранномГосударстве"	, ЗначениеЗаполнено(Источник.АдресФактическогоПроживанияВИностранномГосударстве));
		РеквизитыОповещения.Вставить("ЕстьАдресПочтовыйВИностранномГосударстве"					, ЗначениеЗаполнено(Источник.АдресПочтовыйВИностранномГосударстве));
		РеквизитыОповещения.Вставить("ЕстьАдресДоВостребованияВИностранномГосударстве"			, ЗначениеЗаполнено(Источник.АдресДоВостребованияВИностранномГосударстве));
		
		РеквизитыОповещения.Вставить("ОписаниеНестандартныхДанных", Новый Массив);
		
		СтандартныеДанные = Новый ТаблицаЗначений;
		СтандартныеДанные.Колонки.Добавить("Значение"		, Новый ОписаниеТипов("Булево"));
		СтандартныеДанные.Колонки.Добавить("Ключ"			, Новый ОписаниеТипов("Строка"));
		СтандартныеДанные.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
		
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Истина	, "РезидентРФ", "Являетесь ли Вы налоговым резидентом Российской Федерации?"));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Ложь	, "НалоговыйРезидентИностранногоГосударства", "Являетесь ли Вы налоговым резидентом иностранного государства?"));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Истина	, "РезидентПо173ФЗ", "Являетесь ли Вы резидентом в соответствии с Федеральным законом от 10 декабря 2003 года №173-ФЗ «О валютном регулировании и валютном контроле»? "));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Ложь	, "РаспространениеЗаконодательстваСША", "Являетесь ли Вы лицом, на которое распространяется законодательство США о налогообложении иностранных счетов (налогоплательщиком США)?"));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Ложь	, "ИностранныйНалогоплательщик", "Имеются ли иные основания для отнесения Вас к категории иностранных налогоплательщиков?"));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Истина	, "СогласиеНаПередачуИнформации", "Даете ли Вы согласие на передачу информации  о Вас, как о лице, на которое распространяется законодательство иностранного государства?"));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Ложь	, "ЕстьАдресФактическогоПроживанияВИностранномГосударстве", "Сведения о наличии адреса фактического проживания в иностранном государстве?"));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Ложь	, "ЕстьАдресПочтовыйВИностранномГосударстве", "Имеется ли у Вас  почтовый адрес в иностранном государстве"));
		ЗаполнитьЗначенияСвойств(СтандартныеДанные.Добавить(), Новый Структура("Значение, Ключ, Представление", Ложь	, "ЕстьАдресДоВостребованияВИностранномГосударстве", "Имеется ли у Вас адрес до востребования в иностранном государстве?"));
		
		Для Каждого ЭлементСтандартныхДанных Из СтандартныеДанные Цикл
			Если ЭлементСтандартныхДанных.Значение <> РеквизитыОповещения[ЭлементСтандартныхДанных.Ключ] Тогда
				РеквизитыОповещения.ОписаниеНестандартныхДанных.Добавить(ЭлементСтандартныхДанных.Представление + " Ответ: " + РеквизитыОповещения[ЭлементСтандартныхДанных.Ключ]);
			КонецЕсли;
		КонецЦикла;
		
		РеквизитыОповещения.Вставить("НестандартныеДанные", РеквизитыОповещения.ОписаниеНестандартныхДанных.Количество() <> 0);
		РеквизитыОповещения.ОписаниеНестандартныхДанных = СтрСоединить(РеквизитыОповещения.ОписаниеНестандартныхДанных, "<p>" + Символы.ПС + "</p>");
		
		РеквизитыОповещения.Вставить("ЗагрузкаДанныхВАнкету", ДополнительныеСвойства.Свойство("ЗагрузкаДанныхВАнкету") И ДополнительныеСвойства.ЗагрузкаДанныхВАнкету);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ВходящийДокумент") И Источник.Статус = Перечисления.СтатусыВходящихДокументов.НаРегистрации Тогда
		РеквизитыОповещения = Новый Структура("Номер, Отправитель, НомерВходящегоДокумента");
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		РеквизитыОповещения.Вставить("ДатаВходящегоДокумента", Формат(Источник.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"));
								
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоручениеНаДвижениеЦенныхБумаг") Тогда
		
		РеквизитыОповещения = ПолучитьРеквизитыДляПоручений(Источник);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.НачислениеЗадолженности") Тогда  
		
		РеквизитыОповещения = Новый Структура;
		
		Сумма = Источник.Основания.Итог("Сумма");
		
		РеквизитыОповещения.Вставить("ВидЗадолженности"			, Источник.ВидЗадолженности);
		РеквизитыОповещения.Вставить("Сумма"					, Сумма);
		РеквизитыОповещения.Вставить("Валюта"					, Источник.Валюта);
		РеквизитыОповещения.Вставить("Контрагент"				, Источник.Контрагент);
		РеквизитыОповещения.Вставить("ВидЮрФизЛица"				, Источник.Контрагент.ВидЮрФизЛица);
	КонецЕсли;
	
	// получим и обработаем оповещения
	
	Если РеквизитыОповещения <> Неопределено Тогда
		
		РеквизитыОповещения.Вставить("ЭтоНовыйДокумент"		, ?(ЭтоНовыйДокумент, "Новый", "Изменен"));
		РеквизитыОповещения.Вставить("ПервоеПроведение"		, ЭтоПервоеПроведение);
		РеквизитыОповещения.Вставить("ЭтоПервыйВводАктивов"	, ?(ЭтоПервыйВводАктивов, "Первый ввод активов", ""));
		РеквизитыОповещения.Вставить("Источник", Источник);
		
		//Изменение значений реквизитов шапки
		Если ДополнительныеСвойства.Свойство("ПредЗначенияРеквизитовШапки") Тогда
			Для Каждого Реквизит Из ДополнительныеСвойства.ПредЗначенияРеквизитовШапки Цикл
				Если ТипЗнч(Реквизит.Значение) <> Тип("РезультатЗапроса") Тогда //Табличная часть
					Если Источник[Реквизит.Ключ] <> Реквизит.Значение Тогда
						СтруктураИзмененияРеквизита = Новый Структура;
						СтруктураИзмененияРеквизита.Вставить("Ключ"			, Реквизит.Ключ);
						СтруктураИзмененияРеквизита.Вставить("Значение"		, Источник[Реквизит.Ключ]);
						СтруктураИзмененияРеквизита.Вставить("ПредЗначение"	, Реквизит.Значение);
						ИзмененныеРеквизиты.Добавить(СтруктураИзмененияРеквизита);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		РеквизитыОповещения.Вставить("ИзмененныеРеквизиты", ИзмененныеРеквизиты);
		
		// дополним реквизиты оповещения общими свойствами
		РеквизитыОповещения.Вставить("Дата");
		РеквизитыОповещения.Вставить("Организация");
		РеквизитыОповещения.Вставить("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
		РеквизитыОповещения.Вставить("Комментарий");
		
		Если Источник.Метаданные().Реквизиты.Найти("СчетДоверительногоУправления") <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник, "Дата, Организация, СчетДоверительногоУправления, Комментарий");
			
			// агентская схема
			АгентскийДоговор = РеквизитыОповещения.СчетДоверительногоУправления.АгентскийДоговор;
			
			РеквизитыОповещения.Вставить("АгентскийДоговор", АгентскийДоговор);
			РеквизитыОповещения.Вставить("Агент", ?(ЗначениеЗаполнено(АгентскийДоговор.Контрагент), АгентскийДоговор.Контрагент, "без агента"));
			
			// реквизиты счета д/у
			РеквизитыСчетаДоверительногоУправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыОповещения.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления, НомерДоговора, ДатаЗаключения");
			
			РеквизитыОповещения.Вставить("ВидДоговораДоверительногоУправления",   РеквизитыСчетаДоверительногоУправления.ВидДоговораДоверительногоУправления);
			РеквизитыОповещения.Вставить("НомерДоговораДоверительногоУправления", РеквизитыСчетаДоверительногоУправления.НомерДоговора);
			РеквизитыОповещения.Вставить("ДатаДоговораДоверительногоУправления",  Формат(РеквизитыСчетаДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy"));

		Иначе
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник, "Дата, Организация, Комментарий");
		КонецЕсли;
		
		Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриПроведенииДокумента, РеквизитыОповещения);
		
	КонецЕсли;

КонецПроцедуры // ОповещенияПриПроведенииДокументов

Процедура ОповещенияПриЗаписиДокументов(Источник, Отказ) Экспорт
	
	Если Источник.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	#Область Оповещение_о_некорректном_времени_документа
	
	// Проверяем документы бэк-офиса, кроме корректировок регистров.
	// Время документов должно быть в диапазоне рабочих часов.
	// Если не так, формируем оповещение
	
	РабочееВремя = РаботаСДокументами.ПериодРабочегоВремениДня();
	
	НачалоДняДокумента = НачалоДня(Источник.Дата);
	
	// Время в рабочих границах, не нужно проверять
	Если Источник.Дата >= НачалоДняДокумента + РабочееВремя.ВремяНачала
		И Источник.Дата <= НачалоДняДокумента + РабочееВремя.ВремяОкончания Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВидовДокументовБэкОфиса = РаботаСМетаданнымиПовтИсп.ЗначенияПеречисленияВСтруктуру("ВидыОперацийБэкОфиса");
	СтруктураВидовДокументовБэкОфиса.Удалить("КорректировкаРегистров");
	
	ИмяДокумента = Источник.Метаданные().Имя;
	
	// Проверяем, что это документ бэк-офиса, тогда формируем оповещение
	Если СтруктураВидовДокументовБэкОфиса.Свойство(ИмяДокумента) Тогда
			
		РеквизитыОповещения = Новый Структура;
		РеквизитыОповещения.Вставить("Тема"	, 		"Неверное время документа");
		РеквизитыОповещения.Вставить("Текст", 		СтрШаблон("Время '%1' документа '%2' за пределами рабочих часов", Формат(Источник.Дата, "ДЛФ=T"), СокрЛП(Источник)));
		РеквизитыОповещения.Вставить("Организация", Источник.Организация);
		
		Справочники.Оповещения.СформироватьОповещения("Документ", Перечисления.ТипыСобытий.ПриЗаписиДокумента, РеквизитыОповещения);
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры // ОповещенияПриЗаписиДокументов

Процедура ОповещенияПриПроведенииДокументовПослеРасторженияДоговора(Источник)
	
	Если Источник.Метаданные().Реквизиты.Найти("СчетДоверительногоУправления") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСчетаДУ = Кэширование.РеквизитыСчетаДоверительногоУправления(Источник.СчетДоверительногоУправления);
	
	Если ЗначениеЗаполнено(РеквизитыСчетаДУ.ДатаРасторжения) И РеквизитыСчетаДУ.ДатаРасторжения < НачалоДня(Источник.Дата) Тогда
		
		РеквизитыОповещения = Новый Структура("Источник, Дата, Организация, СчетДоверительногоУправления, ДатаРасторжения", Источник);
		
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник,			"Дата, Организация, СчетДоверительногоУправления");
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, РеквизитыСчетаДУ, "ДатаРасторжения");
		
		Справочники.Оповещения.СформироватьОповещения(
			"РаботаСПодпискамиНаСобытия.ОповещенияПриПроведенииДокументовПослеРасторженияДоговора", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещенияПриЗаписиРегистровСведений(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.Количество() = 0
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.ДоговорыСчетовДоверительногоУправления") 
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.ЛицензииДоговоровДоверительногоУправления")
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.ДокументыЮридическихЛиц")
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.ВхожденияВРеестры") 
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛиц") 
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛицАнкетные") 
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.РеквизитыФизическихЛицАнкетные") 
		И ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.РеквизитыСотрудниковОрганизации") Тогда // запись пустого набора
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	
	Если ДополнительныеСвойства.Свойство("ГрупповоеПроведение") И ДополнительныеСвойства.ГрупповоеПроведение = Истина Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОповещения = Неопределено;
	
	// Получим и обработаем оповещения
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.КодыСчетовДоверительногоУправленияУБрокеров") Тогда
		
		#Область КодыСчетовДоверительногоУправленияУБрокеров
		
		Если Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("КодыУБрокераПередЗаписью") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НаборЗаписей.Период КАК Период,
				|	НаборЗаписей.Организация КАК Организация,
				|	НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	НаборЗаписей.Брокер КАК Брокер,
				|	НаборЗаписей.Код КАК Код,
				|	НаборЗаписей.КодFORTS КАК КодFORTS
				|ПОМЕСТИТЬ _НаборЗаписей
				|ИЗ
				|	&НаборЗаписей КАК НаборЗаписей
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КодыУБрокераПередЗаписью.Период КАК Период,
				|	КодыУБрокераПередЗаписью.Организация КАК Организация,
				|	КодыУБрокераПередЗаписью.Брокер КАК Брокер,
				|	КодыУБрокераПередЗаписью.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	КодыУБрокераПередЗаписью.Код КАК Код,
				|	КодыУБрокераПередЗаписью.КодFORTS КАК КодFORTS
				|ПОМЕСТИТЬ _КодыУБрокераПередЗаписью
				|ИЗ
				|	&КодыУБрокераПередЗаписью КАК КодыУБрокераПередЗаписью
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕСТЬNULL(_НаборЗаписей.Период, _КодыУБрокераПередЗаписью.Период) КАК Период,
				|	ЕСТЬNULL(_НаборЗаписей.Организация, _КодыУБрокераПередЗаписью.Организация) КАК Организация,
				|	ЕСТЬNULL(_НаборЗаписей.СчетДоверительногоУправления, _КодыУБрокераПередЗаписью.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
				|	ЕСТЬNULL(_НаборЗаписей.Брокер, _КодыУБрокераПередЗаписью.Брокер) КАК Брокер,
				|	ЕСТЬNULL(_НаборЗаписей.Код, """") КАК Код,
				|	ЕСТЬNULL(_КодыУБрокераПередЗаписью.Код, """") КАК КодПередЗаписью,
				|	ЕСТЬNULL(_НаборЗаписей.КодFORTS, """") КАК КодFORTS,
				|	ЕСТЬNULL(_КодыУБрокераПередЗаписью.КодFORTS, """") КАК КодFORTSПередЗаписью,
				|	ВЫБОР
				|		КОГДА _КодыУБрокераПередЗаписью.Код ЕСТЬ NULL
				|			ТОГДА 1
				|		КОГДА _НаборЗаписей.Код ЕСТЬ NULL
				|			ТОГДА 3
				|		ИНАЧЕ 2
				|	КОНЕЦ КАК ВидИзменения
				|ИЗ
				|	_НаборЗаписей КАК _НаборЗаписей
				|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыУБрокераПередЗаписью КАК _КодыУБрокераПередЗаписью
				|		ПО _НаборЗаписей.Период = _КодыУБрокераПередЗаписью.Период
				|			И _НаборЗаписей.Организация = _КодыУБрокераПередЗаписью.Организация
				|			И _НаборЗаписей.СчетДоверительногоУправления = _КодыУБрокераПередЗаписью.СчетДоверительногоУправления
				|			И _НаборЗаписей.Брокер = _КодыУБрокераПередЗаписью.Брокер
				|ГДЕ
				|	(ЕСТЬNULL(_НаборЗаписей.Код, """") <> ЕСТЬNULL(_КодыУБрокераПередЗаписью.Код, """")
				|			ИЛИ ЕСТЬNULL(_НаборЗаписей.КодFORTS, """") <> ЕСТЬNULL(_КодыУБрокераПередЗаписью.КодFORTS, """"))
				|ИТОГИ ПО
				|	Организация";
			
			Запрос.УстановитьПараметр("НаборЗаписей"            , Источник.Выгрузить());
			Запрос.УстановитьПараметр("КодыУБрокераПередЗаписью", Источник.ЗаписьИсторииДанных.ДополнительныеДанные.КодыУБрокераПередЗаписью);
							
			ВыборкаПоОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоОрганизации.Следующий() Цикл
				
				СтрокиОповещения = Новый Массив;
				
				Выборка = ВыборкаПоОрганизации.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ОписаниеИзменений = "";
					Если      Выборка.ВидИзменения = 1 Тогда
						ОписаниеИзменений = "добавлен новый код """ + Выборка.Код + """, код FORTS """ + Выборка.КодFORTS + """";
					ИначеЕсли Выборка.ВидИзменения = 3 Тогда
						// отловить удаление записей из формы списка здесь не получится, но по задаче это и не требуется
						ОписаниеИзменений = "удален код """ + Выборка.Код + """, код FORTS """ + Выборка.КодFORTS + """";
					ИначеЕсли Выборка.ВидИзменения = 2 Тогда
						Если Выборка.КодПередЗаписью <> Выборка.Код Тогда
							ОписаниеИзменений = "код """ + Выборка.КодПередЗаписью + """ изменен на """ + Выборка.Код + """";
						КонецЕсли;
						Если Выборка.КодFORTSПередЗаписью <> Выборка.КодFORTS Тогда
							ОписаниеИзменений = ОписаниеИзменений + ?(ПустаяСтрока(ОписаниеИзменений), "код", " и код")
								+ " FORTS """ + Выборка.КодFORTSПередЗаписью + """ изменен на """ + Выборка.КодFORTS + """";
						КонецЕсли;
					Иначе
						ВызватьИсключение "Не удалось определить вид изменения кода счета д/у у брокера";
					КонецЕсли;
					
					СтрокиОповещения.Добавить(
						СтрШаблон("По клиенту %1 (%2) по брокеру %3 на дату %4 ",
							Выборка.СчетДоверительногоУправления,
							Выборка.Организация,
							Выборка.Брокер,
							Формат(Выборка.Период, "ДФ=dd.MM.yyyy")
						) + ОписаниеИзменений
					);
					
				КонецЦикла;
				
				Справочники.Оповещения.СформироватьОповещения(
					Источник.Метаданные().ПолноеИмя(),
					Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений,
					Новый Структура("Организация, Текст", ВыборкаПоОрганизации.Организация, СтрСоединить(СтрокиОповещения, Символы.ПС))
				);
	
			КонецЦикла;
			
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ЖурналСверкиСоСписками") Тогда
		
		#Область ЖурналСверкиСоСписками
		
		ЭтоПроверкаСМЭВ = Источник.Отбор.ВидПеречня.Значение = Справочники.ВидыПеречнейОбъектов.СМЭВ;
		// нас интересуют только не прошедшие проверку
		Если ЭтоПроверкаСМЭВ Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НаборЗаписей", Источник.Выгрузить());
			#Область ТекстЗапроса
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НаборЗаписей.Период КАК Период,
				|	НаборЗаписей.Организация КАК Организация,
				|	НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
				|	НаборЗаписей.ВидПеречня КАК ВидПеречня,
				|	НаборЗаписей.Пройдена КАК Пройдена,
				|	НаборЗаписей.ДатаПоследнейСверки КАК ДатаПоследнейСверки,
				|	НаборЗаписей.Ответственный КАК Ответственный,
				|	НаборЗаписей.ИдентификаторПакета КАК ИдентификаторПакета,
				|	НаборЗаписей.Статус КАК Статус,
				|	НаборЗаписей.РеквизитыСверки КАК РеквизитыСверки,
				|	ВЫРАЗИТЬ(НаборЗаписей.Комментарий КАК СТРОКА(1024)) КАК Комментарий
				|ПОМЕСТИТЬ _НаборЗаписей
				|ИЗ
				|	&НаборЗаписей КАК НаборЗаписей
				|ГДЕ
				|	НаборЗаписей.Пройдена
				|	И НаборЗаписей.Статус <> ""VALID""
				|	И НаборЗаписей.ИдентификаторПакета <> """"
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	_НаборЗаписей.Период КАК Период,
				|	_НаборЗаписей.Организация КАК Организация,
				|	_НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
				|	_НаборЗаписей.ВидПеречня КАК ВидПеречня,
				|	_НаборЗаписей.Пройдена КАК Пройдена,
				|	_НаборЗаписей.ДатаПоследнейСверки КАК ДатаПоследнейСверки,
				|	_НаборЗаписей.Ответственный КАК Ответственный,
				|	_НаборЗаписей.ИдентификаторПакета КАК ИдентификаторПакета,
				|	_НаборЗаписей.Статус КАК Статус,
				|	_НаборЗаписей.Комментарий КАК Комментарий,
				|	АнкетаЮридическогоЛица.ЮрФизЛицо КАК Представитель,
				|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ВидУчастника КАК ВидУчастника
				|ПОМЕСТИТЬ _ПредставителиВыгодоприобретатели
				|ИЗ
				|	_НаборЗаписей КАК _НаборЗаписей
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаЮридическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаЮридическогоЛица КАК АнкетаЮридическогоЛица
				|			ПО АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка = АнкетаЮридическогоЛица.Ссылка
				|		ПО _НаборЗаписей.ЮрФизЛицо = АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НаборЗаписей.Период КАК Период,
				|	НаборЗаписей.Организация КАК Организация,
				|	НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
				|	НаборЗаписей.ВидПеречня КАК ВидПеречня,
				|	НаборЗаписей.Пройдена КАК Пройдена,
				|	НаборЗаписей.ДатаПоследнейСверки КАК ДатаПоследнейСверки,
				|	НаборЗаписей.Ответственный КАК Ответственный,
				|	НаборЗаписей.ИдентификаторПакета КАК ИдентификаторПакета,
				|	НаборЗаписей.Статус КАК Статус,
				|	_НаборЗаписей.РеквизитыСверки КАК РеквизитыСверки,
				|	НаборЗаписей.Комментарий КАК Комментарий,
				|	НаборЗаписей.Представитель КАК Представитель,
				|	НаборЗаписей.ВидУчастника КАК ВидУчастника
				|ИЗ
				|	(ВЫБРАТЬ
				|		_ПредставителиВыгодоприобретатели.Период КАК Период,
				|		_ПредставителиВыгодоприобретатели.Организация КАК Организация,
				|		_ПредставителиВыгодоприобретатели.ЮрФизЛицо КАК ЮрФизЛицо,
				|		_ПредставителиВыгодоприобретатели.ВидПеречня КАК ВидПеречня,
				|		_ПредставителиВыгодоприобретатели.Пройдена КАК Пройдена,
				|		_ПредставителиВыгодоприобретатели.ДатаПоследнейСверки КАК ДатаПоследнейСверки,
				|		_ПредставителиВыгодоприобретатели.Ответственный КАК Ответственный,
				|		_ПредставителиВыгодоприобретатели.ИдентификаторПакета КАК ИдентификаторПакета,
				|		_ПредставителиВыгодоприобретатели.Статус КАК Статус,
				|		_ПредставителиВыгодоприобретатели.Комментарий КАК Комментарий,
				|		_ПредставителиВыгодоприобретатели.Представитель КАК Представитель,
				|		_ПредставителиВыгодоприобретатели.ВидУчастника КАК ВидУчастника
				|	ИЗ
				|		_ПредставителиВыгодоприобретатели КАК _ПредставителиВыгодоприобретатели
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		_НаборЗаписей.Период,
				|		_НаборЗаписей.Организация,
				|		_НаборЗаписей.ЮрФизЛицо,
				|		_НаборЗаписей.ВидПеречня,
				|		_НаборЗаписей.Пройдена,
				|		_НаборЗаписей.ДатаПоследнейСверки,
				|		_НаборЗаписей.Ответственный,
				|		_НаборЗаписей.ИдентификаторПакета,
				|		_НаборЗаписей.Статус,
				|		_НаборЗаписей.Комментарий,
				|		НЕОПРЕДЕЛЕНО,
				|		НЕОПРЕДЕЛЕНО
				|	ИЗ
				|		_НаборЗаписей КАК _НаборЗаписей
				|			ЛЕВОЕ СОЕДИНЕНИЕ _ПредставителиВыгодоприобретатели КАК _ПредставителиВыгодоприобретатели
				|			ПО _НаборЗаписей.ЮрФизЛицо = _ПредставителиВыгодоприобретатели.ЮрФизЛицо
				|	ГДЕ
				|		_ПредставителиВыгодоприобретатели.ЮрФизЛицо ЕСТЬ NULL) КАК НаборЗаписей
				|		ЛЕВОЕ СОЕДИНЕНИЕ _НаборЗаписей КАК _НаборЗаписей
				|		ПО (_НаборЗаписей.Период = НаборЗаписей.Период)
				|			И (_НаборЗаписей.ЮрФизЛицо = НаборЗаписей.ЮрФизЛицо)
				|			И (_НаборЗаписей.ВидПеречня = НаборЗаписей.ВидПеречня)
				|			И (_НаборЗаписей.Организация = НаборЗаписей.Организация)";	
			#КонецОбласти 
			
			НепрошедшиеПроверку = Запрос.Выполнить().Выгрузить();
			СоставРеквизитов = "ЮрФизЛицо, ВидПеречня, Пройдена, ДатаПоследнейСверки, Ответственный, Комментарий, Статус, ДополнительнаяИнформация, Организация";
			
		Иначе
			
			НепрошедшиеПроверку = Источник.Выгрузить().Скопировать(Новый Структура("Пройдена", Ложь));
			СоставРеквизитов = "ЮрФизЛицо, ВидПеречня, Пройдена, ДатаПоследнейСверки, Ответственный, Комментарий, Организация";
		
		КонецЕсли;
		
		Если НепрошедшиеПроверку.Количество() > 0  Тогда
			
			РеквизитыОповещения = Новый Структура(СоставРеквизитов);
			РеквизитыОповещения.Вставить("ПриИзмененииАнкеты",	ДополнительныеСвойства.Свойство("ЮрФизЛицоПриИзмененииАнкеты"));
			РеквизитыОповещения.Вставить("ПриПорученииНаВывод", ДополнительныеСвойства.Свойство("ПриПорученииНаВывод"));
			РеквизитыОповещения.Вставить("ВидПеречня", 			Источник.Отбор.ВидПеречня);
			
			Для Каждого НепрошедшийПроверку Из НепрошедшиеПроверку Цикл
				
				ЗаполнитьЗначенияСвойств(РеквизитыОповещения, НепрошедшийПроверку);
				Если ЭтоПроверкаСМЭВ Тогда
					
					Если ЗначениеЗаполнено(НепрошедшийПроверку.Представитель) Тогда
						РеквизитыОповещения.ДополнительнаяИнформация = " " + НепрошедшийПроверку.ВидУчастника + " " + НепрошедшийПроверку.Представитель;
					Иначе 
						РеквизитыОповещения.ДополнительнаяИнформация = "";
					КонецЕсли;
					
					РеквизитыОповещения.Комментарий = СокрЛП(РеквизитыОповещения.Комментарий);
					
				КонецЕсли; 
				
				Если ТипЗнч(НепрошедшийПроверку.РеквизитыСверки) = Тип("ХранилищеЗначения") Тогда
					РеквизитыСверки = НепрошедшийПроверку.РеквизитыСверки.Получить();
					Если ТипЗнч(РеквизитыСверки) = Тип("Структура") Тогда
						Для Каждого РеквизитСверки Из РеквизитыСверки Цикл
							РеквизитыОповещения.Вставить(РеквизитСверки.Ключ, РеквизитСверки.Значение);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
				Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);		
				
			КонецЦикла;
			
			РеквизитыОповещения = Неопределено;
			
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СтатусыПорученийНаПереводДенежныхСредств") Тогда

		#Область СтатусыПорученийНаПереводДенежныхСредств

		Если Источник[0].Статус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.ОшибкаПриЭкспорте Тогда
		
			Реквизиты_НТП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник[0].ПоручениеНаПереводДенежныхСредств, "Ссылка, Организация, Брокер, СчетДоверительногоУправления, Сумма, Валюта");
			
			РеквизитыОповещения = Новый Структура("Поручение, Сумма, Валюта, СчетДоверительногоУправления, ТекстСообщения",
														Реквизиты_НТП.Ссылка,
														Реквизиты_НТП.Сумма,
														Реквизиты_НТП.Валюта,
														Реквизиты_НТП.СчетДоверительногоУправления,
														Источник[0].Комментарий);
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.КодFORTS КАК КодFORTS
				|ИЗ
				|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
				|			&Период,
				|			Организация = &Организация
				|				И Брокер = &Брокер
				|				И СчетДоверительногоУправления = &СчетДу) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних";
			
			Запрос.УстановитьПараметр("Организация", Реквизиты_НТП.Организация);
			Запрос.УстановитьПараметр("Брокер"     , Реквизиты_НТП.Брокер);
			Запрос.УстановитьПараметр("СчетДу"     , Реквизиты_НТП.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("Период"     , ТекущаяДатаСеанса());
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество() = 1 Тогда
				РеквизитыОповещения.Вставить("КодУБрокера", РезультатЗапроса[0].Код);
				РеквизитыОповещения.Вставить("КодFORTS"   , РезультатЗапроса[0].КодFORTS);
			КонецЕсли;
		
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДоговорыСчетовДоверительногоУправления")
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ЛицензииДоговоровДоверительногоУправления")
	Тогда
	
		#Область ДоговорыСчетовДоверительногоУправления_ЛицензииДоговоровДоверительногоУправления
	
		Если НЕ Источник.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора Тогда
			ПредыдущаяАктивностьДоговоровПоВидамДеятельности = Источник.ЗаписьИсторииДанных.ДополнительныеДанные.ПредыдущаяАктивностьДоговоровПоВидамДеятельности;
			Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Удалить("ПредыдущаяАктивностьДоговоровПоВидамДеятельности");
			ИзмененияВАктивностиДоговоровПоВидамДеятельности = РегистрыСведений.ДоговорыСчетовДоверительногоУправления.ПолучитьИзмененияВАктивностиДоговоровПоВидамДеятельности(Источник.Отбор, ПредыдущаяАктивностьДоговоровПоВидамДеятельности);
			
			СтруктураПараметров = 
				"Период,
				|Организация,
				|СчетДоверительногоУправления,
				|ВидДоговораДУ,
				|Договор,
				|ВидДоговора,
				|НомерДоговора,
				|Контрагент,
				|ВидДеятельности,
				|НоваяСвязь,
				|Стратегия,
				|НаименованиеЦелевогоКапитала";
			
			ГруппыПараметров = ИзмененияВАктивностиДоговоровПоВидамДеятельности.Скопировать(, СтруктураПараметров);
			ГруппыПараметров.Свернуть(СтруктураПараметров);

			Для Каждого ГруппаПараметров Из ГруппыПараметров Цикл
				
				РеквизитыОповещения = Новый Структура(СтруктураПараметров);
				ЗаполнитьЗначенияСвойств(РеквизитыОповещения, ГруппаПараметров);
				НайденныеСтроки = ИзмененияВАктивностиДоговоровПоВидамДеятельности.НайтиСтроки(РеквизитыОповещения);
				МассивСтрокТекстаОповещения = Новый Массив;
				
				Для Каждого СтрокаИзменения Из НайденныеСтроки Цикл
					
					ЭтоИИС = СтрокаИзменения.ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет;
					ЭтоЦК = СтрокаИзменения.ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов;
					ВидДоговораРодП = НРег(ПолучитьСклоненияСтроки(СтрокаИзменения.ВидДоговора, , "ПД=Родительный")[0]);
					
					РеквизитыОповещения.Вставить("ТипОперации", ?(СтрокаИзменения.НоваяСвязь, "Заключение ", "Закрытие "));
					РеквизитыОповещения.Вставить("ВидОперации", ?(ЭтоИИС, "портфеля по брокеру", ВидДоговораРодП));
					РеквизитыОповещения.Вставить("ВидДоговора", "Договор " + ВидДоговораРодП);
					РеквизитыОповещения.Вставить("ДатаОткрытияЗакрытия", ?(СтрокаИзменения.НоваяСвязь, "Дата открытия", "Дата закрытия"));
					РеквизитыОповещения.Вставить("Период", Формат(СтрокаИзменения.Период, "ДЛФ=Д"));
					
					Если ЭтоИИС И ЗначениеЗаполнено(СтрокаИзменения.Стратегия) Тогда
						
						//Если клиент имеет индивидуальный инвестиционный счет, то в дополнение к наименованию клиента прибавится стратегия
					    РеквизитыОповещения.Вставить("Клиент", 
							Строка(СтрокаИзменения.СчетДоверительногоУправления) 
							+ ", стратегия: " + Строка(СтрокаИзменения.Стратегия));
							
					ИначеЕсли ЭтоЦК И ЗначениеЗаполнено(СтрокаИзменения.НаименованиеЦелевогоКапитала) Тогда
							
						//Если клиент управляет активами целевого капитала, то в дополнение к наименованию прибавится наименование целевого капитала	
						РеквизитыОповещения.Вставить("Клиент", 
							Строка(СтрокаИзменения.СчетДоверительногоУправления) 
							+ ", целевой капитал: " + Строка(СтрокаИзменения.НаименованиеЦелевогоКапитала));
							
					Иначе
						РеквизитыОповещения.Вставить("Клиент", СтрокаИзменения.СчетДоверительногоУправления); 
					КонецЕсли;
					
				КонецЦикла;

				Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);

			КонецЦикла;
			
			РеквизитыОповещения = Неопределено;
			
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ФинансовыеПоказатели") Тогда
		
		#Область ФинансовыеПоказатели
		
		// #ТехДолг: Свойство "ЗапускатьПроверки" добавлено для исключения двойного запуска проверок в момент расчета финансовых показателей доходности документом РегистрацияСтоимостиАктивов
		
		Если Не Источник.ДополнительныеСвойства.Свойство("ЗапускатьПроверки") ИЛИ Источник.ДополнительныеСвойства.ЗапускатьПроверки Тогда
		
			Для Каждого Запись Из Источник Цикл
			
				РеквизитыОповещения = Новый Структура("Период, Организация, СубъектАналитики, ВидПоказателя, Значение");
				
				ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Запись);
				
				РеквизитыОповещения.Вставить("ДатаСтрокой", Формат(РеквизитыОповещения.Период, "ДФ=dd.MM.yyyy"));
				
				Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
				
			КонецЦикла;
		
			РеквизитыОповещения = Неопределено;
		
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДополнительныеДатыРасчетаСЧА") Тогда
		
		#Область ДополнительныеДатыРасчетаСЧА
		
		Для Каждого Запись Из Источник Цикл
		
			РеквизитыОповещения = Новый Структура("Организация");
			
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Запись);
			
			РеквизитыОповещения.Вставить("ВидДоговораДоверительногоУправления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления"));
			РеквизитыОповещения.Вставить("СчетДоверительногоУправленияНаименование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СчетДоверительногоУправления, "Наименование"));
			РеквизитыОповещения.Вставить("ДатаСЧАСтрокой", Формат(Запись.ДатаСЧА,"ДФ=dd.MM.yyyy"));
			
			Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
			
		КонецЦикла;
	
		РеквизитыОповещения = Неопределено;
	
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДокументыЮридическихЛиц")
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ВхожденияВРеестры") 
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛиц") 
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛицАнкетные") Тогда
		
		Если НЕ Источник.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора И Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("ПроверкаРеквизитовАудитора") Тогда
			Для Каждого РезультатПроверкиПоОрганизации Из РаботаСОтчетностьюЦБ.ПолучитьРезультатПроверкиРеквизитовАудитора(Источник) Цикл
				Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РезультатПроверкиПоОрганизации);		
			КонецЦикла;
		КонецЕсли;
		
		#Область РеквизитыЮридическихЛиц
						
		Если Источник.Количество() > 0 И Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("РеквизитыЮридическихЛицПередЗаписью") Тогда			
			
			// Выполняем в привилегированном режиме, чтобы создать оповещения по разным организациям
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НаборЗаписей.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
				|	НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
				|	НаборЗаписей.Подразделение КАК Подразделение,
				|	НаборЗаписей.Язык КАК Язык
				|ПОМЕСТИТЬ _НаборЗаписей
				|ИЗ
				|	&НаборЗаписей КАК НаборЗаписей
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицПередЗаписью.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
				|	РеквизитыЮридическихЛицПередЗаписью.ЮрФизЛицо КАК ЮрФизЛицо,
				|	РеквизитыЮридическихЛицПередЗаписью.Подразделение КАК Подразделение,
				|	РеквизитыЮридическихЛицПередЗаписью.Язык КАК Язык,
				|	РеквизитыЮридическихЛицПередЗаписью.Организация КАК Организация
				|ПОМЕСТИТЬ _РеквизитыЮридическихЛицПередЗаписью
				|ИЗ
				|	&РеквизитыЮридическихЛицПередЗаписью КАК РеквизитыЮридическихЛицПередЗаписью
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	_НаборЗаписей.Язык КАК Язык,
				|	_НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
				|	_РеквизитыЮридическихЛицПередЗаписью.Организация КАК Организация
				|ИЗ
				|	_НаборЗаписей КАК _НаборЗаписей
				|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыЮридическихЛицПередЗаписью КАК _РеквизитыЮридическихЛицПередЗаписью
				|		ПО _НаборЗаписей.Подразделение = _РеквизитыЮридическихЛицПередЗаписью.Подразделение
				|			И _НаборЗаписей.Язык = _РеквизитыЮридическихЛицПередЗаписью.Язык
				|			И _НаборЗаписей.ЮрФизЛицо = _РеквизитыЮридическихЛицПередЗаписью.ЮрФизЛицо
				|ГДЕ
				|	НЕ _НаборЗаписей.ПолноеНаименованиеПоУставу ЕСТЬ NULL
				|	И _НаборЗаписей.ПолноеНаименованиеПоУставу <> ЕСТЬNULL(_РеквизитыЮридическихЛицПередЗаписью.ПолноеНаименованиеПоУставу, """")
				|ИТОГИ ПО
				|	Организация");
			
			Запрос.УстановитьПараметр("НаборЗаписей",							Источник.Выгрузить());
			Запрос.УстановитьПараметр("РеквизитыЮридическихЛицПередЗаписью", 	Источник.ЗаписьИсторииДанных.ДополнительныеДанные.РеквизитыЮридическихЛицПередЗаписью);
							
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
								
				ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
				Пока ВыборкаОрганизация.Следующий() Цикл
					
					ТекстОповещения = "";
					
					Выборка     = ВыборкаОрганизация.Выбрать();
					
					Пока Выборка.Следующий() Цикл                                                                           
						ТекстОповещения = ТекстОповещения + ?(ТекстОповещения = "", "", Символы.ПС) + СтрШаблон("Изменено наименование по уставу юр. лица '%1' на языке '%2'", Выборка.ЮрФизЛицо, Выборка.Язык); 	
					КонецЦикла;
					
					Если Не ПустаяСтрока(ТекстОповещения) Тогда
						Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя() + "_КонтрольНаименования", Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, Новый Структура("Организация, Текст", ВыборкаОрганизация.Организация, ТекстОповещения));
					КонецЕсли;
	
				КонецЦикла;
				
				УстановитьПривилегированныйРежим(Ложь);
																
			КонецЕсли;
			
		КонецЕсли;
					
		#КонецОбласти

		Возврат;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.УсловияОферт")
			 И Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("МВТ_УсловияОфертПередЗаписью") Тогда
		
	#Область УсловияОферт
	
		Если Источник.Количество() > 0 Тогда
		
			ТипыОфертТребующиеПересчетаЭСП = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ТипыОфертТребующиеПересчетаЭСП();
			НачалоЭтогоДня = НачалоДня(ТекущаяДата());
			ОрганизацияРЭМ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
			ОрганизацияТраст = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
	
			Для каждого Запись Из Источник Цикл
				
				Если Запись.ДатаОбъявления = НачалоЭтогоДня
					И ТипыОфертТребующиеПересчетаЭСП.Найти(Запись.ТипОферты) <> Неопределено Тогда
				
					РегистрыСведений.УсловияОферт.ПроинформироватьОНеобходимостиЗаведенияДокументаРегистрацииСведений(Запись.Облигация, ОрганизацияРЭМ);
					РегистрыСведений.УсловияОферт.ПроинформироватьОНеобходимостиЗаведенияДокументаРегистрацииСведений(Запись.Облигация, ОрганизацияТраст);
				
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Источник.ЗаписьИсторииДанных.ДополнительныеДанные.МВТ_УсловияОфертПередЗаписью;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НаборНовыхЗаписей.Облигация КАК Облигация,
			|	НаборНовыхЗаписей.ДатаВыкупа КАК ДатаВыкупа,
			|	НаборНовыхЗаписей.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
			|	НаборНовыхЗаписей.ЦенаПроцент КАК ЦенаПроцент,
			|	НаборНовыхЗаписей.Цена КАК Цена,
			|	НаборНовыхЗаписей.АкцептС КАК АкцептС,
			|	НаборНовыхЗаписей.АкцептПо КАК АкцептПо,
			|	НаборНовыхЗаписей.ТипОферты КАК ТипОферты,
			|	НаборНовыхЗаписей.ДатаОбъявления КАК ДатаОбъявления
			|ПОМЕСТИТЬ _НаборНовыхЗаписей
			|ИЗ
			|	&НаборНовыхЗаписей КАК НаборНовыхЗаписей
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_НаборНовыхЗаписей.Облигация, _УсловияОфертПередЗаписью.Облигация) КАК Облигация,
			|	ЕСТЬNULL(_НаборНовыхЗаписей.ДатаВыкупа, _УсловияОфертПередЗаписью.ДатаВыкупа) КАК ДатаВыкупа,
			|	ЕСТЬNULL(_НаборНовыхЗаписей.ТолькоДляФизическихЛиц, _УсловияОфертПередЗаписью.ТолькоДляФизическихЛиц) КАК ДляФизЛиц,
			|	_НаборНовыхЗаписей.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛицНов,
			|	_НаборНовыхЗаписей.ЦенаПроцент КАК ЦенаПроцентНов,
			|	_НаборНовыхЗаписей.Цена КАК ЦенаНов,
			|	_НаборНовыхЗаписей.АкцептС КАК АкцептСНов,
			|	_НаборНовыхЗаписей.АкцептПо КАК АкцептПоНов,
			|	_НаборНовыхЗаписей.ТипОферты КАК ТипОфертыНов,
			|	_НаборНовыхЗаписей.ДатаОбъявления КАК ДатаОбъявленияНов,
			|	_УсловияОфертПередЗаписью.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
			|	_УсловияОфертПередЗаписью.ЦенаПроцент КАК ЦенаПроцент,
			|	_УсловияОфертПередЗаписью.Цена КАК Цена,
			|	_УсловияОфертПередЗаписью.АкцептС КАК АкцептС,
			|	_УсловияОфертПередЗаписью.АкцептПо КАК АкцептПо,
			|	_УсловияОфертПередЗаписью.ТипОферты КАК ТипОферты,
			|	_УсловияОфертПередЗаписью.ДатаОбъявления КАК ДатаОбъявления,
			|	_УсловияОфертПередЗаписью.Облигация ЕСТЬ NULL КАК ФлагНоваяЗапись,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_НаборНовыхЗаписей.АкцептПо, _УсловияОфертПередЗаписью.АкцептПо) = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ЕСТЬNULL(_НаборНовыхЗаписей.ДатаВыкупа, _УсловияОфертПередЗаписью.ДатаВыкупа)
			|		ИНАЧЕ ЕСТЬNULL(_НаборНовыхЗаписей.АкцептПо, _УсловияОфертПередЗаписью.АкцептПо)
			|	КОНЕЦ КАК ДатаФиксацииОстатков,
			|	ВЫБОР
			|		КОГДА _НаборНовыхЗаписей.ТолькоДляФизическихЛиц <> _УсловияОфертПередЗаписью.ТолькоДляФизическихЛиц
			|			ТОГДА ""ТолькоДляФизическихЛиц,""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА _НаборНовыхЗаписей.ЦенаПроцент <> _УсловияОфертПередЗаписью.ЦенаПроцент
			|			ТОГДА ""ЦенаПроцент,""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА _НаборНовыхЗаписей.Цена <> _УсловияОфертПередЗаписью.Цена
			|			ТОГДА ""Цена,""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА _НаборНовыхЗаписей.АкцептС <> _УсловияОфертПередЗаписью.АкцептС
			|			ТОГДА ""АкцептС,""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА _НаборНовыхЗаписей.АкцептПо <> _УсловияОфертПередЗаписью.АкцептПо
			|			ТОГДА ""АкцептПо,""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА _НаборНовыхЗаписей.ТипОферты <> _УсловияОфертПередЗаписью.ТипОферты
			|			ТОГДА ""ТипОферты,""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА _НаборНовыхЗаписей.ДатаОбъявления <> _УсловияОфертПередЗаписью.ДатаОбъявления
			|			ТОГДА ""ДатаОбъявления,""
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК Поля
			|ПОМЕСТИТЬ _Расхождения
			|ИЗ
			|	_НаборНовыхЗаписей КАК _НаборНовыхЗаписей
			|		ПОЛНОЕ СОЕДИНЕНИЕ _УсловияОфертПередЗаписью КАК _УсловияОфертПередЗаписью
			|		ПО _НаборНовыхЗаписей.Облигация = _УсловияОфертПередЗаписью.Облигация
			|			И _НаборНовыхЗаписей.ДатаВыкупа = _УсловияОфертПередЗаписью.ДатаВыкупа
			|ГДЕ
			|	(_НаборНовыхЗаписей.ДатаВыкупа >= &ТекущаяДатаСеанса
			|				И _НаборНовыхЗаписей.АкцептПо = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ _НаборНовыхЗаписей.АкцептПо >= &ТекущаяДатаСеанса)
			|	И _НаборНовыхЗаписей.ТипОферты В (ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта))
			|	И (_УсловияОфертПередЗаписью.Облигация ЕСТЬ NULL
			|			ИЛИ _НаборНовыхЗаписей.Облигация ЕСТЬ NULL 
			|			ИЛИ _НаборНовыхЗаписей.ТолькоДляФизическихЛиц <> _УсловияОфертПередЗаписью.ТолькоДляФизическихЛиц
			|			ИЛИ _НаборНовыхЗаписей.ЦенаПроцент <> _УсловияОфертПередЗаписью.ЦенаПроцент
			|			ИЛИ _НаборНовыхЗаписей.Цена <> _УсловияОфертПередЗаписью.Цена
			|			ИЛИ _НаборНовыхЗаписей.АкцептС <> _УсловияОфертПередЗаписью.АкцептС
			|			ИЛИ _НаборНовыхЗаписей.АкцептПо <> _УсловияОфертПередЗаписью.АкцептПо
			|			ИЛИ _НаборНовыхЗаписей.ТипОферты <> _УсловияОфертПередЗаписью.ТипОферты
			|			ИЛИ _НаборНовыхЗаписей.ДатаОбъявления <> _УсловияОфертПередЗаписью.ДатаОбъявления)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиЦенныхБумагОстатки.Организация КАК Организация,
			|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Брокер КАК Брокер
			|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
			|			&ТекущаяДатаСеанса,
			|			Организация В (&РЭМ, &Траст)
			|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И ЦеннаяБумага В
			|					(ВЫБРАТЬ
			|						_Расхождения.Облигация
			|					ИЗ
			|						_Расхождения КАК _Расхождения)) КАК ОстаткиЦенныхБумагОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоЦеннымБумагамОстатки.Организация КАК Организация,
			|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Основание,
			|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности КАК ВидЗадолженности,
			|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагам
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
			|			,
			|			Организация В (&РЭМ, &Траст)
			|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И ЦеннаяБумага В
			|					(ВЫБРАТЬ
			|						_Расхождения.Облигация
			|					ИЗ
			|						_Расхождения КАК _Расхождения)) КАК ЗадолженностиПоЦеннымБумагамОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЗадолженностьПоЦеннымБумагам.Организация КАК Организация,
			|	_ЗадолженностьПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ЗадолженностьПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА _ЗадолженностьПоЦеннымБумагам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * _ЗадолженностьПоЦеннымБумагам.КоличествоОстаток КАК КоличествоОстаток
			|ПОМЕСТИТЬ _ЗадолженностьПоПервойЧастиРепо
			|ИЗ
			|	_ЗадолженностьПоЦеннымБумагам КАК _ЗадолженностьПоЦеннымБумагам
			|ГДЕ
			|	_ЗадолженностьПоЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВложенныйЗапрос.КоличествоОстаток КАК КоличествоОстаток,
			|	ВЫБОР
			|		КОГДА УсловияСделокРЕПОСрезПоследних.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА УсловияСделокРЕПОСрезПоследних.ДатаПоставки
			|		ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ДатаИсполнения
			|	КОНЕЦ КАК ДатаИсполнения,
			|	УсловияСделокРЕПОСрезПоследних.ДепозитарныйСчет.Брокер КАК Брокер
			|ПОМЕСТИТЬ _ЗадолженностьПоВторойЧастиРепо
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЗадолженностиПоВторойЧастиРЕПООстатки.Организация КАК Организация,
			|		ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО КАК СделкаРЕПО,
			|		ВЫБОР
			|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				ТОГДА -1
			|			ИНАЧЕ 1
			|		КОНЕЦ * ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток КАК КоличествоОстаток
			|	ИЗ
			|		РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
			|				,
			|				Организация В (&РЭМ, &Траст)
			|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|					И ЦеннаяБумага В
			|						(ВЫБРАТЬ
			|							_Расхождения.Облигация
			|						ИЗ
			|							_Расхождения КАК _Расхождения)) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		_ЗадолженностьПоЦеннымБумагам.Организация,
			|		_ЗадолженностьПоЦеннымБумагам.СчетДоверительногоУправления,
			|		_ЗадолженностьПоЦеннымБумагам.ЦеннаяБумага,
			|		_ЗадолженностьПоЦеннымБумагам.Основание,
			|		ВЫБОР
			|			КОГДА _ЗадолженностьПоЦеннымБумагам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				ТОГДА 1
			|			ИНАЧЕ -1
			|		КОНЕЦ * _ЗадолженностьПоЦеннымБумагам.КоличествоОстаток
			|	ИЗ
			|		_ЗадолженностьПоЦеннымБумагам КАК _ЗадолженностьПоЦеннымБумагам
			|	ГДЕ
			|		_ЗадолженностьПоЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних КАК УсловияСделокРЕПОСрезПоследних
			|		ПО ВложенныйЗапрос.Организация = УсловияСделокРЕПОСрезПоследних.Организация
			|			И ВложенныйЗапрос.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
			|			И ВложенныйЗапрос.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
			|			И УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРепо = 2 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЗадолженностьПоЦеннымБумагам.Организация КАК Организация,
			|	_ЗадолженностьПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ЗадолженностьПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА _ЗадолженностьПоЦеннымБумагам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * _ЗадолженностьПоЦеннымБумагам.КоличествоОстаток КАК КоличествоОстаток,
			|	ВЫБОР
			|		КОГДА УсловияСделокСрезПоследних.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА УсловияСделокСрезПоследних.ДатаПоставки
			|		ИНАЧЕ УсловияСделокСрезПоследних.ДатаИсполнения
			|	КОНЕЦ КАК ДатаИсполнения,
			|	УсловияСделокСрезПоследних.ДепозитарныйСчет.Брокер КАК Брокер
			|ПОМЕСТИТЬ _ЗадолженностьПоСделкам
			|ИЗ
			|	_ЗадолженностьПоЦеннымБумагам КАК _ЗадолженностьПоЦеннымБумагам
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
			|				,
			|				Организация В (&РЭМ, &Траст)
			|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|					И ЦеннаяБумага В
			|						(ВЫБРАТЬ
			|							_Расхождения.Облигация
			|						ИЗ
			|							_Расхождения КАК _Расхождения)) КАК УсловияСделокСрезПоследних
			|		ПО _ЗадолженностьПоЦеннымБумагам.Организация = УсловияСделокСрезПоследних.Организация
			|			И _ЗадолженностьПоЦеннымБумагам.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
			|			И _ЗадолженностьПоЦеннымБумагам.Основание = УсловияСделокСрезПоследних.Сделка
			|ГДЕ
			|	_ЗадолженностьПоЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Организация КАК Организация,
			|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Поручение.ДатаИсполненияПо КАК ДатаИсполнения,
			|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Поручение.ДепозитарныйСчет.Брокер КАК Брокер,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ПОМЕСТИТЬ _ЗадолженностьПоПоручениям
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоЦеннымБумагамПоПоручениям.Остатки(
			|			&ТекущаяДатаСеанса,
			|			Организация В (&РЭМ, &Траст)
			|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И ЦеннаяБумага В
			|					(ВЫБРАТЬ
			|						_Расхождения.Облигация
			|					ИЗ
			|						_Расхождения КАК _Расхождения)) КАК ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки
			|ГДЕ
			|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Поручение.ДатаИсполненияПо <> ДАТАВРЕМЯ(1, 1, 1)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВложенныйЗапрос.Брокер КАК Брокер,
			|	КлиентыДоверительногоУправленияСрезПоследних.Клиент ССЫЛКА Справочник.ЮрФизЛица
			|		И ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо) КАК КлиентФизЛицо
			|ПОМЕСТИТЬ _СчетаДУ
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		_ОстаткиЦенныхБумаг.Организация КАК Организация,
			|		_ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|		_ОстаткиЦенныхБумаг.Брокер КАК Брокер
			|	ИЗ
			|		_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ
			|		_ЗадолженностьПоВторойЧастиРепо.Организация,
			|		_ЗадолженностьПоВторойЧастиРепо.СчетДоверительногоУправления,
			|		_ЗадолженностьПоВторойЧастиРепо.ЦеннаяБумага,
			|		_ЗадолженностьПоВторойЧастиРепо.Брокер
			|	ИЗ
			|		_ЗадолженностьПоВторойЧастиРепо КАК _ЗадолженностьПоВторойЧастиРепо
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ
			|		_ЗадолженностьПоСделкам.Организация,
			|		_ЗадолженностьПоСделкам.СчетДоверительногоУправления,
			|		_ЗадолженностьПоСделкам.ЦеннаяБумага,
			|		_ЗадолженностьПоСделкам.Брокер
			|	ИЗ
			|		_ЗадолженностьПоСделкам КАК _ЗадолженностьПоСделкам
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ
			|		_ЗадолженностьПоПоручениям.Организация,
			|		_ЗадолженностьПоПоручениям.СчетДоверительногоУправления,
			|		_ЗадолженностьПоПоручениям.ЦеннаяБумага,
			|		_ЗадолженностьПоПоручениям.Брокер
			|	ИЗ
			|		_ЗадолженностьПоПоручениям КАК _ЗадолженностьПоПоручениям) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ПО ВложенныйЗапрос.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДУ.Организация КАК Организация,
			|	_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СУММА(ВЫБОР
			|			КОГДА _СчетаДУ.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК КоличествоБрокеров
			|ПОМЕСТИТЬ _БрокерыСчетовДУ
			|ИЗ
			|	_СчетаДУ КАК _СчетаДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	_СчетаДУ.Организация,
			|	_СчетаДУ.СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_БрокерыСчетовДУ.Организация КАК Организация,
			|	_БрокерыСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СчетаДУ.Брокер КАК Брокер
			|ПОМЕСТИТЬ _СчетаСБрокером
			|ИЗ
			|	_БрокерыСчетовДУ КАК _БрокерыСчетовДУ
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДУ КАК _СчетаДУ
			|		ПО _БрокерыСчетовДУ.СчетДоверительногоУправления = _СчетаДУ.СчетДоверительногоУправления
			|ГДЕ
			|	_БрокерыСчетовДУ.КоличествоБрокеров = 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_БрокерыСчетовДУ.Организация КАК Организация,
			|	_БрокерыСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _СчетаБезБрокера
			|ИЗ
			|	_БрокерыСчетовДУ КАК _БрокерыСчетовДУ
			|ГДЕ
			|	_БрокерыСчетовДУ.КоличествоБрокеров <> 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация КАК Организация,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период
			|ПОМЕСТИТЬ _ВсеКодыУБрокеров
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|			,
			|			Организация В (&РЭМ, &Траст)
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДУ.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДУ КАК _СчетаДУ)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(, ) КАК УсловияДоговоровОбщиеСрезПоследних
			|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
			|ГДЕ
			|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
			|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ТекущаяДатаСеанса)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
			|	_ВсеКодыУБрокеров.Код КАК Код
			|ПОМЕСТИТЬ _СчетаСОднимБрокером
			|ИЗ
			|	(ВЫБРАТЬ
			|		_ВсеКодыУБрокеров.Организация КАК Организация,
			|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) КАК КоличествоКодов
			|	ИЗ
			|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
			|	
			|	СГРУППИРОВАТЬ ПО
			|		_ВсеКодыУБрокеров.Организация,
			|		_ВсеКодыУБрокеров.СчетДоверительногоУправления
			|	
			|	ИМЕЮЩИЕ
			|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) = 1) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
			|		ПО ВложенныйЗапрос.Организация = _ВсеКодыУБрокеров.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
			|	_ВсеКодыУБрокеров.Код КАК Код
			|ПОМЕСТИТЬ _КодыБрокеровСМаксимальнымПериодом
			|ИЗ
			|	(ВЫБРАТЬ
			|		_ВсеКодыУБрокеров.Организация КАК Организация,
			|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		МАКСИМУМ(_ВсеКодыУБрокеров.Период) КАК Период
			|	ИЗ
			|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
			|	
			|	СГРУППИРОВАТЬ ПО
			|		_ВсеКодыУБрокеров.Организация,
			|		_ВсеКодыУБрокеров.СчетДоверительногоУправления) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
			|		ПО ВложенныйЗапрос.Организация = _ВсеКодыУБрокеров.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
			|			И ВложенныйЗапрос.Период = _ВсеКодыУБрокеров.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаСБрокером.Организация КАК Организация,
			|	_СчетаСБрокером.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СчетаСБрокером.Брокер КАК Брокер,
			|	_ВсеКодыУБрокеров.Код КАК Код
			|ПОМЕСТИТЬ _КодыУБрокеров
			|ИЗ
			|	_СчетаСБрокером КАК _СчетаСБрокером
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
			|		ПО _СчетаСБрокером.Организация = _ВсеКодыУБрокеров.Организация
			|			И _СчетаСБрокером.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
			|			И _СчетаСБрокером.Брокер = _ВсеКодыУБрокеров.Брокер
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_СчетаБезБрокера.Организация,
			|	_СчетаБезБрокера.СчетДоверительногоУправления,
			|	ЕСТЬNULL(_СчетаСОднимБрокером.Брокер, _КодыБрокеровСМаксимальнымПериодом.Брокер),
			|	ЕСТЬNULL(_СчетаСОднимБрокером.Код, _КодыБрокеровСМаксимальнымПериодом.Код)
			|ИЗ
			|	_СчетаБезБрокера КАК _СчетаБезБрокера
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаСОднимБрокером КАК _СчетаСОднимБрокером
			|		ПО _СчетаБезБрокера.Организация = _СчетаСОднимБрокером.Организация
			|			И _СчетаБезБрокера.СчетДоверительногоУправления = _СчетаСОднимБрокером.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыБрокеровСМаксимальнымПериодом КАК _КодыБрокеровСМаксимальнымПериодом
			|		ПО _СчетаБезБрокера.Организация = _КодыБрокеровСМаксимальнымПериодом.Организация
			|			И _СчетаБезБрокера.СчетДоверительногоУправления = _КодыБрокеровСМаксимальнымПериодом.СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВложенныйЗапрос.ДатаВыкупа КАК ДатаВыкупа,
			|	ВложенныйЗапрос.ДляФизЛиц КАК ДляФизЛиц,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумаг.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоВторойЧастиРепо.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоПервойЧастиРепо.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоПоручениям.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоСделкам.КоличествоОстаток, 0) КАК Количество
			|ПОМЕСТИТЬ _ОстаткиОбщие
			|ИЗ
			|	(ВЫБРАТЬ
			|		_СчетаДУ.Организация КАК Организация,
			|		_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		_СчетаДУ.ЦеннаяБумага КАК ЦеннаяБумага,
			|		_Расхождения.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
			|		_Расхождения.ДатаВыкупа КАК ДатаВыкупа,
			|		_Расхождения.ДляФизЛиц КАК ДляФизЛиц
			|	ИЗ
			|		_Расхождения КАК _Расхождения
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУ КАК _СчетаДУ
			|			ПО _Расхождения.Облигация = _СчетаДУ.ЦеннаяБумага
			|				И (НЕ _Расхождения.ДляФизЛиц
			|					ИЛИ _Расхождения.ДляФизЛиц = _СчетаДУ.КлиентФизЛицо)) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
			|		ПО ВложенныйЗапрос.Организация = _ОстаткиЦенныхБумаг.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ОстаткиЦенныхБумаг.СчетДоверительногоУправления
			|			И ВложенныйЗапрос.ЦеннаяБумага = _ОстаткиЦенныхБумаг.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоПервойЧастиРепо КАК _ЗадолженностьПоПервойЧастиРепо
			|		ПО ВложенныйЗапрос.Организация = _ЗадолженностьПоПервойЧастиРепо.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ЗадолженностьПоПервойЧастиРепо.СчетДоверительногоУправления
			|			И ВложенныйЗапрос.ЦеннаяБумага = _ЗадолженностьПоПервойЧастиРепо.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоВторойЧастиРепо КАК _ЗадолженностьПоВторойЧастиРепо
			|		ПО ВложенныйЗапрос.Организация = _ЗадолженностьПоВторойЧастиРепо.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ЗадолженностьПоВторойЧастиРепо.СчетДоверительногоУправления
			|			И ВложенныйЗапрос.ЦеннаяБумага = _ЗадолженностьПоВторойЧастиРепо.ЦеннаяБумага
			|			И (_ЗадолженностьПоВторойЧастиРепо.КоличествоОстаток < 0
			|				ИЛИ _ЗадолженностьПоВторойЧастиРепо.ДатаИсполнения <= ВложенныйЗапрос.ДатаФиксацииОстатков)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоСделкам КАК _ЗадолженностьПоСделкам
			|		ПО ВложенныйЗапрос.Организация = _ЗадолженностьПоСделкам.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ЗадолженностьПоСделкам.СчетДоверительногоУправления
			|			И ВложенныйЗапрос.ЦеннаяБумага = _ЗадолженностьПоСделкам.ЦеннаяБумага
			|			И (_ЗадолженностьПоСделкам.КоличествоОстаток < 0
			|				ИЛИ _ЗадолженностьПоСделкам.ДатаИсполнения <= ВложенныйЗапрос.ДатаФиксацииОстатков)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоПоручениям КАК _ЗадолженностьПоПоручениям
			|		ПО ВложенныйЗапрос.Организация = _ЗадолженностьПоПоручениям.Организация
			|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ЗадолженностьПоПоручениям.СчетДоверительногоУправления
			|			И ВложенныйЗапрос.ЦеннаяБумага = _ЗадолженностьПоПоручениям.ЦеннаяБумага
			|			И (_ЗадолженностьПоПоручениям.КоличествоОстаток < 0
			|				ИЛИ _ЗадолженностьПоПоручениям.ДатаИсполнения <= ВложенныйЗапрос.ДатаФиксацииОстатков)
			|ГДЕ
			|	ЕСТЬNULL(_ОстаткиЦенныхБумаг.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоВторойЧастиРепо.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоПервойЧастиРепо.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоПоручениям.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоСделкам.КоличествоОстаток, 0) <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОстаткиОбщие.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ОстаткиОбщие.ДатаВыкупа КАК ДатаВыкупа,
			|	_ОстаткиОбщие.Организация КАК Организация,
			|	_ОстаткиОбщие.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ОстаткиОбщие.Количество КАК Количество,
			|	_ОстаткиОбщие.Количество * ЕСТЬNULL(_Расхождения.ЦенаНов, _Расхождения.Цена) КАК Сумма,
			|	_КодыУБрокеров.Брокер КАК Брокер,
			|	_КодыУБрокеров.Код КАК КодУБрокера,
			|	КодыВТорговыхСистемахСрезПоследних.Код КАК КодISIN,
			|	_Расхождения.ТолькоДляФизическихЛицНов КАК ТолькоДляФизическихЛицНов,
			|	_Расхождения.ЦенаПроцентНов КАК ЦенаПроцентНов,
			|	_Расхождения.ЦенаНов КАК ЦенаНов,
			|	_Расхождения.АкцептСНов КАК АкцептСНов,
			|	_Расхождения.АкцептПоНов КАК АкцептПоНов,
			|	_Расхождения.ТипОфертыНов КАК ТипОфертыНов,
			|	_Расхождения.ДатаОбъявленияНов КАК ДатаОбъявленияНов,
			|	_Расхождения.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
			|	_Расхождения.ЦенаПроцент КАК ЦенаПроцент,
			|	_Расхождения.Цена КАК Цена,
			|	_Расхождения.АкцептС КАК АкцептС,
			|	_Расхождения.АкцептПо КАК АкцептПо,
			|	_Расхождения.ТипОферты КАК ТипОферты,
			|	_Расхождения.ДатаОбъявления КАК ДатаОбъявления,
			|	_Расхождения.ФлагНоваяЗапись КАК ФлагНоваяЗапись,
			|	_Расхождения.Поля КАК Поля
			|ИЗ
			|	_ОстаткиОбщие КАК _ОстаткиОбщие
			|		ЛЕВОЕ СОЕДИНЕНИЕ _Расхождения КАК _Расхождения
			|		ПО _ОстаткиОбщие.ЦеннаяБумага = _Расхождения.Облигация
			|			И _ОстаткиОбщие.ДатаВыкупа = _Расхождения.ДатаВыкупа
			|			И _ОстаткиОбщие.ДляФизЛиц = _Расхождения.ДляФизЛиц
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыУБрокеров КАК _КодыУБрокеров
			|		ПО _ОстаткиОбщие.Организация = _КодыУБрокеров.Организация
			|			И _ОстаткиОбщие.СчетДоверительногоУправления = _КодыУБрокеров.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних КАК КодыВТорговыхСистемахСрезПоследних
			|		ПО _ОстаткиОбщие.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
			|			И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
			|ИТОГИ ПО
			|	ЦеннаяБумага,
			|	ДатаВыкупа,
			|	Организация";
		
		Запрос.УстановитьПараметр("НаборНовыхЗаписей", Источник.Выгрузить());
		Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("РЭМ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
		Запрос.УстановитьПараметр("Траст", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
		
		Результат = Запрос.Выполнить();
		
		ГруппировкаПоЦеннойБумаге = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЦеннаяБумага");
		
		ТекстСообщения = "";
		
		Пока ГруппировкаПоЦеннойБумаге.Следующий() Цикл
								
			ГруппировкаПоДатеВыкупа = ГруппировкаПоЦеннойБумаге.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаВыкупа");
			
			Пока ГруппировкаПоДатеВыкупа.Следующий() Цикл
				
				ДобавитьУсловиеОферты = Истина;
				
				ГруппировкаПоОрганизации = ГруппировкаПоДатеВыкупа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
				
				Пока ГруппировкаПоОрганизации.Следующий() Цикл
					
					ДобавитьДанныеОрганизации = Истина;
					
					Выборка = ГруппировкаПоОрганизации.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						Если ДобавитьУсловиеОферты Тогда
							
							ТекстСообщения = ТекстСообщения + ?(ТекстСообщения = "", "", "<br>") + "<table cols=""4""><tr class=""top""><td colspan=""4"">Облигация: " + Выборка.ЦеннаяБумага + " (ISIN " + Выборка.КодISIN + ")</td></tr>";
							ТекстСообщения = ТекстСообщения + "<tr class=""top2""><td colspan=""4"">Условия оферты</td></tr>";
							ТекстСообщения = ТекстСообщения + "<tr class=""line""><td colspan=""4"">Дата выкупа: <b>" + Формат(Выборка.ДатаВыкупа, "ДФ=dd.MM.yyyy") + "</b><br>";
							ТекстСообщения = ТекстСообщения + "Только для физ лиц: <b>" + Выборка.ТолькоДляФизическихЛицНов + "</b><br>";
							ТекстСообщения = ТекстСообщения + "Цена: <b>" + Выборка.ЦенаНов + "</b><br>";
							ТекстСообщения = ТекстСообщения + "Цена процент: <b>" + Выборка.ЦенаПроцентНов + "</b><br>";
							ТекстСообщения = ТекстСообщения + "Акцепт с: <b>" + Формат(Выборка.АкцептСНов, "ДФ=dd.MM.yyyy") + "</b> по: <b>" + Формат(Выборка.АкцептПоНов, "ДФ=dd.MM.yyyy") + "</b><br>";   
							ТекстСообщения = ТекстСообщения + "Тип оферты: <b>" + Выборка.ТипОфертыНов + "</b><br>";  
							ТекстСообщения = ТекстСообщения + "Дата объявления: <b>" + Формат(Выборка.ДатаОбъявленияНов, "ДФ=dd.MM.yyyy") + "</b></td></tr>"; 
							
							Если Не Выборка.ФлагНоваяЗапись Тогда
								
								МассивПолей = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Поля, ",", Истина, Истина);
								
								Если МассивПолей.Количество() > 0 Тогда
									
									ТекстСообщения = ТекстСообщения + "<tr class=""top2""><td colspan=""4"">Изменения условий оферты</td></tr><tr class=""line""><td colspan=""4"">";
									
									Для Каждого Поле Из МассивПолей Цикл
										ТекстСообщения = ТекстСообщения + Поле + ": <b>" + СтрЗаменить(Выборка[Поле], " 0:00:00", "")  + " => " + СтрЗаменить(Выборка[Поле + "Нов"], " 0:00:00", "") + "</b><br>";	
									КонецЦикла;
									
									ТекстСообщения = ТекстСообщения + "</tr>";									
								КонецЕсли;
								
							КонецЕсли;
							
							ТекстСообщения = ТекстСообщения + 
								"<tr class=""top""><td colspan=""4"">Остатки ценных бумаг</td></tr>
								|<tr class=""top""><td>Счет доверительного управления</td><td>Код у брокера</td><td>Количество</td><td>Сумма</td></tr>";
								
							ДобавитьУсловиеОферты = Ложь;
							
						КонецЕсли;
						
						Если ДобавитьДанныеОрганизации Тогда
							ТекстСообщения = ТекстСообщения + "<tr class=""top3""><td colspan=""4"">" + Выборка.Организация + "</td></tr>";
							ДобавитьДанныеОрганизации = Ложь;
						КонецЕсли;
						
						ТекстСообщения = ТекстСообщения + "<tr class=""line""><td>" + Выборка.СчетДоверительногоУправления + "</td>";
						ТекстСообщения = ТекстСообщения + "<td>" + Выборка.КодУБрокера + "</td>";
						ТекстСообщения = ТекстСообщения + "<td>" + Выборка.Количество + "</td>";
						ТекстСообщения = ТекстСообщения + "<td>" + Выборка.Сумма + "</td></tr>";
		
					КонецЦикла;
					
				КонецЦикла;
				
				ТекстСообщения = ТекстСообщения + "</table>";
	
			КонецЦикла;
							
		КонецЦикла;
		
		Если ТекстСообщения <> "" Тогда
			
			ТекстСообщения = 
				"<html>
				|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
				|	<style>
				|		body  { font: 10pt sans-serif; }
				|		table { text-align: left; border-spacing: 0; border-collapse: collapse; }
				|		td    { vertical-align: top; border: 1px solid #CCC085; padding: 5px; }
				|		.top  { font-size: 14px; font-weight: 600; background: #F4ECC5; }
				|		.top2 { font-size: 14px; background: #F8F2D8; }
				|		.top3 { font-size: 14px; font-weight: 600; background: #FBF9EC; }
				|		.line { font-size: 12px;}
				|	</style>
				|</head>
				|<body>
				|" + ТекстСообщения + "</body></html>";
			
			РеквизитыОповещения = Новый Структура("Тема, Текст", "ВАЖНО! Новые данные об оферте.", ТекстСообщения); 
				
		КонецЕсли;	
	#КонецОбласти
	
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СостояниеСотрудниковОрганизаций")
			 И Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("МВТ_СостояниеСотрудниковОрганизацийПередЗаписью") Тогда
			 
 #Область ДанныеОбОтсутствии 
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Источник.ЗаписьИсторииДанных.ДополнительныеДанные.МВТ_СостояниеСотрудниковОрганизацийПередЗаписью;
		
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Источник.Выгрузить(), "_НаборНовыхЗаписей", Запрос);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеРегистра.Организация КАК Организация,
			|	СправочникСотрудники.ЮрФизЛицо КАК ФизЛицо,
			|	ДанныеРегистра.Сотрудник КАК Сотрудник,
			|	СправочникСотрудники.ВидЗанятости КАК ВидЗанятости,
			|	СотрудникиОрганизации.Должность КАК Должность,
			|	СотрудникиОрганизации.Подразделение КАК Подразделение,
			|	ДанныеРегистра.ДатаНачала КАК ДатаНачала,
			|	ДанныеРегистра.ДатаОкончания КАК ДатаОкончания,
			|	ДанныеРегистра.Состояние КАК Состояние,
			|	ДанныеРегистра.НоваяЗапись КАК НоваяЗапись,
			|	ДанныеРегистра.УдаленнаяЗапись КАК УдаленнаяЗапись
			|ПОМЕСТИТЬ _ДанныеОбОтсутствии
			|ИЗ
			|	(ВЫБРАТЬ
			|		_НаборНовыхЗаписей.Организация КАК Организация,
			|		_НаборНовыхЗаписей.Сотрудник КАК Сотрудник,
			|		_НаборНовыхЗаписей.Период КАК ДатаНачала,
			|		ДОБАВИТЬКДАТЕ(МИНИМУМ(_НаборНовыхЗаписейСледующаяЗапись.Период), ДЕНЬ, -1) КАК ДатаОкончания,
			|		_НаборНовыхЗаписей.Состояние КАК Состояние,
			|		ИСТИНА КАК НоваяЗапись,
			|		ЛОЖЬ КАК УдаленнаяЗапись,
			|		МАКСИМУМ(СотрудникиОрганизации.Период) КАК ПериодСотрудникиОрганизации
			|	ИЗ
			|		_НаборНовыхЗаписей КАК _НаборНовыхЗаписей
			|			ЛЕВОЕ СОЕДИНЕНИЕ _СостояниеСотрудниковОрганизацийПередЗаписью КАК _СостояниеСотрудниковОрганизацийПередЗаписью
			|			ПО _НаборНовыхЗаписей.Организация = _СостояниеСотрудниковОрганизацийПередЗаписью.Организация
			|				И _НаборНовыхЗаписей.Сотрудник = _СостояниеСотрудниковОрганизацийПередЗаписью.Сотрудник
			|				И _НаборНовыхЗаписей.Состояние = _СостояниеСотрудниковОрганизацийПередЗаписью.Состояние
			|				И _НаборНовыхЗаписей.Период = _СостояниеСотрудниковОрганизацийПередЗаписью.Период
			|			ЛЕВОЕ СОЕДИНЕНИЕ _НаборНовыхЗаписей КАК _НаборНовыхЗаписейСледующаяЗапись
			|			ПО _НаборНовыхЗаписей.Организация = _НаборНовыхЗаписейСледующаяЗапись.Организация
			|				И _НаборНовыхЗаписей.Сотрудник = _НаборНовыхЗаписейСледующаяЗапись.Сотрудник
			|				И _НаборНовыхЗаписей.Состояние <> _НаборНовыхЗаписейСледующаяЗапись.Состояние
			|				И _НаборНовыхЗаписей.Период < _НаборНовыхЗаписейСледующаяЗапись.Период
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
			|			ПО _НаборНовыхЗаписей.Организация = СотрудникиОрганизации.Организация
			|				И _НаборНовыхЗаписей.Сотрудник = СотрудникиОрганизации.Сотрудник
			|				И _НаборНовыхЗаписей.Период >= СотрудникиОрганизации.Период
			|	ГДЕ
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Период ЕСТЬ NULL
			|	
			|	СГРУППИРОВАТЬ ПО
			|		_НаборНовыхЗаписей.Организация,
			|		_НаборНовыхЗаписей.Сотрудник,
			|		_НаборНовыхЗаписей.Период,
			|		_НаборНовыхЗаписей.Состояние
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Организация,
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Сотрудник,
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Период,
			|		ДОБАВИТЬКДАТЕ(МИНИМУМ(_СостояниеСотрудниковОрганизацийПередЗаписьюСледующаяЗапись.Период), ДЕНЬ, -1),
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Состояние,
			|		ЛОЖЬ,
			|		ИСТИНА,
			|		МАКСИМУМ(СотрудникиОрганизации.Период)
			|	ИЗ
			|		_СостояниеСотрудниковОрганизацийПередЗаписью КАК _СостояниеСотрудниковОрганизацийПередЗаписью
			|			ЛЕВОЕ СОЕДИНЕНИЕ _НаборНовыхЗаписей КАК _НаборНовыхЗаписей
			|			ПО _СостояниеСотрудниковОрганизацийПередЗаписью.Организация = _НаборНовыхЗаписей.Организация
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Сотрудник = _НаборНовыхЗаписей.Сотрудник
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Состояние = _НаборНовыхЗаписей.Состояние
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Период = _НаборНовыхЗаписей.Период
			|			ЛЕВОЕ СОЕДИНЕНИЕ _СостояниеСотрудниковОрганизацийПередЗаписью КАК _СостояниеСотрудниковОрганизацийПередЗаписьюСледующаяЗапись
			|			ПО _СостояниеСотрудниковОрганизацийПередЗаписью.Организация = _СостояниеСотрудниковОрганизацийПередЗаписьюСледующаяЗапись.Организация
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Сотрудник = _СостояниеСотрудниковОрганизацийПередЗаписьюСледующаяЗапись.Сотрудник
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Состояние <> _СостояниеСотрудниковОрганизацийПередЗаписьюСледующаяЗапись.Состояние
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Период < _СостояниеСотрудниковОрганизацийПередЗаписьюСледующаяЗапись.Период
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
			|			ПО _СостояниеСотрудниковОрганизацийПередЗаписью.Организация = СотрудникиОрганизации.Организация
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Сотрудник = СотрудникиОрганизации.Сотрудник
			|				И _СостояниеСотрудниковОрганизацийПередЗаписью.Период >= СотрудникиОрганизации.Период
			|	ГДЕ
			|		_НаборНовыхЗаписей.Период ЕСТЬ NULL
			|	
			|	СГРУППИРОВАТЬ ПО
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Организация,
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Сотрудник,
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Период,
			|		_СостояниеСотрудниковОрганизацийПередЗаписью.Состояние) КАК ДанныеРегистра
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
			|		ПО ДанныеРегистра.Сотрудник = СправочникСотрудники.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
			|		ПО ДанныеРегистра.Организация = СотрудникиОрганизации.Организация
			|			И ДанныеРегистра.Сотрудник = СотрудникиОрганизации.Сотрудник
			|			И ДанныеРегистра.ПериодСотрудникиОрганизации = СотрудникиОрганизации.Период
			|ГДЕ
			|	ДанныеРегистра.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)
			|	И ДанныеРегистра.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.РаботаВОтпускеПоУходуЗаРебенком)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеОбОтсутствии.Организация КАК Организация,
			|	_ДанныеОбОтсутствии.ФизЛицо КАК ФизЛицо,
			|	МАКСИМУМ(_ДанныеОбОтсутствии.НоваяЗапись) КАК НоваяЗапись,
			|	МАКСИМУМ(_ДанныеОбОтсутствии.УдаленнаяЗапись) КАК УдаленнаяЗапись
			|ПОМЕСТИТЬ _Отборы
			|ИЗ
			|	_ДанныеОбОтсутствии КАК _ДанныеОбОтсутствии
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДанныеОбОтсутствии.Организация,
			|	_ДанныеОбОтсутствии.ФизЛицо";

		Запрос.Выполнить();
		
		Отборы = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_Отборы",,,, "Организация, ФизЛицо АВТОУПОРЯДОЧИВАНИЕ").Выгрузить();
		ДанныеОбОтсутствии	= СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ДанныеОбОтсутствии").Выгрузить();
		
		Колонки = Новый Массив;
		Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "Сотрудник", 	"Сотрудник"));
		Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "Должность",		"Должность"));
		Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "Подразделение",	"Подразделение"));
		Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "Состояние", 	"Состояние"));
		Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "ДатаНачала", 	"Дата начала", "ДФ=dd.MM.yyyy"));
		Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "ДатаОкончания", "Дата окончания", "ДФ=dd.MM.yyyy"));
		
		Для Каждого Отбор Из Отборы Цикл
			
			ЭлементыОтчета = Новый Массив;
			ЭлементыОтчета.Добавить(Новый Структура("Тип, Значение", "Заголовок", "Данные об отсутствии сотрудника"));
			ЭлементыОтчета.Добавить(Новый Структура("Тип, Имя, Значение", "Параметр", "Организация", Отбор.Организация));
			ЭлементыОтчета.Добавить(Новый Структура("Тип, Имя, Значение", "Параметр", "Физ.лицо",	 Отбор.ФизЛицо));
			
			Если Отбор.НоваяЗапись Тогда
				ПараметрыПоиска = Новый Структура("Организация, ФизЛицо, НоваяЗапись", Отбор.Организация, Отбор.ФизЛицо, Истина);
				ЭлементыОтчета.Добавить(Новый Структура("Тип, Заголовок, Значение, Колонки", "ТаблицаЗначений", "Новые данные", ДанныеОбОтсутствии.Скопировать(ПараметрыПоиска), Колонки));
			КонецЕсли;
			
			Если Отбор.УдаленнаяЗапись Тогда
				ПараметрыПоиска = Новый Структура("Организация, ФизЛицо, НоваяЗапись", Отбор.Организация, Отбор.ФизЛицо, Ложь);
				ЭлементыОтчета.Добавить(Новый Структура("Тип, Заголовок, Значение, Колонки", "ТаблицаЗначений", "Отменённые данные", ДанныеОбОтсутствии.Скопировать(ПараметрыПоиска), Колонки));
			КонецЕсли;

			РеквизитыОповещения = Новый Структура;
			РеквизитыОповещения.Вставить("Организация", Отбор.Организация);
			РеквизитыОповещения.Вставить("ФизЛицо",		Отбор.ФизЛицо);
			РеквизитыОповещения.Вставить("Текст",		РаботаСОтчетами.СформироватьОтчетВHTML(ЭлементыОтчета));
			
			Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя() + "_ДанныеОбОтсутствии", Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
			
			РеквизитыОповещения = Неопределено;
			
		КонецЦикла;
#КонецОбласти	
	
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СтатусыМЧД") 
			 И Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("МВТ_СтатусыМЧДПередЗаписью") Тогда
		
		#Область Статусы_МЧД
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Источник.ЗаписьИсторииДанных.ДополнительныеДанные.МВТ_СтатусыМЧДПередЗаписью;
		
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Источник.Выгрузить(), "_НаборНовыхЗаписей", Запрос);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Доверенности.Организация КАК Организация,
			|	_НаборНовыхЗаписей.Доверенность КАК Доверенность,
			|	_НаборНовыхЗаписей.УстановленВручную КАК УстановленВручную,
			|	_НаборНовыхЗаписей.Комментарий КАК Комментарий,
			|	_СтатусыМЧДПередЗаписью.Статус КАК ПредыдущийСтатус,
			|	_НаборНовыхЗаписей.Статус КАК Статус,
			|	Доверенности.Доверитель КАК Доверитель,
			|	Доверенности.Номер КАК Номер,
			|	Доверенности.Дата КАК Дата,
			|	Доверенности.ИдентификаторДоверенности КАК ИдентификаторДоверенности,
			|	Доверенности.ИнформационнаяСистема КАК ИнформационнаяСистема,
			|	Доверенности.Поверенные.(
			|		Поверенный КАК Поверенный
			|	) КАК Поверенные
			|ИЗ
			|	_НаборНовыхЗаписей КАК _НаборНовыхЗаписей
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СтатусыМЧДПередЗаписью КАК _СтатусыМЧДПередЗаписью
			|		ПО _НаборНовыхЗаписей.Организация = _СтатусыМЧДПередЗаписью.Организация
			|			И _НаборНовыхЗаписей.Доверенность = _СтатусыМЧДПередЗаписью.Доверенность
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Доверенности КАК Доверенности
			|		ПО _НаборНовыхЗаписей.Доверенность = Доверенности.Ссылка
			|ГДЕ
			|	(_СтатусыМЧДПередЗаписью.Период ЕСТЬ NULL
			|			ИЛИ _НаборНовыхЗаписей.Статус <> _СтатусыМЧДПередЗаписью.Статус
			|				И _НаборНовыхЗаписей.Период > _СтатусыМЧДПередЗаписью.Период)
			|ИТОГИ ПО
			|	Организация";
		
		Результат = Запрос.Выполнить();
		ВыборкаОрганизация = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не Результат.Пустой() Тогда
		
			ТаблицаОтчета = Новый ТаблицаЗначений;
			ТаблицаОтчета.Колонки.Добавить("Доверитель", Новый ОписаниеТипов("Строка"));
			ТаблицаОтчета.Колонки.Добавить("Поверенный", Новый ОписаниеТипов("Строка"));
			ТаблицаОтчета.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
			ТаблицаОтчета.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка"));
			ТаблицаОтчета.Колонки.Добавить("ИдентификаторДоверенности", Новый ОписаниеТипов("Строка"), "Идентификатор");
			ТаблицаОтчета.Колонки.Добавить("ИнформационнаяСистема", Новый ОписаниеТипов("Строка"), "Информационная система");
		
		КонецЕсли;
		
		Пока ВыборкаОрганизация.Следующий() Цикл
			
			РеквизитыОповещения = Новый Структура;
			РеквизитыОповещения.Вставить("Организация", ВыборкаОрганизация.Организация);
			
			ЭлементыОтчета = Новый Массив;
			
			Выборка = ВыборкаОрганизация.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Поверенные = Выборка.Поверенные.Выгрузить().ВыгрузитьКолонку(0);
				
				НоваяСтрока = ТаблицаОтчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Доверитель, Статус, ИдентификаторДоверенности, ИнформационнаяСистема");
				НоваяСтрока.Поверенный = СтрСоединить(Поверенные, Символы.ПС);
				НоваяСтрока.Номер = СтрШаблон("%1 от %2", Выборка.Номер, Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
				
			КонецЦикла;
			
			ЭлементыОтчета.Добавить(Новый Структура("Тип, Заголовок, Значение", "ТаблицаЗначений", "Изменились статусы доверенностей", ТаблицаОтчета));
			
			РеквизитыОповещения.Вставить("Текст", РаботаСОтчетами.СформироватьОтчетВHTML(ЭлементыОтчета));
            
			Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя() + "_ИзменениеСтатусаМЧД", Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
			
			РеквизитыОповещения = Неопределено;
			ТаблицаОтчета.Очистить();
			
		КонецЦикла;	
		
		#КонецОбласти
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыФизическихЛицАнкетные")
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыСотрудниковОрганизации") Тогда
		
		Если НЕ Источник.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора И Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("ПроверкаРеквизитовЛицПодлежащихСверкеСоСписками") Тогда
			Для Каждого СписокЛицПодлежащихСверкеСоСписками Из РегистрыСведений.ЖурналСверкиСоСписками.ПолучитьСписокЛицПодлежащихСверкеСоСписками(Источник) Цикл
				РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц(СписокЛицПодлежащихСверкеСоСписками.Организация, СписокЛицПодлежащихСверкеСоСписками.ПроверяемыеЛица, ТекущаяДата());
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РеквизитыОповещения <> Неопределено Тогда
		Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
	КонецЕсли;
	
КонецПроцедуры // ОповещенияПриЗаписиРегистровСведений

Процедура ОповещенияПриЗаписиСправочников(Источник, Отказ) Экспорт
	
	РеквизитыОповещения = Неопределено;
	
	ЭтоНовыйЭлемент = Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") И Источник.ДополнительныеСвойства.ЭтоНовый;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.СчетаДоверительногоУправления") Тогда
		Если ЭтоНовыйЭлемент Тогда
			
			РеквизитыОповещения = Новый Структура("Организация,ВидДоговораДоверительногоУправления,Наименование,НомерСчета,ДатаЗаключения,Агент");
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
			РеквизитыОповещения.Агент = Источник.АгентскийДоговор.Контрагент;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.БазовыеСтавкиОблигаций")
		И ЭтоНовыйЭлемент Тогда
		РеквизитыОповещения = Новый Структура("Наименование");
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.БанковскиеСчета") Тогда
		
		ЮрФизЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация, "ЮрФизЛицо");
		СчетПринадлежитОрганизации = (Источник.ЮрФизЛицо = ЮрФизЛицоОрганизации ИЛИ Источник.ЮрФизЛицо = РаботаСНормативноСправочнойИнформацией.ПолучитьГоловнуюОрганизацию(ЮрФизЛицоОрганизации));
		
		РеквизитыОповещения = Новый Структура("СчетПринадлежитОрганизации, Организация, Наименование, НомерСчета, Валюта, Банк, ВидДоговора, ДатаДоговора, ДатаОткрытияРавнаДатеДоговора", СчетПринадлежитОрганизации);
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		
		РеквизитыОповещения.Вставить("ДатаОткрытия", Формат(Источник.ДатаОткрытия, "ДФ=dd.MM.yyyy"));
		
		Если СчетПринадлежитОрганизации Тогда
			Если ЗначениеЗаполнено(Источник.ДоговорЦессии) Тогда
				Договор = Источник.ДоговорЦессии;
			Иначе 
				Договор = Источник.Договор;
			КонецЕсли;
			
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ДатаЗаключения, ВидДоговора");
			
			РеквизитыОповещения.Вставить("Договор",							Договор);
			РеквизитыОповещения.Вставить("ВидДоговора",						РеквизитыДоговора.ВидДоговора);
			РеквизитыОповещения.Вставить("ДатаДоговора",					Формат(РеквизитыДоговора.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
			РеквизитыОповещения.Вставить("ДатаОткрытияРавнаДатеДоговора",	Источник.ДатаОткрытия = РеквизитыДоговора.ДатаЗаключения);
			РеквизитыОповещения.Вставить("ДатаЗакрытия",					Формат(Источник.ДатаЗакрытия, "ДФ=dd.MM.yyyy; ДП=-"));
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Доверенности") Тогда
		
		РеквизитыОповещения = Новый Структура("Организация, Наименование, ВозрастПоследнейАнкетыВДнях, Доверитель, ВидДоверенности, Номер");
		
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		
		РеквизитыОповещения.Вставить("ЭтоНовыйЭлемент",			?(ЭтоНовыйЭлемент, "Новый", "Изменен"));
		РеквизитыОповещения.Вставить("Дата",					Формат(Источник.Дата, "ДФ=dd.MM.yyyy"));
		РеквизитыОповещения.Вставить("ДатаНачалаДействия",		Формат(Источник.ДатаНачалаДействия, "ДФ=dd.MM.yyyy"));
		РеквизитыОповещения.Вставить("ДатаОкончанияДействия",	Формат(Источник.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy"));
		
		РеквизитыОповещения.Вставить("ДоверительЯвляетсяКлиентом",	Справочники.ЮрФизЛица.ЯвляетсяКлиентом(Источник.Доверитель, Источник.Организация, ТекущаяДата()));
		
		ЗаполнитьИзмененияРеквизитов(Источник, РеквизитыОповещения);
		
#Область АнкетыПоверенных

		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Период",		 ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", Источник.Организация);
		Запрос.УстановитьПараметр("Поверенные",	 Источник.Поверенные.ВыгрузитьКолонку("Поверенный"));
		
		Если Источник.ДополнительныеСвойства.Свойство("ПредЗначенияРеквизитов") Тогда
			Запрос.УстановитьПараметр("ПоверенныеПроверенныеРанее", Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов.Поверенные.Выгрузить().ВыгрузитьКолонку("Поверенный"));
		Иначе
			Запрос.УстановитьПараметр("ПоверенныеПроверенныеРанее",	Новый Массив); 
		КонецЕсли;
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЮрФизЛица.Ссылка КАК Поверенный,
			|	ЮрФизЛица.Ссылка В (&ПоверенныеПроверенныеРанее) КАК ПроверенРанее,
			|	РеквизитыЮрФизЛицАнкетныеСрезПоследних.Анкета ЕСТЬ НЕ NULL  КАК ЕстьАнкетаПоверенного,
			|	РеквизитыЮрФизЛицАнкетныеСрезПоследних.ДатаАнкеты КАК ДатаАнкетыПоверенного,
			|	РАЗНОСТЬДАТ(РеквизитыЮрФизЛицАнкетныеСрезПоследних.ДатаАнкеты, &Период, ДЕНЬ) КАК ВозрастАнкетыПоверенногоВДнях
			|ИЗ
			|	Справочник.ЮрФизЛица КАК ЮрФизЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
			|			РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Анкета,
			|			РеквизитыФизическихЛицАнкетныеСрезПоследних.Период КАК ДатаАнкеты
			|		ИЗ
			|			РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|					&Период,
			|					Организация = &Организация
			|						И ЮрФизЛицо В (&Поверенные)
			|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо,
			|			РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор,
			|			РеквизитыЮридическихЛицАнкетныеСрезПоследних.Период
			|		ИЗ
			|			РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|					&Период,
			|					Организация = &Организация
			|						И ЮрФизЛицо В (&Поверенные)
			|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних) КАК РеквизитыЮрФизЛицАнкетныеСрезПоследних
			|		ПО ЮрФизЛица.Ссылка = РеквизитыЮрФизЛицАнкетныеСрезПоследних.ЮрФизЛицо
			|ГДЕ
			|	ЮрФизЛица.Ссылка В(&Поверенные)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			РеквизитыОповещения.Вставить("Поверенный",				Выборка.Поверенный);
			РеквизитыОповещения.Вставить("ПроверенРанее",			Выборка.ПроверенРанее);
			РеквизитыОповещения.Вставить("ЕстьАнкетаПоверенного",	Выборка.ЕстьАнкетаПоверенного);
			РеквизитыОповещения.Вставить("ДатаАнкетыПоверенного",	Формат(Выборка.ДатаАнкетыПоверенного, "ДФ=dd.MM.yyyy"));
			РеквизитыОповещения.Вставить("ВозрастАнкетыПоверенногоВДнях", Выборка.ВозрастАнкетыПоверенногоВДнях);
			
			РеквизитыОповещения.Вставить("ПроверкаАнкетПоверенных",	
				ЭтоНовыйЭлемент 
				ИЛИ НЕ Выборка.ПроверенРанее
				ИЛИ (РеквизитыОповещения.Свойство("ИзменилсяРеквизитДоверитель") И РеквизитыОповещения.ИзменилсяРеквизитДоверитель));
			
			Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиСправочников, РеквизитыОповещения);
			
		КонецЦикла;
		
		РеквизитыОповещения.Вставить("ПроверкаАнкетПоверенных",	Ложь);
		
#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ДепозитарныеСчета") Тогда
		
		ЮрФизЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация, "ЮрФизЛицо");
		СчетПринадлежитОрганизации = (Источник.ВладелецСчета = ЮрФизЛицоОрганизации ИЛИ Источник.ВладелецСчета = РаботаСНормативноСправочнойИнформацией.ПолучитьГоловнуюОрганизацию(ЮрФизЛицоОрганизации));
		
		РеквизитыОповещения = Новый Структура("СчетПринадлежитОрганизации, Организация, НомерСчета, Депозитарий", СчетПринадлежитОрганизации);
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник);
		
		РеквизитыОповещения.Вставить("ДатаОткрытия", Формат(Источник.ДатаОткрытия, "ДФ=dd.MM.yyyy"));
		РеквизитыОповещения.Вставить("ДатаЗакрытия", Формат(Источник.ДатаЗакрытия, "ДФ=dd.MM.yyyy; ДП=-"));
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ДепозитныеВклады") Тогда
		
		Если НЕ ЭтоНовыйЭлемент И РаботаСоСправочниками.ИзмененыРеквизитыРеквизитыСправочника(Источник, "ДатаРегистрации,_НачальныйНоминал,ДатаНачалаНачисленияПроцентов",, Отказ) Тогда
			
			ТекущаяОрганизация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
			
			Если НЕ Отказ И Справочники.ДепозитныеВклады.БылиДвиженияПоДепозиту(Источник.Ссылка, ТекущаяОрганизация) Тогда
			
				РеквизитыОповещения = Новый Структура;
				РеквизитыОповещения.Вставить("Организация",								ТекущаяОрганизация);
				РеквизитыОповещения.Вставить("Депозит",									Источник.Ссылка);
				РеквизитыОповещения.Вставить("ДатаРегистрации", 						Источник.ДатаРегистрации);
				РеквизитыОповещения.Вставить("Номинал",									Источник._НачальныйНоминал);
				РеквизитыОповещения.Вставить("ДатаНачалаНачисленияПроцентов",			Источник.ДатаНачалаНачисленияПроцентов);
				
				Если Источник.ДатаРегистрации = Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов.ДатаРегистрации Тогда
					РеквизитыОповещения.Вставить("ДатаРегистрацииСтарая",				"");
				Иначе
					РеквизитыОповещения.Вставить("ДатаРегистрацииСтарая",				Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов.ДатаРегистрации);
				КонецЕсли;
				
				Если Источник._НачальныйНоминал = Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов._НачальныйНоминал Тогда
					РеквизитыОповещения.Вставить("НоминалСтарый",						"");
				Иначе
					РеквизитыОповещения.Вставить("НоминалСтарый",						Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов._НачальныйНоминал);
				КонецЕсли;
				
				Если Источник.ДатаНачалаНачисленияПроцентов = Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов.ДатаНачалаНачисленияПроцентов Тогда
					РеквизитыОповещения.Вставить("ДатаНачалаНачисленияПроцентовСтарая",	"");
				Иначе
					РеквизитыОповещения.Вставить("ДатаНачалаНачисленияПроцентовСтарая",	Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов.ДатаНачалаНачисленияПроцентов);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если РеквизитыОповещения <> Неопределено Тогда
		
		РеквизитыОповещения.Вставить("ЭтоНовыйЭлемент",		?(ЭтоНовыйЭлемент, "Новый", "Изменен"));
		РеквизитыОповещения.Вставить("ТекущийПользователь", РаботаСПользователями.ТекущийПользователь());
		
		ЗаполнитьИзмененияРеквизитов(Источник, РеквизитыОповещения);
		
		Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиСправочников, РеквизитыОповещения);

	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещенияПриОтменеПроведенияДокументов(Источник, Отказ) Экспорт
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;

	Если ДополнительныеСвойства.Свойство("ГрупповоеПроведение") И ДополнительныеСвойства.ГрупповоеПроведение = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// заполним персонифицированные реквизиты, зависящие от вида обрабатываемого документа
	РеквизитыОповещения = Неопределено;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Оплата") Тогда
		
		РеквизитыОповещения = Новый Структура;
		
		СуммаОплаты = Источник.Основания.Итог("Сумма") + Источник.Основания.Итог("СуммаОплатыКупона");
		
		РеквизитыОповещения.Вставить("ВидЗадолженности"			, Источник.ВидЗадолженности);
		РеквизитыОповещения.Вставить("ВидЗадолженностиРодитель"	, Источник.ВидЗадолженности.Родитель);
		РеквизитыОповещения.Вставить("Сумма"					, СуммаОплаты);
		РеквизитыОповещения.Вставить("Валюта"					, Источник.ВалютаОплаты);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоручениеНаДвижениеЦенныхБумаг") Тогда
		
		РеквизитыОповещения = ПолучитьРеквизитыДляПоручений(Источник);
			
	КонецЕсли;

	// получим и обработаем оповещения
	Если РеквизитыОповещения <> Неопределено Тогда
		
		РеквизитыОповещения.Вставить("Источник", Источник);
		
		// дополним реквизиты оповещения общими свойствами
		РеквизитыОповещения.Вставить("Дата");
		РеквизитыОповещения.Вставить("Организация");
		РеквизитыОповещения.Вставить("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
		РеквизитыОповещения.Вставить("Комментарий");
		
		Если Источник.Метаданные().Реквизиты.Найти("СчетДоверительногоУправления") <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник, "Дата, Организация, СчетДоверительногоУправления, Комментарий");
			
			// реквизиты счета д/у
			РеквизитыСчетаДоверительногоУправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыОповещения.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления, НомерДоговора, ДатаЗаключения");
			
			РеквизитыОповещения.Вставить("ВидДоговораДоверительногоУправления",   РеквизитыСчетаДоверительногоУправления.ВидДоговораДоверительногоУправления);
			РеквизитыОповещения.Вставить("НомерДоговораДоверительногоУправления", РеквизитыСчетаДоверительногоУправления.НомерДоговора);
			РеквизитыОповещения.Вставить("ДатаДоговораДоверительногоУправления",  Формат(РеквизитыСчетаДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy"));

		Иначе
			ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Источник, "Дата, Организация, Комментарий");
		КонецЕсли;
		
		Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриОтменеПроведенияДокумента, РеквизитыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещенияПриЗаписиДвиженийРегистровНакопления(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ОстаткиЦенныхБумаг") Тогда
				
		ПроверитьДвиженияПаевСобственногоПортфеляИСформироватьОповещение(Источник);
				                    
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Процедура УстановитьПрефиксНомераДокумента(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если ПустаяСтрока(Префикс) Тогда
		Если Источник.Метаданные().Нумератор = Метаданные.НумераторыДокументов.Автоматический Тогда
			Префикс = Источник.Организация.ПрефиксНумерации + "-50";
		ИначеЕсли Источник.Метаданные().Нумератор = Метаданные.НумераторыДокументов.СпециальныйВПределахДня Тогда
			Префикс = Источник.Организация.ПрефиксНумерации + "-" +  Формат(Источник.Дата, "ДФ=ггггММдд") + "-";
		Иначе
			Префикс = Источник.Организация.ПрефиксНумерации + "-00";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УстановитьПрефиксНомераДокумента

Процедура УстановитьПрефиксКодаСправочника(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если ПустаяСтрока(Префикс) Тогда
		Префикс = Источник.Организация.ПрефиксНумерации + "-0";
	КонецЕсли;
	
КонецПроцедуры // УстановитьПрефиксКодаСправочника

////////////////////////////////////////////////////////////////////////////////

Процедура ПроверкаЗапретаРедактированияУчетныхРегистров(Источник, Отказ, Замещение) Экспорт  

	Если Источник.ДополнительныеСвойства.Свойство("УдалениеВСоставеИзмененияНабора") И Источник.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗаписьВСоставеРасчетаПартий") И Источник.ДополнительныеСвойства.ЗаписьВСоставеРасчетаПартий Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.Свойство("ЗаписьВСоставеФБУ") И Источник.ДополнительныеСвойства.ЗаписьВСоставеФБУ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПроверкиЗапретаРедактирования = Неопределено;
	
	РегистрМД			= Источник.Метаданные();
	ПолноеИмяРегистра	= РегистрМД.ПолноеИмя();

	ЕстьОтборПоРегистратору = Источник.Отбор.Найти("Регистратор") <> Неопределено;	
	Если ЕстьОтборПоРегистратору Тогда
		Регистратор = Источник.Отбор.Регистратор.Значение;
	Иначе
		Регистратор = Неопределено;
	КонецЕсли;    
	
	// Отбор ставим либо по счету д/у из измерения, либо из реквизита регистратора.
	// Если ни там, ни там нет, то для регистра с движениями по клиенту получаем связанные с ним счета д/у.
	// Если счета д/у определить не удалось, то проверять не по кому
	
	Если РегистрМД.Измерения.Найти("СчетДоверительногоУправления") <> Неопределено Тогда	
		
		СчетаДоверительногоУправления = "Регистр.СчетДоверительногоУправления";
		
		Если РегистрМД.Имя = "ВводыВыводыАктивовВВалютеУчета" Тогда
			
			#Область Таблица_проверки_запрета_редактирования_для_регистра_вводов_выводов_активов
			
			// Перед записью запоминаем действующие значения регистра, а при записи сравниваем изменения
			
			Если Источник.ДополнительныеСвойства.Свойство("ПередЗаписью") Тогда
				Источник.ДополнительныеСвойства.Вставить("НаборЗаписейПередЗаписью", ПолучитьНаборЗаписейПоРегистратору(ПолноеИмяРегистра, Регистратор, Истина));
				Возврат;		
			Иначе
				ТаблицаПроверкиЗапретаРедактирования = РаботаСМетаданнымиПовтИсп.МенеджерОбъектаМетаданных(ПолноеИмяРегистра).ПолучитьТаблицуПроверкиДатЗапретаРедактирования(Источник);		
			КонецЕсли;			
			
			#КонецОбласти
			
		КонецЕсли;
		
	ИначеЕсли ЕстьОтборПоРегистратору И Регистратор.Метаданные().Реквизиты.Найти("СчетДоверительногоУправления") <> Неопределено Тогда
		
		СчетаДоверительногоУправления = Регистратор.СчетДоверительногоУправления;
		
	ИначеЕсли РаботаСМетаданнымиПовтИсп.РегистрыСРегистрациейПоКлиенту().Получить(ПолноеИмяРегистра) <> Неопределено Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("ПередЗаписью") Тогда
			НаборЗаписей = ПолучитьНаборЗаписейПоРегистратору(ПолноеИмяРегистра, Регистратор);
		Иначе
			НаборЗаписей = Источник;
		КонецЕсли;
		
		Если РегистрМД.Имя = "АналогиЦенныхБумаг" Тогда
			ТаблицаПроверкиЗапретаРедактирования = РаботаСМетаданнымиПовтИсп.МенеджерОбъектаМетаданных(ПолноеИмяРегистра).ПолучитьТаблицуПроверкиДатЗапретаРедактирования(НаборЗаписей);		
			СчетаДоверительногоУправления = Неопределено;
		Иначе
			СчетаДоверительногоУправления = РаботаСМетаданнымиПовтИсп.МенеджерОбъектаМетаданных(ПолноеИмяРегистра).ПолучитьСвязанныеСчетаДоверительногоУправления(НаборЗаписей);
		КонецЕсли;	

	ИначеЕсли РегистрМД.Имя = "ЗначенияДополнительныхСведений" Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("ПередЗаписью") Тогда
			НаборЗаписейПередЗаписью = РаботаСМетаданнымиПовтИсп.МенеджерОбъектаМетаданных(ПолноеИмяРегистра).ПолучитьТаблицуНабораЗаписейПередЗаписью(Источник);
			Источник.ДополнительныеСвойства.Вставить("НаборЗаписейПередЗаписью", НаборЗаписейПередЗаписью);
			Возврат;		
		Иначе
			ТаблицаПроверкиЗапретаРедактирования = РаботаСМетаданнымиПовтИсп.МенеджерОбъектаМетаданных(ПолноеИмяРегистра).ПолучитьТаблицуПроверкиДатЗапретаРедактирования(Источник);
		КонецЕсли;
		
	Иначе
		Возврат;		
	КонецЕсли;
	
	// Если таблица проверки не переопределена, заполняем алгоритмом по умолчанию
	
	Если ТаблицаПроверкиЗапретаРедактирования = Неопределено Тогда	
	
		// регистры можно разделить на 3 группы:
		//	- "проводки": бух. регистры (они всегда содержат вид учета)
		//	- "партии": регистры сведений и накоплений, содержащие вид учета (одноименное измерение)
		//	- "бэк-офис": прочие регистры сведений и накоплений
		
		ГруппаЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.ПустаяСсылка();
		
		СписокРегистровБухгалтерии	= РаботаСМетаданнымиПовтИсп.ПолучитьСписокРегистровБухгалтерии();
		СписокРегистровСПроводками	= РаботаСМетаданнымиПовтИсп.ПолучитьСписокРегистровСПроводками();
		СписокРегистровСПартиями	= РаботаСМетаданнымиПовтИсп.ПолучитьСписокРегистровСПартиями();
		
		Если СписокРегистровСПроводками[РегистрМД.Имя] <> Неопределено Тогда	
			
			ГруппаЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.Проводки;
			
			Если СписокРегистровБухгалтерии[РегистрМД.Имя] <> Неопределено Тогда
				ВидыУчета = Перечисления.ВидыУчета[РегистрМД.Имя];
			ИначеЕсли СтрЗаканчиваетсяНа(РегистрМД.Имя, "ЕПС") Тогда
				ВидыУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
			ИначеЕсли РегистрМД.Имя = "ПорученияНаПереоценку" Тогда
				ВидыУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
			Иначе
				ВызватьИсключение "Не удалось определить вид учета записей регистра '" + РегистрМД.Синоним + "'";
			КонецЕсли;
			
		ИначеЕсли СписокРегистровСПартиями[РегистрМД.Имя] <> Неопределено Тогда
			
			ГруппаЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.Партии;
			
		Иначе
			
			ГруппаЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.БэкОфис;
			ВидыУчета                   = Перечисления.ВидыУчета.ПустаяСсылка();
			
		КонецЕсли;	
		
		// Собираем запрос	
		
		Запрос = Новый Запрос;
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	&Активность КАК Активность,
			|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК Период,
			|	&Организация КАК Организация,
			|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	&ГруппаЗапрета КАК ГруппаЗапрета,
			|	&ВидУчета КАК ВидУчета
			|ПОМЕСТИТЬ _ДвиженияДокумента
			|ИЗ
			|	&НаборЗаписей КАК Регистр";	
		
		ЕстьСтандРеквизитАктивность	= Ложь;
		Для Каждого Поле Из РегистрМД.СтандартныеРеквизиты Цикл
			Если Поле.Имя = "Активность" Тогда
				  ЕстьСтандРеквизитАктивность = Истина;
				  Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьСтандРеквизитАктивность Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Активность", "Регистр.Активность");
		Иначе
			Запрос.УстановитьПараметр("Активность", Истина);
		КонецЕсли;
		
		ЭтоНепериодическийРегистрСведений = СтрНачинаетсяС(ПолноеИмяРегистра, "РегистрСведений.") 
			И (РегистрМД.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);		
		
		Если ЭтоНепериодическийРегистрСведений Тогда
			Запрос.УстановитьПараметр("Период", Регистратор.Дата);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Период", "Регистр.Период");
		КонецЕсли;

		Если РегистрМД.Измерения.Найти("Организация") = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Регистратор.Организация);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организация", "Регистр.Организация");
		КонецЕсли;

		Если ГруппаЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.Партии Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидУчета", "Регистр.ВидУчета");
		Иначе
			Запрос.УстановитьПараметр("ВидУчета", ВидыУчета);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("ГруппаЗапрета", ГруппаЗапретаРедактирования);
		
		// если это регистр партий - возможно наличие записей в наборе по разным видам учета. Порядок дейтсвий следующий:
		// ПередЗаписью набора формируем таблицу, содержащую записи, запрещенные для редактирования, вставляем ее в ДополнительныеСвойства набора
		// ПриЗаписи набора формируем аналогичную таблицу, сверяем ее с таблицей из доп. свойств. Выводим ошибки при наличии расхождений
		
		// для прочих регистров проверяем только наличие записей, запрещенных для редактирования. Если такие есть - выводим ошибки
		
		Если Источник.ДополнительныеСвойства.Свойство("ПередЗаписью") Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
				|ГДЕ
				|	Регистр.Регистратор = &Регистратор";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НаборЗаписей", ПолноеИмяРегистра);
			
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			
		Иначе
			
			Запрос.УстановитьПараметр("НаборЗаписей", Источник.Выгрузить());
			
		КонецЕсли;
		
		// Если отбор по одному счету д/у, то просто устанавливаем его.
		// Если отбор по массиву счетов, то множим записи набора по каждому.
		
		Если ТипЗнч(СчетаДоверительногоУправления) = Тип("Строка") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетДоверительногоУправления", "Регистр.СчетДоверительногоУправления");
		ИначеЕсли ТипЗнч(СчетаДоверительногоУправления) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетаДоверительногоУправления);
		ИначеЕсли ТипЗнч(СчетаДоверительногоУправления) = Тип("Массив") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетДоверительногоУправления КАК СчетДоверительногоУправления,", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ _ДвиженияДокумента", "ПОМЕСТИТЬ _ДвиженияДокументаБезСчетов");
			ТекстЗапроса = ТекстЗапроса + "
				|;
				|" +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ДвиженияДокументаБезСчетов.*,
				|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления			
				|ПОМЕСТИТЬ _ДвиженияДокумента
				|ИЗ
				|	_ДвиженияДокументаБезСчетов КАК _ДвиженияДокументаБезСчетов
				|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|	ПО СчетаДоверительногоУправления.Ссылка В (&СчетДоверительногоУправления)";
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетаДоверительногоУправления);
		КонецЕсли;
		
	Иначе
		
		// Проверка непосредственно по таблице	
		
		Запрос = Новый Запрос;
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаПроверки.Организация КАК Организация,
			|	ТаблицаПроверки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ТаблицаПроверки.ГруппаЗапрета КАК ГруппаЗапрета,
			|	ТаблицаПроверки.ВидУчета КАК ВидУчета,
			|	ТаблицаПроверки.Период КАК Период,
			|	ИСТИНА КАК Активность
			|ПОМЕСТИТЬ _ДвиженияДокумента
			|ИЗ
			|	&ТаблицаПроверки КАК ТаблицаПроверки";

		Запрос.УстановитьПараметр("ТаблицаПроверки", ТаблицаПроверкиЗапретаРедактирования);	
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса + "
		|;
		|" +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДатыЗапретаРедактирования.ВидУчета КАК ВидУчета
		|ИЗ
		|	_ДвиженияДокумента КАК _ДвиженияДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|		ПО _ДвиженияДокумента.Организация = ДатыЗапретаРедактирования.Организация
		|			И _ДвиженияДокумента.СчетДоверительногоУправления = ДатыЗапретаРедактирования.СчетДоверительногоУправления
		|			И _ДвиженияДокумента.ГруппаЗапрета = ДатыЗапретаРедактирования.ГруппаЗапрета
		|			И _ДвиженияДокумента.ВидУчета = ДатыЗапретаРедактирования.ВидУчета
		|			И _ДвиженияДокумента.Период <= ДатыЗапретаРедактирования.ДатаЗапретаРедактирования
		|ГДЕ
		|	_ДвиженияДокумента.Активность";

	Если ГруппаЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.Партии Тогда
		
		ВидыУчета = Запрос.Выполнить().Выгрузить();
		
		Если Источник.ДополнительныеСвойства.Свойство("ВидыУчета") Тогда
			Для каждого ВидУчета Из ВидыУчета Цикл
				ЗаполнитьЗначенияСвойств(Источник.ДополнительныеСвойства.ВидыУчета.Добавить(), ВидУчета);
			КонецЦикла; 
		Иначе
			Источник.ДополнительныеСвойства.Вставить("ВидыУчета", ВидыУчета);
		КонецЕсли; 
		
		ПараметрыПроверки = Новый Структура;
		ПараметрыПроверки.Вставить("Источник", 			Источник);
		ПараметрыПроверки.Вставить("ПолноеИмяРегистра", ПолноеИмяРегистра);
		ПараметрыПроверки.Вставить("Регистратор",		Регистратор);
		ПараметрыПроверки.Вставить("Запрос", 			Запрос);
		
		РезультатЗапроса = ПроверитьЗаписиРегистраПартий(ПараметрыПроверки);
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + "
			|ИТОГИ ПО
			|	ДатыЗапретаРедактирования.ВидУчета";
		
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЕсли;
			
	Если Не РезультатЗапроса = Неопределено Тогда
		
		ВыборкаПоВидуУчета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВидуУчета.Следующий() Цикл
			
			ПредставлениеРегистра = РегистрМД.Представление();
			Если ГруппаЗапретаРедактирования = Перечисления.ГруппыЗапретаРедактирования.Партии
				ИЛИ ГруппаЗапретаРедактирования = Неопределено И ЗначениеЗаполнено(ВыборкаПоВидуУчета.ВидУчета)
			Тогда
				ПредставлениеРегистра = ПредставлениеРегистра + "' по виду учета '" + ВыборкаПоВидуУчета.ВидУчета;
			КонецЕсли; 
			
			ТекстСообщения = СтрШаблон("Запрещено редактирование регистра '%1', т.к. период меньше даты запрета редактирования",
				ПредставлениеРегистра + ?(ЕстьОтборПоРегистратору,"' по документу '" + Регистратор, ""));
				
			Если ТипЗнч(СчетаДоверительногоУправления) = Тип("Массив") ИЛИ СчетаДоверительногоУправления = Неопределено Тогда
				ЗакрытыеСчета = Новый Массив;
				ВыборкаПоСчетуДоверительногоУправления = ВыборкаПоВидуУчета.Выбрать();
				Пока ВыборкаПоСчетуДоверительногоУправления.Следующий() Цикл
					ЗакрытыеСчета.Добавить(ВыборкаПоСчетуДоверительногоУправления.СчетДоверительногоУправления);		
				КонецЦикла;
				ТекстСообщения = ТекстСообщения + " " + СтрСоединить(ЗакрытыеСчета, ", ");
			КонецЕсли;
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Регистратор, , , Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверкаЗапретаРедактированияУчетныхРегистров

Процедура ПроверкаЗапретаРедактированияУчетныхРегистровПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ПередЗаписью");
	ПроверкаЗапретаРедактированияУчетныхРегистров(Источник, Отказ, Замещение);
	Источник.ДополнительныеСвойства.Удалить("ПередЗаписью");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Процедура ПередЗаписьюРегистров(Источник, Отказ, Замещение) Экспорт
	
	// Если происходит всамделешное удаление набора записей, то в ПередЗаписью Модифицированность()=ИСТИНА,
	// а если удаление, которое предшествует записи нового набора (при изменении) — ЛОЖЬ
	Источник.ДополнительныеСвойства.Вставить("УдалениеВСоставеИзмененияНабора", Источник.Количество() = 0 И Не Источник.Модифицированность());
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РаспределенияАктивовЕПС") Тогда
		
		#Область РаспределенияАктивовЕПС
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЮрФизЛицо_Сургутнефтегаз",	ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сургутнефтегаз"));
		Запрос.УстановитьПараметр("НаборЗаписей",				Источник.Выгрузить());
		Запрос.Текст =
		#Область ТекстЗапроса
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КлиентыДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _СДУ
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
			|ГДЕ
			|	КлиентыДоверительногоУправления.Клиент = &ЮрФизЛицо_Сургутнефтегаз
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НаборЗаписей.Активность КАК Активность,
			|	НаборЗаписей.Организация КАК Организация,
			|	НаборЗаписей.Сделка КАК Сделка,
			|	НаборЗаписей.Рынок КАК Рынок,
			|	НаборЗаписей.ЦеннаяБумага КАК ЦеннаяБумага,
			|	НаборЗаписей.Количество КАК Количество,
			|	НаборЗаписей.УчетныйАктивЕПС КАК УчетныйАктивЕПС
			|ПОМЕСТИТЬ _НаборЗаписей
			|ИЗ
			|	&НаборЗаписей КАК НаборЗаписей
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_НаборЗаписей.Организация КАК Организация,
			|	_НаборЗаписей.Сделка КАК Сделка,
			|	_НаборЗаписей.Рынок КАК Рынок,
			|	_НаборЗаписей.Количество КАК Количество,
			|	_НаборЗаписей.ЦеннаяБумага КАК ЦеннаяБумага
			|ПОМЕСТИТЬ _НовыйНаборЗаписей
			|ИЗ
			|	_НаборЗаписей КАК _НаборЗаписей
			|ГДЕ
			|	ВЫБОР
			|			КОГДА _НаборЗаписей.Сделка ССЫЛКА Документ.Сделка
			|				ТОГДА ВЫРАЗИТЬ(_НаборЗаписей.Сделка КАК Документ.Сделка).СчетДоверительногоУправления
			|			КОГДА _НаборЗаписей.Сделка ССЫЛКА Документ.Сделка
			|				ТОГДА ВЫРАЗИТЬ(_НаборЗаписей.Сделка КАК Документ.СделкаРЕПО).СчетДоверительногоУправления
			|			ИНАЧЕ ВЫРАЗИТЬ(_НаборЗаписей.Сделка КАК Документ.СделкаСВалютой).СчетДоверительногоУправления
			|		КОНЕЦ В
			|			(ВЫБРАТЬ
			|				_СДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|			ИЗ
			|				_СДУ КАК _СДУ)
			|	И _НаборЗаписей.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД))
			|	И _НаборЗаписей.Активность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаспределенияАктивовЕПС.Организация КАК Организация,
			|	РаспределенияАктивовЕПС.Сделка КАК Сделка,
			|	РаспределенияАктивовЕПС.Рынок КАК Рынок,
			|	РаспределенияАктивовЕПС.ЦеннаяБумага КАК ЦеннаяБумага
			|ПОМЕСТИТЬ _ТекущийСнимокРегистра
			|ИЗ
			|	РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
			|ГДЕ
			|	(РаспределенияАктивовЕПС.Организация, РаспределенияАктивовЕПС.Сделка, РаспределенияАктивовЕПС.Рынок, РаспределенияАктивовЕПС.ЦеннаяБумага) В
			|			(ВЫБРАТЬ
			|				_НовыйНаборЗаписей.Организация КАК Организация,
			|				_НовыйНаборЗаписей.Сделка КАК Сделка,
			|				_НовыйНаборЗаписей.Рынок КАК Рынок,
			|				_НовыйНаборЗаписей.ЦеннаяБумага КАК ЦеннаяБумага
			|			ИЗ
			|				_НовыйНаборЗаписей КАК _НовыйНаборЗаписей)
			|	И РаспределенияАктивовЕПС.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД))
			|	И ВЫБОР
			|			КОГДА РаспределенияАктивовЕПС.Сделка ССЫЛКА Документ.Сделка
			|				ТОГДА ВЫРАЗИТЬ(РаспределенияАктивовЕПС.Сделка КАК Документ.Сделка).СчетДоверительногоУправления
			|			КОГДА РаспределенияАктивовЕПС.Сделка ССЫЛКА Документ.Сделка
			|				ТОГДА ВЫРАЗИТЬ(РаспределенияАктивовЕПС.Сделка КАК Документ.СделкаРЕПО).СчетДоверительногоУправления
			|			ИНАЧЕ ВЫРАЗИТЬ(РаспределенияАктивовЕПС.Сделка КАК Документ.СделкаСВалютой).СчетДоверительногоУправления
			|		КОНЕЦ В
			|			(ВЫБРАТЬ
			|				_СДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|			ИЗ
			|				_СДУ КАК _СДУ)
			|	И РаспределенияАктивовЕПС.Активность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_НовыйНаборЗаписей.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА _НовыйНаборЗаписей.Сделка ССЫЛКА Документ.Сделка
			|			ТОГДА ВЫРАЗИТЬ(_НовыйНаборЗаписей.Сделка КАК Документ.Сделка).СчетДоверительногоУправления
			|		КОГДА _НовыйНаборЗаписей.Сделка ССЫЛКА Документ.СделкаРЕПО
			|			ТОГДА ВЫРАЗИТЬ(_НовыйНаборЗаписей.Сделка КАК Документ.СделкаРЕПО).СчетДоверительногоУправления
			|		ИНАЧЕ ВЫРАЗИТЬ(_НовыйНаборЗаписей.Сделка КАК Документ.СделкаСВалютой).СчетДоверительногоУправления
			|	КОНЕЦ КАК СчетДоверительногоУправления,
			|	_НовыйНаборЗаписей.Сделка КАК Сделка,
			|	_НовыйНаборЗаписей.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_НовыйНаборЗаписей.Количество КАК Количество
			|ИЗ
			|	_НовыйНаборЗаписей КАК _НовыйНаборЗаписей
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ТекущийСнимокРегистра КАК _ТекущийСнимокРегистра
			|		ПО _НовыйНаборЗаписей.Организация = _ТекущийСнимокРегистра.Организация
			|			И _НовыйНаборЗаписей.Сделка = _ТекущийСнимокРегистра.Сделка
			|			И _НовыйНаборЗаписей.Рынок = _ТекущийСнимокРегистра.Рынок
			|			И _НовыйНаборЗаписей.ЦеннаяБумага = _ТекущийСнимокРегистра.ЦеннаяБумага
			|ГДЕ
			|	_ТекущийСнимокРегистра.Сделка ЕСТЬ NULL";
		#КонецОбласти
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			ТекстСообщения = "";
			
			Пока Выборка.Следующий() Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС +
					"<tr><td>" + Выборка.Организация + "</td><td>" + Выборка.СчетДоверительногоУправления + "</td><td>" + Выборка.Сделка + "</td><td class=""greentext"">" + Выборка.ЦеннаяБумага + "</td><td align=""center"" class=""purple"">" + Выборка.Количество + "</td></tr>";
			КонецЦикла;
			
			ТекстСообщения = 
				"<html><head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
				|	<style>
				|		body       { font: 10pt sans-serif; }
				|		table      { text-align: left; border-spacing: 0; border-collapse: collapse; }
				|		td         { vertical-align: top; border: 1px solid #CCC085; padding: 5px; }
				|		.top       { font-size: 14px; background: #F4ECC5; }
				|		.greentext { color: #009646; }
				|		.purple    { color: #8B008B; }
				|	</style>
				|</head>
				|<body>
				|<table cols=""5"">
				|<tr class=""top""><td colspan=""5"">Перечень ценных бумаг классифицированных в категорию 'До погашения'</td></tr>
				|<tr class=""top""><td>Организация</td><td>Счет доверительного управления</td><td>Сделка</td><td>Ценная бумага</td><td>Количество</td></tr>
				|" + ТекстСообщения + "</table></body></html>";
			
			РеквизитыОповещения = Новый Структура("Тема, Текст", "Результат проверки на классификацию актива в категорию 'До погашения'", ТекстСообщения);
			
			Справочники.Оповещения.СформироватьОповещения("РегистрСведений.РаспределенияАктивовЕПС", Перечисления.ТипыСобытий.ПередЗаписьюРегистраСведений, РеквизитыОповещения);
			
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДоговорыСчетовДоверительногоУправления") 		
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ЛицензииДоговоровДоверительногоУправления")
	Тогда
	
		#Область ДоговорыСчетовДоверительногоУправления_ЛицензииДоговоровДоверительногоУправления
	
		Если НЕ Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("ПредыдущаяАктивностьДоговоровПоВидамДеятельности") Тогда
			
			Источник.ЗаписьИсторииДанных.ДобавитьДополнительныеДанные(
				"ПредыдущаяАктивностьДоговоровПоВидамДеятельности", 
				РегистрыСведений.ДоговорыСчетовДоверительногоУправления.ПолучитьАктивностьДоговоровПоВидамДеятельности(Источник.Отбор),
				"ПредыдущаяАктивностьДоговоровПоВидамДеятельности");
				
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.КодыСчетовДоверительногоУправленияУБрокеров") Тогда
		
		#Область КодыСчетовДоверительногоУправленияУБрокеров
		
		Если Не Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("КодыУБрокераПередЗаписью") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период,
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация КАК Организация,
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
				|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.КодFORTS КАК КодFORTS
				|ИЗ
				|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
				|ГДЕ
				|	&Отбор";
			
			Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				
				Если ЭлементОтбора.Имя <> "Период" И ЭлементОтбора.Использование Тогда
					
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", "&Отбор И " + ЭлементОтбора.Имя + " = &" + ЭлементОтбора.Имя + "");
					Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", "ИСТИНА");
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Вставить("КодыУБрокераПередЗаписью", РезультатЗапроса.Выгрузить());
				
			Иначе
				
				КодыСчетовДоверительногоУправленияУБрокеровМД = Метаданные.РегистрыСведений.КодыСчетовДоверительногоУправленияУБрокеров;
				
				КодыУБрокераБезЗаписей = Новый ТаблицаЗначений;
				КодыУБрокераБезЗаписей.Колонки.Добавить("Период",                       Новый ОписаниеТипов("Дата"));
				КодыУБрокераБезЗаписей.Колонки.Добавить("Организация",                  КодыСчетовДоверительногоУправленияУБрокеровМД.Измерения.Организация.Тип);
				КодыУБрокераБезЗаписей.Колонки.Добавить("СчетДоверительногоУправления", КодыСчетовДоверительногоУправленияУБрокеровМД.Измерения.СчетДоверительногоУправления.Тип);
				КодыУБрокераБезЗаписей.Колонки.Добавить("Брокер",                       КодыСчетовДоверительногоУправленияУБрокеровМД.Измерения.Брокер.Тип);
				КодыУБрокераБезЗаписей.Колонки.Добавить("Код",                          КодыСчетовДоверительногоУправленияУБрокеровМД.Ресурсы.Код.Тип);
				КодыУБрокераБезЗаписей.Колонки.Добавить("КодFORTS",                     КодыСчетовДоверительногоУправленияУБрокеровМД.Ресурсы.КодFORTS.Тип);
				
				Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Вставить("КодыУБрокераПередЗаписью", КодыУБрокераБезЗаписей);
				
			КонецЕсли;
	
		КонецЕсли;
		
		#КонецОбласти
						
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ОстаткиЦенныхБумаг") И Источник.Количество() = 0 Тогда
			
		ПроверитьДвиженияПаевСобственногоПортфеляИСформироватьОповещение(Источник);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДокументыЮридическихЛиц")
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ВхожденияВРеестры") 
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛиц") 
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛицАнкетные") Тогда
		
		РаботаСОтчетностьюЦБ.ДобавитьДанныеДляПроверкиРеквизитовАудитора(Источник);
		
		#Область РеквизитыЮридическихЛиц
		
		Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыЮридическихЛиц") 
			И Источник.ДополнительныеСвойства.Свойство("ЮридическиеЛицаПоДействующимСчетамДУ")
			И Не Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("РеквизитыЮридическихЛицПередЗаписью") Тогда
			
			// Необходимо проверить изменение наименования по уставу у брокеров, депозитариев, банков, связанных со счетами ДУ РЭМа и Траста
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			Запрос.УстановитьПараметр("ТекущаяДата", 							ТекущаяДатаСеанса());
			Запрос.УстановитьПараметр("ЮридическиеЛицаПоДействующимСчетамДУ", 	Источник.ДополнительныеСвойства.ЮридическиеЛицаПоДействующимСчетамДУ);
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЮридическиеЛицаПоДействующимСчетамДУ.ЮрФизЛицо КАК ЮрФизЛицо,
				|	ЮридическиеЛицаПоДействующимСчетамДУ.Организация КАК Организация
				|ПОМЕСТИТЬ _ЮрЛицаДляПроверки
				|ИЗ
				|	&ЮридическиеЛицаПоДействующимСчетамДУ КАК ЮридическиеЛицаПоДействующимСчетамДУ";
			
			Запрос.Выполнить();
			
			// Запоминаем наименование по уставу и организацию для полученных юр. лиц
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
				|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
				|	РеквизитыЮридическихЛицСрезПоследних.Язык КАК Язык,
				|	РеквизитыЮридическихЛицСрезПоследних.Подразделение КАК Подразделение,
				|	_ЮрЛицаДляПроверки.Организация КАК Организация
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&ТекущаяДата, ИСТИНА) КАК РеквизитыЮридическихЛицСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЮрЛицаДляПроверки КАК _ЮрЛицаДляПроверки
				|		ПО РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо = _ЮрЛицаДляПроверки.ЮрФизЛицо";
									
			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				
				Если ЭлементОтбора.Имя <> "Период" И ЭлементОтбора.Использование Тогда
					
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И " + ЭлементОтбора.Имя + " = &" + ЭлементОтбора.Имя + "");
					Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда 				
				Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Вставить("РеквизитыЮридическихЛицПередЗаписью", РезультатЗапроса.Выгрузить());				
			КонецЕсли;
	
		КонецЕсли;
		
		#КонецОбласти	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.УсловияОферт") И Не (Источник.Количество() = 0 И Источник.Модифицированность()) Тогда
		
	#Область УсловияОферт
		Если Не Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("МВТ_УсловияОфертПередЗаписью") Тогда
		
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	УсловияОферт.Облигация КАК Облигация,
				|	УсловияОферт.ДатаВыкупа КАК ДатаВыкупа,
				|	УсловияОферт.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
				|	УсловияОферт.ЦенаПроцент КАК ЦенаПроцент,
				|	УсловияОферт.Цена КАК Цена,
				|	УсловияОферт.АкцептС КАК АкцептС,
				|	УсловияОферт.АкцептПо КАК АкцептПо,
				|	УсловияОферт.ТипОферты КАК ТипОферты,
				|	УсловияОферт.ДатаОбъявления КАК ДатаОбъявления
				|ПОМЕСТИТЬ _УсловияОфертПередЗаписью
				|ИЗ
				|	РегистрСведений.УсловияОферт КАК УсловияОферт
				|ГДЕ
				|	(УсловияОферт.ДатаВыкупа >= &ТекущаяДатаСеанса И УсловияОферт.АкцептПо = ДАТАВРЕМЯ(1,1,1) ИЛИ УсловияОферт.АкцептПо >= &ТекущаяДатаСеанса)
				|	И УсловияОферт.ТипОферты В (ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта))
				|	И ИСТИНА";
			
			Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
			
			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				
				Если ЭлементОтбора.Использование Тогда
					
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И УсловияОферт." + ЭлементОтбора.Имя + " = &" + ЭлементОтбора.Имя + "");
					Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Запрос.Выполнить();
							
			Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Вставить("МВТ_УсловияОфертПередЗаписью", Запрос.МенеджерВременныхТаблиц);				
		
		КонецЕсли;
	#КонецОбласти
			
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СостояниеСотрудниковОрганизаций") И Не (Источник.Количество() = 0 И Источник.Модифицированность()) Тогда
		
	#Область СостояниеСотрудниковОрганизаций
		Если Не Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("МВТ_СостояниеСотрудниковОрганизацийПередЗаписью") Тогда
		
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	СостояниеСотрудниковОрганизаций.Период КАК Период,
				|	СостояниеСотрудниковОрганизаций.Организация КАК Организация,
				|	СостояниеСотрудниковОрганизаций.Сотрудник КАК Сотрудник,
				|	СостояниеСотрудниковОрганизаций.Состояние КАК Состояние
				|ПОМЕСТИТЬ _СостояниеСотрудниковОрганизацийПередЗаписью
				|ИЗ
				|	РегистрСведений.СостояниеСотрудниковОрганизаций КАК СостояниеСотрудниковОрганизаций
				|ГДЕ
				|	ИСТИНА";
			
			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				Если ЭлементОтбора.Использование Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И СостояниеСотрудниковОрганизаций." + ЭлементОтбора.Имя + " = &" + ЭлементОтбора.Имя + "");
					Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
				КонецЕсли;
			КонецЦикла;
			
			Запрос.Выполнить();
							
			Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Вставить("МВТ_СостояниеСотрудниковОрганизацийПередЗаписью", Запрос.МенеджерВременныхТаблиц);				
		
		КонецЕсли;
	#КонецОбласти
			
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СтатусыМЧД") И Не (Источник.Количество() = 0 И Источник.Модифицированность()) Тогда
		
	#Область СостояниеСотрудниковОрганизаций
		Если Не Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("МВТ_СтатусыМЧДПередЗаписью") Тогда
		
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СтатусыМЧДСрезПоследних.Период КАК Период,
				|	СтатусыМЧДСрезПоследних.Организация КАК Организация,
				|	СтатусыМЧДСрезПоследних.Доверенность КАК Доверенность,
				|	СтатусыМЧДСрезПоследних.Статус КАК Статус,
				|	СтатусыМЧДСрезПоследних.УстановленВручную КАК УстановленВручную,
				|	СтатусыМЧДСрезПоследних.Комментарий КАК Комментарий
				|ПОМЕСТИТЬ _СтатусыМЧДПередЗаписью
				|ИЗ
				|	РегистрСведений.СтатусыМЧД.СрезПоследних(&ТекущаяДата, ИСТИНА) КАК СтатусыМЧДСрезПоследних";
			
			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				Если ЭлементОтбора.Имя <> "Период" И ЭлементОтбора.Использование Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И " + ЭлементОтбора.Имя + " = &" + ЭлементОтбора.Имя + "");
					Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
				КонецЕсли;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
			Запрос.Выполнить();
							
			Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Вставить("МВТ_СтатусыМЧДПередЗаписью", Запрос.МенеджерВременныхТаблиц);				
		
		КонецЕсли;
	#КонецОбласти
			
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыФизическихЛицАнкетные")
		ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыСотрудниковОрганизации") Тогда
		
		РегистрыСведений.ЖурналСверкиСоСписками.ДобавитьДанныеДляПроверкиРеквизитовЛицПодлежащихСверкеСоСписками(Источник);
		
	КонецЕсли;
	
	МетаданныеРегистра = Источник.Метаданные();
	ЭтоРегистрСведений = Метаданные.РегистрыСведений.Найти(МетаданныеРегистра.Имя) <> Неопределено;
	РегистрПодчиненРегистратору = Не ЭтоРегистрСведений
		Или МетаданныеРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору;
	
	// Проверка движений документа "Корректировка регистров"
	Если РегистрПодчиненРегистратору И ЗначениеЗаполнено(Источник.Отбор.Регистратор.Значение)
		И ТипЗнч(Источник.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.КорректировкаРегистров")
	Тогда
		Документы.КорректировкаРегистров.ПроверитьНаборДвижений(Источник.Отбор.Регистратор.Значение, Источник, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписьюДокументов(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ЭтоНовый() Тогда 
		РаботаСДокументами.УстановитьОтветственного(Источник, Отказ); 
	КонецЕсли;

	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры
 
Процедура ПередЗаписьюДокументовБэкОфиса(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
КонецПроцедуры

Процедура ПриЗаписиДокументовБэкОфиса(Источник, Отказ) Экспорт
	
	Если Источник.ПометкаУдаления ИЛИ Не Источник.Проведен Тогда
		РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ОтменитьПодтверждениеОперации(Источник, , "Отмена проведения документа", Ложь);	
	ИначеЕсли Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда  
		АвтоматическоеПодтверждениеОперацииБэкОфиса(Источник, Отказ);
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗарегистрированНомерСообщенияОбОткрытииЗакрытииИИС(Источник.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено отменять проведение документов, по которым зарегистрирован номер сообщения об открытии / закрытии ИИС.",,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения 
		И (ТипЗнч(Источник) = Тип("ДокументОбъект.ПоручениеНаДвижениеДенежныхСредств")
			Или ТипЗнч(Источник) = Тип("ДокументОбъект.ПоручениеНаДвижениеЦенныхБумаг")) Тогда		
		РаботаСБизнесПроцессамиИЗадачами.ПроверитьИНачатьСогласованиеПорученияНаВыводАктивов(Источник, Отказ);		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеЗадолженностейПоПоручению") 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Поручение, "ТипЗадолженности") = Перечисления.ТипыЗадолженности.Кредиторская Тогда
		РаботаСБизнесПроцессамиИЗадачами.ОбработатьБизнесПроцессПорученияПриСписанииЗадолженности(Источник, Отказ);
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаПайщика")
		И Источник.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление
		И Не Источник.ПометкаУдаления Тогда
		РаботаСБизнесПроцессамиИЗадачами.НачатьБизнесПроцессПоДвижениюПаевПаевогоИнвестиционногоФонда("ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев", Источник, Отказ);
	КонецЕсли;
	
	// Для процесса зачисления паев используем подтвержденные банком вводы по заявкам пайщика
	Если Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И Не Источник.ПометкаУдаления
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ВводДенежныхСредств")
		И ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")		
		И ЗначениеЗаполнено(Источник.СтрокаБанковскойВыписки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		РаботаСБизнесПроцессамиИЗадачами.НачатьБизнесПроцессПоДвижениюПаевПаевогоИнвестиционногоФонда("ЗачислениеПаев", Источник, Отказ);
	КонецЕсли;
	
	// В отдельных случаях необходимо автоматически выполнить задачу
	Если Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И Не Источник.ПометкаУдаления
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ПереводДенежныхСредств")
		И ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")		
		И ЗначениеЗаполнено(Источник.СтрокаБанковскойВыписки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РасчетныйСчет, "ТранзитныйПИФ") = Истина
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		
		РаботаСБизнесПроцессамиИЗадачами.НайтиИВыполнитьЗадачуСистемногоПользователяПоБизнесПроцессу(
								Источник.Организация,
								Источник.Основание,
								"ЗачислениеПаев",
								БизнесПроцессы.ЗачислениеПаев.ТочкиМаршрута.ФормированиеПлатежногоПорученияНаПереводДенежныхСредствСТранзитногоСчетаНаРасчетный,
								Отказ);
								
	ИначеЕсли Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И Не Источник.ПометкаУдаления
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ВыводДенежныхСредств")
		И ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")		
		И ЗначениеЗаполнено(Источник.СтрокаБанковскойВыписки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РасчетныйСчет, "ТранзитныйПИФ") = Истина
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		
		РаботаСБизнесПроцессамиИЗадачами.НайтиИВыполнитьЗадачуСистемногоПользователяПоБизнесПроцессу(
								Источник.Организация,
								Источник.Основание,
								"ЗачислениеПаев",
								БизнесПроцессы.ЗачислениеПаев.ТочкиМаршрута.ВозвратДенежныхСредствПайщику,
								Отказ);
								
	ИначеЕсли Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И Не Источник.ПометкаУдаления
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ВыводДенежныхСредств")
		И ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")		
		И ЗначениеЗаполнено(Источник.СтрокаБанковскойВыписки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Погашение Тогда
		
		РаботаСБизнесПроцессамиИЗадачами.НайтиИВыполнитьЗадачуСистемногоПользователяПоБизнесПроцессу(
								Источник.Организация,
								Источник.Основание,
								"ПогашениеПаев",
								БизнесПроцессы.ПогашениеПаев.ТочкиМаршрута.ФормированиеПлатежногоПорученияНаВыплатуДенежныхСредствПайщику,
								Отказ);
								
	ИначеЕсли Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И Не Источник.ПометкаУдаления
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ВыводДенежныхСредств")
		И ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")		
		И ЗначениеЗаполнено(Источник.СтрокаБанковскойВыписки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен Тогда
		
		РаботаСБизнесПроцессамиИЗадачами.НайтиИВыполнитьЗадачуСистемногоПользователяПоБизнесПроцессу(
								Источник.Организация,
								Источник.Основание,
								"ОбменПаев",
								БизнесПроцессы.ОбменПаев.ТочкиМаршрута.ФормированиеПлатежногоПорученияНаПереводДенежныхСредствВПИФПоОбмену,
								Отказ);							
								
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И Не Источник.ПометкаУдаления
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаПайщика")
		И Источник.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Погашение Тогда
		РаботаСБизнесПроцессамиИЗадачами.НачатьБизнесПроцессПоДвижениюПаевПаевогоИнвестиционногоФонда("ПогашениеПаев", Источник, Отказ);
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И Не Источник.ПометкаУдаления
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаПайщика")
		И Источник.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Обмен Тогда
		РаботаСБизнесПроцессамиИЗадачами.НачатьБизнесПроцессПоДвижениюПаевПаевогоИнвестиционногоФонда("ОбменПаев", Источник, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПроведенииДокументовБэкОфиса(Источник, Отказ, РежимПроведения) Экспорт
	
	АвтоматическоеПодтверждениеОперацииБэкОфиса(Источник, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Функция ПроверитьЗаписиРегистраПартий(ПараметрыПроверки)

	Источник 			= ПараметрыПроверки.Источник;
	ПолноеИмяРегистра	= ПараметрыПроверки.ПолноеИмяРегистра;
	Регистратор 		= ПараметрыПроверки.Регистратор;
	Запрос 				= ПараметрыПроверки.Запрос;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВидыУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВидыУчета.ВидУчета КАК ВидУчета
		|ПОМЕСТИТЬ _ВидыУчета
		|ИЗ
		|	&ВидыУчета КАК ВидыУчета
		|;
		|";
	
	Запрос.УстановитьПараметр("ВидыУчета", Источник.ДополнительныеСвойства.ВидыУчета);
	
	Если Источник.ДополнительныеСвойства.Свойство("ПередЗаписью") Тогда
	
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|	*
			|ИЗ
			|	&ИмяРегистра КАК Регистр
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВидыУчета КАК _ВидыУчета
			|	ПО _ВидыУчета.СчетДоверительногоУправления = Регистр.СчетДоверительногоУправления
			|		И _ВидыУчета.ВидУчета = Регистр.ВидУчета
			|ГДЕ 
			|	Регистр.Регистратор = &Регистратор
			|	И Регистр.Активность"; // Почему тут нет сортировки по номеру строки? нужно ли еще добавить сортировку по СчетДоверительногоУправления? 
	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистра", ПолноеИмяРегистра);
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	*
			|ПОМЕСТИТЬ _НаборЗаписей
			|ИЗ
			|	&НаборЗаписей КАК НаборЗаписей
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	*
			|ИЗ
			|	_НаборЗаписей КАК _НаборЗаписей
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВидыУчета КАК _ВидыУчета
			|	ПО _ВидыУчета.СчетДоверительногоУправления = _НаборЗаписей.СчетДоверительногоУправления
			|		И _ВидыУчета.ВидУчета = _НаборЗаписей.ВидУчета
			|ГДЕ
			|	_НаборЗаписей.Активность
			|
			|УПОРЯДОЧИТЬ ПО
			|	_НаборЗаписей.СчетДоверительногоУправления,
			|	_НаборЗаписей.НомерСтроки";
		
		НаборЗаписей = Источник.Выгрузить();
		НаборЗаписей.Колонки.Удалить("МоментВремени");
		
		Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей);
		
	КонецЕсли; 
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;		
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ТаблицаДвижений.Колонки.Удалить("НомерСтроки");
	Если Не ТаблицаДвижений.Колонки.Найти("Содержание") = Неопределено Тогда
		ТаблицаДвижений.Колонки.Удалить("Содержание");
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("ПередЗаписью") Тогда
		
		ХранилищеЗначения = Новый ХранилищеЗначения(ТаблицаДвижений, Новый СжатиеДанных(9));
		Источник.ДополнительныеСвойства.Вставить("ИсходныеДвижения", ХранилищеЗначения);
		
	Иначе
		
		ИсходныеДвижения = Источник.ДополнительныеСвойства.ИсходныеДвижения;
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ИсходныеДвижения, "ValueStorage", "http://v8.1c.ru/8.1/data/core");
		ИсходныеДвижения = ЗаписьXML.Закрыть();
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Новый ХранилищеЗначения(ТаблицаДвижений, Новый СжатиеДанных(9)), "ValueStorage", "http://v8.1c.ru/8.1/data/core");
		ТекущиеДвижения = ЗаписьXML.Закрыть();
		
		Если Не ИсходныеДвижения = ТекущиеДвижения Тогда
		
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ВидыУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	_ВидыУчета.ВидУчета КАК ВидУчета
				|ИЗ
				|	_ВидыУчета КАК _ВидыУчета
				|ИТОГИ ПО
				|	ВидУчета";	
			
			Возврат Запрос.Выполнить();
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции

Процедура АвтоматическоеПодтверждениеОперацииБэкОфиса(Источник, Отказ)
	
	Если Источник.Дата < '20171001' // подтверждаем операции только после 01.10.2017
		ИЛИ Не Источник.Проведен
		ИЛИ Не Метаданные.ОпределяемыеТипы.ПодтверждаемыеОперацииБэкОфиса.Тип.СодержитТип(ТипЗнч(Источник.Ссылка))
		ИЛИ РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ОперацияПодтверждена(Источник.Ссылка)
	Тогда 
		Возврат;
	КонецЕсли;
	
	// Только для организаций, для которых требуется подтверждение операций
	КонтрольПодтвержденийОпераций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация, "КонтрольПодтвержденийОпераций");
	Если Не КонтрольПодтвержденийОпераций Тогда
		Возврат;
	КонецЕсли;
	
	Основание	= Неопределено;
	Примечание	= "";
	
	ВидОперации = РаботаСДокументами.ПолучитьИмя(Источник);
	
	Если ВидОперации = "ВводКредитногоИнструмента" ИЛИ ВидОперации = "ВыводКредитногоИнструмента" Тогда
		
		Основание = "Договор";
		
	ИначеЕсли ВидОперации = "НачислениеДивидендов" Тогда
		
		Основание = "Решение эмитента";
		
	ИначеЕсли ВидОперации = "ПогашениеКупона" ИЛИ ВидОперации = "ПогашениеЦеннойБумаги" Тогда
		
		Основание = "Проспект эмиссии";
		
	ИначеЕсли ВидОперации = "ПоручениеНаДвижениеДенежныхСредств" Тогда
		
		Если Источник.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема Тогда
			Возврат;
		Иначе
			Основание = "Оригинал документа";	
		КонецЕсли;
			
	ИначеЕсли ВидОперации = "ПоручениеНаДвижениеЦенныхБумаг" Тогда
		
		Основание = "Оригинал документа";
		
	ИначеЕсли ВидОперации = "ВводДенежныхСредств" Тогда
	
		Если Источник.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
			Основание = "Приходный кассовый ордер";
		ИначеЕсли РегистрыСведений.РеестрПлатежей.РазнесеныВсеПлатежи(Источник) Тогда
			Основание = "Банковские выписки";
		КонецЕсли;
		
	ИначеЕсли ВидОперации = "ВыводДенежныхСредств"
		ИЛИ ВидОперации = "ПриходПроцентовМНО"
		ИЛИ ВидОперации = "ПриходПроцентовПоКредитномуИнструменту"
	Тогда
	
		Если РегистрыСведений.РеестрПлатежей.РазнесеныВсеПлатежи(Источник) Тогда
			Основание = "Банковские выписки";
		КонецЕсли;
		
	ИначеЕсли ВидОперации = "РазмещениеКредитногоИнструмента" ИЛИ ВидОперации = "ЗакрытиеКредитногоИнструмента" Тогда
	
		Если РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(Источник.КредитныйИнструмент) Тогда
		
			//НетРасхожденийСБиржей = РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.ПолучитьРезультатСверки(
			//	Источник.Организация,
			//	Источник.СчетДоверительногоУправления,
			//	НачалоДня(Источник.Дата),
			//	Справочники.ВнешниеСистемы.КлиринговыйОтчетММВБоДвиженииДенежныхСредств
			//);
			НетРасхожденийСБиржей = Ложь;
			
			Если НетРасхожденийСБиржей Тогда
				Основание = "Клиринговый отчет";
			КонецЕсли;				
		
		ИначеЕсли РегистрыСведений.РеестрПлатежей.РазнесеныВсеПлатежи(Источник) Тогда
			
			Основание = "Банковские выписки";

		КонецЕсли;		
		
	ИначеЕсли ВидОперации = "ПереводДенежныхСредств" Тогда
		
		Если ЗначениеЗаполнено(Источник.Брокер) ИЛИ ЗначениеЗаполнено(Источник.БрокерПолучатель) Тогда
			
			Брокер = ?(ЗначениеЗаполнено(Источник.Брокер), Источник.Брокер, Источник.БрокерПолучатель);
			
			Если Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда 
				ОтчетБрокера = Справочники.ВнешниеСистемы.ОтчетБрокераБКРегион;
			ИначеЕсли Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ") Тогда
				ОтчетБрокера = Справочники.ВнешниеСистемы.ОтчетБрокераГПБ;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подтверждение операции с брокером '" + Брокер + "' не реализовано.", Источник);
				Возврат;
			КонецЕсли;
			
			НетРасхожденийСБрокером = РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.ПолучитьРезультатСверки(
				Источник.Организация,
				Источник.СчетДоверительногоУправления,
				НачалоДня(Источник.Дата),
				ОтчетБрокера
			);
			
			Если НетРасхожденийСБрокером Тогда 
				Если Источник.Брокер = Источник.БрокерПолучатель Тогда
					Основание	= "Отчет брокера";
				ИначеЕсли РегистрыСведений.РеестрПлатежей.РазнесеныВсеПлатежи(Источник) Тогда
					Основание	= "Отчет брокера";
					Примечание	= "Поступление на счет банка подтверждено банковскими выписками";				
				КонецЕсли;
			КонецЕсли;				
			
		ИначеЕсли Источник.МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК
			ИЛИ Источник.МестоХраненияПолучатель = Справочники.МестаХранения.ММВБ_ДепозитыСЦК
		Тогда
		
			//НетРасхожденийСБиржей = РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.ПолучитьРезультатСверки(
			//	Источник.Организация,
			//	Источник.СчетДоверительногоУправления,
			//	НачалоДня(Источник.Дата),
			//	Справочники.ВнешниеСистемы.КлиринговыйОтчетММВБоДвиженииДенежныхСредств
			//);
			НетРасхожденийСБиржей = Ложь;
			
			Если НетРасхожденийСБиржей И РегистрыСведений.РеестрПлатежей.РазнесеныВсеПлатежи(Источник) Тогда
				Основание		 = "Клиринговый отчет";
				ДействиеСоСчетом = ?(Источник.МестоХраненияПолучатель = Справочники.МестаХранения.ММВБ_ДепозитыСЦК, "Списание со счета", "Поступление на счет");
				Примечание		 = ДействиеСоСчетом + " банка подтверждено банковскими выписками";				
			КонецЕсли;				
		
		ИначеЕсли РегистрыСведений.РеестрПлатежей.РазнесеныВсеПлатежи(Источник) Тогда
			
			Основание = "Банковские выписки";

		КонецЕсли;
		
	ИначеЕсли ВидОперации = "МНО" Тогда
		
		Основание = "Подтверждение МНО";
		
	ИначеЕсли (ВидОперации = "Сделка" ИЛИ ВидОперации = "СделкаРЕПО" ИЛИ ВидОперации = "СделкаСВалютой" ИЛИ ВидОперации = "СделкаСМО"
		ИЛИ ВидОперации = "ИзменениеУсловийСделки" ИЛИ ВидОперации = "ИсполнениеОбязательствПоСделке" ИЛИ ВидОперации = "ОтменаСделки") 
		И Не РаботаСДокументами.СделкаЧерезБрокера(Источник) Тогда
		
		Основание = "Договор";
		
	ИначеЕсли ВидОперации = "Оплата" Тогда
		
		Если Не ЗначениеЗаполнено(Источник.Брокер)
			И Источник.МестоХранения <> Справочники.МестаХранения.ММВБ_ДепозитыСЦК
			И РегистрыСведений.РеестрПлатежей.РазнесеныВсеПлатежи(Источник)
		Тогда
			Основание = "Банковские выписки";
		КонецЕсли;
	
	ИначеЕсли ВидОперации = "НачислениеЗадолженности" Тогда
		
		Если Не ЗначениеЗаполнено(Источник.Брокер)
			И Источник.МестоХранения <> Справочники.МестаХранения.ММВБ_ДепозитыСЦК
		Тогда
		
			// Прочие доходы и расходы, связанные с депозитарием
			ПрочиеДоходыИРасходыДепозитария = Новый Массив;
			ПрочиеДоходыИРасходыДепозитария.Добавить(Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам спецдепозитария", Истина));
			ПрочиеДоходыИРасходыДепозитария.Добавить(Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам депозитария", Истина));	
			
			Если Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.БанковскаяКомиссия)
				ИЛИ Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии Тогда
				
				Основание = "Банковские выписки";
				
			ИначеЕсли Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.УслугиДоверительногоУправления) Тогда
				
				Основание = "Расчет вознаграждения";
				
			ИначеЕсли Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда
				
				Основание = "Расчет НДФЛ";
				
			ИначеЕсли Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.ДепозитарнаяКомиссия)
				ИЛИ Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоДепозитарнойКомиссии
				ИЛИ ПрочиеДоходыИРасходыДепозитария.Найти(Источник.ПрочиеДоходыИРасходы) <> Неопределено Тогда
				
				Основание = "Выставленный счет";
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	// При первом проведении документа добавляем в журнал подтверждений запись о внесении.
	// Если запись о подтверждении является первой записью в журнале подтверждений, то это указывается в примечании.
	
	ПоследняяЗаписьЖурналаПодтверждений = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПоследнююЗаписьЖурналаПодтверждений(Источник.Ссылка); 
	Если ПоследняяЗаписьЖурналаПодтверждений = Неопределено Тогда
		Примечание = ?(ЗначениеЗаполнено(Примечание), "Внесение записи (" + Примечание + ")", "Внесение записи");
	КонецЕсли;	
	
	// Время подтверждения может заполняться алгоритмами	
	
	ТекДата = ТекущаяДата();
	Если Источник.ДополнительныеСвойства.Свойство("ВремяПодтверждения") Тогда
		ВремяЗаписи = Источник.ДополнительныеСвойства.ВремяПодтверждения;
	ИначеЕсли ТекДата < Источник.Дата И НачалоДня(Источник.Дата) = НачалоДня(ТекДата) Тогда
		// У некоторых операций время сдвинуто на более позднее в текущем дне, у них сдвигаем время подтверждения
		ВремяЗаписи = Источник.Дата;
	Иначе
		ВремяЗаписи = Неопределено;
	КонецЕсли;
	
	Если (Основание <> Неопределено)
		И (Источник.Дата <= ТекДата Или НачалоДня(Источник.Дата) = НачалоДня(ТекДата)) Тогда
		РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ДобавитьЗаписьВЖурналПодтверждений(Источник, Истина, Основание, Примечание, Ложь, ВремяЗаписи);
	ИначеЕсли ПоследняяЗаписьЖурналаПодтверждений = Неопределено Тогда 
		РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ДобавитьЗаписьВЖурналПодтверждений(Источник, Ложь, Основание, Примечание, Ложь, ВремяЗаписи);
	КонецЕсли;

КонецПроцедуры

Функция ЗарегистрированНомерСообщенияОбОткрытииЗакрытииИИС(Объект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НомераОбъектов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|ГДЕ
		|	НомераОбъектов.Объект = &Объект
		|	И НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.СообщенияОбОткрытииЗакрытииИИС)";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьНаборЗаписейПоРегистратору(ПолноеИмяРегистра, Регистратор, ВыгрузитьВТаблицу = Ложь)
	
	НаборЗаписей = РаботаСМетаданнымиПовтИсп.МенеджерОбъектаМетаданных(ПолноеИмяРегистра).СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	
	Возврат ?(ВыгрузитьВТаблицу, НаборЗаписей.Выгрузить(), НаборЗаписей);	
	
КонецФункции

Процедура ПроверитьДвиженияПаевСобственногоПортфеляИСформироватьОповещение(Источник)
	
	РеквизитыОповещения = Новый Структура("Организация, Текст", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"), "");
	
	Запрос = Новый Запрос;
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.Период КАК Период,
		|	НаборЗаписей.Активность КАК Активность,
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НаборЗаписей.Регистратор КАК Регистратор,
		|	НаборЗаписей.Рынок КАК Рынок,
		|	НаборЗаписей.ВидДвижения КАК ВидДвижения,
		|	НаборЗаписей.ЦеннаяБумага КАК ЦеннаяБумага,
		|	НаборЗаписей.Количество КАК Количество
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборЗаписей.Период КАК Период,
		|	_НаборЗаписей.Активность КАК Активность,
		|	_НаборЗаписей.Организация КАК Организация,
		|	_НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НаборЗаписей.Регистратор КАК Регистратор,
		|	_НаборЗаписей.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_НаборЗаписей.Количество КАК Количество,
		|	_НаборЗаписей.ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ _НаборЗаписейСОтбором
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|ГДЕ
		|	НЕ _НаборЗаписей.Регистратор ССЫЛКА Документ.ПереводЦенныхБумаг
		|	И _НаборЗаписей.Регистратор = &Регистратор
		|	И _НаборЗаписей.Организация = &Организация
		|	И _НаборЗаписей.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|	И _НаборЗаписей.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				СчетаДУ.Ссылка
		|			ИЗ
		|				Справочник.СчетаДоверительногоУправления КАК СчетаДУ
		|			ГДЕ
		|				СчетаДУ.Организация = &Организация
		|				И СчетаДУ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумаг.Период КАК Период,
		|	ОстаткиЦенныхБумаг.Активность КАК Активность,
		|	ОстаткиЦенныхБумаг.Организация КАК Организация,
		|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумаг.Количество КАК Количество,
		|	ОстаткиЦенныхБумаг.ВидДвижения КАК ВидДвижения,
		|	ОстаткиЦенныхБумаг.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ОстаткиЦБСОтбором
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|ГДЕ
		|	НЕ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ПереводЦенныхБумаг
		|	И ОстаткиЦенныхБумаг.Регистратор = &Регистратор
		|	И ОстаткиЦенныхБумаг.Организация = &Организация
		|	И ОстаткиЦенныхБумаг.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|	И ОстаткиЦенныхБумаг.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				СчетаДУ.Ссылка
		|			ИЗ
		|				Справочник.СчетаДоверительногоУправления КАК СчетаДУ
		|			ГДЕ
		|				СчетаДУ.Организация = &Организация
		|				И СчетаДУ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Источник.Период КАК Период,
		|	ВЫБОР
		|		КОГДА &ФлПустойНабор
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ Источник.Активность
		|	КОНЕЦ КАК Активность,
		|	Источник.Организация КАК Организация,
		|	Источник.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Источник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Источник.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА Источник.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ""+""
		|		ИНАЧЕ ""-""
		|	КОНЕЦ КАК ВидДвижения
		|ИЗ
		|	&Источник КАК Источник";
#КонецОбласти
	Запрос.УстановитьПараметр("Регистратор"  , Источник.Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("Организация"  , РеквизитыОповещения.Организация);
	Запрос.УстановитьПараметр("НаборЗаписей" , Источник.Выгрузить());
	Запрос.УстановитьПараметр("ФлПустойНабор", Источник.Количество() = 0);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Источник", ?(Источник.Количество() = 0, "_ОстаткиЦБСОтбором", "_НаборЗаписейСОтбором"));
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
			
		Если РеквизитыОповещения.Текст = "" Тогда
			РеквизитыОповещения.Текст = ?(Выборка.Активность, "", "Отмена операции! ") + "Дата операции: " + Выборка.Период + ". Счет доверительного управления: " + СокрЛП(Выборка.СчетДоверительногоУправления) + "." + Символы.ПС + "Ценные бумаги: " + Символы.ПС + СокрЛП(Выборка.ЦеннаяБумага) + " (" + Выборка.ВидДвижения + Строка(Выборка.Количество) + " ед.)";
		Иначе 
			РеквизитыОповещения.Текст = РеквизитыОповещения.Текст + ";" + Символы.ПС + СокрЛП(Выборка.ЦеннаяБумага) + " (" + Выборка.ВидДвижения + Строка(Выборка.Количество) + " ед.)";				
		КонецЕсли;	
		
	КонецЦикла;
	
	Если РеквизитыОповещения.Текст <> "" Тогда
		Справочники.Оповещения.СформироватьОповещения(Источник.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ПриЗаписиДвиженийРегистровНакопления, РеквизитыОповещения);
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьРеквизитыДляПоручений(Источник)
	
	Источник.ДополнительныеСвойства.Свойство("ЭтоНовый", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания)
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &Период)";
	
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	Запрос.УстановитьПараметр("Организация", Источник.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Источник.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КодУБрокера = "";
	Пока Выборка.Следующий() Цикл
		КодУБрокера = КодУБрокера + ?(КодУБрокера = "", "", ", ") + Выборка.Код + " [" + Выборка.Брокер + "]";	
	КонецЦикла;

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.СчетДоверительногоУправления, Новый Структура("КодСчета, НомерДоговора, Наименование, ВидДоговораДоверительногоУправления"));
	
	РеквизитыОповещения = Новый Структура();
	РеквизитыОповещения.Вставить("Организация", Источник.Организация);
	
	Если Источник.ВыводВсехАктивов Тогда
		РеквизитыОповещения.Вставить("ВидПоручения", "вывод всех активов");
	Иначе
		РеквизитыОповещения.Вставить("ВидПоручения", ?(Источник.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская, "ввод ", "вывод ") + "ценных бумаг");	
	КонецЕсли;
	
	РеквизитыОповещения.Вставить("КодКлиента", ЗначенияРеквизитов.КодСчета);
	РеквизитыОповещения.Вставить("Наименование", ЗначенияРеквизитов.Наименование);
	РеквизитыОповещения.Вставить("НомерДоговора", ЗначенияРеквизитов.НомерДоговора);
	РеквизитыОповещения.Вставить("НомерПоручения", СокрЛП(Источник.Номер));
	РеквизитыОповещения.Вставить("ДатаПоручения", Формат(Источник.Дата, "ДФ=dd.MM.yyyy"));
	РеквизитыОповещения.Вставить("КодУБрокера", КодУБрокера);
	
	// Для новых поручений на вывод добавляем текст о необходимости согласования документа
	Если Источник.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение 
			И Источник.ДополнительныеСвойства.Свойство("ТребуетсяСогласованиеПорученияНаВыводАктивов")
			И Не РаботаСДокументами.ПоручениеНаВыводАктивовСогласовано(Источник.Ссылка, ТекущаяДата()) 
			И Не РаботаСДокументами.ПоручениеНаВыводАктивовОтменено(Источник.Ссылка) Тогда
			
		РеквизитыОповещения.Вставить("НеобходимоСогласие", "Необходимо согласовать поручение");
	Иначе
		РеквизитыОповещения.Вставить("НеобходимоСогласие", "Поручение");	
	КонецЕсли;
					
	ТекстСообщения = "Дата исполнения поручения по: " + Формат(Источник.ДатаИсполненияПо, "ДФ=dd.MM.yyyy") + Символы.ПС + "Ценные бумаги: ";
	
	Для Каждого СтрокаТабЧасти Из Источник.ЦенныеБумаги Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + СтрокаТабЧасти.НомерСтроки + ". " + СтрокаТабЧасти.Количество + " (шт.) " + СтрокаТабЧасти.ЦеннаяБумага;	
	КонецЦикла;
					
	РеквизитыОповещения.Вставить("ТекстСообщения", ТекстСообщения);   	
	
	Возврат РеквизитыОповещения;
	
КонецФункции

Процедура ЗаполнитьИзмененияРеквизитов(Источник, РеквизитыОповещения)
	
	Если Источник.ДополнительныеСвойства.Свойство("ПредЗначенияРеквизитов") Тогда
		Для Каждого ЗначениеРеквизитаПередЗаписью Из Источник.ДополнительныеСвойства.ПредЗначенияРеквизитов Цикл
			РеквизитыОповещения.Вставить("ИзменилсяРеквизит" + ЗначениеРеквизитаПередЗаписью.Ключ, ЗначениеРеквизитаПередЗаписью.Значение <> Источник[ЗначениеРеквизитаПередЗаписью.Ключ]);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
