
&НаСервере
Процедура ЗаполнитьФункциональныеРолиЮрФизЛицаНаСервере()
	// для физиков (или при пустом значении) роли не получаем
	Если Объект.ВидЮрФизЛица <> Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ФункциональныеРоли.Очистить();
	
	ВидыФункциональныхРолей     = Справочники.ЮрФизЛица.ПолучитьВидыФункциональныхРолей();
	ВыбранныеФункциональныеРоли = Справочники.ЮрФизЛица.ПолучитьФункциональныеРоли(Объект.Ссылка);
	
	Для каждого ВидФункциональнойРоли Из ВидыФункциональныхРолей Цикл
		СтрокаФункциональныеРоли = ЭтаФорма.ФункциональныеРоли.Добавить();
		СтрокаФункциональныеРоли.ВидРоли = ВидФункциональнойРоли;
		СтрокаФункциональныеРоли.Роль    = Метаданные.Справочники[ВидФункциональнойРоли].ПредставлениеОбъекта;
	КонецЦикла;
	
	Для каждого ВыбраннаяФункциональнаяРоль Из ВыбранныеФункциональныеРоли Цикл
		СтрокаФункциональныеРоли = ЭтаФорма.ФункциональныеРоли[ВидыФункциональныхРолей.Найти(ВыбраннаяФункциональнаяРоль.Метаданные().Имя)];
		СтрокаФункциональныеРоли.Флажок       = Истина;
		СтрокаФункциональныеРоли.СсылкаНаРоль = ВыбраннаяФункциональнаяРоль;
	КонецЦикла;
	
	КоличествоВыбранныхРолей = ВыбранныеФункциональныеРоли.Количество();
	
	ЭтаФорма.ФункциональныеРоли.Сортировать("Флажок УБЫВ, Роль");
	
	Если КоличествоВыбранныхРолей > 0 Тогда
		Элементы.СтраницаФункциональныеРоли.Заголовок = "Функциональные роли (" + КоличествоВыбранныхРолей + ")";
	Иначе
		Элементы.СтраницаФункциональныеРоли.Заголовок = "Функциональные роли";
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьФункциональныеРолиЮрФизЛица

&НаСервере
Процедура ДобавитьОтборыСписковНаСервере()
	
	// отбор расчетных счетов
	СписокРасчетныеСчета.Параметры.УстановитьЗначениеПараметра("Владелец",    Объект.Ссылка);
	СписокРасчетныеСчета.Параметры.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.ТекущаяОрганизация);

	// отбор контактных лиц
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокКонтактныеЛица.Отбор, "Объект",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокКонтактныеЛица.Отбор, "Подразделение",,,Подразделение,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокКонтактныеЛица.Отбор, "Язык",,,Язык,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// отбор заявок пайщика
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЗаявок.Отбор, "Пайщик",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЗаявок.Отбор, "Организация",,,ПараметрыСеанса.ТекущаяОрганизация,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	
	// отбор счетов ДУ
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокСчетовДУ.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокСчетовДУ.Отбор, "Организация",,,ПараметрыСеанса.ТекущаяОрганизация,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// отбор лицевых счетов
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЛицевыеСчета.Отбор, "ВладелецСчета",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЛицевыеСчета.Отбор, "Организация",,,ПараметрыСеанса.ТекущаяОрганизация,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	

	// отбор сотрудники организации
	СотрудникиОрганизации.Параметры.УстановитьЗначениеПараметра("Период",		ЭтаФорма.Период);
	СотрудникиОрганизации.Параметры.УстановитьЗначениеПараметра("ЮрФизЛицо",	Объект.Ссылка);
	
	// Сведения о трудовой деятельности сотрудников
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СведенияОТрудовойДеятельностиСотрудников.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// Сведения об образовании
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СведенияОбОбразованииФизЛиц.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// Сведения о квалификации
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СведенияОКвалификацииФизическихЛиц.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// Внутренние перечни
	ВнутренниеПеречни.Параметры.УстановитьЗначениеПараметра("Период",	ЭтаФорма.Период);
	ВнутренниеПеречни.Параметры.УстановитьЗначениеПараметра("Объект",	Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеЮрФизЛицаНаСервере()
	
	Элементы.СтраницаРеквизитыЮрЛицаАнкетные.Видимость	= Ложь;
	Элементы.СтраницаРеквизитыЮрЛица.Видимость			= Ложь;
	Элементы.СтраницаРеквизитыФизЛицаАнкетные.Видимость	= Ложь;
	
	Элементы.СтраницаРеквизитыЮрЛицаАнкетные.Заголовок	= "Реквизиты";
	Элементы.СтраницаРеквизитыЮрЛица.Заголовок			= "Реквизиты";
	Элементы.СтраницаРеквизитыФизЛицаАнкетные.Заголовок	= "Реквизиты";
	
	Элементы.СтраницаФункциональныеРоли.Видимость
			= (Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо);
	Элементы.СтраницаДанныеГруппыКомпаний.Видимость
			= (Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо);
	
	Если Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		// Анкетные данные
		Если ЗначениеЗаполнено(ЭтаФорма.Анкета) Тогда
			
			Элементы.СтраницаРеквизитыФизЛицаАнкетные.Видимость = Истина;
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Организация = &Организация
				|				И Язык = &Язык
				|				И Регистратор = &Регистратор) КАК РеквизитыФизическихЛицСрезПоследних");
			
			Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
			Запрос.УстановитьПараметр("Регистратор", ЭтаФорма.Анкета);
			Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
			Запрос.УстановитьПараметр("Язык",        ЭтаФорма.Язык);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(РеквизитыФизЛицаАнкетные, Выборка);	
			КонецЕсли;
			
			ЭтаФорма.Email    = Выборка.EMail;
			ЭтаФорма.Телефоны = Выборка.Телефоны;
			ЭтаФорма.Адрес1   = Выборка.АдресРегистрации;
			ЭтаФорма.Адрес2   = Выборка.АдресМестаЖительства;
			ЭтаФорма.Адрес3   = Выборка.ПочтовыйАдрес;
			
			Элементы.Адрес1.Заголовок = "Адрес регистрации";
			Элементы.Адрес2.Заголовок = "Адрес места жительства";
			
		КонецЕсли;
			
	ИначеЕсли Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		
		ГоловнаяОрганизацияЮрЛица = РаботаСНормативноСправочнойИнформацией.ПолучитьГоловнуюОрганизацию(Объект.Ссылка);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущаяДатаСеанса",	ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЮрФизЛицо",			Объект.Ссылка);
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументыЮридическихЛицСрезПоследних.Период КАК ЮрЛицоДатаВыдачиОГРН,
			|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ЮрЛицоОГРН,
			|	ДокументыЮридическихЛицСрезПоследних.КемВыдан КАК ЮрЛицоОрганВыдавшийОГРН
			|ИЗ
			|	РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
			|			&ТекущаяДатаСеанса,
			|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|				И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)
			|				И ЮрФизЛицо = &ЮрФизЛицо) КАК ДокументыЮридическихЛицСрезПоследних
			|ГДЕ
			|	(ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &ТекущаяДатаСеанса)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЮрЛицоОГРН				= Выборка.ЮрЛицоОГРН;
			ЮрЛицоДатаВыдачиОГРН	= Выборка.ЮрЛицоДатаВыдачиОГРН;
			ЮрЛицоОрганВыдавшийОГРН	= Выборка.ЮрЛицоОрганВыдавшийОГРН;
		Иначе
			ЮрЛицоОГРН				= Неопределено;
			ЮрЛицоДатаВыдачиОГРН	= Неопределено;
			ЮрЛицоОрганВыдавшийОГРН	= Неопределено;
		КонецЕсли;
		
		// Анкетные данные
		Если ЗначениеЗаполнено(ЭтаФорма.Анкета) Тогда
			
			Элементы.СтраницаРеквизитыЮрЛицаАнкетные.Видимость = Истина;
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
				|			,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Организация = &Организация
				|				И Язык = &Язык
				|				И Регистратор = &Регистратор) КАК РеквизитыФизическихЛицСрезПоследних");
			
			Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
			Запрос.УстановитьПараметр("Регистратор", ЭтаФорма.Анкета);
			Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
			Запрос.УстановитьПараметр("Язык",        ЭтаФорма.Язык);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(РеквизитыЮрЛицаАнкетные, Выборка);
			КонецЕсли;
			
			ЭтаФорма.Email    = Выборка.EMail;
			ЭтаФорма.Телефоны = Выборка.Телефоны;
			ЭтаФорма.Адрес1   = Выборка.ЮридическийАдрес;
			ЭтаФорма.Адрес2   = Выборка.ФактическийАдрес;
			ЭтаФорма.Адрес3   = Выборка.ПочтовыйАдрес;
			
			Элементы.Адрес1.Заголовок = "Юридический адрес";
			Элементы.Адрес2.Заголовок = "Фактический адрес";
			
		КонецЕсли;
		
		// Данные группы компаний
		Если Не ЗначениеЗаполнено(ЭтаФорма.Анкета) Или РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
			
			Элементы.СтраницаРеквизитыЮрЛица.Видимость = Истина;
			
			Запрос = Новый Запрос("
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
				|			,
				|			Подразделение = &Подразделение
				|				И Язык = &Язык
				|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыФизическихЛицСрезПоследних
				|");
			
			Запрос.УстановитьПараметр("Подразделение", ЭтаФорма.Подразделение);        
			Запрос.УстановитьПараметр("Язык", ЭтаФорма.Язык);        
			Запрос.УстановитьПараметр("ЮрФизЛицо", Объект.Ссылка);        
		
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(РеквизитыЮрЛица, Выборка);	
			КонецЕсли;
			
			Если ЭтаФорма.Элементы.Найти("ЮрЛицоКонтактнаяИнформация") = Неопределено Тогда
				РаботаСНормативноСправочнойИнформацией.СоздатьДинамическийСписокКонтактнойИнформации("ЮрЛицоКонтактнаяИнформация", ЭтаФорма, ЭтаФорма.Элементы.СтраницаКонтакты, Объект.Ссылка, Ложь);
				ЭтаФорма.Элементы.ЮрЛицоКонтактнаяИнформацияЗначенияПолей.Видимость = Ложь;			
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРезультатыСверкиПоСМЭВ()

	Если ЗначениеЗаполнено(ЭтаФорма.Анкета) И Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЖурналСверкиСоСпискамиСрезПоследних.ДатаПоследнейСверки КАК ДатаСверкиСМЭВ,
			|	ВЫБОР
			|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена
			|			ТОГДА ВЫБОР
			|					КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Статус = ""VALID""
			|						ТОГДА ""Пройдена""
			|					КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Статус = ""INVALID""
			|						ТОГДА ""Не пройдена""
			|					ИНАЧЕ ""Ошибка выполнения запроса""
			|				КОНЕЦ
			|		ИНАЧЕ ""Запрос отправлен""
			|	КОНЕЦ КАК РезультатСверкиСМЭВ,
			|	ЖурналСверкиСоСпискамиСрезПоследних.Пройдена КАК Пройдена,
			|	ЖурналСверкиСоСпискамиСрезПоследних.ИдентификаторПакета КАК ИдентификаторПакета
			|ИЗ
			|	РегистрСведений.ЖурналСверкиСоСписками.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СМЭВ)
			|				И ЮрФизЛицо = &ЮрФизЛицо) КАК ЖурналСверкиСоСпискамиСрезПоследних");

		Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
		Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЭтаФорма.ДействиеСМЭВ = Выборка.Пройдена;
			ЭтаФорма.ИдентификаторПакетаСМЭВ = Выборка.ИдентификаторПакета;
			ЭтаФорма.РезультатСверкиСМЭВ = Выборка.РезультатСверкиСМЭВ + " " + Выборка.ДатаСверкиСМЭВ;
		Иначе
			ЭтаФорма.ДействиеСМЭВ = Истина;
			ЭтаФорма.ИдентификаторПакетаСМЭВ = "";
			ЭтаФорма.РезультатСверкиСМЭВ = "Не выполнялась";
		КонецЕсли;		
		
	Иначе
		
		Элементы.ГруппаСверкаПоСМЭВ.Видимость = Ложь;
	
	КонецЕсли; 

КонецПроцедуры
 
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	// Определелим текущую анкету, если она есть
	Если Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = &Язык) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних");
		Элементы.Анкета.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.АнкетаФизическогоЛица");
	Иначе
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = &Язык) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних");
		Элементы.Анкета.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.АнкетаЮридическогоЛица");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Язык",        ЭтаФорма.Язык);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтаФорма.Анкета = Выборка.Регистратор;
	КонецЕсли;
	
	ОбновитьДанныеЮрФизЛицаНаСервере();
	
	ЗаполнитьФункциональныеРолиЮрФизЛицаНаСервере();
	
	УстановитьСвойстваДинамическогоСпискаСотрудникиОрганизацииНаСервере();
	УстановитьСвойстваДинамическогоСпискаВнутренниеПеречниНаСервере();
	
	ДобавитьОтборыСписковНаСервере();
	
	УниверсальныеМеханизмы.УстановитьЗаголовокСсылкиОбновить(ЭтаФорма, Объект.Ссылка);
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ОбновитьРезультатыСверкиПоСМЭВ();
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;

	ЭтаФорма.Организация   	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Подразделение	= Справочники.Подразделения.ГруппаКомпаний;
	ЭтаФорма.Язык         	= Справочники.Языки.Русский;
	ЭтаФорма.Период			= ТекущаяДата();
	
	ПриЧтенииСозданииНаСервере();
	
	Если ЭтаФорма.Параметры.Свойство("ОткрытьНаСтраницеКонтактныеЛица") И ЭтаФорма.Параметры.ОткрытьНаСтраницеКонтактныеЛица Тогда
		Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.СтраницаКонтактныеЛица;
	КонецЕсли;
	
	СоздатьКоманды_СоздатьВнесениеИзмененийВоВнутреннийПеречень();
	
КонецПроцедуры

&НаКлиенте
Процедура АнкетыПриИзменении(Элемент)
	
	ОбновитьДанныеЮрФизЛицаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФункциональныеРолиРольОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаФункциональныеРоли = Элементы.ФункциональныеРоли.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаФункциональныеРоли.СсылкаНаРоль) Тогда
		ФормаФункциональнойОпции = ПолучитьФорму("Справочник." + СтрокаФункциональныеРоли.ВидРоли + ".ФормаОбъекта", Новый Структура("Ключ", СтрокаФункциональныеРоли.СсылкаНаРоль));
		ФормаФункциональнойОпции.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Объект.Ссылка, ЭтаФорма.Подразделение, ЭтаФорма.Язык);
		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатСверкиСМЭВНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ЮрФизЛицо, ВидПеречня", 
		Объект.Ссылка,
		ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СМЭВ")); 
	ПараметрыФормы = Новый Структура("Отбор", Отбор); 
	
	ОткрытьФорму("РегистрСведений.ЖурналСверкиСоСписками.ФормаСписка", ПараметрыФормы, ЭтаФорма, Истина, ЭтаФорма.Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеСМЭВНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействиеСМЭВ(ЭтаФорма.ДействиеСМЭВ, ЭтаФорма.Организация, Объект.Ссылка, ЭтаФорма.ИдентификаторПакетаСМЭВ);
	ОбновитьРезультатыСверкиПоСМЭВ();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьДействиеСМЭВ(ОтправитьЗапрос, Организация, ЮрФизЛицо, ИдентификаторПакетаСМЭВ)

	Если ОтправитьЗапрос Тогда
	    Результат = РегистрыСведений.ЖурналСверкиСоСписками.СверитьПоСМЭВ(Организация, ЮрФизЛицо);
	Иначе
		Результат = РегистрыСведений.ЖурналСверкиСоСписками.ПроверитьСтатус(Организация, ИдентификаторПакетаСМЭВ);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ВидыЮрФизЛиц = РаботаСМетаданнымиПовтИсп.ЗначенияПеречисленияВСтруктуру("ВидыЮрФизЛиц");

	Элементы.СтраницаОбразованиеИТрудоваяДеятельность.Видимость = (Объект.ВидЮрФизЛица = ВидыЮрФизЛиц.ФизическоеЛицо);
	
КонецПроцедуры // НастроитьВидимостьДоступность

#Область ОбразованиеИТрудоваяДеятельность
	
&НаКлиенте
Процедура КомандаСотрудникиОрганизацииИстория(Команда)
	
	Элементы.СотрудникиОрганизацииКомандаИстория.Пометка = НЕ Элементы.СотрудникиОрганизацииКомандаИстория.Пометка;
	УстановитьСвойстваДинамическогоСпискаСотрудникиОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаСотрудникиОрганизацииНаСервере()
	
	ПараметрыДинамическогоСписка = Новый Структура;
	
	Если Элементы.СотрудникиОрганизацииКомандаИстория.Пометка Тогда
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "РегистрСведений.СотрудникиОрганизации");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегистрСведенийСотрудникиОрганизации.Период КАК Период,
			|	РегистрСведенийСотрудникиОрганизации.Организация КАК Организация,
			|	РегистрСведенийСотрудникиОрганизации.Сотрудник КАК Сотрудник,
			|	РегистрСведенийСотрудникиОрганизации.Подразделение КАК Подразделение,
			|	РегистрСведенийСотрудникиОрганизации.Должность КАК Должность,
			|	РегистрСведенийСотрудникиОрганизации.ВидСобытия КАК ВидСобытия,
			|	&Период
			|ИЗ
			|	РегистрСведений.СотрудникиОрганизации КАК РегистрСведенийСотрудникиОрганизации
			|ГДЕ
			|	РегистрСведенийСотрудникиОрганизации.Сотрудник.ЮрФизЛицо = &ЮрФизЛицо");
		
		//&Период потому что при переопределении текста запрса, 1с его удалит
	Иначе
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "РегистрСведений.СотрудникиОрганизации.СрезПоследних");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Период КАК Период,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Организация КАК Организация,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Подразделение КАК Подразделение,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Должность КАК Должность,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.ВидСобытия КАК ВидСобытия
			|ИЗ
			|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Период, Сотрудник.ЮрФизЛицо = &ЮрФизЛицо) КАК РегистрСведенийСотрудникиОрганизацииСрезПоследних
			|ГДЕ
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)");
	
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СотрудникиОрганизации, ПараметрыДинамическогоСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВнутренниеПеречниИстория(Команда)
	
	Элементы.ВнутренниеПеречниКомандаИстория.Пометка = НЕ Элементы.ВнутренниеПеречниКомандаИстория.Пометка;
	УстановитьСвойстваДинамическогоСпискаВнутренниеПеречниНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаВнутренниеПеречниНаСервере()
	
	ПараметрыДинамическогоСписка = Новый Структура;
	
	Если Элементы.ВнутренниеПеречниКомандаИстория.Пометка Тогда
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "Документ.ВнесениеИзмененийВоВнутреннийПеречень");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВнесениеИзмененийВоВнутреннийПеречень.Дата КАК Дата,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Дата КАК Период,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Ссылка КАК Регистратор,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Организация КАК Организация,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Объект КАК Объект,
			|	ВнесениеИзмененийВоВнутреннийПеречень.ВидПеречня КАК ВидПеречня,
			|	ВнесениеИзмененийВоВнутреннийПеречень.ВидИзменения КАК ВидИзменения,
			|	ВнесениеИзмененийВоВнутреннийПеречень.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Включение)
			|		ИЛИ ВнесениеИзмененийВоВнутреннийПеречень.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Изменение) КАК Действует,
			|	&Период КАК Период1
			|ИЗ
			|	Документ.ВнесениеИзмененийВоВнутреннийПеречень КАК ВнесениеИзмененийВоВнутреннийПеречень
			|ГДЕ
			|	ВнесениеИзмененийВоВнутреннийПеречень.Объект = &Объект");
		
		//&Период потому что при переопределении текста запрса, 1с его удалит
		
		Элементы.ВнутренниеПеречниДата.Видимость = Истина; //СКД по умолчанию ставит сортировку по дате, если основная таблица документ
		Элементы.ВнутренниеПеречниПериод.Видимость = Ложь; 
		Элементы.ВнутренниеПеречниВидИзменения.Видимость = Истина;
		
	Иначе
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "РегистрСведений.ВнутренниеПеречни.СрезПоследних");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВнесениеИзмененийВоВнутреннийПеречень.Дата КАК Дата,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Период КАК Период,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Регистратор КАК Регистратор,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.НомерСтроки КАК НомерСтроки,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Активность КАК Активность,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Организация КАК Организация,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Объект КАК Объект,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.ВидПеречня КАК ВидПеречня,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Действует КАК Действует,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Регистратор.ВидИзменения КАК ВидИзменения
			|ИЗ
			|	РегистрСведений.ВнутренниеПеречни.СрезПоследних(&Период, Объект = &Объект) КАК РегистрСведенийВнутренниеПеречниСрезПоследних
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнесениеИзмененийВоВнутреннийПеречень КАК ВнесениеИзмененийВоВнутреннийПеречень
			|	ПО РегистрСведенийВнутренниеПеречниСрезПоследних.Регистратор = ВнесениеИзмененийВоВнутреннийПеречень.Ссылка
			|ГДЕ
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Действует");
		
		Элементы.ВнутренниеПеречниДата.Видимость = Ложь;
		Элементы.ВнутренниеПеречниПериод.Видимость = Истина; //период входит в ключ записи для регистра
		Элементы.ВнутренниеПеречниВидИзменения.Видимость = Ложь;
	
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ВнутренниеПеречни, ПараметрыДинамическогоСписка);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьНомерПоПорядку(КлючЗаписи, Направление)
	
	ИмяРегистра = КлючЗаписи.Метаданные().Имя;
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(КлючЗаписи.Организация);
	НаборЗаписей.Отбор.ЮрФизЛицо.Установить(КлючЗаписи.ЮрФизЛицо);
	НаборЗаписей.Прочитать();
	
	КоличествоИзмененныхЗаписей = 0;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку Тогда
			Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку + Направление;
			КоличествоИзмененныхЗаписей = КоличествоИзмененныхЗаписей + 1;
		ИначеЕсли Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку + Направление Тогда
			Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку;
			КоличествоИзмененныхЗаписей = КоличествоИзмененныхЗаписей + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоИзмененныхЗаписей = 2 Тогда
		КлючЗаписи = РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(Новый Структура("Организация, ЮрФизЛицо, НомерПоПорядку", КлючЗаписи.Организация, КлючЗаписи.ЮрФизЛицо, КлючЗаписи.НомерПоПорядку + Направление));
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Элементы[ИмяРегистра].Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКоманды_СоздатьВнесениеИзмененийВоВнутреннийПеречень()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЮрФизЛица", Объект.ВидЮрФизЛица);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПеречнейОбъектов.Ссылка КАК Ссылка,
		|	ВидыПеречнейОбъектов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ВидыПеречнейОбъектов КАК ВидыПеречнейОбъектов
		|ГДЕ
		|	ВЫБОР &ВидЮрФизЛица
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА ВидыПеречнейОбъектов.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ВнутренниеПеречни)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|			ТОГДА ВидыПеречнейОбъектов.Ссылка В (ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.Инсайдеры))
		|	КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИмяКоманды = "СоздатьВнесениеИзмененийВоВнутреннийПеречень_" + Выборка.ИмяПредопределенныхДанных;
		
		НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяКоманды);	
		НоваяКоманда.Действие = "СоздатьВнесениеИзмененийВоВнутреннийПеречень_Подключаемый";
		НоваяКоманда.Заголовок = Выборка.Ссылка;
		НоваяКоманда.ИспользуемаяТаблица = Элементы.ВнутренниеПеречни;
		
		КнопкаФормы = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ВнутренниеПеречниГруппаСоздать);
		КнопкаФормы.ИмяКоманды	= ИмяКоманды;
		КнопкаФормы.Заголовок	= Выборка.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВнесениеИзмененийВоВнутреннийПеречень_Подключаемый(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Объект",		Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("ВидПеречня",	ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов." + СтрРазделить(Команда.Имя, "_")[1]));
	
	ОткрытьФорму("Документ.ВнесениеИзмененийВоВнутреннийПеречень.Форма.ФормаДокумента", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
	
КонецПроцедуры

&НаКлиенте
Процедура ВнутренниеПеречниВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Элементы.ВнутренниеПеречниКомандаИстория.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для открытия перейдите в режим 'История'");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные <> Неопределено Тогда
		ИзменитьНомерПоПорядку(Команда.ИспользуемаяТаблица.ТекущаяСтрока, -1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные <> Неопределено Тогда
		ИзменитьНомерПоПорядку(Команда.ИспользуемаяТаблица.ТекущаяСтрока, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКвалификацииОткрытьПрисоединенныеФайлы(Команда)
	
	ТекущиеДанные = Элементы.СведенияОКвалификацииФизическихЛиц.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(ТекущиеДанные.ДокументОКвалификации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	РаботаСФайловымХранилищемКлиент.ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, 
		ИмяСобытия, Параметр, Источник, "СведенияОКвалификацииФизическихЛиц");

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры


