
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
			
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура Сформировать(Команда)                              
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Сформировать");
	Попытка
		ВыполнитьСформировать(ПараметрыСессии, Команда);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_функции

&НаСервере
Процедура ЗаполнитьТаблицуОтчетовНаСервере()
	
	Объект.ТаблицаОтчетов.Очистить();
		
	// Для каждой даты периода отчеты формируем отдельно
	ТаблицаИсходныхОтчетов = Новый ТаблицаЗначений;
	ТаблицаИсходныхОтчетов.Колонки.Добавить("Ключ", Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки"));
	ТаблицаИсходныхОтчетов.Колонки.Добавить("Значение", Новый ОписаниеТипов("СправочникСсылка.Отчеты"));
	ТаблицаИсходныхОтчетов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	
	Если Объект.ВариантФормирования = 1 Тогда // Только Перечень имущества
		НоваяСтрока = ТаблицаИсходныхОтчетов.Добавить();
		НоваяСтрока.Ключ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "_ПереченьИмуществаПИФ");
		НоваяСтрока.Значение = Справочники.Отчеты.НайтиПоРеквизиту("Ключ", НоваяСтрока.Ключ);
		НоваяСтрока.Представление = "ПереченьИмущества";
	ИначеЕсли Объект.ВариантФормирования = 2 Тогда // Только Журнал учета имущества
		
		НоваяСтрока = ТаблицаИсходныхОтчетов.Добавить();
		НоваяСтрока.Ключ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "_ЖурналУчетаИмуществаПИФ");
		НоваяСтрока.Значение = Справочники.Отчеты.НайтиПоРеквизиту("Ключ", НоваяСтрока.Ключ);
		НоваяСтрока.Представление = "ЖурналУчетаИмущества";
		
	Иначе // Оба
		
		НоваяСтрока = ТаблицаИсходныхОтчетов.Добавить();
		НоваяСтрока.Ключ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "_ПереченьИмуществаПИФ");
		НоваяСтрока.Значение = Справочники.Отчеты.НайтиПоРеквизиту("Ключ", НоваяСтрока.Ключ);
		НоваяСтрока.Представление = "ПереченьИмущества";
		
		НоваяСтрока = ТаблицаИсходныхОтчетов.Добавить();
		НоваяСтрока.Ключ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "_ЖурналУчетаИмуществаПИФ");
		НоваяСтрока.Значение = Справочники.Отчеты.НайтиПоРеквизиту("Ключ", НоваяСтрока.Ключ);
		НоваяСтрока.Представление = "ЖурналУчетаИмущества";
	
	КонецЕсли;	
	
	Для Каждого ТекОтчет Из ТаблицаИсходныхОтчетов Цикл
	
		ТекДата = Объект.Период.ДатаНачала;	
		Пока ТекДата <= Объект.Период.ДатаОкончания Цикл  
			
			СформироватьОтчетыЗаДату(ТекДата, ТекОтчет);             								
			ТекДата = ТекДата + 24 * 60 * 60;
			
		КонецЦикла;	
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетызаДату(ТекДата, ТекОтчет)
	
	МассивСчетоДУ = Новый Массив;
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		МассивСчетоДУ.Добавить(Объект.СчетДоверительногоУправления);
	Иначе
		МассивСчетоДУ = ПолучитьМассивСчетовДУ(ТекДата);
	КонецЕсли;	

	Для Каждого ТекСчетДУ Из МассивСчетоДУ Цикл
		
		// Проверка даты для Журнала и для Перечня разная
		Если ТекОтчет.Представление = "ПереченьИмущества" Тогда
			ДатаФормированияОтчета = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(Объект.Организация, ТекСчетДУ, ТекДата);
		Иначе
			ДатаФормированияОтчета = НачалоДня(КонецМесяца(ТекДата));
		КонецЕсли;
		
		Если ДатаФормированияОтчета <> ТекДата Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкиОтчета = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(ТекДата, ТекСчетДУ, ТекОтчет.Значение);
		
		Если ЗначениеЗаполнено(НастройкиОтчета.ПутьКФайлу) Тогда
			
			ДанныеОтчета = Новый Структура;
			
			ДанныеОтчета.Вставить("Субъект",		ТекСчетДУ);
			ДанныеОтчета.Вставить("Отчет",			ТекОтчет.Значение);
			ДанныеОтчета.Вставить("Периодичность",	?(ТекОтчет.Представление = "ПереченьИмущества", Перечисления.ПериодичностьПредоставленияОтчетности.Ежедневно, Перечисления.ПериодичностьПредоставленияОтчетности.Ежемесячно));
			ДанныеОтчета.Вставить("ДатаНачала",		?(ТекОтчет.Представление = "ПереченьИмущества", ТекДата, Объект.Период.ДатаНачала));
			ДанныеОтчета.Вставить("ДатаОкончания",	ТекДата);
			
			НастройкиОтчета.ПутьКФайлу = РегистрыСведений.СоставИНастройкиОтчетов.ОбработатьПутьКФайлу(НастройкиОтчета.ПутьКФайлу, ДанныеОтчета);
			
		КонецЕсли;
		
		НоваяСтрока = Объект.ТаблицаОтчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкиОтчета);
							
		НоваяСтрока.Отчет 							= ТекОтчет.Значение;
		НоваяСтрока.КлючОтчета 						= ТекОтчет.Ключ;
		НоваяСтрока.СчетДоверительногоУправления	= ТекСчетДУ;
		НоваяСтрока.ДатаНачала 						= ?(ТекОтчет.Представление = "ПереченьИмущества", ТекДата, Объект.Период.ДатаНачала);
		НоваяСтрока.Периодичность 					= ?(ТекОтчет.Представление = "ПереченьИмущества", Перечисления.ПериодичностьПредоставленияОтчетности.Ежедневно, Перечисления.ПериодичностьПредоставленияОтчетности.Ежемесячно);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСчетовДУ(ТекДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.ДатаЗаключения <= &Дата
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Дата)
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)";
	
	Запрос.УстановитьПараметр("Дата", ТекДата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчетыНаСервере(Отказ)
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ВыгрузитьФайл", 		Не Объект.НеСохранятьФайлы);
	СтруктураДействий.Вставить("ОтправитьФайл", 		Ложь);
	СтруктураДействий.Вставить("Перезаполнить", 		Истина);
	СтруктураДействий.Вставить("ОткрытьФорму", 			Ложь);
	СтруктураДействий.Вставить("ОткрытьИПерезаполнить", Ложь);

	Для каждого СтрокаТаблицы Из Объект.ТаблицаОтчетов Цикл
					
		ПараметрыФормы = ПолучитьСтруктуруПараметров(Новый Структура("Организация, СчетДоверительногоУправления, Периодичность, ДатаНачала, Отчет, КлючОтчета, Подписант, ПутьКФайлу", 
																	Объект.Организация, 
																	СтрокаТаблицы.СчетДоверительногоУправления, 
																	СтрокаТаблицы.Периодичность, 
																	СтрокаТаблицы.ДатаНачала, 
																	СтрокаТаблицы.Отчет, 
																	СтрокаТаблицы.КлючОтчета, 
																	СтрокаТаблицы.Подписант, 
																	СтрокаТаблицы.ПутьКФайлу), 
																СтруктураДействий, 
																?(СтрокаТаблицы.Периодичность = ПредопределенноеЗначение("Перечисление.ПериодичностьПредоставленияОтчетности.Ежедневно"), СтрокаТаблицы.ДатаНачала, Объект.Период.ДатаОкончания));
																	
		ОбработатьОтчетНаСервере(СтрокаТаблицы, ПараметрыФормы, Отказ);
				
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтчетНаСервере(СтрокаТаблицы, ДополнительныеПараметры, Отказ)

	Если ЗначениеЗаполнено(СтрокаТаблицы.КлючОтчета) Тогда
				
		Если ДополнительныеПараметры.Свойство("НастройкиОтчета") Тогда
			НастройкиОтчета = ДополнительныеПараметры.НастройкиОтчета;
			//Формируем
			Справочники.Отчеты.ВыполнитьАвтоматическоеФормирование(СтрокаТаблицы.КлючОтчета, НастройкиОтчета);
			Если НастройкиОтчета.Свойство("Результат") Тогда
				//Выгружаем
				РаботаСОтчетамиКлиентСервер.ВыгрузитьРезультатОтчета(НастройкиОтчета, НастройкиОтчета.Результат, , Отказ);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не сформирован отчет " + СокрЛП(СтрокаТаблицы.КлючОтчета) + " по " + СокрЛП(НастройкиОтчета.СчетДоверительногоУправления) + " за " + Формат(НастройкиОтчета.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"),,,, Отказ);
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не получены настройки отчета " + СокрЛП(СтрокаТаблицы.КлючОтчета),,,,Отказ);
		КонецЕсли; 
		
	ИначеЕсли Не СтрокаТаблицы = Неопределено И Не ЗначениеЗаполнено(СтрокаТаблицы.КлючОтчета) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен ключ отчета",,,, Отказ);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметров(СтрокаПакета, СтруктураДействий, ОтчетнаяДата)

	ДополнительныеПараметры = Новый Структура;
	
	НастройкиОтчета = Новый Структура;
	
	НастройкиОтчета.Вставить("АвтоматическоеФормирование", 		Истина);
	НастройкиОтчета.Вставить("СтруктураДействий", 				СтруктураДействий);
	НастройкиОтчета.Вставить("Организация", 					СтрокаПакета.Организация);
	НастройкиОтчета.Вставить("СчетДоверительногоУправления",	СтрокаПакета.СчетДоверительногоУправления);
	НастройкиОтчета.Вставить("Периодичность", 					СтрокаПакета.Периодичность);
	НастройкиОтчета.Вставить("Отчет", 							СтрокаПакета.Отчет);
	НастройкиОтчета.Вставить("КлючОтчета", 						СтрокаПакета.КлючОтчета);
	НастройкиОтчета.Вставить("Подписант", 						СтрокаПакета.Подписант);
	НастройкиОтчета.Вставить("ПутьКФайлу", 						СтрокаПакета.ПутьКФайлу);
	
	Если ЗначениеЗаполнено(СтрокаПакета.Подписант) Тогда
					
		СтруктураКлюча = Новый Структура;

		СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	    СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
		СтруктураКлюча.Вставить("Объект", СтрокаПакета.Организация);
		СтруктураКлюча.Вставить("КонтактноеЛицо", СтрокаПакета.Подписант);
		
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
		
		НастройкиОтчета.Вставить("Подписант", СтруктураДанныхКонтактногоЛица);
		
	КонецЕсли;
	
	Период = Новый СтандартныйПериод(СтрокаПакета.ДатаНачала, ОтчетнаяДата);
	НастройкиОтчета.Вставить("Период", Период);
	
	ДополнительныеПараметры.Вставить("НастройкиОтчета", НастройкиОтчета);
	
	Возврат ДополнительныеПараметры;

КонецФункции

#КонецОбласти
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
 
 ОбъектОбработки = РеквизитФормыВЗначение("Объект");
 
 П
&НаКлиенте
Процедура ВыполнитьСформировать(ПараметрыСессии, Команда)

	Отказ = Ложь;
	ЗаполнитьТаблицуОтчетовНаСервере();

	ОбработатьОтчетыНаСервере(Отказ);

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(Отказ, "Обработка завершена с ошибками", "Обработка завершена"));


КонецПроцедуры
араметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
 
 Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
 Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
  Механизм,
  ПараметрыВыполненияДляСбораСтатистики.Хранилище,
  ПараметрыВыполненияДляСбораСтатистики.Описание);
  
 ПараметрыСессии = Новый Структура;
 ПараметрыСессии.Вставить("Механизм",     Механизм);
 ПараметрыСессии.Вставить("Сессия",        Сессия);
 ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
 ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
  
 Возврат ПараметрыСессии;
 
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
 
 РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
  ПараметрыСессии.Механизм,
  ПараметрыСессии.Сессия,,
  ПараметрыСессии.ДопПараметры,
  ПараметрыСессии.ТекстОшибки);
 
КонецПроцедуры

#КонецОбласти
