
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",        КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые", Ложь);
	
КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
Процедура КомандаПоказатьСкрытьЗакрытые(Команда)
	
	Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка = Не Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые",
		Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданНовыйДепозитарныйСчет" Тогда
		Элементы.Список.Обновить();
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
	
КонецПроцедуры
