
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("Дата", ЭтаФорма.Дата);
	ЭтаФорма.Параметры.Свойство("Клиент", ЭтаФорма.Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура("Клиент, Дата", ЭтотОбъект.Клиент, ЭтотОбъект.Дата);
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		Отбор = Новый Структура("Владелец", Список.Отбор.Элементы[0].ПравоеЗначение);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	КонецЕсли;
	
	ФормаОбъекта = ОткрытьФорму("Справочник.ДенежныеПотокиПоОблигациям.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура("Ключ, Клиент, Дата", ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока, ЭтотОбъект.Клиент, ЭтотОбъект.Дата);
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		Отбор = Новый Структура("Владелец", Список.Отбор.Элементы[0].ПравоеЗначение);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	КонецЕсли;
	
	ФормаОбъекта = ОткрытьФорму("Справочник.ДенежныеПотокиПоОблигациям.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры
