
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Список сотрудников для обучения",
		"0.04",
		"",
		Истина,
		"");
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",		ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ЭтотОбъект.Период.ДатаОкончания);
	
	//1. Если сотрудника приняли на работу, состояния у него нет, это значит он работает.
	//2. Если сотрудник на Дату окончания работает и не уволился, Дата присутсвия это дата окончания. 
	//		Если он выйдет на работу до увольнения, показываем дату выхода.
	//3. Если сотрудник уволился в периоде или знаем что уволится - покажем это.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизацииНаОтчетнуюДату.Сотрудник КАК Сотрудник,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Имя + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество КАК ФИО,
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние ЕСТЬ NULL
		|			ИЛИ СостояниеСотрудниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа) КАК ПрисутствуетНаДату,
		|	ВЫБОР
		|		КОГДА СостояниеСотрудниковОрганизацийСрезПоследних.Состояние ЕСТЬ NULL
		|					ИЛИ СостояниеСотрудниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|		ИНАЧЕ ЕСТЬNULL(ДатыВыходаНаРаботу.Дата, ДАТАВРЕМЯ(1, 1, 1))
		|	КОНЕЦ КАК ДатаПрисутствия,
		|	СотрудникиОрганизацииНаОтчетнуюДату.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение) КАК Уволен,
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизацииСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА СотрудникиОрганизацииСрезПоследних.Период
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаУвольнения,
		|	ЕСТЬNULL(Инсайдеры.Действует, ЛОЖЬ) КАК Инсайдер,
		|	Инсайдеры.Период КАК ДатаИнсайдера
		|ИЗ
		|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК СотрудникиОрганизацииНаОтчетнуюДату
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СотрудникиОрганизацииНаОтчетнуюДату.Сотрудник = Сотрудники.Ссылка
		|			И (Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиСотрудников.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиСотрудников.Совместительство)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСотрудниковОрганизаций.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК СостояниеСотрудниковОрганизацийСрезПоследних
		|		ПО СотрудникиОрганизацииНаОтчетнуюДату.Сотрудник = СостояниеСотрудниковОрганизацийСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(, Организация = &Организация) КАК СотрудникиОрганизацииСрезПоследних
		|		ПО СотрудникиОрганизацииНаОтчетнуюДату.Сотрудник = СотрудникиОрганизацииСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеСотрудниковОрганизаций.Сотрудник КАК Сотрудник,
		|			МИНИМУМ(СостояниеСотрудниковОрганизаций.Период) КАК Дата
		|		ИЗ
		|			РегистрСведений.СостояниеСотрудниковОрганизаций КАК СостояниеСотрудниковОрганизаций
		|		ГДЕ
		|			СостояниеСотрудниковОрганизаций.Организация = &Организация
		|			И СостояниеСотрудниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)
		|			И СостояниеСотрудниковОрганизаций.Период > &ДатаОкончания
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СостояниеСотрудниковОрганизаций.Сотрудник) КАК ДатыВыходаНаРаботу
		|		ПО СотрудникиОрганизацииНаОтчетнуюДату.Сотрудник = ДатыВыходаНаРаботу.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
		|		ПО (Сотрудники.ЮрФизЛицо = РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренниеПеречни.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.Инсайдеры)) КАК Инсайдеры
		|		ПО (Сотрудники.ЮрФизЛицо = Инсайдеры.Объект)
		|ГДЕ
		|	СотрудникиОрганизацииНаОтчетнуюДату.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО";
	
	Макет = ПолучитьМакет("Отчет");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Организация	= ЭтотОбъект.Организация;
	ОбластьШапка.Параметры.Дата			= Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ='dd.MM.yyyy ''г.'''");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

#КонецОбласти

