
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;

	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если ТекущийОбъект.ВидОперации = Перечисления.ВидыНазначенийИнвестиционныхДеклараций.Отмена Тогда
		ЭтаФорма.ИнвестиционнаяДекларация = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.ИнвестиционныеДекларации"));
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТипИнвестиционнойДекларацииПриИзменении(Элемент)
	ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИнвестиционнаяДекларацияПриИзменении(Элемент)
	
	Если Объект.ИнвестиционныеДекларации.Количество() = 0 Тогда
		Объект.ИнвестиционныеДекларации.Добавить();
	КонецЕсли; 
	Объект.ИнвестиционныеДекларации[0].ИнвестиционнаяДекларация = ЭтаФорма.ИнвестиционнаяДекларация;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвестиционныеДекларацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Для каждого ИнвестиционнаяДекларация Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ИнвестиционныеДекларации.Добавить();
			НоваяСтрока.ИнвестиционнаяДекларация = ИнвестиционнаяДекларация;
		КонецЦикла; 
		ЭтаФорма.Модифицированность = Истина;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("ТипИнвестиционнойДекларации", Объект.ТипИнвестиционнойДекларации);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФормуМодально("Справочник.ИнвестиционныеДекларации.ФормаВыбора", ПараметрыФормы, Элементы.ИнвестиционныеДекларации);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчетПоЛимитнойВедомости(Команда)
	
	ОтчетПоЛВ = ПолучитьОтчетПоЛимитнойВедомости(Объект.Ссылка, Объект.Организация, Объект.Дата);
	Если ТипЗнч(ОтчетПоЛВ) = Тип("ТабличныйДокумент") Тогда
		ОтчетПоЛВ.Показать(СтрШаблон("Лимитная ведомость %1 %2", Объект.Субъект, Объект.ВидДоговораДоверительногоУправления));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма);
	
	Если Объект.ИнвестиционныеДекларации.Количество() <> 0 Тогда
		ЭтаФорма.ИнвестиционнаяДекларация = Объект.ИнвестиционныеДекларации[0].ИнвестиционнаяДекларация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма)
	
	ЭтоНазначение = ЭтаФорма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНазначенийИнвестиционныхДеклараций.Назначение");
	
	ЭтоИнвестиционнаяДекларация = ЭтаФорма.Объект.ТипИнвестиционнойДекларации = ПредопределенноеЗначение("Перечисление.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация");
	ЭтоЛимитнаяВедомость 		= ЭтаФорма.Объект.ТипИнвестиционнойДекларации = ПредопределенноеЗначение("Перечисление.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость");
	
	ЭтаФорма.Элементы.ВидДоговораДоверительногоУправления.Видимость = Не ЭтоИнвестиционнаяДекларация;
	ЭтаФорма.Элементы.ИнвестиционныеДекларации.Видимость = Не ЭтоИнвестиционнаяДекларация И ЭтоНазначение;
	
	ЭтаФорма.Элементы.ИнвестиционнаяДекларация.Видимость = ЭтоИнвестиционнаяДекларация И ЭтоНазначение;
	
	ЭтаФорма.Элементы.ФормаКомандаОтчетПоЛимитнойВедомости.Видимость = ЭтоЛимитнаяВедомость И ЭтоНазначение;
	
	Если ЭтоИнвестиционнаяДекларация Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.СчетаДоверительногоУправления"));
		МассивТипов.Добавить(Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования"));
		ЭтаФорма.Элементы.Субъект.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	Иначе
		ЭтаФорма.Элементы.Субъект.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтчетПоЛимитнойВедомости(Ссылка, Организация, Дата)

	// Получить обработку импорта
	ОбработкаИмпортЛВ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ИмпортЛимитныхВедомостей");
	Если ОбработкаИмпортЛВ = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружена обработка ""Импорт лимитных ведомостей"""); 
		Возврат Неопределено;
	КонецЕсли; 
	
	// Получить файл ЛВ
	ИмяФайлаЛВ = ПолучитьИмяФайлаЛВ(Ссылка);
	Если Не ЗначениеЗаполнено(ИмяФайлаЛВ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задано имя файла лимитной ведомости"); 
		Возврат Неопределено;
	КонецЕсли; 
	
	ДанныеФайла = ПолучитьДанныеФайлаИзДокументооборота(Ссылка, ИмяФайлаЛВ);
	Если ТипЗнч(ДанныеФайла) <> Тип("Структура") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует файл лимитной ведомости"); 
		Возврат Неопределено;
	КонецЕсли;
	ДанныеФайла.Вставить("ДатаСоздания", Дата);
	
	ФайлыДляОбработки = Новый Массив;
	ФайлыДляОбработки.Добавить(ДанныеФайла);
	
	// Прочитать файл
	ОбработкаИмпортЛВ.Организация = Организация;
	СтруктураТаблиц = ОбработкаИмпортЛВ.ПрочитатьФайлы(ФайлыДляОбработки, Ложь);
	
	Если СтруктураТаблиц.Ошибки.Количество() > 0 Тогда
		
		// Вывести ошибки
		Для каждого СтрокаОшибки Из СтруктураТаблиц.Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки.ОписаниеОшибки); 
		КонецЦикла;
		СводныйОтчет = Неопределено;
		
	Иначе
		
		// Сформировать отчет
		СводнаяТаблица = ОбработкаИмпортЛВ.ПолучитьСводнуюТаблицуЛимитов(СтруктураТаблиц);
		СводныйОтчет = ОбработкаИмпортЛВ.ПолучитьСводныйОтчет(СтруктураТаблиц.ГруппыЭмитентов, СводнаяТаблица);
		
	КонецЕсли; 
	
	Возврат СводныйОтчет;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьИмяФайлаЛВ(Ссылка)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ЗначенияДополнительныхСведений.Свойство = ДополнительныеСведения.Ссылка
		|			И (ДополнительныеСведения.Ключ = ""ИнвестиционныеДекларации.ИмяФайлаЛимитнойВедомости"")
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.Значение;
	
	КонецЕсли;

КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаИзДокументооборота(Ссылка, ИмяФайлаЛВ)

	ДанныеФайлов = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(Ссылка);
	
	Файл = Новый Файл(ИмяФайлаЛВ);
	Расширение = СтрЗаменить(Файл.Расширение, ".", "");
			
	Для каждого ДанныеФайла Из ДанныеФайлов Цикл	
		
		Если ДанныеФайла.Наименование = Файл.ИмяБезРасширения И ДанныеФайла.Расширение = Расширение Тогда
		
			ДанныеФайла = РаботаСФайловымХранилищем.ПолучитьФайл(ДанныеФайла.ИдентификаторФайла);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);
			УдалитьИзВременногоХранилища(ДанныеФайла.Адрес);
			
			Возврат Новый Структура("ДвоичныеДанные, ПолноеИмяФайла, ИмяФайла", ДвоичныеДанные, ИмяФайлаЛВ, ИмяФайлаЛВ);
		
		КонецЕсли; 
			
	КонецЦикла;

КонецФункции 

#КонецОбласти 
