// Интерфейс для регистрации обработки.
//
Функция СведенияОВнешнейОбработке() Экспорт

	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Настройки отчета 482 ЦК >45 млн",
		"1.0",
		"Копирование настроек квартального отчета 482 в годовой отчет 482 >45 млн для счетов ДУ с видом договора ""Управление активами целевых капиталов""",
		Истина);

	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);

	Возврат РегистрационныеДанные;

КонецФункции