Процедура ЗаполнитьДополнительныеСвойстваВариантаОтчета(Отчет, КлючВарианта) Экспорт
	
	ДополнительныеСвойстваОтчета = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;	
	
	СвойстваВариантаОтчета = РаботаСОтчетами.ПолучитьСвойстваВариантаОтчета(КлючВарианта);	
	
	РаботаСКоллекциями.ДополнитьСтруктуру(ДополнительныеСвойстваОтчета, СвойстваВариантаОтчета, Истина);		
	
КонецПроцедуры

Функция ПолучитьКлючВариантаОтчета(Отчет) Экспорт
	КлючВарианта = Неопределено;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);
	
	Возврат КлючВарианта;
КонецФункции

Функция ПолучитьИмяПредопределенногоВариантаОтчета(Отчет) Экспорт
	ИмяПредопределенногоВарианта = Неопределено;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ИмяПредопределенногоВарианта", ИмяПредопределенногоВарианта);
	
	Возврат ИмяПредопределенногоВарианта;
КонецФункции

Функция ПолучитьПредставлениеВариантаОтчета(Отчет) Экспорт
	ПредставлениеВарианта = Неопределено;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ПредставлениеВарианта", ПредставлениеВарианта);
	
	Возврат ПредставлениеВарианта;
КонецФункции

Процедура ЗаполнитьПодписанта(Форма, Организация = Неопределено) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ПолеСуществует(Форма, "Подписант") Тогда
		Возврат;	
	КонецЕсли;
	
	ПолноеИмяОтчета = Лев(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".", , , 2) - 1); 
	
	Попытка
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьПодписантаПоУмолчанию(ПолноеИмяОтчета, Организация);
	Исключение
		СтруктураДанныхКонтактногоЛица = Неопределено;	
	КонецПопытки;
	
	СтруктураКорректна = (ТипЗнч(СтруктураДанныхКонтактногоЛица) = Тип("Структура") И СтруктураДанныхКонтактногоЛица.Свойство("КонтактноеЛицо"));
	
	Форма.Подписант = ?(СтруктураКорректна, СтруктураДанныхКонтактногоЛица.КонтактноеЛицо, Неопределено); 
	
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Форма, "Отчет")
		И ОбщегоНазначенияКлиентСервер.ПолеСуществует(Форма.Отчет, "КомпоновщикНастроек")
		И ТипЗнч(Форма.Отчет.КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных")
	Тогда
		ДополнительныеСвойства = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", ?(СтруктураКорректна, СтруктураДанныхКонтактногоЛица, Неопределено));
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьНастройкиПодписантаОтчета(Отчет, Подписант, Организация, ОчиститьПриНесоответствии = Истина) Экспорт
		
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;		
	
	Если ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица") Тогда
		Возврат ПроверитьНастройкиПодписанта(Подписант, ДополнительныеСвойства.СтруктураДанныхКонтактногоЛица, Организация, ОчиститьПриНесоответствии);
	Иначе
		Возврат ПроверитьНастройкиПодписанта(Подписант, Неопределено, Организация, ОчиститьПриНесоответствии);
	КонецЕсли;	
	
КонецФункции

// Если сохранен подписант другого юр.лица, очистим подписанта
Функция ПроверитьНастройкиПодписанта(Подписант, СтруктураДанныхКонтактногоЛица, Объект, ОчиститьПриНесоответствии = Истина) Экспорт
	
	НастройкиКорректны = Истина;	
	
	Если СтруктураДанныхКонтактногоЛица = Неопределено Тогда 
		Если ЗначениеЗаполнено(Подписант) Тогда		
	    	НастройкиКорректны = Ложь;
		КонецЕсли;
	ИначеЕсли Не ТипЗнч(СтруктураДанныхКонтактногоЛица) = Тип("Структура")
		ИЛИ Не СтруктураДанныхКонтактногоЛица.Свойство("КонтактноеЛицо")
		ИЛИ Не СтруктураДанныхКонтактногоЛица.КонтактноеЛицо = Подписант
		ИЛИ Не СтруктураДанныхКонтактногоЛица.Свойство("Объект")
		ИЛИ Не (ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") И СтруктураДанныхКонтактногоЛица.Объект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЮрФизЛицо")
			ИЛИ ТипЗнч(Объект) <> Тип("СправочникСсылка.Организации") И СтруктураДанныхКонтактногоЛица.Объект = Объект)
	Тогда
	    НастройкиКорректны = Ложь;
	КонецЕсли;

	Если Не НастройкиКорректны И ОчиститьПриНесоответствии Тогда
		Подписант						= Неопределено;
		СтруктураДанныхКонтактногоЛица	= Неопределено;
	КонецЕсли;	

	Возврат НастройкиКорректны; 	
	
КонецФункции

Функция ПроверитьСтруктуруДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица) Экспорт 		
	
	Если ТипЗнч(СтруктураДанныхКонтактногоЛица) = Тип("Структура")
		И СтруктураДанныхКонтактногоЛица.Свойство("КонтактноеЛицо")
		И СтруктураДанныхКонтактногоЛица.Свойство("Объект")
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьПериодОтчета(Период, РазрешенаПустаяДатаНачала = Ложь, РазрешенаПустаяДатаОкончания = Ложь, Отказ = Ложь, КлючДанных = Неопределено, Поле = "", ПутьКДанным = "") Экспорт
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Период, РазрешенаПустаяДатаНачала, РазрешенаПустаяДатаОкончания, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КлючДанных, Поле, ПутьКДанным, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#Область Обработка_результата_отчета

Функция ПолучитьКаталогСохраненияРезультатаОтчета(НастройкиОтчета, КлючКаталога = "КаталогСохранения", СоздаватьПриОтсутствии = Истина) Экспорт
	
	КаталогСохранения = Неопределено;
	
	Если НастройкиОтчета.Свойство(КлючКаталога, КаталогСохранения) И ЗначениеЗаполнено(КаталогСохранения) Тогда
		
		Если Не СтрЗаканчиваетсяНа(КаталогСохранения, "\") Тогда
			КаталогСохранения = КаталогСохранения + "\";
		КонецЕсли; 
		
		Каталог = Новый Файл(КаталогСохранения);
		
		Если Не Каталог.Существует() И СоздаватьПриОтсутствии Тогда
			Попытка
				СоздатьКаталог(КаталогСохранения);
			Исключение
				// Если несколько процессов одновременно пытаются создать каталог,
				// возникает ошибка "183(0x000000B7): Невозможно создать файл, так как он уже существует."
				Если СтрНайти(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), "183(0x000000B7)") = 0 Тогда 
					ВызватьИсключение;
				КонецЕсли;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат КаталогСохранения;	
	
КонецФункции

// В зависимости от типа результата возвращает структуру с данными результата формирования отчета
//	Параметры:
//		- Результат		- результат формирования отчета
//		- Расширение	- расширение файла, к формату которого необходимо привести результат формирования отчета
//	Свойства возвращаемой структура:
//		Для двоичных данных:
//			- ДвоичныеДанные	- двоичные данные конечного файла
//			- КонтрольнаяСумма	- контрольная сумма, вычисленная для переданных двоичных данных
//		Для табличного / текстового документов или пакета отображаемых документов:
//			- ДвоичныеДанные	- двоичные данные конечного файла
//			- КонтрольнаяСумма	- контрольная сумма, вычисленная для переданного результата формирования отчета
//
Функция ПолучитьДанныеРезультатаОтчета(Результат, Расширение = Неопределено) Экспорт
	
	// Адрес в хранилище
	Если ТипЗнч(Результат) = Тип("Строка") И ЭтоАдресВременногоХранилища(Результат) Тогда
		
		Возврат ПолучитьДанныеРезультатаОтчета(ПолучитьИзВременногоХранилища(Результат));
		
	// Двоичные данные
	ИначеЕсли ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
		
		ДанныеРезультатаОтчета = Новый Структура;
		
		ДанныеРезультатаОтчета.Вставить("ДвоичныеДанные",	Результат);
		ДанныеРезультатаОтчета.Вставить("КонтрольнаяСумма",	УниверсальныеМеханизмы.ПолучитьКонтрольнуюСуммуДвоичныхДанных(Результат));
		
		Возврат ДанныеРезультатаОтчета;
		
	// Если имя файла
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
		
		Попытка
			ДвоичныеДанные = Новый ДвоичныеДанные(Результат);
		Исключение
			ВызватьИсключение "Не удалось получить данные файла!";
		КонецПопытки;
		
		Возврат ПолучитьДанныеРезультатаОтчета(ДвоичныеДанные);
		
	// Если структура с пакетом отображаемых документов
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("ПакетОтображаемыхДокументов")
		И ТипЗнч(Результат.ПакетОтображаемыхДокументов) = Тип("ПакетОтображаемыхДокументов") Тогда
		
		Возврат ПолучитьДанныеРезультатаОтчета(Результат.ПакетОтображаемыхДокументов, Расширение);
		
	// Если табличный документ / пакет отображаемых документов / текстовый документ
	ИначеЕсли ТипЗнч(Результат) = Тип("ТабличныйДокумент") ИЛИ ТипЗнч(Результат) = Тип("ПакетОтображаемыхДокументов") ИЛИ ТипЗнч(Результат) = Тип("ТекстовыйДокумент") Тогда
		
		КонтрольнаяСумма	= Неопределено;
		Путь				= ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов();
		
		ИмяВременногоФайла = Путь + Строка(Новый УникальныйИдентификатор) + "." + Расширение;
		
		Если ТипЗнч(Результат) = Тип("ТабличныйДокумент")
			ИЛИ ТипЗнч(Результат) = Тип("ПакетОтображаемыхДокументов") Тогда
			
			ИмяВременногоФайлаДляКС = Путь + Строка(Новый УникальныйИдентификатор) + ".mxl";
			
			Попытка
				
				Если ТипЗнч(Результат) = Тип("ТабличныйДокумент") Тогда
					Результат.Записать(ИмяВременногоФайлаДляКС, ТипФайлаТабличногоДокумента.MXL);
				Иначе
					
					ТабличныйДокумент = ВывестиПакетОтображаемыхДокументовВТабличныйДокумент(Результат.Состав);
					
					ТабличныйДокумент.Записать(ИмяВременногоФайлаДляКС, ТипФайлаТабличногоДокумента.MXL);
					
				КонецЕсли;
				
				КонтрольнаяСумма = УниверсальныеМеханизмы.ПолучитьКонтрольнуюСуммуДвоичныхДанных(Новый ДвоичныеДанные(ИмяВременногоФайлаДляКС));
				
			Исключение
				// Ну, не смогли и не смогли
			КонецПопытки;
			
			Попытка
				УдалитьФайлы(ИмяВременногоФайлаДляКС);
			Исключение
				// Ну, не удалили и не удалили
			КонецПопытки;
			
			ФорматыФайлов = ?(ТипЗнч(Результат) = Тип("ТабличныйДокумент"), ТипФайлаТабличногоДокумента, ТипФайлаПакетаОтображаемыхДокументов);  
				
			Попытка
				ТипФайла = ФорматыФайлов[Расширение];
			Исключение
				ВызватьИсключение СтрШаблон("Сохранение отчета в формате '%1' не реализовано!", Расширение);
			КонецПопытки;
			
		Иначе
			ТипФайла = КодировкаТекста.UTF8;
		КонецЕсли;
		
		Попытка
			Результат.Записать(ИмяВременногоФайла, ТипФайла);
		Исключение
			ВызватьИсключение СтрШаблон("Не удалось записать временный файл '%1' из-за ошибки:%2", ИмяВременногоФайла, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			// Ну, не удалили, и не удалили
		КонецПопытки;
		
		Если КонтрольнаяСумма = Неопределено Тогда
			Возврат ПолучитьДанныеРезультатаОтчета(ДвоичныеДанные);
		Иначе
			
			ДанныеРезультатаОтчета = Новый Структура;
			
			ДанныеРезультатаОтчета.Вставить("ДвоичныеДанные",	ДвоичныеДанные);
			ДанныеРезультатаОтчета.Вставить("КонтрольнаяСумма",	КонтрольнаяСумма);
			
			Возврат ДанныеРезультатаОтчета;
			
		КонецЕсли;
		
	Иначе
		ВызватьИсключение СтрШаблон("Полученный тип результата отчета (%1) не поддерживается!", ТипЗнч(Результат));
	КонецЕсли;
	
КонецФункции

Функция ПолучитьФайлРезультатаОтчета(НастройкиОтчета, Результат) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда

		Если ЭтоАдресВременногоХранилища(Результат) Тогда		
			
			Возврат ПолучитьФайлРезультатаОтчета(НастройкиОтчета, ПолучитьИзВременногоХранилища(Результат));
			
		Иначе	
			
			ПутьКФайлу = Результат;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("ПакетОтображаемыхДокументов")
		И ТипЗнч(Результат.ПакетОтображаемыхДокументов) = Тип("ПакетОтображаемыхДокументов") Тогда
		
		Возврат ПолучитьФайлРезультатаОтчета(НастройкиОтчета, Результат.ПакетОтображаемыхДокументов);
		
	Иначе
		
		Файл		= ПолучитьПутьКФайлуОтчета(НастройкиОтчета);
		ПутьКФайлу	= КаталогВременныхФайлов() + Файл.Имя;
	
		Если ТипЗнч(Результат) = Тип("ТабличныйДокумент")
			ИЛИ ТипЗнч(Результат) = Тип("ПакетОтображаемыхДокументов")
		Тогда
			
			Расширение = Сред(Файл.Расширение, 2);
			
			ФорматыФайлов = ?(ТипЗнч(Результат) = Тип("ТабличныйДокумент"), ТипФайлаТабличногоДокумента, ТипФайлаПакетаОтображаемыхДокументов);  
				
			Попытка
				ТипФайла = ФорматыФайлов[Расширение];
			Исключение
				ВызватьИсключение "Сохранение отчета в формате """ + Расширение + """ не реализовано";
			КонецПопытки;		
			
			Попытка
				Результат.Записать(ПутьКФайлу, ТипФайла);
			Исключение
				ВызватьИсключение "Не удалось записать файл " + ПутьКФайлу;
			КонецПопытки;
			
		ИначеЕсли ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
			
			Попытка
				Результат.Записать(ПутьКФайлу); 
			Исключение
				ВызватьИсключение "Не удалось записать файл " + ПутьКФайлу;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Возврат Файл;	
	
КонецФункции

Функция ПолучитьПутьКФайлуОтчета(НастройкиОтчета) Экспорт
	
	Перем ПутьКФайлу;
	
	НастройкиОтчета.Свойство("ПутьКФайлу", ПутьКФайлу);
	Если ПутьКФайлу = Неопределено ИЛИ ПустаяСтрока(ПутьКФайлу) Тогда
		ВызватьИсключение "Не задано имя файла (настройка отчета ""Путь к файлу"")";
	КонецЕсли; 
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Возврат Файл;	
	
КонецФункции

Функция СохранитьРезультатОтчета(НастройкиОтчета, Результат, Файл)
	
	Если Файл = Неопределено Тогда
		
		Попытка
			
			Файл = ПолучитьФайлРезультатаОтчета(НастройкиОтчета, Результат);
			
		Исключение
			
			СообщитьОбОшибке(
				СтрШаблон("Ошибка сохранения результата отчета '%1' (%2) клиента %3.",
					НастройкиОтчета.Отчет, НастройкиОтчета.Периодичность, НастройкиОтчета.СчетДоверительногоУправления),
				ИнформацияОбОшибке()); 
			
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Файл.Существует();
	
КонецФункции

Функция СуществуетФайлРезультатаОтчета(Файл, Результат)
	
	Если Файл = Неопределено И ТипЗнч(Результат) = Тип("Строка") Тогда
		
		Файл = Новый Файл(Результат);
		
	КонецЕсли;
	
	Возврат ?(Файл = Неопределено, Ложь, Файл.Существует());
	
КонецФункции

Функция ТребуетсяОбработкаРезультатаОтчета(НастройкиОтчета, Действие = Неопределено, ПроверитьПараметры = Ложь, Ошибки = Неопределено) Экспорт
	
	Перем СтруктураДействий;	
	
	Если ТипЗнч(Ошибки) = Тип("Массив") Тогда
		ВыводитьОшибки	= Ложь;
		ОшибокБыло		= Ошибки.Количество(); 
	Иначе
		ВыводитьОшибки	= ПроверитьПараметры;
		Ошибки			= Новый Массив;
		ОшибокБыло		= 0;
	КонецЕсли;
	
	ПользовательскийНаборДействий = НастройкиОтчета.Свойство("СтруктураДействий", СтруктураДействий);
	
	// Отправка по почте
	
	ОтправкаПоПочте = (Действие = Неопределено ИЛИ Действие = "ОтправкаПоПочте") 
		И (ПользовательскийНаборДействий И СтруктураДействий.Свойство("ОтправитьФайл") И СтруктураДействий.ОтправитьФайл = Истина
			ИЛИ Не ПользовательскийНаборДействий И НастройкиОтчета.Свойство("АвтоматическаяОтправка") И НастройкиОтчета.АвтоматическаяОтправка = Истина);
			
	Если ОтправкаПоПочте И ПроверитьПараметры Тогда
		
		ПрефиксОшибки = СтрШаблон("Ошибка отправки отчета '%1' (%2) клиента %3:" + Символы.ПС,
			НастройкиОтчета.Отчет, НастройкиОтчета.Периодичность, НастройкиОтчета.СчетДоверительногоУправления);
			
		Если Не НастройкиОтчета.Свойство("ПутьКФайлу") ИЛИ Не ЗначениеЗаполнено(НастройкиОтчета.ПутьКФайлу) Тогда
			Ошибки.Добавить(ПрефиксОшибки + "не задано имя файла (настройка отчета ""Путь к файлу"")"); 
		КонецЕсли;
			
		Если Не НастройкиОтчета.Свойство("АдресЭлектроннойПочты") ИЛИ Не ЗначениеЗаполнено(НастройкиОтчета.АдресЭлектроннойПочты) Тогда
			Ошибки.Добавить(ПрефиксОшибки + "не заполнен адрес электронной почты клиента");	
		КонецЕсли;
		
		Если Не НастройкиОтчета.Свойство("АдресОтправителя") ИЛИ Не ЗначениеЗаполнено(НастройкиОтчета.АдресОтправителя) Тогда
			Ошибки.Добавить(ПрефиксОшибки + "не заполнен адрес отправителя");	
		КонецЕсли;	
		
	КонецЕсли;			
	
	// Выгрузка в файл	
	
	ВыгрузкаВФайл = (Действие = Неопределено ИЛИ Действие = "ВыгрузкаВФайл") 
		И (ПользовательскийНаборДействий И СтруктураДействий.Свойство("ВыгрузитьФайл") И СтруктураДействий.ВыгрузитьФайл = Истина
			ИЛИ Не ПользовательскийНаборДействий И НастройкиОтчета.Свойство("АвтоматическаяВыгрузка") И НастройкиОтчета.АвтоматическаяВыгрузка = Истина);
			
	Если ВыгрузкаВФайл И ПроверитьПараметры Тогда
		
		ПрефиксОшибки = СтрШаблон("Ошибка выгрузки отчета '%1' (%2) клиента %3:" + Символы.ПС,
			НастройкиОтчета.Отчет, НастройкиОтчета.Периодичность, НастройкиОтчета.СчетДоверительногоУправления);
			
		Если Не НастройкиОтчета.Свойство("ПутьКФайлу") ИЛИ Не ЗначениеЗаполнено(НастройкиОтчета.ПутьКФайлу) Тогда
			Ошибки.Добавить(ПрефиксОшибки + "не задано имя файла (настройка отчета ""Путь к файлу"")"); 
		КонецЕсли;
			
	КонецЕсли;
	
	// Выгрузка в ЭДО 	
	
	ВыгрузкаВЭДО = (Действие = Неопределено ИЛИ Действие = "ВыгрузкаВЭДО") 
		И (ПользовательскийНаборДействий И СтруктураДействий.Свойство("ВыгрузитьВЭДО") И СтруктураДействий.ВыгрузитьВЭДО = Истина
			ИЛИ Не ПользовательскийНаборДействий И НастройкиОтчета.Свойство("АвтоматическаяВыгрузкаВЭДО") И НастройкиОтчета.АвтоматическаяВыгрузкаВЭДО = Истина);
			
	Если ВыгрузкаВЭДО И ПроверитьПараметры Тогда
		
		ПрефиксОшибки = СтрШаблон("Ошибка выгрузки отчета '%1' (%2) клиента %3 для отправки в ЭДО:" + Символы.ПС,
			НастройкиОтчета.Отчет, НастройкиОтчета.Периодичность, НастройкиОтчета.СчетДоверительногоУправления);
			
		Если Не НастройкиОтчета.Свойство("ПутьКФайлу") ИЛИ Не ЗначениеЗаполнено(НастройкиОтчета.ПутьКФайлу) Тогда
			Ошибки.Добавить(ПрефиксОшибки + "не задано имя файла (настройка отчета ""Путь к файлу"")");
		КонецЕсли;
			
		Если Не НастройкиОтчета.Свойство("КаталогФайловДляОтправкиПоЭДО") ИЛИ Не ЗначениеЗаполнено(НастройкиОтчета.КаталогФайловДляОтправкиПоЭДО) Тогда
			Ошибки.Добавить(ПрефиксОшибки + "не заполнен каталог для отправки по ЭДО"); 
		КонецЕсли;
		
	КонецЕсли;
	
	// Сообщаем об ошибках при необходимости	
		
	Если ВыводитьОшибки Тогда	
		Для Каждого ТекстОшибки Из Ошибки Цикл
			СообщитьОбОшибке(ТекстОшибки);
		КонецЦикла;
	КонецЕсли;
	
	// Вычисляем результат функции 
	
	Если (ОтправкаПоПочте ИЛИ ВыгрузкаВФайл ИЛИ ВыгрузкаВЭДО) Тогда
		Если ПроверитьПараметры Тогда
			РезультатФункции = (Ошибки.Количество() = ОшибокБыло);
		Иначе
			РезультатФункции = Истина;
		КонецЕсли;
	Иначе
		РезультатФункции = Ложь;	
	КонецЕсли;
		
	Возврат РезультатФункции;			
			
КонецФункции

Процедура ВыгрузитьРезультатОтчета(НастройкиОтчета, Результат, Файл = Неопределено, Отказ = Ложь) Экспорт
	
	Если Не ТребуетсяОбработкаРезультатаОтчета(НастройкиОтчета, "ВыгрузкаВФайл", Истина) Тогда
		Возврат;
	КонецЕсли;
	
	// Выгрузка	
	
	Если Не СохранитьРезультатОтчета(НастройкиОтчета, Результат, Файл) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
	
	Попытка
		
		ФайлВыгрузки = ПолучитьПутьКФайлуОтчета(НастройкиОтчета);
		
		КаталогВыгрузки	= Новый Файл(ФайлВыгрузки.Путь);
		
		Если Не КаталогВыгрузки.Существует() Тогда
			СоздатьКаталог(ФайлВыгрузки.Путь);
		КонецЕсли;		
		
		КопироватьФайл(Файл.ПолноеИмя, ФайлВыгрузки.ПолноеИмя);
		
	Исключение
		СообщитьОбОшибке(
			СтрШаблон("Ошибка выгрузки отчета '%1' (%2) клиента %3.",
				НастройкиОтчета.Отчет, НастройкиОтчета.Периодичность, НастройкиОтчета.СчетДоверительногоУправления),
			ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

Процедура ВыгрузитьВЭДОРезультатОтчета(НастройкиОтчета, Результат, Файл = Неопределено, Отказ = Ложь) Экспорт
	
	Если Не ТребуетсяОбработкаРезультатаОтчета(НастройкиОтчета, "ВыгрузкаВЭДО", Истина) Тогда
		Возврат;
	КонецЕсли;
	
	// Выгрузка в каталог ЭДО	
	
	Если Не СохранитьРезультатОтчета(НастройкиОтчета, Результат, Файл) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

	КаталогСохранения = РаботаСОтчетамиКлиентСервер.ПолучитьКаталогСохраненияРезультатаОтчета(НастройкиОтчета, "КаталогФайловДляОтправкиПоЭДО", Ложь);
	
	Если ЗначениеЗаполнено(КаталогСохранения) Тогда
		
		ФайлВыгружен = Истина;
		
		Попытка
			КопироватьФайл(Файл.ПолноеИмя, КаталогСохранения + Файл.Имя);
		Исключение
			СообщитьОбОшибке(
				СтрШаблон("Ошибка выгрузки отчета '%1' (%2) клиента %3 для отправки в ЭДО.",
					НастройкиОтчета.Отчет, НастройкиОтчета.Периодичность, НастройкиОтчета.СчетДоверительногоУправления),
				ИнформацияОбОшибке());
			ФайлВыгружен = Ложь;
		КонецПопытки;						
		
		Если ФайлВыгружен
			И ТипЗнч(Результат) = Тип("Структура")
			И Результат.Свойство("РегламентированныйОтчет") Тогда
			РаботаСОтчетами.УстановитьСтатусРегламентированногоОтчета(Результат.РегламентированныйОтчет, "Отправлен");
		КонецЕсли;
		
		// Дополнительная копия в папку отчетов организации
		
		Если НастройкиОтчета.Свойство("СохранятьФайлПриОтправке") И НастройкиОтчета.СохранятьФайлПриОтправке = Истина Тогда

			Попытка
				КаталогСохранения = РаботаСОтчетамиКлиентСервер.ПолучитьКаталогСохраненияРезультатаОтчета(НастройкиОтчета, "КаталогОтправленныхОтчетов");
				Если ЗначениеЗаполнено(КаталогСохранения) Тогда
					КопироватьФайл(Файл.ПолноеИмя, КаталогСохранения + Файл.Имя);
				КонецЕсли;
			Исключение
				СообщитьОбОшибке(
					СтрШаблон("Ошибка сохранения отчета '%1' (%2) клиента %3 в каталог отправленных отчетов после выгрузки в ЭДО.",
						НастройкиОтчета.Отчет, НастройкиОтчета.Периодичность, НастройкиОтчета.СчетДоверительногоУправления),
					ИнформацияОбОшибке()); 
			КонецПопытки;

		КонецЕсли;
		
	КонецЕсли;			
	
КонецПроцедуры

Процедура ОбработатьРезультатыОтчетов(Организация, Отправитель, Получатели, ПакетРезультатовОтчетов, Оповещения = Неопределено, ОтложеннаяОтправка = Ложь) Экспорт
	
	Если ПакетРезультатовОтчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтправляемыеОтчеты = Новый Массив;
	
	СписокФайлов = Новый Массив;
	
	Для Каждого Результат Из ПакетРезультатовОтчетов Цикл
		
		Файл	= Неопределено;
		Отказ	= Неопределено;
		
		#Область ПроверкаНаличияОтчета
		// Проверка наличия сохраненного документа для регламентированных отчетов.
		Если Результат.НастройкиОтчета.ЭтоРегламентированныйОтчет
			И (НЕ Результат.Результат.Свойство("РегламентированныйОтчет") ИЛИ Результат.Результат.РегламентированныйОтчет = Неопределено) Тогда
			
			ТекстСообщения = СтрШаблон("Для клиента %1 отсутствует сохраненный отчет '%2' за период с %3 по %4!
										|Выгрузка, выгрузка в ЭДО и отправка почтой не произведены.",
										Результат.НастройкиОтчета.СчетДоверительногоУправления,
										Результат.НастройкиОтчета.Отчет,
										Формат(Результат.НастройкиОтчета.Период.ДатаНачала, "ДФ=dd.MM.yyyy"),
										Формат(Результат.НастройкиОтчета.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
							
			Если Оповещения = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ТемаПисьма = СтрШаблон("Отсутствует сохраненный отчет '%1' для клиента '%2' за период с %3 по %4. Организация: '%5'",
										Результат.НастройкиОтчета.Отчет,
										Результат.НастройкиОтчета.СчетДоверительногоУправления,
										Формат(Результат.НастройкиОтчета.Период.ДатаНачала, "ДФ=dd.MM.yyyy"),
										Формат(Результат.НастройкиОтчета.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"),
										Результат.НастройкиОтчета.Организация);
					
				РеквизитыОповещения = Новый Структура;
				РеквизитыОповещения.Вставить("Организация",	Результат.НастройкиОтчета.Организация);
				РеквизитыОповещения.Вставить("Тема",		ТемаПисьма);
				РеквизитыОповещения.Вставить("Текст",		ТекстСообщения);
				
				Оповещения.Добавить(РеквизитыОповещения);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		#КонецОбласти
		
		// Сохранение в файл.
		Если Отказ <> Истина Тогда 
			ВыгрузитьРезультатОтчета(Результат.НастройкиОтчета, Результат.Результат, Файл, Отказ);
		КонецЕсли;
		
		#Область ПроверкаСтатусаОтчета
		// Проверка статуса для регламентированных отчетов.
		Если Результат.НастройкиОтчета.ЭтоРегламентированныйОтчет
			И Результат.Результат.СтатусОтчета <> "Готов" И Результат.Результат.СтатусОтчета <> "Отправлен" Тогда
			
			ТекстСообщения = СтрШаблон("Для клиента %1 отсутствует готовый отчет '%2'за период с %3 по %4!
										|Выгрузка в ЭДО и отправка почтой не произведены.",
										Результат.НастройкиОтчета.СчетДоверительногоУправления,
										Результат.НастройкиОтчета.Отчет,
										Формат(Результат.НастройкиОтчета.Период.ДатаНачала,		"ДФ=dd.MM.yyyy"),
										Формат(Результат.НастройкиОтчета.Период.ДатаОкончания,	"ДФ=dd.MM.yyyy"));
			
			Если Оповещения = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ТемаПисьма = СтрШаблон("Отсутствует готовый к отправке почтой отчет '%1' для клиента '%2' за период с %3 по %4. Организация: '%5'",
										Результат.НастройкиОтчета.Отчет,
										Результат.НастройкиОтчета.СчетДоверительногоУправления,
										Формат(Результат.НастройкиОтчета.Период.ДатаНачала,		"ДФ=dd.MM.yyyy"),
										Формат(Результат.НастройкиОтчета.Период.ДатаОкончания,	"ДФ=dd.MM.yyyy"),
										Результат.НастройкиОтчета.Организация);
				
				РеквизитыОповещения = Новый Структура;
				РеквизитыОповещения.Вставить("Организация",	Результат.НастройкиОтчета.Организация);
				РеквизитыОповещения.Вставить("Тема",		ТемаПисьма);
				РеквизитыОповещения.Вставить("Текст",		ТекстСообщения);
				
				Оповещения.Добавить(РеквизитыОповещения);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		#КонецОбласти
		
		// Выгрузка в ЭДО.
		Если Отказ <> Истина Тогда 
			ВыгрузитьВЭДОРезультатОтчета(Результат.НастройкиОтчета, Результат.Результат, Файл, Отказ);
		КонецЕсли;
		
		// Отправка почтой.
		Если Отказ <> Истина Тогда
			
			// Проверяем необходимость отправки отчета. Если нужно, сохраняем файл.
			Если ТребуетсяОбработкаРезультатаОтчета(Результат.НастройкиОтчета, "ОтправкаПоПочте", Истина) Тогда
				
				#Если Сервер Тогда 
				Если СохранитьРезультатОтчета(Результат.НастройкиОтчета, Результат.Результат, Файл) Тогда
					Результат.НастройкиОтчета.Вставить("ФайлРезультатаОтчета",			Файл);
				   	Результат.НастройкиОтчета.Вставить("НеУдалятьФайлПослеОтправки",	Истина);
					
					Если Результат.НастройкиОтчета.Свойство("СохранятьФайлПриОтправке")
						И Результат.НастройкиОтчета.СохранятьФайлПриОтправке
						И Результат.НастройкиОтчета.Свойство("КаталогОтправленныхОтчетов") Тогда
						Результат.НастройкиОтчета.Вставить("КаталогСохранения", Результат.НастройкиОтчета.КаталогОтправленныхОтчетов);
					КонецЕсли;
				КонецЕсли;
				#КонецЕсли
				
				// Добавляем результат отчета в список к отправке.
				ОтправляемыеОтчеты.Добавить(Результат);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Запоминаем список созданных временных файлов для последующего удаления.
		Если Файл <> Неопределено Тогда
			СписокФайлов.Добавить(Файл);
		КонецЕсли;
		
	КонецЦикла;
	
	// Отправляем пакет отчетов (может состоять из одного отчета).
	Если ОтправляемыеОтчеты.Количество() > 0 Тогда
		
		Попытка
			РаботаСОтчетами.ОтправитьОтчеты(Организация, Отправитель, Получатели, ОтправляемыеОтчеты, ОтложеннаяОтправка);
		Исключение
			ТекстОшибки = СтрШаблон("При попытке отправить следующие отчеты по договору '%1' на электронную почту произошла ошибка:", Результат.НастройкиОтчета.СчетДоверительногоУправления);
			
			Для Каждого Отчет Из ОтправляемыеОтчеты Цикл
				ТекстОшибки = ТекстОшибки + Символы.ПС + "  -  " + Строка(Отчет.НастройкиОтчета.Отчет);
			КонецЦикла;
			
			СообщитьОбОшибке(ТекстОшибки, ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
	// Удаляем созданные временные файлы отчетов.
	Для Каждого Файл Из СписокФайлов Цикл
		
		Если СуществуетФайлРезультатаОтчета(Файл, Результат.Результат) Тогда
			Попытка
				УдалитьФайлы(Файл.ПолноеИмя);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

Функция ВывестиПакетОтображаемыхДокументовВТабличныйДокумент(Состав)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Для Каждого ЭлементСостава Из Состав Цикл
		
		ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
		
		ВременныйТабличныйДокумент.Область(1,1,1,1).Текст = ЭлементСостава.Наименование;
		
		ТабличныйДокумент.Вывести(ВременныйТабличныйДокумент.Область(1,1,1,1));
		
		Если ТипЗнч(ЭлементСостава.Данные) = Тип("Строка") Тогда
			ТабличныйДокумент.Вывести(ПолучитьИзВременногоХранилища(ЭлементСостава.Данные));
		Иначе
			ТабличныйДокумент.Вывести(ВывестиПакетОтображаемыхДокументовВТабличныйДокумент(ЭлементСостава.Состав));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура СообщитьОбОшибке(ТекстОшибки, ИнфоОбОшибке = Неопределено, Отказ = Неопределено)
	
	Если СистемныеФункции.ЭтоФоновоеЗадание() Тогда
		ОписаниеОшибки = ?(ИнфоОбОшибке = Неопределено, "", Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке));
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ТекстОшибки + ОписаниеОшибки, "Автоматическое формирование отчетности");
	Иначе
		ОписаниеОшибки = ?(ИнфоОбОшибке = Неопределено, "", Символы.ПС + КраткоеПредставлениеОшибки(ИнфоОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки + ОписаниеОшибки);
	КонецЕсли;
	
	Отказ = Истина;	
	
КонецПроцедуры

#КонецОбласти