
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// автоматическое дозаполнение полей
	НовДатаЗагрузки  = ТекущаяДата();
	НовОтветственный = РаботаСПользователями.ТекущийПользователь();
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.ДатаЗагрузки  = НовДатаЗагрузки;
		Запись.Ответственный = НовОтветственный;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("НеВыполнятьРасчетСводныхКотировок")
		Или (ЭтотОбъект.ДополнительныеСвойства.Свойство("НеВыполнятьРасчетСводныхКотировок") И ЭтотОбъект.ДополнительныеСвойства.НеВыполнятьРасчетСводныхКотировок <> Истина)
	Тогда
		РаботаСЦеннымиБумагами.РассчитатьСводныеКотировки("КотировкиТорговыхПлощадок", ЭтотОбъект.Отбор, Отказ);
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() > 0
		И ЭтотОбъект.ДополнительныеСвойства.Свойство("ВыполнитьПроверкуРасчетногоНКД")
		И ЭтотОбъект.ДополнительныеСвойства.ВыполнитьПроверкуРасчетногоНКД Тогда
		
		ОбработкаПроверкиНКД = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_ПроверкаРасчетногоНКД");
		
		ПараметрыЗадания = Новый Структура("ДатаНачала, ДатаОкончания", ЭтотОбъект.ДополнительныеСвойства.ДатаНачалаПроверкиРасчетногоНКД, ЭтотОбъект.ДополнительныеСвойства.ДатаОкончанияПроверкиРасчетногоНКД);
		
		Если ЭтотОбъект.Отбор.Найти("ЦеннаяБумага") <> Неопределено Тогда
			ПараметрыЗадания.Вставить("ЦеннаяБумага", ЭтотОбъект.Отбор.ЦеннаяБумага.Значение);
		КонецЕсли;
		
		Если ЭтотОбъект.Отбор.Найти("Биржа") <> Неопределено Тогда // биржа стоит - преверяем её
			
			ПараметрыЗадания.Вставить("Биржа", ЭтотОбъект.Отбор.Биржа.Значение);
			РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ОбработкаПроверкиНКД, "ПроверитьРасчетныйНКД", ПараметрыЗадания,,, ТекущаяДата() + 5 * 60);
			
		Иначе // биржа не стоит - проверим обе биржи: ММВБ и Блумберг
			
			ПараметрыЗадания.Вставить("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
			РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ОбработкаПроверкиНКД, "ПроверитьРасчетныйНКД", ПараметрыЗадания,,, ТекущаяДата() + 5 * 60);
			
			ПараметрыЗадания.Вставить("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("Bloomberg"));
			РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ОбработкаПроверкиНКД, "ПроверитьРасчетныйНКД", ПараметрыЗадания,,, ТекущаяДата() + 5 * 60);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
