
&НаСервере
Процедура ЗаполнитьТаблицуРегистровВКорректировкеНаСервере(Корректировка)
	
	Корректировка.ТаблицаРегистров.Очистить();
	
	Для каждого Элемент Из ЭтаФорма.РегистрыБухгалтерииВыбор Цикл
		Если Элемент.Пометка Тогда
			НоваяСтрокаТаблицаРегистров = Корректировка.ТаблицаРегистров.Добавить();
			НоваяСтрокаТаблицаРегистров.Имя = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Элемент Из ЭтаФорма.РегистрыНакопленияВыбор Цикл
		Если Элемент.Пометка Тогда
			НоваяСтрокаТаблицаРегистров = Корректировка.ТаблицаРегистров.Добавить();
			НоваяСтрокаТаблицаРегистров.Имя = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуРегистровВКорректировкеНаСервере

&НаСервере
Процедура ВыполнитьНаСервере()
	
	// найдем доп. свойство подходящих корректировок
	КлючСвойства = "Служебные.ОбнулениеОстатковНаУчетныхРегистрах";
	
	СвойствоКорректировки = ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", КлючСвойства);
	Если Не ЗначениеЗаполнено(СвойствоКорректировки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось найти свойство дополнительных сведений по ключу '" + КлючСвойства + "'");
		Возврат;
	КонецЕсли;
	
	// подберем подходящую корректировку
	ДатаКорректировки = КонецДня(Объект.Период);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРегистров.Ссылка
		|ИЗ
		|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО КорректировкаРегистров.Ссылка = ЗначенияДополнительныхСведений.Объект
		|			И ЗначенияДополнительныхСведений.Свойство = &Свойства
		|			И ЗначенияДополнительныхСведений.Значение = ИСТИНА
		|ГДЕ
		|	КорректировкаРегистров.Организация = &Организация
		|	И КорректировкаРегистров.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И КорректировкаРегистров.Дата = &Дата
		|	И НЕ КорректировкаРегистров.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Дата",                         ДатаКорректировки);
	Запрос.УстановитьПараметр("Период",                       ДатаКорректировки);
	Запрос.УстановитьПараметр("Свойства",                     СвойствоКорректировки);
	Запрос.УстановитьПараметр("ВидУчета",                     ЭтаФорма.ВидУчета);
		
	Корректировки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	НачатьТранзакцию();
	
	Если      Корректировки.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено более одной подходящей корректировки с обнулением учетных регистров. Необходимо оставить истинным свойство ""Обнуление остатков на учетных регистрах"" только у одного из них");
		Возврат;
		
	ИначеЕсли Корректировки.Количество() = 1 Тогда
		Корректировка = Корректировки[0];
		
		// очистим движения документа
		Для каждого РегистрМД Из Метаданные.Документы.КорректировкаРегистров.Движения Цикл
			Если      Найти(РегистрМД.ПолноеИмя(), "РегистрБухгалтерии.") = 1 Тогда
				НаборДвижений = РегистрыБухгалтерии[РегистрМД.Имя].СоздатьНаборЗаписей();
			ИначеЕсли Найти(РегистрМД.ПолноеИмя(), "РегистрНакопления.") = 1 Тогда
				НаборДвижений = РегистрыНакопления[РегистрМД.Имя].СоздатьНаборЗаписей();
			ИначеЕсли Найти(РегистрМД.ПолноеИмя(), "РегистрСведений.") = 1 Тогда
				НаборДвижений = РегистрыСведений[РегистрМД.Имя].СоздатьНаборЗаписей();
			КонецЕсли;
			
			НаборДвижений.Отбор.Регистратор.Установить(Корректировки);
			НаборДвижений.Прочитать();
			
			Если НаборДвижений.Количество() > 0 Тогда
				НаборДвижений.Записать();
			КонецЕсли;
		КонецЦикла;
		
		// перезаполним таблицу регистров
		Корректировка = Корректировка.ПолучитьОбъект();
		ЗаполнитьТаблицуРегистровВКорректировкеНаСервере(Корректировка);
		Корректировка.Записать(РежимЗаписиДокумента.Запись);
		
		Корректировка = Корректировка.Ссылка;
		
	Иначе
		// создадим документ
		Корректировка = Документы.КорректировкаРегистров.СоздатьДокумент();
		Корректировка.Организация                  = Объект.Организация;
		Корректировка.Дата                         = ДатаКорректировки;
		Корректировка.СчетДоверительногоУправления = Объект.СчетДоверительногоУправления;
		Корректировка.Ответственный                = РаботаСПользователями.ТекущийПользователь();
		Корректировка.Комментарий                  = "Обнуление учетных регистров (" + НРег(Элементы.ВариантЗаполнения.СписокВыбора[ЭтаФорма.ВариантЗаполнения - 1].Представление) + ?(ЭтаФорма.ВариантЗаполнения = 1, " " + ЭтаФорма.ВидУчета, "") + ")";
		
		ЗаполнитьТаблицуРегистровВКорректировкеНаСервере(Корректировка);
		
		Корректировка.Записать(РежимЗаписиДокумента.Запись);
		
		Корректировка = Корректировка.Ссылка;
		
		// заполним для него доп. свойство
		ДопСвойство = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
		ДопСвойство.Объект   = Корректировка;
		ДопСвойство.Свойство = СвойствоКорректировки;
		ДопСвойство.Значение = Истина;
		ДопСвойство.Записать();
		
	КонецЕсли;
	
	// регистры накопления просто сторнируем
	Для каждого Элемент Из ЭтаФорма.РегистрыНакопленияВыбор Цикл
		Если Элемент.Пометка Тогда
			РегистрМД = Метаданные.РегистрыНакопления[Элемент.Значение];
			
			ИзмеренияРегистра = "";
			Для каждого ПолеМД Из РегистрМД.Измерения Цикл
				ИзмеренияРегистра = ИзмеренияРегистра + ?(ПустаяСтрока(ИзмеренияРегистра), "", ", ") + ПолеМД.Имя;
			КонецЦикла;
			
			РесурсыРегистра = "";
			Для каждого ПолеМД Из РегистрМД.Ресурсы Цикл
				РесурсыРегистра = РесурсыРегистра + ?(ПустаяСтрока(РесурсыРегистра), "", ", ") + "-" + ПолеМД.Имя + "Остаток КАК " + ПолеМД.Имя;
			КонецЦикла;

			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&Период КАК Период,
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
				|	&ИзмеренияРегистра,
				|	&РесурсыРегистра
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
				|			&Период,
				|			Организация = &Организация
				|				И ВидУчета = &ВидУчета
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК Остатки";				
				
			Если ЭтаФорма.ВариантЗаполнения <> 1 Тогда // по виду учета
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидУчета = &ВидУчета", "");
			КонецЕсли;			
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИзмеренияРегистра", ИзмеренияРегистра);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РесурсыРегистра", РесурсыРегистра);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухПартииЦенныхБумаг", Элемент.Значение);
				
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			НаборДвижений = РегистрыНакопления[Элемент.Значение].СоздатьНаборЗаписей();
			НаборДвижений.Отбор.Регистратор.Установить(Корректировка);
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НаборДвижений.Загрузить(РезультатЗапроса.Выгрузить());
			КонецЦикла;
			
			НаборДвижений.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// проводки гоним через нулевой счет
	Для каждого Элемент Из ЭтаФорма.РегистрыБухгалтерииВыбор Цикл
		Если Элемент.Пометка Тогда
			РегистрМД = Метаданные.РегистрыБухгалтерии[Элемент.Значение];
			
			ИзмеренияРегистра = "";
			Для каждого ПолеМД Из РегистрМД.Измерения Цикл
				ИзмеренияРегистра = ИзмеренияРегистра + ?(ПустаяСтрока(ИзмеренияРегистра), "", ", ") + ПолеМД.Имя;
			КонецЦикла;
			
			ИзмеренияРегистра = ИзмеренияРегистра + ", Счет";
			
			Для Инд = 1 По РегистрМД.ПланСчетов.МаксКоличествоСубконто Цикл
				ИзмеренияРегистра = ИзмеренияРегистра + ", Субконто" + Инд;
			КонецЦикла;
			
			РесурсыБалансовые = Новый Массив;
			
			РесурсыРегистраДт = "";
			РесурсыРегистраКт = "";
			
			ОтборДт = "";
			ОтборКт = "";
			
			Для каждого ПолеМД Из РегистрМД.Ресурсы Цикл
				РесурсыРегистраДт = РесурсыРегистраДт + ?(ПустаяСтрока(РесурсыРегистраДт), "", ", ") + "-" + ПолеМД.Имя + "ОстатокДт КАК " + ПолеМД.Имя;
				ОтборДт = ОтборДт + ?(ПустаяСтрока(ОтборДт), "", " ИЛИ ") + ПолеМД.Имя + "ОстатокДт <> 0";
				
				РесурсыРегистраКт = РесурсыРегистраКт + ?(ПустаяСтрока(РесурсыРегистраКт), "", ", ") + "-" + ПолеМД.Имя + "ОстатокКт КАК " + ПолеМД.Имя;
				ОтборКт = ОтборКт + ?(ПустаяСтрока(ОтборКт), "", " ИЛИ ") + ПолеМД.Имя + "ОстатокКт <> 0";
			КонецЦикла;

			Если      РегистрМД.ПланСчетов = Метаданные.ПланыСчетов.Основной Тогда
				НулевойСчет = ПланыСчетов.Основной.Вспомогательный;
			ИначеЕсли РегистрМД.ПланСчетов = Метаданные.ПланыСчетов.Единый Тогда
				НулевойСчет = ПланыСчетов.Единый.Вспомогательный;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("НулевойСчет", НулевойСчет);
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	""Дт"" КАК ДтКт,
				|	&Период КАК Период,
				|	&ИзмеренияРегистра,
				|	&РесурсыРегистраДт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&Период,
				|			Счет <> &НулевойСчет,
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК Остатки
				|ГДЕ
				|	&ОтборДт
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	""Кт"",
				|	&Период,
				|	&ИзмеренияРегистра,
				|	&РесурсыРегистраКт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&Период,
				|			Счет <> &НулевойСчет,
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК Остатки
				|ГДЕ
				|	&ОтборКт";
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИзмеренияРегистра", ИзмеренияРегистра);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РесурсыРегистраДт", РесурсыРегистраДт);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РесурсыРегистраКт", РесурсыРегистраКт);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборДт", ОтборДт);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборКт", ОтборКт);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", Элемент.Значение);
				
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			НаборПроводок = РегистрыБухгалтерии[Элемент.Значение].СоздатьНаборЗаписей();
			НаборПроводок.Отбор.Регистратор.Установить(Корректировка);
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Проводка = НаборПроводок.Добавить();
				
				Проводка.Период = Выборка.Период;
								
				Если      Выборка.ДтКт = "Дт" Тогда
					Проводка.СчетДт = Выборка.Счет;
					Проводка.СчетКт = НулевойСчет;
					
				ИначеЕсли Выборка.ДтКт = "Кт" Тогда
					Проводка.СчетДт = НулевойСчет;
					Проводка.СчетКт = Выборка.Счет;
					
				КонецЕсли;
				
				Для каждого ПолеМД Из РегистрМД.Измерения Цикл
					Если ПолеМД.Балансовый Тогда
						Проводка[ПолеМД.Имя] = Выборка[ПолеМД.Имя];
					Иначе
						Проводка[ПолеМД.Имя + Выборка.ДтКт] = Выборка[ПолеМД.Имя];
					КонецЕсли;
				КонецЦикла;
				
				Для каждого ПолеМД Из РегистрМД.Ресурсы Цикл
					Если ПолеМД.Балансовый Тогда
						Проводка[ПолеМД.Имя] = Выборка[ПолеМД.Имя];
					Иначе
						Проводка[ПолеМД.Имя + Выборка.ДтКт] = Выборка[ПолеМД.Имя];
					КонецЕсли;
				КонецЦикла;
				
				НомСубконто = 1;
				Для каждого СтрокаВидыСубконто Из Выборка.Счет.ВидыСубконто Цикл
					Проводка["Субконто" + Выборка.ДтКт][СтрокаВидыСубконто.ВидСубконто] = Выборка["Субконто" + НомСубконто];
					НомСубконто = НомСубконто + 1;
				КонецЦикла;
	
			КонецЦикла;
			
			НаборПроводок.Записать();
		КонецЕсли;	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнуление зафиксировано в документе '" + Корректировка + "'", Корректировка);
	
КонецПроцедуры // ВыполнитьНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Для каждого РегистрМД Из Метаданные.РегистрыБухгалтерии Цикл
		ЭтаФорма.РегистрыБухгалтерииВыбор.Добавить(РегистрМД.Имя, РегистрМД.Представление());
	КонецЦикла;
	
	Для каждого РегистрМД Из Метаданные.РегистрыНакопления Цикл
		ЭтаФорма.РегистрыНакопленияВыбор.Добавить(РегистрМД.Имя, РегистрМД.Представление());
	КонецЦикла;
	
	Объект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.НайтиПоРеквизиту("КодСчета", "DU-RPI/PR/2_0"); // НПФ НЕФТЕГАРАНТ

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВариантЗаполненияПриИзменении(Неопределено);
	
	Если ЭтаФорма.ВидУчета = 1 Тогда // по виду учета
		ВидУчетаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗаполненияПриИзменении(Элемент)
	
	Если      ЭтаФорма.ВариантЗаполнения = 1 Тогда // по виду учета
		Элементы.РегистрыБухгалтерииВыбор.ТолькоПросмотр = Истина;
		Элементы.РегистрыНакопленияВыбор.ТолькоПросмотр  = Истина;
		
		Элементы.ВидУчета.Видимость = Истина;
		
		Для каждого Элемент Из ЭтаФорма.РегистрыНакопленияВыбор Цикл
			Элемент.Пометка = (Элемент.Значение = "БухПартииЦенныхБумаг");
		КонецЦикла;
		
		Для каждого Элемент Из ЭтаФорма.РегистрыБухгалтерииВыбор Цикл
			Элемент.Пометка = (ЗначениеЗаполнено(ЭтаФорма.ВидУчета) И Элемент.Значение = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтаФорма.ВидУчета));
		КонецЦикла;
		
	ИначеЕсли ЭтаФорма.ВариантЗаполнения = 0 Тогда // ручной ввод
		Элементы.РегистрыБухгалтерииВыбор.ТолькоПросмотр = Ложь;
		Элементы.РегистрыНакопленияВыбор.ТолькоПросмотр  = Ложь;
		
		Элементы.ВидУчета.Видимость = Ложь;
		
		ЭтаФорма.ВидУчета = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУчетаПриИзменении(Элемент)
	
	Для каждого Элемент Из ЭтаФорма.РегистрыБухгалтерииВыбор Цикл
		Элемент.Пометка = (ЗначениеЗаполнено(ЭтаФорма.ВидУчета) И Элемент.Значение = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтаФорма.ВидУчета));
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура КомандаВыполнить(Команда)

	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВыполнить");
	Попытка
		ВыполнитьКомандаВыполнить(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаВыполнить(ПараметрыСессии)
	
	// проверим, что выбран хотя бы одни регистр
	ЕстьВыбранныйРегистр = Ложь;
	
	Для каждого Элемент Из ЭтаФорма.РегистрыБухгалтерииВыбор Цикл
		Если Элемент.Пометка Тогда
			ЕстьВыбранныйРегистр = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьВыбранныйРегистр Тогда
		Для каждого Элемент Из ЭтаФорма.РегистрыНакопленияВыбор Цикл
			Если Элемент.Пометка Тогда
				ЕстьВыбранныйРегистр = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЕстьВыбранныйРегистр Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбранны регистры для обнуления");
		ПараметрыСессии.ТекстОшибки = "Не выбранны регистры для обнуления";
		Возврат;
	КонецЕсли;
	
	// проверим заполнение "связанных" полей
	Если ЭтаФорма.ВариантЗаполнения = 1 Тогда // по виду учета
		Если Не ЗначениеЗаполнено(ЭтаФорма.ВидУчета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Вид учета""", Объект, "ВидУчета");
			ПараметрыСессии.ТекстОшибки = "Не заполнено поле ""Вид учета""";
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ВыполнитьНаСервере();
	Иначе
		ПараметрыСессии.ТекстОшибки = "Проверка заполнения не прошла.";
	КонецЕсли;
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");

	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);

	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);

	Возврат ПараметрыСессии;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);

КонецПроцедуры

#КонецОбласти

