Функция НужнаПерекурсовка(Дата, Организация, СчетДоверительногоУправления, ВидУчета) Экспорт  
	
	ДатаПереоценки = НачалоДня(Дата);
	
	// #404987 - хардкод для Большого: задолженность по погашению (тела или купона) на 500х счетах нужно перекурсовать ЕЖЕДНЕВНО
	Если ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата);
		Если КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Большой") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЕдиныйБухгалтерскийУчетОстатки.Организация КАК Организация,
				|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
				|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
				|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток
				|ИЗ
				|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
				|			&Период,
				|			Счет.Родитель В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения)),
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
				|			СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела))
				|				И Валюта <> &ВалютаУчета) КАК ЕдиныйБухгалтерскийУчетОстатки";
			
			Запрос.УстановитьПараметр("ВалютаУчета", Организация.ВалютаУчета);
			Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
			
			Если НЕ Запрос.Выполнить().Пустой() Тогда
			
				Возврат Истина;
			
			КонецЕсли;
	
		КонецЕсли;
		
	КонецЕсли;
	// #404987
	
	ПериодичностиДатыПереоценки = БухгалтерскийУчетЕПС.ПолучитьПериодичностиДаты(ДатаПереоценки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиПоВидуУчетаСрезПоследних.ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств КАК ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств,
		|	НастройкиПоВидуУчетаСрезПоследних.ПерекурсовыватьВНерабочиеДни КАК ПерекурсовыватьВНерабочиеДни
		|ИЗ
		|	РегистрСведений.НастройкиПоВидуУчета.СрезПоследних(
		|			&НаДату,
		|			Организация = &Организация
		|				И ВидУчета = &ВидУчета
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиПоВидуУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидУчета", ВидУчета);
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПериодичностьПерекурсовки = Неопределено;
	ПерекурсовыватьВНерабочиеДни = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПериодичностьПерекурсовки = ВыборкаДетальныеЗаписи.ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств;
		ПерекурсовыватьВНерабочиеДни = ВыборкаДетальныеЗаписи.ПерекурсовыватьВНерабочиеДни;
	КонецЦикла;
	
	ПоследняяРабочаяДата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский,НачалоДня(ДатаПереоценки));
	
	Если ПериодичностьПерекурсовки = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
		Возврат Ложь;
	ИначеЕсли ПериодичностьПерекурсовки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно И ПериодичностиДатыПереоценки.ПериодичностьДень Тогда
		Если ПоследняяРабочаяДата <> ДатаПереоценки Тогда
			//	конец месяца это конец учетного периода
			//	и в конце месяца всегда нужно делать переоценку, независимо от настроек
			//	это было сделано для ЦБ и задолженностей 
			//	теперь сделал для перекурсовок
			//	#545840 - для ЕПС
			//	#546034 - для БУ/НУ
			Если ПериодичностиДатыПереоценки.ПериодичностьМесяц И ДатаПереоценки >= '20240601' Тогда
				Возврат Истина;
			Иначе
				Возврат ПерекурсовыватьВНерабочиеДни;
			КонецЕсли;
		Иначе
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПерекурсовки, ДатаПереоценки) Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция НужнаПерекурсовкаДрагоценныеМеталлы(Дата, Организация, СчетДоверительногоУправления, ВидУчета) Экспорт
	
	ПериодичностьПереоценки 	= БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДрагоценныеМеталлы, ВидУчета, "ПериодичностьПереоценки");
	ПереоцениватьВНерабочиеДни 	= БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДрагоценныеМеталлы, ВидУчета, "ПереоцениватьВНерабочиеДни");
	ПереоцениватьВДеньОперации 	= БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДрагоценныеМеталлы, ВидУчета, "ПереоцениватьВДеньОперации");
	
	КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, Дата);
	РабочийДень			= Справочники.Календари.ЭтоРабочийДень(КалендарьДляСчетаДУ, Дата);
	
	Перекурсовывать = Ложь;
	
	Если Не Перекурсовывать И ЗначениеЗаполнено(ПериодичностьПереоценки)
		И ПериодичностьПереоценки <> Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
	
		Если ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
			Если РабочийДень Тогда
				Перекурсовывать = Истина;
			ИначеЕсли ПереоцениватьВНерабочиеДни Тогда
				Перекурсовывать = Истина;
			КонецЕсли;
		Иначе
			Переоценивать = БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, Дата, КалендарьДляСчетаДУ);
		КонецЕсли;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Сделка
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Граница,
		|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоЦеннымБумагамОстатки";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Перекурсовывать = Не Запрос.Выполнить().Пустой();
	
	Возврат Перекурсовывать;
	
КонецФункции	