#Область ПрограммныйИнтерфейс

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Оповещение об истечении срока ген. соглашения по депозитам",
		"0.02",
		"Рассылка об истечении срока генерального соглашения по депозитам через справочник Оповещения. Источник: ВнешняяОбработка._ОповещениеОбИстеченииСрокаГенСоглашенияПоДепозитам, тип события: ВнешнийВызов. В теме и тексте оповещения подставляются [Тема] и [Текст]. Параметр команды: Организация. Расписание регламентного задания: ежедневно в 12:00.",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеОбИстеченииСрокаГенСоглашенияПоДепозитам", "Оповещение об истечении срока ген. соглашения по депозитам",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	Период		= НачалоДня(ТекущаяДата()); 
	Организация	= ПараметрыКоманды.Организация;
	
	Если Найти(ИдентификаторКоманды, "ОповещениеОбИстеченииСрокаГенСоглашенияПоДепозитам") = 1  Тогда
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		СформироватьИОтправитьОповещение(ПараметрыСессии);
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

Процедура СформироватьИОтправитьОповещение(ПараметрыСессии = Неопределено) Экспорт
	
	Оповещение = СформироватьОповещение();
	
	Если Оповещение <> Неопределено Тогда
		ОтправитьОповещение(Оповещение, ПараметрыСессии);
	КонецЕсли;
	
	ОповеститьОбОшибках();
	
КонецПроцедуры

Функция СформироватьОповещение() Экспорт
	
	Макет = ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Период",			НачалоДня(Период));
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый ТабличныйДокумент;
	
	Заголовок	= Макет.ПолучитьОбласть("Заголовок");
	Строка		= Макет.ПолучитьОбласть("Строка");
	Подвал		= Макет.ПолучитьОбласть("Подвал");
	
	Результат.Вывести(Заголовок);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка.Параметры.Заполнить(Выборка);
		Результат.Вывести(Строка);
	КонецЦикла;
	
	Результат.Вывести(Подвал);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Процедура ЗарегистрироватьОшибку(ТекстОшибки, ПараметрыСессии = Неопределено)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

Процедура ОтправитьОповещение(Содержание, ПараметрыСессии = Неопределено)
	
	Если Содержание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
	
	Попытка
		Содержание.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		УдалитьФайлы(ИмяВременногоФайла);
		
		РеквизитыОповещения = Новый Структура;
		РеквизитыОповещения.Вставить("Организация", Организация);
		РеквизитыОповещения.Вставить("Тема", "ВАЖНО! Заканчивается срок действия генерального соглашения по депозитам");
		РеквизитыОповещения.Вставить("Текст", ТелоПисьма.ПолучитьТекст());
		
		Справочники.Оповещения.СформироватьОповещения(
			"ВнешняяОбработка._ОповещениеОбИстеченииСрокаГенСоглашенияПоДепозитам",
			Перечисления.ТипыСобытий.ВнешнийВызов,
			РеквизитыОповещения);
	Исключение
		ТекстОшибки = "Не удалось отправить оповещение:" + Символы.ПС + ОписаниеОшибки();
		ЗарегистрироватьОшибку(ТекстОшибки, ПараметрыСессии);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	
	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СДУ,
		|	СчетаДоверительногоУправления.Представление КАК ПредставлениеСДУ,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
		|	Договоры.Ссылка КАК ГенСоглашение,
		|	Договоры.НомерДоговора КАК НомерГенСоглашения,
		|	Договоры.Контрагент КАК Банк,
		|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения КАК ДатаРасторжения,
		|	РАЗНОСТЬДАТ(&Период, УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДЕНЬ) КАК ОсталосьДней
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО Договоры.Ссылка = УсловияДоговоровОбщиеСрезПоследних.Договор
		|			И Договоры.Организация = УсловияДоговоровОбщиеСрезПоследних.Организация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних
		|		ПО Договоры.Ссылка = ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)
		|	И НЕ Договоры.ПометкаУдаления
		|	И Договоры.Организация = &Организация
		|	И УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДоговорыСчетовДоверительногоУправленияСрезПоследних.Активный
		|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &Период)
		|	И (НАЧАЛОПЕРИОДА(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, 1), ДЕНЬ)
		|			ИЛИ РАЗНОСТЬДАТ(&Период, УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДЕНЬ) = 14
		|			ИЛИ РАЗНОСТЬДАТ(&Период, УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДЕНЬ) = 7)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаРасторжения,
		|	СчетаДоверительногоУправления.Наименование";
	
КонецФункции

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки) Экспорт
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(ЭтотОбъект, ИмяКоманды);
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
КонецПроцедуры

#КонецОбласти

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
