&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьИДоступность()
	
	ЭтаФорма.Элементы.ЦеннаяБумага.Доступность = ЗначениеЗаполнено(Объект.СчетДоверительногоУправления);
	ЭтаФорма.Элементы.ГруппаСтраницы.Доступность = ЗначениеЗаполнено(Объект.ЦеннаяБумага);
	
	ЭтаФорма.Элементы.ПартииПереоценка.Видимость = ЭтаФорма.ОтображатьПереоценку;
	ЭтаФорма.Элементы.ПартииБалансоваяПереоценка.Видимость = ЭтаФорма.ОтображатьБалансовуюПереоценку;
	
	ЭтаФорма.Элементы.ПартииКорректировкаЭСП.Видимость = ЭтаФорма.ОтображатьКорректировкуЭСП И Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.ПартииБалансоваяКорректировкаЭСП.Видимость = ЭтаФорма.ОтображатьБалансовуюКорректировкуЭСП;
	
	ЭтаФорма.Элементы.ПартииРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.ПартииСуммаРезервовПодОбесценение.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	
	ЭтаФорма.Элементы.Партии1КорректировкаЭСПВВалютеУчета.Видимость = ЭтаФорма.ОтображатьКорректировкуЭСП И Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.Партии1БалансоваяКорректировкаЭСПВВалютеУчета.Видимость = ЭтаФорма.ОтображатьБалансовуюКорректировкуЭСП;
	ЭтаФорма.Элементы.Партии1РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.Партии1СуммаРезервовПодОбесценение.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	
	ЭтаФорма.Элементы.Партии1ПереоценкаВВалютеУчета.Видимость = ЭтаФорма.ОтображатьПереоценку;
	ЭтаФорма.Элементы.Партии1БалансоваяПереоценкаВВалютеУчета.Видимость = ЭтаФорма.ОтображатьБалансовуюПереоценку;
	
	ЭтаФорма.Элементы.Партии3ГруппаДооценка.Видимость = ЭтаФорма.ОтображатьБалансовуюПереоценку И Объект.Переоценивать;
	ЭтаФорма.Элементы.Партии3ГруппаДоначислениеДисконтаПремии.Видимость = Объект.НачислятьПроцентныеПоказатели;
	ЭтаФорма.Элементы.Партии3ГруппаДоначислениеКорректировкаЭСП.Видимость = ЭтаФорма.ОтображатьБалансовуюКорректировкуЭСП И Объект.НачислятьПроцентныеПоказатели;
	ЭтаФорма.Элементы.Партии3ГруппаДоначислениеРазницаПП.Видимость = Объект.НачислятьПроцентныеПоказатели;
	
	ЭтаФорма.Элементы.Переоценивать.Видимость = ЭтаФорма.ОтображатьБалансовуюПереоценку;
	ЭтаФорма.Элементы.ГруппаЦена.Видимость = Объект.Переоценивать;
	
КонецПроцедуры

&НаСервере
Функция ЭтоПереоцениваемыйВидАктива(УчетныйАктивЕПС, РасчетЦены = Ложь)
	
	Если УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
		Возврат Ложь;	
	ИначеЕсли УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
		ПроверяемыйАктив = УчетныйАктивЕПС;
	Иначе
		ПроверяемыйАктив = УчетныйАктивЕПС.Родитель;
	КонецЕсли;
	
	Если ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток
		ИЛИ ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи
		ИЛИ ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой 
		ИЛИ ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи 
		Или (Объект.КорректировкаЭСПРазницаППРезервВПереоценку И Не РасчетЦены) Тогда
	
		Возврат Истина;	
	
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЭтоКорректируемыйВидАктива(УчетныйАктивЕПС)
	
	Если УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
		Возврат Ложь;	
	ИначеЕсли УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
		ПроверяемыйАктив = УчетныйАктивЕПС;
	Иначе
		ПроверяемыйАктив = УчетныйАктивЕПС.Родитель;
	КонецЕсли;
	
	Если ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи
		ИЛИ ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД
		ИЛИ ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения Тогда
	
		Возврат Истина;	
		
	ИначеЕсли ПроверяемыйАктив = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток Тогда
		
		ВариантУчетаКупонногоДохода = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВариантУчетаКупонногоДохода");
		Если ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке Или Объект.Дата >= Дата(2024, 1, 1) Тогда
		
			Возврат Истина;	
		
		КонецЕсли;
		
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЦеннаяБумагаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.Облигации") И ТипЗнч(ВыбранноеЗначение) <> Тип("Тип") Тогда
	
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реклассификация активов реализована только для облигаций");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Объект.ЦеннаяБумага = ПредопределенноеЗначение("Справочник.Облигации.ПустаяСсылка");
	ЦеннаяБумагаПриИзменении(Неопределено);
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПартии()

	БалансовыеПартии = ПолучитьПартии();
	Объект.Партии.Загрузить(БалансовыеПартии);

	ЭтаФорма.СтарыйКласс = Справочники.УчетныеАктивыЕПС.ПустаяСсылка();
	Если БалансовыеПартии.Количество() > 0 Тогда
		ЭтаФорма.СтарыйКласс = БалансовыеПартии[0].УчетныйАктивЕПС.Родитель;
	КонецЕсли;
	
	Для каждого СтрокаПартии Из Объект.Партии Цикл
		
		СтрокаПартии.Стоимость = СтрокаПартии.БалансоваяСтоимость;
		СтрокаПартии.СтоимостьВВалютеУчета = СтрокаПартии.БалансоваяСтоимостьВВалютеУчета;
		
		СтрокаПартии.ДисконтПремияНачисленный = СтрокаПартии.БалансоваяДисконтПремияНачисленный;
		СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета = СтрокаПартии.БалансоваяДисконтПремияНачисленныйВВалютеУчета;
		
		Если Объект.БезДооценкиКупона Тогда
			СтрокаПартии.ДооценкаКупона = 0;
			СтрокаПартии.ДооценкаКупонаВВалютеУчета = 0;
		Иначе
			ЦенаКупона = Справочники.Облигации.ПолучитьКупон(Объект.ЦеннаяБумага, НачалоДня(Объект.Дата), Объект.СчетДоверительногоУправления);
			СтоимостьКупона = ЦенаКупона * СтрокаПартии.Количество;
			СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьКупона, Объект.ЦеннаяБумага.ВалютаНоминала, Объект.Организация, Объект.Дата);
			
			СтрокаПартии.ДооценкаКупона = СтоимостьКупона - СтрокаПартии.СтоимостьКупона - СтрокаПартии.ПереоценкаКупона;
			СтрокаПартии.ДооценкаКупонаВВалютеУчета = СтоимостьКупонаВВалютеУчета - СтрокаПартии.СтоимостьКупонаВВалютеУчета - СтрокаПартии.ПереоценкаКупонаВВалютеУчета;
		КонецЕсли;	
		
		СтрокаПартии.ПереоценкаКупона = СтрокаПартии.ПереоценкаКупона + СтрокаПартии.ДооценкаКупона;
		СтрокаПартии.ПереоценкаКупонаВВалютеУчета = СтрокаПартии.ПереоценкаКупонаВВалютеУчета + СтрокаПартии.ДооценкаКупонаВВалютеУчета;
				
		ПересчитатьСтоимость(СтрокаПартии);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент) Экспорт
	
	Если Объект.УчетныйАктивЕПС = ПредопределенноеЗначение("Справочник.УчетныеАктивыЕПС.ПустаяСсылка") Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран новый класс!",, "УчетныйАктивЕПС", "УчетныйАктивЕПС");
		Возврат;
	
	КонецЕсли;
	
	Объект.Переоценивать = Ложь;
	Объект.НачислятьПроцентныеПоказатели = Ложь;
	
	ЭтаФорма.ОтображатьПереоценку = Ложь;
	ЭтаФорма.ОтображатьКорректировкуЭСП = Ложь;
	
	ЦеннаяБумагаПриИзмененииСервер();
	
	ПересчитатьИтоговыеПоля();
	
	УчетныйАктивЕПСПриИзменении(Элемент);
	
	Если Элемент <> Неопределено Тогда
		НастроитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЦеннаяБумагаПриИзмененииСервер()
	
	ЗаполнитьПартии();
	
	ЭтаФорма.ОтображатьБалансовуюПереоценку = ЭтоПереоцениваемыйВидАктива(ЭтаФорма.СтарыйКласс) Или ЭтоПереоцениваемыйВидАктива(Объект.УчетныйАктивЕПС);
	ЭтаФорма.ОтображатьБалансовуюКорректировкуЭСП = ЭтоКорректируемыйВидАктива(ЭтаФорма.СтарыйКласс);
	ЭтаФорма.ОтображатьПереоценку = ЭтоПереоцениваемыйВидАктива(Объект.УчетныйАктивЕПС);
	
КонецПроцедуры


&НаКлиенте
Процедура УчетныйАктивЕПСПриИзменении(Элемент)
	
	ЭтаФорма.ОтображатьПереоценку = ЭтоПереоцениваемыйВидАктива(Объект.УчетныйАктивЕПС);
	ЭтаФорма.ОтображатьКорректировкуЭСП = ЭтоКорректируемыйВидАктива(Объект.УчетныйАктивЕПС);
	
	Если НЕ ЭтаФорма.ОтображатьПереоценку ИЛИ НЕ ЭтаФорма.ОтображатьКорректировкуЭСП Тогда
		
		Для каждого СтрокаПартии Из Объект.Партии Цикл
			
			Если НЕ ЭтаФорма.ОтображатьКорректировкуЭСП И Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
				СтрокаПартии.Переоценка = 0;
				СтрокаПартии.ПереоценкаВВалютеУчета = 0;
			КонецЕсли;	
			
			Если НЕ ЭтаФорма.ОтображатьКорректировкуЭСП И Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
				СтрокаПартии.КорректировкаЭСП = 0;
				СтрокаПартии.КорректировкаЭСПВВалютеУчета = 0;
			КонецЕсли;	
			
			ПересчитатьСтоимость(СтрокаПартии);
			
		КонецЦикла;
	
	КонецЕсли;
	
	Если Объект.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
		БалансовыеПоказателиВТекущие(Неопределено);
		КорректировкаЭСПРазницаППРезервВПереоценку(Неопределено);
	КонецЕсли;	
	
	ПересчитатьИтоговыеПоля();
	
	Если Элемент <> Неопределено Тогда
		НастроитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчитатьИтоговыеПоля();
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоговыеПоля()
	
	ЭтаФорма.ИтогБалансоваяДисконтПремияНачисленный = 0;
	ЭтаФорма.ИтогБалансоваяДисконтПремияНачисленныйВВалютеУчета = 0;
	ЭтаФорма.ИтогБалансоваяКорректировкаЭСП = 0;
	ЭтаФорма.ИтогБалансоваяКорректировкаЭСПВВалютеУчета = 0;
	ЭтаФорма.ИтогБалансоваяПереоценка = 0;
	ЭтаФорма.ИтогБалансоваяПереоценкаВВалютеУчета = 0;
	ЭтаФорма.ИтогБалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0;
	ЭтаФорма.ИтогБалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = 0;
	ЭтаФорма.ИтогБалансоваяСтоимость = 0;
	ЭтаФорма.ИтогБалансоваяСтоимостьВВалютеУчета = 0;
	ЭтаФорма.ИтогБалансоваяСуммаРезервовПодОбесценение = 0;
	ЭтаФорма.ИтогНоваяСтоимость = 0;
	ЭтаФорма.ИтогНоваяСтоимостьВВалютеУчета = 0;
	ЭтаФорма.ИтогПереоценкаКупона = 0;
	ЭтаФорма.ИтогПереоценкаКупонаВВалютеУчета = 0;
	ЭтаФорма.ИтогПогашениеКупонаНеИсполненноеВСрок = 0;
	ЭтаФорма.ИтогПогашениеКупонаНеИсполненноеВСрокВВалютеУчета = 0;
	ЭтаФорма.ИтогСтараяСтоимость = 0;
	ЭтаФорма.ИтогСтараяСтоимостьВВалютеУчета = 0;
	ЭтаФорма.ИтогСтоимостьКупона = 0;
	ЭтаФорма.ИтогСтоимостьКупонаВВалютеУчета = 0;
	
	Для каждого СтрокаПартии Из Объект.Партии Цикл
		
		ЭтаФорма.ИтогБалансоваяДисконтПремияНачисленный = ЭтаФорма.ИтогБалансоваяДисконтПремияНачисленный + СтрокаПартии.БалансоваяДисконтПремияНачисленный;
		ЭтаФорма.ИтогБалансоваяДисконтПремияНачисленныйВВалютеУчета = ЭтаФорма.ИтогБалансоваяДисконтПремияНачисленныйВВалютеУчета + СтрокаПартии.БалансоваяДисконтПремияНачисленныйВВалютеУчета;
		ЭтаФорма.ИтогБалансоваяКорректировкаЭСП = ЭтаФорма.ИтогБалансоваяКорректировкаЭСП + СтрокаПартии.БалансоваяКорректировкаЭСП;
		ЭтаФорма.ИтогБалансоваяКорректировкаЭСПВВалютеУчета = ЭтаФорма.ИтогБалансоваяКорректировкаЭСПВВалютеУчета + СтрокаПартии.БалансоваяКорректировкаЭСПВВалютеУчета;
		ЭтаФорма.ИтогБалансоваяПереоценка = ЭтаФорма.ИтогБалансоваяПереоценка + СтрокаПартии.БалансоваяПереоценка;
		ЭтаФорма.ИтогБалансоваяПереоценкаВВалютеУчета = ЭтаФорма.ИтогБалансоваяПереоценкаВВалютеУчета + СтрокаПартии.БалансоваяПереоценкаВВалютеУчета;
		ЭтаФорма.ИтогБалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = ЭтаФорма.ИтогБалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные + СтрокаПартии.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		ЭтаФорма.ИтогБалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = ЭтаФорма.ИтогБалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + СтрокаПартии.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
		ЭтаФорма.ИтогБалансоваяСтоимость = ЭтаФорма.ИтогБалансоваяСтоимость + СтрокаПартии.БалансоваяСтоимость;
		ЭтаФорма.ИтогБалансоваяСтоимостьВВалютеУчета = ЭтаФорма.ИтогБалансоваяСтоимостьВВалютеУчета + СтрокаПартии.БалансоваяСтоимостьВВалютеУчета;
		ЭтаФорма.ИтогБалансоваяСуммаРезервовПодОбесценение = ЭтаФорма.ИтогБалансоваяСуммаРезервовПодОбесценение + СтрокаПартии.БалансоваяСуммаРезервовПодОбесценение;
		ЭтаФорма.ИтогНоваяСтоимость = ЭтаФорма.ИтогНоваяСтоимость + СтрокаПартии.НоваяСтоимость;
		ЭтаФорма.ИтогНоваяСтоимостьВВалютеУчета = ЭтаФорма.ИтогНоваяСтоимостьВВалютеУчета + СтрокаПартии.НоваяСтоимостьВВалютеУчета;
		ЭтаФорма.ИтогПереоценкаКупона = ЭтаФорма.ИтогПереоценкаКупона + СтрокаПартии.ПереоценкаКупона;
		ЭтаФорма.ИтогПереоценкаКупонаВВалютеУчета = ЭтаФорма.ИтогПереоценкаКупонаВВалютеУчета + СтрокаПартии.ПереоценкаКупонаВВалютеУчета;
		ЭтаФорма.ИтогПогашениеКупонаНеИсполненноеВСрок = ЭтаФорма.ИтогПогашениеКупонаНеИсполненноеВСрок + СтрокаПартии.ПогашениеКупонаНеИсполненноеВСрок;
		ЭтаФорма.ИтогПогашениеКупонаНеИсполненноеВСрокВВалютеУчета = ЭтаФорма.ИтогПогашениеКупонаНеИсполненноеВСрокВВалютеУчета + СтрокаПартии.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета;
		ЭтаФорма.ИтогСтараяСтоимость = ЭтаФорма.ИтогСтараяСтоимость + СтрокаПартии.СтараяСтоимость;
		ЭтаФорма.ИтогСтараяСтоимостьВВалютеУчета = ЭтаФорма.ИтогСтараяСтоимостьВВалютеУчета + СтрокаПартии.СтараяСтоимостьВВалютеУчета;
		ЭтаФорма.ИтогСтоимостьКупона = ЭтаФорма.ИтогСтоимостьКупона + СтрокаПартии.СтоимостьКупона;
		ЭтаФорма.ИтогСтоимостьКупонаВВалютеУчета = ЭтаФорма.ИтогСтоимостьКупонаВВалютеУчета + СтрокаПартии.СтоимостьКупонаВВалютеУчета;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПартии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК БалансоваяСтоимость,
		|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК БалансоваяСтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК БалансоваяПереоценка,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток КАК БалансоваяПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток КАК ДисконтПремия,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК БалансоваяДисконтПремияНачисленный,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК БалансоваяДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК БалансоваяКорректировкаЭСП,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток КАК БалансоваяКорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальнаяОстаток КАК БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК БалансоваяСуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПогашениеКупонаНеИсполненноеВСрокОстаток КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	БухПартииЦенныхБумагОстатки.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчетаОстаток КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)) КАК ДатаПокупки,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СуммаПокупки,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупки,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерСделки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И УчетныйАктивЕПС <> &УчетныйАктивЕПС
		|				И ВЫБОР
		|					КОГДА &УчетныйАктивЕПССтарый <> ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|						ТОГДА УчетныйАктивЕПС = &УчетныйАктивЕПССтарый
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("Период",							Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Иначе
		Запрос.УстановитьПараметр("Период",							Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	КонецЕсли;
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.ЦеннаяБумага);
	Запрос.УстановитьПараметр("УчетныйАктивЕПС", Объект.УчетныйАктивЕПС);
	Запрос.УстановитьПараметр("УчетныйАктивЕПССтарый", Объект.УчетныйАктивЕПССтарый);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьБалансовыеДанные()
	
	БалансовыеРесурсыПартий = "
		|	БалансоваяСтоимость,
		|	БалансоваяСтоимостьВВалютеУчета,
		|	БалансоваяПереоценка,
		|	БалансоваяПереоценкаВВалютеУчета,
		|	БалансоваяДисконтПремияНачисленный,
		|	БалансоваяДисконтПремияНачисленныйВВалютеУчета,
		|	БалансоваяКорректировкаЭСП,
		|	БалансоваяКорректировкаЭСПВВалютеУчета,
		|	БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	БалансоваяСуммаРезервовПодОбесценение,
		|	ПогашениеКупонаНеИсполненноеВСрок,
		|	ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	УчетныйАктивЕПС";
	
	БалансовыеПартии = ПолучитьПартии();
	Для каждого СтрокаБалансовыеПартии Из БалансовыеПартии Цикл
		
		ЭтаФорма.СтарыйКласс = СтрокаБалансовыеПартии.УчетныйАктивЕПС.Родитель;
		
		СтрокиПартий = Объект.Партии.НайтиСтроки(Новый Структура("Партия,СтрокаПартии", СтрокаБалансовыеПартии.Партия, СтрокаБалансовыеПартии.СтрокаПартии));
		
		Если СтрокиПартий.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет партий на балансе");
			Возврат;
		КонецЕсли;
		
		СтрокаПартий = СтрокиПартий[0];
			
		ЗаполнитьЗначенияСвойств(СтрокаПартий, СтрокаБалансовыеПартии, БалансовыеРесурсыПартий);
		
		СтрокаПартий.БалансоваяПереоценка = СтрокаПартий.БалансоваяПереоценка + СтрокаПартий.ДооценкаПоПрофсуждению;
		СтрокаПартий.БалансоваяПереоценкаВВалютеУчета = СтрокаПартий.БалансоваяПереоценкаВВалютеУчета + СтрокаПартий.ДооценкаПоПрофсуждениюВВалютеУчета;
		
		СтрокаПартий.БалансоваяДисконтПремияНачисленный = СтрокаПартий.БалансоваяДисконтПремияНачисленный + СтрокаПартий.ДоначислениеДисконтаПремии;
		СтрокаПартий.БалансоваяДисконтПремияНачисленныйВВалютеУчета = СтрокаПартий.БалансоваяДисконтПремияНачисленныйВВалютеУчета + СтрокаПартий.ДоначислениеДисконтаПремииВВалютеУчета;
		
		СтрокаПартий.БалансоваяКорректировкаЭСП = СтрокаПартий.БалансоваяКорректировкаЭСП + СтрокаПартий.ДоначислениеКорректировкиЭСП;
		СтрокаПартий.БалансоваяКорректировкаЭСПВВалютеУчета = СтрокаПартий.БалансоваяКорректировкаЭСПВВалютеУчета + СтрокаПартий.ДоначислениеКорректировкиЭСПВВалютеУчета;
		
		СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные + СтрокаПартий.ДоначислениеРазницаПервоначальногоПризнания;
		СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + СтрокаПартий.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета;
		
		ПересчитатьСтоимость(СтрокаПартий);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтоимостьПоМетодике(РасшифровкаРасчета = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	ОцениваемыеБумаги = ПолучитьПартии();
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация",					Объект.Организация);
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	Объект.СчетДоверительногоУправления);
	ПараметрыРасчета.Вставить("ЦельРасчета",					Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	ПараметрыРасчета.Вставить("ВалютаУчета",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета"));
	ПараметрыРасчета.Вставить("Дата", 							КонецДня(Объект.Дата));
	
	НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыРасчета.Дата, ПараметрыРасчета.Организация, ПараметрыРасчета.СчетДоверительногоУправления, ПараметрыРасчета.ЦельРасчета);
	
	ПараметрыРасчета.Вставить("ВидУчета",							НастройкиОценки.ВидУчетаДляОстатковПартий); 	
	ПараметрыРасчета.Вставить("ВариантРасчетаОценочнойСтоимости",	НастройкиОценки.ВариантРасчетаОценочнойСтоимости); 	
	
	Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом Тогда
	
		Объект.Стоимость = 0;
		Объект.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.ПустаяСсылка();
		Объект.Источник = Справочники.ЮрФизЛица.ПустаяСсылка();
		Объект.УровеньОценки = 0;
		
		Возврат Истина;
	
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаРасчета.Вставить("ВариантРасчетаОценочнойСтоимости", НастройкиОценки.ВариантРасчетаОценочнойСтоимости);	
	КонецЕсли;
	
	РСП = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(РСП, ПараметрыРасчета);
	РСП.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
	РСП.ДополнительныеСвойства.Вставить("ВыполнятьРасчетПоУказаниюЦБ", Ложь);
	
	ОцениваемыеБумаги.Колонки.Добавить("ТипЗадолженности", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
	
	РСП.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, РасшифровкаРасчета, ОцениваемыеБумаги, Истина);
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если РСП.СтоимостиПереоценки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если РасшифровкаРасчета = Неопределено Тогда
		Объект.Стоимость = РСП.СтоимостиПереоценки[0].Цена;
		Объект.ВидЦены = РСП.СтоимостиПереоценки[0].ВидЦены;
		Объект.Источник = РСП.СтоимостиПереоценки[0].Источник;
		Объект.УровеньОценки = РСП.СтоимостиПереоценки[0].УровеньОценки;
	Иначе
		
		Отчет = Новый ТабличныйДокумент;
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Вариант расчета справедливой стоимости: " + РасшифровкаРасчета.ВариантРасчетаОценочнойСтоимости, , , Отчет);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
		
		РасшифровкаРасчета = Отчет;
	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	
	ЭтаФорма.ОтображатьПереоценку = ЭтоПереоцениваемыйВидАктива(Объект.УчетныйАктивЕПС);
	ЭтаФорма.ОтображатьКорректировкуЭСП = ЭтоКорректируемыйВидАктива(Объект.УчетныйАктивЕПС);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьБалансовыеДанные();
	КонецЕсли;
	
	ЭтаФорма.ОтображатьБалансовуюПереоценку = ЭтоПереоцениваемыйВидАктива(ЭтаФорма.СтарыйКласс) Или ЭтоПереоцениваемыйВидАктива(Объект.УчетныйАктивЕПС);
	ЭтаФорма.ОтображатьБалансовуюКорректировкуЭСП = ЭтоКорректируемыйВидАктива(ЭтаФорма.СтарыйКласс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереоцениватьПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.ГруппаЦена.Видимость = Объект.Переоценивать;
	
	Если Объект.Переоценивать Тогда
	
		Если НЕ ЗаполнитьСтоимостьПоМетодике() И (ЭтоПереоцениваемыйВидАктива(ЭтаФорма.СтарыйКласс, Истина)) Тогда
			
			Объект.Переоценивать = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить стоимость по методике", Объект.Ссылка);
			Возврат;
			
		КонецЕсли;
	Иначе
		Объект.Стоимость = 0;
		Объект.ВидЦены = ПредопределенноеЗначение("Перечисление.ИсточникиЦеныДляПереоценки.ПустаяСсылка");
		Объект.Источник = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
		Объект.УровеньОценки = 0;
	КонецЕсли;
	
	СтоимостьПриИзменении(Элемент);
	
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

#Область РеализацияВариантовПереносаСтоимостей

&НаКлиенте
Процедура ПереоценкуВКорректировкуЭСП(Команда) Экспорт
	
	Для каждого СтрокаПартии Из Объект.Партии Цикл
	
		СтрокаПартии.КорректировкаЭСП = СтрокаПартии.БалансоваяПереоценка;
		СтрокаПартии.КорректировкаЭСПВВалютеУчета = СтрокаПартии.БалансоваяПереоценкаВВалютеУчета;
		
		ПересчитатьСтоимость(СтрокаПартии);
		
	КонецЦикла;
	
	ПересчитатьИтоговыеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереоценкуВКорректировкуПП(Команда)
	
	Для каждого СтрокаПартии Из Объект.Партии Цикл
	
		СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаПартии.БалансоваяПереоценка;
		СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаПартии.БалансоваяПереоценкаВВалютеУчета;
		
		ПересчитатьСтоимость(СтрокаПартии);	
		
	КонецЦикла;
	
	ПересчитатьИтоговыеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаЭСПвПереоценку(Команда) Экспорт
	
	Для каждого СтрокаПартии Из Объект.Партии Цикл
	
		СтрокаПартии.Переоценка = СтрокаПартии.БалансоваяКорректировкаЭСП;
		СтрокаПартии.ПереоценкаВВалютеУчета = СтрокаПартии.БалансоваяКорректировкаЭСПВВалютеУчета;
		
		ПересчитатьСтоимость(СтрокаПартии);	
		
	КонецЦикла;
	
	ПересчитатьИтоговыеПоля();
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСтоимость(ТекущиеДанные)

	МассивВариантов = Новый Массив;
	МассивВариантов.Добавить(Новый Структура("Префикс,Постфикс,ИмяРеквизитаСтоимости", "", 				"",				"НоваяСтоимость"));
	МассивВариантов.Добавить(Новый Структура("Префикс,Постфикс,ИмяРеквизитаСтоимости", "", 				"ВВалютеУчета",	"НоваяСтоимость"));	
	МассивВариантов.Добавить(Новый Структура("Префикс,Постфикс,ИмяРеквизитаСтоимости", "Балансовая",	"",				"СтараяСтоимость"));	
	МассивВариантов.Добавить(Новый Структура("Префикс,Постфикс,ИмяРеквизитаСтоимости", "Балансовая",	"ВВалютеУчета",	"СтараяСтоимость"));	
	
	Для каждого Вариант Из МассивВариантов Цикл
	
		ТекущиеДанные[Вариант.ИмяРеквизитаСтоимости + Вариант.Постфикс] = ТекущиеДанные[Вариант.Префикс + "Стоимость" + Вариант.Постфикс]
																		+ ТекущиеДанные[Вариант.Префикс + "Переоценка" + Вариант.Постфикс]
																		+ ТекущиеДанные[Вариант.Префикс + "ДисконтПремияНачисленный" + Вариант.Постфикс]
																		+ ТекущиеДанные[Вариант.Префикс + "КорректировкаЭСП" + Вариант.Постфикс]
																		+ ТекущиеДанные[Вариант.Префикс + "СуммаРезервовПодОбесценение"]
																		+ ТекущиеДанные[Вариант.Префикс + "РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные" + Вариант.Постфикс];
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПересчетыОбщейСуммыПриИзмененииЧастей

&НаКлиенте
Процедура ПартииСтоимостьПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ПартииПереоценкаПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ПартииДисконтПремияНачисленныйПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ПартииКорректировкаЭСППриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ПартииРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ПартииСуммаРезервовПодОбесценениеПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура Партии1СтоимостьВВалютеУчетаПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии1.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура Партии1ПереоценкаВВалютеУчетаПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии1.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура Партии1ДисконтПремияНачисленныйВВалютеУчетаПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии1.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура Партии1КорректировкаЭСПВВалютеУчетаПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии1.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура Партии1РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии1.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

&НаКлиенте
Процедура Партии1СуммаРезервовПодОбесценениеПриИзменении(Элемент)
	ПересчитатьСтоимость(ЭтаФорма.Элементы.Партии1.ТекущиеДанные);
	ПересчитатьИтоговыеПоля();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура РассчитатьПроцентныеПоказателиДляПартии()

	ТабличнаяЧастьЦенныеБумаги = Объект.Партии.Выгрузить();
	
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("Рынок", Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("ДатаПартии", Новый ОписаниеТипов("Дата"));
	
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("ОценочныеДисконтПремия", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("ОценочнаяКорректировкаЭСП", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("ОценочнаяРазницаППНеНаблюдаемыеДанные", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("НачальнаяРазницаППНеНаблюдаемыеДанные", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("ОценочнаяСуммаКупона", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("БалансоваяРазницаППНеНаблюдаемыеДанные", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТабличнаяЧастьЦенныеБумаги.Колонки.Добавить("БалансовыеДисконтПремия", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	
	Для каждого СтрокаЦенныеБумаги Из ТабличнаяЧастьЦенныеБумаги Цикл
	
		СтрокаЦенныеБумаги.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
		СтрокаЦенныеБумаги.ЦеннаяБумага = Объект.ЦеннаяБумага;
		
		СтрокаЦенныеБумаги.ДатаПартии = СтрокаЦенныеБумаги.ДатаПокупки;
		
		СтрокаЦенныеБумаги.ОценочныеДисконтПремия = 0;
		СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСП = 0;
		СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные = 0;
		СтрокаЦенныеБумаги.НачальнаяРазницаППНеНаблюдаемыеДанные = СтрокаЦенныеБумаги.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная;
		СтрокаЦенныеБумаги.ОценочнаяСуммаКупона = СтрокаЦенныеБумаги.СтоимостьКупона + СтрокаЦенныеБумаги.ПереоценкаКупона;
		СтрокаЦенныеБумаги.БалансоваяРазницаППНеНаблюдаемыеДанные = СтрокаЦенныеБумаги.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		СтрокаЦенныеБумаги.БалансовыеДисконтПремия = СтрокаЦенныеБумаги.БалансоваяДисконтПремияНачисленный;
	
	КонецЦикла;
	
	БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПДляПереоценки(Объект, ТабличнаяЧастьЦенныеБумаги);
	
	Для каждого СтрокаЦенныеБумаги Из ТабличнаяЧастьЦенныеБумаги Цикл
		
		СтрокиПартий = Объект.Партии.НайтиСтроки(Новый Структура("Партия,СтрокаПартии", СтрокаЦенныеБумаги.Партия, СтрокаЦенныеБумаги.СтрокаПартии));
		СтрокаПартий = СтрокиПартий[0];
			
		ОценочныеДисконтПремияВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаЦенныеБумаги.ОценочныеДисконтПремия, Объект.ЦеннаяБумага.ВалютаНоминала, Объект.Организация, Объект.Дата);	
		ОценочнаяКорректировкаЭСПВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСП, Объект.ЦеннаяБумага.ВалютаНоминала, Объект.Организация, Объект.Дата);	
		ОценочнаяРазницаППНеНаблюдаемыеДанныеВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные, Объект.ЦеннаяБумага.ВалютаНоминала, Объект.Организация, Объект.Дата);	
		
		СтрокаПартий.ДоначислениеДисконтаПремии = СтрокаЦенныеБумаги.ОценочныеДисконтПремия - СтрокаПартий.БалансоваяДисконтПремияНачисленный;
		СтрокаПартий.ДоначислениеДисконтаПремииВВалютеУчета = ОценочныеДисконтПремияВВалютеУчета - СтрокаПартий.БалансоваяДисконтПремияНачисленныйВВалютеУчета;
		
		СтрокаПартий.ДоначислениеКорректировкиЭСП = СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСП - СтрокаПартий.БалансоваяКорректировкаЭСП;
		СтрокаПартий.ДоначислениеКорректировкиЭСПВВалютеУчета = ОценочнаяКорректировкаЭСПВВалютеУчета - СтрокаПартий.БалансоваяКорректировкаЭСПВВалютеУчета;
		
		СтрокаПартий.ДоначислениеРазницаПервоначальногоПризнания = СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные - СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		СтрокаПартий.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета = ОценочнаяРазницаППНеНаблюдаемыеДанныеВВалютеУчета - СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
		
		Если СтрокаПартий.БалансоваяДисконтПремияНачисленный = СтрокаПартий.ДисконтПремияНачисленный Тогда
		
			СтрокаПартий.ДисконтПремияНачисленный = СтрокаЦенныеБумаги.ОценочныеДисконтПремия;
			СтрокаПартий.ДисконтПремияНачисленныйВВалютеУчета = ОценочныеДисконтПремияВВалютеУчета;
		
		КонецЕсли;
		
		СтрокаПартий.БалансоваяДисконтПремияНачисленный = СтрокаЦенныеБумаги.ОценочныеДисконтПремия;
		СтрокаПартий.БалансоваяДисконтПремияНачисленныйВВалютеУчета = ОценочныеДисконтПремияВВалютеУчета;
		
		СтрокаПартий.БалансоваяКорректировкаЭСП = СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСП;
		СтрокаПартий.БалансоваяКорректировкаЭСПВВалютеУчета = ОценочнаяКорректировкаЭСПВВалютеУчета;
		
		СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные;
		СтрокаПартий.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = ОценочнаяРазницаППНеНаблюдаемыеДанныеВВалютеУчета;
		
		ПересчитатьСтоимость(СтрокаПартий);
		
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Процедура НачислятьПроцентныеПоказателиПриИзменении(Элемент)
	
	Если Объект.НачислятьПроцентныеПоказатели Тогда
		РассчитатьПроцентныеПоказателиДляПартии();
	Иначе
		Для каждого СтрокаПартии Из Объект.Партии Цикл
			
			СтрокаПартии.ДисконтПремияНачисленный = СтрокаПартии.ДисконтПремияНачисленный - СтрокаПартии.ДоначислениеДисконтаПремии;
			СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета = СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета - СтрокаПартии.ДоначислениеДисконтаПремииВВалютеУчета;
			
			СтрокаПартии.КорректировкаЭСП = СтрокаПартии.КорректировкаЭСП - СтрокаПартии.ДоначислениеКорректировкиЭСП;
			СтрокаПартии.КорректировкаЭСПВВалютеУчета = СтрокаПартии.КорректировкаЭСПВВалютеУчета - СтрокаПартии.ДоначислениеКорректировкиЭСПВВалютеУчета;
			
			СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные - СтрокаПартии.ДоначислениеРазницаПервоначальногоПризнания;
			СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета - СтрокаПартии.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета;
			
			ПересчитатьСтоимость(СтрокаПартии);
			
			СтрокаПартии.ДоначислениеДисконтаПремии = 0;
			СтрокаПартии.ДоначислениеДисконтаПремииВВалютеУчета = 0;
			
			СтрокаПартии.ДоначислениеКорректировкиЭСП = 0;
			СтрокаПартии.ДоначислениеКорректировкиЭСПВВалютеУчета = 0;
			
			СтрокаПартии.ДоначислениеРазницаПервоначальногоПризнания = 0;
			СтрокаПартии.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета = 0;
			
			ПересчитатьСтоимость(СтрокаПартии);
			
		КонецЦикла;
	КонецЕсли;
	ПересчитатьИтоговыеПоля();
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЭСПвExcel(Команда)
	
	ДанныеПартий = ЭтаФорма.Элементы.Партии.ТекущиеДанные;
	Если ДанныеПартий = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите партию!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Стоимость) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена стоимость по методике!");
		Возврат;
	КонецЕсли;
	
	БухгалтерскийУчетКлиентСервер.РасчетЭСПвExcel(
		Объект.ЦеннаяБумага,
		Новый Структура("Дата, Организация, СчетДоверительногоУправления, УчетныйАктивЕПС, Партия, СтрокаПартии", Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.УчетныйАктивЕПС, Объект.Ссылка, ДанныеПартий.НомерСтроки),
		Новый Структура("ДатаПокупки, ЦенаПокупки, ЦенаПокупкиКупона, Количество", НачалоДня(Объект.Дата), Объект.Стоимость, (ДанныеПартий.СтоимостьКупона + ДанныеПартий.ПереоценкаКупона) / ДанныеПартий.Количество, ДанныеПартий.Количество)
	);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматизацияПоМетодикеБудущего(Команда)
	
	ЦеннаяБумагаПриИзменении(ЭтаФорма.Элементы.ЦеннаяБумага);
	
	Объект.НачислятьПроцентныеПоказатели = Истина;
	
	НачислятьПроцентныеПоказателиПриИзменении(ЭтаФорма.Элементы.НачислятьПроцентныеПоказатели);
	
	Объект.Переоценивать = Истина;
	
	ПереоцениватьПриИзменении(ЭтаФорма.Элементы.Переоценивать);
	
	ПереоценкуВКорректировкуЭСП(Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьРасчет(Команда)
	
	РасшифровкаРасчета = Новый Структура;
	РасшифровкаРасчета.Вставить("ЦеннаяБумага",	Объект.ЦеннаяБумага);
	РасшифровкаРасчета.Вставить("Операции",		Новый Массив);
	
	ЗаполнитьСтоимостьПоМетодике(РасшифровкаРасчета);
	
	Если ТипЗнч(РасшифровкаРасчета) = Тип("ТабличныйДокумент") Тогда
		РасшифровкаРасчета.Показать("Расчет стоимости '" + Строка(Объект.ЦеннаяБумага) + "'");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПриИзменении(Элемент) Экспорт
	
	Для каждого СтрокаПартии Из Объект.Партии Цикл
		
		// откатим дооценку назад - как-будто ничего не дооценивали - это важно, когда будем на форме несколько раз цену менять
		СтрокаПартии.БалансоваяПереоценка = СтрокаПартии.БалансоваяПереоценка - СтрокаПартии.ДооценкаПоПрофсуждению;
		СтрокаПартии.БалансоваяПереоценкаВВалютеУчета = СтрокаПартии.БалансоваяПереоценкаВВалютеУчета - СтрокаПартии.ДооценкаПоПрофсуждениюВВалютеУчета;
		// и пересчитаем стоимости, чтобы СтрокаПартии.СтараяСтоимость была правильной
		ПересчитатьСтоимость(СтрокаПартии);
		
		Если Объект.Переоценивать Тогда // по профсуждению
		
			СуммаПоПрофсуждению = СтрокаПартии.Количество * Объект.Стоимость;
			СуммаПоПрофсуждениюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаПоПрофсуждению, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЦеннаяБумага, "ВалютаНоминала"), Объект.Организация, Объект.Дата);
			
		Иначе // по балансу
			
			СуммаПоПрофсуждению = СтрокаПартии.СтараяСтоимость;
			СуммаПоПрофсуждениюВВалютеУчета = СтрокаПартии.СтараяСтоимостьВВалютеУчета;
			
		КонецЕсли;
		// посчитаем насколько нужно дооценить
		СтрокаПартии.ДооценкаПоПрофсуждению = СуммаПоПрофсуждению - СтрокаПартии.СтараяСтоимость;
		СтрокаПартии.ДооценкаПоПрофсуждениюВВалютеУчета = СуммаПоПрофсуждениюВВалютеУчета - СтрокаПартии.СтараяСтоимостьВВалютеУчета;
		// расчитаем новую переоценку
		СтрокаПартии.БалансоваяПереоценка = СтрокаПартии.БалансоваяПереоценка + СтрокаПартии.ДооценкаПоПрофсуждению;
		СтрокаПартии.БалансоваяПереоценкаВВалютеУчета = СтрокаПартии.БалансоваяПереоценкаВВалютеУчета + СтрокаПартии.ДооценкаПоПрофсуждениюВВалютеУчета;
		// и пересчитаем стоимости, раз переоценка изменилась
		ПересчитатьСтоимость(СтрокаПартии);
		
	КонецЦикла;
	
	ПересчитатьИтоговыеПоля();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоминалаНаСервере(Облигация, Период)
	Возврат Новый Структура("Номинал, ВалютаНоминала", Справочники.Облигации.ПолучитьНоминал(Облигация, Период), Облигация.ВалютаНоминала);	
КонецФункции 

&НаКлиенте
Процедура МетодикаАтомов(Команда)
	
	Если НЕ Объект.Переоценивать Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данное распределение требует установки галки 'Переоценивать'");
		Возврат;
	КонецЕсли;
	
	ДанныеНоминала = ПолучитьДанныеНоминалаНаСервере(Объект.ЦеннаяБумага, Объект.Дата);
	НачальныйДисконтПремия = Объект.Стоимость - ДанныеНоминала.Номинал;
	
	Для каждого СтрокаПартии Из Объект.Партии Цикл
		
		СтрокаПартии.ДисконтПремия = НачальныйДисконтПремия * СтрокаПартии.Количество;
		СтрокаПартии.ДисконтПремияПокупки = СтрокаПартии.ДисконтПремия;
		
		Если НачальныйДисконтПремия > 0 Тогда
			
			СтрокаПартии.Стоимость = ДанныеНоминала.Номинал * СтрокаПартии.Количество;
			СтрокаПартии.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаПартии.Стоимость, ДанныеНоминала.ВалютаНоминала, Объект.Организация, Объект.Дата);
			
			СтрокаПартии.ДисконтПремияНачисленный = СтрокаПартии.ДисконтПремия;
			СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаПартии.ДисконтПремияНачисленный, ДанныеНоминала.ВалютаНоминала, Объект.Организация, Объект.Дата);
		
		Иначе
			
			СтрокаПартии.Стоимость = Объект.Стоимость * СтрокаПартии.Количество;
			СтрокаПартии.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаПартии.Стоимость, ДанныеНоминала.ВалютаНоминала, Объект.Организация, Объект.Дата);
		
		КонецЕсли;
		
		ПересчитатьСтоимость(СтрокаПартии);	
		
	КонецЦикла;
	
	ПересчитатьИтоговыеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматизацияПоМетодикеАтомов(Команда)
	
	ЦеннаяБумагаПриИзменении(ЭтаФорма.Элементы.ЦеннаяБумага);
	
	Объект.НачислятьПроцентныеПоказатели = Истина;
	
	НачислятьПроцентныеПоказателиПриИзменении(ЭтаФорма.Элементы.НачислятьПроцентныеПоказатели);
	
	Объект.Переоценивать = Истина;
	
	ПереоцениватьПриИзменении(ЭтаФорма.Элементы.Переоценивать);
	
	МетодикаАтомов(Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура БалансовыеПоказателиВТекущие(Команда) Экспорт
	
	Для Каждого СтрокаПартии Из Объект.Партии Цикл
		
		СтрокаПартии.Стоимость = СтрокаПартии.БалансоваяСтоимость;
		СтрокаПартии.СтоимостьВВалютеУчета = СтрокаПартии.БалансоваяСтоимостьВВалютеУчета;
		СтрокаПартии.Переоценка = СтрокаПартии.БалансоваяПереоценка;
		СтрокаПартии.ПереоценкаВВалютеУчета = СтрокаПартии.БалансоваяПереоценкаВВалютеУчета;
		СтрокаПартии.ДисконтПремияНачисленный = СтрокаПартии.БалансоваяДисконтПремияНачисленный;
		СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета = СтрокаПартии.БалансоваяДисконтПремияНачисленныйВВалютеУчета;
		СтрокаПартии.КорректировкаЭСП = СтрокаПартии.БалансоваяКорректировкаЭСП;
		СтрокаПартии.КорректировкаЭСПВВалютеУчета = СтрокаПартии.БалансоваяКорректировкаЭСПВВалютеУчета;
		СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаПартии.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаПартии.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
		СтрокаПартии.СуммаРезервовПодОбесценение = СтрокаПартии.БалансоваяСуммаРезервовПодОбесценение;
		
		ПересчитатьСтоимость(СтрокаПартии);	
		
	КонецЦикла;	
	
	ПересчитатьИтоговыеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаЭСПРазницаППРезервВПереоценку(Команда) Экспорт
	
	Для Каждого СтрокаПартии Из Объект.Партии Цикл
	
		СтрокаПартии.Переоценка = СтрокаПартии.Переоценка + СтрокаПартии.КорректировкаЭСП + СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		СтрокаПартии.ПереоценкаВВалютеУчета = СтрокаПартии.ПереоценкаВВалютеУчета + СтрокаПартии.КорректировкаЭСПВВалютеУчета + СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + СтрокаПартии.СуммаРезервовПодОбесценение;
		
		СтрокаПартии.КорректировкаЭСП = 0;
		СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0;
		СтрокаПартии.КорректировкаЭСПВВалютеУчета = 0;
		СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = 0;
		СтрокаПартии.СуммаРезервовПодОбесценение = 0;
		
		ПересчитатьСтоимость(СтрокаПартии);	
		
	КонецЦикла;
	
	ПересчитатьИтоговыеПоля();
	
	ЭтаФорма.Элементы.ПартииКорректировкаЭСП.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.ПартииРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.ПартииСуммаРезервовПодОбесценение.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	
	ЭтаФорма.Элементы.Партии1КорректировкаЭСПВВалютеУчета.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.Партии1РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	ЭтаФорма.Элементы.Партии1СуммаРезервовПодОбесценение.Видимость = Не Объект.КорректировкаЭСПРазницаППРезервВПереоценку;
	
	
КонецПроцедуры


&НаКлиенте
Процедура КорректировкаЭСПРазницаППРезервВПереоценкуПриИзменении(Элемент)
	
	БалансовыеПоказателиВТекущие(Неопределено);
	КорректировкаЭСПРазницаППРезервВПереоценку(Неопределено);
	
КонецПроцедуры

