
&НаКлиенте
Процедура СформироватьОстаткиЕПС(Команда)
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СформироватьОстаткиЕПС");
	Попытка
		СформироватьОстаткиЕПСНаСервере();
	
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаСервере
Процедура СформироватьОстаткиЕПСНаСервере()
	РеквизитФормыВЗначение("Объект").СформироватьОстаткиЕПС();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОстаткиПоБумагам(Команда)
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СформироватьОстаткиПоБумагам");
	Попытка
		СформироватьОстаткиПоБумагамНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаСервере
Процедура СформироватьОстаткиПоБумагамНаСервере()
	РеквизитФормыВЗначение("Объект").СформироватьОстаткиПоБумагам();
КонецПроцедуры
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
 
 ОбъектОбработки = РеквизитФормыВЗначение("Объект");
 
 ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
 
 Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
 Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
  Механизм,
  ПараметрыВыполненияДляСбораСтатистики.Хранилище,
  ПараметрыВыполненияДляСбораСтатистики.Описание);
  
 ПараметрыСессии = Новый Структура;
 ПараметрыСессии.Вставить("Механизм",     Механизм);
 ПараметрыСессии.Вставить("Сессия",        Сессия);
 ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
 ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
  
 Возврат ПараметрыСессии;
 
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
 
 РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
  ПараметрыСессии.Механизм,
  ПараметрыСессии.Сессия,,
  ПараметрыСессии.ДопПараметры,
  ПараметрыСессии.ТекстОшибки);
 
КонецПроцедуры

#КонецОбласти
