
#Область ОтладочныеПроцедурыИФункции

//Пример кода вызова
//ХМЛ = ПолучитьХМЛ();
//ЗаписьТекста = Новый ЗаписьТекста("\\am-1c00\Виктор\КИД\Настройки.xml");
//ЗаписьТекста.Записать(ХМЛ.Настройки);
//ЗаписьТекста.Закрыть();
//ЗаписьТекста = Новый ЗаписьТекста("\\am-1c00\Виктор\КИД\Схема.xml");
//ЗаписьТекста.Записать(ХМЛ.Схема);
//ЗаписьТекста.Закрыть();
&НаСервере
Функция ПолучитьХМЛ()

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);

	Структура = СтруктураРезультатовПроверки.СтруктураФормированияОтчета;
	
	Настройки = Структура.Настройки;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Настройки, "Settings", "http://v8.1c.ru/8.1/data-composition-system/settings");
	
	Результат = Новый Структура;
	Результат.Вставить("Настройки", ЗаписьXML.Закрыть());
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Структура.СКД, "DataCompositionSchema", "http://v8.1c.ru/8.1/data-composition-system/schema");
	
	Результат.Вставить("Схема", ЗаписьXML.Закрыть());
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ЗаписатьРезультатВФайлы(СКД = Неопределено, Настройки = Неопределено, МакетКомпоновки = Неопределено, Постфикс = "", СохранятьРезультатВФайлы = Ложь)

	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаНаСервере.ЗаписатьРезультатВФайлы(СКД, Настройки, МакетКомпоновки, Постфикс, СохранятьРезультатВФайлы);

КонецФункции

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период      = ТекущаяДата();
	
	ЭтаФорма.АдресДанныхРасшифровкиБазиса 			= ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	ЭтаФорма.АдресСоставаСовокупнойИнвестДекларации = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	ЭтаФорма.АдресСтруктурыРезультатовПроверки 		= ПоместитьВоВременноеХранилище(Новый Структура, ЭтаФорма.УникальныйИдентификатор);
	ЭтаФорма.АдресМассиваРезультатовКонтроля		= ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	
	ЭтаФорма.ВалютаУчета 					= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
	ЭтаФорма.ИспользоватьЦелевоеЗначение 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИнвестиционнаяДекларация, "ИспользоватьЦелевоеЗначение");
	
	ЭтаФорма.ПериодОбновления				= 10;
	ЭтаФорма.НаименованиеЗадания = "Контроль инвестиционной декларации (" + ПолучитьТекущийСеансИнформационнойБазы().Пользователь.Имя + ")";
	ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль";
	ЭтаФорма.РежимСовокукпногоКонтроля = "Авто";
	ЭтаФорма.РежимГрупповогоКонтроля = "ПоСчетам";
	ЭтаФорма.КонтрольЗаПериодРежимЗаполнения = "ПоНастройкам";
	ЭтаФорма.МаксимумАктивныхЗаданий = 2;
	
	ЭтаФорма.ПараметрыПроверки = Новый Структура("РежимКонтроля, РежимГрупповогоКонтроля", 
		ЭтаФорма.РежимКонтроля,
		ЭтаФорма.РежимГрупповогоКонтроля); 
		
	// флаг виден всем, т.к. необходима возможность формировать совокупную ИД по счетам ДУ и в одной организации
	// в любом случае, список счетов ДУ формируется только по организациям, к которым у пользователя есть доступ
	//Элементы.СовокупнаяИнвестДекларация.Видимость = РольДоступна("МногофирменныйУчет") Или ЭтаФорма.ПолныеПрава;
	
	Элементы.ГруппаОтладка.Видимость = РольДоступна("ПолныеПрава");
	
	Если Параметры.Свойство("ИдентификаторРезультата") Тогда
		
		ЗагрузитьРезультатыПроверкиНаСервере(Параметры.ИдентификаторРезультата);
		ЭтаФорма.РеквизитыИзХранилища = Новый Структура;
		ЭтаФорма.РеквизитыИзХранилища.Вставить("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
		ЭтаФорма.РеквизитыИзХранилища.Вставить("Клиент", Объект.Клиент);
		ЭтаФорма.РеквизитыИзХранилища.Вставить("ВидДоговораДоверительногоУправления", Объект.ВидДоговораДоверительногоУправления);
		
		РеквизитыКонтроля = ПолучитьРеквизитыКонтроля(Объект.Период, Объект.Организация, Объект.СчетДоверительногоУправления);
	
		Если РеквизитыКонтроля.Свойство("ДатаПроверкиСледующейИД") Тогда
			Элементы.НадписьНоваяИнвестиционнаяДекларация.Видимость = Истина;
			Элементы.НадписьНоваяИнвестиционнаяДекларация.Заголовок = "Внимание! " + Формат(РеквизитыКонтроля.ДатаПроверкиСледующейИД, "ДФ=dd.MM.yyyy") + 
				" вступает в силу новая инвестиционная декларация";
		Иначе
			Элементы.НадписьНоваяИнвестиционнаяДекларация.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли; 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЭтаФорма.ВнешняяОбработка = Не СтрНачинаетсяС(ОбработкаОбъект.ИспользуемоеИмяФайла, "e1cib\tempstorage\");
	Шапка = ОбработкаОбъект.ПолучитьМакет("РезультатыКонтроля").ПолучитьОбласть("Шапка");
	ЭтаФорма.ТабличныйДокументРезультатыКонтроля.Вывести(Шапка);
	
	УстановитьПереключательТипа(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОрганизацияСчетаДУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "Организация");
	Если ОрганизацияСчетаДУ <> Объект.Организация Тогда
		Объект.СчетДоверительногоУправления = Неопределено;
	КонецЕсли; 
	
	Если ТипЗнч(ЭтаФорма.РеквизитыИзХранилища) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, ЭтаФорма.РеквизитыИзХранилища);
	Иначе
		
		НаборДействий = Новый Массив;
		
		Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			НаборДействий.Добавить("ЗаполнитьКлиента");
		Иначе
			НаборДействий.Добавить("ЗаполнитьСчетДоверительногоУправления");
		КонецЕсли; 
		
		НаборДействий.Добавить("ЗаполнитьВидДоговора");
		НаборДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
		НаборДействий.Добавить("ЗаполнитьСостав");
			
		НаборДействий.Добавить("ЗаполнитьДанныеРСА");
		
		ОбновитьРеквизитыКонтроля(НаборДействий);
		
	КонецЕсли; 
	
	ЭтаФорма.КлючУникальности = Новый УникальныйИдентификатор;
	УстановитьВидимость(ЭтаФорма);
	//ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
	
		Если Элементы.ГруппаСтраницРезультов.ТекущаяСтраница = Элементы.СтраницаРасшифровка Тогда
			Элементы.ГруппаСтраницРезультов.ТекущаяСтраница = Элементы.СтраницаРезультатПроверки;
			Отказ = Истина;
		Иначе
			Отказ = (Вопрос("Закрыть контроль инвестиционных деклараций?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		ЗавершитьФоновыеЗадания();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьФоновыеЗадания()
	ИдентификаторыЗаданий = Новый Массив;
	
	АктивныеЗадания = Объект.СоставГрупповогоКонтроля.НайтиСтроки(Новый Структура("Статус", "Задание выполняется"));	
	Для Каждого СтрокаЗадания Из АктивныеЗадания Цикл
		ИдентификаторыЗаданий.Добавить(СтрокаЗадания.ИдентификаторЗадания);	
	КонецЦикла;
	
	ЗавершитьФоновыеЗаданияНаСервере(ИдентификаторыЗаданий);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗавершитьФоновыеЗаданияНаСервере(ИдентификаторыЗаданий)
	Для Каждого ИдентификаторЗадания Из ИдентификаторыЗаданий Цикл
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если ФоновоеЗадание <> Неопределено И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФоновоеЗадание.Отменить();	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти 

#Область ИндивидуальныйКонтроль_ЭлементыФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	НаборДействий = Новый Массив;
		
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		НаборДействий.Добавить("ЗаполнитьКлиента");
	Иначе
		НаборДействий.Добавить("ЗаполнитьСчетДоверительногоУправления");
	КонецЕсли; 
	
	НаборДействий.Добавить("ЗаполнитьВидДоговора");
	
	Если ЭтаФорма.РежимСовокукпногоКонтроля <> "Совокупно" Тогда
		НаборДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
	КонецЕсли; 
	
	НаборДействий.Добавить("ЗаполнитьСостав");
	НаборДействий.Добавить("ЗаполнитьДанныеРСА");
	
	ОбновитьРеквизитыКонтроля(НаборДействий);
		
	//ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	НаборДействий = Новый Массив;
		
	НаборДействий.Добавить("ЗаполнитьКлиента");
	НаборДействий.Добавить("ЗаполнитьВидДоговора");
	Если ЭтаФорма.РежимСовокукпногоКонтроля <> "Совокупно" Тогда
		НаборДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
	КонецЕсли; 
	НаборДействий.Добавить("ЗаполнитьСостав");
	НаборДействий.Добавить("ЗаполнитьДанныеРСА");
	
	ОбновитьРеквизитыКонтроля(НаборДействий);
	УстановитьПереключательТипа(ЭтаФорма);
	
	//ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = ЭтаФорма.РезультатыПроверки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекСтрока <> Неопределено Тогда
		// проверка на Неопределено срабатывает при двойном клике по гиперссылке в таблицйе группового контроля
		Если Поле.Имя = "РезультатыПроверкиПредставлениеНабора" Тогда
			ОткрытьЗначение(ТекСтрока.УсловияОтбора);
		ИначеЕсли Поле.Имя = "РезультатыПроверкиИнвестиционнаяДекларация" Тогда
			ОткрытьЗначение(ТекСтрока.ИнвестиционнаяДекларация);
		ИначеЕсли Поле.Имя = "РезультатыПроверкиГиперссылка" Тогда
			
			ВывестиРасшифровку = Ложь;
			
			Если ТекСтрока.РезультатПроверки <> ПредопределенноеЗначение("Перечисление.РезультатыКонтроляИнвестиционнойДекларации.ПроверкаПройдена") Тогда
			
				СписокДействий = Новый СписокЗначений;
				
				СписокДействий.Добавить("ПоказатьРасшифровку", "Открыть расшифровку");
				
				Если Не ЗначениеЗаполнено(ТекСтрока.НесоответствиеИнвестиционнойДекларации)
					Или ТекСтрока.ДатаУстранения < Объект.Период Тогда 
					СписокДействий.Добавить("Создать", "Создать документ");
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(ТекСтрока.НесоответствиеИнвестиционнойДекларации) Тогда
					СписокДействий.Добавить("Открыть", "Открыть документ");
				КонецЕсли;
					
				Действие = ВыбратьИзМеню(СписокДействий);
				
				Если Действие = Неопределено Тогда
			
					Возврат;
				
				ИначеЕсли Действие.Значение = "Создать" Тогда
				                
					ЗначенияЗаполнения = ПолучитьЗначенияЗаполненияНесоответствиеИД(ТекСтрока);
					ОткрытьФорму("Документ.НесоответствиеИнвестиционнойДекларации.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
				
				ИначеЕсли Действие.Значение = "Открыть" Тогда
				                
					ОткрытьФорму("Документ.НесоответствиеИнвестиционнойДекларации.ФормаОбъекта", Новый Структура("Ключ", ТекСтрока.НесоответствиеИнвестиционнойДекларации));
				
				ИначеЕсли Действие.Значение = "ПоказатьРасшифровку" Тогда
				                
					ВывестиРасшифровку = Истина;
				
				КонецЕсли; 
				
			Иначе
				ВывестиРасшифровку = Истина;
			КонецЕсли; 
			
			Если ВывестиРасшифровку Тогда
				ВывестиРасшифровку(ТекСтрока.ИмяВложенногоОбъекта, ТекСтрока.НомерБазиса, ТекСтрока.ИмяПоляДоля);	
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Значение = ПолучитьЗначениеРасшифровки(ЭтаФорма.АдресСтруктурыРезультатовПроверки, Расшифровка);
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			
			ОткрытьЗначение(Значение);
		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументБазисОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Значение = ПолучитьЗначениеРасшифровки(ЭтаФорма.АдресДанныхРасшифровкиБазиса, Расшифровка);
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			
			ОткрытьЗначение(Значение);
		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(ДокументРезультат.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ДокументРезультатПриАктивизацииОбластиПодключаемый", 0.2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияСтоимостиАктивовНажатие(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(ЭтаФорма.РегистрацияСтоимостиАктивов) = Тип("Строка") Тогда
	
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СокрЛП(Текст) + Ожидание <> "0" Тогда
	
		СтандартнаяОбработка = Ложь;
		
	    ПараметрыПодбора = Новый Структура;
	    ПараметрыПодбора.Вставить("Отбор", ПараметрыПолученияДанных.Отбор);
	    ПараметрыПодбора.Вставить("СтрокаПоиска", Текст);
	    ПараметрыПодбора.Вставить("ВыборГруппИЭлементов", ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
		ПараметрыПодбора.Вставить("ТекущаяДата", НачалоДня(Объект.Период));
	    ПараметрыПодбора.Вставить("ИсключитьРасторгнутые");
	    
	    ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.СчетаДоверительногоУправления"), ПараметрыПодбора);	
	
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СовокупнаяИнвестДекларацияПриИзменении(Элемент)
	
	ПриИзмененииСовокупногоКонтроля();
	ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСовокупногоКонтроля()

	ЗаполнитьСоставСовокупнойИнвестДекларации();
	
	КонтрольЗаПрошлыйПериод = (НачалоДня(ТекущаяДата()) > Объект.Период);
	Объект.УчитыватьПлановыеОперации = Не (КонтрольЗаПрошлыйПериод Или ЭтаФорма.СовокупнаяИнвестДекларация);

КонецПроцедуры 

#КонецОбласти 

#Область ЗаполнениеРеквизитовФормы

&НаСервере
Процедура ОбновитьРеквизитыКонтроляНаСервере(НаборДействий, Отказ)

	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Возврат;
	КонецЕсли; 
	
	ДоступныеВидыДействий = Новый Массив;
	
	ДоступныеВидыДействий.Добавить("ЗаполнитьСчетДоверительногоУправления");
	ДоступныеВидыДействий.Добавить("ЗаполнитьКлиента");
	ДоступныеВидыДействий.Добавить("ЗаполнитьВидДоговора");
	ДоступныеВидыДействий.Добавить("ЗаполнитьСостав");
	ДоступныеВидыДействий.Добавить("ЗаполнитьДанныеРСА");
	ДоступныеВидыДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
	
	РеквизитыКонтроля = Неопределено;
	МВТ = Неопределено;
	
	Для каждого ВидДействия Из НаборДействий Цикл
	
		Если РеквизитыКонтроля = Неопределено И ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			РеквизитыКонтроля = ПолучитьРеквизитыКонтроля(Объект.Период, Объект.Организация, Объект.СчетДоверительногоУправления);
		КонецЕсли; 
		
		Если ДоступныеВидыДействий.Найти(ВидДействия) = Неопределено Тогда
			ТекстСообщения = СтрШаблон("Ошибка заполнения реквизитов. Вариант заполнения '%1' не поддерживается", ВидДействия);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
			Возврат;
		ИначеЕсли ВидДействия = "ЗаполнитьСчетДоверительногоУправления" Тогда 
			ЗаполнитьСчетДоверительногоУправления(МВТ);
		ИначеЕсли ВидДействия = "ЗаполнитьКлиента" Тогда 
			ЗаполнитьКлиента(РеквизитыКонтроля);
		ИначеЕсли ВидДействия = "ЗаполнитьВидДоговора" Тогда 
			ЗаполнитьВидДоговора(РеквизитыКонтроля, МВТ);
		ИначеЕсли ВидДействия = "ЗаполнитьСостав" Тогда 
			ЗаполнитьСостав(РеквизитыКонтроля);
		ИначеЕсли ВидДействия = "ЗаполнитьДанныеРСА" Тогда 
			ЗаполнитьДанныеРСА(РеквизитыКонтроля);
		ИначеЕсли ВидДействия = "ЗаполнитьИнвестиционнуюДекларацию" Тогда 
			ЗаполнитьИнвестиционнуюДекларацию(РеквизитыКонтроля);		
		КонецЕсли; 
	
	КонецЦикла;
	
	Если ТипЗнч(РеквизитыКонтроля) = Тип("Структура") Тогда
	
		Элементы.РезультатыПроверкиИнвестиционнаяДекларация.Видимость = РеквизитыКонтроля.Консолидирующая;
		
		Если РеквизитыКонтроля.Свойство("ДатаПроверкиСледующейИД") Тогда
			Элементы.НадписьНоваяИнвестиционнаяДекларация.Видимость = Истина;
			Элементы.НадписьНоваяИнвестиционнаяДекларация.Заголовок = "Внимание! " + Формат(РеквизитыКонтроля.ДатаПроверкиСледующейИД, "ДФ=dd.MM.yyyy") + 
				" вступает в силу новая инвестиционная декларация";
		Иначе
			Элементы.НадписьНоваяИнвестиционнаяДекларация.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлиента(РеквизитыКонтроля)

	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.Клиент = РеквизитыКонтроля.Клиент;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидДоговора(РеквизитыКонтроля = Неопределено, МВТ = Неопределено)

	Если ТипЗнч(РеквизитыКонтроля) = Тип("Структура") Тогда
		// счет ДУ заполнен, берем его вид договора
		Объект.ВидДоговораДоверительногоУправления = РеквизитыКонтроля.ВидДоговораДоверительногоУправления;
	КонецЕсли; 
	
	Если МВТ = Неопределено Тогда
		МВТ = Новый МенеджерВременныхТаблиц;
	КонецЕсли; 
	
	Если МВТ.Таблицы.Количество() = 0 Тогда
		
		Отбор = Новый Структура("Организация, Клиент");
		ЗаполнитьЗначенияСвойств(Отбор, Объект);
		Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МВТ, Объект.Период, Отбор);
	
	КонецЕсли;
		
	ТаблицаСчетов = МВТ.Таблицы.Найти("ДействующиеСчетаДУ");
		
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДействующиеСчетаДУ.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ИЗ
		|	ДействующиеСчетаДУ КАК ДействующиеСчетаДУ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МВТ;
			
	ВидыДоговоров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Если ВидыДоговоров.Количество() = 1 Тогда
		Объект.ВидДоговораДоверительногоУправления = ВидыДоговоров[0];
	КонецЕсли; 
	
	Если ВидыДоговоров.Найти(Объект.ВидДоговораДоверительногоУправления) = Неопределено Тогда
		Объект.ВидДоговораДоверительногоУправления = Неопределено;
	КонецЕсли; 
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ВидыДоговоров)));
	Элементы.ВидДоговораДоверительногоУправления1.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетДоверительногоУправления(МВТ = Неопределено)

	Если МВТ = Неопределено Тогда
		МВТ = Новый МенеджерВременныхТаблиц;
	КонецЕсли; 
	
	Объект.СчетДоверительногоУправления = Неопределено;
	
	МассивПолей = СтрРазделить("Организация,Клиент", ",");
	Отбор = Новый Структура;
	
	Для каждого ИмяПоля Из МассивПолей Цикл
	
		Если ЗначениеЗаполнено(Объект[ИмяПоля]) Тогда
		
			Отбор.Вставить(ИмяПоля, Объект[ИмяПоля]);
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МВТ, Объект.Период, Отбор);
		
	ТаблицаСчетов = МВТ.Таблицы.Найти("ДействующиеСчетаДУ");
	
	ДействующиеСчета = ТаблицаСчетов.ПолучитьДанные().Выгрузить();
	
	Если ДействующиеСчета.Количество() = 1 Тогда 
		
		Объект.СчетДоверительногоУправления = ДействующиеСчета[0].Ссылка;
		
	Иначе
		
		СчетаПоВидуДоговора = ДействующиеСчета.НайтиСтроки(Новый Структура("ВидДоговораДоверительногоУправления", Объект.ВидДоговораДоверительногоУправления));
	
		Если СчетаПоВидуДоговора.Количество() = 1 Тогда
			Объект.СчетДоверительногоУправления = СчетаПоВидуДоговора[0].Ссылка;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнвестиционнуюДекларацию(РеквизитыКонтроля)

	Объект.ИнвестиционнаяДекларация = Неопределено;
	
	Если ЭтаФорма.РежимСовокукпногоКонтроля <> "Авто" И ТипЗнч(РеквизитыКонтроля) = Тип("Структура") 
		И РеквизитыКонтроля.Свойство("ИнвестиционнаяДекларация") Тогда
		Объект.ИнвестиционнаяДекларация = РеквизитыКонтроля.ИнвестиционнаяДекларация;
	КонецЕсли;
	
	Комментарий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИнвестиционнаяДекларация, "Комментарий");
	Элементы.ИнвестиционнаяДекларацияКомментарий.Видимость = ЗначениеЗаполнено(Комментарий);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостав(РеквизитыКонтроля)

	ИнвестиционнаяДекларация = Неопределено;
	Если ТипЗнч(РеквизитыКонтроля) = Тип("Структура") Тогда
		РеквизитыКонтроля.Свойство("ИнвестиционнаяДекларация", ИнвестиционнаяДекларация);
	КонецЕсли; 
	ЗаполнитьСоставСовокупнойИнвестДекларации(ИнвестиционнаяДекларация); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРСА(РеквизитыКонтроля)

	Элементы.РегистрацияСтоимостиАктивов.Видимость = Не ЭтаФорма.СовокупнаяИнвестДекларация;
	Элементы.РегистрацияСтоимостиАктивов_СЧА.Видимость = Не ЭтаФорма.СовокупнаяИнвестДекларация;
	Элементы.РегистрацияСтоимостиАктивов_РСА.Видимость = Не ЭтаФорма.СовокупнаяИнвестДекларация;
	Элементы.РегистрацияСтоимостиАктивов_КЗ.Видимость = Не ЭтаФорма.СовокупнаяИнвестДекларация;
	
	Если Не ЭтаФорма.СовокупнаяИнвестДекларация И ТипЗнч(РеквизитыКонтроля) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, РеквизитыКонтроля, "РегистрацияСтоимостиАктивов, РегистрацияСтоимостиАктивов_СЧА, РегистрацияСтоимостиАктивов_РСА, 
			|РегистрацияСтоимостиАктивов_КЗ, ИспользоватьЦелевоеЗначение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитыКонтроля(НаборДействий)

	Отказ = Ложь;
	ОбновитьРеквизитыКонтроляНаСервере(НаборДействий, Отказ);
	
	КонтрольЗаПрошлыйПериод = (НачалоДня(ТекущаяДата()) > Объект.Период);
	Объект.УчитыватьПлановыеОперации = Не (КонтрольЗаПрошлыйПериод Или ЭтаФорма.СовокупнаяИнвестДекларация);
	
	Для каждого ГруппаРезультатов Из Элементы.ГруппаРезультатыОценкиСтраницы.ПодчиненныеЭлементы Цикл
		ГруппаРезультатов.Видимость = Ложь;
	КонецЦикла; 
	
	Элементы.ИспользованыПредварительныеЦены.Видимость = Ложь;
	Элементы.ДатаМаксДД.Видимость = Ложь;
	
	Если Объект.Претрейд.Количество() > 0 И Вопрос("Очистить претрейд?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.Претрейд.Очистить();
	КонецЕсли; 
		
	ЭтаФорма.РезультатыПроверки.ПолучитьЭлементы().Очистить();
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументРезультатыКонтроля, "НЕАКТУАЛЬНОСТЬ", "Отчет не сформирован. Нажмите ""Выполнить контроль"" для получения отчета.");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументБазис, "НЕАКТУАЛЬНОСТЬ");
	
	УстановитьВидимость(ЭтаФорма);
	ОбновитьИнтерфейсПретрейда(Ложь);
	ПолучитьРезультатыКонтроляНаСервере();
	
	Элементы.ДекорацияПараметрыИндивидуальногоКонтроля.Заголовок = СтрШаблон("Контроль за: %1, %2, %3%4",
		Формат(Объект.Период, "ДФ=dd.MM.yyyy"),
		Объект.Клиент,
		Объект.ВидДоговораДоверительногоУправления,
		?(Объект.УчитыватьПлановыеОперации, " с учетом плановых операций", ""));
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьИнвестиционнуюДекларацию(Период, Организация, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия КАК Субъект
		|ПОМЕСТИТЬ _Стратегии
		|ИЗ
		|	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииСрезПоследних.Период КАК Период,
		|	ИнвестиционныеДекларацииСрезПоследних.НазначениеИнвестиционнойДекларации КАК НазначениеИнвестиционнойДекларации
		|ПОМЕСТИТЬ _ИнвестДекларации
		|ИЗ
		|	РегистрСведений.ИнвестиционныеДекларации.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Субъект = &СчетДоверительногоУправления
		|				И ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация)) КАК ИнвестиционныеДекларацииСрезПоследних
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ИнвестиционныеДекларацииСрезПоследних.Период,
		|	ИнвестиционныеДекларацииСрезПоследних.НазначениеИнвестиционнойДекларации
		|ИЗ
		|	РегистрСведений.ИнвестиционныеДекларации.СрезПоследних(
		|			&Период,
		|			(Организация, Субъект, ТипИнвестиционнойДекларации) В
		|				(ВЫБРАТЬ
		|					&Организация КАК Организация,
		|					Т.Субъект КАК Субъект,
		|					ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация) КАК ТипИнвестиционнойДекларации
		|				ИЗ
		|					_Стратегии КАК Т)) КАК ИнвестиционныеДекларацииСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	_ИнвестДекларации.Период КАК Период,
		|	НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация
		|ИЗ
		|	_ИнвестДекларации КАК _ИнвестДекларации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
		|		ПО _ИнвестДекларации.НазначениеИнвестиционнойДекларации = НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка";		
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ИнвестДекларация = Новый Структура("Период, ИнвестиционнаяДекларация"); 
	
	Если Выборка.Следующий() Тогда
		 ЗаполнитьЗначенияСвойств(ИнвестДекларация, Выборка) 
	КонецЕсли;
	 
	Возврат ИнвестДекларация;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруДокументов(Период, Организация, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Организация КАК Организация,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Период КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении) КАК ЦельРасчета
		|ПОМЕСТИТЬ _ПараметрыОтбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &КонтрольЗаПрошлыйПериод
		|			ТОГДА ЕСТЬNULL(РегистрацияСтоимостиАктивов.Ссылка, ""Документ 'Регистрация стоимости активов' не найден"")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК РегистрацияСтоимостиАктивов,
		|	ЕСТЬNULL(РегистрацияСтоимостиАктивов.СЧАРынок, 0) КАК РегистрацияСтоимостиАктивов_СЧА,
		|	ЕСТЬNULL(РегистрацияСтоимостиАктивов.РСА, 0) КАК РегистрацияСтоимостиАктивов_РСА,
		|	ЕСТЬNULL(РегистрацияСтоимостиАктивов.РСА - РегистрацияСтоимостиАктивов.СЧАРынок, 0) КАК РегистрацияСтоимостиАктивов_КЗ
		|ИЗ
		|	_ПараметрыОтбора КАК _ПараметрыОтбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
		|		ПО (РегистрацияСтоимостиАктивов.Проведен)
		|			И _ПараметрыОтбора.Организация = РегистрацияСтоимостиАктивов.Организация
		|			И _ПараметрыОтбора.СчетДоверительногоУправления = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления
		|			И (_ПараметрыОтбора.Период = НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ))
		|			И _ПараметрыОтбора.ЦельРасчета = РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки";
	
	КонтрольЗаПрошлыйПериод = НачалоДня(Период) < НачалоДня(ТекущаяДатаСеанса());
	
	ДатаФормированияСЧА = ?(КонтрольЗаПрошлыйПериод, 
		НачалоДня(Период), 
		РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(
			Организация, 
			СчетДоверительногоУправления, 
			НачалоДня(ТекущаяДатаСеанса()) - 3600*24));
	
	Запрос.УстановитьПараметр("Период", ДатаФормированияСЧА);
	Запрос.УстановитьПараметр("КонтрольЗаПрошлыйПериод", КонтрольЗаПрошлыйПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	СтруктураДокументов = Новый Структура("РегистрацияСтоимостиАктивов, РегистрацияСтоимостиАктивов_СЧА, РегистрацияСтоимостиАктивов_РСА, РегистрацияСтоимостиАктивов_КЗ");
	
	ЗаполнитьЗначенияСвойств(СтруктураДокументов, Выборка); 
		
	Возврат СтруктураДокументов;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыКонтроля(Период, Организация, СчетДоверительногоУправления)

	РеквизитыТекущейИД = ПолучитьИнвестиционнуюДекларацию(Период, Организация, СчетДоверительногоУправления);
	
	Если РеквизитыТекущейИД.ИнвестиционнаяДекларация <> Неопределено Тогда
	
		РеквизитыКонтроля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыТекущейИД.ИнвестиционнаяДекларация, "Консолидирующая, ИспользоватьЦелевоеЗначение");
		РеквизитыКонтроля.Вставить("ИнвестиционнаяДекларация", 	РеквизитыТекущейИД.ИнвестиционнаяДекларация);
		
		ДатаПроверкиСледующейИД = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), 7);
		РеквизитыНовойИД = ПолучитьИнвестиционнуюДекларацию(ДатаПроверкиСледующейИД, Организация, СчетДоверительногоУправления);
		
		Если РеквизитыТекущейИД.ИнвестиционнаяДекларация <> РеквизитыНовойИД.ИнвестиционнаяДекларация Тогда
			РеквизитыКонтроля.Вставить("ДатаПроверкиСледующейИД", РеквизитыНовойИД.Период);
		КонецЕсли; 		
		
	Иначе
		
		РеквизитыКонтроля = Новый Структура("ИнвестиционнаяДекларация, Консолидирующая, ИспользоватьЦелевоеЗначение", Неопределено, Ложь, Ложь);
	
	КонецЕсли; 
	
	РеквизитыКонтроля.Вставить("Клиент", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период));
	РеквизитыКонтроля.Вставить("ВидДоговораДоверительногоУправления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления"));
	
	СтруктураДокументов = ПолучитьСтруктуруДокументов(Период, Организация, СчетДоверительногоУправления);
	Для каждого ЭлементСтруктуры Из СтруктураДокументов Цикл
		РеквизитыКонтроля.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла; 
	
	Возврат РеквизитыКонтроля;

КонецФункции

&НаСервере
Процедура ЗаполнитьСоставСовокупнойИнвестДекларации(ИнвестиционнаяДекларация = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", НачалоДня(Объект.Период));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
		
	Если ЭтаФорма.РежимСовокукпногоКонтроля <> "Индивидуально" Тогда
		
		Если Не (ЗначениеЗаполнено(Объект.Клиент) И ЗначениеЗаполнено(Объект.ВидДоговораДоверительногоУправления)) Тогда
			Возврат;
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если НачалоДня(Объект.Период) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Запрос.УстановитьПараметр("ДатаДокумента", Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(Объект.Период) - 3600*24));
			Запрос.УстановитьПараметр("КонтрольЗаТекущийДень", Истина);
		Иначе
			Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Объект.Период));
			Запрос.УстановитьПараметр("КонтрольЗаТекущийДень", Ложь);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос.УстановитьПараметр("КлиентТрадиция", ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_Традиция"));
		Запрос.УстановитьПараметр("СчетДУАтлант", ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_DU_PIF352"));
		Запрос.УстановитьПараметр("ДоступныеОрганизации", ПолучитьДоступныеОрганизации(Объект.Организация));
		Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
		Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления", Объект.ВидДоговораДоверительногоУправления);
						
		#Область Текст_запроса
		РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(Объект.Клиент, Объект.Организация, Объект.Период, Истина, , Запрос.МенеджерВременныхТаблиц);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Включен,
			|	&Период КАК Дата,
			|	_СчетаДоверительногоУправленияКлиента.Организация КАК Организация,
			|	&Клиент КАК Клиент,
			|	_СчетаДоверительногоУправленияКлиента.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
			|ИЗ
			|	_СчетаДоверительногоУправленияКлиента КАК _СчетаДоверительногоУправленияКлиента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ПО _СчетаДоверительногоУправленияКлиента.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
			|			И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления)";
		
		ТаблицаСчетов = Запрос.Выполнить().Выгрузить();
		
		ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
		ОбработкаНаСервере.ПроверитьНастройкиПоСчетамДУ(ТаблицаСчетов);
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСчетов, "_ТаблицаСчетов", Запрос.МенеджерВременныхТаблиц);
		
		Если ЭтаФорма.РежимСовокукпногоКонтроля = "Совокупно" И ЗначениеЗаполнено(Объект.ИнвестиционнаяДекларация) Тогда
			
			Запрос.УстановитьПараметр("ИнвестиционнаяДекларация", Объект.ИнвестиционнаяДекларация);
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВЫБОР
				|		КОГДА _СоставСовокупнойИД.СчетДоверительногоУправления = &СчетДУАтлант
				|			ТОГДА &СчетДоверительногоУправления = &СчетДУАтлант
				|					ИЛИ &Период >= ДАТАВРЕМЯ(2021, 1, 1)
				|		ИНАЧЕ _СоставСовокупнойИД.Включен
				|	КОНЕЦ КАК Включен,
				|	_СоставСовокупнойИД.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	_СоставСовокупнойИД.Клиент КАК Клиент,
				|	_СоставСовокупнойИД.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
				|	СправочникСчетаДоверительногоУправления.Организация КАК Организация,
				|	СправочникСчетаДоверительногоУправления.Организация.ВалютаУчета КАК ВалютаУчета,
				|	СправочникСчетаДоверительногоУправления.КодСчета КАК КодСчета,
				|	ВЫБОР
				|		КОГДА &КонтрольЗаТекущийДень
				|			ТОГДА """"
				|		ИНАЧЕ НЕ РегистрацияСтоимостиАктивов.Ссылка ЕСТЬ NULL
				|	КОНЕЦ КАК РегистрацияСтоимостиАктивов,
				|	_СоставСовокупнойИД.СчетДоверительногоУправления.Представление КАК СчетДоверительногоУправленияПредставление,
				|	СправочникСчетаДоверительногоУправления.Организация.Представление КАК ОрганизацияПредставление,
				|	РегистрацияСтоимостиАктивов.СЧАРынок КАК СЧА,
				|	РегистрацияСтоимостиАктивов.РСА КАК РСА,
				|	ИнвестиционныеДекларации.Ссылка КАК ИнвестиционнаяДекларация,
				|	ИнвестиционныеДекларации.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
				|	1 КАК ПорядокКонтроля,
				|	ИСТИНА КАК СовокупныйКонтроль,
				|	ИнвестиционныеДекларации.Наименование + (ВЫРАЗИТЬ(ИнвестиционныеДекларации.Комментарий КАК СТРОКА(1024))) КАК ИнвестиционнаяДекларацияПредставление,
				|	ЗНАЧЕНИЕ(Документ.НазначениеИнвестиционнойДекларации.ПустаяСсылка) КАК Назначение
				|ИЗ
				|	_ТаблицаСчетов КАК _СоставСовокупнойИД
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СправочникСчетаДоверительногоУправления
				|		ПО _СоставСовокупнойИД.СчетДоверительногоУправления = СправочникСчетаДоверительногоУправления.Ссылка
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
				|		ПО (РегистрацияСтоимостиАктивов.Проведен)
				|			И (СправочникСчетаДоверительногоУправления.Организация = РегистрацияСтоимостиАктивов.Организация)
				|			И _СоставСовокупнойИД.СчетДоверительногоУправления = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления
				|			И (&ДатаДокумента = НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ))
				|			И (РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
				|		ПО (ИнвестиционныеДекларации.Ссылка = &ИнвестиционнаяДекларация)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Организация,
				|	КодСчета";
			
		Иначе // режим Авто или Совокупно без указания ИД - заполняем по актуальным ИД
			
			Запрос.Текст = РегистрыСведений.ИнвестиционныеДекларации.ПолучитьТекстЗапросаДляПолученияАктуальныхИнвестиционныхДеклараций() + "
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|"
				+ 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВЫБОР
				|		КОГДА _СоставСовокупнойИД.СчетДоверительногоУправления = &СчетДУАтлант
				|			ТОГДА &СчетДоверительногоУправления = &СчетДУАтлант
				|					ИЛИ &Период >= ДАТАВРЕМЯ(2021, 1, 1)
				|		ИНАЧЕ _ТаблицаСчетов.Включен
				|	КОНЕЦ КАК Включен,
				|	_СоставСовокупнойИД.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	_СоставСовокупнойИД.Клиент КАК Клиент,
				|	_СоставСовокупнойИД.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
				|	СчетаДоверительногоУправления.Организация КАК Организация,
				|	СчетаДоверительногоУправления.Организация.ВалютаУчета КАК ВалютаУчета,
				|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
				|	ВЫБОР
				|		КОГДА &КонтрольЗаТекущийДень
				|			ТОГДА """"
				|		ИНАЧЕ НЕ РегистрацияСтоимостиАктивов.Ссылка ЕСТЬ NULL
				|	КОНЕЦ КАК РегистрацияСтоимостиАктивов,
				|	_СоставСовокупнойИД.СчетДоверительногоУправления.Представление КАК СчетДоверительногоУправленияПредставление,
				|	СчетаДоверительногоУправления.Организация.Представление КАК ОрганизацияПредставление,
				|	РегистрацияСтоимостиАктивов.СЧАРынок КАК СЧА,
				|	РегистрацияСтоимостиАктивов.РСА КАК РСА,
				|	_СоставСовокупнойИД.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
				|	_СоставСовокупнойИД.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
				|	_СоставСовокупнойИД.ПорядокКонтроля КАК ПорядокКонтроля,
				|	_СоставСовокупнойИД.СовокупныйКонтроль КАК СовокупныйКонтроль,
				|	_СоставСовокупнойИД.ИнвестиционнаяДекларация.Наименование + (ВЫРАЗИТЬ(_СоставСовокупнойИД.ИнвестиционнаяДекларация.Комментарий КАК СТРОКА(1024))) КАК ИнвестиционнаяДекларацияПредставление,
				|	_СоставСовокупнойИД.Назначение КАК Назначение
				|ИЗ
				|	_СоставСовокупнойИД КАК _СоставСовокупнойИД
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|		ПО _СоставСовокупнойИД.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаСчетов КАК _ТаблицаСчетов
				|		ПО _СоставСовокупнойИД.Организация = _ТаблицаСчетов.Организация
				|			И _СоставСовокупнойИД.СчетДоверительногоУправления = _ТаблицаСчетов.СчетДоверительногоУправления
				|			И _СоставСовокупнойИД.Дата = _ТаблицаСчетов.Дата
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
				|		ПО (РегистрацияСтоимостиАктивов.Проведен)
				|			И (СчетаДоверительногоУправления.Организация = РегистрацияСтоимостиАктивов.Организация)
				|			И _СоставСовокупнойИД.СчетДоверительногоУправления = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления
				|			И (&ДатаДокумента = НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ))
				|			И (РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
				|
				|УПОРЯДОЧИТЬ ПО
				|	_СоставСовокупнойИД.ПорядокКонтроля,
				|	_СоставСовокупнойИД.СовокупныйКонтроль УБЫВ,
				|	Организация,
				|	_СоставСовокупнойИД.ИнвестиционнаяДекларация,
				|	КодСчета";
		
		КонецЕсли; 
		
		
		#КонецОбласти	
		
	Иначе 
		// это режим Индивидуально. Контролим один счет ДУ по одной ИД
		// ИД из регистра не получаем, т.к. на форме должна быть заполнена
		Запрос.УстановитьПараметр("ИнвестиционнаяДекларация", Объект.ИнвестиционнаяДекларация);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Включен,
			|	СправочникСчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
			|	СправочникСчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	СправочникСчетаДоверительногоУправления.Организация КАК Организация,
			|	СправочникСчетаДоверительногоУправления.Организация.ВалютаУчета КАК ВалютаУчета,
			|	СправочникСчетаДоверительногоУправления.КодСчета КАК КодСчета,
			|	СправочникСчетаДоверительногоУправления.Представление КАК СчетДоверительногоУправленияПредставление,
			|	СправочникСчетаДоверительногоУправления.Организация.Представление КАК ОрганизацияПредставление,
			|	ИнвестиционныеДекларации.Ссылка КАК ИнвестиционнаяДекларация,
			|	ИнвестиционныеДекларации.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
			|	3 КАК ПорядокКонтроля,
			|	ЛОЖЬ КАК СовокупныйКонтроль,
			|	ИнвестиционныеДекларации.Наименование + (ВЫРАЗИТЬ(ИнвестиционныеДекларации.Комментарий КАК СТРОКА(1024))) КАК ИнвестиционнаяДекларацияПредставление,
			|	ЗНАЧЕНИЕ(Документ.НазначениеИнвестиционнойДекларации.ПустаяСсылка) КАК Назначение
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СправочникСчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
			|		ПО (ИнвестиционныеДекларации.Ссылка = &ИнвестиционнаяДекларация)
			|			И (СправочникСчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ПО СправочникСчетаДоверительногоУправления.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
			|			И СправочникСчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления";
		
	КонецЕсли; 
	
	ПолныйСоставИД = Запрос.Выполнить().Выгрузить();
	
	СтруктураОтбора = Новый Структура("СовокупныйКонтроль", Истина); 
	
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		СтруктураОтбора.Вставить("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	КонецЕсли; 
	
	СовокупныйКонтроль = ПолныйСоставИД.НайтиСтроки(СтруктураОтбора);
	Если ЭтаФорма.РежимСовокукпногоКонтроля = "Авто" Тогда
		ЭтаФорма.СовокупнаяИнвестДекларация = СовокупныйКонтроль.Количество() > 0;
		Если Не СовокупнаяИнвестДекларация Тогда
			ПолныйСоставИД = ПолныйСоставИД.Скопировать(Новый Структура("СчетДоверительногоУправления, ИнвестиционнаяДекларация", Объект.СчетДоверительногоУправления, ИнвестиционнаяДекларация));
			Объект.ИнвестиционнаяДекларация = ИнвестиционнаяДекларация;
		КонецЕсли; 
	КонецЕсли; 
	
	ПоместитьВоВременноеХранилище(ПолныйСоставИД, АдресСоставаСовокупнойИнвестДекларации);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеОрганизации(ТекущаяОрганизация)

	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	
	Возврат ОбработкаНаСервере.ПолучитьДоступныеОрганизации(ТекущаяОрганизация); 

КонецФункции

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Назад(Команда)
	Элементы.ГруппаСтраницРезультов.ТекущаяСтраница = Элементы.СтраницаРезультатПроверки;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонтроль(Команда)
	
	Если Не ЭтаФорма.ВнешняяОбработка И ЭтаФорма.ВерсияДополнительногоОтчетаИлиОбработки <> АктуальнаяВерсияОбработки() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Версия Контроля ИД обновилась. Перезапустите Контроль ИД!");
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен период контроля",,"Объект.Период", , Отказ);
	КонецЕсли; 
	
	Элементы.ПретрейдИзменен.Видимость = Ложь;
	Элементы.ИспользованыПредварительныеЦены.Видимость = Ложь;
	Элементы.ДатаМаксДД.Видимость = Ложь;
	
	Если ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль" Тогда
		
		Если ЭтаФорма.СовокупнаяИнвестДекларация Тогда
			
			Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Клиент",,"Объект.Клиент", , Отказ);
			КонецЕсли; 
			Если Не ЗначениеЗаполнено(Объект.ВидДоговораДоверительногоУправления) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Вид договора доверительного управления",,"Объект.ВидДоговораДоверительногоУправления", , Отказ);
			КонецЕсли; 
			
		Иначе
			
			Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен счет доверительного управления",,"Объект.СчетДоверительногоУправления", , Отказ);
			КонецЕсли; 
			Если Не ЗначениеЗаполнено(Объект.ИнвестиционнаяДекларация) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена инвестиционная декларация",,"Объект.ИнвестиционнаяДекларация", , Отказ);
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если Не Отказ Тогда
		
			ОчиститьСообщения();
			
			ЭтаФорма.ПараметрыПроверки = Новый Структура("Период, СчетДоверительногоУправления, РежимКонтроля, РежимГрупповогоКонтроля", 
				Объект.Период,
				Объект.СчетДоверительногоУправления,
				ЭтаФорма.РежимКонтроля,
				ЭтаФорма.РежимГрупповогоКонтроля); 
			
			ЭтаФорма.РезультатыПроверки.ПолучитьЭлементы().Очистить();
			РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументРезультатыКонтроля, "ФОРМИРОВАНИЕОТЧЕТА");
					
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРезультаты;
			Элементы.ГруппаСтраницРезультов.ТекущаяСтраница = Элементы.СтраницаРезультатПроверки;
			
			Состояние("Выполняется контроль инвестиционной декларации по клиенту", , СокрЛП(Объект.СчетДоверительногоУправления), БиблиотекаКартинок.КонтрольИнвестиционныхДеклараций);
			
			Если ВыполнитьКонтрольНаСервере() Тогда
				// Отчет по базису
				Если ЭтаФорма.СовокупнаяИнвестДекларация Тогда
					РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументБазис, "НЕАКТУАЛЬНОСТЬ");
				Иначе
					
					ЭтаФорма.Базис = ПолучитьБазис(Объект.ИнвестиционнаяДекларация);
					ИспользуемыеБазисыПриИзменении(Неопределено);
					СформироватьБазис(Неопределено);					
				
				КонецЕсли; 

			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Ложь;
		
		Если Элементы.ГруппаСтраницыРежима.ТекущаяСтраница = Элементы.СтраницаГрупповойКонтроль Тогда
			ТекстСообщения = "группового контроля";
			ПараметрыОтбора = Новый Структура("Период", Объект.Период);
			НайденныеСтроки = Объект.СоставГрупповогоКонтроля.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() <> Объект.СоставГрупповогоКонтроля.Количество() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо перезаполнить состав " + ТекстСообщения,,,, Отказ);
			КонецЕсли; 
		ИначеЕсли Элементы.ГруппаСтраницыРежима.ТекущаяСтраница = Элементы.СтраницаКонтрольЗаПериод Тогда
			ТекстСообщения = "контроля за период";
			ПараметрыОтбора = Новый Структура("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
			НайденныеСтроки = Объект.СоставГрупповогоКонтроля.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() <> Объект.СоставГрупповогоКонтроля.Количество() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо перезаполнить состав " + ТекстСообщения,,,, Отказ);
			КонецЕсли; 
		КонецЕсли;
				
		Если Объект.СоставГрупповогоКонтроля.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить таблицу " + ТекстСообщения,,,, Отказ);
		КонецЕсли; 
		
		Если Не Отказ Тогда
		
			ОчиститьСообщения();
			Объект.Претрейд.Очистить();
			
			ИзменитьДоступностьЭлементов(Ложь);
			
			ВыполнитьГрупповойКонтрольФоново();
			ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьСостояниеЗаданий", ЭтаФорма.ПериодОбновления);			
		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчет(Команда)
	
	Если Элементы.ГруппаСтраницыРежима.ТекущаяСтраница = Элементы.СтраницаИндивидуальныйКонтроль Тогда
		ВывестиСводныйОтчет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСовокупнойИнвестДекларации(Команда)
	
	ПараметрыФормы = Новый Структура("АдресСоставаСовокупнойИнвестДекларации", АдресСоставаСовокупнойИнвестДекларации); 
	ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.СоставСовокупнойИнвестиционнойДекларации", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимКонтроляПриИзменении(Элемент)
	
	ЭтоИндивидуальныйКонтроль = ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль";
	Если ЭтоИндивидуальныйКонтроль Тогда
		Элементы.ГруппаСтраницыРежима.ТекущаяСтраница = Элементы.СтраницаИндивидуальныйКонтроль;
	Иначе
		
		РежимГрупповогоКонтроляПриИзменении(Неопределено);
		Если Не Элементы.ФормаВыполнитьКонтроль.Видимость Тогда
			// контроль запущен
			ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьСостояниеЗаданий", ЭтаФорма.ПериодОбновления);
		КонецЕсли; 
		
	КонецЕсли;     	
	
	Элементы.ФормаПоказатьОтчет.Видимость = ЭтоИндивидуальныйКонтроль;
	Элементы.ФормаОтчетФидуциарнаяОтветственность.Видимость = ЭтоИндивидуальныйКонтроль;
	Элементы.ФормаОтчетФидуциарнаяОтветственностьРасшифровка.Видимость = ЭтоИндивидуальныйКонтроль;
	Элементы.ФормаОтчетФидуциарнаяОтветственностьСводный.Видимость = ЭтоИндивидуальныйКонтроль;
	Элементы.ФормаВыгрузитьОтчетФидуциарнаяОтветственность.Видимость = Не ЭтоИндивидуальныйКонтроль;
	Элементы.РежимГрупповогоКонтроля.Видимость = Не ЭтоИндивидуальныйКонтроль;
	Элементы.КомандаСкрытьНастройки.Видимость = ЭтоИндивидуальныйКонтроль;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоСоставуИД(Команда)
	ОткрытьФорму("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.ФормаОтчетаПоСоставуИД",, ЭтаФорма, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетФидуциарнаяОтветственность(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Заголовок = "Укажите каталог выгрузки"; 
	
	Диалог.Показать(Новый ОписаниеОповещения("ВыгрузитьОтчетФидуциарнаяОтветственностьЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетФидуциарнаяОтветственностьЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда 
		
		Состояние("Выгрузка отчетов...");
		
		КаталогВыгрузки = Диалог.Каталог;
		Если Не СтрЗаканчиваетсяНа(КаталогВыгрузки, "\") Тогда
			КаталогВыгрузки = КаталогВыгрузки + "\";
		КонецЕсли; 
		
		Массив = ВыгрузитьОтчетыПоФидуциарнойОтветственности();
		
		Для каждого ТекЭл Из Массив Цикл
			ТекЭл.ТабличныйДокумент.Записать(КаталогВыгрузки + ТекЭл.ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		КонецЦикла; 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка завершена");
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыКонтроля

#Область ФоновоеВыполнение

&НаСервере
Процедура ВыполнитьГрупповойКонтрольФоново()

	Для каждого ТекСтрока Из Объект.СоставГрупповогоКонтроля Цикл
		ТекСтрока.ИдентификаторРезультата = Новый УникальныйИдентификатор;
		ТекСтрока.Статус	= "";
		ТекСтрока.Выполнено	= -1;
	КонецЦикла;
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Организация", 					Объект.Организация);
	ПараметрыВыполнения.Вставить("Период", 							Объект.Период);
	ПараметрыВыполнения.Вставить("УчитыватьПлановыеОперации", 		?(ЭтаФорма.РежимГрупповогоКонтроля = "ЗаПериод", Ложь, Объект.Период >= НачалоДня(ТекущаяДатаСеанса())));
	ПараметрыВыполнения.Вставить("ДинамическийРасчетСтоимости",		Объект.ДинамическийРасчетСтоимости);
	ПараметрыВыполнения.Вставить("УниакльныйИдентификаторФормы",	ЭтаФорма.УникальныйИдентификатор);
	ПараметрыВыполнения.Вставить("СоставГрупповогоКонтроля",		Объект.СоставГрупповогоКонтроля.Выгрузить(, "СчетДоверительногоУправления, ИнвестиционнаяДекларация, Клиент, ВидДоговораДоверительногоУправления,  Период, ИдентификаторРезультата"));
	ПараметрыВыполнения.Вставить("МаксимумАктивныхЗаданий",			ЭтаФорма.МаксимумАктивныхЗаданий);
	ПараметрыВыполнения.Вставить("НаименованиеЗадания",				"Контроль инвестиционвной декларации (" + ПолучитьТекущийСеансИнформационнойБазы().НомерСеанса + ")");
	
	СоставыСовокупныхИД = Неопределено;
	
	Для каждого Строка Из Объект.СоставГрупповогоКонтроля Цикл
	
		Если СоставыСовокупныхИД = Неопределено Тогда
		
			СоставыСовокупныхИД = Строка.СоставСовокупнойИнвестиционнойДекларации.Выгрузить();
			СоставыСовокупныхИД.Колонки.Добавить("ИдентификаторРезультата", Новый ОписаниеТипов("УникальныйИдентификатор"));
			СоставыСовокупныхИД.ЗаполнитьЗначения(Строка.ИдентификаторРезультата, "ИдентификаторРезультата")
			
		Иначе
			
			Для каждого СтрокаСовокупной Из Строка.СоставСовокупнойИнвестиционнойДекларации Цикл
			
				НоваяСтрока = СоставыСовокупныхИД.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСовокупной);
				НоваяСтрока.ИдентификаторРезультата = Строка.ИдентификаторРезультата;
			
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ПараметрыВыполнения.Вставить("СоставыСовокупныхИД", СоставыСовокупныхИД);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ЭтоВнешняяОбработка", Истина);
	
	ИспользуемоеИмяФайла = РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
	Если Лев(ИспользуемоеИмяФайла, 18) = "e1cib\tempstorage\" Тогда
		ПараметрыПроцедуры.Вставить("ДополнительнаяОбработкаСсылка", ПолучитьСсылкуНаВнешнююОбработку());
		ПараметрыПроцедуры.Вставить("ИмяОбработки", "_КонтрольИнвестиционныхДеклараций");
	Иначе
		ПараметрыПроцедуры.Вставить("ДополнительнаяОбработкаСсылка", Неопределено);
		ПараметрыПроцедуры.Вставить("ИмяОбработки", ИспользуемоеИмяФайла);
	КонецЕсли; 
	
	ПараметрыПроцедуры.Вставить("ИмяМетода", "ВыполнитьГрупповойКонтрольФоново");
	ПараметрыПроцедуры.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(ПараметрыВыполнения);
	ЭтаФорма.СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		"_КонтрольИнвестиционныхДеклараций.ВыполнитьГрупповойКонтрольФоново", 
		ПараметрыВыполненияДляСбораСтатистики.Хранилище, 
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	РезультатЗапуска = РаботаСДлительнымиОперациями.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"РаботаСДлительнымиОперациями.ВыполнитьПроцедуруМодуляОбъектаОбработки",
		ПараметрыПроцедуры,
		"Групповой контроль инвестиционных деклараций",
		Ложь,
		Ложь
	);
	
	ЭтаФорма.ИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеЗаданий()
	
	Если ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль" Тогда
		ОтключитьОбработчикОжидания("ПроверитьСостояниеЗаданий");
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьСостоянияЗаданийНаСервере();
	
	НезапущенныеЗадания	= Объект.СоставГрупповогоКонтроля.НайтиСтроки(Новый Структура("Статус", ""));
	НезапущенныхЗаданий	= НезапущенныеЗадания.Количество();
	
	Если НезапущенныхЗаданий = 0 Тогда 
		
		ИзменитьДоступностьЭлементов(Истина);
		
		Состояние("Выполнение группового контроля завершено",,, БиблиотекаКартинок.КонтрольИнвестиционныхДеклараций);
		ОтключитьОбработчикОжидания("ПроверитьСостояниеЗаданий");
		
		ЗарегистрироватьОкончаниеСессииСбораСтатистики(ЭтаФорма.СессияСбораСтатистики, Ложь);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементов(Доступность)

	Элементы.ФормаВыполнитьКонтроль.Видимость 				= Доступность;
	Элементы.ФормаОстановитьВыполнениеКонтроля.Видимость	= Не Доступность;
	
	Элементы.РежимГрупповогоКонтроля.Доступность 			= Доступность;
	
	Элементы.ШапкаГрупповойКонтроль.Доступность 			= Доступность;
	Элементы.ЗаполнениеСпискаГрупповойКонтроль.Доступность 	= Доступность;
	Элементы.СоставГрупповогоКонтроля.ТолькоПросмотр 		= Не Доступность;
	
	Элементы.ШапкаКонтрольЗаПериод.Доступность 				= Доступность;
	Элементы.ЗаполнениеСпискаКонтрольЗаПериод.Доступность 	= Доступность;
	Элементы.СоставКонтроляЗаПериод.ТолькоПросмотр 			= Не Доступность;
	
	Элементы.ФормаВыгрузитьОтчетФидуциарнаяОтветственность.Доступность = Доступность;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостоянияЗаданийНаСервере()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СоставГрупповогоКонтроля", Объект.СоставГрупповогоКонтроля.Выгрузить(, "ИдентификаторРезультата, Статус"));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставГрупповогоКонтроля.ИдентификаторРезультата КАК ИдентификаторРезультата
		|ПОМЕСТИТЬ _СоставГрупповогоКонтроля
		|ИЗ
		|	&СоставГрупповогоКонтроля КАК СоставГрупповогоКонтроля
		|ГДЕ
		|	(ВЫРАЗИТЬ(СоставГрупповогоКонтроля.Статус КАК СТРОКА(1024))) = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХранилищеЗначений.Идентификатор КАК Идентификатор,
		|	ХранилищеЗначений.ХранилищеЗначения КАК ХранилищеЗначения,
		|	ХранилищеЗначений.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СоставГрупповогоКонтроля КАК _СоставГрупповогоКонтроля
		|		ПО ХранилищеЗначений.Идентификатор = _СоставГрупповогоКонтроля.ИдентификаторРезультата
		|			И (ХранилищеЗначений.Источник = ""_КонтрольИнвестиционныхДеклараций"")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПроверкаПройдена = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ПроверкаПройдена;
	Нарушение = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.Нарушение;
	Пока Выборка.Следующий() Цикл
	
		ТекСтрока = Объект.СоставГрупповогоКонтроля.НайтиСтроки(Новый Структура("ИдентификаторРезультата", Выборка.Идентификатор))[0];
		
		Значение = Выборка.ХранилищеЗначения.Получить();
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			
			ТекстОшибки = "Не удалось выполнить проверку по клиенту " + ТекСтрока.СчетДоверительногоУправления + ?(ЗначениеЗаполнено(Значение), ". " + Значение, "");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			ТекСтрока.РезультатПроверки = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ОшибкаВыполненияКонтроля;
			ТекСтрока.РезультатПроверкиВн = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ОшибкаВыполненияКонтроля;
			ТекСтрока.РезультатПроверкиИтог = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ОшибкаВыполненияКонтроля;
			ТекСтрока.Гиперссылка = "";
			ТекСтрока.ОшибкиОценки = Ложь;
			ТекСтрока.Статус = "Завершено аварийно";
			ТекСтрока.ДатаПроверки = Выборка.ДатаСоздания;
			
		ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
			
			РезультатПроверкиДерева = Значение.РезультатПроверкиДерева;
			ТекСтрока.РезультатПроверки = РезультатПроверкиДерева.РезультатПроверки;
			ТекСтрока.РезультатПроверкиВн = РезультатПроверкиДерева.РезультатПроверкиВн;
			ТекСтрока.РезультатПроверкиИтог = ?(РезультатПроверкиДерева.РезультатПроверкиВн = Нарушение Или РезультатПроверкиДерева.РезультатПроверки = Нарушение, Нарушение, ПроверкаПройдена);
			ТекСтрока.Гиперссылка = "Перейти к расшифровке";
			ТекСтрока.ОшибкиОценки = Значение.ОшибкиОценки;
			ТекСтрока.Статус = "Завершено";
			ТекСтрока.ДатаПроверки = Выборка.ДатаСоздания;
			
		КонецЕсли; 
	
	КонецЦикла;  

КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаВнешнююОбработку()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = ""_КонтрольИнвестиционныхДеклараций""";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		ВызватьИсключение "Не удалось найти обработку ""Контроль инвестиционных деклараций""";
	КонецЕсли; 
	
КонецФункции
 
#КонецОбласти 

&НаСервере
Функция ВыполнитьКонтрольНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыФормирования = Новый Структура("Организация, СчетДоверительногоУправления, Период, Клиент, ВидДоговораДоверительногоУправления");
	ЗаполнитьЗначенияСвойств(ПараметрыФормирования, Объект);
	ПараметрыФормирования.Вставить("Механизм", 							"_КонтрольИнвестиционныхДеклараций.Форма.ВыполнитьКонтрольНаСервере()");
	ПараметрыФормирования.Вставить("ИнвестиционнаяДекларация", 			Объект.ИнвестиционнаяДекларация);
	ПараметрыФормирования.Вставить("УчитыватьПлановыеОперации", 		Объект.УчитыватьПлановыеОперации);
	ПараметрыФормирования.Вставить("Претрейд", 							Объект.Претрейд.Выгрузить());
	ПараметрыФормирования.Вставить("ДинамическийРасчетСтоимости",		Объект.ДинамическийРасчетСтоимости);
	ПараметрыФормирования.Вставить("СоставСовокупнойИнвестДекларации", 	ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСоставаСовокупнойИнвестДекларации));
		
	СовокупныйКонтроль = ПараметрыФормирования.СоставСовокупнойИнвестДекларации.НайтиСтроки(Новый Структура("СовокупныйКонтроль, СчетДоверительногоУправления", Истина, ПараметрыФормирования.СчетДоверительногоУправления));
	ПараметрыФормирования.Вставить("СовокупнаяИнвестДекларация", СовокупныйКонтроль.Количество() > 0);
	
	Дерево = РеквизитФормыВЗначение("РезультатыПроверки");
	ОбработкаОбъект.ПроверитьИнвестДекларацию(ПараметрыФормирования, Дерево.Строки);
	
	Отказ = Ложь;
	Если ПараметрыФормирования.Свойство("ТекстОшибки") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПараметрыФормирования.ТекстОшибки,,,, Отказ); 
		ЭтаФорма.РезультатыПроверки.ПолучитьЭлементы().Очистить();
				
	Иначе
		
		ЗначениеВРеквизитФормы(Дерево, "РезультатыПроверки");
		
		ЗаполнитьОтчетПоРезультатамКонтроляНаСервере(Дерево);
		
		СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
		СтруктураРезультатовПроверки.Вставить("РезультатыПроверки", 				Дерево);
				
		СтруктураРезультатовПроверки.Вставить("СтруктураФормированияОтчета", 		ПараметрыФормирования.СтруктураФормированияОтчета);
		СтруктураРезультатовПроверки.Вставить("ПараметрыБазисов", 					ПараметрыФормирования.ПараметрыБазисов);
		СтруктураРезультатовПроверки.Вставить("СтруктураОтчетов", 					ПараметрыФормирования.СтруктураОтчетов);
		СтруктураРезультатовПроверки.Вставить("Организация", 						ПараметрыФормирования.Организация);
		СтруктураРезультатовПроверки.Вставить("СчетДоверительногоУправления", 		ПараметрыФормирования.СчетДоверительногоУправления);
		СтруктураРезультатовПроверки.Вставить("ИнвестиционнаяДекларация", 			ПараметрыФормирования.ИнвестиционнаяДекларация);
		СтруктураРезультатовПроверки.Вставить("Период", 							ПараметрыФормирования.Период);
		СтруктураРезультатовПроверки.Вставить("ДинамическийРасчетСтоимости",		ПараметрыФормирования.ДинамическийРасчетСтоимости);
		СтруктураРезультатовПроверки.Вставить("УчитыватьПлановыеОперации",			ПараметрыФормирования.УчитыватьПлановыеОперации);
		СтруктураРезультатовПроверки.Вставить("Претрейд",							ПараметрыФормирования.Претрейд);
		СтруктураРезультатовПроверки.Вставить("СоставСовокупнойИнвестДекларации",	ПараметрыФормирования.СоставСовокупнойИнвестДекларации);
		СтруктураРезультатовПроверки.Вставить("Клиент",								ПараметрыФормирования.Клиент);
		СтруктураРезультатовПроверки.Вставить("ВидДоговораДоверительногоУправления", ПараметрыФормирования.ВидДоговораДоверительногоУправления);
		
		Если ПараметрыФормирования.Свойство("ИспользованыПредварительныеЦены") Тогда
			Элементы.ИспользованыПредварительныеЦены.Видимость = Истина;
		КонецЕсли;
		
		Если ПараметрыФормирования.Свойство("ДатаМаксДД") Тогда
			ПоказатьДекорациюДатаМаксДД(ПараметрыФормирования.ДатаМаксДД);
		КонецЕсли;
		
		ПоместитьВоВременноеХранилище(СтруктураРезультатовПроверки, ЭтаФорма.АдресСтруктурыРезультатовПроверки);
		
		ЗаполнитьТабличныйДокументЦеныПоступлений();
		ЗаполнитьТабличныйДокументОшибкиОценки();
		ЗаполнитьТабличныйДокументРазличияОценки();
		ЗаполнитьТабличныйДокументПлановыеДанные();
		ЗаполнитьТабличныйДокументЦеныТМинус2();
		
		Для каждого Группа Из Элементы.ГруппаРезультатыОценкиСтраницы.ПодчиненныеЭлементы Цикл
		
			Если Группа.Видимость Тогда
			
				Элементы.ГруппаРезультатыОценки.Показать();
				Прервать;
			
			КонецЕсли;			
		
		КонецЦикла; 
		
		ОшибкиОценки = Ложь;
		МассивТаблиц = СтрРазделить(СтрЗаменить("ТаблицаРасхожденийЦен, ТаблицаОшибокОценки, РасхожденияСтоимостейЦенныхБумаг, РасхожденияСтоимостейАктивов, ТаблицаЦенТМинус2, ТаблицаОшибокСафмар", " ", ""), ",", Ложь); 
		СтруктураОтчетов = ПараметрыФормирования.Отчеты.Получить();
		Для каждого ИмяТаблицы Из МассивТаблиц Цикл
			Если СтруктураОтчетов.Свойство(ИмяТаблицы) И ТипЗнч(СтруктураОтчетов[ИмяТаблицы]) = Тип("ТаблицаЗначений") И СтруктураОтчетов[ИмяТаблицы].Количество() > 0 Тогда
				ОшибкиОценки = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		
		РезультатПроверки = ОбработкаОбъект.ПолучитьСтруктуруРезультатаПроверки(СтруктураРезультатовПроверки, ОшибкиОценки, ОбработкаОбъект.ПолучитьРезультатПроверкиДерева(Дерево));
		РезультатПроверки.Вставить("ИспользованыПредварительныеЦены", ПараметрыФормирования.Свойство("ИспользованыПредварительныеЦены"));
		РезультатПроверки.Вставить("СовокупнаяИнвестДекларация", ЭтаФорма.СовокупнаяИнвестДекларация);
		РезультатПроверки.Вставить("РежимСовокукпногоКонтроля", ЭтаФорма.РежимСовокукпногоКонтроля);
		Если ПараметрыФормирования.Свойство("ДатаМаксДД") Тогда
			РезультатПроверки.Вставить("ДатаМаксДД", ПараметрыФормирования.ДатаМаксДД);
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("Организация, Период, Клиент, ВидДоговораДоверительногоУправления, СчетДоверительногоУправления, ИнвестиционнаяДекларация");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Объект);
		СтруктураОтбора.Вставить("СовокупнаяИнвестДекларация", ЭтаФорма.СовокупнаяИнвестДекларация);
		СтруктураОтбора.Вставить("РежимСовокукпногоКонтроля", ЭтаФорма.РежимСовокукпногоКонтроля);
		ОбработкаОбъект.ДобавитьЗаписьВХранилищеЗначений(Новый УникальныйИдентификатор, РезультатПроверки, СтруктураОтбора);
		
	КонецЕсли;
	
	ПолучитьРезультатыКонтроляНаСервере();
	
	Возврат Не Отказ;
					
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличныйДокументЦеныПоступлений() 

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	СтруктураОтчетов = СтруктураРезультатовПроверки.СтруктураОтчетов.Получить(); 
	
	ТаблицаРасхожденийЦен = Неопределено;
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("ТаблицаРасхожденийЦен", ТаблицаРасхожденийЦен);
	КонецЕсли;
	
	ТабличныйДокументЦеныПоступлений.Очистить();
	
	Если Не ТаблицаРасхожденийЦен = Неопределено И ТаблицаРасхожденийЦен.Количество() > 0 Тогда
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		Строка = Макет.ПолучитьОбласть("Строка");
	
		Элементы.ГруппаЦеныПоступлений.Видимость = Истина;
		Элементы.ГруппаЦеныПоступлений.ЦветТекстаЗаголовка = Новый Цвет;
		
		ТабличныйДокументЦеныПоступлений.Вывести(Макет.ПолучитьОбласть("Шапка"));
		
		ТаблицаРасхожденийЦен.Свернуть("Рынок, ЦеннаяБумага, ЦенаПриобретения, СправедливаяЦена, Отклонение");
		Для каждого ТекСтрока Из ТаблицаРасхожденийЦен Цикл
			
			Строка.Параметры.Заполнить(ТекСтрока);
			
			Если ТекСтрока.Отклонение >= 5 Тогда
				Элементы.ГруппаЦеныПоступлений.ЦветТекстаЗаголовка = WebЦвета.Красный;
				Строка.Область(1,,1).ЦветТекста = WebЦвета.Красный;
			Иначе
				Строка.Область(1,,1).ЦветТекста = Новый Цвет;
			КонецЕсли; 
		    
			ТабличныйДокументЦеныПоступлений.Вывести(Строка);
			
		КонецЦикла; 
			
	Иначе
		Элементы.ГруппаЦеныПоступлений.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументЦеныТМинус2() 

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	СтруктураОтчетов = СтруктураРезультатовПроверки.СтруктураОтчетов.Получить(); 
	
	ТаблицаЦенТМинус2 = Неопределено;
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("ТаблицаЦенТМинус2", ТаблицаЦенТМинус2);
	КонецЕсли;
	
	ТабличныйДокументЦеныТМинус2.Очистить();
	
	Если Не ТаблицаЦенТМинус2 = Неопределено И ТаблицаЦенТМинус2.Количество() > 0 Тогда
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		Строка = Макет.ПолучитьОбласть("СтрокаЦеныТМинус2");
	
		Элементы.ГруппаЦеныТМинус2.Видимость = Истина;
		//Элементы.ГруппаЦеныПоступлений.ЦветТекстаЗаголовка = Новый Цвет;
		
		ТабличныйДокументЦеныТМинус2.Вывести(Макет.ПолучитьОбласть("ШапкаЦеныТМинус2"));
		
		ТаблицаЦенТМинус2.Свернуть("Рынок, ЦеннаяБумага, Цена");
		Для каждого ТекСтрока Из ТаблицаЦенТМинус2 Цикл
			
			Строка.Параметры.Заполнить(ТекСтрока);
			ТабличныйДокументЦеныТМинус2.Вывести(Строка);
			
		КонецЦикла; 
			
	Иначе
		Элементы.ГруппаЦеныТМинус2.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументОшибкиОценки() 

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	СтруктураОтчетов = СтруктураРезультатовПроверки.СтруктураОтчетов.Получить(); 
	
	ТаблицаОшибокОценки = Неопределено;
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("ТаблицаОшибокОценки", ТаблицаОшибокОценки);
	КонецЕсли;
	
	ТабличныйДокументОшибкиОценки.Очистить();
	Макет = Неопределено;

	Если Не ТаблицаОшибокОценки = Неопределено И ТаблицаОшибокОценки.Количество() > 0 Тогда
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		Строка = Макет.ПолучитьОбласть("ОшибкиОценкиСтрока|ОбщиеОшибки");
		
		ТабличныйДокументОшибкиОценки.Вывести(Макет.ПолучитьОбласть("ОшибкиОценкиШапка|ОбщиеОшибки"));
		
		ТаблицаОшибокОценки.Свернуть("Базис, Набор, Рынок, ЦеннаяБумага");
		Для каждого ТекСтрока Из ТаблицаОшибокОценки Цикл
			
			Строка.Параметры.Заполнить(ТекСтрока);
			ТабличныйДокументОшибкиОценки.Вывести(Строка);
			
		КонецЦикла; 
	КонецЕсли;
	
	ТаблицаОшибокСафмар = Неопределено;
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("ТаблицаОшибокСафмар", ТаблицаОшибокСафмар);
	КонецЕсли;
	
	Если Не ТаблицаОшибокСафмар = Неопределено И ТаблицаОшибокСафмар.Количество() > 0 Тогда
		
		Если Макет = Неопределено Тогда
		
			Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		
		КонецЕсли; 
		
		Строка = Макет.ПолучитьОбласть("ОшибкиОценкиСтрока|ОшибкиСафмар");
		
		Шапка = Макет.ПолучитьОбласть("ОшибкиОценкиШапка|ОшибкиСафмар");
		Шапка.Область(2,1,2,1).Текст = "Использованы цены MerketPrice2";
		ТабличныйДокументОшибкиОценки.Вывести(Шапка);
						
		ТаблицаОшибокСафмар.Свернуть("Рынок, ЦеннаяБумага, Цена, ДатаЦены");
		Для каждого ТекСтрока Из ТаблицаОшибокСафмар Цикл
			
			Строка.Параметры.Заполнить(ТекСтрока);
			ТабличныйДокументОшибкиОценки.Вывести(Строка);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения = Неопределено;
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения", ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения);
	КонецЕсли;
	
	Если Не ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения = Неопределено И ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения.Количество() > 0 Тогда
		
		Если Макет = Неопределено Тогда
		
			Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		
		КонецЕсли;
		
		Строка = Макет.ПолучитьОбласть("СтрокаДоПогашения");
		
		Шапка = Макет.ПолучитьОбласть("ШапкаДоПогашения");
		Шапка.Область(2,1,2,1).Текст = "Ценные бумаги, классифицированные одновременно в несколько категорий";
		ТабличныйДокументОшибкиОценки.Вывести(Шапка);
						
		ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения.Свернуть("Рынок, ЦеннаяБумага");
		Для каждого ТекСтрока Из ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения Цикл
			
			Строка.Параметры.Заполнить(ТекСтрока);
			ТабличныйДокументОшибкиОценки.Вывести(Строка);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ТабличныйДокументОшибкиОценки.ВысотаТаблицы = 0 Тогда
	    Элементы.ГруппаОшибкиОценки.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОшибкиОценки.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения() 

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	СтруктураОтчетов = СтруктураРезультатовПроверки.СтруктураОтчетов.Получить(); 
	
	ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения = Неопределено;
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения", ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения);
	КонецЕсли;
	
	Если Не ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения = Неопределено И ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения.Количество() > 0 Тогда
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		Строка = Макет.ПолучитьОбласть("ОшибкиОценкиСтрока|ОбщиеОшибки");
		
		ТабличныйДокументОшибкиОценки.Вывести(Макет.ПолучитьОбласть("ОшибкиОценкиШапка|ОбщиеОшибки"));
		
		ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения.Свернуть("Базис, Набор, Рынок, ЦеннаяБумага");
		Для каждого ТекСтрока Из ЦенныеБумагиУчитываемыеОдновременноДляПродажиИДоПогашения Цикл
			
			Строка.Параметры.Заполнить(ТекСтрока);
			ТабличныйДокументОшибкиОценки.Вывести(Строка);
			
		КонецЦикла; 
	КонецЕсли;
	
	ТаблицаОшибокСафмар = Неопределено;
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("ТаблицаОшибокСафмар", ТаблицаОшибокСафмар);
	КонецЕсли;
	
	Если Не ТаблицаОшибокСафмар = Неопределено И ТаблицаОшибокСафмар.Количество() > 0 Тогда
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		Строка = Макет.ПолучитьОбласть("ОшибкиОценкиСтрока|ОшибкиСафмар");
		
		Шапка = Макет.ПолучитьОбласть("ОшибкиОценкиШапка|ОшибкиСафмар");
		Шапка.Область(1,1,1,1).Текст = "Использованы цены MerketPrice2";
		ТабличныйДокументОшибкиОценки.Вывести(Шапка);
						
		ТаблицаОшибокСафмар.Свернуть("Рынок, ЦеннаяБумага, Цена, ДатаЦены");
		Для каждого ТекСтрока Из ТаблицаОшибокСафмар Цикл
			
			Строка.Параметры.Заполнить(ТекСтрока);
			ТабличныйДокументОшибкиОценки.Вывести(Строка);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ТабличныйДокументОшибкиОценки.ВысотаТаблицы = 0 Тогда
	    Элементы.ГруппаОшибкиОценки.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОшибкиОценки.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументРазличияОценки()

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	СтруктураОтчетов = СтруктураРезультатовПроверки.СтруктураОтчетов.Получить();
	
	РасхожденияСтоимостейЦенныхБумаг = Неопределено;
	РасхожденияСтоимостейАктивов = Неопределено;
	
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		СтруктураОтчетов.Свойство("РасхожденияСтоимостейЦенныхБумаг", РасхожденияСтоимостейЦенныхБумаг);
		СтруктураОтчетов.Свойство("РасхожденияСтоимостейАктивов", РасхожденияСтоимостейАктивов);
	КонецЕсли;
	
	ТабличныйДокументРазличияОценки.Очистить();
		
	Если (Не РасхожденияСтоимостейЦенныхБумаг = Неопределено И РасхожденияСтоимостейЦенныхБумаг.Количество() > 0)
		Или (Не РасхожденияСтоимостейАктивов = Неопределено И РасхожденияСтоимостейАктивов.Количество() > 0) Тогда
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		
		Если Не РасхожденияСтоимостейЦенныхБумаг = Неопределено И РасхожденияСтоимостейЦенныхБумаг.Количество() > 0 Тогда
		
			ТабличныйДокументРазличияОценки.Вывести(Макет.ПолучитьОбласть("РазличияОценкиШапкаЦБ"));
		
			РасхожденияСтоимостейЦенныхБумаг.Свернуть("Рынок, ЦеннаяБумага, ЦенаИзДокумента, ЦенаКупонаИзДокумента, ЦенаРасчетная, ЦенаКупонаРасчетная");
			Строка = Макет.ПолучитьОбласть("РазличияОценкиСтрокаЦБ");
			Для каждого ТекСтрока Из РасхожденияСтоимостейЦенныхБумаг Цикл
				
				Строка.Параметры.Заполнить(ТекСтрока);
				ТабличныйДокументРазличияОценки.Вывести(Строка);
				
			КонецЦикла; 
		
		КонецЕсли; 
		
		Если Не РасхожденияСтоимостейАктивов = Неопределено И РасхожденияСтоимостейАктивов.Количество() > 0 Тогда
		
			ТабличныйДокументРазличияОценки.Вывести(Макет.ПолучитьОбласть("РазличияОценкиШапка"));
		
			РасхожденияСтоимостейАктивов.Свернуть("ВидАктива, СубъектАналитики, Контрагент, Основание, ВидЗадолженности, СуммаРынокВВалютеУчетаИзДокумента, СуммаРынокВВалютеУчетаРасчетная");
			Строка = Макет.ПолучитьОбласть("РазличияОценкиСтрока");
			Для каждого ТекСтрока Из РасхожденияСтоимостейАктивов Цикл
				
				Строка.Параметры.Заполнить(ТекСтрока);
				ТабличныйДокументРазличияОценки.Вывести(Строка);
				
			КонецЦикла; 
		
		КонецЕсли; 
		
		Элементы.ГруппаРазличияОценки.Видимость = Истина;
		
	Иначе
		Элементы.ГруппаРазличияОценки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументПлановыеДанные() 

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	СтруктураОтчетов = СтруктураРезультатовПроверки.СтруктураОтчетов.Получить();
	
	ТабличныйДокументПлановыеДанные.Очистить();
	
	Если ТипЗнч(СтруктураОтчетов) = Тип("Структура") Тогда
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПлановыеДанные");
		Для каждого Отчет Из СтруктураОтчетов Цикл
		    Если СтрНачинаетсяС(Отчет.Ключ, "_ПлановыеДанные_") И Отчет.Значение.Количество() > 0 Тогда
				
				НазваниеОтчета = СтрЗаменить(Отчет.Ключ, "_ПлановыеДанные_", "");
				Шапка 	= Макет.ПолучитьОбласть(НазваниеОтчета + "_Шапка");
				Строка 	= Макет.ПолучитьОбласть(НазваниеОтчета + "_Строка");
				
				ТабличныйДокументПлановыеДанные.Вывести(Шапка);
				
				Для каждого ТекСтрока Из Отчет.Значение Цикл
					Если Отчет.Ключ = "_ПлановыеДанные_ОстаткиДС" И ТекСтрока.РасчетныйСчет = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В плановых данных по остаткам денежных средств не удалось определить расчетный счет");
					КонецЕсли; 
					Строка.Параметры.Заполнить(ТекСтрока);
					ТабличныйДокументПлановыеДанные.Вывести(Строка);
				КонецЦикла; 
				
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ВыводРезультатаПроверки

&НаСервере
Процедура ВывестиСводныйОтчет(ФидуциарнаяОтветственность = Ложь, СвободныеЛимиты = Ложь, Расшифровка = Ложь)

	ЭтаФорма.ДокументРезультат = Новый ТабличныйДокумент;
	
	Если ФидуциарнаяОтветственность Тогда
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
		Шапка = Макет.ПолучитьОбласть("ШапкаФидуциарнаяОтветственность");
		Шапка.Параметры.Заполнить(ПолучитьПараметрыЗаголовка(Объект.СчетДоверительногоУправления, Объект.Период));
		ЭтаФорма.ДокументРезультат.Вывести(Шапка);
		
	Иначе
		
		ИспользуемыеБазисы = ПолучитьСписокИспользуемыхБазисов(Объект.ИнвестиционнаяДекларация);
	
		Для каждого ТекБазис Из ИспользуемыеБазисы Цикл
		
			ИспользуемыеБазисыПриИзмененииНаСервере(ТекБазис, Истина);
		
			ПараметрыФормирования = Новый Структура("Настройка, Организация, СчетДоверительногоУправления, Период, АдресДанныхРасшифровкиБазиса, АдресСКДБазиса, Базис, АдресПараметровБазисов");  
			ЗаполнитьЗначенияСвойств(ПараметрыФормирования, Объект);
			ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ЭтаФорма);
			ПараметрыФормирования.Вставить("Базис", ТекБазис);
			ПараметрыФормирования.Вставить("АвтоматическоеФормирование", Истина);
			ПараметрыФормирования.Вставить("АдресСоставаСовокупнойИнвестДекларации", ЭтаФорма.АдресСоставаСовокупнойИнвестДекларации);
			ПараметрыФормирования.Вставить("СовокупнаяИнвестДекларация", ЭтаФорма.СовокупнаяИнвестДекларация);
			ПараметрыФормирования.Вставить("ВыводитьПараметрыДанных", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
			ПараметрыФормирования.Вставить("ВыводитьЗаголовок", ТипВыводаТекстаКомпоновкиДанных.Выводить);
			ПараметрыФормирования.Вставить("Заголовок", ТекБазис.Наименование);
			
			ЭтаФорма.ДокументРезультат.Вывести(ПолучитьТабличныйДокументБазиса(ПараметрыФормирования));
		
		КонецЦикла; 
	
	КонецЕсли; 
	
	Если СвободныеЛимиты Тогда
		Отчет = ПолучитьОтчетПоСведнымЛимитам(ПолучитьСвободныеЛимиты(), Макет, Расшифровка);
	Иначе
		Отчет = ПолучитьТабличныйДокумент("", 0, "", ФидуциарнаяОтветственность);
	КонецЕсли; 
	
	ЭтаФорма.ДокументРезультат.Вывести(Отчет);
	Элементы.ДокументРезультат.ТекущаяОбласть = ЭтаФорма.ДокументРезультат.Область(1, 1);
	Элементы.ГруппаСтраницРезультов.ТекущаяСтраница = Элементы.СтраницаРасшифровка;

КонецПроцедуры

&НаСервере
Функция ПолучитьСвободныеЛимиты()

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	Если Не СтруктураРезультатовПроверки.Свойство("СтруктураФормированияОтчета") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала необходимо выполнить контроль");
		Возврат Неопределено;
	КонецЕсли; 
	Структура = СтруктураРезультатовПроверки.СтруктураФормированияОтчета.Получить();
	Настройки = Структура.Настройки;
	МассивУдаляемыхЭлементовСтруктуры = Новый Массив;
	
	ИсключаемыеЗаголовки = СтрРазделить("Дельта (руб)", ",", Ложь);
	СписокДоступныхПолей = СтрРазделить("Основные.ВидАктива,Основные.Эмитент,Основные.Актив,ЦенныеБумаги.КатегорияОблигации,ЦенныеБумаги.ПодкатегорияОблигации,Основные.ГоловнаяОрганизация," +
		"Показатели.Сумма,Показатели.СуммаПоРЕПО,Показатели.СуммаБезРЕПО,ЦенныеБумаги.Количество,ЦенныеБумаги.КоличествоПоРЕПО,ЦенныеБумаги.КоличествоСвободные,СвязанныеЛицаГруппыКомпаний.Родитель," +
		"ДоляСумма,ДоляСуммаПоРЕПО,ДоляСуммаБезРЕПО,ДоляДоляКоличество,ДоляКоличествоПоРЕПО,ДоляКоличествоСвободные,СвязанныеЛицаИнфинитум.Родитель", ",", Ложь);
	Для Индекс = 0 По СписокДоступныхПолей.ВГраница() Цикл
		СписокДоступныхПолей[Индекс] = Новый ПолеКомпоновкиДанных(СписокДоступныхПолей[Индекс]);
	КонецЦикла; 
	ПолеКоличество = Новый ПолеКомпоновкиДанных("ЦенныеБумаги.Количество");
					
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ТаблицаПоказателей = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеКонтролируемыхПоказателей("Основной");
	
	МассивРезультатов = Новый Массив;
	
	ОписаниеТиповЦенныеБумаги = Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип;
	ОписаниеТиповДенежныеСуммы = Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип;

	ТаблицаЛимитов = Новый ТаблицаЗначений;
	ТаблицаЛимитов.Колонки.Добавить("ВидАктива", Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
	ТаблицаЛимитов.Колонки.Добавить("Актив", ОписаниеТиповЦенныеБумаги);
	ТаблицаЛимитов.Колонки.Добавить("Эмитент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	ТаблицаЛимитов.Колонки.Добавить("Набор", Новый ОписаниеТипов("Строка"));
	ТаблицаЛимитов.Колонки.Добавить("Сумма", ОписаниеТиповДенежныеСуммы);
	ТаблицаЛимитов.Колонки.Добавить("МаксимальныйЛимит", ОписаниеТиповДенежныеСуммы);
	ТаблицаЛимитов.Колонки.Добавить("СвободныйЛимит", ОписаниеТиповДенежныеСуммы);
	
	Для каждого СтрокаРезультатыПроверки Из СтруктураРезультатовПроверки.РезультатыПроверки.Строки Цикл
	
		ИмяВложенногоОбъекта = СтрокаРезультатыПроверки.ИмяВложенногоОбъекта;
		НомерБазиса = СтрокаРезультатыПроверки.НомерБазиса;
		ИмяПоляДоля = СтрокаРезультатыПроверки.ИмяПоляДоля;
		ИмяПоказателя = ТаблицаПоказателей.Найти(СтрокаРезультатыПроверки.КонтролируемыйПоказатель, "Представление");
		
		Для каждого ВложенныйОбъект Из Настройки.Структура Цикл
		
			//Если ВложенныйОбъект.Имя = ИмяВложенногоОбъекта И Не СтрЗаканчиваетсяНа(ВложенныйОбъект.Имя, "_Пустая") Тогда
			// не пропускаем пустые для корректной работы наборов в дефолтными или не торгуемыми бумагами
			Если ВложенныйОбъект.Имя = ИмяВложенногоОбъекта Или ВложенныйОбъект.Имя = ИмяВложенногоОбъекта + " Пустая" Тогда
				
				Если СтрНачинаетсяС(ВложенныйОбъект.ИдентификаторОбъекта, "ВложеннаяСхема_") И СтрНайти(ВложенныйОбъект.ИдентификаторОбъекта, "_ДоляСумма") > 0 Тогда
				
					НастройкиВложенногоОтчета = ВложенныйОбъект.Настройки;
					НастройкиВложенногоОтчета.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
					
					НайденСвободныйЛимит = Ложь;
					НайденоКоличество = Ложь;
					
					Для каждого ПолеВыбора Из НастройкиВложенногоОтчета.Выбор.Элементы Цикл
						
						Если НайденСвободныйЛимит И НайденоКоличество Тогда
							ПолеВыбора.Использование = Ложь;
						Иначе
							Если ЗначениеЗаполнено(ПолеВыбора.Заголовок) Тогда
								ПолеВыбора.Использование = (ИсключаемыеЗаголовки.Найти(ПолеВыбора.Заголовок) = Неопределено);
								НайденСвободныйЛимит = НайденСвободныйЛимит Или ПолеВыбора.Заголовок = "Свободный лимит (руб)";
							Иначе
								ПолеВыбора.Использование = (СписокДоступныхПолей.Найти(ПолеВыбора.Поле) <> Неопределено);
								НайденоКоличество = НайденоКоличество Или ПолеВыбора.Поле = ПолеКоличество;
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
					
					ВложеннаяСКД = Структура.СКД.ВложенныеСхемыКомпоновкиДанных.Найти(ВложенныйОбъект.ИдентификаторОбъекта);
					Результат = ОбработкаОбъект.ПолучитьРезультатКомпоновки(ВложеннаяСКД.Схема, ВложенныйОбъект.Настройки, Структура.ВнешниеНаборыДанных, Истина);
					
					ИмяПоляМаксимальныйЛимит = "";
					ИмяПоляСвободныйЛимит = "";
					
					Для каждого ПользовательскоеПоле Из ВложенныйОбъект.Настройки.ПользовательскиеПоля.Элементы Цикл
						
						Если ПользовательскоеПоле.Заголовок = "Максимальный лимит" Тогда
							ИмяПоляМаксимальныйЛимит = СтрЗаменить(ПользовательскоеПоле.ПутьКДанным, ".", "");
						ИначеЕсли ПользовательскоеПоле.Заголовок = "Свободный лимит" Тогда
							ИмяПоляСвободныйЛимит = СтрЗаменить(ПользовательскоеПоле.ПутьКДанным, ".", "");
						КонецЕсли;
						
					КонецЦикла; 
					
					Для каждого СтрокаПервогоУровня Из Результат Цикл
						Для каждого СтрокаТаблицы Из СтрокаПервогоУровня.Строки Цикл
						
							Если ЗначениеЗаполнено(СтрокаТаблицы.ОсновныеАктив) И ОписаниеТиповЦенныеБумаги.СодержитТип(ТипЗнч(СтрокаТаблицы.ОсновныеАктив)) Тогда
							
								НоваяСтрока = ТаблицаЛимитов.Добавить();
								НоваяСтрока.ВидАктива 	= РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(СтрокаТаблицы.ОсновныеАктив);
								НоваяСтрока.Актив 		= СтрокаТаблицы.ОсновныеАктив;
								НоваяСтрока.Эмитент 	= СтрокаТаблицы.ОсновныеЭмитент;
								НоваяСтрока.Набор 		= ВложенныйОбъект.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок")).Значение;
								НоваяСтрока.Сумма 		= СтрокаПервогоУровня[СтрЗаменить(ИмяПоказателя.ПутьКДанным, ".", "")];//СтрокаПервогоУровня.ПоказателиСумма;
								НоваяСтрока.МаксимальныйЛимит 	= СтрокаПервогоУровня[ИмяПоляМаксимальныйЛимит];
								НоваяСтрока.СвободныйЛимит 		= СтрокаПервогоУровня[ИмяПоляСвободныйЛимит];
							
							КонецЕсли;								
						
						КонецЦикла; 
					КонецЦикла;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Возврат ТаблицаЛимитов;

КонецФункции

Функция ПолучитьОтчетПоСведнымЛимитам(ТаблицаЛимитов, Макет, Расшифровка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЛимитов", ТаблицаЛимитов);
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("Расшифровка", Расшифровка);
	
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЛимитов.ВидАктива КАК ВидАктива,
		|	ТаблицаЛимитов.Актив КАК Актив,
		|	ТаблицаЛимитов.Эмитент КАК Эмитент,
		|	ТаблицаЛимитов.Набор КАК Набор,
		|	ТаблицаЛимитов.Сумма КАК Сумма,
		|	ТаблицаЛимитов.МаксимальныйЛимит КАК МаксимальныйЛимит,
		|	ТаблицаЛимитов.СвободныйЛимит КАК СвободныйЛимит
		|ПОМЕСТИТЬ _ТаблицаЛимитов
		|ИЗ
		|	&ТаблицаЛимитов КАК ТаблицаЛимитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаЛимитов.ВидАктива КАК ВидАктива,
		|	_ТаблицаЛимитов.Актив КАК Актив,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Эмитент,
		|	_ТаблицаЛимитов.Набор КАК Набор,
		|	_ТаблицаЛимитов.Сумма КАК Сумма,
		|	_ТаблицаЛимитов.МаксимальныйЛимит КАК МаксимальныйЛимит,
		|	_ТаблицаЛимитов.СвободныйЛимит КАК СвободныйЛимит
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ТаблицаЛимитов КАК _ТаблицаЛимитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ТаблицаЛимитов.Эмитент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.ВидАктива КАК ВидАктива,
		|	_ИтоговаяТаблица.Актив КАК Актив,
		|	_ИтоговаяТаблица.Эмитент КАК Эмитент,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(_ИтоговаяТаблица.СвободныйЛимит) < 0
		|			ТОГДА 0
		|		ИНАЧЕ МИНИМУМ(_ИтоговаяТаблица.СвободныйЛимит)
		|	КОНЕЦ КАК СвободныйЛимит
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|ГДЕ
		|	НЕ &Расшифровка
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.Актив,
		|	_ИтоговаяТаблица.Эмитент,
		|	_ИтоговаяТаблица.ВидАктива
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидАктива,
		|	Эмитент,
		|	Актив
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.ВидАктива КАК ВидАктива,
		|	_ИтоговаяТаблица.Актив КАК Актив,
		|	_ИтоговаяТаблица.Эмитент КАК Эмитент,
		|	_ИтоговаяТаблица.Набор КАК Набор,
		|	_ИтоговаяТаблица.Сумма КАК Сумма,
		|	_ИтоговаяТаблица.МаксимальныйЛимит КАК МаксимальныйЛимит,
		|	_ИтоговаяТаблица.СвободныйЛимит КАК СвободныйЛимит
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|ГДЕ
		|	&Расшифровка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидАктива,
		|	Эмитент,
		|	Актив,
		|	СвободныйЛимит
		|АВТОУПОРЯДОЧИВАНИЕ";			
	#КонецОбласти 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ОбластьШапкаОбщие = Макет.ПолучитьОбласть("ШапкаТаблицыФидуциарнаяОтветственность|ОбщиеРеквизиты");
	ОбластьШапкаСвободныйЛимит = Макет.ПолучитьОбласть("ШапкаТаблицыФидуциарнаяОтветственность|СвободныйЛимит");
	ОбластьСтрокаОбщие = Макет.ПолучитьОбласть("СтрокаТаблицыФидуциарнаяОтветственность|ОбщиеРеквизиты");
	ОбластьСтрокаСвободныйЛимит = Макет.ПолучитьОбласть("СтрокаТаблицыФидуциарнаяОтветственность|СвободныйЛимит");
	
	Отчет = Новый ТабличныйДокумент;
	
	Отчет.Вывести(ОбластьШапкаОбщие);
	
	Если Расшифровка Тогда
		Результат = МассивРезультатов[МассивРезультатов.ВГраница()];
		ОбластьШапкаРасшифровка = Макет.ПолучитьОбласть("ШапкаТаблицыФидуциарнаяОтветственность|Расшифровка");
		ОбластьСтрокаРасшифровка = Макет.ПолучитьОбласть("СтрокаТаблицыФидуциарнаяОтветственность|Расшифровка");
		ОбластьШапкаРасшифровка.Параметры.МаксимальныйЛимит = "Максимальный лимит";
		ОбластьШапкаРасшифровка.Параметры.Сумма = "Сумма";
		Отчет.Присоединить(ОбластьШапкаРасшифровка);
	Иначе
		Результат = МассивРезультатов[МассивРезультатов.ВГраница()-1];
	КонецЕсли; 
	
	Отчет.Присоединить(ОбластьШапкаСвободныйЛимит);
	
	Выборка = Результат.Выбрать();
	
	ТекАктив = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрокаОбщие.Параметры.Заполнить(Выборка);
		
		Если Расшифровка И ТекАктив <> Выборка.Актив И ТекАктив <> Неопределено Тогда
		    Отчет.ЗакончитьГруппуСтрок();
		КонецЕсли; 
		
		Отчет.Вывести(ОбластьСтрокаОбщие);
		
		Если Расшифровка Тогда
			
			ОбластьСтрокаРасшифровка.Параметры.Заполнить(Выборка);
			Отчет.Присоединить(ОбластьСтрокаРасшифровка);
			
			Если ТекАктив <> Выборка.Актив Тогда
				ТекАктив = Выборка.Актив;
				Отчет.НачатьГруппуСтрок(Выборка.Актив);
			КонецЕсли; 
			
		КонецЕсли; 
		
		ОбластьСтрокаСвободныйЛимит.Параметры.Заполнить(Выборка);
		Отчет.Присоединить(ОбластьСтрокаСвободныйЛимит);
		
	КонецЦикла; 
	
	Если Расшифровка Тогда
		Отчет.ЗакончитьГруппуСтрок();
	КонецЕсли;

	Возврат Отчет;
	
КонецФункции

&НаКлиенте
Процедура ОтчетФидуциарнаяОтветственность(Команда)
	
	ВывестиСводныйОтчет(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетФидуциарнаяОтветственностьСводный(Команда)
	ВывестиСводныйОтчет(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетФидуциарнаяОтветственностьРасшифровка(Команда)
	ВывестиСводныйОтчет(Истина, Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРасшифровку(ИмяВложенногоОбъекта = "", НомерБазиса = 0, ИмяПоляДоля = "")

	ЭтаФорма.ДокументРезультат = ПолучитьТабличныйДокумент(ИмяВложенногоОбъекта, НомерБазиса, ИмяПоляДоля);
	Элементы.ДокументРезультат.ТекущаяОбласть = ЭтаФорма.ДокументРезультат.Область(1, 1);
	Элементы.ГруппаСтраницРезультов.ТекущаяСтраница = Элементы.СтраницаРасшифровка;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокумент(ИмяВложенногоОбъекта, НомерБазиса, ИмяПоляДоля, ФидуциарнаяОтветственность = Ложь)

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	Структура = СтруктураРезультатовПроверки.СтруктураФормированияОтчета.Получить();
	
	Настройки = Структура.Настройки;
	МассивУдаляемыхЭлементовСтруктуры = Новый Массив;
	
	Для каждого ВложенныйОбъект Из Настройки.Структура Цикл
		
		Использование = Ложь;
		
		Если ИмяВложенногоОбъекта = "" И Не Прав(ВложенныйОбъект.Имя, 6) = "Пустая" Тогда
			Использование = Истина;
		Иначе
			Если ЗначениеЗаполнено(НомерБазиса) И 
				(СтрЗаменить(ВложенныйОбъект.Имя, " Пустая", "") = Строка(ИмяВложенногоОбъекта)
					Или ВложенныйОбъект.Имя = "ВложеннаяСхема_" + НомерБазиса) Тогда
			
				Использование = Истина;
			
			КонецЕсли;
		КонецЕсли;
		
		Если Использование И ФидуциарнаяОтветственность Тогда
			
			Использование = (СтрНачинаетсяС(ВложенныйОбъект.ИдентификаторОбъекта, "ВложеннаяСхема_") И СтрЗаканчиваетсяНа(ВложенныйОбъект.ИдентификаторОбъекта, "_ДоляСумма") 
				И Не СтрНачинаетсяС(ВложенныйОбъект.Имя, "ВложеннаяСхема_"));
		КонецЕсли; 
		
		ВложенныйОбъект.Использование = Использование;
		Если Не Использование Тогда
			МассивУдаляемыхЭлементовСтруктуры.Добавить(ВложенныйОбъект);
		КонецЕсли; 
	
	КонецЦикла; 
	
	Для каждого ВложенныйОбъект Из МассивУдаляемыхЭлементовСтруктуры Цикл
		Настройки.Структура.Удалить(ВложенныйОбъект);
	КонецЦикла; 
	
	Если ФидуциарнаяОтветственность Тогда
		
		ИсключаемыеЗаголовки = СтрРазделить("Дельта (руб)", ",", Ложь);
		СписокДоступныхПолей = СтрРазделить("Основные.ВидАктива,Основные.Эмитент,Основные.Актив,ЦенныеБумаги.КатегорияОблигации,ЦенныеБумаги.ПодкатегорияОблигации,Основные.ГоловнаяОрганизация," +
			"Показатели.Сумма,Показатели.СуммаПоРЕПО,Показатели.СуммаБезРепоРЕПО,ЦенныеБумаги.Количество,ЦенныеБумаги.КоличествоПоРЕПО,ЦенныеБумаги.КоличествоСвободные,СвязанныеЛицаГруппыКомпаний.Родитель," +
			"ДоляСумма,ДоляСуммаПоРЕПО,ДоляСуммаБезРепоРЕПО,ДоляДоляКоличество,ДоляКоличествоПоРЕПО,ДоляКоличествоСвободные,СвязанныеЛицаИнфинитум.Родитель", ",", Ложь);
		Для Индекс = 0 По СписокДоступныхПолей.ВГраница() Цикл
			СписокДоступныхПолей[Индекс] = Новый ПолеКомпоновкиДанных(СписокДоступныхПолей[Индекс]);
		КонецЦикла; 
		ПолеКоличество = Новый ПолеКомпоновкиДанных("ЦенныеБумаги.Количество");
		Для каждого Отчет Из Настройки.Структура Цикл
			НастройкиВложенногоОтчета = Отчет.Настройки;
			НайденСвободныйЛимит = Ложь;
			НайденоКоличество = Ложь;
			Для каждого ПолеВыбора Из НастройкиВложенногоОтчета.Выбор.Элементы Цикл
				Если НайденСвободныйЛимит И НайденоКоличество Тогда
					ПолеВыбора.Использование = Ложь;
				Иначе
					Если ЗначениеЗаполнено(ПолеВыбора.Заголовок) Тогда
						ПолеВыбора.Использование = (ИсключаемыеЗаголовки.Найти(ПолеВыбора.Заголовок) = Неопределено);
						НайденСвободныйЛимит = НайденСвободныйЛимит Или ПолеВыбора.Заголовок = "Свободный лимит (руб)";
					Иначе
						ПолеВыбора.Использование = (СписокДоступныхПолей.Найти(ПолеВыбора.Поле) <> Неопределено);
						НайденоКоличество = НайденоКоличество Или ПолеВыбора.Поле = ПолеКоличество;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если НайтиПолеКомпоновкиДанных(НастройкиВложенногоОтчета.Структура[0].ПоляГруппировки.Элементы, "Служебные.ОбщийИтог") Тогда
				Для каждого ПолеГруппировки Из НастройкиВложенногоОтчета.Структура[0].Структура[0].ПоляГруппировки.Элементы Цикл
					ПолеГруппировки.Использование = (СписокДоступныхПолей.Найти(ПолеГруппировки.Поле) <> Неопределено);
				КонецЦикла; 
			Иначе
				НастройкиВложенногоОтчета.Структура[0].Структура[0].Использование = Ложь;
			КонецЕсли; 
			НастройкиВложенногоОтчета.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
			
			Для каждого УО Из Настройки.УсловноеОформление.Элементы Цикл
				ЗначениеПараметра = УО.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветФона"));
				Если ЗначениеПараметра.Использование Тогда
					ЗначениеПараметра.Использование = Ложь;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли; 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.ПолучитьРезультатКомпоновки(Структура.СКД, Настройки, Структура.ВнешниеНаборыДанных, Ложь);
	
	//СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	СтруктураРезультатовПроверки.Вставить("ДанныеРасшифровки", Результат.ДанныеРасшифровки);
	ПоместитьВоВременноеХранилище(СтруктураРезультатовПроверки, ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	Возврат Результат.ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЗаголовка(СчетДоверительногоУправления, Период)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыЗаголовка = Новый Структура;
	ПараметрыЗаголовка.Вставить("ДатаОтчета", Формат(Период, "ДФ=dd.MM.yyyy"));
	
	Если Выборка.Следующий() Тогда
		
		ПараметрыЗаголовка.Вставить("Клиент", Выборка.КраткоеНаименованиеПоУставу);
		ПараметрыЗаголовка.Вставить("Договор", "№" + Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
			
	КонецЕсли; 
	
	Возврат ПараметрыЗаголовка;

КонецФункции

&НаСервереБезКонтекста
Функция НайтиПолеКомпоновкиДанных(Коллекция, ПутьКДанным)

	Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным);
	Для каждого ЭлементКоллекции Из Коллекция Цикл
		Если ЭлементКоллекции.Поле = Поле Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Ложь;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРасшифровки(АдресВХарилище, Расшифровка)

	Значение = ПолучитьИзВременногоХранилища(АдресВХарилище);
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
	    // расшифровка результатов проверки
		ДанныеРасшифровки = Значение.ДанныеРасшифровки;
	Иначе
		// расшифровка отчета по базису
		ДанныеРасшифровки = Значение;
	КонецЕсли; 
	
	Возврат ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

КонецФункции

&НаКлиенте
Процедура Подключаемый_ДокументРезультатПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, ДокументРезультат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_ДокументРезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры
 
&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = РаботаСБухгалтерскимиОтчетами.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ДокументРезультат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьОтчетыПоФидуциарнойОтветственности()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИдентификаторов", Объект.СоставГрупповогоКонтроля.Выгрузить(, "Период,ИдентификаторРезультата,СчетДоверительногоУправления"));
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИдентификаторов.Период КАК Период,
		|	ТаблицаИдентификаторов.ИдентификаторРезультата КАК ИдентификаторРезультата,
		|	ТаблицаИдентификаторов.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ТаблицаИдентификаторов
		|ИЗ
		|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаИдентификаторов.Период КАК Период,
		|	_ТаблицаИдентификаторов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ХранилищеЗначений.ХранилищеЗначения КАК ХранилищеЗначения
		|ИЗ
		|	_ТаблицаИдентификаторов КАК _ТаблицаИдентификаторов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
		|		ПО _ТаблицаИдентификаторов.ИдентификаторРезультата = ХранилищеЗначений.Идентификатор
		|			И ХранилищеЗначений.Источник = ""_КонтрольИнвестиционныхДеклараций""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";		
	#КонецОбласти 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
	
		Значение = Выборка.ХранилищеЗначения.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
		
			ПоместитьВоВременноеХранилище(Значение, ЭтаФорма.АдресСтруктурыРезультатовПроверки);
			
			Объект.Период = Выборка.Период;
			Объект.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
			
			ТабличныйДокумент = Новый ТабличныйДокумент;
	
			Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
			Шапка = Макет.ПолучитьОбласть("ШапкаФидуциарнаяОтветственность");
			Шапка.Параметры.Заполнить(ПолучитьПараметрыЗаголовка(Объект.СчетДоверительногоУправления, Объект.Период));
			ТабличныйДокумент.Вывести(Шапка);
			ТабличныйДокумент.Вывести(ПолучитьОтчетПоСведнымЛимитам(ПолучитьСвободныеЛимиты(), Макет, Ложь));
			
			ИмяФайла = Строка(Выборка.СчетДоверительногоУправления) + "_" + Формат(Выборка.Период, "ДФ=yyyyMMdd") + ".xlsx";
			Структура = Новый Структура;
			Структура.Вставить("ИмяФайла", ИмяФайла);
			Структура.Вставить("ТабличныйДокумент", ТабличныйДокумент);
			Массив.Добавить(Структура);
						
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначенияЗаполненияНесоответствиеИД(ПараметрыЗаполнения)

	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
	
	Структура = СтруктураРезультатовПроверки.СтруктураФормированияОтчета.Получить();
	
	Настройки = ПолучитьНастройкиФормированияОтчета(Структура, ПараметрыЗаполнения.ИмяВложенногоОбъекта, ПараметрыЗаполнения.НомерБазиса, Ложь, Истина);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СоставНабора = ОбработкаОбъект.ПолучитьРезультатКомпоновки(Структура.СКД, Настройки, Структура.ВнешниеНаборыДанных, Истина);
	
	СтруктураДокумент = Новый Структура("Дата, Организация, ИнвестиционнаяДекларация, ИдентификаторСтрокиПоказателей");
	
	ЗаполнитьЗначенияСвойств(СтруктураДокумент, ПараметрыЗаполнения); 
	
	СовокупныйКонтроль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаполнения.ИнвестиционнаяДекларация, "СовокупныйКонтроль");
	
	Если СовокупныйКонтроль Тогда
		СтруктураДокумент.Вставить("Субъект", ПараметрыЗаполнения.Субъект);
		СтруктураДокумент.Вставить("ВидДоговораДоверительногоУправления", ПараметрыЗаполнения.ВидДоговораДоверительногоУправления);
	Иначе
		СтруктураДокумент.Вставить("Субъект", ПараметрыЗаполнения.Субъект);	
	КонецЕсли; 
	
	СтруктураДокумент.Вставить("СоставНабора", Новый Массив);
	
	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить("ОсновныеВидАктива");
	ИменаКолонок.Добавить("ОсновныеАктив");
	ИменаКолонок.Добавить("ОсновныеДатаПоследнейПокупки");
	ИменаКолонок.Добавить("ЦенныеБумагиКоличество");
	ИменаКолонок.Добавить("РезультатПроверки");
	
	ИмяКолонкиГруппа = "";
	
	Для каждого СтрокаУровень1 Из СоставНабора Цикл
	
		Если Не СтрокаУровень1.РезультатПроверки Тогда
		
			Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
				
				Если ИмяКолонкиГруппа = "" Тогда
				
					Для каждого Колонка Из СтрокаУровень2.Владелец().Колонки Цикл
					
						Если ИменаКолонок.Найти(Колонка.Имя) = Неопределено Тогда
							
							ИмяКолонкиГруппа = Колонка.Имя;
							Прервать;
							
						КонецЕсли; 
					
					КонецЦикла; 
				
				КонецЕсли; 
				
				СтрокаСостава = Новый Структура;
				СтрокаСостава.Вставить("ВидАктива", 					СтрокаУровень2.ОсновныеВидАктива);
				СтрокаСостава.Вставить("СчетДоверительногоУправления", 	СтрокаУровень2.СлужебныеСчетДоверительногоУправленияСсылка);
				СтрокаСостава.Вставить("Актив", 						СтрокаУровень2.ОсновныеАктив);
				СтрокаСостава.Вставить("Классификация", 				СтрокаУровень2.ЦенныеБумагиКлассификация);
				СтрокаСостава.Вставить("ДатаПоследнейПокупки",			СтрокаУровень2.ОсновныеДатаПоследнейПокупки);
				СтрокаСостава.Вставить("Количество", 					СтрокаУровень2.ЦенныеБумагиКоличество);
				СтрокаСостава.Вставить("Группа", 						СтрокаУровень1[ИмяКолонкиГруппа]);
				
				СтруктураДокумент.СоставНабора.Добавить(СтрокаСостава);
			
			КонецЦикла;			
		
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат СтруктураДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьНастройкиФормированияОтчета(Структура, ИмяВложенногоОбъекта, НомерБазиса, ФидуциарнаяОтветственность, ТолькоДетальныеЗаписи = Ложь)

	Настройки = Структура.Настройки;
	МассивУдаляемыхЭлементовСтруктуры = Новый Массив;
	
	МассивПолейГруппировки = Новый Массив;
	МассивПолейГруппировки.Добавить("Основные.ВидАктива");
	МассивПолейГруппировки.Добавить("Основные.Актив");
	МассивПолейГруппировки.Добавить("Основные.ДатаПоследнейПокупки");
	МассивПолейГруппировки.Добавить("ЦенныеБумаги.Классификация");
	МассивПолейГруппировки.Добавить("Служебные.СчетДоверительногоУправленияСсылка");
	
	Для каждого ВложенныйОбъект Из Настройки.Структура Цикл
		
		Использование = Ложь;
		
		Если ИмяВложенногоОбъекта = "" И Не Прав(ВложенныйОбъект.Имя, 6) = "Пустая" Тогда
			Использование = Истина;
		Иначе
			Если ЗначениеЗаполнено(НомерБазиса) И 
				(СтрЗаменить(ВложенныйОбъект.Имя, " Пустая", "") = Строка(ИмяВложенногоОбъекта)
					Или ВложенныйОбъект.Имя = "ВложеннаяСхема_" + НомерБазиса) Тогда
			
				Использование = Истина;
			
			КонецЕсли;
		КонецЕсли;
		
		Если Использование Тогда
			
			Если ФидуциарнаяОтветственность Тогда
			
				Использование = (СтрНачинаетсяС(ВложенныйОбъект.ИдентификаторОбъекта, "ВложеннаяСхема_") И СтрЗаканчиваетсяНа(ВложенныйОбъект.ИдентификаторОбъекта, "_ДоляСумма") 
					И Не СтрНачинаетсяС(ВложенныйОбъект.Имя, "ВложеннаяСхема_"));				
			
			КонецЕсли; 
				
			Если ТолькоДетальныеЗаписи Тогда
				
				// оставляем только схемы по выбранному набору
				Использование = СтрЗаменить(ВложенныйОбъект.Имя, " Пустая", "") = Строка(ИмяВложенногоОбъекта);
				
				Если Использование Тогда
				
					ВложенныйОбъект.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("РасположениеИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
					
					ВложенныйОбъект.Настройки.Выбор.Элементы.Очистить();
					
					НовоеПоле = ВложенныйОбъект.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("РезультатПроверки");
					
					НовоеПоле = ВложенныйОбъект.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦенныеБумаги.Количество");
					
					ЭлементПорядка = ВложенныйОбъект.Настройки.Порядок.Элементы.Вставить(0, Тип("ЭлементПорядкаКомпоновкиДанных"));
					ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("РезультатПроверки");
					
					ВложеннаяГруппировка = ВложенныйОбъект.Настройки.Структура[0].Структура[0];
					ВложеннаяГруппировка.ПоляГруппировки.Элементы.Очистить();
					
					Для каждого Поле Из МассивПолейГруппировки Цикл
					
						НовоеПоле = ВложеннаяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
						НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(Поле);					
												
					КонецЦикла;
					
				КонецЕсли; 
				
			КонецЕсли; 	

		КонецЕсли; 
		
		ВложенныйОбъект.Использование = Использование;
		Если Не Использование Тогда
			МассивУдаляемыхЭлементовСтруктуры.Добавить(ВложенныйОбъект);
		КонецЕсли; 
	
	КонецЦикла; 
	
	Для каждого ВложенныйОбъект Из МассивУдаляемыхЭлементовСтруктуры Цикл
		Настройки.Структура.Удалить(ВложенныйОбъект);
	КонецЦикла; 
	
	Возврат Настройки;

КонецФункции 
 

#КонецОбласти 

#Область ОтчетПоБазису

#Область ОтчетПоБазису_СобытияЭлементов

&НаКлиенте
Процедура ИнвестиционнаяДекларацияПриИзменении(Элемент)
	
	ЭтаФорма.Базис = Неопределено;
	Элементы.РезультатыПроверкиИнвестиционнаяДекларация.Видимость = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИнвестиционнаяДекларация, "Консолидирующая");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументБазис, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументРезультатыКонтроля, "НЕАКТУАЛЬНОСТЬ", "Отчет не сформирован. Нажмите ""Выполнить контроль"" для получения отчета.");
	ЭтаФорма.РезультатыПроверки.ПолучитьЭлементы().Очистить();
	ЭтаФорма.ИспользоватьЦелевоеЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИнвестиционнаяДекларация, "ИспользоватьЦелевоеЗначение");
	
	НаборДействий = Новый Массив;
	НаборДействий.Добавить("ЗаполнитьСостав");
	ОбновитьРеквизитыКонтроля(НаборДействий);
	
	//ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ИспользуемыеБазисыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ИнвестиционнаяДекларация) Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Ссылка", ПолучитьСписокИспользуемыхБазисов(Объект.ИнвестиционнаяДекларация));
		ПараметрыФормы = Новый Структура("Отбор", Отбор);
		ОткрытьФормуМодально("Справочник.БазисыКонтроляИнвестиционныхДеклараций.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемыеБазисыПриИзменении(Элемент)
	ИспользуемыеБазисыПриИзмененииНаСервере(ЭтаФорма.Базис);
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументБазисПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(ТабличныйДокументБазис.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ДокументРезультатБазисПриАктивизацииОбластиПодключаемый", 0.2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпактныйВариантОтчетаПоБазисуПриИзменении(Элемент)
	ИспользуемыеБазисыПриИзмененииНаСервере(ЭтаФорма.Базис);
КонецПроцедуры

#КонецОбласти 

#Область ОтчетПоБазису_Команды

&НаКлиенте
Процедура СформироватьБазис(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Базис) Тогда
	
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументБазис, "ФОРМИРОВАНИЕОТЧЕТА");
		ПараметрыФормирования = Новый Структура("Настройка, Организация, СчетДоверительногоУправления, Период, АдресДанныхРасшифровкиБазиса, АдресСКДБазиса, Базис, АдресПараметровБазисов");  
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, Объект);
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ЭтаФорма);
		ПараметрыФормирования.Вставить("АвтоматическоеФормирование", Команда = Неопределено);
		ПараметрыФормирования.Вставить("АдресСоставаСовокупнойИнвестДекларации", ЭтаФорма.АдресСоставаСовокупнойИнвестДекларации);
		ПараметрыФормирования.Вставить("СовокупнаяИнвестДекларация", ЭтаФорма.СовокупнаяИнвестДекларация);
		
		ТабличныйДокументБазис = ПолучитьТабличныйДокументБазиса(ПараметрыФормирования);
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументБазис, "НЕИСПОЛЬЗОВАТЬ");
		
		//// !!!!!!
		//Файл = Новый Файл("\\am-1c00\Виктор\КИД\");
		//Если Файл.Существует() Тогда
		//
		//	ХМЛ = ПолучитьХМЛ();
		//	ЗаписьТекста = Новый ЗаписьТекста("\\am-1c00\Виктор\КИД\НастройкиБазиса.xml");
		//	ЗаписьТекста.Записать(ХМЛ.Настройки);
		//	ЗаписьТекста.Закрыть();
		//	ЗаписьТекста = Новый ЗаписьТекста("\\am-1c00\Виктор\КИД\СхемаБазиса.xml");
		//	ЗаписьТекста.Записать(ХМЛ.Схема);
		//	ЗаписьТекста.Закрыть();			
		//
		//КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	
	Если ЗначениеЗаполнено(Базис) И ЭтоАдресВременногоХранилища(АдресСКДБазиса) И ЭтоАдресВременногоХранилища(АдресНастроекБазиса) Тогда
	
		ПараметрыФормы = Новый Структура("АдресСКДБазиса, АдресНастроекБазиса, Базис", АдресСКДБазиса, АдресНастроекБазиса, Базис);
		Результат = ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.НастройкиКомпоновкиБазиса", ПараметрыФормы);
		Если Результат <> Неопределено Тогда
			СформироватьБазис(Ложь);
		КонецЕсли;		
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОтчетПоБазису_Служебные

&НаСервере
Функция ПолучитьТабличныйДокументБазиса(ПараметрыФормирования)
	
	Базис = ПараметрыФормирования.Базис;
	//Настройки = ПараметрыФормирования.КомпоновщикНастроек.ПолучитьНастройки();	
	Настройки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресНастроекБазиса);
	СКД = ПолучитьИзВременногоХранилища(ПараметрыФормирования.АдресСКДБазиса);
	
	ПараметрыБазиса = Новый Структура;
	Для каждого ПараметрСКД Из Настройки.ПараметрыДанных.Элементы Цикл
		Если ПараметрСКД.Использование Тогда
			ПараметрыБазиса.Вставить(ПараметрСКД.Параметр, ПараметрСКД.Значение);
		КонецЕсли; 
	КонецЦикла; 
	
	ПараметрыБазиса.Вставить("Организация", ПараметрыФормирования.СчетДоверительногоУправления.Организация);
	ПараметрыБазиса.Вставить("СчетДоверительногоУправления", ПараметрыФормирования.СчетДоверительногоУправления);
	ПараметрыБазиса.Вставить("Период", КонецДня(ПараметрыФормирования.Период));
	ПараметрыБазиса.Вставить("грПериод", Новый Граница(КонецДня(ПараметрыФормирования.Период), ВидГраницы.Включая));
	ПараметрыБазиса.Вставить("Претрейд", Объект.Претрейд.Выгрузить());
	ПараметрыБазиса.Вставить("КонтрольЗаПрошлыйПериод", 	НачалоДня(ТекущаяДатаСеанса()) > НачалоДня(ПараметрыФормирования.Период));
	ПараметрыБазиса.Вставить("УчитыватьПлановыеОперации", 	Объект.УчитыватьПлановыеОперации);
	ПараметрыБазиса.Вставить("ДинамическийРасчетСтоимости",	Объект.ДинамическийРасчетСтоимости);
		
	Если ПараметрыФормирования.СовокупнаяИнвестДекларация Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
			
	Если ПараметрыФормирования.АвтоматическоеФормирование Тогда
		ПараметрыБазисов = СтруктураРезультатовПроверки.ПараметрыБазисов.Получить();
		Если ТипЗнч(ПараметрыБазисов) = Тип("Соответствие") Тогда
			ПараметрыБазиса = ПараметрыБазисов[Базис];
		Иначе
			КлючПараметров = Новый Структура("Базис, ИспользоватьМинимальноеЗначениеРейтинга", Базис, Объект.ИнвестиционнаяДекларация.ИспользоватьМинимальноеЗначениеРейтинга);
			НайденныеСтроки = ПараметрыБазисов.НайтиСтроки(КлючПараметров);
			Если НайденныеСтроки.Количество() <> 0 Тогда
				ПараметрыБазиса = НайденныеСтроки[0].Параметры;
			КонецЕсли; 
		КонецЕсли;
		ТаблицаБазиса = ПараметрыБазиса.ТаблицаБазиса;
	Иначе	
		ТаблицаБазиса = Неопределено;
		Для каждого СтрокаСовокупнойИД Из ПолучитьИзВременногоХранилища(ПараметрыФормирования.АдресСоставаСовокупнойИнвестДекларации) Цикл
			Если СтрокаСовокупнойИД.Включен Тогда
				
				ЦельРасчета 						= Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
				НастройкиОценки 					= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыФормирования.Период, СтрокаСовокупнойИД.Организация, СтрокаСовокупнойИД.СчетДоверительногоУправления, ЦельРасчета, Истина);
				ЦельРасчетаИнвестДекларация 		= Справочники.ЦелиРасчета.КонтрольИнвестиционнойДекларации;
				ВидУчета 							= НастройкиОценки.ВидУчетаДляОстатковПартий;
				ВариантРасчетаОценочнойСтоимости 	= НастройкиОценки.ВариантРасчетаОценочнойСтоимости;
				
				ВыполнятьРасчетПоУказаниюЦБ			= НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316;
				ВестиРасчетПоПартиям				= НастройкиОценки.ВестиРасчетПоПартиям ИЛИ ВыполнятьРасчетПоУказаниюЦБ;
				
				ИспользованаМетодикаРасчетаПоНовойСхеме =
					Не ВестиРасчетПоПартиям
					И Не ВыполнятьРасчетПоУказаниюЦБ
					И Справочники.ВариантыРасчетаОценочнойСтоимости.ИспользованаМетодикаРасчетаПоНовойСхеме(ЦельРасчета, ВариантРасчетаОценочнойСтоимости);	
					
				ПараметрыБазиса.Вставить("ВестиРасчетПоПартиям", 							ВестиРасчетПоПартиям);
				ПараметрыБазиса.Вставить("ВыполнятьРасчетПоУказаниюЦБ5419", 				ВыполнятьРасчетПоУказаниюЦБ);
				ПараметрыБазиса.Вставить("ИспользованаМетодикаРасчетаПоНовойСхеме", 		ИспользованаМетодикаРасчетаПоНовойСхеме);
				ПараметрыБазиса.Вставить("СписыватьПриПолномПогашенииВМоментПогашения", 	БухгалтерскийУчет.ОпределитьНастройкуУчета(ПараметрыФормирования.Период, СтрокаСовокупнойИД.Организация, СтрокаСовокупнойИД.СчетДоверительногоУправления, "СписыватьПриПолномПогашенииВМоментПогашения"));
				
				ПараметрыБазиса.Вставить("СчетДоверительногоУправления", 		СтрокаСовокупнойИД.СчетДоверительногоУправления);
				ПараметрыБазиса.Вставить("Организация", 						СтрокаСовокупнойИД.Организация);
				                                                     
				ПараметрыБазиса.Вставить("ВидУчета", 							ВидУчета);
				ПараметрыБазиса.Вставить("ЦельРасчета", 						ЦельРасчета);
				ПараметрыБазиса.Вставить("ЦельРасчетаИнвестДекларация", 		ЦельРасчетаИнвестДекларация);
				ПараметрыБазиса.Вставить("ВариантРасчетаОценочнойСтоимости", 	ВариантРасчетаОценочнойСтоимости);
				ПараметрыБазиса.Вставить("ВалютаУчета", 						СтрокаСовокупнойИД.ВалютаУчета);
				ПараметрыБазиса.Вставить("РасчетПартий", 						Неопределено);
				ПараметрыБазиса.Вставить("МенеджерВременныхТаблиц", 			Неопределено);
				ПараметрыБазиса.Вставить("ТаблицаСЧА", 							Неопределено);   
				
				ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
				
				ПараметрыБазиса.Вставить("ПараметрыПолученияТаблицыПлановыхОпераций", ОбработкаНаСервере.ПолучитьПараметрыПолученияТаблицыПлановыхОпераций(
					ПараметрыФормирования.Период, 
					СтрокаСовокупнойИД.Организация, 
					СтрокаСовокупнойИД.СчетДоверительногоУправления));
					
				ТаблицаБазисаПоСчетуДУ = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьДанныеБазиса(Базис.НаборДанных, ПараметрыБазиса, Базис.РежимПолученияБазы).ТаблицаБазиса;
				
				Если ТаблицаБазиса = Неопределено Тогда
					ТаблицаБазиса = ТаблицаБазисаПоСчетуДУ.Скопировать();
					ТаблицаБазиса.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("Строка"));
					ТаблицаБазиса.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка"));
					ТаблицаБазиса.Колонки.Добавить("Организация", Новый ОписаниеТипов("Строка"));
					ТаблицаБазиса.ЗаполнитьЗначения(СтрокаСовокупнойИД.СчетДоверительногоУправленияПредставление, "СчетДоверительногоУправления");
					ТаблицаБазиса.ЗаполнитьЗначения(СтрокаСовокупнойИД.КодСчета, "КодСчета");
					ТаблицаБазиса.ЗаполнитьЗначения(СтрокаСовокупнойИД.ОрганизацияПредставление, "Организация");
				Иначе
					Для каждого ТекСтрока Из ТаблицаБазисаПоСчетуДУ Цикл
						НоваяСтрока = ТаблицаБазиса.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
						НоваяСтрока.СчетДоверительногоУправления = СтрокаСовокупнойИД.СчетДоверительногоУправления;
						НоваяСтрока.КодСчета = СтрокаСовокупнойИД.КодСчета;
						НоваяСтрока.Организация = СтрокаСовокупнойИД.ОрганизацияПредставление;
					КонецЦикла; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли; 
	
	ТаблицаПолей = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеПолейБазиса(Базис.НаборДанных);		
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаБазиса", ТаблицаБазиса);
	
	//!!!!!
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ПараметрыБазиса.Организация);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ПараметрыБазиса.СчетДоверительногоУправления);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ПараметрыБазиса.Период);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("грПериод", ПараметрыБазиса.грПериод);
	
	Если СКД.ПоляИтога.Количество() = 0 Тогда
		Для каждого ОписаниеПоля Из ТаблицаПолей Цикл
			
			Если ОписаниеПоля.Ресурс Тогда
			
				ПолеИтога = СКД.ПоляИтога.Добавить();
				ПолеИтога.Выражение = "Сумма(" + ОписаниеПоля.ПутьКДанным + ")";
				ПолеИтога.ПутьКДанным = ОписаниеПоля.ПутьКДанным;
			
			КонецЕсли;
			
		КонецЦикла;
		
		//ПолеИтога = СКД.ПоляИтога.Добавить();
		//ПолеИтога.Выражение = "Минимум(Рейтинги.Приоритет)";
		//ПолеИтога.ПутьКДанным = "Рейтинги.Приоритет";
		//
		//ПолеИтога = СКД.ПоляИтога.Добавить();
		//ПолеИтога.Выражение = "Минимум(Рейтинги.ПриоритетДоп)";
		//ПолеИтога.ПутьКДанным = "Рейтинги.ПриоритетДоп";
		
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Если ПараметрыФормирования.Свойство("ВыводитьПараметрыДанных") Тогда
		Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьПараметрыДанных", ПараметрыФормирования.ВыводитьПараметрыДанных);
	КонецЕсли; 
	Если ПараметрыФормирования.Свойство("ВыводитьЗаголовок") Тогда
		Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", ПараметрыФормирования.ВыводитьЗаголовок);
	КонецЕсли; 
	Если ПараметрыФормирования.Свойство("Заголовок") Тогда
		Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ПараметрыФормирования.Заголовок);
	КонецЕсли; 
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ПараметрыФормирования.АдресДанныхРасшифровкиБазиса);
	
	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокИспользуемыхБазисов(Настройка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|ГДЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка = &Настройка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИнвестиционныеДекларацииПоказатели.Базис.Наименование";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

&НаСервере
Процедура ИспользуемыеБазисыПриИзмененииНаСервере(Базис, КомпактныйВариант = Ложь)
	
	СКДХранилище = Базис.ХранилищеСКД;
	Попытка
		СКД = СКДХранилище.Получить();
	Исключение
		ВызватьИсключение "Не удалось получить СКД базиса";
	КонецПопытки;
	НастройкиХранилище = Базис.ХранилищеНастроек;
	Попытка
		Настройки = НастройкиХранилище.Получить();
	Исключение
		ВызватьИсключение "Не удалось получить настройки базиса";
	КонецПопытки;
	
	//Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("АвтоПозицияРесурсов", АвтоПозицияРесурсовКомпоновкиДанных.НеИспользовать);
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("МакетОформления", "МакетОформленияОтчетовЗеленый");
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("РасположениеРеквизитов", РасположениеРеквизитовКомпоновкиДанных.Отдельно);
	
	ТаблицаПолей = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеПолейБазиса(Базис.НаборДанных);		
	КоличествоПолейПорядка = 0;
	Для каждого ОписаниеПоля Из ТаблицаПолей Цикл
		
		Если Не ЭтаФорма.СовокупнаяИнвестДекларация И 
			(ОписаниеПоля.Поле = "СчетДоверительногоУправления"
			Или ОписаниеПоля.Поле = "Организация"
			Или ОписаниеПоля.Поле = "КодСчета") Тогда
			Продолжить;
		КонецЕсли; 
		
		ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ОписаниеПоля.ПутьКДанным);
		
		Если КоличествоПолейПорядка < 4 Тогда
		
			ПолеПорядок = Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ПолеПорядок.Поле = ПолеВыбор.Поле;
			
			КоличествоПолейПорядка = КоличествоПолейПорядка + 1;
		
		КонецЕсли; 
		
	КонецЦикла; 

	НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	Если ЭтаФорма.КомпактныйВариантОтчетаПоБазису Или КомпактныйВариант Тогда
		
		ПолеГруппировкиВидАктива = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировкиВидАктива.Поле = Новый ПолеКомпоновкиДанных("Основные.ВидАктива");
		
		НоваяВложеннаяГруппировка = НоваяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		
		ПолеГруппировкиЭмитент = НоваяВложеннаяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировкиЭмитент.Поле = Новый ПолеКомпоновкиДанных("Основные.Эмитент");
		
		ПолеГруппировкиАктив = НоваяВложеннаяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировкиАктив.Поле = Новый ПолеКомпоновкиДанных("Основные.Актив");
		
		НоваяВложеннаяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НоваяВложеннаяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	КонецЕсли; 
	
	НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	// оформление ПогашениеКупона
	ЭлементУОПогашениеКупона = Настройки.УсловноеОформление.Элементы.Добавить();

	ОтборУОПогашениеКупона = ЭлементУОПогашениеКупона.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУОПогашениеКупона.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Служебные.ПогашениеКупона");
	ОтборУОПогашениеКупона.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборУОПогашениеКупона.ПравоеЗначение 	= Истина;
	
	ОтборУОПогашениеКупона = ЭлементУОПогашениеКупона.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУОПогашениеКупона.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Основные.ВидАктива");
	ОтборУОПогашениеКупона.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборУОПогашениеКупона.ПравоеЗначение 	= "Облигации";
	
	ЭлементУОПогашениеКупона.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоГрифельноСиний);
	
	ЭлементУОПогашениеКупона.ИспользоватьВИерархическойГруппировке 	= ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать;
	ЭлементУОПогашениеКупона.ИспользоватьВГруппировке 				= ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать;
	ЭлементУОПогашениеКупона.ИспользоватьВЗаголовке 				= ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	ЭлементУОПогашениеКупона.ИспользоватьВЗаголовкеПолей 			= ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	ЭлементУОПогашениеКупона.ИспользоватьВОтборе 					= ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	ЭлементУОПогашениеКупона.ИспользоватьВПараметрах 				= ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	
	//ЭлементУОПогашениеКупона.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ЦенныеБумаги.ОтсутствуетСтоимостьПереоценки");
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма.АдресСКДБазиса) Тогда
		ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.АдресСКДБазиса);
	Иначе
		ЭтаФорма.АдресСКДБазиса = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли; 
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма.АдресНастроекБазиса) Тогда
		ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.АдресНастроекБазиса);
	Иначе
		ЭтаФорма.АдресНастроекБазиса = ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументБазис, "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаБазисВКонтекстеНаСервере()
	
	ПолеСуммаБазис = РаботаСБухгалтерскимиОтчетами.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ТабличныйДокументБазис, КэшВыделеннойОбластиБазис);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДокументРезультатБазисПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСуммаБазис, ТабличныйДокументБазис, КэшВыделеннойОбластиБазис, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаБазисВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_ДокументРезультатБазисПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазис(ИнвестиционнаяДекларация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИнвестиционныеДекларацииПоказатели.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|ГДЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнвестиционныеДекларацииПоказатели.Базис
		|
		|УПОРЯДОЧИТЬ ПО
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИнвестиционныеДекларацииПоказатели.НомерСтроки) УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", ИнвестиционнаяДекларация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Базис;
	КонецЕсли;

КонецФункции

#КонецОбласти 
	
#КонецОбласти 

#Область Претрейд

&НаКлиенте
Процедура ОбновитьИнтерфейсПретрейда(ПретрейдИзменен)

	КонтрольЗаПрошлыйПериод = (НачалоДня(ТекущаяДата()) > Объект.Период);
	ПретрейдЗаПрошлыйПериод = КонтрольЗаПрошлыйПериод И Объект.Претрейд.Количество() > 0;
	
	Элементы.ГруппаПретрейд.ЦветТекстаЗаголовка = ?(ПретрейдЗаПрошлыйПериод, WebЦвета.Красный, Новый Цвет);
	Элементы.ПрошлыйПериод.Видимость = ПретрейдЗаПрошлыйПериод;
	Элементы.ПретрейдИзменен.Видимость = ПретрейдИзменен;
	
	Элементы.ПлановыеДанные_Включить.Видимость = Не КонтрольЗаПрошлыйПериод;

	Объект.УчитыватьПлановыеОперации = Не (КонтрольЗаПрошлыйПериод Или ЭтаФорма.СовокупнаяИнвестДекларация);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПретрейдПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
	
		Отказ = Не Элемент.ТекущиеДанные.ЭтоПретрейд;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПретрейдПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
	
		ОткрытьФормуРедактированияСтрокиПретрейда(Элемент, Истина);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПретрейдВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуРедактированияСтрокиПретрейда(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияСтрокиПретрейда(Элемент, НоваяСтрока = Ложь)

	ПараметрыФормы = Новый Структура("ЭтоПретрейд, ВидАктива, БрокерРасчетныйСчет, Депозит, ЮрФизЛицо, Валюта, ЦеннаяБумага, ВидОперации, Рынок, Количество, 
		|Цена, Купон, Сумма, СуммаДС, Представление, Классификация, ДатаПогашенияДепозита, СчетДоверительногоУправления,
		|ДатаВторойЧастиРЕПО, СтавкаРЕПО, МестоХранения, СделкаСЦентральнымКонтрагентом, Дюрация"); 
		
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Элемент.ТекущиеДанные);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Период", Объект.Период);
	ПараметрыФормы.Вставить("СовокупнаяИнвестДекларация", ЭтаФорма.СовокупнаяИнвестДекларация);
	
	Если НоваяСтрока Тогда
	
		Элемент.ТекущиеДанные.ЭтоПретрейд = Истина;
		ПараметрыФормы.ЭтоПретрейд = Истина;
		ПараметрыФормы.ВидОперации = 1;
		ПараметрыФормы.СчетДоверительногоУправления = Объект.СчетДоверительногоУправления;
		ПараметрыФормы.СделкаСЦентральнымКонтрагентом = Истина;
	
	КонецЕсли;
	
	Результат = ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.РедактированиеСтрокиПретрейда", ПараметрыФормы);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, Результат);
		ОбновитьИнтерфейсПретрейда(Истина)
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПретрейдПриИзменении(Элемент)
	ОбновитьИнтерфейсПретрейда(Истина)
КонецПроцедуры

&НаКлиенте
Процедура ПретрейдСохранить(Команда)
	
	АдресПретрейда = ПоместитьПретрейдВоВременноеХранилищеНаСервере();
	
	РаботаСФормамиКлиент.СохранитьНастройкиИзВременногоХранилищаВХранилищеВариантовИНастроекОтчетов(ЭтаФорма.ИмяФормы, ЭтаФорма.КлючТекущихНастроек, АдресПретрейда);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьПретрейдВоВременноеХранилищеНаСервере()
	Возврат ПоместитьВоВременноеХранилище(Объект.Претрейд.Выгрузить(), ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура ПретрейдЗагрузить(Команда)
	
	ОписаниеНастроек = РаботаСФормамиКлиент.ПоместитьНастройкиИзХранилищаВариантовИНастроекОтчетовВоВременноеХранилище(ЭтаФорма.ИмяФормы, ЭтаФорма.КлючТекущихНастроек, ЭтаФорма.УникальныйИдентификатор);
	
	Если ОписаниеНастроек <> Неопределено Тогда
		
		ПретрейдЗагрузитьНаСервере(ОписаниеНастроек.АдресНастроекВоВременномХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПретрейдЗагрузитьНаСервере(АдресПретрейда)

	Претрейд = ПолучитьИзВременногоХранилища(АдресПретрейда);
	
	УдалитьИзВременногоХранилища(АдресПретрейда);
	
	Если ТипЗнч(Претрейд) <> Тип("ТаблицаЗначений") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения настроек.");
		Возврат;
	КонецЕсли;
	
	Объект.Претрейд.Загрузить(Претрейд);
	ВалютаУчета = Объект.Организация.ВалютаУчета;
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Для каждого Строка Из Объект.Претрейд Цикл
	
		Если ЗначениеЗаполнено(Строка.ЦеннаяБумага) Тогда
			
			ВалютаНоминала = Строка.ЦеннаяБумага.ВалютаНоминала;
			НоминалВВалюте = (ВалютаНоминала <> ВалютаУчета);
			ТочностьОкругления = ?(НоминалВВалюте, 4, 2);
			
			Купон = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(Строка.ЦеннаяБумага, Объект.Период, Объект.СчетДоверительногоУправления,, ТочностьОкругления);
			
			Если НоминалВВалюте Тогда
				Купон = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Купон, ВалютаНоминала, Объект.Организация, Объект.Период);
			КонецЕсли; 
			
			Строка.Купон 	= Купон;
			Строка.Сумма 	= Строка.Количество * (Строка.Цена + Строка.Купон);
			
		КонецЕсли; 
		
		Строка.Представление = ОбъектНаСервере.ПолучитьПредставлениеСтрокиПретрейда(Строка);
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПретрейдЗагрузитьИзExcel(Команда)
	
	ПараметрыФормы = Новый Структура("СчетДоверительногоУправления, Период");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
	МассивСтрок = ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.ФормаЗагрузкиПретрейда", ПараметрыФормы);
	Если ТипЗнч(МассивСтрок) = Тип("Массив") Тогда
		ЗагрузитьВводыВыводыВПретрейд(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВводыВыводыВПретрейд(МассивСтрок)

	ТаблицаПретрейда = Новый ТаблицаЗначений;
	ТаблицаПретрейда.Колонки.Добавить("Код", Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
	ТаблицаПретрейда.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	ТаблицаПретрейда.Колонки.Добавить("Цена", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
	ТаблицаПретрейда.Колонки.Добавить("Купон", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТаблицаПретрейда.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.БрокерскиеКомпании"));
	МассивТипов.Добавить(Тип("СправочникСсылка.БанковскиеСчета"));
	ТаблицаПретрейда.Колонки.Добавить("БрокерРасчетныйСчет", Новый ОписаниеТипов(МассивТипов));
	
	Для каждого ЭлементМассива Из МассивСтрок Цикл
	    ЗаполнитьЗначенияСвойств(ТаблицаПретрейда.Добавить(), ЭлементМассива);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПретрейда", ТаблицаПретрейда);
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПретрейда.Код КАК Код,
		|	ТаблицаПретрейда.Количество КАК Количество,
		|	ТаблицаПретрейда.Цена КАК Цена,
		|	ТаблицаПретрейда.Купон КАК Купон,
		|	ТаблицаПретрейда.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаПретрейда.БрокерРасчетныйСчет КАК БрокерРасчетныйСчет
		|ПОМЕСТИТЬ _ТаблицаПретрейда
		|ИЗ
		|	&ТаблицаПретрейда КАК ТаблицаПретрейда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаПретрейда.Код КАК Код,
		|	ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследних.Объект, ЕСТЬNULL(Акции.Ссылка, ЕСТЬNULL(Облигации.Ссылка, ЕСТЬNULL(ИпотечныеСертификатыУчастия.Ссылка, НЕОПРЕДЕЛЕНО)))) КАК ЦеннаяБумага,
		|	_ТаблицаПретрейда.Количество КАК Количество,
		|	_ТаблицаПретрейда.Цена КАК Цена,
		|	_ТаблицаПретрейда.Купон КАК Купон,
		|	ИСТИНА КАК ЭтоПретрейд,
		|	ЛОЖЬ КАК НеУчитывать,
		|	""Ценные бумаги"" КАК ВидАктива,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	ВЫБОР
		|		КОГДА _ТаблицаПретрейда.БрокерРасчетныйСчет = НЕОПРЕДЕЛЕНО
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВидОперации,
		|	ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.ПустаяСсылка) КАК Депозит,
		|	"""" КАК Представление,
		|	ВЫБОР
		|		КОГДА _ТаблицаПретрейда.БрокерРасчетныйСчет = НЕОПРЕДЕЛЕНО
		|			ТОГДА 0
		|		ИНАЧЕ -_ТаблицаПретрейда.Количество * (_ТаблицаПретрейда.Цена + _ТаблицаПретрейда.Купон)
		|	КОНЕЦ КАК СуммаДС,
		|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК ЮрФизЛицо,
		|	_ТаблицаПретрейда.Количество * (_ТаблицаПретрейда.Цена + _ТаблицаПретрейда.Купон) КАК Сумма,
		|	ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, 0) КАК Номинал,
		|	Облигации.ВалютаНоминала КАК ВалютаНоминала,
		|	_ТаблицаПретрейда.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ТаблицаПретрейда.БрокерРасчетныйСчет КАК БрокерРасчетныйСчет
		|ПОМЕСТИТЬ _ПретрейдВрем
		|ИЗ
		|	_ТаблицаПретрейда КАК _ТаблицаПретрейда
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _ТаблицаПретрейда.Код = КодыВТорговыхСистемахСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО _ТаблицаПретрейда.Код = Акции.ГосударственныйРегистрационныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ТаблицаПретрейда.Код = Облигации.ГосударственныйРегистрационныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|		ПО _ТаблицаПретрейда.Код = ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО (НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага = ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследних.Объект, Облигации.Ссылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ПретрейдВрем.Код КАК Код,
		|	_ПретрейдВрем.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПретрейдВрем.Количество КАК Количество,
		|	_ПретрейдВрем.Цена КАК Цена,
		|	_ПретрейдВрем.Купон КАК Купон,
		|	_ПретрейдВрем.ЭтоПретрейд КАК ЭтоПретрейд,
		|	_ПретрейдВрем.НеУчитывать КАК НеУчитывать,
		|	_ПретрейдВрем.ВидАктива КАК ВидАктива,
		|	_ПретрейдВрем.Валюта КАК Валюта,
		|	_ПретрейдВрем.ВидОперации КАК ВидОперации,
		|	_ПретрейдВрем.Депозит КАК Депозит,
		|	_ПретрейдВрем.Представление КАК Представление,
		|	_ПретрейдВрем.СуммаДС КАК СуммаДС,
		|	_ПретрейдВрем.ЮрФизЛицо КАК ЮрФизЛицо,
		|	_ПретрейдВрем.Сумма КАК Сумма,
		|	_ПретрейдВрем.Номинал КАК Номинал,
		|	_ПретрейдВрем.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
		|	_ПретрейдВрем.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПретрейдВрем.БрокерРасчетныйСчет КАК БрокерРасчетныйСчет
		|ИЗ
		|	_ПретрейдВрем КАК _ПретрейдВрем";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
	
	Пока Выборка.Следующий() Цикл
			
		НоваяСтрока = Объект.Претрейд.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(НоваяСтрока.ЦеннаяБумага);
		
		Если НоваяСтрока.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
			
			Если НоваяСтрока.Купон = 0 Или НоваяСтрока.Цена = 0 Тогда
			
				НоминалВВалюте = (Выборка.ВалютаНоминала <> ВалютаУчета);
				ТочностьОкругления = ?(НоминалВВалюте, 4, 2);
				
				Если НоваяСтрока.Купон = 0 Тогда
					
					// рассчитаем купон сами
					Купон = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(НоваяСтрока.ЦеннаяБумага, Объект.Период, Объект.СчетДоверительногоУправления,, ТочностьОкругления);
					Если НоминалВВалюте Тогда
						Купон = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Купон, Выборка.ВалютаНоминала, Объект.Организация, Объект.Период);
					КонецЕсли;
					НоваяСтрока.Купон = Купон;
				
				КонецЕсли; 
				
				Если НоваяСтрока.Цена = 0 Тогда
					
					// заполним текущим номиналом
					Номинал = Выборка.Номинал;
					Если НоминалВВалюте Тогда
						Номинал = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Номинал, Выборка.ВалютаНоминала, Объект.Организация, Объект.Период);
					КонецЕсли;
					НоваяСтрока.Цена = Номинал;
				
				КонецЕсли; 				
				
				НоваяСтрока.Сумма 	= НоваяСтрока.Количество * (НоваяСтрока.Цена + НоваяСтрока.Купон);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		НоваяСтрока.Представление = ОбъектНаСервере.ПолучитьПредставлениеСтрокиПретрейда(НоваяСтрока);
		
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ПретрейдЗаполнитьПоРаспоряжениям(Команда)
	
	ПретрейдЗаполнитьПоРаспоряжениямНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПретрейдЗаполнитьПоРаспоряжениямНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("СоставСовокупнойИнвестДекларации", ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСоставаСовокупнойИнвестДекларации));
	ПараметрыЗаполнения.Вставить("Период", Объект.Период);
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	
	ТаблицаПретрейда = ОбъектНаСервере.ПолучитьТаблицуПретрейдаПоРаспоряжениям(ПараметрыЗаполнения);
	
	Для каждого СтрокаПретрейд Из ТаблицаПретрейда Цикл
		ЗаполнитьЗначенияСвойств(Объект.Претрейд.Добавить(), СтрокаПретрейд);
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ГрупповойКонтроль

#Область ГрупповойКонтроль_Команды_и_Элементы
	
&НаКлиенте
Процедура ЗаполнитьГрупповойКонтроль(Команда)
	
	Если ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 0
			Или (ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 1 И ЗначениеЗаполнено(ЭтаФорма.ГрупповойКонтроль_ИнвестСтратегия))
			Или (ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 2 И ЗначениеЗаполнено(ЭтаФорма.ГрупповойКонтроль_ВидДоговораДоверительногоУправления))
			Или ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 3 Тогда
		ЗаполнитьСоставГрупповогоКонтроля();
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПериодГрупповойКонтрольПриИзменении(Элемент)
	
	ЗаполнитьГрупповойКонтроль(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвестСтратегияПриИзменении(Элемент)
	
	ЗаполнитьГрупповойКонтроль(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораДоверительногоУправленияПриИзменении(Элемент)
	
	ЗаполнитьГрупповойКонтроль(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставГрупповогоКонтроляСчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьРеквизитыСтрокиГрупповогоКонтроля(Элементы.СоставГрупповогоКонтроля.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставГрупповогоКонтроляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СоставГрупповогоКонтроляРегистрацияСтоимостиАктивов" Тогда
		Значение = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока).РегистрацияСтоимостиАктивов;
		Если ТипЗнч(Значение) <> Тип("Строка") Тогда
			ОткрытьЗначение(Значение);
		КонецЕсли; 
	ИначеЕсли Поле.Имя = "СоставГрупповогоКонтроляПредставлениеИД" Тогда
		
		ТекСтрока = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		Если ТипЗнч(ТекСтрока.ИнвестиционнаяДекларация) = Тип("СправочникСсылка.ИнвестиционныеДекларации") И ЗначениеЗаполнено(ТекСтрока.ИнвестиционнаяДекларация) Тогда
			
			ОткрытьЗначение(ТекСтрока.ИнвестиционнаяДекларация);
			
		Иначе
			
			Если ТекСтрока.ПредставлениеИД = "Совокупная" Тогда
				ПараметрыФормы = Новый Структура("АдресСоставаСовокупнойИнвестДекларации", АдресСоставаСовокупнойИнвестДекларацииПоСтроке(ВыбраннаяСтрока));
				Результат = ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.СоставСовокупнойИнвестиционнойДекларации", ПараметрыФормы, ЭтаФорма);
				ЗагрузитьСовокупнойИнвестДекларацииПоСтроке(ВыбраннаяСтрока, ПараметрыФормы.АдресСоставаСовокупнойИнвестДекларации);
			КонецЕсли;
			
		КонецЕсли; 
		
	ИначеЕсли Поле.Имя = "СоставГрупповогоКонтроляПредставлениеСубъекта" Тогда
		
		ТекСтрока = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ТекСтрока.ПредставлениеИД = "Совокупная" Тогда
			ОткрытьЗначение(ТекСтрока.Клиент);
		Иначе
			ОткрытьЗначение(ТекСтрока.СчетДоверительногоУправления);
		КонецЕсли; 
		
	ИначеЕсли Поле.Имя = "СоставГрупповогоКонтроляГиперссылка" Тогда
		
		ТекСтрока = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ЗначениеЗаполнено(ТекСтрока.Гиперссылка) Тогда
			
			ЗагрузитьРезультатыПроверкиНаСервере(ТекСтрока.ИдентификаторРезультата);
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставГрупповогоКонтроляПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		СтрокаСоставаГрупповогоКонтроля = Элементы.СоставГрупповогоКонтроля.ТекущиеДанные;
		СтрокаСоставаГрупповогоКонтроля.АдресСтруктурыОтчетов = "";
		СтрокаСоставаГрупповогоКонтроля.ИдентификаторРезультата = Новый УникальныйИдентификатор;
		СтрокаСоставаГрупповогоКонтроля.Статус = "";
		СтрокаСоставаГрупповогоКонтроля.Выполнено = -1;
	ИначеЕсли НоваяСтрока Тогда
		СтрокаСоставаГрупповогоКонтроля = Элементы.СоставГрупповогоКонтроля.ТекущиеДанные;
		СтрокаСоставаГрупповогоКонтроля.Период = Объект.Период;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	Элементы.ИнвестСтратегия.Видимость = (ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 1);
	Элементы.ВидДоговораДоверительногоУправления.Видимость = (ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 2);
	
	ЗаполнитьГрупповойКонтроль(Неопределено);
	
КонецПроцедуры

&НаСервере
Функция АдресСоставаСовокупнойИнвестДекларацииПоСтроке(ВыбраннаяСтрока)
	
	ТекСтрока = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат ПоместитьВоВременноеХранилище(ТекСтрока.СоставСовокупнойИнвестиционнойДекларации.Выгрузить(), ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСовокупнойИнвестДекларацииПоСтроке(ВыбраннаяСтрока, Адрес);
	
	ТекСтрока = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ТекСтрока.СоставСовокупнойИнвестиционнойДекларации.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	УдалитьИзВременногоХранилища(Адрес);
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура РежимФильтрацииРезультатовГрупповогоКонтроляПриИзменении(Элемент)
	УстановитьРежимФильтрацииРезультатовГруппового(Элементы.СоставГрупповогоКонтроля);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитыСтрокиГрупповогоКонтроля(СтрокаГрупповогоКонтроля, ОбновлятьДокументы = Истина)

	Если ОбновлятьДокументы Тогда
		
		Период = ?(ЗначениеЗаполнено(СтрокаГрупповогоКонтроля.Период), СтрокаГрупповогоКонтроля.Период, Объект.Период);
		Если Не ЗначениеЗаполнено(СтрокаГрупповогоКонтроля.СчетДоверительногоУправления) Тогда
			СтрокаГрупповогоКонтроля.СчетДоверительногоУправления = Объект.СчетДоверительногоУправления;
		КонецЕсли; 
		РеквизитыКонтроля = ПолучитьРеквизитыКонтроля(Период, Объект.Организация, СтрокаГрупповогоКонтроля.СчетДоверительногоУправления);
		ЗаполнитьЗначенияСвойств(СтрокаГрупповогоКонтроля, РеквизитыКонтроля);		
	
	КонецЕсли; 

	СтрокаГрупповогоКонтроля.РезультатПроверки = Неопределено;
	СтрокаГрупповогоКонтроля.РезультатПроверкиВн = Неопределено;
	СтрокаГрупповогоКонтроля.РезультатПроверкиИтог = Неопределено;
	СтрокаГрупповогоКонтроля.Гиперссылка = "";
	СтрокаГрупповогоКонтроля.ОшибкиОценки = Ложь;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставГрупповогоКонтроля()
	
	Объект.СоставГрупповогоКонтроля.Очистить();
	
	// заполняем список
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДоступныеОрганизации", ПолучитьДоступныеОрганизации(Объект.Организация));
	Запрос.УстановитьПараметр("КлиентТрадиция", ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_Традиция"));
	Запрос.УстановитьПараметр("СчетДУАтлант", ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_DU_PIF352"));
	
	Если ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 1 Тогда
		
		// по стратегии
		Запрос.УстановитьПараметр("Стратегия", ЭтаФорма.ГрупповойКонтроль_ИнвестСтратегия);
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Включен,
			|	&Период КАК Дата,
			|	СчетаДоверительногоУправления.Организация КАК Организация,
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И Стратегия В (&Стратегия)) КАК СтратегииИндивидуальногоИнвестирования
			|		ПО СчетаДоверительногоУправления.Ссылка = СтратегииИндивидуальногоИнвестирования.СчетДоверительногоУправления
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация = &Организация
			|	И СчетаДоверительногоУправления.КодСчета <> ""О""
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
			|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Период)";
		
	ИначеЕсли ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 3 Тогда
		
		// по распоряжениям на депозиты
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ИСТИНА КАК Включен,
			|	&Период КАК Дата,
			|	Распоряжение.Организация КАК Организация,
			|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	Распоряжение.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
			|ИЗ
			|	Документ.Распоряжение КАК Распоряжение
			|ГДЕ
			|	Распоряжение.Организация = &Организация
			|	И Распоряжение.ДатаРазмещения = &Период
			|	И Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
			|	И НЕ Распоряжение.ПометкаУдаления";
		
	Иначе
		
		// без отбора или с отбором по виду договора
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Включен,
			|	&Период КАК Дата,
			|	СчетаДоверительногоУправления.Организация КАК Организация,
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|ГДЕ
			|	СчетаДоверительногоУправления.Организация = &Организация
			|	И СчетаДоверительногоУправления.КодСчета <> ""О""
			|	И &ВидДоговораДоверительногоУправления
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
			|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Период)";
		
		Если ЭтаФорма.ГрупповойКонтроль_РежимОтбора = 2 Тогда 
			
			// по виду договора
			УсловиеВидДоговора = "СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В(&ВидДоговораДоверительногоУправления)";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидДоговораДоверительногоУправления", УсловиеВидДоговора);
			Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления", ЭтаФорма.ГрупповойКонтроль_ВидДоговораДоверительногоУправления);
			
		Иначе
			
			Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления", Истина);
		
		КонецЕсли; 
		
	КонецЕсли;
	
	ТаблицаСчетов = Запрос.Выполнить().Выгрузить();
		
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	ОбработкаНаСервере.ПроверитьНастройкиПоСчетамДУ(ТаблицаСчетов);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСчетов, "_ТаблицаСчетов", Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст = РегистрыСведений.ИнвестиционныеДекларации.ПолучитьТекстЗапросаДляПолученияАктуальныхИнвестиционныхДеклараций();
	
	Запрос.Выполнить();
	
	ЗаполнитьСоставыГрупповыхКонтролей(Запрос);
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьПредставлениеСубъекта(Выборка)

	ПредставленияВидовДоговоров = Новый Соответствие;
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет , "ИИС");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда , "ПИФ");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР, "ПФР");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций, "СРО");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица, "ФЛ");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ, "ФОГФ");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица, "ЮЛ");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями, "ПН");
	ПредставленияВидовДоговоров.Вставить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами, "ПР");
	
	ПредставлениеВидаДоговора = ПредставленияВидовДоговоров.Получить(Выборка.ВидДоговораДоверительногоУправления);
	Если ПредставлениеВидаДоговора = Неопределено Тогда
		ПредставлениеВидаДоговора = Строка(Выборка.ВидДоговораДоверительногоУправления);
	КонецЕсли; 
	
	Возврат Строка(Выборка.Клиент) + " - " + ПредставлениеВидаДоговора;

КонецФункции

&НаСервере
Функция ПолучитьРезультатПроверкиДерева(РезультатыДерево)

	ПроверкаПройдена = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ПроверкаПройдена;
	
	РезультатПроверки = Новый Структура("РезультатПроверки, РезультатПроверкиВн", ПроверкаПройдена, ПроверкаПройдена);
	
	Для каждого СтрокаДерева Из РезультатыДерево.Строки Цикл
		Если СтрокаДерева.ИнвестиционнаяДекларация.Консолидирующая И СтрокаДерева.РезультатПроверки = ПроверкаПройдена Тогда
			РезультатПроверки = ПолучитьРезультатПроверкиДерева(СтрокаДерева);
		Иначе
			Если СтрокаДерева.РезультатПроверки <> ПроверкаПройдена Тогда
				Если СтрокаДерева.ВнутреннийНабор Тогда
					РезультатПроверки.РезультатПроверкиВн = СтрокаДерева.РезультатПроверки;
				Иначе
					РезультатПроверки.РезультатПроверки = СтрокаДерева.РезультатПроверки;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура РежимГрупповогоКонтроляПриИзменении(Элемент)
	
	Если ЭтаФорма.РежимГрупповогоКонтроля = "ПоСчетам" Тогда
		ТекущаяСтраница = Элементы.СтраницаГрупповойКонтроль;
		ТекстСообщения = "по счетам";
	ИначеЕсли ЭтаФорма.РежимГрупповогоКонтроля = "ЗаПериод" Тогда
		ТекущаяСтраница = Элементы.СтраницаКонтрольЗаПериод;
		ТекстСообщения = "за период";
	КонецЕсли;
	
	Если Объект.СоставГрупповогоКонтроля.Количество() = 0 Или Не Элементы.ФормаВыполнитьКонтроль.Видимость Тогда
		ЭтаФорма.ПараметрыПроверки.РежимГрупповогоКонтроля = ЭтаФорма.РежимГрупповогоКонтроля;
		ПереключитьСтраницу = Истина;
	ИначеЕсли ЭтаФорма.РежимГрупповогоКонтроля <> ЭтаФорма.ПараметрыПроверки.РежимГрупповогоКонтроля
		И Вопрос("Состав группового контроля " + ТекстСообщения + " будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.СоставГрупповогоКонтроля.Очистить();
		ЭтаФорма.ПараметрыПроверки.РежимГрупповогоКонтроля = ЭтаФорма.РежимГрупповогоКонтроля;
		ПереключитьСтраницу = Истина;
	ИначеЕсли ЭтаФорма.РежимГрупповогоКонтроля = ЭтаФорма.ПараметрыПроверки.РежимГрупповогоКонтроля Тогда
		ПереключитьСтраницу = Истина;
	Иначе
		ЭтаФорма.РежимГрупповогоКонтроля = ЭтаФорма.ПараметрыПроверки.РежимГрупповогоКонтроля;
		ПереключитьСтраницу = Ложь;
	КонецЕсли; 
	
	Если ПереключитьСтраницу Тогда
		Элементы.ГруппаСтраницыРежима.ТекущаяСтраница = ТекущаяСтраница;
	КонецЕсли; 
	
КонецПроцедуры

#Область Контроль_за_период

&НаКлиенте
Процедура ЗаполнитьКонтрольЗаПериод(Команда)
	ЗаполнитьКонтрольЗаПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЗаПериод_ПериодПриИзменении(Элемент)
	ЗаполнитьКонтрольЗаПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправлениКонтрольЗаПериодПриИзменении(Элемент)
	ЗаполнитьКонтрольЗаПериодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрольЗаПериодНаСервере()

	Если ЭтаФорма.КонтрольЗаПериодРежимЗаполнения = "ПоСписку" Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
		
	Если ЭтаФорма.КонтрольЗаПериодРежимЗаполнения = "ПоНастройкам" Тогда
		
		МассивДат = Справочники.НастройкиРегламентныхДействий.ПолучитьДатыРасчетаСЧАЗаПериод(
			Объект.СчетДоверительногоУправления, 
			ЭтаФорма.КонтрольЗаПериод_Период.ДатаНачала, 
			ЭтаФорма.КонтрольЗаПериод_Период.ДатаОкончания);
			
		Если МассивДат <> Неопределено И  МассивДат.Количество() > 0 Тогда
			
			Для каждого ДатаРасчетаСЧА Из МассивДат Цикл
				НоваяСтрока = ТаблицаДат.Добавить();
				НоваяСтрока.Дата = ДатаРасчетаСЧА;
			КонецЦикла; 
			
		КонецЕсли;
			
	ИначеЕсли ЭтаФорма.КонтрольЗаПериодРежимЗаполнения = "ЗаКаждыйДень" Тогда
		
		ТекДата = НачалоДня(ЭтаФорма.КонтрольЗаПериод_Период.ДатаНачала);
		
		Пока ТекДата <= ЭтаФорма.КонтрольЗаПериод_Период.ДатаОкончания Цикл
			НоваяСтрока = ТаблицаДат.Добавить();
			НоваяСтрока.Дата = ТекДата;
			ТекДата = ТекДата + 24*3600;
		КонецЦикла;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДоступныеОрганизации", ПолучитьДоступныеОрганизации(Объект.Организация));
	Запрос.УстановитьПараметр("КлиентТрадиция", ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_Традиция"));
	Запрос.УстановитьПараметр("СчетДУАтлант", ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_DU_PIF352"));
		
	#Область Текст_запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДат.Дата КАК Дата,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ТаблицаДат
		|ИЗ
		|	&ТаблицаДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Включен,
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Организация КАК Организация,
		|	ЕСТЬNULL(СтратегииИндивидуальногоИнвестирования.Стратегия, НЕОПРЕДЕЛЕНО) КАК Стратегия
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ТаблицаДат.Дата КАК Дата,
		|		_ТаблицаДат.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(СтратегииИндивидуальногоИнвестирования.Период) КАК ПериодСтратегии
		|	ИЗ
		|		_ТаблицаДат КАК _ТаблицаДат
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|			ПО _ТаблицаДат.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестирования.СчетДоверительногоУправления
		|				И _ТаблицаДат.Дата >= СтратегииИндивидуальногоИнвестирования.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ТаблицаДат.Дата,
		|		_ТаблицаДат.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестирования.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ПериодСтратегии = СтратегииИндивидуальногоИнвестирования.Период";
	
	ТаблицаСчетов = Запрос.Выполнить().Выгрузить();
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	ОбработкаНаСервере.ПроверитьНастройкиПоСчетамДУ(ТаблицаСчетов);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСчетов, "_ТаблицаСчетов", Запрос.МенеджерВременныхТаблиц);
	
	Если ЗначениеЗаполнено(ЭтаФорма.ГрупповойКонтроль_ИнвестиционнаяДекларация) Тогда
		Запрос.УстановитьПараметр("ИнвестиционнаяДекларация", ЭтаФорма.ГрупповойКонтроль_ИнвестиционнаяДекларация);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаСчетов.Дата КАК Дата,
			|	КлиентыДоверительногоУправления.Клиент КАК Клиент,
			|	СчетаДоверительногоУправленияСправочник.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	_ТаблицаСчетов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	1 КАК ПорядокКонтроля,
			|	ИнвестиционныеДекларации.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
			|	ИнвестиционныеДекларации.Ссылка КАК ИнвестиционнаяДекларация,
			|	ИнвестиционныеДекларации.СовокупныйКонтроль КАК СовокупныйКонтроль,
			|	ЗНАЧЕНИЕ(Документ.НазначениеИнвестиционнойДекларации.ПустаяСсылка) КАК Назначение
			|ПОМЕСТИТЬ _СоставСовокупнойИД
			|ИЗ
			|	_ТаблицаСчетов КАК _ТаблицаСчетов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправленияСправочник
			|		ПО _ТаблицаСчетов.СчетДоверительногоУправления = СчетаДоверительногоУправленияСправочник.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
			|		ПО (ИнвестиционныеДекларации.Ссылка = &ИнвестиционнаяДекларация)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_ТаблицаСчетов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			_ТаблицаСчетов.Дата КАК Дата,
			|			МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК ПериодКлиента
			|		ИЗ
			|			_ТаблицаСчетов КАК _ТаблицаСчетов
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
			|				ПО _ТаблицаСчетов.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
			|					И _ТаблицаСчетов.Дата >= КлиентыДоверительногоУправления.Период
			|					И (КлиентыДоверительногоУправления.Организация = &Организация)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_ТаблицаСчетов.СчетДоверительногоУправления,
			|			_ТаблицаСчетов.Дата) КАК ПериодыКлиентовДУ
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
			|			ПО ПериодыКлиентовДУ.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
			|				И ПериодыКлиентовДУ.ПериодКлиента = КлиентыДоверительногоУправления.Период
			|				И (КлиентыДоверительногоУправления.Организация = &Организация)
			|		ПО _ТаблицаСчетов.СчетДоверительногоУправления = ПериодыКлиентовДУ.СчетДоверительногоУправления
			|			И _ТаблицаСчетов.Дата = ПериодыКлиентовДУ.Дата";
	Иначе
		Запрос.Текст = РегистрыСведений.ИнвестиционныеДекларации.ПолучитьТекстЗапросаДляПолученияАктуальныхИнвестиционныхДеклараций();
	КонецЕсли; 
	Запрос.Выполнить();
	#КонецОбласти 
	
	Объект.СоставГрупповогоКонтроля.Очистить();
	
	ЗаполнитьСоставыГрупповыхКонтролей(Запрос);

КонецПроцедуры

&НаКлиенте
Процедура КонтрольЗаПериодРежимЗаполненияПриИзменении(Элемент)
	ЗаполнитьКонтрольЗаПериодНаСервере();
КонецПроцедуры
 
&НаКлиенте
Процедура СоставКонтроляЗаПериодПериодПриИзменении(Элемент)
	
	ОбновитьРеквизитыСтрокиГрупповогоКонтроля(Элементы.СоставКонтроляЗаПериод.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКонтроляЗаПериодВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СоставКонтроляЗаПериодРегистрацияСтоимостиАктивов" Тогда
		Значение = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока).РегистрацияСтоимостиАктивов;
		Если ТипЗнч(Значение) <> Тип("Строка") Тогда
			ОткрытьЗначение(Значение);
		КонецЕсли; 
	ИначеЕсли Поле.Имя = "СоставКонтроляЗаПериодГиперссылка" Тогда
		
		ТекСтрока = Объект.СоставГрупповогоКонтроля.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ЗначениеЗаполнено(ТекСтрока.Гиперссылка) Тогда
		
			ЗагрузитьРезультатыПроверкиНаСервере(ТекСтрока.ИдентификаторРезультата);
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКонтроляЗаПериодПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		
		СтрокаСоставаКонтроляЗаПериод = Элементы.СоставКонтроляЗаПериод.ТекущиеДанные;
		СтрокаСоставаКонтроляЗаПериод.АдресСтруктурыОтчетов = "";
		СтрокаСоставаКонтроляЗаПериод.ИдентификаторРезультата = Новый УникальныйИдентификатор;
		СтрокаСоставаКонтроляЗаПериод.Статус = "";
		СтрокаСоставаКонтроляЗаПериод.Выполнено = -1;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РежимФильтрацииРезультатовКонтроляЗаПериодПриИзменении(Элемент)
	
	УстановитьРежимФильтрацииРезультатовГруппового(Элементы.СоставКонтроляЗаПериод)
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповойКонтроль_ИнвестиционнаяДекларацияПриИзменении(Элемент)
	
	ЗаполнитьКонтрольЗаПериодНаСервере();
 
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура УстановитьРежимФильтрацииРезультатовГруппового(Элемент)

	Нарушение = ПредопределенноеЗначение("Перечисление.РезультатыКонтроляИнвестиционнойДекларации.Нарушение");
	ОтборСтрок = Новый Структура;
	Если ЭтаФорма.ГрупповойКонтроль_РежимФильтрацииРезультатовГрупповогоКонтроля = 1 Тогда
		ОтборСтрок.Вставить("РезультатПроверкиИтог", Нарушение);
	ИначеЕсли ЭтаФорма.ГрупповойКонтроль_РежимФильтрацииРезультатовГрупповогоКонтроля = 2 Тогда
		ОтборСтрок.Вставить("РезультатПроверки", Нарушение);
	ИначеЕсли ЭтаФорма.ГрупповойКонтроль_РежимФильтрацииРезультатовГрупповогоКонтроля = 3 Тогда
		ОтборСтрок.Вставить("РезультатПроверкиВн", Нарушение);
	КонецЕсли; 
	Элемент.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставыГрупповыхКонтролей(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _СоставСовокупнойИД.СчетДоверительногоУправления = &СчетДУАтлант
		|			ТОГДА &Период >= ДАТАВРЕМЯ(2021, 1, 1)
		|		ИНАЧЕ _ТаблицаСчетов.Включен
		|	КОНЕЦ КАК Включен,
		|	_СоставСовокупнойИД.Дата КАК Период,
		|	_СоставСовокупнойИД.Клиент КАК Клиент,
		|	_СоставСовокупнойИД.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СоставСовокупнойИД.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.Организация.ВалютаУчета КАК ВалютаУчета,
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	СчетаДоверительногоУправления.Представление КАК СчетДоверительногоУправленияПредставление,
		|	СчетаДоверительногоУправления.Организация.Представление КАК ОрганизацияПредставление,
		|	_СоставСовокупнойИД.ПорядокКонтроля КАК ПорядокКонтроля,
		|	_СоставСовокупнойИД.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
		|	_СоставСовокупнойИД.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
		|	_СоставСовокупнойИД.СовокупныйКонтроль КАК СовокупныйКонтроль,
		|	_СоставСовокупнойИД.ИнвестиционнаяДекларация.Наименование + (ВЫРАЗИТЬ(_СоставСовокупнойИД.ИнвестиционнаяДекларация.Комментарий КАК СТРОКА(1024))) КАК ИнвестиционнаяДекларацияПредставление,
		|	_СоставСовокупнойИД.Назначение КАК Назначение,
		|	ФинансовыеПоказателиСЧА.Регистратор КАК РегистрацияСтоимостиАктивов,
		|	ЕСТЬNULL(ФинансовыеПоказателиСЧА.Значение, 0) КАК РегистрацияСтоимостиАктивов_СЧА,
		|	ЕСТЬNULL(ФинансовыеПоказателиРСА.Значение, 0) КАК РегистрацияСтоимостиАктивов_РСА
		|ИЗ
		|	_СоставСовокупнойИД КАК _СоставСовокупнойИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО _СоставСовокупнойИД.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаСчетов КАК _ТаблицаСчетов
		|		ПО _СоставСовокупнойИД.Организация = _ТаблицаСчетов.Организация
		|			И _СоставСовокупнойИД.СчетДоверительногоУправления = _ТаблицаСчетов.СчетДоверительногоУправления
		|			И _СоставСовокупнойИД.Дата = _ТаблицаСчетов.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиСЧА
		|		ПО _СоставСовокупнойИД.Дата = ФинансовыеПоказателиСЧА.Период
		|			И _СоставСовокупнойИД.Организация = ФинансовыеПоказателиСЧА.Организация
		|			И _СоставСовокупнойИД.СчетДоверительногоУправления = ФинансовыеПоказателиСЧА.СубъектАналитики
		|			И (ФинансовыеПоказателиСЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиРСА
		|		ПО (ФинансовыеПоказателиСЧА.Регистратор = ФинансовыеПоказателиРСА.Регистратор)
		|			И (ФинансовыеПоказателиРСА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Организация,
		|	Клиент,
		|	ВидДоговораДоверительногоУправления,
		|	СовокупныйКонтроль УБЫВ,
		|	ПорядокКонтроля,
		|	СчетДоверительногоУправления
		|ИТОГИ
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(СовокупныйКонтроль)
		|ПО
		|	Период,
		|	Клиент,
		|	ВидДоговораДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПериод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонтрольныеСуммы = Новый Массив;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Пока ВыборкаПериод.Следующий() Цикл
		
		ВыборкаКлиент = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКлиент.Следующий() Цикл
		
			ВыборкаВидДоговора = ВыборкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаВидДоговора.Следующий() Цикл
			
				Выборка = ВыборкаВидДоговора.Выбрать();
				
				СтруктураОтбора = Новый Структура("Организация, Период, Клиент, ВидДоговораДоверительногоУправления, СчетДоверительногоУправления, ИнвестиционнаяДекларация");
				
				Если ВыборкаВидДоговора.СовокупныйКонтроль Тогда
					
					ЗаполнитьЗначенияСвойств(СтруктураОтбора, ВыборкаВидДоговора, "Период, Клиент, ВидДоговораДоверительногоУправления");
					СтруктураОтбора.Вставить("Организация", Объект.Организация);
					СтруктураОтбора.Вставить("СовокупнаяИнвестДекларация", Истина);
					ПараметрыОтбора = ОбработкаОбъект.ПараметрыОтбораДляХранилищаЗначений(СтруктураОтбора);
					КонтрольныеСуммы.Добавить(ПараметрыОтбора.КонтрольнаяСумма);
					
					НоваяСтрока = Объект.СоставГрупповогоКонтроля.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаВидДоговора);
					НоваяСтрока.СовокупнаяИнвестДекларация = Истина;
					НоваяСтрока.ПредставлениеСубъекта = ПолучитьПредставлениеСубъекта(ВыборкаВидДоговора);
					НоваяСтрока.ПредставлениеИД = "Совокупная";
					НоваяСтрока.КонтрольнаяСумма = ПараметрыОтбора.КонтрольнаяСумма;
					НоваяСтрока.Выполнено = -1;
					НоваяСтрока.Статус = "";
					
				КонецЕсли; 		
				
				ОбработанныеДокументы = Новый Массив;
				
				Пока Выборка.Следующий() Цикл
					
					Если Не ВыборкаВидДоговора.СовокупныйКонтроль Тогда
						
						ЗаполнитьЗначенияСвойств(СтруктураОтбора, Выборка);
						СтруктураОтбора.Вставить("СовокупнаяИнвестДекларация", Ложь);
						ПараметрыОтбора = ОбработкаОбъект.ПараметрыОтбораДляХранилищаЗначений(СтруктураОтбора);
						КонтрольныеСуммы.Добавить(ПараметрыОтбора.КонтрольнаяСумма);
						
						НоваяСтрока = Объект.СоставГрупповогоКонтроля.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						НоваяСтрока.ПредставлениеСубъекта = Выборка.СчетДоверительногоУправления;
						НоваяСтрока.ПредставлениеИД = Выборка.ИнвестиционнаяДекларация;
						НоваяСтрока.КонтрольнаяСумма = ПараметрыОтбора.КонтрольнаяСумма;
						НоваяСтрока.Выполнено = -1;
						НоваяСтрока.Статус = "";
						
					Иначе
						
						Если ОбработанныеДокументы.Найти(Выборка.РегистрацияСтоимостиАктивов) = Неопределено Тогда
						
							ОбработанныеДокументы.Добавить(Выборка.РегистрацияСтоимостиАктивов);
							НоваяСтрока.РегистрацияСтоимостиАктивов_СЧА = НоваяСтрока.РегистрацияСтоимостиАктивов_СЧА + Выборка.РегистрацияСтоимостиАктивов_СЧА;
							НоваяСтрока.РегистрацияСтоимостиАктивов_РСА = НоваяСтрока.РегистрацияСтоимостиАктивов_РСА + Выборка.РегистрацияСтоимостиАктивов_РСА;
						
						КонецЕсли;
						
					КонецЕсли;
					
					СтрокаСоставаСовокупногоКонтроля = НоваяСтрока.СоставСовокупнойИнвестиционнойДекларации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСоставаСовокупногоКонтроля, Выборка);
					СтрокаСоставаСовокупногоКонтроля.СЧА = Выборка.РегистрацияСтоимостиАктивов_СЧА;
					СтрокаСоставаСовокупногоКонтроля.РСА = Выборка.РегистрацияСтоимостиАктивов_РСА;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХранилищеЗначений.Идентификатор КАК Идентификатор,
		|	ХранилищеЗначений.ДатаСоздания КАК ДатаСоздания,
		|	ХранилищеЗначений.КонтрольнаяСумма КАК КонтрольнаяСумма,
		|	ХранилищеЗначений.ХранилищеЗначения КАК ХранилищеЗначения
		|ИЗ
		|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
		|ГДЕ
		|	ХранилищеЗначений.Источник = ""_КонтрольИнвестиционныхДеклараций""
		|	И ХранилищеЗначений.КонтрольнаяСумма В(&КонтрольныеСуммы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ХранилищеЗначений.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("КонтрольныеСуммы", КонтрольныеСуммы);
	
	СохраненныеРезультаты = Запрос.Выполнить().Выгрузить();
	ПроверкаПройдена = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ПроверкаПройдена;
	Нарушение = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.Нарушение;
	
	Для каждого Строка Из Объект.СоставГрупповогоКонтроля Цикл
	
		НайденныеСтроки = СохраненныеРезультаты.НайтиСтроки(Новый Структура("КонтрольнаяСумма", Строка.КонтрольнаяСумма));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			СтрокаРезультат = НайденныеСтроки[0];
			
			Значение = СтрокаРезультат.ХранилищеЗначения.Получить();
			
			Если ТипЗнч(Значение) = Тип("Структура") Тогда
			
				Строка.ИдентификаторРезультата = СтрокаРезультат.Идентификатор;
				Строка.ДатаПроверки = СтрокаРезультат.ДатаСоздания;
				Строка.РезультатПроверкиТекущегоДня = (НачалоДня(Строка.ДатаПроверки) <= Объект.Период);
				
				Если Значение.Свойство("РезультатПроверкиДерева") Тогда
				
					РезультатПроверкиДерева = Значение.РезультатПроверкиДерева;
					Строка.РезультатПроверки = РезультатПроверкиДерева.РезультатПроверки;
					Строка.РезультатПроверкиВн = РезультатПроверкиДерева.РезультатПроверкиВн;
					Строка.РезультатПроверкиИтог = ?(РезультатПроверкиДерева.РезультатПроверкиВн = Нарушение Или РезультатПроверкиДерева.РезультатПроверки = Нарушение, Нарушение, ПроверкаПройдена);
					Строка.Гиперссылка = "Перейти к расшифровке";
					Строка.ОшибкиОценки = Значение.ОшибкиОценки;
					Строка.Статус = "Завершено";
					
				КонецЕсли; 			 	
			
			КонецЕсли;
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры 

#КонецОбласти 

#Область Отладка

&НаКлиенте
Процедура ОтладкаСохранитьНастройки(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Отладка_ИдентификаторНастроек) И Вопрос("Настройка уже выбрана." + Символы.ПС + "Да - заменить выбранную" + Символы.ПС + "Нет - создать новую", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ИдентификаторНастроек = ЭтаФорма.Отладка_ИдентификаторНастроек;
	Иначе
		ИдентификаторНастроек = Новый УникальныйИдентификатор
	КонецЕсли; 
	
	ЭтаФорма.Отладка_ИдентификаторНастроек = ИдентификаторНастроек;
	ОтладкаСохранитьНастройкиНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ОтладкаСохранитьНастройкиНаСервере()
	
	СтруктураНастроек = Новый Структура("Организация, Период, СчетДоверительногоУправления, ИнвестиционнаяДекларация, УчитыватьПлановыеОперации, ДинамическийРасчетСтоимости");
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Объект);
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтаФорма);

	СтруктураНастроек.Вставить("Претрейд", 							Объект.Претрейд.Выгрузить());
	СтруктураНастроек.Вставить("РежимКонтроля", 					ЭтаФорма.РежимКонтроля);
	СтруктураНастроек.Вставить("РежимГрупповогоКонтроля", 			ЭтаФорма.РежимГрупповогоКонтроля);
	СтруктураНастроек.Вставить("СоставГрупповогоКонтроля", 			Объект.СоставГрупповогоКонтроля.Выгрузить());
	СтруктураНастроек.Вставить("СоставСовокупнойИнвестДекларации", 	ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСоставаСовокупнойИнвестДекларации));
	
	Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
	
	Запись.Идентификатор 		= ЭтаФорма.Отладка_ИдентификаторНастроек;
	Запись.ХранилищеЗначения 	= Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));
	Запись.Источник 			= "СохраненныеНастройкиКИД";
	Запись.ДатаСоздания 		= ТекущаяДатаСеанса();
	Запись.НеУдалять 			= Истина;
	Запись.Комментарий			= ЭтаФорма.Отладка_Комментарий;
	Запись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтладкаЗагрузитьНастройки(Команда)
	
	АдресНастроек = ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.ФормаНастройкиОтладки", Новый Структура("ИдентификаторНастроек", ЭтаФорма.Отладка_ИдентификаторНастроек), ЭтаФорма);
	
	Если ТипЗнч(АдресНастроек) = Тип("Строка") 
		И ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
		
		ЗагрузитьНастройки(АдресНастроек);
		
		Если ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль" Тогда
			ТекущаяСтраница = Элементы.СтраницаИндивидуальныйКонтроль;
			//ПериодПриИзменении(Неопределено);
			РеквизитыКонтроля = ПолучитьРеквизитыКонтроля(Объект.Период, Объект.Организация, Объект.СчетДоверительногоУправления);
			
			//Объект.ИнвестиционнаяДекларация = РеквизитыКонтроля.ИнвестиционнаяДекларация;
			Элементы.РезультатыПроверкиИнвестиционнаяДекларация.Видимость = РеквизитыКонтроля.Консолидирующая;
			ЭтаФорма.РегистрацияСтоимостиАктивов 		= РеквизитыКонтроля.РегистрацияСтоимостиАктивов;
			ЭтаФорма.РегистрацияСтоимостиАктивов_СЧА 	= РеквизитыКонтроля.РегистрацияСтоимостиАктивов_СЧА;
			ЭтаФорма.РегистрацияСтоимостиАктивов_РСА 	= РеквизитыКонтроля.РегистрацияСтоимостиАктивов_РСА;
			ЭтаФорма.РегистрацияСтоимостиАктивов_КЗ 	= РеквизитыКонтроля.РегистрацияСтоимостиАктивов_КЗ;
		ИначеЕсли ЭтаФорма.РежимГрупповогоКонтроля = "ПоСчетам" Тогда
			ТекущаяСтраница = Элементы.СтраницаГрупповойКонтроль;
		ИначеЕсли ЭтаФорма.РежимГрупповогоКонтроля = "ЗаПериод" Тогда
			ТекущаяСтраница = Элементы.СтраницаКонтрольЗаПериод;
		КонецЕсли;
		
		Элементы.ГруппаСтраницыРежима.ТекущаяСтраница = ТекущаяСтраница;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки(АдресНастроек)

	СтруктураНастроек = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек, "Организация, Период, СчетДоверительногоУправления, ИнвестиционнаяДекларация, УчитыватьПлановыеОперации, ДинамическийРасчетСтоимости");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек, "РежимКонтроля, РежимГрупповогоКонтроля");
	ЗаполнитьЗначенияСвойств(Этаформа.ПараметрыПроверки, СтруктураНастроек);
	Объект.Претрейд.Загрузить(СтруктураНастроек.Претрейд);
	Объект.СоставГрупповогоКонтроля.Загрузить(СтруктураНастроек.СоставГрупповогоКонтроля);
	ПоместитьВоВременноеХранилище(СтруктураНастроек.СоставСовокупнойИнвестДекларации, ЭтаФорма.АдресСоставаСовокупнойИнвестДекларации);
	
	ЭтаФорма.СовокупнаяИнвестДекларация = (СтруктураНастроек.СоставСовокупнойИнвестДекларации.Количество() > 1);
	
	ЭтаФорма.Отладка_ИдентификаторНастроек = СтруктураНастроек.ИдентификаторНастроек;
	ЭтаФорма.Отладка_Комментарий = СтруктураНастроек.Комментарий;
	
	Результат = Неопределено;
	Если СтруктураНастроек.Свойство("Результат", Результат) Тогда
		ЭтаФорма.Отладка_РезультатСохранен = Истина;
		Если ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль" Тогда
		
			ПоместитьВоВременноеХранилище(Результат, ЭтаФорма.АдресСтруктурыРезультатовПроверки);
			ЗначениеВРеквизитФормы(Результат.РезультатыПроверки, "РезультатыПроверки");
		
		КонецЕсли;
	Иначе
		ЭтаФорма.Отладка_РезультатСохранен = Ложь;
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ОтладкаСохранитьРезультатВНастройку(Команда)
	ЭтаФорма.Отладка_РезультатСохранен = Истина;
	ОтладкаСохранитьРезультатВНастройкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтладкаСохранитьРезультатВНастройкуНаСервере()

	Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = ЭтаФорма.Отладка_ИдентификаторНастроек;
	Запись.Прочитать();
	СтруктураНастроек = Запись.ХранилищеЗначения.Получить();
	Если ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль" Тогда
		
		Если ЭтоАдресВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки) Тогда
			
			СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСтруктурыРезультатовПроверки);
			Если ТипЗнч(СтруктураРезультатовПроверки) = Тип("Структура") Тогда
			
				СтруктураНастроек.Вставить("Результат", СтруктураРезультатовПроверки);
			
			КонецЕсли; 			
		
		КонецЕсли; 		
		
	Иначе
		
		СтруктураНастроек.Вставить("СоставГрупповогоКонтроля", Объект.СоставГрупповогоКонтроля.Выгрузить());
		СтруктураНастроек.Вставить("Результат", Истина);
		
	КонецЕсли;
	
	Запись.Комментарий = ЭтаФорма.Отладка_Комментарий;
	Запись.ХранилищеЗначения = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));
	Запись.Записать();

КонецПроцедуры 

&НаКлиенте
Процедура ОтладкаСравнитьРезультатССохраненным(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Отладка_Каталог) Тогда
	
		РабочийКаталог = ЭтаФорма.Отладка_Каталог;
		Если Прав(РабочийКаталог, 1) <> "\" Тогда
			РабочийКаталог = РабочийКаталог + "\";
		КонецЕсли; 
		
		Файл = Новый Файл(РабочийКаталог);
		Если Не Файл.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указанный каталог не существует",,, "Отладка_Каталог");
			Возврат;
		КонецЕсли; 
		
		СоздатьФайлОбработки(РабочийКаталог);
		
		КаталогОтчетов = РабочийКаталог + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd-HHmm") + "\";
		ОтладкаСравнитьРезультатССохраненнымНаСервере(КаталогОтчетов);
		
		Путь = КаталогПрограммы() + "1cv8.exe";
		Режим = " ENTERPRISE";
		СтрокаСоединения = " /IBConnectionString """ + СтрЗаменить(СтрокаСоединенияИнформационнойБазы(), """", """""") + """";
		ДопПараметры = " /DisableStartupMessages /RunModeOrdinaryApplication";
		Вывод = "";//" /Out " + Каталог + "Результат.txt";
		Параметр = " /C " + КаталогОтчетов;
		Обработка = " /Execute " + """" + РабочийКаталог + "СравнениеТабличныхДокументов.epf""";

		СтрокаКоманды = Путь + Режим + СтрокаСоединения + ДопПараметры + Вывод + Параметр + Обработка;

		ЗапуститьПриложение(СтрокаКоманды, , Истина);		
		
		УдалитьФайлы(КаталогОтчетов);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для сравнения результатов необходимо указать рабочий каталог",,, "Отладка_Каталог");	
	КонецЕсли; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьФайлОбработки(РабочийКаталог)
	
	ПутьКФайлуВнешнейОбработкиИлиОтчета = РабочийКаталог + "СравнениеТабличныхДокументов.epf";
	
	Файл = Новый Файл(ПутьКФайлуВнешнейОбработкиИлиОтчета);
	
	Если Не Файл.Существует() Тогда
	
		Файл = Новый Файл(ПолучитьИмяВременногоФайла());
		КаталогВыгрузки = КаталогВременныхФайлов() + "СравнениеТабличныхДокументов_" + Файл.ИмяБезРасширения + "\";
		
		Файл = Новый Файл(КаталогВыгрузки);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(КаталогВыгрузки);
		КонецЕсли; 
		
		ПутьККорневомуФайлуВыгрузки = КаталогВыгрузки + "СравнениеТабличныхДокументов.xml";
		
		ФайлХМЛ = Новый ЗаписьТекста(ПутьККорневомуФайлуВыгрузки);
		ФайлХМЛ.Записать(ПолучитьТекстФайлаХМЛ());
		ФайлХМЛ.Закрыть();
		
		КаталогМодуля = КаталогВыгрузки + "СравнениеТабличныхДокументов\Ext\";
		
		Файл = Новый Файл(КаталогМодуля);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(КаталогМодуля);
		КонецЕсли; 
		
		ФайлМодуля = Новый ЗаписьТекста(КаталогМодуля + "ObjectModule.bsl");
		ФайлМодуля.Записать(ПолучитьТекстМодуляОбработки());
		ФайлМодуля.Закрыть();
		СтрокаСоединения = " /S ap35\AssetManagementDemo1";
		СтрокаКоманды = КаталогПрограммы() + "1cv8.exe DESIGNER " + СтрокаСоединения + " /LoadExternalDataProcessorOrReportFromFiles """ + ПутьККорневомуФайлуВыгрузки + """ """ + ПутьКФайлуВнешнейОбработкиИлиОтчета + """";
		
		КодВозврата = Неопределено;
		ЗапуститьПриложение(СтрокаКоманды, , Истина, КодВозврата);
		
		УдалитьФайлы(КаталогВыгрузки);
			
	КонецЕсли; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстМодуляОбработки()

	ТекстМодуля = 
		"Каталог = ПараметрЗапуска;
		|	
		|КаталогТек = Каталог + ""Текущие\"";
		|КаталогСохр = Каталог + ""Сохраненные\"";
		|
		|МассивСохраненных = НайтиФайлы(КаталогСохр, ""*.mxl"");
		|
		|СравнениеФайлов = Новый СравнениеФайлов;
		|СравнениеФайлов.СпособСравнения = СпособСравненияФайлов.ТабличныйДокумент;
		|
		|РасхожденияОтсутствуют = Истина;
		|
		|Для каждого Файл Из МассивСохраненных Цикл
		|	
		|	СравнениеФайлов.ПервыйФайл = КаталогСохр + Файл.Имя;
		|	СравнениеФайлов.ВторойФайл = КаталогТек + Файл.Имя;
		|	
		|	Если Не СравнениеФайлов.Сравнить() Тогда
		|		СравнениеФайлов.ПоказатьРазличия();
		|		РасхожденияОтсутствуют = Ложь;
		|		ТекстСообщения = ""Обнаружены расхождения: ""
		|	Иначе
		|		ТекстСообщения = ""Расхождения отсутствуют: ""
		|	КонецЕсли; 
		|	
		|	Сообщить(ТекстСообщения + Файл.Имя);
		|	
		|КонецЦикла;
		|
		|Если РасхожденияОтсутствуют Тогда
		|	Предупреждение(""Расхождений не найдено"");
		|	ПрекратитьРаботуСистемы();
		|КонецЕсли;";

	Возврат ТекстМодуля;

КонецФункции
 
&НаСервереБезКонтекста
Функция ПолучитьТекстФайлаХМЛ()

	ТекстХМЛ = "<?xml version=""1.0"" encoding=""UTF-8""?>
	|<MetaDataObject xmlns=""http://v8.1c.ru/8.3/MDClasses"" xmlns:app=""http://v8.1c.ru/8.2/managed-application/core"" xmlns:cfg=""http://v8.1c.ru/8.1/data/enterprise/current-config"" xmlns:cmi=""http://v8.1c.ru/8.2/managed-application/cmi"" xmlns:ent=""http://v8.1c.ru/8.1/data/enterprise"" xmlns:lf=""http://v8.1c.ru/8.2/managed-application/logform"" xmlns:style=""http://v8.1c.ru/8.1/data/ui/style"" xmlns:sys=""http://v8.1c.ru/8.1/data/ui/fonts/system"" xmlns:v8=""http://v8.1c.ru/8.1/data/core"" xmlns:v8ui=""http://v8.1c.ru/8.1/data/ui"" xmlns:web=""http://v8.1c.ru/8.1/data/ui/colors/web"" xmlns:win=""http://v8.1c.ru/8.1/data/ui/colors/windows"" xmlns:xen=""http://v8.1c.ru/8.3/xcf/enums"" xmlns:xpr=""http://v8.1c.ru/8.3/xcf/predef"" xmlns:xr=""http://v8.1c.ru/8.3/xcf/readable"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" version=""2.9"">
	|	<ExternalDataProcessor uuid=""dd600e53-8877-4d91-8b98-5cbce21490d2"">
	|		<InternalInfo>
	|			<xr:ContainedObject>
	|				<xr:ClassId>c3831ec8-d8d5-4f93-8a22-f9bfae07327f</xr:ClassId>
	|				<xr:ObjectId>1acaba4c-63a3-4dcd-88fe-0170c1d72f4c</xr:ObjectId>
	|			</xr:ContainedObject>
	|			<xr:GeneratedType name=""ExternalDataProcessorObject._СравнениеТабличныхДокументов"" category=""Object"">
	|				<xr:TypeId>a9cae6ce-7331-4a13-9f84-9ddd5149fb29</xr:TypeId>
	|				<xr:ValueId>c093e4aa-8374-4b19-92b3-d6f0d434fc8a</xr:ValueId>
	|			</xr:GeneratedType>
	|		</InternalInfo>
	|		<Properties>
	|			<Name>_СравнениеТабличныхДокументов</Name>
	|			<Synonym>
	|				<v8:item>
	|					<v8:lang>ru</v8:lang>
	|					<v8:content>Сравнение табличных документов</v8:content>
	|				</v8:item>
	|			</Synonym>
	|			<Comment/>
	|			<DefaultForm/>
	|			<AuxiliaryForm/>
	|		</Properties>
	|		<ChildObjects/>
	|	</ExternalDataProcessor>
	|</MetaDataObject>";
	
	Возврат ТекстХМЛ;

КонецФункции

&НаСервере 
Процедура ОтладкаСравнитьРезультатССохраненнымНаСервере(Каталог)
	
	Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = ЭтаФорма.Отладка_ИдентификаторНастроек;
	Запись.Прочитать();
	СтруктураНастроек = Запись.ХранилищеЗначения.Получить();
	
	Если ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль" Тогда
		СтруктураРезультатовПроверкиСохр = СтруктураНастроек.Результат;//.ПараметрыБазисов.Получить();
		СтруктураРезультатовПроверки = ПолучитьИзВременногоХранилища(АдресСтруктурыРезультатовПроверки);//.ПараметрыБазисов.Получить();
		ИмяФайла = "_" + Формат(СтруктураНастроек.Период, "ДФ=yyyyMMdd") + "_" + СтруктураНастроек.СчетДоверительногоУправления + "_" + СтруктураНастроек.ИнвестиционнаяДекларация;
		СравнитьРезультатыПроверки(СтруктураРезультатовПроверкиСохр, СтруктураРезультатовПроверки, Каталог, ИмяФайла);
	Иначе
		
		Колонки = "Период, Клиент, ВидДоговораДоверительногоУправления, СчетДоверительногоУправления, ИнвестиционнаяДекларация, РегистрацияСтоимостиАктивов, СовокупнаяИнвестДекларация, Консолидирующая, РегистрацияСтоимостиАктивов_СЧА, РегистрацияСтоимостиАктивов_РСА, РегистрацияСтоимостиАктивов_КЗ";
		СоставСохр = СтруктураНастроек.СоставГрупповогоКонтроля.Скопировать(, Колонки);
		СоставТек = Объект.СоставГрупповогоКонтроля.Выгрузить().Скопировать(, Колонки);
		
		ТаблицаОтличий = УниверсальныеМеханизмы.РазницаТаблицЗначений(СоставТек, СоставСохр);
		
		Если ТаблицаОтличий.Количество()>0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отличаются таблицы состава группового контроля");
		КонецЕсли;
		
		СоставСохр = СтруктураНастроек.СоставГрупповогоКонтроля;
		СоставТек = Объект.СоставГрупповогоКонтроля;
		
		Для каждого СтрокаСоставТек Из СоставТек Цикл
			
			Если СтрокаСоставТек.СовокупнаяИнвестДекларация Тогда
				СтруктураОтбора = Новый Структура("Период, Клиент, ВидДоговораДоверительногоУправления");
				ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаСоставТек);
			Иначе
				СтруктураОтбора = Новый Структура("Период, Клиент, ВидДоговораДоверительногоУправления, СчетДоверительногоУправления, ИнвестиционнаяДекларация");
				ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаСоставТек);
			КонецЕсли;
			
			НайденныеСтроки = СоставСохр.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				УИДСохр = НайденныеСтроки[0].ИдентификаторРезультата;
				УИДТек = СтрокаСоставТек.ИдентификаторРезультата;
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("УИДСохр", УИДСохр);
				Запрос.УстановитьПараметр("УИДТек", УИДТек);
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ХранилищеЗначенийСохр.ХранилищеЗначения КАК ХранилищеЗначенияСохр,
					|	ХранилищеЗначенийТек.ХранилищеЗначения КАК ХранилищеЗначенияТек
					|ИЗ
					|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначенийСохр
					|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначенийТек
					|		ПО (ИСТИНА)
					|ГДЕ
					|	ХранилищеЗначенийСохр.Идентификатор = &УИДСохр
					|	И ХранилищеЗначенийСохр.Источник = ""_КонтрольИнвестиционныхДеклараций""
					|	И ХранилищеЗначенийТек.Идентификатор = &УИДТек
					|	И ХранилищеЗначенийТек.Источник = ""_КонтрольИнвестиционныхДеклараций""";
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() И ТипЗнч(Выборка.ХранилищеЗначенияСохр) = Тип("ХранилищеЗначения") И ТипЗнч(Выборка.ХранилищеЗначенияТек) = Тип("ХранилищеЗначения") Тогда
					
					РезультатыПроверкиСохр = Выборка.ХранилищеЗначенияСохр.Получить();
					РезультатыПроверкиТек = Выборка.ХранилищеЗначенияТек.Получить();
					
					Отказ = ТипЗнч(РезультатыПроверкиСохр) = Тип("Строка") Или ТипЗнч(РезультатыПроверкиТек) = Тип("Строка");
					
					Если Не Отказ Тогда
						
						Если СтрокаСоставТек.СовокупнаяИнвестДекларация Тогда
							ИмяФайла = "_" + Формат(СтруктураОтбора.Период, "ДФ=yyyyMMdd") + "_" + СтруктураОтбора.Клиент + "_" + СтруктураОтбора.ВидДоговораДоверительногоУправления;
						Иначе
						    ИмяФайла = "_" + Формат(СтруктураОтбора.Период, "ДФ=yyyyMMdd") + "_" + СтруктураОтбора.СчетДоверительногоУправления + "_" + СтруктураОтбора.ИнвестиционнаяДекларация;
						КонецЕсли;
						
						СравнитьРезультатыПроверки(РезультатыПроверкиСохр, РезультатыПроверкиТек, Каталог, ИмяФайла);					
						
					КонецЕсли; 
					
				Иначе
					Отказ = Истина;
				КонецЕсли;
				
				Если Отказ Тогда
					Если СтрокаСоставТек.СовокупнаяИнвестДекларация Тогда
					    ТекстСообщениия = СтрШаблон("Что-то пошло не так. Клиент: %1, Период: %2", 
							Строка(СтруктураОтбора.СчетДоверительногоУправления) + " - " + СтруктураОтбора.ВидДоговораДоверительногоУправления, 
							Формат(СтруктураОтбора.Период, "ДФ=dd.MM.yyyy"));
					Иначе
						ТекстСообщениия = СтрШаблон("Что-то пошло не так. Счет ДУ: %1, Период: %2", 
						СтруктураОтбора.СчетДоверительногоУправления, 
						Формат(СтруктураОтбора.Период, "ДФ=dd.MM.yyyy"));
					КонецЕсли; 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщениия);
				КонецЕсли; 
				
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СравнитьРезультатыПроверки(СтруктураРезультатовПроверкиСохр, СтруктураРезультатовПроверки, Каталог, ИмяФайла)

	ПараметрыБазисовСохр = СтруктураРезультатовПроверкиСохр.ПараметрыБазисов.Получить();
	ПараметрыБазисов = СтруктураРезультатовПроверки.ПараметрыБазисов.Получить();
	
	Для каждого ТекСтрока Из ПараметрыБазисов Цикл
		
		Отбор = Новый Структура("Базис, ИспользоватьМинимальноеЗначениеРейтинга, СчетДоверительногоУправления");
		ЗаполнитьЗначенияСвойств(Отбор, ТекСтрока);
		СохрСтроки = ПараметрыБазисовСохр.НайтиСтроки(Отбор);
		
		ТекПараметры = ТекСтрока.Параметры;
		
		Если СохрСтроки.Количество() = 1 Тогда
			СохрПараметры = СохрСтроки[0].Параметры;
		Иначе
			СохрПараметры = Неопределено;
		КонецЕсли; 
				
		Если СохрПараметры = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В сохраненных результатах отсутствует базис" + ТекСтрока.Базис);
		Иначе
			
			ТаблицаБазиса = ТекПараметры.ТаблицаБазиса.Скопировать();
			СохрТаблица = СохрПараметры.ТаблицаБазиса.Скопировать();
			
			ОбработатьТаблицуДляСравнения(ТаблицаБазиса, ЭтаФорма.Отладка_СравнитьТолькоБазисы);
			ОбработатьТаблицуДляСравнения(СохрТаблица, ЭтаФорма.Отладка_СравнитьТолькоБазисы);
			
			Измерения = "";
			Для каждого Колонка Из ТаблицаБазиса.Колонки Цикл
				Если Не Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
					Измерения = Измерения + "," + Колонка.Имя;
				КонецЕсли; 
			КонецЦикла; 
			
			ТаблицаОтличий = УниверсальныеМеханизмы.РазницаТаблицЗначений(ТаблицаБазиса, СохрТаблица, Сред(Измерения, 2));
			
			Если ТаблицаОтличий.Количество()>0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отличается таблица базиса" + ТекСтрока.Базис);
			КонецЕсли; 
			
		КонецЕсли; 
	
	КонецЦикла;
	
	Если Не Объект.ИнвестиционнаяДекларация.Консолидирующая Тогда
		
		ОтчетСохр = ПолучитьТабличныйДокументДляОтладки(СтруктураРезультатовПроверкиСохр);
		Отчет = ПолучитьТабличныйДокументДляОтладки(СтруктураРезультатовПроверки);
		ТекДата = ТекущаяДатаСеанса();
		//Каталог 	= ;
		КаталогТек	= Каталог + "Текущие\";
		КаталогСохр = Каталог + "Сохраненные\";
		
		Файл = Новый Файл(КаталогТек);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(КаталогТек);
		КонецЕсли;
		
		Файл = Новый Файл(КаталогСохр);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(КаталогСохр);
		КонецЕсли;
		
		ИмяФайла = РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(ИмяФайла);
		ОтчетСохр.Записать(КаталогСохр + ИмяФайла + ".mxl");
		Отчет.Записать(КаталогТек + ИмяФайла + ".mxl");
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сравнение результатов консолидирующей ИД не реализовано");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьТаблицуДляСравнения(ТаблицаКОбработке, ТолькоБазисы)

	КолонкиКОбработке = Новый Массив;
	КолонкиКУдалению = Новый Массив;
	
	КолонкиКлассификации = Новый Массив;
	КолонкиКлассификации.Добавить("Классификация");
	КолонкиКлассификации.Добавить("ДоПогашения");
	КолонкиКлассификации.Добавить("ПоАмортизированной");
	КолонкиКлассификации.Добавить("ССЧерезПрибыльИУбыток");
	КолонкиКлассификации.Добавить("ССЧерезПСД");
	
	Для каждого Колонка Из ТаблицаКОбработке.Колонки Цикл
		Если ТолькоБазисы И СтрНачинаетсяС(Колонка.Имя, "Доля") Тогда
		    КолонкиКУдалению.Добавить(Колонка);
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("Строка")) И Колонка.ТипЗначения.КвалификаторыСтроки.Длина = 0 Тогда
			КолонкиКОбработке.Добавить(Колонка.Имя);
		КонецЕсли;
		Если КолонкиКлассификации.Найти(Колонка.Имя) <> Неопределено Тогда
			КолонкиКУдалению.Добавить(Колонка);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого Колонка Из КолонкиКОбработке Цикл
		ЗначенияКолонки = ТаблицаКОбработке.ВыгрузитьКолонку(Колонка);
		ТаблицаКОбработке.Колонки.Удалить(Колонка);
		ТаблицаКОбработке.Колонки.Добавить(Колонка, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1024)));
	КонецЦикла;
	Для каждого Колонка Из КолонкиКУдалению Цикл
		ТаблицаКОбработке.Колонки.Удалить(Колонка);
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументДляОтладки(СтруктураРезультатовПроверки)

	Структура = СтруктураРезультатовПроверки.СтруктураФормированияОтчета.Получить();
	
	Настройки = Структура.Настройки;
	МассивУдаляемыхЭлементовСтруктуры = Новый Массив;
	
	ИмяВложенногоОбъекта = "";
	НомерБазиса = 0;
	
	Для каждого ВложенныйОбъект Из Настройки.Структура Цикл
		
		Использование = Ложь;
		
		Если ИмяВложенногоОбъекта = "" И Не Прав(ВложенныйОбъект.Имя, 6) = "Пустая" Тогда
			Использование = Истина;
		Иначе
			Если ЗначениеЗаполнено(НомерБазиса) И 
				(СтрЗаменить(ВложенныйОбъект.Имя, " Пустая", "") = Строка(ИмяВложенногоОбъекта)
					Или ВложенныйОбъект.Имя = "ВложеннаяСхема_" + НомерБазиса) Тогда
			
				Использование = Истина;
			
			КонецЕсли;
		КонецЕсли;
		
		ВложенныйОбъект.Использование = Использование;
		Если Не Использование Тогда
			МассивУдаляемыхЭлементовСтруктуры.Добавить(ВложенныйОбъект);
		КонецЕсли; 
	
	КонецЦикла; 
	
	Для каждого ВложенныйОбъект Из МассивУдаляемыхЭлементовСтруктуры Цикл
		Настройки.Структура.Удалить(ВложенныйОбъект);
	КонецЦикла; 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.ПолучитьРезультатКомпоновки(Структура.СКД, Настройки, Структура.ВнешниеНаборыДанных, Ложь);
	
	Возврат Результат.ТабличныйДокумент;
	
КонецФункции

#КонецОбласти 

&НаКлиенте
Процедура ЗагрузитьРезультатыПроверки(Команда)
	
	УИДСтрока = "";
	
	Если ВвестиСтроку(УИДСтрока, "Введите идентификатор результатов проверки") Тогда
		
		Попытка
			УИД = Новый УникальныйИдентификатор(УИДСтрока);
		Исключение
			Предупреждение("Введен неверный идентификатор результатов");
			Возврат;
		КонецПопытки; 
		
		ЗагрузитьРезультатыПроверкиНаСервере(УИД);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезультатыПроверкиНаСервере(Ключ)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Ключ) = Тип("УникальныйИдентификатор") Тогда
		Запрос.УстановитьПараметр("Идентификатор", Ключ);
	ИначеЕсли ТипЗнч(Ключ) = Тип("РегистрСведенийКлючЗаписи.ХранилищеЗначений") Тогда 
		Запрос.УстановитьПараметр("Идентификатор", Ключ.Идентификатор);
	КонецЕсли; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХранилищеЗначений.ХранилищеЗначения КАК ХранилищеЗначения
		|ИЗ
		|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
		|ГДЕ
		|	ХранилищеЗначений.Идентификатор = &Идентификатор
		|	И ХранилищеЗначений.Источник = ""_КонтрольИнвестиционныхДеклараций""";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		ЗаполнитьДанныеФормыИзХранилища(Выборка.ХранилищеЗначения); 
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Результаты проверки по данному идентификатору не найдены.");
	
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьДанныеФормыИзХранилища(ХранилищеЗначения)

	Значение = ХранилищеЗначения.Получить();
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
	
		Если Значение.Организация <> Объект.Организация Тогда
			Возврат;
		КонецЕсли; 
		
		ПоместитьВоВременноеХранилище(Значение, ЭтаФорма.АдресСтруктурыРезультатовПроверки);
		РезультатыДерево = РеквизитФормыВЗначение("РезультатыПроверки");
		//ЗначениеВРеквизитФормы(Значение.РезультатыПроверки, "РезультатыПроверки");
		ЗаполнитьРезультатыПроверки(РезультатыДерево, Значение.РезультатыПроверки);
		ЗначениеВРеквизитФормы(РезультатыДерево, "РезультатыПроверки");
		ЗаполнитьОтчетПоРезультатамКонтроляНаСервере(РезультатыДерево);
		//ПоместитьВоВременноеХранилище(Значение.СоставСовокупнойИнвестДекларации, АдресСоставаСовокупнойИнвестДекларации);
		//ЗаполнитьЗначенияСвойств(Объект, Значение, "СчетДоверительногоУправления, ИнвестиционнаяДекларация, Период");
		СписокСвойств = "СчетДоверительногоУправления, ИнвестиционнаяДекларация, Клиент, ВидДоговораДоверительногоУправления, Период, ДинамическийРасчетСтоимости, УчитыватьПлановыеОперации";
		МассивСвойств = СтрРазделить(СтрЗаменить(СписокСвойств, " ", ""), ",");
		Для каждого ИмяСвойства Из МассивСвойств Цикл
			Если Значение.Свойство(ИмяСвойства) Тогда
				Объект[ИмяСвойства] = Значение[ИмяСвойства];
			КонецЕсли; 
		КонецЦикла;
		
		Значение.Свойство("СовокупнаяИнвестДекларация", ЭтаФорма.СовокупнаяИнвестДекларация);
		Если Не Значение.Свойство("РежимСовокукпногоКонтроля", ЭтаФорма.РежимСовокукпногоКонтроля) Тогда
			ЭтаФорма.РежимСовокукпногоКонтроля = "Авто";
		КонецЕсли;
		
		НаборДействий = Новый Массив;
		НаборДействий.Добавить("ЗаполнитьСостав");
		НаборДействий.Добавить("ЗаполнитьДанныеРСА");
	
		Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда
			НаборДействий.Добавить("ЗаполнитьКлиента");
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Объект.ВидДоговораДоверительногоУправления) Тогда
			НаборДействий.Добавить("ЗаполнитьВидДоговора");
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			НаборДействий.Добавить("ЗаполнитьСчетДоверительногоУправления");
		КонецЕсли; 
		
		Если НаборДействий.Количество() > 0 Тогда
			ОбновитьРеквизитыКонтроляНаСервере(НаборДействий, Ложь);
		КонецЕсли; 
		
		СохраненныйСостав = Значение.СоставСовокупнойИнвестДекларации;
		АктуальныйСостав = ПолучитьИзВременногоХранилища(АдресСоставаСовокупнойИнвестДекларации);
		
		СоставыОтличаются = Истина;
		
		Если СохраненныйСостав.Количество() > 0 И СохраненныйСостав.Количество() = АктуальныйСостав.Количество() Тогда
			
			КолонкиДляСверки = "Назначение, ИнвестиционнаяДекларация, СчетДоверительногоУправления";
			СохраненныйСостав.Сортировать(КолонкиДляСверки);
			АктуальныйСостав.Сортировать(КолонкиДляСверки);
			
			КолонкиДляСверки = Новый Структура(КолонкиДляСверки);
			
			// Сравним составы построчно
			Для ИндексСтроки = 0 По СохраненныйСостав.Количество() - 1 Цикл
			
				Для каждого КЗ Из КолонкиДляСверки Цикл
				
					СоставыОтличаются = СохраненныйСостав[ИндексСтроки][КЗ.Ключ] <> АктуальныйСостав[ИндексСтроки][КЗ.Ключ];
					Если СоставыОтличаются Тогда
						Прервать;
					КонецЕсли;
				
				КонецЦикла; 
				
				Если СоставыОтличаются Тогда
					Прервать;
				КонецЕсли; 
			
			КонецЦикла; 
		
		КонецЕсли; 
		
		Если СоставыОтличаются Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Состав деклараций клиента изменился. Рекомендуется выполнить контроль повторно."); 
		КонецЕсли; 
		
		ЭтаФорма.ИспользоватьЦелевоеЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИнвестиционнаяДекларация, "ИспользоватьЦелевоеЗначение");
		
		Если Значение.Свойство("Претрейд") И ТипЗнч(Значение.Претрейд) = Тип("ТаблицаЗначений") Тогда
			Объект.Претрейд.Загрузить(Значение.Претрейд);
		Иначе
			Объект.Претрейд.Очистить();
		КонецЕсли; 
		
		Элементы.ГруппаСтраницыРежима.ТекущаяСтраница = Элементы.СтраницаИндивидуальныйКонтроль;
		Элементы.РезультатыПроверкиИнвестиционнаяДекларация.Видимость = Ложь;
		ЭтаФорма.РежимКонтроля = "ИндивидуальныйКонтроль";
		
		ЗаполнитьТабличныйДокументЦеныПоступлений();
		ЗаполнитьТабличныйДокументОшибкиОценки();
		ЗаполнитьТабличныйДокументРазличияОценки();
		ЗаполнитьТабличныйДокументПлановыеДанные();
		ЗаполнитьТабличныйДокументЦеныТМинус2();
		
		ЭтаФорма.Базис = Неопределено;
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументБазис, "НЕАКТУАЛЬНОСТЬ");
				
		Элементы.ФормаПоказатьОтчет.Видимость = Истина;
		Элементы.ФормаОтчетФидуциарнаяОтветственность.Видимость = Истина;
		Элементы.ФормаОтчетФидуциарнаяОтветственностьРасшифровка.Видимость = Истина;
		Элементы.ФормаОтчетФидуциарнаяОтветственностьСводный.Видимость = Истина;
		Элементы.ФормаВыгрузитьОтчетФидуциарнаяОтветственность.Видимость = Ложь;
		Элементы.РежимГрупповогоКонтроля.Видимость = Ложь;
		
		РеквизитыКонтроля = ПолучитьРеквизитыКонтроля(Объект.Период, Объект.Организация, Объект.СчетДоверительногоУправления);

		ЭтаФорма.РегистрацияСтоимостиАктивов = РеквизитыКонтроля.РегистрацияСтоимостиАктивов;
		ЭтаФорма.РегистрацияСтоимостиАктивов_СЧА = РеквизитыКонтроля.РегистрацияСтоимостиАктивов_СЧА;
		ЭтаФорма.РегистрацияСтоимостиАктивов_РСА = РеквизитыКонтроля.РегистрацияСтоимостиАктивов_РСА;
		ЭтаФорма.РегистрацияСтоимостиАктивов_КЗ = РеквизитыКонтроля.РегистрацияСтоимостиАктивов_КЗ;
		
		УстановитьВидимость(ЭтаФорма);
		УстановитьПереключательТипа(ЭтаФорма);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатыПроверки(ДеревоПриемник, ДеревоИсточник, ОчищатьПередЗаполнением = Истина)

	Если ОчищатьПередЗаполнением Тогда
		ДеревоПриемник.Строки.Очистить();
	КонецЕсли;
	
	НомерСтроки = 0;
	Показатели = Объект.ИнвестиционнаяДекларация.Показатели.Выгрузить(, "НомерСтроки, ИдентификаторСтрокиПоказателей, НаборИнвестиционнойДекларации, ВнутреннийНабор");
	
	Для каждого СтрокаДеревоИсточник Из ДеревоИсточник.Строки Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СтрокаДеревоПриемник = ДеревоПриемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДеревоПриемник, СтрокаДеревоИсточник);
		
		Если Не ЗначениеЗаполнено(СтрокаДеревоПриемник.ИдентификаторСтрокиПоказателей) Тогда
		
			СтрокаИД = Показатели.Найти(НомерСтроки, "НомерСтроки");
			Если СтрокаИД <> Неопределено Тогда
			
				СтрокаДеревоПриемник.ИдентификаторСтрокиПоказателей = СтрокаИД.ИдентификаторСтрокиПоказателей;
				СтрокаДеревоПриемник.ПредставлениеНабора = Формат(СтрокаИД.НомерСтроки, "ЧГ=0") + ". " + СтрокаИД.НаборИнвестиционнойДекларации + ?(СтрокаИД.ВнутреннийНабор, " (внутр.) ", "");
				СтрокаДеревоПриемник.НомерСтроки = СтрокаИД.НомерСтроки;
			
			КонецЕсли; 
		
		КонецЕсли; 
		
		Если СтрокаДеревоИсточник.РезультатПроверки = "Не пройдена" Тогда
			СтрокаДеревоПриемник.РезультатПроверки = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.Нарушение;
		ИначеЕсли СтрокаДеревоИсточник.РезультатПроверки = "Пройдена" Тогда 
			СтрокаДеревоПриемник.РезультатПроверки = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ПроверкаПройдена;
		КонецЕсли; 
		
		ЗаполнитьРезультатыПроверки(СтрокаДеревоПриемник, СтрокаДеревоИсточник, Ложь);
		
	КонецЦикла;
		
КонецПроцедуры
 

&НаКлиенте
Процедура ОстановитьВыполнениеКонтроля(Команда)
	
	Если Вопрос("Отменить выполнение группового контроля?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	
		ОтключитьОбработчикОжидания("ПроверитьСостояниеЗаданий");
		ЗавершитьЗаданияНаСервере(ЭтаФорма.ИдентификаторЗадания);
		ЗаполнитьСостоянияЗаданийНаСервере();
		ЭтаФорма.ИдентификаторЗадания = Неопределено;
		ИзменитьДоступностьЭлементов(Истина);
		
		ЗарегистрироватьОкончаниеСессииСбораСтатистики(ЭтаФорма.СессияСбораСтатистики, Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗавершитьЗаданияНаСервере(ИдентификаторЗадания)

	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСДлительнымиОперациями.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	МассивЗаданий = Новый Массив;
	МассивЗаданий.Добавить(ФоновоеЗадание);
	
	Попытка
		ФоновыеЗадания.ОжидатьЗавершения(МассивЗаданий);
	Исключение
	КонецПопытки;
		
	ИмяПодчиненныхЗаданий = "Контроль инвестиционной декларации (" + ПолучитьТекущийСеансИнформационнойБазы().НомерСеанса + ")";
	МассивПодчиненных = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Наименование, Статус", ИмяПодчиненныхЗаданий, СостояниеФоновогоЗадания.Активно));
	Для каждого ФоновоеЗадание Из МассивПодчиненных Цикл
		РаботаСДлительнымиОперациями.ОтменитьВыполнениеЗадания(ФоновоеЗадание.УникальныйИдентификатор);
	КонецЦикла; 
	
	Попытка
		ФоновыеЗадания.ОжидатьЗавершения(МассивПодчиненных);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Отладка_КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = Отладка_Каталог;
	
	Если Диалог.Выбрать() Тогда
		Отладка_Каталог = Диалог.Каталог;
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ПараметрыСбораСтатистики)
	
	Описание = "";
	
	Для каждого Параметр Из ПараметрыСбораСтатистики Цикл
	
		Описание = Описание + Символы.ПС + Параметр.Ключ + ": " + Параметр.Значение;
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыСбораСтатистики, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессииСбораСтатистики(СессияСбораСтатистики, ОтмененоПользователем)

	Механизм = "_КонтрольИнвестиционныхДеклараций.ВыполнитьГрупповойКонтрольФоново";
	
	Если ОтмененоПользователем Тогда
		
		Запись = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.СоздатьМенеджерЗаписи();
		Запись.Механизм = "_КонтрольИнвестиционныхДеклараций.ВыполнитьГрупповойКонтрольФоново";
		Запись.Сессия   = СессияСбораСтатистики;
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			Запись.ПериодВыполненияОкончание = ТекущаяДата();
			Запись.ПериодВыполненияОкончаниеМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Запись.Описание = "Выполнение контроля отменено пользователем" + Символы.ПС + Запись.Описание;
			Запись.Записать();	
		КонецЕсли;
		
	Иначе
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, СессияСбораСтатистики);
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВызовМетодаМодуляОбработки(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("СоздатьОтложенные", "Создать отложенные задания");
	СписокКнопок.Добавить("СоздатьОтложенные2", "Создать отложенные задания Т+1");
	СписокКнопок.Добавить("КонтрольНовых", "Контроль новых ИД");
	СписокКнопок.Добавить("ЗапускОтложенныхЗаданий", "Запуск отложенных заданий");
	Метод = Вопрос("Что делать?", СписокКнопок, , "ЗапускОтложенныхЗаданий"); 
	
	Если ТипЗнч(Метод) = Тип("Строка") Тогда
		
		Если СтрНачинаетсяС(Метод, "СоздатьОтложенные") Тогда
			// КонтрольИнвестиционныхДекларацийЗаТекущийДень
			КнопкиРежима = Новый СписокЗначений;
			КнопкиРежима.Добавить("Все", 		"Без отбора");
			КнопкиРежима.Добавить("ТолькоИИС", 	"Только ИИС");
			КнопкиРежима.Добавить("БезИИС", 	"Исключая ИИС");
			КнопкиРежима.Добавить("СвойОтбор", 	"Свой отбор");
			КнопкиРежима.Добавить(Неопределено, "Отмена");
			РежимОтбора = Вопрос("Выберите режим отбора", КнопкиРежима, , "СвойОтбор");
			
			Если ТипЗнч(РежимОтбора) = Тип("Строка") Тогда
				Если РежимОтбора = "СвойОтбор" Тогда
					РежимОтбора = "СчетаДоверительногоУправления.Код = ""РНТ-00035""";
					ВвестиСтроку(РежимОтбора, "Секция 'ГДЕ' запроса к справочнику счетов ДУ",, Истина);
					Если РежимОтбора <> Неопределено Тогда
						ВызовМетодаМодуляОбработкиНаСервере(Метод, РежимОтбора)
					КонецЕсли;
				Иначе
					ВызовМетодаМодуляОбработкиНаСервере(Метод, РежимОтбора);
				КонецЕсли; 
			КонецЕсли;
			
		ИначеЕсли Метод = "ЗапускОтложенныхЗаданий" Тогда 
			ПараметрыФормы = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина, Истина);
			Результат = ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.ФормаВыбораОтложенныхЗаданийДляЗапуска", ПараметрыФормы);
			Если Результат <> Неопределено Тогда
				ВызовМетодаМодуляОбработкиНаСервере(Метод, Результат);
			КонецЕсли; 
		Иначе	
			ВызовМетодаМодуляОбработкиНаСервере(Метод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВызовМетодаМодуляОбработкиНаСервере(Метод, Отбор = "") 
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если СтрНачинаетсяС(Метод, "СоздатьОтложенные") Тогда
		
		ПараметрыКоманды = Новый Структура("Организация, Режим", Объект.Организация, Отбор);
			
		ПараметрыОбработки = Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды", 
			РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_КонтрольИнвестиционныхДеклараций"), 
			"СоздатьОтложенныеЗаданияКонтроляТекущегоДня");
	
		Префикс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыКоманды.Организация, "ПрефиксНумерации"); 
		
		Если Метод = "СоздатьОтложенные" Тогда
			
			// Текущий день
			Период = НачалоДня(ТекущаяДатаСеанса());
			Команда = СтрШаблон("КонтрольТекущегоДня_%1_%2", Префикс, ПараметрыКоманды.Режим);
			
		Иначе
			
			// День Т+1
			Период = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, КонецДня(ТекущаяДатаСеанса()) + 1, 1);
			Команда = СтрШаблон("КонтрольДняТПлюс1_%1_%2", Префикс, ПараметрыКоманды.Режим);
		
		КонецЕсли; 
		
		ПараметрыОЗ = Новый Структура;
		ПараметрыОЗ.Вставить("Период", 				Период);
		ПараметрыОЗ.Вставить("Организация", 		ПараметрыКоманды.Организация);
		ПараметрыОЗ.Вставить("Режим", 				ПараметрыКоманды.Режим);
		ПараметрыОЗ.Вставить("ДатаЗапускаПлан", 	Неопределено);
		ПараметрыОЗ.Вставить("Команда", 			Команда);
		ПараметрыОЗ.Вставить("ИдентификаторКоманды", 			ПараметрыОбработки.ИдентификаторКоманды);
		ПараметрыОЗ.Вставить("ДополнительнаяОбработкаСсылка", 	ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
		
		ОбъектНаСервере.СоздатьОтложенныеЗаданияКонтроляЗаДень(ПараметрыОЗ);
		
	ИначеЕсли Метод = "КонтрольНовых" Тогда 	
		
		ПараметрыКоманды = Новый Структура("Организация", Объект.Организация);
			
		ПараметрыОбработки = Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды", 
			РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_КонтрольИнвестиционныхДеклараций"), 
			"КонтрольНовыхИнвестиционныхДекларацийЗа7Дней");
			
		ОбъектНаСервере.КонтрольНовыхИнвестиционныхДекларацийЗа7Дней(ПараметрыКоманды, ПараметрыОбработки);
		
	ИначеЕсли Метод = "ЗапускОтложенныхЗаданий" Тогда 
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ОтложенныеЗадания.Идентификатор КАК Идентификатор,
			|	ОтложенныеЗадания.Параметры КАК Параметры,
			|	ОтложенныеЗадания.Команда КАК Команда
			|ИЗ
			|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
			|ГДЕ
			|	ОтложенныеЗадания.Идентификатор В(&Идентификаторы)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		Идентификаторы = Новый Массив;
		Для каждого Ключ Из Отбор Цикл
			Идентификаторы.Добавить(Ключ.Идентификатор);
		КонецЦикла; 
		
		Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Экземпляры = Новый Массив;
		Метод = "";
		Пока Выборка.Следующий() Цикл
		
			Экземпляры.Добавить(Новый Структура("Параметры, Идентификатор", 
				Выборка.Параметры.Получить(), 
				Выборка.Идентификатор));
				
			Если Метод = "" Тогда
			
				Метод = Выборка.Команда;
			
			КонецЕсли;
				
		КонецЦикла;
		Если Экземпляры.Количество() > 0 Тогда
			ОбъектНаСервере.ВыполнитьМетод(Метод, Экземпляры);
		КонецЕсли; 	
		
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция АктуальнаяВерсияОбработки()
	
	Возврат РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_КонтрольИнвестиционныхДеклараций").Версия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(ЭтаФорма)

	ЭтаФорма.Элементы.ИнвестиционнаяДекларация.ПодсказкаВвода = "По назначенным ИД"; 
		
	ЭтаФорма.Элементы.Клиент.АвтоОтметкаНезаполненного = Истина;
	ЭтаФорма.Элементы.ВидДоговораДоверительногоУправления1.АвтоОтметкаНезаполненного = Истина;
	
	ЭтаФорма.Элементы.СчетДоверительногоУправления.АвтоОтметкаНезаполненного = Ложь;
	ЭтаФорма.Элементы.СчетДоверительногоУправления.ОтметкаНезаполненного = Ложь;
	ЭтаФорма.Элементы.ИнвестиционнаяДекларация.АвтоОтметкаНезаполненного = Ложь;
	ЭтаФорма.Элементы.ИнвестиционнаяДекларация.ОтметкаНезаполненного = Ложь;
	
	Если ЭтаФорма.РежимСовокукпногоКонтроля = "Авто" Тогда
		
		ЭтаФорма.Элементы.Клиент.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.КлиентПИФ.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.ВидДоговораДоверительногоУправления1.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.СчетДоверительногоУправления.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.ИнвестиционнаяДекларация.ТолькоПросмотр = Истина;
		
	ИначеЕсли ЭтаФорма.РежимСовокукпногоКонтроля = "Совокупно" Тогда 
		
		ЭтаФорма.Элементы.Клиент.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.КлиентПИФ.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.ВидДоговораДоверительногоУправления1.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.СчетДоверительногоУправления.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.ИнвестиционнаяДекларация.ТолькоПросмотр = Ложь;
		
	ИначеЕсли ЭтаФорма.РежимСовокукпногоКонтроля = "Индивидуально" Тогда 
		
		ЭтаФорма.Элементы.Клиент.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.КлиентПИФ.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.ВидДоговораДоверительногоУправления1.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.СчетДоверительногоУправления.ТолькоПросмотр = Ложь;
		ЭтаФорма.Элементы.ИнвестиционнаяДекларация.ТолькоПросмотр = Ложь;
		
		ЭтаФорма.Элементы.ИнвестиционнаяДекларация.ПодсказкаВвода = "";
		ЭтаФорма.Элементы.Клиент.АвтоОтметкаНезаполненного = Ложь;
		ЭтаФорма.Элементы.ВидДоговораДоверительногоУправления1.АвтоОтметкаНезаполненного = Ложь;
		
		ЭтаФорма.Элементы.СчетДоверительногоУправления.АвтоОтметкаНезаполненного = Истина;
		ЭтаФорма.Элементы.ИнвестиционнаяДекларация.АвтоОтметкаНезаполненного = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервере
Процедура ПолучитьРезультатыКонтроляНаСервере()

	Элементы.ЗагрузитьРезультатыКонтроля.Видимость = Ложь;
	
	СтруктураОтбора = Новый Структура("Организация, Период, Клиент, ВидДоговораДоверительногоУправления, СчетДоверительногоУправления, ИнвестиционнаяДекларация");
	ЗаполнитьЗначенияСвойств(СтруктураОтбора, Объект);
	СтруктураОтбора.Вставить("СовокупнаяИнвестДекларация", ЭтаФорма.СовокупнаяИнвестДекларация);
	СтруктураОтбора.Вставить("РежимСовокукпногоКонтроля", ЭтаФорма.РежимСовокукпногоКонтроля);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыОтбора = ОбработкаОбъект.ПараметрыОтбораДляХранилищаЗначений(СтруктураОтбора);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХранилищеЗначений.Идентификатор КАК Идентификатор,
		|	ХранилищеЗначений.ДатаСоздания КАК ДатаСоздания,
		|	ХранилищеЗначений.ХранилищеЗначения КАК ХранилищеЗначения
		|ИЗ
		|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
		|ГДЕ
		|	ХранилищеЗначений.Источник = ""_КонтрольИнвестиционныхДеклараций""
		|	И ХранилищеЗначений.КонтрольнаяСумма = &КонтрольнаяСумма
		|
		|УПОРЯДОЧИТЬ ПО
		|	ХранилищеЗначений.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("КонтрольнаяСумма", ПараметрыОтбора.КонтрольнаяСумма);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивРезультатовКонтроля = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Значение = Выборка.ХранилищеЗначения.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			
			МассивРезультатовКонтроля.Добавить(Выборка.Идентификатор);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если МассивРезультатовКонтроля.Количество() > 0 Тогда
		
		Элементы.ЗагрузитьРезультатыКонтроля.Видимость = Истина;
		ЭтаФорма.АдресМассиваРезультатовКонтроля = ПоместитьВоВременноеХранилище(МассивРезультатовКонтроля, ЭтаФорма.АдресМассиваРезультатовКонтроля);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатыКонтроляНажатие(Элемент)
	
	ПолучитьРезультатыКонтроляНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивИдентификаторов", ПолучитьИзВременногоХранилища(АдресМассиваРезультатовКонтроля));
	
	Результат = ОткрытьФормуМодально("ВнешняяОбработка._КонтрольИнвестиционныхДеклараций.Форма.ФормаЗагрузкиРезультатов", ПараметрыФормы, ЭтаФорма);
	Если Результат <> Неопределено Тогда
		ЗагрузитьРезультатыПроверкиНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимФильтрацииРезультатовИндивидуальногоКонтроляПриИзменении(Элемент)
	
	ЗаполнитьОтчетПоРезультатамКонтроляНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтчетПоРезультатамКонтроляНаСервере(Знач Дерево = Неопределено)

	Если Дерево = Неопределено Тогда
		Дерево = РеквизитФормыВЗначение("РезультатыПроверки");
	КонецЕсли; 
	
	ЭтаФорма.ТабличныйДокументРезультатыКонтроля.Очистить();
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("РезультатыКонтроля");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	СтрокаИД = Макет.ПолучитьОбласть("СтрокаИД");
	Строка = Макет.ПолучитьОбласть("Строка");
	ЭтаФорма.ТабличныйДокументРезультатыКонтроля.Вывести(Шапка);
	ЭтаФорма.ТабличныйДокументРезультатыКонтроля.ФиксацияСверху = 1;
	
	Нарушение = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.Нарушение;
	Несоответствие = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.Несоответствие;
	ПроверкаПройдена = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.ПроверкаПройдена;
	
	ТекущаяИД = Неопределено;
	ТекущееНазначение = Неопределено;
	ЭтаФорма.ДанныеРасшифровкиРезультатовКонтроля = Новый Структура;
	ИндексРасшифровки = 0;
	// добавить заполнение консолидирующих ИД
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
	
		Если ЭтаФорма.РежимФильтрацииРезультатовИндивидуальногоКонтроля = 0 // выводим все строки
			Или (ЭтаФорма.РежимФильтрацииРезультатовИндивидуальногоКонтроля = 1 // любые нарушения 
				И СтрокаДерева.РезультатПроверки <> ПроверкаПройдена)
			Или (ЭтаФорма.РежимФильтрацииРезультатовИндивидуальногоКонтроля = 2 // нарушения ИД 
				И СтрокаДерева.РезультатПроверки = Нарушение И Не СтрокаДерева.ВнутреннийНабор)
			Или (ЭтаФорма.РежимФильтрацииРезультатовИндивидуальногоКонтроля = 3 // нарушения внутр 
				И СтрокаДерева.РезультатПроверки = Нарушение И СтрокаДерева.ВнутреннийНабор)
			Или (ЭтаФорма.РежимФильтрацииРезультатовИндивидуальногоКонтроля = 4 // несоответствия ИД
				И СтрокаДерева.РезультатПроверки = Несоответствие И Не СтрокаДерева.ВнутреннийНабор)
			Или (ЭтаФорма.РежимФильтрацииРезультатовИндивидуальногоКонтроля = 5 // несоответствия внутр
				И СтрокаДерева.РезультатПроверки = Несоответствие И СтрокаДерева.ВнутреннийНабор) Тогда 
				
			Если ТекущаяИД <> СтрокаДерева.ИнвестиционнаяДекларация Или ТекущееНазначение <> СтрокаДерева.Назначение Тогда
				// выводим название ИД
				
				Если ТекущаяИД <> Неопределено Тогда
				
					ЭтаФорма.ТабличныйДокументРезультатыКонтроля.ЗакончитьГруппуСтрок();
				
				КонецЕсли; 
				
				РеквизитыИД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДерева.ИнвестиционнаяДекларация, "ТипИнвестиционнойДекларации, СовокупныйКонтроль, Наименование, Комментарий");
				
				ПредставлениеИнвестиционнойДекларации = Строка(РеквизитыИД.ТипИнвестиционнойДекларации) + ?(РеквизитыИД.СовокупныйКонтроль, " (совокупно): ", ": ") 
					+ ?(РеквизитыИД.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация, Строка(СтрокаДерева.Назначение.Субъект) + " - ", "")
					+ РеквизитыИД.Наименование + ?(ЗначениеЗаполнено(РеквизитыИД.Комментарий), Символы.ПС + РеквизитыИД.Комментарий, "");
					
				СтрокаИД.Параметры.ПредставлениеИнвестиционнойДекларации = ПредставлениеИнвестиционнойДекларации;
				СтрокаИД.Параметры.РасшифровкаИД = ДобавитьРасшифровку(ИндексРасшифровки, "ИД", СтрокаДерева);
				СтрокаИД.Параметры.Назначение = "Действует с " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.Назначение, "Дата"), "ДФ=dd.MM.yyyy");
				СтрокаИД.Параметры.НазначениеСсылка = ДобавитьРасшифровку(ИндексРасшифровки, "Назначение", СтрокаДерева);
				
				ЭтаФорма.ТабличныйДокументРезультатыКонтроля.Вывести(СтрокаИД);
				
				ТекущаяИД = СтрокаДерева.ИнвестиционнаяДекларация;
				ТекущееНазначение = СтрокаДерева.Назначение;
				ЭтаФорма.ТабличныйДокументРезультатыКонтроля.НачатьГруппуСтрок();
				
			КонецЕсли; 	
				
			Строка.Параметры.Заполнить(СтрокаДерева);
			Строка.Параметры.РасшифровкаНабора = ДобавитьРасшифровку(ИндексРасшифровки, "Набор", СтрокаДерева);
			Строка.Параметры.РасшифровкаРезультата = ДобавитьРасшифровку(ИндексРасшифровки, "Результат", СтрокаДерева);
						
			Строка.Параметры.Мин = Строка(СтрокаДерева.МинимальноеЗначение) + ?(СтрокаДерева.АбсолютнаяВеличинаМин, "", "%");
			Строка.Область().ЦветТекста = Новый Цвет(0, 0, 0);
			Если СтрокаДерева.АбсолютнаяВеличинаМакс И СтрокаДерева.МаксимальноеЗначение = 0 Тогда
				Строка.Параметры.Макс = "Без ограничения";
				Строка.Область("Макс").ЦветТекста = Новый Цвет(128, 128, 128);
			Иначе
				Строка.Параметры.Макс = Строка(СтрокаДерева.МаксимальноеЗначение) + ?(СтрокаДерева.АбсолютнаяВеличинаМакс, "", "%");		
			КонецЕсли; 
			
			Если СтрокаДерева.ГруппаРезультатов Тогда
			
				Строка.Параметры.Сумма = "{...}";
				Строка.Параметры.Доля = "{...}";
				
			Иначе
				
				Строка.Параметры.Сумма = Формат(СтрокаДерева.Сумма, "ЧДЦ=2; ЧН=0,00");
				
				Если Строка.Параметры.Доля = 999 Тогда
					Строка.Параметры.Доля = "База = 0";
				Иначе
					Строка.Параметры.Доля = Формат(СтрокаДерева.Доля, "ЧДЦ=2; ЧН=0,00");
				КонецЕсли;			
			
			КонецЕсли; 
			
			Если СтрокаДерева.РезультатПроверки = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.Нарушение Тогда
				Строка.Область().ЦветТекста = Новый Цвет(255, 0, 0);
			ИначеЕсли СтрокаДерева.РезультатПроверки = Перечисления.РезультатыКонтроляИнвестиционнойДекларации.Несоответствие Тогда 
				Строка.Область().ЦветТекста = Новый Цвет(205, 92, 92);
			КонецЕсли; 
			
			Если СтрокаДерева.ВнутреннийНабор Тогда
				Строка.Область("ПредставлениеНабора").ЦветТекста = Новый Цвет(128, 128, 128);
			КонецЕсли; 
			
			ЭтаФорма.ТабличныйДокументРезультатыКонтроля.Вывести(Строка);				
				
		КонецЕсли; 
		
	КонецЦикла;
	Если ТекущаяИД <> Неопределено Тогда
		ЭтаФорма.ТабличныйДокументРезультатыКонтроля.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокументРезультатыКонтроля, "НеИспользовать");
	Элементы.ТабличныйДокументРезультатыКонтроля.ТекущаяОбласть = ЭтаФорма.ТабличныйДокументРезультатыКонтроля.Область(1,1,1,1);

КонецПроцедуры

&НаСервере
Функция ДобавитьРасшифровку(ИндексРасшифровки, ИмяОбъектаРасшифровки, СтрокаДерева)

	 ЭлементРасшифровки = Новый Структура("Назначение, ИнвестиционнаяДекларация, ИдентификаторСтрокиПоказателей");
	 ЗаполнитьЗначенияСвойств(ЭлементРасшифровки, СтрокаДерева);
	 ЭлементРасшифровки.Вставить("Объект", ИмяОбъектаРасшифровки);
	 КлючЭлемента = "_" + Формат(ИндексРасшифровки, "ЧГ=0");
	 ЭтаФорма.ДанныеРасшифровкиРезультатовКонтроля.Вставить(КлючЭлемента, ЭлементРасшифровки);
	 ИндексРасшифровки = ИндексРасшифровки + 1;
	 Возврат КлючЭлемента;
	 
КонецФункции
 
&НаКлиенте
Процедура ТабличныйДокументРезультатыКонтроляОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("Строка") И СтрНачинаетсяС(Расшифровка, "_") Тогда
		
		ЭлементРасшифровки = ЭтаФорма.ДанныеРасшифровкиРезультатовКонтроля[Расшифровка];
		
		СтрокиДерева = ЭтаФорма.РезультатыПроверки.ПолучитьЭлементы();
		
		Для каждого ТекСтрока Из СтрокиДерева Цикл
			
			Если ТекСтрока.ИнвестиционнаяДекларация = ЭлементРасшифровки.ИнвестиционнаяДекларация 
				И ТекСтрока.ИдентификаторСтрокиПоказателей = ЭлементРасшифровки.ИдентификаторСтрокиПоказателей 
				И ТекСтрока.Назначение = ЭлементРасшифровки.Назначение Тогда
				
				Если ЭлементРасшифровки.Объект = "Результат" Тогда
					
					ВывестиРасшифровку(ТекСтрока.ИмяВложенногоОбъекта, ТекСтрока.НомерБазиса, ТекСтрока.ИмяПоляДоля);
					
				ИначеЕсли ЭлементРасшифровки.Объект = "Набор" Тогда 
					
					Форма = ПолучитьФорму("Справочник.ИнвестиционныеДекларации.Форма.ФормаЭлемента", Новый Структура("Ключ", ТекСтрока.ИнвестиционнаяДекларация), Элемент, ЭтаФорма);
					НайденныеСтроки = Форма.Объект.Показатели.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоказателей", ЭлементРасшифровки.ИдентификаторСтрокиПоказателей));
					Если Форма.Открыта() Тогда
					    Форма.Активизировать();
					Иначе
						Форма.Открыть();
					КонецЕсли; 
					Если НайденныеСтроки.Количество() = 1 Тогда
						Форма.Элементы.Показатели.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
					КонецЕсли;
					
				ИначеЕсли ЭлементРасшифровки.Объект = "ИД" Тогда 
					
					Форма = ПолучитьФорму("Справочник.ИнвестиционныеДекларации.Форма.ФормаЭлемента", Новый Структура("Ключ", ТекСтрока.ИнвестиционнаяДекларация), Элемент, ЭтаФорма);
					Если Форма.Открыта() Тогда
					    Форма.Активизировать();
					Иначе
						Форма.Открыть();
					КонецЕсли;
					
				ИначеЕсли ЭлементРасшифровки.Объект = "Назначение" И ЗначениеЗаполнено(ТекСтрока.Назначение) Тогда 
					
					Форма = ПолучитьФорму("Документ.НазначениеИнвестиционнойДекларации.Форма.ФормаДокумента", Новый Структура("Ключ", ТекСтрока.Назначение), Элемент, ЭтаФорма);
					Если Форма.Открыта() Тогда
					    Форма.Активизировать();
					Иначе
						Форма.Открыть();
					КонецЕсли;
					
				КонецЕсли;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументРезультатыКонтроляОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("Строка") И СтрНачинаетсяС(Расшифровка, "_") Тогда
		
		ЭлементРасшифровки = ЭтаФорма.ДанныеРасшифровкиРезультатовКонтроля[Расшифровка];
		
		Если ЭлементРасшифровки.Объект = "Результат" Тогда
			
			СтрокиДерева = ЭтаФорма.РезультатыПроверки.ПолучитьЭлементы();
			
			Для каждого ТекСтрока Из СтрокиДерева Цикл
				
				Если ТекСтрока.ИнвестиционнаяДекларация = ЭлементРасшифровки.ИнвестиционнаяДекларация 
					И ТекСтрока.ИдентификаторСтрокиПоказателей = ЭлементРасшифровки.ИдентификаторСтрокиПоказателей 
					И ТекСтрока.Назначение = ЭлементРасшифровки.Назначение
					И ТекСтрока.РезультатПроверки <> ПредопределенноеЗначение("Перечисление.РезультатыКонтроляИнвестиционнойДекларации.ПроверкаПройдена") Тогда
					
					СписокДействий = Новый СписокЗначений;
						
					СписокДействий.Добавить("ПоказатьРасшифровку", "Открыть расшифровку");
						
					//Если Не ЗначениеЗаполнено(ТекСтрока.НесоответствиеИнвестиционнойДекларации)
					//	Или (ЗначениеЗаполнено(ТекСтрока.ДатаУстранения) И ТекСтрока.ДатаУстранения < Объект.Период) Тогда 
					СписокДействий.Добавить("Создать", "Зарегистрировать несоответствие");
					//КонецЕсли; 
					
					Если ЗначениеЗаполнено(ТекСтрока.НесоответствиеИнвестиционнойДекларации) Тогда
						СписокДействий.Добавить("Открыть", "Открыть документ");
					КонецЕсли;
						
					Действие = ВыбратьИзМеню(СписокДействий);
					
					Если Действие = Неопределено Тогда
						Возврат;
					ИначеЕсли Действие.Значение = "Создать" Тогда
						ПараметрыЗполнения = Новый Структура("ИмяВложенногоОбъекта, НомерБазиса, ИнвестиционнаяДекларация, ИдентификаторСтрокиПоказателей");
						ЗаполнитьЗначенияСвойств(ПараметрыЗполнения, ТекСтрока);
						РеквизитыНазначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСтрока.Назначение, "Субъект, ВидДоговораДоверительногоУправления"); 
						ПараметрыЗполнения.Вставить("Дата", Объект.Период);
						ПараметрыЗполнения.Вставить("Организация", Объект.Организация);
						ПараметрыЗполнения.Вставить("Субъект", РеквизитыНазначения.Субъект);
						ПараметрыЗполнения.Вставить("ВидДоговораДоверительногоУправления", РеквизитыНазначения.ВидДоговораДоверительногоУправления);
						ЗначенияЗаполнения = ПолучитьЗначенияЗаполненияНесоответствиеИД(ПараметрыЗполнения);
						ОткрытьФорму("Документ.НесоответствиеИнвестиционнойДекларации.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
					ИначеЕсли Действие.Значение = "Открыть" Тогда
						ОткрытьФорму("Документ.НесоответствиеИнвестиционнойДекларации.ФормаОбъекта", Новый Структура("Ключ", ТекСтрока.НесоответствиеИнвестиционнойДекларации));
					ИначеЕсли Действие.Значение = "ПоказатьРасшифровку" Тогда
						ВывестиРасшифровку(ТекСтрока.ИмяВложенногоОбъекта, ТекСтрока.НомерБазиса, ТекСтрока.ИмяПоляДоля);
					КонецЕсли;
					
					Прервать;
				
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	НаборДействий = Новый Массив;
	НаборДействий.Добавить("ЗаполнитьСчетДоверительногоУправления");
	НаборДействий.Добавить("ЗаполнитьВидДоговора");
	НаборДействий.Добавить("ЗаполнитьСостав");
	НаборДействий.Добавить("ЗаполнитьДанныеРСА");
	
	Если ЭтаФорма.РежимСовокукпногоКонтроля <> "Совокупно" Тогда
	
		НаборДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
	
	КонецЕсли; 
		
	ОбновитьРеквизитыКонтроля(НаборДействий);
	//ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораДоверительногоУправления1ПриИзменении(Элемент)

	НаборДействий = Новый Массив;
	НаборДействий.Добавить("ЗаполнитьСчетДоверительногоУправления");
	НаборДействий.Добавить("ЗаполнитьСостав");
	НаборДействий.Добавить("ЗаполнитьДанныеРСА");
	
	Если ЭтаФорма.РежимСовокукпногоКонтроля <> "Совокупно" Тогда
	
		НаборДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
	
	КонецЕсли; 
		
	ОбновитьРеквизитыКонтроля(НаборДействий);
	//ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСовокукпногоКонтроляПриИзменении(Элемент)
	
	ЭтаФорма.СовокупнаяИнвестДекларация = (ЭтаФорма.РежимСовокукпногоКонтроля = "Совокупно");
	
	НаборДействий = Новый Массив;
	
	Если ЭтаФорма.РежимСовокукпногоКонтроля = "Авто" Тогда
	
		Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			НаборДействий.Добавить("ЗаполнитьКлиента");
		Иначе
			НаборДействий.Добавить("ЗаполнитьСчетДоверительногоУправления");
		КонецЕсли; 
		
		НаборДействий.Добавить("ЗаполнитьВидДоговора");
		НаборДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
		
	ИначеЕсли ЭтаФорма.РежимСовокукпногоКонтроля = "Индивидуально" И ЗначениеЗаполнено(Объект.СчетДоверительногоУправления)
		И Не ЗначениеЗаполнено(Объект.ИнвестиционнаяДекларация) Тогда
		
		НаборДействий.Добавить("ЗаполнитьИнвестиционнуюДекларацию");
		
	КонецЕсли; 
	
	НаборДействий.Добавить("ЗаполнитьСостав");
	НаборДействий.Добавить("ЗаполнитьДанныеРСА");
	
	ОбновитьРеквизитыКонтроля(НаборДействий);
	
	//УстановитьВидимость(ЭтаФорма);
	//ПолучитьРезультатыКонтроляНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПИФПриИзменении(Элемент)
	
	Если ЭтаФорма.КлиентПИФ = 0 Тогда
		Объект.Клиент = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
	Иначе
		Объект.Клиент = ПредопределенноеЗначение("Справочник.ПаевыеИнвестиционныеФонды.ПустаяСсылка");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПереключательТипа(Этаформа)

	Если ТипЗнч(Этаформа.Объект.Клиент) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		ЭтаФорма.КлиентПИФ = 0;
	ИначеЕсли ТипЗнч(Этаформа.Объект.Клиент) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		ЭтаФорма.КлиентПИФ = 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьИзменениеРежимаПолученияСтоимости(Команда)
	
	Элементы.ФормаРазрешитьИзменениеРежимаПолученияСтоимости.Пометка = Не Элементы.ФормаРазрешитьИзменениеРежимаПолученияСтоимости.Пометка;
	Элементы.ДинамическийРасчетСтоимости.Видимость = Элементы.ФормаРазрешитьИзменениеРежимаПолученияСтоимости.Пометка;
	Элементы.ДинамическийРасчетСтоимости.Доступность = Элементы.ФормаРазрешитьИзменениеРежимаПолученияСтоимости.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьНастройки(Команда)
	
	Элементы.КомандаСкрытьНастройки.Пометка = Не Элементы.КомандаСкрытьНастройки.Пометка;
	
	Если Элементы.КомандаСкрытьНастройки.Пометка Тогда
	
		Элементы.КомандаСкрытьНастройки.Заголовок = "Показать параметры";
		Элементы.КомандаСкрытьНастройки.Картинка = БиблиотекаКартинок.ПоказатьПароль;
		
	Иначе
		
		Элементы.КомандаСкрытьНастройки.Заголовок = "Скрыть параметры";
		Элементы.КомандаСкрытьНастройки.Картинка = БиблиотекаКартинок.СкрытьПароль;
	
	КонецЕсли;
	
	Элементы.ДекорацияПараметрыИндивидуальногоКонтроля.Видимость = Элементы.КомандаСкрытьНастройки.Пометка;
	Элементы.Шапка.Видимость = Не Элементы.КомандаСкрытьНастройки.Пометка;
	Элементы.ГруппаПретрейд.Видимость = Не Элементы.КомандаСкрытьНастройки.Пометка;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьДекорациюДатаМаксДД(ДатаМаксДД)

	Элементы.ДатаМаксДД.Видимость = Истина;
	Если ЗначениеЗаполнено(ДатаМаксДД) Тогда
		Элементы.ДатаМаксДД.Заголовок = "Не удалось определить показатель MaxDD";
	Иначе
		Элементы.ДатаМаксДД.Заголовок = "Для расчета показателя MaxDD использована СЧА на "
			+ Формат(ДатаМаксДД, "ДФ=dd.MM.yyyy");
	КонецЕсли;

КонецПроцедуры