
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Объект		= Форма.Объект;
	Элементы	= Форма.Элементы;
	
	Элементы.ЦенныеБумаги.Видимость = Объект.ПереоцениватьЦенныеБумаги;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаХМЛ.ISIN КАК ISIN
		|ПОМЕСТИТЬ _ТаблицаХМЛ
		|ИЗ
		|	&ТаблицаХМЛ КАК ТаблицаХМЛ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ISIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследних.Объект, НЕОПРЕДЕЛЕНО) КАК ЦеннаяБумага,
		|	_ТаблицаХМЛ.ISIN КАК ISIN,
		|	ВЫБОР
		|		КОГДА НЕ ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.Акции) ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|		КОГДА НЕ ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ДепозитарныеРасписки) ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|		КОГДА НЕ ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ИпотечныеСертификатыУчастия) ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|		КОГДА НЕ ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.Облигации) ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|		КОГДА НЕ ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.Паи) ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|		КОГДА НЕ ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты) ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|					КОГДА ВЫРАЗИТЬ(КодыВТорговыхСистемахСрезПоследних.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|				КОНЕЦ
		|	КОНЕЦ КАК Рынок
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ТаблицаХМЛ КАК _ТаблицаХМЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&Период,
		|				ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|					И Код В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ТаблицаХМЛ.ISIN
		|						ИЗ
		|							_ТаблицаХМЛ КАК _ТаблицаХМЛ)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _ТаблицаХМЛ.ISIN = КодыВТорговыхСистемахСрезПоследних.Код
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ISIN КАК ISIN
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|ГДЕ
		|	_ЦенныеБумаги.ЦеннаяБумага = НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.Рынок КАК Рынок,
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|ГДЕ
		|	НЕ _ЦенныеБумаги.ЦеннаяБумага = НЕОПРЕДЕЛЕНО";
		
	Запрос.УстановитьПараметр("Период", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ТаблицаХМЛ", ЭтаФорма.ДанныеХМЛ.Выгрузить());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаОшибок = Результат[2].Выбрать();
	
	Пока ВыборкаОшибок.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена ценная бумага по ISIN: " + ВыборкаОшибок.ISIN);
	КонецЦикла;
	
	Объект.ЦенныеБумаги.Загрузить(Результат[3].Выгрузить());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Файлы XML (*.xml)|*.xml";

	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
		
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ДиалогВыбора.ПолноеИмяФайла);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM  = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Дата = Формат(Объект.Дата, "ДФ=yyyy-MM-ddT00:00:00");
	Элемент = ДокументDOM.ЭлементДокумента;
	Разыменователь = Новый РазыменовательПространствИменDOM(Элемент);
	ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath("//СправедливаяСтоимость[@Дата=""" + Дата + """]/ЦеннаяБумага", Элемент, Разыменователь);
	
	ЭтаФорма.ДанныеХМЛ.Очистить();
	
	Пока Истина Цикл
	
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли; 
		
		СтрокаТаблицы = ЭтаФорма.ДанныеХМЛ.Добавить();
		Для каждого Узел Из ЭлементDOM.ДочерниеУзлы Цикл
			
			Если Узел.ИмяУзла = "ISIN" Тогда
				СтрокаТаблицы.ISIN = Узел.ТекстовоеСодержимое;
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЦикла;
	
	Если ЭтаФорма.ДанныеХМЛ.Количество() = 0 Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В выбранном файле не обнаружены данные на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));
		Возврат;
	
	КонецЕсли; 
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ЦенныеБумаги.ТекущийЭлемент = Элементы.ЦенныеБумагиЦеннаяБумага Тогда
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Рынок) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке не заполнен рынок ценных бумаг", ЭтаФорма, "ЦенныеБумаги[" + (ТекущиеДанные.НомерСтроки - 1) + "].Рынок",, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ТекущиеДанные.Рынок);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиРынокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Рынок) Тогда
		ТекущиеДанные.ЦеннаяБумага = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияПриИзменении(Объект.СчетДоверительногоУправления, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумаги1ПриИзменении(Элемент)
	
	Если НЕ Объект.ПереоцениватьЦенныеБумаги И Объект.ЦенныеБумаги.Количество() > 0 Тогда
		
		Если Вопрос("Будет очищен список ценных бумаг. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Объект.ПереоцениватьЦенныеБумаги = Ложь;
			Возврат;
		Иначе
			Объект.ЦенныеБумаги.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры
