// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, "Проверка сопоставления рейтинговых шкал", "0.08", "", Истина);
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ПроверитьШкалыРейтинга", "Отправить отчет",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Возвращает параметры выполняемой по регламентному заданию команды для подключения к механизму регистрации работы
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды  
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ИдентификаторКоманды, ПараметрыКоманды)
	
	ПараметрыОтчета = Новый Соответствие();
	ПараметрыОтчета.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	ПараметрыОтчета.Вставить("Период", ЭтотОбъект.Период);

	Если ПараметрыКоманды.Свойство("Организация") Тогда
		ПараметрыОтчета.Вставить("Организация", ПараметрыКоманды.Организация);
	КонецЕсли;
	
	Если ПараметрыКоманды.Свойство("ПолучателиОповещения") Тогда
		ПараметрыОтчета.Вставить("ПолучателиОповещения", ПараметрыКоманды.ПолучателиОповещения);
	КонецЕсли;
	
	Описание = "";
	Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		Описание = Описание + ПараметрОтчета.Ключ + ": " + ПараметрОтчета.Значение + Символы.ПС;		
	КонецЦикла;
	Описание = Лев(Описание, СтрДлина(Описание) - СтрДлина(Символы.ПС));	
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета);
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
	ТекущаяДата = НачалоДня(ТекущаяДата());
	
	Если Метод = "ПроверитьШкалыРейтинга" Тогда
		ПериодРассылки = Новый СтандартныйПериод;
		ПериодРассылки.ДатаНачала = ТекущаяДата;
		ПериодРассылки.ДатаОкончания = КонецДня(ТекущаяДата);
		ПроверитьШкалыРейтинга(ПериодРассылки);
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыполнитьКоманду(Метод, Экземпляры) Экспорт
	ТекущаяДата = НачалоДня(ТекущаяДата());
	
	Если Метод = "ПроверитьШкалыРейтинга" Тогда
		ПериодРассылки = Новый СтандартныйПериод;
		ПериодРассылки.ДатаНачала = ТекущаяДата;
		ПериодРассылки.ДатаОкончания = КонецДня(ТекущаяДата);
		ПроверитьШкалыРейтинга(ПериодРассылки);
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьШкалыРейтинга(Параметры) Экспорт

	ДатаНачала = Параметры.ДатаНачала;
	ДатаОкончания = Параметры.ДатаОкончания;
	
	Оповещения = Новый Массив();
	
	ПараметрыПодключения = РаботаСоСтрокамиКлиентСервер.ПолучитьПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	СсылкаИБ = СтрШаблон("e1c://server/%1/%2", ПараметрыПодключения.Srvr, ПараметрыПодключения.Ref);
	
	ИтоговаяТаблица = Неопределено;
	
	Дата = ДатаНачала;
	Пока Дата <= ДатаОкончания Цикл
		
		ЗапросДня = Новый Запрос;
		ЗапросДня.Текст = 
		"ВЫБРАТЬ
		|	НастройкиУчетаОбщиеСрезПоследних.Организация КАК Организация,
		|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПРЕДСТАВЛЕНИЕ(НастройкиУчетаОбщиеСрезПоследних.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕ(НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления) КАК СчетДоверительногоУправленияПредставление
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&Дата, ) КАК НастройкиУчетаОбщиеСрезПоследних
		|ГДЕ
		|	НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = ЗНАЧЕНИЕ(Перечисление.СтандартыФинансовойОтчетности.МСФО9)
		|	И НЕ НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ПометкаУдаления
		|	И НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения <= &Дата
		|	И (НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения > &Дата
		|			ИЛИ НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ЗапросДня.УстановитьПараметр("Дата", Дата);
		
		РезультатЗапросаДня = ЗапросДня.Выполнить();
		
		ВыборкаДетальныеЗаписиДня = РезультатЗапросаДня.Выбрать();
		
		Пока ВыборкаДетальныеЗаписиДня.Следующий() Цикл
			
			РеквизитыОповещения = Неопределено;
			Для Каждого Оповещение Из Оповещения Цикл
				Если Оповещение.Организация = ВыборкаДетальныеЗаписиДня.Организация Тогда
					РеквизитыОповещения = Оповещение;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
			
			Если РеквизитыОповещения = Неопределено Тогда
				РеквизитыОповещения = Новый Структура("Организация, Период, ТекстОповещения, ЕстьПустоеСопоставление", ВыборкаДетальныеЗаписиДня.Организация, ПредставлениеПериода(ДатаНачала, ДатаОкончания), "", Ложь);
				Оповещения.Добавить(РеквизитыОповещения);

				РеквизитыОповещения.ТекстОповещения = РеквизитыОповещения.ТекстОповещения + "<table border=""0"" cellspacing=""1"" bgcolor=""#000000""><tr bgcolor=""#FFFFFF""><td><b>Субъект</b></td><td><b>Шкала</b></td><td><b>Рейтинговое Агентство</b></td></tr>";
				
			КонецЕсли;
			
			Отказ = Ложь;
			
			УникальныйИдентификатор = Новый УникальныйИдентификатор();
			
			АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
			
			ДокументНачисленияРезервов = Документы.НачислениеСписаниеРезервов.СоздатьДокумент();
			ДокументНачисленияРезервов.Дата = КонецДня(Дата);
			ДокументНачисленияРезервов.Организация = ВыборкаДетальныеЗаписиДня.Организация;
			ДокументНачисленияРезервов.СчетДоверительногоУправления = ВыборкаДетальныеЗаписиДня.СчетДоверительногоУправления;
			ДокументНачисленияРезервов.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
			ДокументНачисленияРезервов.ДополнительныеСвойства.Вставить("ПроверкаРейтингов", АдресХранилища);
			
			ДокументНачисленияРезервов.ЗаполнитьРезервы(Отказ);
			
			РезультатРасчета = ПолучитьИзВременногоХранилища(АдресХранилища);
			
			Если ЗначениеЗаполнено(РезультатРасчета) И РезультатРасчета <> Неопределено Тогда
				
				Если ЗначениеЗаполнено(РезультатРасчета) И РезультатРасчета <> Неопределено Тогда
					
					Если ИтоговаяТаблица = Неопределено Тогда
						
						ИтоговаяТаблица = РезультатРасчета;
						
					Иначе
						
						РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатРасчета, ИтоговаяТаблица);
						
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		Дата = Дата + 24 * 60 * 60;
		
	КонецЦикла;		
	
	Если ИтоговаяТаблица <> Неопределено Тогда
		
		ЗапросТЗ = Новый Запрос;
		ЗапросТЗ.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Шкалы.Субъект КАК Субъект,
		|	_Шкалы.Шкала КАК Шкала,
		|	_Шкалы.РейтинговоеАгентство КАК РейтинговоеАгентство
		|ПОМЕСТИТЬ _Нулевые
		|ИЗ
		|	&РезультатРасчета КАК _Шкалы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Нулевые.Субъект КАК Субъект,
		|	_Нулевые.Шкала КАК Шкала,
		|	_Нулевые.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	ПРЕДСТАВЛЕНИЕ(_Нулевые.Субъект) КАК СубъектПредставление,
		|	ПРЕДСТАВЛЕНИЕ(_Нулевые.Шкала) КАК ШкалаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(_Нулевые.РейтинговоеАгентство) КАК РейтинговоеАгентствоПредставление
		|ИЗ
		|	_Нулевые КАК _Нулевые
		|
		|УПОРЯДОЧИТЬ ПО
		|	Субъект,
		|	РейтинговоеАгентство,
		|	Шкала
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ЗапросТЗ.УстановитьПараметр("РезультатРасчета", ИтоговаяТаблица);
		
		РезультатЗапросаТЗ = ЗапросТЗ.Выполнить();
		
		ВыборкаДетальныеЗаписиТЗ = РезультатЗапросаТЗ.Выбрать();
		
		Пока ВыборкаДетальныеЗаписиТЗ.Следующий() Цикл
			
			Если СтрНачинаетсяС(ВыборкаДетальныеЗаписиТЗ.ШкалаПредставление, "Оценка") Тогда
				Продолжить;	
			КонецЕсли;
			
			РеквизитыОповещения.ТекстОповещения = РеквизитыОповещения.ТекстОповещения + "<tr bgcolor=""#FFFFFF"">";
			
			СсылкаСубъект = СсылкаИБ + "#" + ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписиТЗ.Субъект);
			СсылкаШкала = СсылкаИБ + "#" + ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписиТЗ.Шкала);
			СсылкаРейтинговоеАгентство = СсылкаИБ + "#" + ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписиТЗ.РейтинговоеАгентство);
			
			РеквизитыОповещения.ТекстОповещения = РеквизитыОповещения.ТекстОповещения + "<td valign = ""top""><A href=""" + СсылкаСубъект + """>" + ВыборкаДетальныеЗаписиТЗ.СубъектПредставление + "</A></td>";
			РеквизитыОповещения.ТекстОповещения = РеквизитыОповещения.ТекстОповещения + "<td valign = ""top""><A href=""" + СсылкаШкала + """>" + ВыборкаДетальныеЗаписиТЗ.ШкалаПредставление + "</A></td>";
			РеквизитыОповещения.ТекстОповещения = РеквизитыОповещения.ТекстОповещения + "<td valign = ""top""><A href=""" + СсылкаРейтинговоеАгентство + """>" + ВыборкаДетальныеЗаписиТЗ.РейтинговоеАгентствоПредставление + "</A></td>";
			
			РеквизитыОповещения.ТекстОповещения = РеквизитыОповещения.ТекстОповещения + "</tr>";
			
			РеквизитыОповещения.ЕстьПустоеСопоставление = Истина;
			
		КонецЦикла;
		
	КонецЕсли;			
		
	
	Для Каждого Оповещение Из Оповещения Цикл
		
		Если Оповещение.ЕстьПустоеСопоставление Тогда
			
			Оповещение.ТекстОповещения = Оповещение.ТекстОповещения + "</table>";
		
			Справочники.Оповещения.СформироватьОповещения("Обработка._ПроверкаСопоставленияРейтинговыхШкал", Перечисления.ТипыСобытий.ВнешнийВызов, Оповещение);
			
		КонецЕсли;	
	
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьОтчет(ДатаНачала, ДатаОкончания, Результат, Организация) Экспорт

	Результат.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	Результат.Вывести(ОбластьЗаголовок);
	Результат.Вывести(ОбластьШапкаТаблицы);
	Результат.НачатьАвтогруппировкуСтрок();
	
	ИтоговаяТаблица = Неопределено;
	
	Дата = ДатаНачала;
	Пока Дата <= ДатаОкончания Цикл
		
		ЗапросДня = Новый Запрос;
		ЗапросДня.Текст = 
		"ВЫБРАТЬ
		|	НастройкиУчетаОбщиеСрезПоследних.Организация КАК Организация,
		|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПРЕДСТАВЛЕНИЕ(НастройкиУчетаОбщиеСрезПоследних.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕ(НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления) КАК СчетДоверительногоУправленияПредставление
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкиУчетаОбщиеСрезПоследних
		|ГДЕ
		|	НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = ЗНАЧЕНИЕ(Перечисление.СтандартыФинансовойОтчетности.МСФО9)
		|	И НЕ НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ПометкаУдаления
		|	И НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения <= &Дата
		|	И (НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения > &Дата
		|			ИЛИ НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ЗапросДня.УстановитьПараметр("Дата", Дата);
		ЗапросДня.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапросаДня = ЗапросДня.Выполнить();
		
		ВыборкаДетальныеЗаписиДня = РезультатЗапросаДня.Выбрать();
		
		Пока ВыборкаДетальныеЗаписиДня.Следующий() Цикл
			
			Отказ = Ложь;
			
			УникальныйИдентификатор = Новый УникальныйИдентификатор();
			
			АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
			
			ДокументНачисленияРезервов = Документы.НачислениеСписаниеРезервов.СоздатьДокумент();
			ДокументНачисленияРезервов.Дата = КонецДня(Дата);
			ДокументНачисленияРезервов.Организация = Организация;
			ДокументНачисленияРезервов.СчетДоверительногоУправления = ВыборкаДетальныеЗаписиДня.СчетДоверительногоУправления;
			ДокументНачисленияРезервов.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
			ДокументНачисленияРезервов.ДополнительныеСвойства.Вставить("ПроверкаРейтингов", АдресХранилища);
			
			ДокументНачисленияРезервов.ЗаполнитьРезервы(Отказ);
			
			РезультатРасчета = ПолучитьИзВременногоХранилища(АдресХранилища);
			
			Если ЗначениеЗаполнено(РезультатРасчета) И РезультатРасчета <> Неопределено Тогда
				
				Если ИтоговаяТаблица = Неопределено Тогда
					
					ИтоговаяТаблица = РезультатРасчета;
					
				Иначе
					
					РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатРасчета, ИтоговаяТаблица);
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		Дата = Дата + 24 * 60 * 60;
		
	КонецЦикла;		
	
	Если ИтоговаяТаблица <> Неопределено Тогда
		
		ЗапросТЗ = Новый Запрос;
		ЗапросТЗ.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Шкалы.Субъект КАК Субъект,
		|	_Шкалы.Шкала КАК Шкала,
		|	_Шкалы.РейтинговоеАгентство КАК РейтинговоеАгентство
		|ПОМЕСТИТЬ _Нулевые
		|ИЗ
		|	&РезультатРасчета КАК _Шкалы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Нулевые.Субъект КАК Субъект,
		|	_Нулевые.Шкала КАК Шкала,
		|	_Нулевые.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	ПРЕДСТАВЛЕНИЕ(_Нулевые.Субъект) КАК СубъектПредставление,
		|	ПРЕДСТАВЛЕНИЕ(_Нулевые.Шкала) КАК ШкалаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(_Нулевые.РейтинговоеАгентство) КАК РейтинговоеАгентствоПредставление
		|ИЗ
		|	_Нулевые КАК _Нулевые
		|
		|УПОРЯДОЧИТЬ ПО
		|	Субъект,
		|	РейтинговоеАгентство,
		|	Шкала
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ЗапросТЗ.УстановитьПараметр("РезультатРасчета", ИтоговаяТаблица);
		
		РезультатЗапросаТЗ = ЗапросТЗ.Выполнить();
		
		ВыборкаДетальныеЗаписиТЗ = РезультатЗапросаТЗ.Выбрать();
		
		Пока ВыборкаДетальныеЗаписиТЗ.Следующий() Цикл
			
			Если СтрНачинаетсяС(ВыборкаДетальныеЗаписиТЗ.ШкалаПредставление, "Оценка") Тогда
				Продолжить;	
			КонецЕсли;
			
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписиТЗ);
			
			Результат.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписиТЗ.Уровень());
		КонецЦикла;
		
	КонецЕсли;			
	
	
	Результат.ЗакончитьАвтогруппировкуСтрок();
	Результат.Вывести(ОбластьПодвалТаблицы);
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры