
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Сведения о депозитных вкладах",
		"1.18",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	КлючТекущегоВарианта = КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючТекущегоВарианта;
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("грПериод",				Новый Граница(КонецДня(ЭтотОбъект.Период.Дата), ВидГраницы.Включая));
	ПараметрыДанных.УстановитьЗначениеПараметра("Период",				КонецДня(ЭтотОбъект.Период.Дата));
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация",			ЭтотОбъект.Организация);
	ПараметрыДанных.УстановитьЗначениеПараметра("КлючТекущегоВарианта",	КлючТекущегоВарианта); // Чтобы попал в статистику
	
	ВнешниеНаборыДанных = Неопределено;
	
	Если КлючТекущегоВарианта = "ДействующиеДепозиты" Тогда
		
		#Область Заполнение_внешних_наборов
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("грПериод", 			Новый Граница(КонецДня(ЭтотОбъект.Период.Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Период", 			КонецДня(ЭтотОбъект.Период.Дата));
		Запрос.УстановитьПараметр("СписокОрганизаций", 	ЭтотОбъект.СписокОрганизаций);
		
		#Область Текст_запроса_сводных_данных_по_депозитам
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.Организация КАК Организация,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК ДепозитныйВклад,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток КАК СуммаОстаток,
			|	БанковскиеСчета.Банк КАК Банк,
			|	ДепозитныеВклады.ДатаРегистрации КАК ДатаРегистрации,
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
			|	ДепозитныеВклады.ДоВостребования КАК ДоВостребования,
			|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
			|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
			|	РАЗНОСТЬДАТ(&Период, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) КАК ДнейДоЗакрытия,
			|	Договоры.НомерДоговора КАК НомерДоговора,
			|	СУММА(ДепозитныеВкладыПлановыеВыплатыПроценты.Сумма) КАК СуммаПроценты,
			|	СУММА(ДепозитныеВкладыПлановыеВыплатыОсновнойДолг.Сумма) КАК СуммаОсновнойДолг
			|ПОМЕСТИТЬ _ДепозитыСводно
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
			|			&грПериод,
			|			Организация В (&СписокОрганизаций)
			|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
			|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
			|				ПО БанковскиеСчета.Договор = Договоры.Ссылка
			|			ПО ДепозитныеВклады.БанковскийСчет = БанковскиеСчета.Ссылка
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады.ПлановыеВыплаты КАК ДепозитныеВкладыПлановыеВыплатыПроценты
			|			ПО ДепозитныеВклады.Ссылка = ДепозитныеВкладыПлановыеВыплатыПроценты.Ссылка
			|				И (ДепозитныеВкладыПлановыеВыплатыПроценты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыВыплатПоДепозитнымВкладам.Проценты))
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады.ПлановыеВыплаты КАК ДепозитныеВкладыПлановыеВыплатыОсновнойДолг
			|			ПО ДепозитныеВклады.Ссылка = ДепозитныеВкладыПлановыеВыплатыОсновнойДолг.Ссылка
			|				И (ДепозитныеВкладыПлановыеВыплатыОсновнойДолг.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыВыплатПоДепозитнымВкладам.ОсновнойДолг))
			|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = ДепозитныеВклады.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
			|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
			|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
			|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
			|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
			|		ИЗ
			|			(ВЫБРАТЬ
			|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
			|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
			|			ИЗ
			|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
			|			ГДЕ
			|				УсловияКредитныхИнструментовСрезПоследних.Действует
			|			
			|			СГРУППИРОВАТЬ ПО
			|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
			|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
			|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
			|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
			|
			|СГРУППИРОВАТЬ ПО
			|	ДепозитныеВклады.ДоВостребования,
			|	ДепозитныеВклады.ДатаРегистрации,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления,
			|	УсловияКредитныхИнструментовСрезПоследних.Процент,
			|	Договоры.НомерДоговора,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.Организация,
			|	БанковскиеСчета.Банк,
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения,
			|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов,
			|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток,
			|	РАЗНОСТЬДАТ(&Период, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДепозитыСводно.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	_ДепозитыСводно КАК _ДепозитыСводно";			
		
		#КонецОбласти
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДепозитыПоКлиенту = Новый ТаблицаЗначений;
		ДепозитыПоКлиенту.Колонки.Добавить("КредитныйИнструмент",	Новый ОписаниеТипов("СправочникСсылка.ДепозитныеВклады"));
		ДепозитыПоКлиенту.Колонки.Добавить("Номинал",				Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		ДепозитыПоКлиенту.Колонки.Добавить("Проценты",				Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		
		Пока Выборка.Следующий() Цикл
			
			СтоимостиДепозитовСчетаДУ = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(
				Выборка.СчетДоверительногоУправления, КонецДня(ЭтотОбъект.Период.Дата), Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад);
			
			Для каждого СтрокаДепозит Из СтоимостиДепозитовСчетаДУ Цикл
				ЗаполнитьЗначенияСвойств(ДепозитыПоКлиенту.Добавить(), СтрокаДепозит);			
			КонецЦикла;
			
		КонецЦикла; 
		
		Запрос.УстановитьПараметр("ДепозитыПоКлиенту", ДепозитыПоКлиенту);
		
		#Область Итоговый_текст_запроса
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДепозитыПоКлиенту.КредитныйИнструмент КАК ДепозитныйВклад,
			|	ДепозитыПоКлиенту.Номинал КАК Номинал,
			|	ДепозитыПоКлиенту.Проценты КАК Проценты
			|ПОМЕСТИТЬ _ДепозитыПоКлиенту
			|ИЗ
			|	&ДепозитыПоКлиенту КАК ДепозитыПоКлиенту
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДепозитыСводно.Организация КАК Организация,
			|	_ДепозитыСводно.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДепозитыСводно.СчетДоверительногоУправления.КодСчета КАК КодСчета,
			|	_ДепозитыСводно.ДепозитныйВклад КАК ДепозитныйВклад,
			|	_ДепозитыСводно.ДепозитныйВклад.БанковскийСчет КАК ДепозитныйСчет,
			|	_ДепозитыСводно.СуммаОстаток КАК СуммаОстаток,
			|	_ДепозитыСводно.Банк КАК Банк,
			|	_ДепозитыСводно.ДатаРегистрации КАК ДатаРегистрации,
			|	_ДепозитыСводно.ДатаПогашения КАК ДатаПогашения,
			|	_ДепозитыСводно.ДоВостребования КАК ДоВостребования,
			|	_ДепозитыСводно.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
			|	_ДепозитыСводно.Процент КАК Процент,
			|	_ДепозитыСводно.ДнейДоЗакрытия КАК ДнейДоЗакрытия,
			|	_ДепозитыСводно.НомерДоговора КАК НомерДоговора,
			|	_ДепозитыПоКлиенту.Номинал КАК Номинал,
			|	_ДепозитыПоКлиенту.Проценты КАК СуммаПроцентовНачисленная,
			|	_ДепозитыПоКлиенту.Номинал + _ДепозитыПоКлиенту.Проценты КАК ОбщаяСуммаНачисленная,
			|	_ДепозитыСводно.СуммаПроценты КАК СуммаПроцентовВКонцеСрока,
			|	_ДепозитыСводно.СуммаОсновнойДолг + _ДепозитыСводно.СуммаПроценты КАК ОбщаяСуммаВКонце,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК КодУБрокера
			|ИЗ
			|	_ДепозитыСводно КАК _ДепозитыСводно
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитыПоКлиенту КАК _ДепозитыПоКлиенту
			|		ПО _ДепозитыСводно.ДепозитныйВклад = _ДепозитыПоКлиенту.ДепозитныйВклад
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер) КАК КоличествоБрокеров
			|		ИЗ
			|			РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|					&Период,
			|					СчетДоверительногоУправления В
			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|							_ДепозитыСводно.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|						ИЗ
			|							_ДепозитыСводно КАК _ДепозитыСводно)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления) КАК ВложенныйЗапрос
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|			ПО ВложенныйЗапрос.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
			|				И (ВложенныйЗапрос.КоличествоБрокеров = 1
			|					ИЛИ КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер)
			|		ПО _ДепозитыСводно.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления";			
		
		#КонецОбласти
		
		ВнешниеНаборыДанных = Новый Структура("ДействующиеДепозиты", Запрос.Выполнить().Выгрузить());
		
		УстановитьПривилегированныйРежим(Ложь);
		
		#КонецОбласти
		
	КонецЕсли; 
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, , , , ВнешниеНаборыДанных);
		
КонецПроцедуры

#Область Автоматическое_формирование

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтотОбъект, НастройкиОтчета.КлючТекущегоВарианта);
	ЭтотОбъект.Период.Вариант 	= ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
	ЭтотОбъект.Период.Дата		= НастройкиОтчета.Период.ДатаОкончания;
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("КлючТекущегоВарианта", НастройкиОтчета.КлючТекущегоВарианта);
	
	// Счет ДУ и вид договора в пользовательских настройках
	КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование = Ложь; 
	КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].ПравоеЗначение = НастройкиОтчета.СчетДоверительногоУправления;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ПриКомпоновкеРезультата(ДокументРезультат, Неопределено, Ложь);
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;

	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("КлючТекущегоВарианта");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

#КонецОбласти
