
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабличныйДокумент = СформироватьАктПИТрНаСервере(ПараметрКоманды);
	Если ТабличныйДокумент <> Неопределено Тогда						
		ТабличныйДокумент.Показать(Строка(ПараметрКоманды) + " (Приложение к акту)");			
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьАктПИТрНаСервере(ВыводЦенныхБумаг)
	ТабличныйДокумент =  Документы.ВыводЦенныхБумаг.СформироватьПриложениеКАкту(ВыводЦенныхБумаг);
	
	Если ТабличныйДокумент <> Неопределено Тогда
		
		НачалоОбласти = Формат(ТабличныйДокумент.ВысотаТаблицы-3, "ЧГ=0");
		КонецОбласти = Формат(ТабличныйДокумент.ВысотаТаблицы, "ЧГ=0");
		Если ТабличныйДокумент.Область("R" + НачалоОбласти + "C1").Текст = "Валютные ценные бумаги" Тогда 
			//валютных бумаг нет. Удалим секцию
			ТабличныйДокумент.Область("R" + НачалоОбласти + ":R"+ КонецОбласти).Очистить(Истина, Истина, Истина);
		КонецЕсли;	
		
		//группировки колонок. При изменении макета надо исправить номера группируемых колонок
		ТабличныйДокумент.Область(, 15, 10 , 20).Сгруппировать();    //Рекласс
		ТабличныйДокумент.Область(, 31, 10 , 32).Сгруппировать();    // Резерв
		ТабличныйДокумент.Область(, 34, 10 , 34).Сгруппировать();	 // Накопленная переоценка	
		ТабличныйДокумент.ПоказатьУровеньГруппировокКолонок(0);
		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;	
КонецФункции