
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",
		Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Объект.Дата, Объект.Организация.ЮрФизЛицо)));
	
	Элементы.ПаевойИнвестиционныйФонд.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтотОбъект, Объект);
	УстановитьДоступныеВидыПайщиков(Объект, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	
	Если Объект.Заявка <> ПредопределенноеЗначение("Документ.ЗаявкаПайщика.ПустаяСсылка") Тогда
		
		ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
		Объект.Количество = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "Количество");		
		РассчитатьПартииКПогашениюНаСервере();
		
		НастроитьВидимостьИДоступность(ЭтаФорма, Объект);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСчетДоверительногоУправления(Знач ПаевойИнвестиционныйФонд, Знач Период)
	
	Возврат Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ПаевойИнвестиционныйФонд, Период);	
	
КонецФункции

&НаКлиенте
Процедура ПаевойИнвестиционныйФондПриИзменении(Элемент)
	
	Объект.СчетДоверительногоУправления = ПолучитьСчетДоверительногоУправления(Объект.ПаевойИнвестиционныйФонд, Объект.Дата);
    	
	ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
	
	РассчитатьПартииКПогашениюНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма, Объект);
    
КонецПроцедуры

&НаКлиенте
Процедура ВидПайщикаПриИзменении(Элемент)
	
	ОбработатьИзменениеПайщикаИлиВидаПайщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ПайщикПриИзменении(Элемент)
	
	ОбработатьИзменениеПайщикаИлиВидаПайщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПартииКПогашению(Команда)
	
	 РассчитатьПартииКПогашениюНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантПогашенияПаевПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтотОбъект, Объект);
	
	Если Объект.ВариантПогашенияПаев <> ПредопределенноеЗначение("Перечисление.ВариантыПогашенияПаев.ЧастичноеПоРешениюУК") Тогда
		Если ЗначениеЗаполнено(Объект.НомерПриказа) Тогда
			Объект.НомерПриказа = "";
		КонецЕсли;
		
		Если Объект.ДатаПриказа <> '00010101' Тогда
			Объект.ДатаПриказа = '00010101';
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НАСТРОЙКА_ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма, Объект)
		
	Форма.Элементы.Владелец.Видимость = Объект.ВидПайщика <> ПредопределенноеЗначение("Перечисление.ВидыПайщиков.Владелец");
	Форма.Элементы.ГруппаПриказ.Видимость = Объект.ВариантПогашенияПаев = ПредопределенноеЗначение("Перечисление.ВариантыПогашенияПаев.ЧастичноеПоРешениюУК");
	
	Форма.Элементы.ПартииГруппаСкидка.Видимость	= Форма.ПрименяетсяСкидка;
	Форма.Элементы.ГруппаСкидка.Видимость		= Форма.ПрименяетсяСкидка;
	
	Форма.Элементы.ДатаРасчетнойСтоимостиПая.Видимость	= ЗначениеЗаполнено(Форма.ДатаРасчетнойСтоимостиПая);
    
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();
						
		МассивПолейПриказа = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.НомерПриказа, Объект.ДатаПриказа", ",", Истина, Истина);		
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаПриказ", МассивПолейПриказа);
		
		МассивКолонокСкидки = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.Партии.СрокВладения, Объект.Партии.ПроцентСкидки, Объект.Партии.СуммаСкидки", ",", Истина, Истина);		
		ПутьКДаннымСкрываемыхПолей.Вставить("ПартииГруппаСкидка", МассивКолонокСкидки);
		
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
		
    КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныеВидыПайщиков(Объект, Форма)
	
	Элементы = Форма.Элементы;
	
	СписокДоступныхВидовПайщиков = ПолучитьДанныеВыбора(Тип("ПеречислениеСсылка.ВидыПайщиков"), Новый Структура());
	
	СписокВыбора = Элементы.ВидПайщика.СписокВыбора;
	СписокВыбора.Очистить();

	Для каждого ЭлементСписка из СписокДоступныхВидовПайщиков Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение.Значение, ЭлементСписка.Представление);	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПайщикаИлиВидаПайщика()
	
	Если Объект.ВидПайщика = ПредопределенноеЗначение("Перечисление.ВидыПайщиков.Владелец") Тогда
		Если Объект.Владелец <> Объект.Пайщик Тогда
			Объект.Владелец  = Объект.Пайщик;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные_процедуры_и_функции

&НаСервере
Процедура ОбновитьРасчетнуюСтоимостьПаяИПараметрыСкидкиНаСервере()
	
	ДатаДокумента = ?(Объект.Дата = '00010101', ТекущаяДатаСеанса(), Объект.Дата);
	
	ДатаСтоимости			= Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(
									Объект.СчетДоверительногоУправления,						
									ДатаДокумента);
	СтоимостьПаяИзРегистра	= РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(
								Объект.Организация, 
								Объект.СчетДоверительногоУправления, 
								ДатаСтоимости);
		
	ЭтаФорма.РасчетнаяСтоимостьПая		= 0;
	ЭтаФорма.ДатаРасчетнойСтоимостиПая	= Неопределено;
	ЭтаФорма.ПрименяетсяСкидка			= Ложь;
	ЭтаФорма.ШкалаСкидок				= Неопределено;
		
	Если СтоимостьПаяИзРегистра <> Неопределено Тогда
		
		ЭтаФорма.РасчетнаяСтоимостьПая		= СтоимостьПаяИзРегистра;		
		ЭтаФорма.ДатаРасчетнойСтоимостиПая	= ДатаСтоимости;
		
	Иначе
		Если Объект.Количество <> 0 Тогда
			ЭтаФорма.РасчетнаяСтоимостьПая = Объект.Сумма / Объект.Количество;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыСкидки = РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.ПараметрыРасчетаНадбавокИСкидок(Объект.ПаевойИнвестиционныйФонд, ДатаДокумента);
	
	ЭтоПогашениеПоОбменуПаев = ЗначениеЗаполнено(Объект.Заявка) 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;
		
	Если ПараметрыСкидки <> Неопределено Тогда
		ЭтаФорма.ПрименяетсяСкидка	= ?(ЭтоПогашениеПоОбменуПаев, Ложь, ПараметрыСкидки.ПрименяютсяНадбавкиИСкидки);
		ЭтаФорма.ШкалаСкидок		= ?(ЭтаФорма.ПрименяетсяСкидка, ПараметрыСкидки.ШкалаСкидок, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПартииКПогашениюНаСервере()
	
	Объект.Партии.Очистить();
	Отказ = Ложь; 
		
	Если ЭтаФорма.РасчетнаяСтоимостьПая = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для расчета");
		Возврат;
	КонецЕсли;
	
	ПараметрыСкидки = Новый Структура("ПрименяютсяНадбавкиИСкидки, ШкалаСкидок, РасчетнаяСтоимостьПая",
								ЭтаФорма.ПрименяетсяСкидка,
								ЭтаФорма.ШкалаСкидок,
								ЭтаФорма.РасчетнаяСтоимостьПая);
		
	РассчитанныеПартии = РаботаСПартиямиДолейПайщиков.РассчитатьПартииИСкидки(Объект, ПараметрыСкидки, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Партии.Загрузить(РассчитанныеПартии);
	Объект.Сумма = Объект.Партии.Итог("СуммаПогашения");
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

