
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда
		ЭтотОбъект.Запись.Организация = Параметры.ЗначенияЗаполнения.Договор.Организация;
		//Если День(ТекущаяДата()) < 10 Тогда
		//	ЭтотОбъект.Запись.НачалоДействия = НачалоМесяца(ТекущаяДата());
		//Иначе
		//	ЭтотОбъект.Запись.НачалоДействия = КонецМесяца(ТекущаяДата()) + 86400;
		//КонецЕсли;
		//ЭтотОбъект.Запись.ОкончаниеДействия = КонецМесяца(ЭтотОбъект.Запись.НачалоДействия);
	КонецЕсли;
КонецПроцедуры
