&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Организация, ГруппаОбстоятельств");
	ЭтаФорма.ВыявлениеКонфликта = "НеЗаполнено";
	ЭтаФорма.ПрекращениеКонфликта = "БезОтбора";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	ЭтаФорма.КонфликтыИнтересов.Очистить();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонфликтыИнтересов.Ссылка КАК КонфликтИнтересов,
		|	Выявление.Ссылка КАК ВыявлениеКонфликта,
		|	Прекращение.Ссылка КАК ПрекращениеКонфликта
		|ИЗ
		|	Справочник.КонфликтыИнтересов КАК КонфликтыИнтересов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияИнформацииОКонфликтеИнтересов КАК Выявление
		|		ПО КонфликтыИнтересов.Ссылка = Выявление.КонфликтИнтересов
		|			И (Выявление.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияИнформацииОКонфликтеИнтересов КАК Прекращение
		|		ПО КонфликтыИнтересов.Ссылка = Прекращение.КонфликтИнтересов
		|			И (Прекращение.Проведен)
		|ГДЕ
		|	КонфликтыИнтересов.Организация = &Организация
		|	И КонфликтыИнтересов.Обстоятельство В ИЕРАРХИИ(&ГруппаОбстоятельств)
		|	И (&Обстоятельство = ЗНАЧЕНИЕ(Справочник.ОбстоятельстваВозникновенияКонфликтаИнтересов.ПустаяСсылка)
		|			ИЛИ КонфликтыИнтересов.Обстоятельство = &Обстоятельство)
		|	И (&ДатаВозникновения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КонфликтыИнтересов.ДатаВозникновения = &ДатаВозникновения)
		|	И (&СвязанноеЛицо = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ИЛИ КонфликтыИнтересов.СвязанноеЛицо = &СвязанноеЛицо)
		|	И &Выявление
		|	И &Прекращение
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонфликтыИнтересов.ДатаВозникновения";
	
	ЗаполнитьОтборПоДокументам(ТекстЗапроса, "Выявление");
	ЗаполнитьОтборПоДокументам(ТекстЗапроса, "Прекращение");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ГруппаОбстоятельств", ЭтаФорма.ГруппаОбстоятельств);
	Запрос.УстановитьПараметр("Обстоятельство", ЭтаФорма.Обстоятельство);
	Запрос.УстановитьПараметр("ДатаВозникновения", ЭтаФорма.ДатаВозникновения);
	Запрос.УстановитьПараметр("СвязанноеЛицо", ЭтаФорма.СвязанноеЛицо);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма.КонфликтыИнтересов.Добавить(), Выборка);
	
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборПоДокументам(ТекстЗапроса, Псевдоним)
	
	ИмяРеквизита = Псевдоним + "Конфликта";
	ПодстрокаПоиска = "&" + Псевдоним;
	
	Если ЭтаФорма[ИмяРеквизита] = "Заполнено" Тогда
		ПодстрокаЗамены = Псевдоним + ".Ссылка ЕСТЬ НЕ NULL";
	ИначеЕсли ЭтаФорма[ИмяРеквизита] = "НеЗаполнено" Тогда
		ПодстрокаЗамены = Псевдоним + ".Ссылка ЕСТЬ NULL";
	ИначеЕсли ЭтаФорма[ИмяРеквизита] = "БезОтбора" Или ЭтаФорма[ИмяРеквизита] = "" Тогда
		ПодстрокаЗамены = "ИСТИНА";
	КонецЕсли;  
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЗначения(Команда)
	
	ИмяПоля = Элементы.КонфликтыИнтересов.ТекущийЭлемент.Имя;
	ИмяРеквизита = СтрЗаменить(ИмяПоля, "КонфликтыИнтересов", "");
	
	ДоступныеПоля = Новый Массив;
	ДоступныеПоля.Добавить("КонфликтыИнтересовСоздатьВыявление");
	ДоступныеПоля.Добавить("КонфликтыИнтересовСоздатьПрекращение");
	ДоступныеПоля.Добавить("КонфликтыИнтересовДатаВыявления");
	ДоступныеПоля.Добавить("КонфликтыИнтересовДатаПрекращения");
	
	Если ИмяПоля = "КонфликтыИнтересовСоздатьВыявление" Или ИмяПоля = "КонфликтыИнтересовСоздатьПрекращение" Тогда
		Значение = Истина;
	ИначеЕсли ИмяПоля = "КонфликтыИнтересовДатаВыявления" Или ИмяПоля = "КонфликтыИнтересовДатаПрекращения" Тогда
		Значение = '00010101';
	КонецЕсли;
	
	Если ВвестиЗначение(Значение) Тогда
	
		Для каждого Идентификатор Из Элементы.КонфликтыИнтересов.ВыделенныеСтроки Цикл
		
			ТекСтрорка = ЭтаФорма.КонфликтыИнтересов.НайтиПоИдентификатору(Идентификатор);
			ТекСтрорка[ИмяРеквизита] = Значение;
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонфликтыИнтересовПриАктивизацииЯчейки(Элемент)
	
	ИмяПоля = Элементы.КонфликтыИнтересов.ТекущийЭлемент.Имя;
	
	ДоступныеПоля = Новый Массив;
	ДоступныеПоля.Добавить("КонфликтыИнтересовСоздатьВыявление");
	ДоступныеПоля.Добавить("КонфликтыИнтересовСоздатьПрекращение");
	ДоступныеПоля.Добавить("КонфликтыИнтересовДатаВыявления");
	ДоступныеПоля.Добавить("КонфликтыИнтересовДатаПрекращения");
	
	Элементы.КонфликтыИнтересовКонтекстноеМенюКомандаЗаполнитьЗначения.Доступность = (ДоступныеПоля.Найти(ИмяПоля) <> Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьДокументы(Команда)
	КомандаСоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСоздатьДокументыНаСервере()
	
	СоздатьДокументы(Перечисления.ВидыИнформацииОКонфликтеИнтересов.Выявление);
	СоздатьДокументы(Перечисления.ВидыИнформацииОКонфликтеИнтересов.Прекращение);
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьДокументы(ВидСобытия)

	Если ВидСобытия = Перечисления.ВидыИнформацииОКонфликтеИнтересов.Выявление Тогда
		
		ИмяОтбора = "СоздатьВыявление";
		ИмяДаты = "ДатаВыявления";
		ИмяДокумента = "ВыявлениеКонфликта";
		
	ИначеЕсли ВидСобытия = Перечисления.ВидыИнформацииОКонфликтеИнтересов.Прекращение Тогда
		
		ИмяОтбора = "СоздатьПрекращение";
		ИмяДаты = "ДатаПрекращения";
		ИмяДокумента = "ПрекращениеКонфликта";
		
	Иначе
		
		Возврат;
	
	КонецЕсли;
	
	НайденныеСтроки = ЭтаФорма.КонфликтыИнтересов.НайтиСтроки(Новый Структура(ИмяОтбора, Истина));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить(ИмяДаты);
	ИменаПолей.Добавить(ИмяДокумента);
	
	ТаблицаКонфликтов = ЭтаФорма.КонфликтыИнтересов.Выгрузить(НайденныеСтроки, "КонфликтИнтересов, " + СтрСоединить(ИменаПолей, ", "));
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонфликтыИнтересов.КонфликтИнтересов КАК КонфликтИнтересов,
		|	&Поля КАК Поля
		|ПОМЕСТИТЬ КонфликтыИнтересов
		|ИЗ
		|	&КонфликтыИнтересов КАК КонфликтыИнтересов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонфликтыИнтересов.КонфликтИнтересов КАК КонфликтИнтересов,
		|	&Поля КАК Поля,
		|	СправочникКонфликтыИнтересов.Организация КАК Организация,
		|	СправочникКонфликтыИнтересов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СправочникКонфликтыИнтересов.ДатаВозникновения КАК ДатаВозникновения,
		|	СправочникКонфликтыИнтересов.СвязанноеЛицо КАК СвязанноеЛицо,
		|	СправочникКонфликтыИнтересов.ПредметКонфликта КАК ПредметКонфликта
		|ИЗ
		|	КонфликтыИнтересов КАК КонфликтыИнтересов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонфликтыИнтересов КАК СправочникКонфликтыИнтересов
		|		ПО КонфликтыИнтересов.КонфликтИнтересов = СправочникКонфликтыИнтересов.Ссылка";
	
	ПоляВыбора = Новый Массив;
	Для каждого ИмяПоля Из ИменаПолей Цикл
		ПоляВыбора.Добавить(СтрШаблон("КонфликтыИнтересов.%1 КАК %1", ИмяПоля));
	КонецЦикла;
	
	ПереносСтроки = ",
		|	";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Поля КАК Поля", СтрСоединить(ПоляВыбора, ПереносСтроки));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КонфликтыИнтересов", ТаблицаКонфликтов);
	
	Результат = Запрос.Выполнить();
	ДанныеКонфликтов = Результат.Выгрузить();
	
	РеквизитыКИ = Справочники.КонфликтыИнтересов.ПолучитьРеквизитыКонфликтовИнтересов(ДанныеКонфликтов);
	
	Для каждого Строка Из ДанныеКонфликтов Цикл
	
		Если ЗначениеЗаполнено(Строка[ИмяДаты]) Тогда
		
			Если ЗначениеЗаполнено(Строка[ИмяДокумента]) Тогда
				Документ = Строка[ИмяДокумента].ПолучитьОбъект();
			Иначе
				Документ = Документы.РегистрацияИнформацииОКонфликтеИнтересов.СоздатьДокумент();
				Документ.Заполнить(Неопределено);
			КонецЕсли;
						
			Документ.Дата = Строка[ИмяДаты];
			Документ.ВидСобытия = ВидСобытия;
			
			ЗаполнитьЗначенияСвойств(Документ, Строка, "СчетДоверительногоУправления, КонфликтИнтересов");
			
			Отбор = Новый Структура("КонфликтИнтересов", Строка.КонфликтИнтересов);
			НайденныеСтроки = РеквизитыКИ.НайтиСтроки(Отбор);
			
			Если ЗначениеЗаполнено(Строка.ПредметКонфликта) И (ТипЗнч(Строка.ПредметКонфликта) = Тип("СправочникСсылка.Договоры") 
				Или ТипЗнч(Строка.ПредметКонфликта) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")) Тогда
				
				Документ.СодержаниеКонфликтаИнтересов = СтрШаблон("Договор %1 №%2 от %3",
					НРег(Строка.ПредметКонфликта.ВидДоговора),
					Строка.ПредметКонфликта.НомерДоговора,
			        Формат(Строка.ПредметКонфликта.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
					
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() = 1 Тогда
				Документ.СодержаниеКонфликтаИнтересов = ?(ПустаяСтрока(Документ.СодержаниеКонфликтаИнтересов), "", Документ.СодержаниеКонфликтаИнтересов + Символы.ПС) 
					+ НайденныеСтроки[0].СодержаниеКонфликтаИнтересов;
				Документ.СведенияОКлиенте = НайденныеСтроки[0].СведенияОКлиенте;
			КонецЕсли;		
			
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			
			Если Не ЗначениеЗаполнено(Строка[ИмяДокумента]) Тогда
				Строка[ИмяДокумента] = Документ.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла
	

КонецПроцедуры




