&НаСервере
Процедура СформироватьСписокРазделовОтчета()
	
	ЭтаФорма.РазделыОтчета.Очистить();
	
	ЭтаФорма.СохраняемыеРазделы = Отчеты.РегламентированныйОтчетОПотокахДенежныхСредствНПФ.СформироватьСписокРазделовОтчета(ЭтаФорма.ИмяФормы);
	
	Для Каждого Раздел Из ЭтаФорма.СохраняемыеРазделы Цикл
		ДобавитьРазделОтчета(РазделыОтчета, Раздел.Значение, Раздел.Представление);
		Раздел.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРазделОтчета(РазделыОтчета, ИмяРаздела, Представление)

	НоваяСтрока = РазделыОтчета.Добавить();
	
	НоваяСтрока.ИмяРаздела = ИмяРаздела;
	НоваяСтрока.Представление = Представление;

КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	ЭтаФорма.СтруктураРеквизитовФормы = Отчеты.РегламентированныйОтчетОПотокахДенежныхСредствНПФ.ПолучитьСтруктуруПараметров(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиСервер()
	
	СформироватьСписокРазделовОтчета();
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ИмяМакетаСоставаПоказателей = КонсолидированнаяОтчетность.ПолучитьИмяМакетаСоставаПоказателей("РегламентированныйОтчетОПотокахДенежныхСредствНПФ", СтруктураРеквизитовФормы);	
	МакетСоставаПоказателей = Отчеты[СтруктураНаименованийОтчета.ИсточникОтчета].ПолучитьМакет(ИмяМакетаСоставаПоказателей);	
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МакетСоставаПоказателей", МакетСоставаПоказателей);
	СтруктураПараметров.Вставить("мТаблицаСоставПоказателей", мТаблицаСоставПоказателей);
	СтруктураПараметров.Вставить("УникальныйИдентификатор", ЭтаФорма.УникальныйИдентификатор);
	
	СтруктураПараметров.Вставить("Адрес_ТаблицаРасшифровки", Адрес_ТаблицаРасшифровки);
	СтруктураПараметров.Вставить("Адрес_мСтруктураЦветовРаскраски", Адрес_мСтруктураЦветовРаскраски);
	СтруктураПараметров.Вставить("Адрес_мСтруктураВариантыЗаполнения", Адрес_мСтруктураВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаВариантыЗаполнения", Адрес_мТаблицаВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаСчетов", Адрес_мТаблицаСчетов);
	
	КонсолидированнаяОтчетность.ЗаполнитьНачальныеНастройкиСервер(СтруктураПараметров);
	
	Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		Если Лев(ЭлементСтруктуры.Ключ, 6) = "Адрес_" Тогда
			ЭтаФорма[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено Тогда
		
		СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
		СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
		СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
		СписокСохранения.Свойство("НКО", СтруктураРеквизитовФормы.НКО);
		СписокСохранения.Свойство("ВидДеятельностиОрганизации",	СтруктураРеквизитовФормы.ВидДеятельностиОрганизации);
		
		ЗаполнитьНачальныеНастройкиСервер();
	
		ЗаполнитьТабличныеДокументыИзМакетов();
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
           И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
        	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

		КонецЕсли;
		
	Иначе
		
		ЗаполнитьНачальныеНастройкиСервер();
	
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			// документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе
			// Это новый документ.
			Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
				СтруктураРеквизитовФормы.ВалютаДокумента  		  	= ЭтаФорма.НастройкиОтчета.ВалютаДокумента;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         	= ЭтаФорма.НастройкиОтчета.ЕдиницаИзмерения;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	= ЭтаФорма.НастройкиОтчета.ТочностьЕдиницыИзмерения;
				ЭтаФорма.Подписант 									= ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
			Иначе	
				СтруктураРеквизитовФормы.ВалютаДокумента  		  = СтруктураРеквизитовФормы.Организация.ВалютаУчета;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			КонецЕсли; 
			
			ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
			СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода = КонсолидированнаяОтчетность.ПолучитьОтчетНаКонецПредыдущегоПериода(СтруктураРеквизитовФормы, ИсточникОтчета);			
			ЭтаФорма.СтатусОтчета = "Черновик";
			
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьТабличныеДокументыИзМакетов();
		ЗаполнитьДенежныйПоказательСРазмерностью();
		
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
	
		Если ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
			
			ЭтаФорма.КлючТекущихНастроек = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
			КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ");
		
		КонецЕсли;
				
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НаимСчетаДоверительногоУправления = СтруктураРеквизитовФормы.СчетДоверительногоУправления.Наименование;
	
	Если Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 1 Тогда 
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	ИначеЕсли СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = "период с " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	Иначе
		СтруктураРеквизитовФормы.СтрПериодОтчета = "Январь - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	КонецЕсли;
	
	ИнициализироватьСтруктуруЗаголовковОтчетов();
	
	мСкопированаФорма = Неопределено;
	Параметры.Свойство("мСкопированаФорма", мСкопированаФорма);
	Если ЗначениеЗаполнено(мСкопированаФорма) Тогда 
		Модифицированность = Истина;
	КонецЕсли;
	
	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);
	Элементы.НомерКорректировки.Видимость = ЭтаФорма.СтатусОтчета = "Корректировка";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерностьВалюту()
	
	ЕдиницаИзмеренияНадпись = "";
	ПредставлениеВалютыДокумента = ?(ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента), СтруктураРеквизитовФормы.ВалютаДокумента, "руб");
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		ЕдиницаИзмеренияНадпись = "в "+ ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		ЕдиницаИзмеренияНадпись = "в тысячах " + ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		ЕдиницаИзмеренияНадпись = "в миллионах " + ПредставлениеВалютыДокумента;
	КонецЕсли;
	
	Возврат ЕдиницаИзмеренияНадпись;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДенежныйПоказательСРазмерностью()
	
	ДенежныйПоказательСРазмерностью = КонсолидированнаяОтчетность.ПолучитьДенежныйПоказательСРазмерностью(СтруктураРеквизитовФормы, ЭтаФорма);
	
	РазмерностьДокумента = ПолучитьРазмерностьВалюту();
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		ИмяРаздела = ТекСтрока.ИмяРаздела;
		
		Попытка
			ТекРаздел = ТекСтрока.ТабличныйДокумент;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если НЕ ТекРаздел.Области.Найти("ДенежныйПоказательСРазмерностью") = Неопределено
			и ТекРаздел.Области.ДенежныйПоказательСРазмерностью.СодержитЗначение
			Тогда
			ТекРаздел.Области.ДенежныйПоказательСРазмерностью.Значение = ДенежныйПоказательСРазмерностью;
		КонецЕсли;
		Если НЕ ТекРаздел.Области.Найти("НаименованиеВалютыОтчета") = Неопределено 
			и ТекРаздел.Области.НаименованиеВалютыОтчета.СодержитЗначение
			Тогда
			ТекРаздел.Области.НаименованиеВалютыОтчета.Значение = РазмерностьДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруЗаголовковОтчетов()
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов = Новый Соответствие;
	
	КонецПредыдущегоГода = КонецГода(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	ГодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ = 'гггг'");
	ГодПредыдущий = Формат(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12), "ДФ = 'гггг'");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодОтчетногоГода", "за " + ГодОтчета + "г.");
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодПредыдущегоГода", "за " + ГодПредыдущий + "г.");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаОтчетнуюДату", "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD"));
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаКонецПредыдущегоГода", "На " + Формат(КонецПредыдущегоГода, "ДЛФ=DD"));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные(СписокСохранения = Неопределено)
	
	Перем ПоказателиОтчета;
	Перем ТаблицаРасшифровки;
	Перем РазделыСРучнойКорректировкой;
	
	СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
	
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         	 = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	 = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.ВалютаДокумента			 = СтруктураРеквизитовФормы.мСохраненныйДок.ВалютаДокумента;
	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода 	 = СтруктураРеквизитовФормы.мСохраненныйДок.ОтчетНаКонецПрошлогоГода;
	Комментарий                                        	 = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтатусОтчета                                         = СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета;
	НомерКорректировки                                 	 = СтруктураРеквизитовФормы.мСохраненныйДок.НомерКорректировки;

	// восстанавливаем сохраненные данные отчета
	Если СписокСохранения = Неопределено Тогда
		СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	КонецЕсли; 
		
	СписокСохранения.Свойство("Расшифровка", ТаблицаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		
		Адрес_ТаблицаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, УникальныйИдентификатор);
		
	КонецЕсли;
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("РазделыСРучнойКорректировкой", РазделыСРучнойКорректировкой);
	СписокСохранения.Свойство("Подписант", ЭтаФорма.Подписант);
	
	Для Каждого ТекСтрока из ЭтаФорма.РазделыОтчета Цикл
		Если Не РазделыСРучнойКорректировкой.Найти(ТекСтрока.ИмяРаздела) = Неопределено Тогда
			ТекСтрока.РучнаяКорректировка = Истина;
			КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ТекСтрока.ИмяРаздела, ТекСтрока.ТабличныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока из ПоказателиОтчета Цикл
		Попытка
			ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекСтрока.ИмяРаздела);
			ТабДок.Области[ТекСтрока.ИмяПоказателя].Значение = ТекСтрока.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеДокументыИзМакетов(ЭтоНовый = Истина)
	
	ТаблицаИзменяемыхОбластей = КонсолидированнаяОтчетность.ПолучитьТаблицуИзменяемыхОбластей("РегламентированныйОтчетОПотокахДенежныхСредствНПФФормаОтчета_МСФО39_СК_2020");
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		Попытка
			
			Префикс = "МСФО39_";
			
			//Если ТекСтрока.ИмяРаздела = "ОтчетТитульнаяСтраницаСК_2020"
			//	ИЛИ ТекСтрока.ИмяРаздела = "ФинансоваяДеятельностьСК_2020"
			//	ИЛИ ТекСтрока.ИмяРаздела = "ИнвестиционнаяДеятельностьСК_2020" Тогда
			//
			//	Префикс = ?(СтруктураРеквизитовФормы.НКО, "МСФО39_НКО_", "МСФО39_");
			//
			//КонецЕсли; 
			
			ИмяМакета = Префикс + "Макет" + ТекСтрока.ИмяРаздела;
			
			КонсолидированнаяОтчетность.ЗаполнитьТабличныйДокументИзМакета(ЭтаФорма, ТекСтрока, ИмяМакета, ТаблицаИзменяемыхОбластей);
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦветФонаЯчейки(ИмяТекРаздела = "", ТекРаздел = Неопределено)

	КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяТекРаздела, ТекРаздел);
	Если ЗначениеЗаполнено(ТекРаздел = Неопределено) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяТекРаздела);
	Иначе
		ЭтаФорма.ТабличныйДокумент = ТекРаздел;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
		
		СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраницаСК_2020";
		СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
		
		ЗаполнитьАвто();
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
			ЭтаФорма.СтатусОтчета = "Черновик";
		КонецЕсли; 
		
		Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
			Записать(Неопределено);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьФорму Тогда
		ЭтаФорма.Открыть();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить() Экспорт
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраницаСК_2020";
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
	
	ЗаполнитьАвто();
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
		ЭтаФорма.СтатусОтчета = "Черновик";
	КонецЕсли; 
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьСтруктуруРеквизитовФормы();
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы, Параметры);
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	КонсолидированнаяОтчетность.ЗаполнитьСтруктуруПеременныхДляОтбора(СтруктураПеременныхДляОтбора);
	
	Инициализация(Параметры.БезОткрытияФормы);
	
	ИмяОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].ИмяРаздела;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	КонсолидированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонсолидированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета) Тогда
	
		ПредыдущаяСтрока = ЭтаФорма.РазделыОтчета.НайтиПоИдентификатору(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета);
		Если Не ПредыдущаяСтрока = Неопределено Тогда
		
			ПредыдущаяСтрока.ТабличныйДокумент = ЭтаФорма.ТабличныйДокумент;
		
		КонецЕсли; 
	
	КонецЕсли; 
		
	НаимТекущегоРаздела = Элемент.ТекущиеДанные.ИмяРаздела;
	ЭтаФорма.РучнаяКорректировка = Элемент.ТекущиеДанные.РучнаяКорректировка;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = НаимТекущегоРаздела;
	
	Если НаимТекущегоРаздела = "ОтчетТитульнаяСтраницаСК_2020" Тогда
		
		Элементы.РучнаяКорректировка.Доступность = Ложь;
		
	Иначе
		
		Элементы.РучнаяКорректировка.Доступность = Истина;
	
	КонецЕсли; 	
	
	ЭтаФорма.ТабличныйДокумент = Элемент.ТекущиеДанные.ТабличныйДокумент;
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Истина;
		РучнаяКорректировкаПриУстановкеСервер(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		УстановитьЦветФонаЯчейки(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
	Иначе
		
		ЭтаФорма.РучнаяКорректировка = Истина;
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РучнаяКорректировкаПриИзмененииВопросЗавершение",
		ЭтотОбъект,)
		,
		НСтр("ru = 'Будет произведено автоматическое заполнение закладки. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзмененииВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Ложь;
	ЭтаФорма.РучнаяКорректировка = Ложь;
	ЗаполнитьАвто(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриУстановкеСервер(ИмяРаздела)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Раздел", ИмяРаздела);
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Расчет(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифровкаНажатие(Неопределено);
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеОтчета

&НаСервереБезКонтекста
Функция ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет)
	Возврат РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет);
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДанныеДокумента(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегламентированныйОтчет.ДатаНачала КАК ДатаНачала,
		|	РегламентированныйОтчет.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат Новый Структура("ДатаНачала, ДатаОкончания", ВыборкаДетальныеЗаписи.ДатаНачала, ВыборкаДетальныеЗаписи.ДатаОкончания);
	
	КонецЕсли;

	Возврат Новый Структура("ДатаНачала, ДатаОкончания");
	
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьАвто(ИмяРаздела = "")

	Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(,"Необходимо указать валюту отчета!");
		Возврат;
	КонецЕсли;
	
	Если Не (ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")) Тогда
		ЭтаФорма.НастройкиОтчета = ПолучитьНастройкиОтчета(
			ЭтаФорма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, 
			ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления,
			"РегламентированныйОтчетОПотокахДенежныхСредствНПФ");		
	КонецЕсли; 
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	Если СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12);
	Иначе
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецМесяца(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода) Тогда
		
		ДанныеДокумента = ПолучитьДанныеДокумента(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
		
		СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДанныеДокумента.ДатаНачала;
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецДня(ДанныеДокумента.ДатаОкончания);
	
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
		
	КонсолидированнаяОтчетностьКлиент.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	// Очистка разделов
	Очистить(ИмяРаздела);
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	нСч = 0;
	ПредставлениеОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].Представление;
	// Заполнение разделов
	Если ИмяРаздела = "" Тогда
		
		Всего = ЭтаФорма.РазделыОтчета.Количество();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				
				Состояние("Заполняется раздел: " + ТекСтрока.Представление, нСч/Всего * 100, "Заполнение...");
				Выполнить("Подключаемый_ЗаполнитьРаздел_" + ТекСтрока.ИмяРаздела + "()");
				нСч = нСч + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяРаздела + "()");
		КонецЕсли;
		
	КонецЕсли;
	
	Если нСч Тогда
		Состояние("Заполняется раздел: " + ПредставлениеОсновногоРаздела, нСч/Всего * 100, "Заполнение...");
	КонецЕсли;
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		Очистить(ИмяОсновногоРаздела);
	КонецЕсли;
	
	Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
	
	Если нСч Тогда
		Состояние();
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		
		ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета[0].ТабличныйДокумент;
		
	Иначе
		
		ЭтаФорма.ТабличныйДокумент = Элементы.РазделыОтчета.ТекущиеДанные.ТабличныйДокумент;
	
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

 &НаСервере
Процедура Очистить(ИмяРаздела = "")
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Если ИмяРаздела = "" Тогда
		
		ТаблицаРасшифровки.Очистить();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			ОчиститьТабличноеПоле(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
			
		КонецЦикла;
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("Раздел", ИмяРаздела);
		НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
		ОчиститьТабличноеПоле(ТабДок, ИмяРаздела);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	ЗаполнитьЗаголовки(ИмяРаздела);
	ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела)
	
	Если ИмяРаздела = "ОтчетТитульнаяСтраницаСК_2020" Тогда
		Возврат;	
	КонецЕсли; 
	
	НайденныеСтроки = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела));
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
		
			ТекСтрока.РучнаяКорректировка = Ложь;
		
		КонецЦикла; 
		
	КонецЕсли;
	
	УстановитьЦветФонаЯчейки(ИмяРаздела);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПоле(ВыбТабличныйДокумент, ИмяРаздела)
	
	Для Каждого ТекОбласть Из ВыбТабличныйДокумент.Области Цикл
			
		Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Не ТекОбласть.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка макета: раздел " + ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		ТекОбласть.Очистить();
		
	КонецЦикла;
	
	РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела);
	
КонецПроцедуры // ОчиститьТабличноеПоле()

&НаСервере
Процедура ЗаполнитьЗаголовки(ИмяРаздела = "")
	//#ЗаполнениеЗаголовков
	
	Если ИмяРаздела = "" Тогда
		мМассивРазделов = ЭтаФорма.РазделыОтчета.Выгрузить(, "ИмяРаздела").ВыгрузитьКолонку(0);
	Иначе
		мМассивРазделов = Новый Массив;
		мМассивРазделов.Добавить(ИмяРаздела);
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	Если СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12);
	Иначе
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецМесяца(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода) Тогда
			
			ДанныеДокумента = ПолучитьДанныеДокумента(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
			
			СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДанныеДокумента.ДатаНачала;
			СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецДня(ДанныеДокумента.ДатаОкончания);
			
		КонецЕсли;
		
		СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	КонецЕсли;
	
	
	Для Каждого ТекИмяРаздела из мМассивРазделов Цикл
		Если ТекИмяРаздела = "Настройка"
			или ТекИмяРаздела = "Проверка"
			или ТекИмяРаздела = "ПроверкаПротоколОшибок"
			Тогда
			Продолжить;
		КонецЕсли;
		
		ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекИмяРаздела);
		
		// Настройки заполнения шапки: Текущий период
		Если НЕ ТекРаздел.Области.Найти("ТекущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
		КонецЕсли;
		
		// Настройки заполнения шапки: Предыдущий период
		Если НЕ ТекРаздел.Области.Найти("ПредыдущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ПредыдущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		КонецЕсли;
		
		// Настройки для заголовков периодов
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокНачалоПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокНачалоПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокКонецПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокКонецПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		// Настройки для титульного листа
		Если ТекИмяРаздела = "ОтчетТитульнаяСтраницаСК_2020" Тогда
			Если НЕ ТекРаздел.Области.Найти("ТекущийПериод1") = Неопределено Тогда
				ТекРаздел.Области.ТекущийПериод1.Значение = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);    
			КонецЕсли;
			
			СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
			Если НЕ СведенияОбОрганизации = Неопределено Тогда
			
				Если НЕ ТекРаздел.Области.Найти("Организация") = Неопределено Тогда
					ТекРаздел.Области.Организация.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
						СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
						СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				
				Если НЕ ТекРаздел.Области.Найти("ПочтовыйАдресОрганизации") = Неопределено Тогда
					ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдрес;
				КонецЕсли;	
			
			КонецЕсли; 
						
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#Область ОбщиеПроцедурыЗаполнения

&НаСервере
Функция ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь, стрДопПоля = "", стрГруппировка = "Счет ИЕРАРХИЯ")
	
	Если ТипЗнч(ВидыСубконто) = Тип("СписокЗначений") Тогда
		
		Если Развернутый Тогда
			КоличествоСубконто = ВидыСубконто.Количество();
			Для Ном = 1 По КоличествоСубконто Цикл
				стрДопПоля = стрДопПоля + Символы.ПС + "Субконто" + Ном + ",";
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СальдоОборот = "Оборот" Тогда
		
		ШаблонТекстаЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			" + ?(ПустаяСтрока(КодКорреспондентскогоСчета), "", ВидСравненияКорсчета + ", &ВидыСубконтоКорСчета") + "
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|" + стрОтбор + "
		|
		|ИТОГИ
		|	СУММА(СуммаОборотДт),
		|	СУММА(СуммаОборотКт)
		|ПО
		|	" + стрГруппировка;
		
	Иначе
		
		ШаблонТекстаЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			" + ?(СальдоОборот = "НаНачало", "&НачалоПериода", "&грКонецПериода") + ",
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ") КАК вэУправленческий" + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, "
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|		ПО вэУправленческий.Счет = СчетаСОборотнымСубконтоКонтрагенты.Счет", "") + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|" + стрОтбор + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, ?(стрОтбор = "", "ГДЕ", " И ") + "
		|			(НЕ СчетаСОборотнымСубконтоКонтрагенты.Счет ЕСТЬ NULL )
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вэУправленческий.Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			,
		|			" + ?(СальдоОборот = "НаНачало", "ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1)", "&КонецПериода") + ",
		|			,
		|			Счет В ИЕРАРХИИ (&СписокСчетов)
		|				И Счет В
		|					(ВЫБРАТЬ
		|						СчетаСОборотнымСубконтоКонтрагенты.Счет
		|					ИЗ
		|						СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			,
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|" + стрОтбор, "") + "
		|
		|ИТОГИ
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт),
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт)
		|ПО
		|	" + стрГруппировка;
	КонецЕсли;
	
	Возврат ШаблонТекстаЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, СальдоОборот, ЗаПериод, ТекРаздел, ВидыСубконто = Неопределено, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", стрТаблицаКурсовВалют = "КоэффициентыВалютПП", РезервПодОбесценение = ЛОЖЬ)
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если СальдоОборот = "НаНачало" Или СальдоОборот = "НаКонец" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто, Ложь, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	
	Если ЗаПериод = "ЗаПрошлыйПериод" Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", стрТаблицаКурсовВалют);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		
		ТекСчет = СтрокаСчета.Счет;
		
		ИмяСлагаемого     = СтрокаСчета.ИмяСлагаемого;
		ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
		ЗнакОперации      = СтрокаСчета.ЗнакОперации;
		ТекстРасшифровки  = СтрокаСчета.ТекстРасшифровки;
		
		ИмяЯчейки             = СтрокаСчета.ИмяЯчейки;
		СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		
		Если ТекстРасшифровки = "" Тогда
			СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(ТекСчет.Код), КодКорреспондентскогоСчета, ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета));
		Иначе
			СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		КонецЕсли;
			
		КонсолидированнаяОтчетность.СкорректироватьСлагаемоеНаименование_ОФР(Запрос, СлагаемоеНаименование);
		
		ТекСумма = 0;
		
		ВыборкаПоСчетам.Сбросить();
		ОтборСчета = Новый Структура("Счет", ТекСчет);
		Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
			ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
		КонецЕсли;
		
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, СтрокаСчета.ИмяПоказателя, ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
		
	КонецЦикла;
		
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Если РезервПодОбесценение Тогда
		ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, СальдоОборот, ЗаПериод, ТекРаздел, стрСчетОбесценение, стрОтборВирт = "", ИмяЯчейкиНеобесцененные = "03", ИмяЯчейкиОбесцененные = "04")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	КодКорреспондентскогоСчета = "";
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Врем_мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	мТаблицаСчетов = Врем_мТаблицаСчетов.Скопировать();
	
	мТаблицаСчетов.Колонки.Добавить("СуммаОбесцененные", Новый ОписаниеТипов("Число"));
	мТаблицаСчетов.Колонки.Добавить("ИмяРеквизитаСуммыОбесценение", Новый ОписаниеТипов("Строка"));
	мТаблицаСчетов.Колонки.Добавить("ДтКтОбесценение", Новый ОписаниеТипов("Строка"));
	
	Для Каждого стр_мТаблицаСчетов из мТаблицаСчетов Цикл
		Если стр_мТаблицаСчетов.ИмяСлагаемого = "!СКД" Тогда
			стр_мТаблицаСчетов.ИмяРеквизитаСуммыОбесценение = "СуммаОбесцененныеКт"; //Берем противоположное: Дт - Кт
			стр_мТаблицаСчетов.ДтКтОбесценение = "кредит";
		ИначеЕсли  стр_мТаблицаСчетов.ИмяСлагаемого = "!СКК" Тогда
			стр_мТаблицаСчетов.ИмяРеквизитаСуммыОбесценение = "СуммаОбесцененныеДт"; //Берем противоположное: Кт - Дт
			стр_мТаблицаСчетов.ДтКтОбесценение = "дебет";
		КонецЕсли;
	КонецЦикла;
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	
	// КешТаблицаДляСчетовОбесценение+++
	Если НЕ Адрес_КешТаблицаДляСчетовОбесценение = "" Тогда
		мКешТаблицаДляСчетовОбесценение = ПолучитьИзВременногоХранилища(Адрес_КешТаблицаДляСчетовОбесценение);
		СписокСчетовОбесцененные = Новый СписокЗначений;
		тзЯчейки = мТаблицаСчетов.Скопировать();
		тзЯчейки.Свернуть("ИмяЯчейки");
		стрИменаЯчеек = "";
		Для Каждого стр_тзЯчейки из тзЯчейки Цикл
			стрИменаЯчеек = стрИменаЯчеек + ?(стрИменаЯчеек = "", "", ",") + стр_тзЯчейки.ИмяЯчейки;
			мСтроки_мКешТаблицаДляСчетовОбесценение = мКешТаблицаДляСчетовОбесценение.НайтиСтроки(Новый Структура("Строка", стр_тзЯчейки.ИмяЯчейки));
			Для Каждого стр_мКешТаблицаДляСчетовОбесценение из мСтроки_мКешТаблицаДляСчетовОбесценение Цикл
				СписокСчетовОбесцененные.Добавить(стр_мКешТаблицаДляСчетовОбесценение.Счет);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокСчетовОбесцененные.Количество() = 0 Тогда
		//!!!!!!ТекстСообщения = НСтр("ru = 'Раздел " + ИмяРаздела + ". При заполнении строки " + стрИменаЯчеек + " не найдены счета из колонки ""Резерв под обесценение"", используется счет: " + стрСчетОбесценение + "'");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		СписокСчетовОбесцененные = ПолучитьСчетПоКоду(стрСчетОбесценение);
	КонецЕсли;
	// КешТаблицаДляСчетовОбесценение---
	
	Запрос.УстановитьПараметр("СчетОбесцененные", СписокСчетовОбесцененные);
	
	// ДепозитыМенее90Дней добавлено в запрос
	
	ТекстЗапроса = КонсолидированнаяОтчетность.ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные_ТекстЗапроса(ЭтаФорма);
	
	Если стрОтборВирт = "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &стрОтборВирт", "И ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &стрОтборВирт", стрОтборВирт);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		
		ТекСчет = СтрокаСчета.Счет;
		
		ИмяСлагаемого     = СтрокаСчета.ИмяСлагаемого;
		ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
		ИмяРеквизитаСуммыОбесценение = СтрокаСчета.ИмяРеквизитаСуммыОбесценение;
		
		ЗнакОперации      = СтрокаСчета.ЗнакОперации;
		ТекстРасшифровки  = СтрокаСчета.ТекстРасшифровки;
		
		ИмяЯчейки             = СтрокаСчета.ИмяЯчейки;
		СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		
		Если ТекстРасшифровки = "" Тогда
			СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(ТекСчет.Код), КодКорреспондентскогоСчета, ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
		Иначе
			СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		КонецЕсли;
		
		ТекСумма = 0;
		ТекСуммаОбесцененные = 0;
		
		ВыборкаПоСчетам.Сбросить();
		ОтборСчета = Новый Структура("Счет", ТекСчет);
		Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
			ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			
			Если ЗначениеЗаполнено(ИмяРеквизитаСуммыОбесценение) Тогда
				ТекСуммаОбесцененные = ?(ЗнакОперации = "-", -1, 1) * ВыборкаПоСчетам[ИмяРеквизитаСуммыОбесценение];
				СтрокаСчета.СуммаОбесцененные = СтрокаСчета.СуммаОбесцененные + ТекСуммаОбесцененные;
				
				СтрокаСчета.Сумма = СтрокаСчета.Сумма - ТекСуммаОбесцененные;
				ТекСумма = СтрокаСчета.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
		// 03
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки + ИмяЯчейкиНеобесцененные, СтрокаСчета.ИмяПоказателя, ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
		
		// 04
		стрИмяПоказателя = СтрЗаменить(СтрокаСчета.ИмяПоказателя, "Необесцененные", "Обесцененные");
		
		стрТекстСчетСчеты = ?(СписокСчетовОбесцененные.Количество() = 1, "счете", "счетах");
		стрТекстРасшифровки = "Остаток на конец периода #Период# по " + СтрокаСчета.ДтКтОбесценение + "у счета " + ТекСчет + " с учетом отборов по строке для столбца 3 (анализ ценных бумаг на " + стрТекстСчетСчеты + " " + СписокСчетовОбесцененные + ")";
		
		стрСлагаемоеНаименование = СтрЗаменить(стрТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки + ИмяЯчейкиОбесцененные, стрИмяПоказателя, ЗнакОперации, стрСлагаемоеНаименование, ТекСуммаОбесцененные, СписокСчетовОбесцененные, , , , ИмяРаздела);
		
	КонецЦикла;
		
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма, СуммаОбесцененные");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма, СуммаОбесцененные");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки + ИмяЯчейкиНеобесцененные, СтрокаСчета.Сумма);
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки + ИмяЯчейкиОбесцененные, СтрокаСчета.СуммаОбесцененные);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	Если ИмяРаздела = "АнализЧувствительности71" Тогда
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "КАК СуммаКонечныйОстатокДт,",
		"КАК СуммаКонечныйОстатокДт,
		|	вэУправленческий.ВалютнаяСуммаОстатокДт КАК СуммаКонечныйОстатокДтВВалюте,
		|	вэУправленческий.ВалютнаяСуммаОстатокКт КАК СуммаКонечныйОстатокКтВВалюте,");
		
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "
		|ИТОГИ", "
		|ИТОГИ
		|	СУММА(СуммаКонечныйОстатокДтВвалюте),
		|	СУММА(СуммаКонечныйОстатокКтВвалюте),");
	КонецЕсли;
	
	НачалоЦикла = ?(НомерКолонкиОтчетногоПериода = "", 2, 1);
	КоличествоЦиклов = ?(НомерКолонкиПредыдущегоПериода = "", 1, 2);	
	
	Для НомерЦикла = 1 По КоличествоЦиклов Цикл
		
		Если НомерЦикла = 1 Тогда
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		Иначе
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФинансовыеОрганизацииТП", "&ФинансовыеОрганизацииПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ИмяРаздела = "АнализЧувствительности71" Тогда
			ВалютаВыведена = Ложь;
		КонецЕсли;
		
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			Если ТекстРасшифровки = "" Тогда
				СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
			Иначе
				СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина"));
			КонецЕсли;
			
			ТекСумма = 0;
			ТекСуммаРасшифровки = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				Если ИмяРаздела = "АнализЧувствительности71" Тогда
					ТекСуммаРасшифровки = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы + "ВВалюте");
				КонецЕсли;
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			Если ИмяРаздела = "АнализЧувствительности71" Тогда //Расшифровка в валюте проводки, отчет в валюте документа
				Если Не ВалютаВыведена Тогда
					Выборка = ВыборкаПоСчетам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					ТекВалюта = Запрос.Параметры.Валюта;
					ТекКурс = Запрос.Параметры.Курс;
					ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", "", "#Валюта: " + ТекВалюта + "; Курс = " + ТекКурс + " * 0,1",0, , , , , ИмяРаздела);
					ВалютаВыведена = Истина;
				КонецЕсли;
				
				ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСуммаРасшифровки, ТекСчет, , , , ИмяРаздела);
			Иначе
				Если Запрос.Параметры.Свойство("ДополнительнаяАналитика") и СтрЧислоВхождений(стрОтборВирт, "ДополнительнаяАналитика") > 0 Тогда
					стрЗначенияОтбора = "";
					Для Каждого эл из Запрос.Параметры.ДополнительнаяАналитика Цикл
						стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
					КонецЦикла;
					
					стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по дополнительной аналитике", "исключая дополнительную аналитику");
			
					СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + ": " + стрЗначенияОтбора;
				КонецЕсли;
				ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
			КонецЕсли;
			
		КонецЦикла;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	//Запрос = ПолучитьИзВременногоХранилища(Адрес_Запрос);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	Если ИмяРаздела = "АнализЧувствительности71" Тогда
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "КАК СуммаКонечныйОстатокДт,",
		"КАК СуммаКонечныйОстатокДт,
		|	вэУправленческий.ВалютнаяСуммаОстатокДт КАК СуммаКонечныйОстатокДтВВалюте,
		|	вэУправленческий.ВалютнаяСуммаОстатокКт КАК СуммаКонечныйОстатокКтВВалюте,");
		
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "
		|ИТОГИ", "
		|ИТОГИ
		|	СУММА(СуммаКонечныйОстатокДтВвалюте),
		|	СУММА(СуммаКонечныйОстатокКтВвалюте),");
	КонецЕсли;
	
	Для НомерЦикла = 1 По 2 Цикл
		
		Если НомерЦикла = 1 Тогда
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		Иначе
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КурсыВалютНаКонецТекущегоПериода", "КурсыВалютНаКонецПрошлогоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		
		ТекстСравненияПоСубконтоПредставление = "";
		СравнениеИтогаСНулем = "";
		КонсолидированнаяОтчетность.ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, мТаблицаСчетов, ТекстСравненияПоСубконтоПредставление, СравнениеИтогаСНулем, стрОтборВирт);
		
		стрВсеСчета = "";
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			стрВсеСчета = стрВсеСчета + ?(стрВсеСчета = "", "", ", ") + СтрокаСчета.Счет;
		КонецЦикла;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//данные выводим итогом по счетам
		ИтогСумма = 0;
			
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			//Если ТекстРасшифровки = "" Тогда
			//	СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, ?(НомерЦикла = 1, мДатаНачалаПериодаОтчета, мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, мДатаКонцаПериодаОтчета, мДатаКонцаПрошлогоПериодаОтчета));
			//Иначе
			//	СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(НомерЦикла = 1, мДатаНачалаПериодаОтчета, мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, мДатаКонцаПериодаОтчета, мДатаКонцаПрошлогоПериодаОтчета), "ФП = Истина"));
			//КонецЕсли;
			
			ТекСумма = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			ИтогСумма = ИтогСумма + ТекСумма;
			
		КонецЦикла;
			
		//обнулим сумму, если она не подходит под условие СравнениеИтогаСНулем
		Если СравнениеИтогаСНулем = "Больше" и ИтогСумма < 0 Тогда
			ИтогСумма = 0;
		ИначеЕсли СравнениеИтогаСНулем = "Меньше" и ИтогСумма > 0 Тогда
			ИтогСумма = 0;
		КонецЕсли;
		
		СлагаемоеНаименование = "Все субконто у которых " + ТекстСравненияПоСубконтоПредставление + " итог по счетам: " + стрВсеСчета;
		
		Если Запрос.Параметры.Свойство("мВидыДоходовРасходовНФО") и СтрЧислоВхождений(стрОтборВирт, "ГруппыФинансовогоУчетаДоходовРасходов") > 0  Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мВидыДоходовРасходовНФО Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", ", ") + эл;
			КонецЦикла;
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор по ОФР " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("мУПЦБКлассификация") и СтрЧислоВхождений(стрОтборВирт, "мУПЦБКлассификация") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мУПЦБКлассификация Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("УчетныйАктивЦБРФ") и СтрЧислоВхождений(стрОтборВирт, "УчетныйАктивЦБРФ") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.УчетныйАктивЦБРФ Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("ДополнительнаяАналитика") и СтрЧислоВхождений(стрОтборВирт, "ДополнительнаяАналитика") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.ДополнительнаяАналитика Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по дополнительной аналитике", "исключая дополнительную аналитику");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + ": " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если НЕ СтрокаСчета = Неопределено Тогда
			ЗнакОперации = "+";
			ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ИтогСумма, стрВсеСчета, , , , ИмяРаздела);
		КонецЕсли;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			//значение ячейки выставляем по итогу
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, ИтогСумма);
			//УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиПоследнийКвартал, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
			ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса("Оборот", ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
		Иначе
			ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
		КонецЕсли;
	КонецЕсли;
	
	чНачалоЦикла = 2;//?(Объект.ОтчетЗаПоследнийКвартал, 2, 1);
	Для НомерЦикла = чНачалоЦикла По 3 Цикл
		
		// КешТаблицаМэппингаДляПрошлогоПериода+++
		Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
		Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
			Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		КонецЕсли;
		
		Если НомерЦикла = 3 Тогда
			//!!!!!!УПЦБ_ЗащищенныйМодуль.ЗаменитьСчетаПрошлогоПериодаПоМэппингу(Запрос, "СписокСчетов", Адрес_КешТаблицаМэппингаДляПрошлогоПериода);
			Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
				//!!!!!!УПЦБ_ЗащищенныйМодуль.ЗаменитьСчетаПрошлогоПериодаПоМэппингу(Запрос, "СписокКорСчетов", Адрес_КешТаблицаМэппингаДляПрошлогоПериода);
			КонецЕсли;
		КонецЕсли;
		// КешТаблицаМэппингаДляПрошлогоПериода---
		
		Если НомерЦикла = 1 Тогда
			
			// Определим период начала прошлого квартала
			мНачалоПоследнегоКвартала = НачалоМесяца(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета - 3 * 30 * 60*60*24);
			мНачалоПоследнегоКвартала = Макс(мНачалоПоследнегоКвартала, НачалоГода(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
			Запрос.УстановитьПараметр("НачалоПоследнегоКвартала", мНачалоПоследнегоКвартала);
			лДата1 = мНачалоПоследнегоКвартала;
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
			
			// Для первой колонки всегда "Оборот"
			ТекстЗапроса = ПолучитьШаблонТекстаЗапроса("Оборот", ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПоследнегоКвартала");
			
			ТекПредставлениеПериода = "Последние 3 месяца";
			НомерКолонки = НомерКолонкиПоследнийКвартал;
			
		ИначеЕсли НомерЦикла = 2 Тогда
			лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
			
		ИначеЕсли НомерЦикла = 3 Тогда
			лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета;
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета;
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПериодыКонсолидации КАК ПериодыКонсолидации", "ПериодыКонсолидацииПрошлогоГода КАК ПериодыКонсолидации");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
					
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			Если НомерЦикла = 1 или СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
				// Для первой колонки и признака ОтчетЗаПоследнийКвартал всегда "Оборот"
				ИмяРеквизитаСуммы = "СуммаОборот" + Прав(ИмяРеквизитаСуммы, 2);
				ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, "Сальдо на конец периода", "Оборот за период");
				ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, "Сальдо на начало периода", "Оборот за период");
				
				// КешТаблицаМэппингаДляПрошлогоПериода+++
			ИначеЕсли НомерЦикла = 3 Тогда
				//!!!!!!УПЦБ_ЗащищенныйМодуль.ЗаменитьСчетаПрошлогоПериодаПоМэппингуВРасшифровке(ТекстРасшифровки, Адрес_КешТаблицаМэппингаДляПрошлогоПериода);
				// КешТаблицаМэппингаДляПрошлогоПериода---
				
			КонецЕсли;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			Если ТекстРасшифровки = "" Тогда
				СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, лДата1, лДата2);
			Иначе
				СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(лДата1, лДата2, "ФП = Истина"));
			КонецЕсли;
			
			КонсолидированнаяОтчетность.СкорректироватьСлагаемоеНаименование_ОФР(Запрос, СлагаемоеНаименование);
			
			ТекСумма = 0;
			ТекСуммаРасшифровки = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				
				// +++
				//Если НомерЦикла = 1 или Объект.ОтчетЗаПоследнийКвартал Тогда  
					// Вычтем из суммы корр.оборот, т.е. если берем оборот по Дт, то нужно из него вычесть оборот ко Кт. Если берем оборот по Кт, то нужно из него вычесть оборот по Дт.
					ИмяРеквизитаСуммыКорр = ?(ИмяРеквизитаСуммы = "СуммаОборотДт", "СуммаОборотКт", "СуммаОборотДт");
					ТекСуммаКорр = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммыКорр);
					ТекСумма = ТекСумма - ТекСуммаКорр;
				//КонецЕсли;
				// ---
				
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
			
		КонецЦикла;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры  //ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиПоследнийКвартал, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
			// Для признака ОтчетЗаПоследнийКвартал всегда "Оборот"
			ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса("Оборот", ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
		Иначе
			ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
		КонецЕсли;
	КонецЕсли;
	
	чНачалоЦикла = 2;//?(Объект.ОтчетЗаПоследнийКвартал, 2, 1);
	Для НомерЦикла = чНачалоЦикла По 3 Цикл
		
		// КешТаблицаМэппингаДляПрошлогоПериода+++
		Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
		Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
			Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		КонецЕсли;
		
		Если НомерЦикла = 3 Тогда
			//!!!!!!УПЦБ_ЗащищенныйМодуль.ЗаменитьСчетаПрошлогоПериодаПоМэппингу(Запрос, "СписокСчетов", Адрес_КешТаблицаМэппингаДляПрошлогоПериода);
			Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
				//!!!!!!УПЦБ_ЗащищенныйМодуль.ЗаменитьСчетаПрошлогоПериодаПоМэппингу(Запрос, "СписокКорСчетов", Адрес_КешТаблицаМэппингаДляПрошлогоПериода);
			КонецЕсли;
		КонецЕсли;
		// КешТаблицаМэппингаДляПрошлогоПериода---
		
		Если НомерЦикла = 1 Тогда
			
			// Определим период начала прошлого квартала
			мНачалоПоследнегоКвартала = НачалоМесяца(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета - 3 * 30 * 60*60*24);
			мНачалоПоследнегоКвартала = Макс(мНачалоПоследнегоКвартала, НачалоГода(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
			Запрос.УстановитьПараметр("НачалоПоследнегоКвартала", мНачалоПоследнегоКвартала);
			лДата1 = мНачалоПоследнегоКвартала;
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
			
			// Для первой колонки всегда "Оборот"
			ТекстЗапроса = ПолучитьШаблонТекстаЗапроса("Оборот", ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПоследнегоКвартала");
			
			ТекПредставлениеПериода = "Последние 3 месяца";
			НомерКолонки = НомерКолонкиПоследнийКвартал;
			
		ИначеЕсли НомерЦикла = 2 Тогда
			лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		ИначеЕсли НомерЦикла = 3 Тогда
			лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета;
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета;
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		ТекстСравненияПоСубконтоПредставление = "";
		СравнениеИтогаСНулем = "";
		КонсолидированнаяОтчетность.ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, мТаблицаСчетов, ТекстСравненияПоСубконтоПредставление, СравнениеИтогаСНулем, стрОтборВирт);
		
		стрВсеСчета = "";
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			стрВсеСчета = стрВсеСчета + ?(стрВсеСчета = "", "", ", ") + СтрокаСчета.Счет;
		КонецЦикла;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ИтогСумма = 0;
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
					
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			Если НомерЦикла = 1 или СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
				// Для первой колонки и признака ОтчетЗаПоследнийКвартал всегда "Оборот"
				ИмяРеквизитаСуммы = "СуммаОборот" + Прав(ИмяРеквизитаСуммы, 2);
				ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, "Сальдо на конец периода", "Оборот за период");
				ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, "Сальдо на начало периода", "Оборот за период");
				
				// КешТаблицаМэппингаДляПрошлогоПериода+++
			ИначеЕсли НомерЦикла = 3 Тогда
				//!!!!!!УПЦБ_ЗащищенныйМодуль.ЗаменитьСчетаПрошлогоПериодаПоМэппингуВРасшифровке(ТекстРасшифровки, Адрес_КешТаблицаМэппингаДляПрошлогоПериода);
				// КешТаблицаМэппингаДляПрошлогоПериода---
				
			КонецЕсли;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			ТекСумма = 0;
			ТекСуммаРасшифровки = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				
				// +++
				//Если НомерЦикла = 1 или Объект.ОтчетЗаПоследнийКвартал Тогда  
					// Вычтем из суммы корр.оборот, т.е. если берем оборот по Дт, то нужно из него вычесть оборот ко Кт. Если берем оборот по Кт, то нужно из него вычесть оборот по Дт.
					ИмяРеквизитаСуммыКорр = ?(ИмяРеквизитаСуммы = "СуммаОборотДт", "СуммаОборотКт", "СуммаОборотДт");
					ТекСуммаКорр = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммыКорр);
					ТекСумма = ТекСумма - ТекСуммаКорр;
				//КонецЕсли;
				// ---
				
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			ИтогСумма = ИтогСумма + ТекСумма;
			
		КонецЦикла;
			
		// Обнулим сумму, если она не подходит под условие СравнениеИтогаСНулем.
		Если СравнениеИтогаСНулем = "Больше" и ИтогСумма < 0 Тогда
			ИтогСумма = 0;
		ИначеЕсли СравнениеИтогаСНулем = "Меньше" и ИтогСумма > 0 Тогда
			ИтогСумма = 0;
		КонецЕсли;
		
		СлагаемоеНаименование = "Все субконто у которых " + ТекстСравненияПоСубконтоПредставление + " итог по счетам: " + стрВсеСчета;
		
		Если Запрос.Параметры.Свойство("мВидыДоходовРасходовНФО") Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мВидыДоходовРасходовНФО Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", ", ") + эл;
			КонецЦикла;
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор по ОФР " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("мУПЦБКлассификация") Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мУПЦБКлассификация Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если НЕ СтрокаСчета = Неопределено Тогда
			ЗнакОперации = "+";
			ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ИтогСумма, стрВсеСчета, , , , ИмяРаздела);
		КонецЕсли;
			
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			// Значение ячейки выставляем по итогу
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, ИтогСумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры  //ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды

&НаСервере
Процедура УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ СчетаСОборотнымСубконтоКонтрагенты ИЗ &ТаблицаСчетовСОбСубконто КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютТП ИЗ &КоэффициентыВалютТП КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютПП ИЗ &КоэффициентыВалютПП КАК ТЗ";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетПоКоду(Счета, флСообщитьОНеНайденномСчете = Истина)
	
	Если ТипЗнч(Счета) <> Тип("Строка") Тогда
		Возврат Неопределено;
	Иначе
		
		ПланСчетов = ПланыСчетов.Единый;
		
		СписокСчетов = Новый СписокЗначений;
		
		Счета = СтрЗаменить(Счета, " ", "");
		Счета = СтрЗаменить(Счета, ",", Символы.ПС);
		
		Для НомерСтроки = 1 По СтрЧислоСтрок(Счета) Цикл
			
			КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			СчетСсылка = ПланыСчетов.Единый.НайтиПоКоду(КодСчета);
			Если ЗначениеЗаполнено(СчетСсылка) Тогда
			
				СписокСчетов.Добавить(СчетСсылка);
			
			КонецЕсли; 
			//КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			////СчетСсылка = ПланСчетов.НайтиОсновнойПоКоду(КодСчета);
			//мСчета = УПЦБ_ЗащищенныйМодуль.НайтиОсновнойПоКоду(КодСчета, Адрес_КешТаблицаДляПоискаСчетов, Объект.РегистрБухгалтерии);
			//Если мСчета.Количество() = 0 Тогда
			//	
			//	Если флСообщитьОНеНайденномСчете Тогда
			//		
			//		ТекстСообщения = СтрШаблон(
			//		НСтр("ru = 'Не удалось определить счет по коду «%1». Данные по этому счету не попадут в отчет.'"),
			//		КодСчета);
			//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//		
			//	КонецЕсли;
			//	
			//Иначе
			//	Для Каждого СчетСсылка из мСчета Цикл
			//		СписокСчетов.Добавить(СчетСсылка);
			//	КонецЦикла;
			//КонецЕсли;
			
		КонецЦикла;
		
		Возврат СписокСчетов;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы)
	
	СуммаПоСчету = 0;
	
	Если Найти(ИмяРеквизитаСуммы, "Остаток") > 0 И Найти(ИмяРеквизитаСуммы, "Развернутый") = 0 Тогда
		Если ТекСчет.Вид = ВидСчета.АктивноПассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
				Если СуммаОборотПоСчету > 0 Тогда
					СуммаПоСчету = СуммаОборотПоСчету;
				КонецЕсли;
			ИначеЕсли Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы];
				Если СуммаОборотПоСчету < 0 Тогда
					СуммаПоСчету = -СуммаОборотПоСчету;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Активный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Пассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаПоСчету = -(ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы]);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы];
	КонецЕсли;
	
	Возврат СуммаПоСчету;
	
КонецФункции

&НаСервере
Процедура ДобавитьСчетВТаблицуСчетов(ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, КодСчета, ТекстРасшифровки = "", ИмяРеквизитаСуммы = "")
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = ПолучитьСчетПоКоду(КодСчета);
	
	Если СписокСчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокСчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого эл_СписокСчетов из СписокСчетов Цикл
		
		НоваяСтрокаСчета = мТаблицаСчетов.Добавить();
		НоваяСтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		НоваяСтрокаСчета.ИмяПоказателя = ИмяПоказателя;
		НоваяСтрокаСчета.Счет = эл_СписокСчетов.Значение;
		НоваяСтрокаСчета.ЗнакОперации = ЗнакОперации;
		НоваяСтрокаСчета.ИмяСлагаемого = ИмяСлагаемого;
		НоваяСтрокаСчета.ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, КодСчета, эл_СписокСчетов.Значение);
		Если ИмяРеквизитаСуммы <> "" Тогда
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ИмяРеквизитаСуммы;
		Иначе
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода)
	
	Возврат КонсолидированнаяОтчетность.НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода);
	
КонецФункции

&НаСервере
Функция ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого)
	
	Возврат КонсолидированнаяОтчетность.ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет = Неопределено, КорСчет = Неопределено, Сдвиг = Неопределено, ПраваяГраница = Неопределено, Раздел = Неопределено)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	СтруктураПолей = Новый Структура("СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел",
	СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел);
	
	КонсолидированнаяОтчетность.ДобавитьСтрокуВРасшифровку(ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СтруктураПолей);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПоказателя(ТабДокумент, ИмяЯчейки, Знач ЗначениеЯчейки)
	
	Попытка
		Если ТипЗнч(ЗначениеЯчейки) <> Тип("Число") И ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
			ЗначениеЯчейки = Строка(ЗначениеЯчейки);
			Если СтрНайти(ТабДокумент.Области[ИмяЯчейки].Значение, ЗначениеЯчейки) = 0 И ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = ", " + ЗначениеЯчейки;
			ИначеЕсли ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = "";
			КонецЕсли;
		КонецЕсли; 
		ТабДокумент.Области[ИмяЯчейки].Значение = ТабДокумент.Области[ИмяЯчейки].Значение + ?(ЗначениеЯчейки = Null, 0,ЗначениеЯчейки);
	Исключение
		ТекстСообщения = "Ошибка заполнения раздела: " + мИмяЗаполняемогоРаздела + " не найдена ячейка " + ИмяЯчейки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДепозитныеВклады(СчитатьДляЧего = "Тело", Вид = "Все")

	НастройкаПроценты = ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС;
	Если НастройкаПроценты = Неопределено Тогда
		НастройкаПроценты = Ложь;
	КонецЕсли;
	
	Если Вид = "Все" Тогда
		
		Условие = "";
		
	ИначеЕсли Вид = "Долгосрочные" Тогда
		
		Условие = "ГДЕ РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) >= &КоличествоДнейДляПризнанияДепозитаДолгосрочным";
		
		Если СчитатьДляЧего = "Проценты" И НастройкаПроценты Тогда
			Условие = "";
		КонецЕсли;
		
	ИначеЕсли Вид = "Краткосрочные" Тогда
		
		Условие = "ГДЕ РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) < &КоличествоДнейДляПризнанияДепозитаДолгосрочным";
		
		Если СчитатьДляЧего = "Проценты" И НастройкаПроценты Тогда
			Возврат Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК ДепозитныйВклад
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Период, , СчетДоверительногоУправления = &СчетДоверительногоУправления И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|" + Условие + "
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(&НачалоПрошлогоПериода, &КонецПрошлогоПериода, Период, , СчетДоверительногоУправления = &СчетДоверительногоУправления И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПрошлогоПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПрошлогоПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|" + Условие + "";
	
	Запрос.УстановитьПараметр("КоличествоДнейДляПризнанияДепозитаДолгосрочным", ЭтаФорма.НастройкиОтчета.КоличествоДнейДляПризнанияДепозитаДолгосрочным);
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("НачалоПрошлогоПериода", СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПрошлогоПериода", СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДепозитныйВклад");
	
КонецФункции

&НаСервере
Функция ПодготовитьВременныеТаблицыДокумента()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВалютаДокумента"          	, СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("НачалоПериода"            	, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода"             	, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("НачалоПредыдущегоПериода" 	, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода"  	, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("грКонецПериода"           	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("грКонецПредыдущегоПериода"	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, СтруктураРеквизитовФормы.Организация);
	
	ЗапрашиваемыеТаблицы = Новый СписокЗначений;
	ЗапрашиваемыеТаблицы.Добавить("ТаблицаСчетовСОбСубконто");
	ЗапрашиваемыеТаблицы.Добавить("КоэффициентыВалют");
	
	ВременныеТаблицы = КонсолидированнаяОтчетность.ПодготовитьВременныеТаблицыДокумента(Запрос, ЗапрашиваемыеТаблицы);
	
	Для Каждого ЭлементСтруктуры из ВременныеТаблицы Цикл 
		Запрос.УстановитьПараметр(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти 

#Область ПроцедурыЗаполненияРазделов

&НаСервере 
Функция ВернутьКурсовыеРазницы(Запрос, ИмяРаздела)
	
	Если ИмяРаздела = "ФинансоваяДеятельностьСК_2020" Тогда  
		НомСтр = """14""";
		СтрокаГФУ = """37201"", ""37202"", ""37203"", ""37204"", ""37205"", ""37206"", ""47201"", ""47202"", ""47203"", ""47204"", ""47205"", ""47206""";
	ИначеЕсли ИмяРаздела = "ОперационнаяДеятельностьСК_2020" Тогда	
		НомСтр = """29""";
		СтрокаГФУ = """37101"", ""37102"", ""37103"", ""37104"", ""37105"", ""37106"", ""47101"", ""47102"", ""47103"", ""47104"", ""47105"", ""47106""";
	КонецЕсли;	
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&НомСтр КАК НомерСтроки,
		|	""02"" КАК НомерКолонки,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот КАК Сумма,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1.Код В (&СтрокаГФУ),
		|			КорСчет В (&СчетаДС),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&НомСтр,
		|	""03"",
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПредыдущегоПериода,
		|			&КонецПредыдущегоПериода,
		|			Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1.Код В (&СтрокаГФУ),
		|			КорСчет В (&СчетаДС),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СтрокаГФУ", СтрокаГФУ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомСтр", НомСтр);
	
	СчетаДС = Новый Массив;
	СчетаДС.Добавить(ПланыСчетов.Единый.РасчетныеСчета01);
	Если ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС Тогда
		СчетаДС.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами02);	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("СчетаДС", СчетаДС);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции	

&НаСервере
Процедура ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов)
	
	Если Адрес_КешТаблицаДляСчетовОбесценение = "" Тогда
		мКешТаблицаДляСчетовОбесценение = Новый ТаблицаЗначений;
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Строка");
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Счет");
	Иначе
		мКешТаблицаДляСчетовОбесценение = ПолучитьИзВременногоХранилища(Адрес_КешТаблицаДляСчетовОбесценение);
	КонецЕсли;
	
	Для Каждого стр_мТаблицаСчетов из мТаблицаСчетов Цикл
		стр_мКешТаблицаДляСчетовОбесценение = мКешТаблицаДляСчетовОбесценение.Добавить();
		стр_мКешТаблицаДляСчетовОбесценение.Строка = Лев(стр_мТаблицаСчетов.ИмяЯчейки, 3);
		стр_мКешТаблицаДляСчетовОбесценение.Счет = стр_мТаблицаСчетов.Счет; 
	КонецЦикла;
	
	Адрес_КешТаблицаДляСчетовОбесценение = ПоместитьВоВременноеХранилище(мКешТаблицаДляСчетовОбесценение, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ОперационнаяДеятельностьСК_2020Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
#Область П21	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 20603");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20603");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 20507");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20507");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 20508");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20508");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 20613");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20613");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 710");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "710");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 47423 с дополнительной аналитикой ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия""");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.МНО);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика, "47423");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетами 501, 502, 503, 504");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.МНО);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика, "501, 502, 503, 504");
	
	
	Если ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС = Неопределено ИЛИ НЕ ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС Тогда
	
		ПолучитьДепозитныеВкладыКраткосрочные = ПолучитьДепозитныеВклады("Проценты", "Краткосрочные");
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СНД", "20603", "Сальдо на начало периода #Период# по дебету счета 20603 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СНД", "20609", "Сальдо на начало периода #Период# по дебету счета 20609 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СНК", "20611", "Сальдо на начало периода #Период# по кредиту счета 20611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");		
		Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные);
		стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладКраткосрочный;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "02", "03",,,,стрОтборВирт);
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СКД", "20609", "Сальдо на конец периода #Период# по дебету счета 20609 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СКК", "20611", "Сальдо на конец периода #Период# по кредиту счета 20611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные);
		стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладКраткосрочный;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03",,,,стрОтборВирт);
	
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыМНОВДС = Неопределено ИЛИ НЕ ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыМНОВДС Тогда
	
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СНД", "20603", "Сальдо на начало периода #Период# по дебету счета 20603");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СНД", "20609", "Сальдо на начало периода #Период# по дебету счета 20609");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СНК", "20611", "Сальдо на начало периода #Период# по кредиту счета 20611");		
		стрОтборВирт = СтруктураПеременныхДляОтбора.МНО;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "02", "03",,,,стрОтборВирт);
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СКД", "20609", "Сальдо на конец периода #Период# по дебету счета 20609");
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СКК", "20611", "Сальдо на конец периода #Период# по кредиту счета 20611");		
		стрОтборВирт = СтруктураПеременныхДляОтбора.МНО;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03",,,,стрОтборВирт);
	
	КонецЕсли;
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СНД", "20507", "Сальдо на начало периода #Период# по дебету счета 20507");
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "-", "!СНД", "20508", "Сальдо на начало периода #Период# по дебету счета 20508");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СКД", "20507", "Сальдо на конец периода #Период# по дебету счета 20507");
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!СКД", "20508", "Сальдо на конец периода #Период# по дебету счета 20508");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	
	Если ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС Тогда
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!КО", "47011", "Оборот за период #Период# по кредиту счета 47011 в корреспонденции со счетами 30602, 20501");
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "30602, 20501");		
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П21", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47422 по возврату купонного дохода");
		стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КупонныйДоход))"; 		
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47422");	
		
	Иначе
		Если ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО Тогда
			//Деньги брокера в ДС - нет, учитывать репо - да. 
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!КО", "47011", "Оборот за период #Период# по кредиту счета 47011 в корреспонденции со счетами 20501");
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20501");			
		Иначе
			//нет-нет
		КонецЕсли;			
	КонецЕсли;	
		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П21", "Полученные проценты", "+", "!ДО", "205", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетами 47407, 47408 (Купонный доход)");
	стрОтборВирт = СтруктураПеременныхДляОтбора.КупонныйДоход;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , ,стрОтборВирт , "47407, 47408");
	
#КонецОбласти	
	
	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П19", "Полученные проценты", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 47423");
	//стрОтборВирт = СтруктураПеременныхДляОтбора.МНО;
	//стрОтборВирт = СтрЗаменить(стрОтборВирт, "Субконто", "КорСубконто");
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47423");
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П23", "Поступления дивидендов и иных аналогичных выплат", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 60347");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "60347");
	
#Область П24	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П24", "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "+", "!ДО", "205", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетами 47407, 47408 (Не Купонный доход не конверсионные операции)");
	стрОтборВирт = СтруктураПеременныхДляОтбора.НеКупонныйДоходИНеКонсолидированныеОперации;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , ,стрОтборВирт , "47407, 47408");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П24", "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "+", "!ДО", "205", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетом 47423 с дополнительной аналитикой ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика, "47423");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П24", "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "+", "!ДО", "205", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетами 501, 502, 503, 504");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика, "501, 502, 503, 504");	
	
	
	Если ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС Тогда
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П24", "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "+", "!ДО", "30602", "Оборот за период #Период# по дебету счета 30602 в корреспонденции со счетам 47408");
		стрОтборВирт = "И НЕ Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация))"; 		
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47408");		
		
		
	Если ЭтаФорма.НастройкиОтчета.НеРазделятьКомиссииюПокупкиПродажи <> Неопределено И ЭтаФорма.НастройкиОтчета.НеРазделятьКомиссииюПокупкиПродажи Тогда 
			// заполняется в строке П25
		Иначе 	
			//комиссия продажа			
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П24", "Платежи в связи с реализацией финансовых активов, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47019, 47407, 50905, 61210, 715 по покупке, комиссии брокера, торговой комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Продажа), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа))"; 
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47019, 47407, 50905, 61210, 715");
		
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П24", "Платежи в связи с реализацией финансовых активов, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47422 по комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Продажа), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа))"; 		
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47422");			
		КонецЕсли;		
		
			
		Если ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО Тогда
			//учтем в инвестиционной деятельности
		Иначе
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П24", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "+", "!СКК", "47010", "Оборот за период #Период# по дебету счета 30602 в корреспонденции со счетам 47010");
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , , "30602");
			
		КонецЕсли;			
			
	Иначе	
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П24", "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "+", "!ДО", "205", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетом 306");
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "306");
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.КоличествоДнейДляПризнанияДепозитаДолгосрочным = 0 Тогда
			
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П24", "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "+", "!ДО", "205", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетом 20601");
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20601");
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П24", "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "205", "Оборот за период #Период# по кредиту счета 205 в корреспонденции со счетом 20601");
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20601");
		
	КонецЕсли;	
	
#КонецОбласти

#Область П25

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П25", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!ДО", "501", "Оборот за период #Период# по дебету счета 501 в корреспонденции со счетом 205");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "205");
	
	Если ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС Тогда	
		
		
		Если ЭтаФорма.НастройкиОтчета.НеРазделятьКомиссииюПокупкиПродажи <> Неопределено И ЭтаФорма.НастройкиОтчета.НеРазделятьКомиссииюПокупкиПродажи Тогда 
			//не распределять. Вся комиссиия
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П25", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47019, 47407, 50905, 61210, 715 по покупке, комиссии брокера, торговой комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа))"; 
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47019, 47407, 50905, 61210, 715");
			
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П25", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47422 по комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа))"; 		
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47422");
			
		Иначе  //неопределено или нет. Комиссия покупка
			
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П25", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47019, 47407, 50905, 61210, 715 по покупке, комиссии брокера, торговой комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка))"; 
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47019, 47407, 50905, 61210, 715");
		
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П25", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47422 по комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка))"; 		
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47422");
					
		КонецЕсли;
		
		
		
		
		
		Если ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО Тогда
			//учтем в инвестиционной деятельности
		Иначе
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П25", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!СКД", "47010", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47010");
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , , "30602");			
		КонецЕсли;			
		
	Иначе  
				
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П25", "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка", "-", "!ДО", "306", "Оборот за период #Период# по дебету счета 306 в корреспонденции со счетом 205");		
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "205");
				
	КонецЕсли;
#КонецОбласти

#Область П27
	//П15  - 27
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Выплата комиссионного вознаграждения специализированному депозитарию", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");		
	КонецЕсли;		
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика, "47903, 47902");
	
	
	//П16   - 27
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Выплата комиссионного вознаграждения специализированному депозитарию", "+", "!ДО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");		
	Конецесли;	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСРасходыПоВознаграждениюСпецДепозитария;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Выплата комиссионного вознаграждения специализированному депозитарию", "+", "!ДО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");		
	Конецесли;	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСРасходыПоВознаграждениюСпецДепозитария;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60322");
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Выплата комиссионного вознаграждения специализированному депозитарию", "+", "!ДО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Расходы по вознаграждению спецдепозитария""");		
	Конецесли;		
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСРасходыПоВознаграждениюСпецДепозитария;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60312");
	
	//П10 - 27
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Оплата возмещения расходов УК""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Оплата возмещения расходов УК""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Оплата возмещения расходов УК""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Оплата возмещения расходов УК""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Оплата возмещения расходов УК""");		
	КонецЕсли;
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСОплатаВозмещенияРасходовУК;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 	
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");		
	КонецЕсли;	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСНеобходимыеРасходыСпецДепозитария;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Необходимые расходы спецдепозитария""");		
	КонецЕсли;	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСНеобходимыеРасходыСпецДепозитария;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60312");
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Депозитарная комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Депозитарная комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Депозитарная комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Депозитарная комиссия""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Депозитарная комиссия""");		
	КонецЕсли;	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСДепозитарнаяКомиссия;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Банковская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Банковская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Банковская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Банковская комиссия""");
	//возврат
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20202", "Оборот за период #Период# по дебету счета 20202 по виду движения денежных средств ""Банковская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20209", "Оборот за период #Период# по дебету счета 20209 по виду движения денежных средств ""Банковская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 по виду движения денежных средств ""Банковская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "20502", "Оборот за период #Период# по дебету счета 20502 по виду движения денежных средств ""Банковская комиссия""");	
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Банковская комиссия""");	
		//возврат
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "+", "!ДО", "30602", "Оборот за период #Период# по дебету счета 30602 по виду движения денежных средств ""Банковская комиссия""");			
	КонецЕсли;		
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСБанковскаяКомиссия;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "71702");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Брокерская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Брокерская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Брокерская комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Брокерская комиссия""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Брокерская комиссия""");		
	КонецЕсли;		
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСБрокерскаяКомиссия;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Расходы по услугам депозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Расходы по услугам депозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Расходы по услугам депозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Расходы по услугам депозитария""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Расходы по услугам депозитария""");		
	КонецЕсли;	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСРасходыПоУслугамДепозитария;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Расходы по услугам спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Расходы по услугам спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Расходы по услугам спецдепозитария""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Расходы по услугам спецдепозитария""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Расходы по услугам спецдепозитария""");		
	КонецЕсли;		
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСРасходыПоУслугамСпецдепозитария;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Торговая комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Торговая комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Торговая комиссия""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Торговая комиссия""");
	Если ?(ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС=Истина, Истина, Ложь) Тогда 
		ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 по виду движения денежных средств ""Торговая комиссия""");		
	КонецЕсли;	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСТорговаяКомиссия;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по виду движения денежных средств ""Прочие выплаты""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по виду движения денежных средств ""Прочие выплаты""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по виду движения денежных средств ""Прочие выплаты""");
	ДобавитьСчетВТаблицуСчетов("П27", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по виду движения денежных средств ""Прочие выплаты""");
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСПрочиеВыплаты;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
	
#КонецОбласти	


#Область П28

	//налог
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П28", "Расчеты по налогу на прибыль", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 в коррепонденции со счетом 60328");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "60328");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П28", "Расчеты по налогу на прибыль", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в коррепонденции со счетом 60328"); //возврат налога. 
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "60328");	


#КонецОбласти

	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П10", "Оплата прочих административных и операционных расходов", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по Группе финансового учета денежных средств ""Оплата прочих административных и операционных расходов""");
	//ДобавитьСчетВТаблицуСчетов("П10", "Оплата прочих административных и операционных расходов", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по Группе финансового учета денежных средств ""Оплата прочих административных и операционных расходов""");
	//ДобавитьСчетВТаблицуСчетов("П10", "Оплата прочих административных и операционных расходов", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по Группе финансового учета денежных средств ""Оплата прочих административных и операционных расходов""");
	//ДобавитьСчетВТаблицуСчетов("П10", "Оплата прочих административных и операционных расходов", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по Группе финансового учета денежных средств ""Оплата прочих административных и операционных расходов""");
	//стрОтборВирт = "И ((ИСТИНА " + СтруктураПеременныхДляОтбора.ВидДвиженияДСРасходыПоУслугамСпецдепозитария + ") ИЛИ (ИСТИНА" + СтруктураПеременныхДляОтбора.КорДоговорДепозитарногоОбслуживания_НЕ + "))";
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60311");
#Область П29	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20202", "Оборот за период #Период# по кредиту счета 20202 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20209", "Оборот за период #Период# по кредиту счета 20209 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20501", "Оборот за период #Период# по кредиту счета 20501 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20502", "Оборот за период #Период# по кредиту счета 20502 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "479");
	
	// ДЕБЕТОВЫЙ оборот с 479го возможен - это возврат вознаграждения назад
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "479");
	
	//? номер строки
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П27", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20202", "Оборот за период #Период# по кредиту счета 20202 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П27", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20209", "Оборот за период #Период# по кредиту счета 20209 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П27", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДобавитьСчетВТаблицуСчетов("П27", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20502", "Оборот за период #Период# по кредиту счета 20502 по Группе финансового учета денежных средств ""Выплата комиссионного вознаграждения доверительному управляющему""");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "479");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетами 47423, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.МНО);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела);
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "47423");	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетами 47422, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "47422");	
	
	
	//  #451236     Счет 47422 - убираем  услуги спецдепозитария. Учтены в строке 13 (П10)    ВидДвиженияДСНеобходимыеРасходыСпецДепозитария     
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 47422, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСНеобходимыеРасходыСпецДепозитария_НЕ + СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47422");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 в корреспонденции со счетом 47422, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47422");
	
	// счет 60322  убираем вознаграждение спецдепозитария. учтены в строке 12 (П16) ()       ВидДвиженияДСРасходыПоВознаграждениюСпецДепозитария
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 60322, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	стрОтборВирт = СтруктураПеременныхДляОтбора.ВидДвиженияДСРасходыПоВознаграждениюСпецДепозитария_НЕ + СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60322");		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20501", "Оборот за период #Период# по кредиту счета 20501 в корреспонденции со счетом 60322, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "60322");	
	 // конец #451236 
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетами 60323, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "60323");	
	
	//по кредиту. деньги в пути 
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 47423, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "47423");		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 47422, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "47422");		
		
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 60323, исключая дополнительную аналитику ""КупонНачисленный"", ""КупонПриобретенный"", ""МНО"", ""ЗадолженностьПоПогашениюКупона"", ""Дисконт"", ""Премия"", ""Задолженность по погашению тела"" или ""Переоценка тела ценной бумаги""");
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика_НЕ, "60323");		
	
	//конверсионные операции
	Если ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС Тогда
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "30602", "Оборот за период #Период# по дебету счета 30602 в корреспонденции со счетам 47408. Конверсионные операции");
		стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация))"; 		
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47408");		
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "30602", "Оборот за период #Период# по дебету счета 30602 в корреспонденции со счетам 47407. Конверсионные операции");
		стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация))"; 		
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47407");	
	КонецЕсли;
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетам 47408. Конверсионные операции");
	стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация))"; 		
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47408");		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П29", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетам 47407. Конверсионные операции");
	стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КонверсионнаяОперация))"; 		
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47407");				
	
	// курсовые разницы. Такой же запрос в разделе финансовая деятельность, другие ГФУ. 
	Результат = ВернутьКурсовыеРазницы(Запрос, ИмяРаздела);
	Для каждого СтрокаРезультат Из Результат Цикл
		ИмяЯчейки = "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки;
		ТекстРасшифровки = "Курсовая разница " + СтрокаРезультат.КорСчет.Код + ?(СтрокаРезультат.НомерКолонки = "03", " за прошлый период", "");
		УстановитьЗначениеПоказателя(ТекРаздел, ИмяЯчейки , СтрокаРезультат.Сумма);
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "", "+", ТекстРасшифровки, СтрокаРезультат.Сумма, , , , , ИмяРаздела);
	КонецЦикла;
	
#КонецОбласти	
	
//	КлючПараметровПечати = "Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ.ФормаОтчета_МСФО39_2020.ОперационнаяДеятельность";
//	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ТекРаздел, КлючПараметровПечати, , ОриентацияСтраницы.Портрет);		
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ИнвестиционнаяДеятельностьСК_2020Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П09", "Поступления от продажи финансовых активов, имеющихся в наличии для продажи", "+", "!ДО", "205", "Оборот за период #Период# по дебету счета 205 в корреспонденции со счетом 502");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "502");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П10", "Платежи в связи с приобретением финансовых активов, имеющихся в наличии для продажи", "+", "!ДО", "502", "Оборот за период #Период# по дебету счета 502 в корреспонденции со счетом 205");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "205");

	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П20", "Поступления за минусом платежей (платежи за минусом поступлений) от размещения и закрытия депозитов и прочих размещенных средств в кредитных организациях и банках-нерезидентах", "-", "!ДО", "20601", "Оборот за период #Период# по дебету счета 20601 в корреспонденции со счетом 20501");
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20501");
	//
	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П20", "Поступления за минусом платежей (платежи за минусом поступлений) от размещения и закрытия депозитов и прочих размещенных средств в кредитных организациях и банках-нерезидентах", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 20601");
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , , "20601");

	ДепозитныеВкладыДолгосрочные = ПолучитьДепозитныеВклады("Тело", "Долгосрочные");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П11", "Поступления за минусом платежей (платежи за минусом поступлений) от размещения и закрытия депозитов и прочих размещенных средств в кредитных организациях и банках-нерезидентах", "-", "!ДО", "20601", "Оборот за период #Период# по дебету счета 20601 в корреспонденции со счетом 20501");
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ДепозитныеВкладыДолгосрочные);	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладДолгосрочный;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03",,,, стрОтборВирт, "20501");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П11", "Поступления за минусом платежей (платежи за минусом поступлений) от размещения и закрытия депозитов и прочих размещенных средств в кредитных организациях и банках-нерезидентах", "+", "!ДО", "20501", "Оборот за период #Период# по дебету счета 20501 в корреспонденции со счетом 20601");
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ДепозитныеВкладыДолгосрочные);	
	стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладДолгосрочный;
	стрОтборВирт = СтрЗаменить(стрОтборВирт, "Субконто", "КорСубконто");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03",,,, стрОтборВирт, "20601");

	
	Если ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС Тогда
		Если ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьРЕПО Тогда
			
				//комиссия	
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П11", "Комиссия по сделкам РЕПО", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47019, 47407, 50905, 61210, 715 по покупке, комиссии брокера, торговой комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияРЕПО))"; 
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47019, 47407, 50905, 61210, 715");
			
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П11", "Комиссия по сделкам РЕПО", "-", "!КО", "30602", "Оборот за период #Период# по кредиту счета 30602 в корреспонденции со счетами 47422 по комиссии");
			стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияРЕПО))"; 		
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "47422");
			  //
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П11", "Поступления за минусом платежей (платежи за минусом поступлений) от размещения и закрытия депозитов и прочих размещенных средств в кредитных организациях и банках-нерезидентах", "+", "!СНД", "47010", "Сальдо на начало периода #Период# по дебету счета 47010");
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "02", "03");
		
			мТаблицаСчетов.Очистить();
			ДобавитьСчетВТаблицуСчетов("П11", "Поступления за минусом платежей (платежи за минусом поступлений) от размещения и закрытия депозитов и прочих размещенных средств в кредитных организациях и банках-нерезидентах", "-", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010");
			ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
		Иначе
			//уже учли  в разделе Операционная деятельность
		КонецЕсли;
	Иначе
		//ничего не делаем. 
	КонецЕсли;
	
	//КлючПараметровПечати = "Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ.ФормаОтчета_МСФО39_2020.ИнвестиционнаяДеятельность";
	//РаботаСОтчетами.ЗаполнитьНастройкиПечати(ТекРаздел, КлючПараметровПечати, , ОриентацияСтраницы.Портрет);		
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ФинансоваяДеятельностьСК_2020Сервер(ТекРаздел, ИмяРаздела)
		
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();

	Результат = ВернутьКурсовыеРазницы(Запрос, ИмяРаздела);

	Для каждого СтрокаРезультат Из Результат Цикл
		ИмяЯчейки = "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки;
		ТекстРасшифровки = "Курсовая разница " + СтрокаРезультат.КорСчет.Код + ?(СтрокаРезультат.НомерКолонки = "03", " за прошлый период", "");
		УстановитьЗначениеПоказателя(ТекРаздел, ИмяЯчейки , СтрокаРезультат.Сумма);
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "", "+", ТекстРасшифровки, СтрокаРезультат.Сумма, , , , , ИмяРаздела);
	КонецЦикла;
	
	
	////Курсовая разница
	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П14", "Прочие денежные потоки от операционной деятельности", "+", "!ДО", "30602", "Оборот за период #Период# по дебету счета 30602 в корреспонденции со счетам 71511");
	//стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КурсоваяРазница))"; 		
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "71511");		
	//
	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П14", "Прочие денежные потоки от операционной деятельности", "-", "!КО", "30602", "Оборот за период #Период# по дебету счета 30602 в корреспонденции со счетам 71512");
	//стрОтборВирт = "И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.КурсоваяРазница))"; 		
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "03", , , , стрОтборВирт, "71512");			
			
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДенежныеСредстваСК_2020Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мПредставлениеНачалаТекущегоПериода    = "На " + Формат(НачалоГода(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ДФ=dd.MM.yyyy");
	мПредставлениеНачалаПредыдущегоПериода = "На " + Формат(НачалоГода(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета), "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.ТекущийПериод2.Значение    = мПредставлениеНачалаТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод2.Значение = мПредставлениеНачалаПредыдущегоПериода;
	
	//Здесь не так как в других таблицах. Здесь надо оставить по старому
	ТекРаздел.Области.ТекущийПериод.Значение    = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.ПредыдущийПериод.Значение = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СНД", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СНД", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "06");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Денежные средства в пути", "+", "!СКД", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Денежные средства в пути", "+", "!СНД", "20209", "Сальдо на начало периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06");
	
	
	ПолучитьДепозитныеВкладыКраткосрочные = ПолучитьДепозитныеВклады("Тело", "Краткосрочные");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20601", "Сальдо на конец периода #Период# по дебету счета 20601 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные);
	стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладКраткосрочный;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03",,,,стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СНД", "20601", "Сальдо на начало периода #Период# по дебету счета 20601 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные);
	стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладКраткосрочный;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06",,,,стрОтборВирт);
				
	Если ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС = Неопределено ИЛИ НЕ ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС Тогда
	
		ПолучитьДепозитныеВкладыКраткосрочные = ПолучитьДепозитныеВклады("Проценты", "Краткосрочные");
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20609", "Сальдо на конец периода #Период# по дебету счета 20609 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20611", "Сальдо на конец периода #Период# по кредиту счета 20611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");		
		Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные);
		стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладКраткосрочный;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03",,,,стрОтборВирт);
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СНД", "20603", "Сальдо на начало периода #Период# по дебету счета 20603 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СНД", "20609", "Сальдо на начало периода #Период# по дебету счета 20609 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СНК", "20611", "Сальдо на начало периода #Период# по кредиту счета 20611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
		Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные);
		стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладКраткосрочный;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06",,,,стрОтборВирт);
	
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыМНОВДС = Неопределено ИЛИ НЕ ЭтаФорма.НастройкиОтчета.НеУчитыватьПроцентыМНОВДС Тогда
	
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СНД", "20603", "Сальдо на начало периода #Период# по дебету счета 20603");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СНД", "20609", "Сальдо на начало периода #Период# по дебету счета 20609");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СНК", "20611", "Сальдо на начало периода #Период# по кредиту счета 20611");
		стрОтборВирт = СтруктураПеременныхДляОтбора.МНО;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06",,,,стрОтборВирт);
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20609", "Сальдо на конец периода #Период# по дебету счета 20609");
		ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20611", "Сальдо на конец периода #Период# по кредиту счета 20611");
		стрОтборВирт = СтруктураПеременныхДляОтбора.МНО;
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03",,,,стрОтборВирт);
	
	КонецЕсли;
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СНД", "20507", "Сальдо на начало периода #Период# по дебету счета 20507");
	ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СНД", "20508", "Сальдо на начало периода #Период# по дебету счета 20508");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20507", "Сальдо на конец периода #Период# по дебету счета 20507");
	ДобавитьСчетВТаблицуСчетов("П04", "Проценты по депозитамам в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20508", "Сальдо на конец периода #Период# по дебету счета 20508");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");

	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20501", "Сальдо на конец периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20502", "Сальдо на конец периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СНД", "20501", "Сальдо на начало периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СНД", "20502", "Сальдо на начало периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочее""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СНД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочее""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "06");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П06", "Прочие денежные средства", "+", "!СКД", "20802", "Сальдо на конец периода #Период# по дебету счета 20802, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П06", "Прочие денежные средства", "+", "!СНД", "20802", "Сальдо на начало периода #Период# по дебету счета 20802, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06");
	
	Если ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС <> Неопределено И ЭтаФорма.НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС Тогда
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П06", "Прочие денежные средства", "+", "!СКД", "30602", "Сальдо на конец периода #Период# по дебету счета 30602");
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
		
		мТаблицаСчетов.Очистить();
		ДобавитьСчетВТаблицуСчетов("П06", "Прочие денежные средства", "+", "!СНД", "30602", "Сальдо на начало периода #Период# по дебету счета 30602");
		ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаНачало", ТекРаздел, "04", "06");
		
	КонецЕсли;
	
	КлючПараметровПечати = "Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ.ФормаОтчета_МСФО39_2020.ДенежныеСредстваСК_2020";
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ТекРаздел, КлючПараметровПечати, , ОриентацияСтраницы.Ландшафт);			
	
КонецПроцедуры


#КонецОбласти 

#Область ПодключаемыеПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОтчетТитульнаяСтраницаСК_2020()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОтчетТитульнаяСтраницаСК_2020"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
			
	РасчетРаздела_ОтчетТитульнаяСтраницаСК_2020(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОперационнаяДеятельностьСК_2020()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОперационнаяДеятельностьСК_2020"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ОперационнаяДеятельностьСК_2020Сервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ОперационнаяДеятельностьСК_2020(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнвестиционнаяДеятельностьСК_2020()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнвестиционнаяДеятельностьСК_2020"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ИнвестиционнаяДеятельностьСК_2020Сервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ИнвестиционнаяДеятельностьСК_2020(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ФинансоваяДеятельностьСК_2020()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ФинансоваяДеятельностьСК_2020"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ФинансоваяДеятельностьСК_2020Сервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ФинансоваяДеятельностьСК_2020(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ДенежныеСредстваСК_2020()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ДенежныеСредстваСК_2020"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ДенежныеСредстваСК_2020Сервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ДенежныеСредстваСК_2020(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры


#КонецОбласти 

#Область ПроцедурыРасчета

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРаздела, ИмяЯчейки, Ячейка)
	// #ЧисткаИтогов
	
	Если КонсолидированнаяОтчетностьКлиентСервер.ИтоговаяЯчейкаПервыйРасчет(ЭтаФорма, ИмяРаздела, ИмяЯчейки, Ячейка)
		Тогда
		КонсолидированнаяОтчетность.УдалитьРасшифровкуЯчейки(Адрес_ТаблицаРасшифровки, ИмяРаздела, ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейкуНачало

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейку(ИмяРазделаРезультат, РазделРезультат, ИмяЯчейкиРезультат, ИмяРазделаИсточник, ИмяЯчейкиИсточник, Множитель = 1, ИмяПоказателяРезультат = "", ИмяПоказателяИсточник = "", ДобавитьКРасчетномуЗначению = ЛОЖЬ)
	
	ИмяПоказателяИсточник_исх = ИмяПоказателяИсточник;
	ИмяПоказателяРезультат = ?(ИмяПоказателяРезультат = "", "Ячейка " + ИмяЯчейкиРезультат, ИмяПоказателяРезультат);
	ИмяПоказателяИсточник = ?(ИмяПоказателяИсточник = "", "Ячейка " + ИмяЯчейкиИсточник, ИмяПоказателяИсточник);
	
	// Определим ячейку-результат
	Попытка
		ЯчейкаРезультат = РазделРезультат.Области[ИмяЯчейкиРезультат];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: не найдена ячейка %2'"),
		ИмяРазделаРезультат,
		ИмяЯчейкиРезультат);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// #ЧисткаИтогов
	Если НЕ ДобавитьКРасчетномуЗначению Тогда
		ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРазделаРезультат, ИмяЯчейкиРезультат, ЯчейкаРезультат); 
	КонецЕсли;
	
	// Табличный документ-источник
	Если ТипЗнч(ИмяРазделаИсточник) = Тип("Строка") Тогда
		
		Попытка
			РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаИсточник))[0];
			ТабИсточник = РазделОтчета.ТабличныйДокумент;
		Исключение
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Расчет итогов по разделу %1: не найден раздел %2'"),
			ИмяРазделаРезультат,
			ИмяРазделаИсточник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	Иначе
		
		// Если передан табличный документ, значит заполнение идет с текущего раздела
		ТабИсточник = ИмяРазделаИсточник;
		РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаРезультат))[0];
		
	КонецЕсли;
	СтраницаИсточник = РазделОтчета;
	
	// Определим ячейку-источник
	Попытка
		ЯчейкаИсточник = ТабИсточник.Области[ИмяЯчейкиИсточник];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: в разделе %2 не найдена ячейка %3'"),
		ИмяРазделаРезультат,
		ИмяРазделаИсточник,
		ИмяЯчейкиИсточник);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// Определим значение - источник, умноженное на "Множитель"
	ЗначениеИсточник = ЯчейкаИсточник.Значение * Множитель;
	
	// Лобавим к значению в ячейке-результат новое значение
	ЯчейкаРезультат.Значение = ЯчейкаРезультат.Значение + КонсолидированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЗначениеИсточник, СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения, СтруктураРеквизитовФормы.мДелитель);
	
	// Определим какой должен быть знак (+/-) в расшифровке
	ЗнакВРасшифровке = ?(Множитель > 0, "+", "-");
	
	Если ИмяПоказателяИсточник_исх = ""
		и Множитель <> 1 и Множитель <> -1 
		Тогда
		МножительБезЗнака = ?(Множитель > 0, Множитель, -Множитель);
		ИмяПоказателяИсточник = ИмяПоказателяИсточник + " * " + МножительБезЗнака;
	КонецЕсли;
	
	// Сформируем текст расшифровки по шаблону: "Закладка ...., имя показателя"
	ТекстРасшифровки = "Закладка «" + СтраницаИсточник.Представление + "»";
	Если ЗначениеЗаполнено(ИмяПоказателяИсточник) Тогда
		ТекстРасшифровки = ТекстРасшифровки + ", " + ИмяПоказателяИсточник;
	КонецЕсли;
	
	// Заменим служебные команды по периоду
	стрИмяПоказателяРезультат = СтрЗаменить(ИмяПоказателяРезультат, "#ПериодТекущий#", СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода);
	стрИмяПоказателяРезультат = СтрЗаменить(стрИмяПоказателяРезультат, "#ПериодПредыдущий#", СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода);
	
	// Добавим в расшифровку
	ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейкиРезультат, стрИмяПоказателяРезультат, ЗнакВРасшифровке, ТекстРасшифровки, ЗначениеИсточник, , , , , ИмяРазделаРезультат);
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейку

&НаСервере
Процедура Расчет(ИмяРаздела = "")
	
	КонсолидированнаяОтчетностьКлиентСервер.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	Если ИмяРаздела = "" Тогда
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				Выполнить("РасчетРаздела_" + ТекСтрока.ИмяРаздела + "(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела)");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
			Выполнить("РасчетРаздела_" + ИмяРаздела + "(ТекРаздел, ИмяРаздела)");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ КонсолидированнаяОтчетностьКлиентСервер.НуженПересчетОсновногоРаздела("ТабличныйДокумент" + ИмяРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет основного раздела
	Очистить(ИмяОсновногоРаздела);
	ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяОсновногоРаздела);
	Выполнить("РасчетРаздела_" + ИмяОсновногоРаздела + "(ТекРаздел, ИмяРаздела)");
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОперационнаяДеятельностьСК_2020(ТекРаздел, ИмяРаздела)
			
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		Для НомСтр = 1 по 29 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П30" + СтрНомКол, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, );	
		КонецЦикла;	
	КонецЦикла;
			
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		КонсолидированнаяОтчетность.ОчиститьОбластьТабличногоДокумента(ТекРаздел, 1, 30, 3, 3);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ИнвестиционнаяДеятельностьСК_2020(ТекРаздел, ИмяРаздела)
	
	//Оставим на потом

	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		Для НомСтр = 1 по 14 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, );	
		КонецЦикла;	
	КонецЦикла;
			
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		КонсолидированнаяОтчетность.ОчиститьОбластьТабличногоДокумента(ТекРаздел, 1, 15, 3, 3);	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ФинансоваяДеятельностьСК_2020(ТекРаздел, ИмяРаздела)
		
	//ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0102", "ДенежныеСредстваСК_2020", "П0805", 1, , , ИСТИНА);
	//ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0103", "ДенежныеСредстваСК_2020", "П0807", 1, , , ИСТИНА);
	// аналога строки 4.1 нет
	
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		
		//Если Не СтруктураРеквизитовФормы.НКО Тогда
		//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		//КонецЕсли;
				
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, );

		
	КонецЦикла;
		
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		КонсолидированнаяОтчетность.ОчиститьОбластьТабличногоДокумента(ТекРаздел, 1, 14, 3, 3);
		
	КонецЕсли;
	
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ДенежныеСредстваСК_2020(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0104", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0102", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0106", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0103", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0204", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0202", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0206", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0203", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0304", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0302", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0306", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0303", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0404", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0402", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0406", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0403", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0504", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0502", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0506", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0503", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П0604", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П0602", );

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0607", ТекРаздел, "П0606", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0607", ТекРаздел, "П0603", );
	
	Для НомКол = 2 По 7 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		
	КонецЦикла;	
		
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		
		КонсолидированнаяОтчетность.ОчиститьОбластьТабличногоДокумента(ТекРаздел, 1, 7, 3, 3);	
		КонсолидированнаяОтчетность.ОчиститьОбластьТабличногоДокумента(ТекРаздел, 1, 7, 6, 7);
			
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ОтчетТитульнаяСтраницаСК_2020(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области["ТекущийПериод1"].Значение = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);    	
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
	Если НЕ СведенияОбОрганизации = Неопределено Тогда
	
		ТекРаздел.Области["Организация"].Значение = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
			СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
			СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
		ТекРаздел.Области["ПочтовыйАдресОрганизации"].Значение = СведенияОбОрганизации.ЮридическийАдрес;
	
	КонецЕсли;	
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5902", "ФинансоваяДеятельностьСК_2020", "П1402", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5903", "ФинансоваяДеятельностьСК_2020", "П1403", );	
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6002", "ДенежныеСредстваСК_2020", "П0704", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6003", "ДенежныеСредстваСК_2020", "П0706", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6102", "ДенежныеСредстваСК_2020", "П0702", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6103", "ДенежныеСредстваСК_2020", "П0703", );
	
	//запоолнение из разделов
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		НомСтрРаздел = 1;
		Для НомСтр = 1 по 29 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН="); СтрНомСтрРаздел = Формат(НомСтрРаздел,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, "ОперационнаяДеятельностьСК_2020", "П" + СтрНомСтрРаздел + СтрНомКол, );
			НомСтрРаздел = НомСтрРаздел + 1;
		КонецЦикла;	
		
		НомСтрРаздел = 1;
		Для НомСтр = 31 по 44 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН="); СтрНомСтрРаздел = Формат(НомСтрРаздел,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, "ИнвестиционнаяДеятельностьСК_2020", "П" + СтрНомСтрРаздел + СтрНомКол, );			
			НомСтрРаздел = НомСтрРаздел + 1;
		КонецЦикла;	
		
		НомСтрРаздел = 1;
		Для НомСтр = 46 по 56 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН="); СтрНомСтрРаздел = Формат(НомСтрРаздел,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, "ФинансоваяДеятельностьСК_2020", "П" + СтрНомСтрРаздел + СтрНомКол, );			
			НомСтрРаздел = НомСтрРаздел + 1;
		КонецЦикла;	
	КонецЦикла;
	
	//итоги. 
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		Для НомСтр = 1 по 29 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П30" + СтрНомКол, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, );	
		КонецЦикла;	
	
		Для НомСтр = 31 по 44 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П45" + СтрНомКол, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, );	
		КонецЦикла;	
		
		Для НомСтр = 46 по 56 Цикл 
			СтрНомСтр = Формат(НомСтр,"ЧЦ=2; ЧВН=");
			ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П" + СтрНомСтр + СтрНомКол, );	
		КонецЦикла;	
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П58" + СтрНомКол, ТекРаздел, "П57" + СтрНомКол, );
	КонецЦикла
	
	//
	//Для НомКол = 2 По 3 Цикл
	//	
	//	СтрНомКол = ?(НомКол < 10, "0" + НомКол, "" + НомКол);
	//	
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, );
	//	
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, );
	//	
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, );
	//	
	//	Если Не СтруктураРеквизитовФормы.НКО Тогда
	//		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, );
	//		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, );
	//		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, );
	//	КонецЕсли;
	//	
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П39" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, );
	//		
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, );
	//	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, );
	//	
	//КонецЦикла;
	//
	//КлючПараметровПечати = "Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ.ФормаОтчета_МСФО39_2020.ТитульнаяСтраница";
	//РаботаСОтчетами.ЗаполнитьНастройкиПечати(ТекРаздел, КлючПараметровПечати, , ОриентацияСтраницы.Ландшафт);			
	
КонецПроцедуры 


#КонецОбласти 

#КонецОбласти 

#Область НастройкиОтчета

&НаКлиенте
Процедура ОткрытьФормуНастроекЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЕдиницаИзмерения 			= ДополнительныеПараметры.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= ДополнительныеПараметры.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= ДополнительныеПараметры.ВалютаДокумента;
	ИсходныйПодписант 			= ДополнительныеПараметры.Подписант;
	ОтчетНаКонецПрошлогоГода	= ДополнительныеПараметры.ОтчетНаКонецПрошлогоГода;
	
	Если ЕдиницаИзмерения <> СтруктураРеквизитовФормы.ЕдиницаИзмерения Тогда
		
		ЕдиницаИзмеренияПриИзменении();
		Модифицированность = Истина;
			
	КонецЕсли;
	
	Если ТочностьЕдиницыИзмерения <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		
		ТочностьЕдиницыИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ВалютаДокумента <> СтруктураРеквизитовФормы.ВалютаДокумента Тогда
		
		ВалютаДокументаПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ИсходныйПодписант <> ЭтаФорма.Подписант Тогда
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ОтчетНаКонецПрошлогоГода <> СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода Тогда
		
		ЗаполнитьАвто();
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	Модифицированность = Истина;
	
	СтруктураОтбора = Новый Структура("ИмяРаздела", СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета.НайтиСтроки(СтруктураОтбора)[0].ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВывода()

	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении()
	
	ТекстСообщения = НСтр("ru = 'Изменена валюта представления отчетности.
	|Перезаполнить документ?'");
	
	ПоказатьВопрос(
	Новый ОписаниеОповещения(
	"ВалютаДокументаПриИзмененииЗавершение",
	ЭтотОбъект),
	ТекстСообщения,
	РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвто();
	КонецЕсли;
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в рублях точность не может превышать 2 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в тысячах рублей точность не может превышать 3 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в миллионах рублей точность не может превышать 6 знаков'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьТочность()
	
#КонецОбласти 

#Область ЗаписьОтчета

&НаКлиенте
Процедура СохранитьНаКлиенте(ВыполняемоеОповещение=Неопределено) Экспорт

	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		ИмяСобытия = "ЗаписьРегламентированногоОтчета";
	Иначе
		ИмяСобытия = "ЗаписьНовогоРегламентированногоОтчета";
	КонецЕсли; 
	
	ЗаполнитьПоказатели();
	ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
	
		Модифицированность = Ложь;
	
		ИсторияРаботыПользователя.Добавить(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок);
		
		Оповестить(ИмяСобытия, Новый Структура("Ключ", СтруктураРеквизитовФормы.мСохраненныйДок));
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	КонсолидированнаяОтчетность.ЗаписатьОтчет(ЭтаФорма);

КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьПоказатели()

	ЭтаФорма.Показатели.Очистить();
		
	Для Каждого ТекСтрока Из РазделыОтчета Цикл
		
		Попытка
			ОбластиРаздела = ТекСтрока.ТабличныйДокумент.Области;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого ТекОбласть Из ОбластиРаздела Цикл
			
			Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Если Не ТекОбласть.СодержитЗначение Тогда
					Продолжить;
				КонецЕсли;
			Исключение
				ТекстСообщения = "Ошибка макета: раздел " + ТекСтрока.ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(ТекОбласть.Значение) Тогда
			
				Продолжить;
			
			КонецЕсли; 
			
			НоваяСтрока = ЭтаФорма.Показатели.Добавить();
			НоваяСтрока.ИмяРаздела 		= ТекСтрока.ИмяРаздела;
			НоваяСтрока.ИмяПоказателя 	= ТекОбласть.Имя;
			НоваяСтрока.Значение 		= ТекОбласть.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтаФорма.Показатели.Сортировать("ИмяРаздела, ИмяПоказателя");
	
КонецПроцедуры

#КонецОбласти 

#Область Расшифровка

&НаКлиенте
Процедура РасшифровкаНажатиеВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Адрес_Расшифровка 	= ДополнительныеПараметры.Адрес_Расшифровка;
	ИмяРаздела 			= ДополнительныеПараметры.ИмяРаздела;
	
	ИмяЯчейки = "";
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатиеЗавершение(Знач Адрес_Расшифровка, Знач ИмяРаздела, ИмяЯчейки)
	
	СтруктураПараметров = Новый Структура(
	"Адрес_Расшифровка,
	|Адрес_СтруктураВариантыЗаполнения,
	|ОсобыйАлгоритмРасшифровки",
	Адрес_Расшифровка,
	Адрес_мСтруктураВариантыЗаполнения,
	Истина);
	
	ТабДок = КонсолидированнаяОтчетность.СформироватьМакетРасшифровки(ИмяРаздела, ИмяЯчейки, СтруктураПараметров);
	
	ВывестиРасшифровкуСервер(ТабДок, ИмяЯчейки);
	
	Элементы.ГруппаРасшифровки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Новый Структура("ИмяЯчейки, Раздел", ИмяЯчейки, ИмяРаздела));
	
	ЕстьРасшифровка = (Не НайденныеСтроки.Количество() = 0);
		
	СтруктураОтбора = Новый Структура("Раздел, ИмяЯчейки", ИмяРаздела, ИмяЯчейки);
	пТаблицаРасшифровки = ТаблицаРасшифровки.Скопировать(СтруктураОтбора);
	
	Если пТаблицаРасшифровки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Адрес_Расшифровка = ПоместитьВоВременноеХранилище(пТаблицаРасшифровки, УникальныйИдентификатор);
	
	Возврат ЕстьРасшифровка;
	
КонецФункции

&НаСервере
Процедура ВывестиРасшифровкуСервер(ТабДок, ИмяСтраницы)
	
	КоличествоРасшифровок = КоличествоРасшифровок + 1;
	НомерСтраницы = Формат(КоличествоРасшифровок, "ЧГ=0");
	ИмяСтраницы = ?(ИмяСтраницы = "", "Расшифровка № " + КоличествоРасшифровок, ИмяСтраницы);
	
	ИмяЭлемента = "СтраницаРасшифровки" + НомерСтраницы;
	ТекСтраница = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Элементы.СтраницыРасшифровки);
	ТекСтраница.Заголовок = ИмяСтраницы;
	
	ИмяЭлемента = "ТабДок_Расшифровка" + НомерСтраницы;
	
	МассивДобавляемых = Новый Массив;
	МассивДобавляемых.Добавить(Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов("ТабличныйДокумент")));
	ИзменитьРеквизиты(МассивДобавляемых);
	
	ТекЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ТекСтраница);
	ТекЭлемент.ПутьКДанным = ИмяЭлемента;
	ТекЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ТекЭлемент.ГоризонтальнаяПолосаПрокрутки = Ложь;
	
	ЭтотОбъект[ИмяЭлемента] = ТабДок;
	
	Элементы.СтраницыРасшифровки.ТекущаяСтраница = ТекСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьРасшифровкуСервер()
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекРасшифровка = Элементы.СтраницыРасшифровки.ТекущаяСтраница;
	СтраницыРасшифровки = Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы;
	
	Если ТекРасшифровка = Неопределено Тогда
		ТекРасшифровка = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
	КонецЕсли;
	
	ТекРасшифровка.Видимость = Ложь;
	
	МассивУдаляемых = Новый Массив;
	МассивУдаляемых.Добавить(ТекРасшифровка.ПодчиненныеЭлементы[0].ПутьКДанным);
	ИзменитьРеквизиты( , МассивУдаляемых);
	
	Элементы.Удалить(ТекРасшифровка);
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		
	ИначеЕсли Элементы.СтраницыРасшифровки.ТекущаяСтраница = Неопределено Тогда
		
		Элементы.СтраницыРасшифровки.ТекущаяСтраница = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьНажатие(Команда)
	
	ЗаполнитьАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	ЗаполнитьАвто(ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНажатие(Команда)
	
	Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Очистить(ИмяРаздела);
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		
		Очистить(ИмяОсновногоРаздела);
		Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо сохранить документ.");
		Возврат;
	
	КонецЕсли; 
	
	ИмяФайла = "Отчет о потоках ДС " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD");
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогСохраненияФайла.Фильтр             = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок          = "Укажите файл";
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.СохранитьРегламентированныйОтчетВExcel(ЭтаФорма, ДиалогСохраненияФайла.ПолноеИмяФайла, ЭтаФорма.СохраняемыеРазделы);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНаКлиенте();
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	                           
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", 					СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", 			СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения", 	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	ПараметрыФормы.Вставить("ОтчетНаКонецПрошлогоГода", 	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	ПараметрыФормы.Вставить("Подписант", 					ЭтаФорма.Подписант);
	ПараметрыФормы.Вставить("ИсточникОтчета",				СтруктураНаименованийОтчета.ИсточникОтчета);
	ПараметрыФормы.Вставить("ВыбраннаяФорма",				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	
	ФормаНастройкиОтчета = ПолучитьФорму("Отчет." + СтруктураНаименованийОтчета.ИсточникОтчета + ".Форма.НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ЕдиницаИзмерения 			= СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= СтруктураРеквизитовФормы.ВалютаДокумента;
	Подписант 					= ЭтаФорма.Подписант;
	ОтчетНаКонецПрошлогоГода = СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода;
	
	ДополнительныеПараметры = Новый Структура("ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, ОтчетНаКонецПрошлогоГода, Подписант", ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, ОтчетНаКонецПрошлогоГода, Подписант);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуНастроекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСкрытьПоказать(Команда)
	
	Элементы.ГруппаРасшифровки.Видимость = Не Элементы.ГруппаРасшифровки.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатие(Команда)
	
	ИмяРаздела = ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	Если ИмяРаздела = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИмяЯчейки = ЭтаФорма.ТабличныйДокумент.ТекущаяОбласть.Имя;
	Исключение
		Возврат;
	КонецПопытки;
	
	Адрес_Расшифровка = "";
	
	// Считываем и помещаем данные на сервере
	РасшифровкаНайдена = РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка);
	
	Если РасшифровкаНайдена = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Расшифровка не сформирована.
		|Расшифровка формируется при нажатии на кнопку ""Заполнить"".'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	Если НЕ РасшифровкаНайдена Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка для выбранной ячейки не существует.'"));
		
		Возврат;
		
		ТекстСообщения = НСтр("ru = 'Расшифровка для выбранной ячейки не существует.
		|Показать расшифровку для всех ячеек раздела?");
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РасшифровкаНажатиеВопросЗавершение",
		ЭтотОбъект,
		Новый Структура(
		"Адрес_Расшифровка,
		|ИмяРаздела",
		Адрес_Расшифровка,
		ИмяРаздела)),
		ТекстСообщения,
		РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьРасшифровкуНажатие(Команда)
	
	ЗакрытьРасшифровкуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.СтатусОтчета = "Корректировка" Тогда
		Элементы.НомерКорректировки.Видимость = Истина;
		ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
		ЭтаФорма.НомерКорректировки = ПолучитьНомерКорректировки(ЭтаФорма.СтруктураРеквизитовФормы, ИсточникОтчета);
	Иначе
		Элементы.НомерКорректировки.Видимость = Ложь;
		ЭтаФорма.НомерКорректировки = 0;
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерКорректировки(СтруктураРеквизитовФормы, ИсточникОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕстьNULL(МАКСИМУМ(РегламентированныйОтчет.НомерКорректировки), 0) КАК НомерКорректировки
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Организация = &Организация
		|	И РегламентированныйОтчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
		|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
		|	И РегламентированныйОтчет.ВалютаДокумента = &ВалютаДокумента
		|	И РегламентированныйОтчет.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И РегламентированныйОтчет.ТочностьЕдиницыИзмерения = &ТочностьЕдиницыИзмерения
		|	И РегламентированныйОтчет.ОтчетНаКонецПрошлогоГода = &ОтчетНаКонецПрошлогоГода
		|	И РегламентированныйОтчет.ОтчетЗаПоследнийКвартал = &ОтчетЗаПоследнийКвартал
		|	И РегламентированныйОтчет.ВыбраннаяФорма = &ВыбраннаяФорма
		|	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
		|	И РегламентированныйОтчет.СтатусОтчета = &СтатусОтчета";
	
	Запрос.УстановитьПараметр("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВыбраннаяФорма", 				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", 					НачалоДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", 				СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ИсточникОтчета", 				ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", 					СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ОтчетЗаПоследнийКвартал", 		Ложь);
	Запрос.УстановитьПараметр("ОтчетНаКонецПрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	Запрос.УстановитьПараметр("СтатусОтчета", 					"Корректировка");
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТочностьЕдиницыИзмерения", 		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерКорректировки = 0;
	Если Выборка.Следующий() Тогда
		НомерКорректировки = Выборка.НомерКорректировки;
	КонецЕсли;
	Возврат НомерКорректировки + 1;		
		
КонецФункции

&НаКлиенте
Процедура НомерКорректировкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.СохранитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		СохранитьВариантНастроекНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетОПотокахДенежныхСредствНПФ", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		ЗагрузитьВариантНастроекНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиВарианта(Команда)
	
	ДанныеВарианта = ОткрытьФормуМодально("ОбщаяФорма.ФормаНастройкиСохраняемыхРазделов",
							Новый Структура("СохраняемыеРазделы", ЭтаФорма.СохраняемыеРазделы));
	
	Если ДанныеВарианта = Неопределено ИЛИ ДанныеВарианта = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.СохраняемыеРазделы			= ДанныеВарианта.СохраняемыеРазделы;
	
КонецПроцедуры

#КонецОбласти 


