Функция РедактированиеЗапрещено() Экспорт
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПрограммноеОбновление") Тогда
	
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ИнвестиционныеДекларацииПоказатели.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ _ДекларацииПоБазису
			|ИЗ
			|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
			|ГДЕ
			|	ИнвестиционныеДекларацииПоказатели.Базис = &Базис
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДекларацииПоБазису.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ _ДекларацииВсе
			|ИЗ
			|	_ДекларацииПоБазису КАК _ДекларацииПоБазису
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИнвестиционныеДекларацииПоказатели.Ссылка
			|ИЗ
			|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДекларацииПоБазису КАК _ДекларацииПоБазису
			|		ПО ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация = _ДекларацииПоБазису.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	_ДекларацииВсе.Ссылка КАК Ссылка
			|ИЗ
			|	_ДекларацииВсе КАК _ДекларацииВсе
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
			|		ПО _ДекларацииВсе.Ссылка = НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
			|		ПО (НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка = ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации)
			|			И (ИнвестиционныеДекларации.Активность)";
		
		Запрос.УстановитьПараметр("Базис", ЭтотОбъект.Ссылка);
		
		РедактированиеЗапрещено = Не Запрос.Выполнить().Пустой();
		
	Иначе
		
		РедактированиеЗапрещено = Ложь;
		
	КонецЕсли;
	
	Возврат РедактированиеЗапрещено;

КонецФункции

Процедура ПередЗаписью(Отказ)
	
	ЭтотОбъект.ИдентификаторСКД = Новый УникальныйИдентификатор;
	Если Не ЭтотОбъект.Ссылка.Пустая() И РедактированиеЗапрещено() Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ВерсияПередЗаписью", ПолучитьВерсиюОбъекта());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РазличияВерсийОбъекта = УниверсальныеМеханизмы.ПолучитьРазличияВерсийОбъекта(ЭтотОбъект);
		
	Если Не РазличияВерсийОбъекта = Неопределено Тогда
			
		ЕстьОшибки = Ложь;
		
		Для каждого ЭлементСтруктуры Из РазличияВерсийОбъекта Цикл
		
			Если ЭлементСтруктуры.Значение.Количество() > 0 Тогда
			    ЕстьОшибки = Истина;
				Прервать;		
			КонецЕсли; 
		
		КонецЦикла; 
		
		Если ЕстьОшибки Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В инвестиционных декларациях, назначенных клиентам, имеются ссылки на текущий базис", ЭтотОбъект, , , Отказ);
		
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьВерсиюОбъекта() Экспорт

	ВерсияОбъекта = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БазисыКонтроляИнвестиционныхДеклараций.ПометкаУдаления КАК ПометкаУдаления,
		|	БазисыКонтроляИнвестиционныхДеклараций.НаборДанных КАК НаборДанных,
		|	БазисыКонтроляИнвестиционныхДеклараций.ХранилищеНастроек КАК ХранилищеНастроек,
		|	БазисыКонтроляИнвестиционныхДеклараций.ХранилищеСКД КАК ХранилищеСКД
		|ИЗ
		|	Справочник.БазисыКонтроляИнвестиционныхДеклараций КАК БазисыКонтроляИнвестиционныхДеклараций
		|ГДЕ
		|	БазисыКонтроляИнвестиционныхДеклараций.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выгрузить();
	Реквизиты.Колонки.Добавить("Настройки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	// на первом этапе изменение СКД не контролируем для отладки
	//Реквизиты.Колонки.Добавить("СКД", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	
	Настройки = Реквизиты[0].ХранилищеНастроек.Получить();
	НастройкиХМЛ = "";
	СКД = "";
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Настройки, "Settings", "http://v8.1c.ru/8.1/data-composition-system/settings");
		
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
		ХешированиеДанных.Добавить(ЗаписьXML.Закрыть());
		
		НастройкиХМЛ = ХешированиеДанных.ХешСумма;
		
		//ЗаписьXML = Новый ЗаписьXML;
		//ЗаписьXML.УстановитьСтроку();
		//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Настройки, "DataCompositionSchema", "http://v8.1c.ru/8.1/data-composition-system/schema");
		//
		//ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
		//ХешированиеДанных.Добавить(ЗаписьXML.Закрыть());
		//
		//СКД = ХешированиеДанных.ХешСумма;
		
	КонецЕсли;
	
	//Реквизиты[0].СКД = СКД;
	Реквизиты.Колонки.Удалить("ХранилищеСКД");
		
	Реквизиты[0].Настройки = НастройкиХМЛ;
	Реквизиты.Колонки.Удалить("ХранилищеНастроек");
	
	ВерсияОбъекта.Вставить("Реквизиты", Реквизиты);
	
	Возврат ВерсияОбъекта;

КонецФункции
 
