
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("Клиент", ЭтаФорма.Клиент);
	ЭтаФорма.Параметры.Свойство("Партия", ЭтаФорма.Партия);
	ЭтаФорма.Параметры.Свойство("СтрокаПартии", ЭтаФорма.СтрокаПартии);
	Если ЭтаФорма.Параметры.Свойство("Отбор") И Объект.Ссылка = Справочники.ДенежныеПотокиПоОблигациям.ПустаяСсылка() Тогда
		Объект.Владелец = ЭтаФорма.Параметры.Отбор.Владелец;
		ЭтаФорма.Параметры.Свойство("Дата", Объект.ДатаРасчетаПотока);
	КонецЕсли;
	
	Если ЭтаФорма.Клиент <> Справочники.ЮрФизЛица.ПустаяСсылка()
		И Объект.Владелец <> Справочники.Облигации.ПустаяСсылка()
		И Объект.ДатаРасчетаПотока <> '00010101' Тогда
	
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	
	КонецЕсли;
	
	Если Объект.Ссылка = Справочники.ДенежныеПотокиПоОблигациям.ПустаяСсылка()
		И Объект.Наименование = "" Тогда
	
		Объект.Наименование = Формат(Объект.ДатаРасчетаПотока, "ДФ=dd.MM.yyyy") + ": " + СокрЛП(Объект.Владелец);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВозможныхУчетныхАктивовЕПС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Клиент = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ)
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределенияАктивовЕПС.УчетныйАктивЕПС
		|ИЗ
		|	РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУ КАК _СчетаДУ
		|		ПО (ВЫРАЗИТЬ(РаспределенияАктивовЕПС.Сделка КАК Документ.Сделка).СчетДоверительногоУправления = _СчетаДУ.СчетДоверительногоУправления)
		|			И (РаспределенияАктивовЕПС.Организация = &Организация
		|				И РаспределенияАктивовЕПС.ЦеннаяБумага = &ЦеннаяБумага)";
	
	Запрос.УстановитьПараметр("Клиент", ЭтаФорма.Клиент);
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	Запрос.УстановитьПараметр("Период", Объект.ДатаРасчетаПотока);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.Владелец);
	
	СписокВозможныхУчетныхАктивовЕПС.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйАктивЕПС"));
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		СписокВозможныхУчетныхАктивовЕПС.Добавить(БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(Объект.ДатаРасчетаПотока, Перечисления.РынкиЦенныхБумаг.Облигации, Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Знач УчитыватьРешенияКлиентовПоПотокам, ВернутьРасшифровкуРасчета = Ложь)
	
	Объект.Поток.Очистить();
	
	Отказ				= Ложь;
	РасшифровкаРасчета	= Неопределено;
	
	Если ВернутьРасшифровкуРасчета Тогда
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("Операции", Новый Массив);
	КонецЕсли;
	
	Если ЭтаФорма.Партия <> Неопределено Тогда // если задана партия - нужно передавать т.к. по одной партии могут быть одни решения, а по другой - другие
		УчитыватьРешенияКлиентовПоПотокам = Новый Структура("УчитыватьРешенияКлиентовПоПотокам, Партия, СтрокаПартии", УчитыватьРешенияКлиентовПоПотокам, ЭтаФорма.Партия, ЭтаФорма.СтрокаПартии);
	КонецЕсли;
	
	ДенежныйПоток = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
		ПараметрыСеанса.ТекущаяОрганизация, ЭтаФорма.Клиент, Объект.Владелец, Объект.ДатаРасчетаПотока, УчитыватьРешенияКлиентовПоПотокам, УчетныйАктивЕПС, Отказ, СтруктураРасшифровки);
	
	Если Не Отказ Тогда
		ДенежныйПоток.Колонки.ДатаПотока.Имя = "Дата";
		ДенежныйПоток.Колонки.СуммаПотока.Имя = "Сумма";
			
		Объект.Поток.Загрузить(ДенежныйПоток);
	КонецЕсли;
	
	Если ВернутьРасшифровкуРасчета Тогда
		
		#Область Формирование_расшифровки_расчета
		
		Если СтруктураРасшифровки.Операции.Количество() = 0 Тогда
			Возврат РасшифровкаРасчета;
		КонецЕсли;	
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(СтрШаблон("Будущие денежные потоки '%1'", Объект.Владелец), , , РасшифровкаРасчета);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(СтруктураРасшифровки, ПараметрыВывода);
		
		#КонецОбласти
		
	КонецЕсли;	
	
	Возврат РасшифровкаРасчета;
	
КонецФункции

&НаКлиенте
Процедура КомандаЗаполнитьПотоки(Команда)

	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 1 Тогда
		УчетныйАктивЕПС = СписокВозможныхУчетныхАктивовЕПС[0].Значение;
	Иначе
		ВыбранныйЭлемент = СписокВозможныхУчетныхАктивовЕПС.ВыбратьЭлемент("Выберите учетный актив");
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		УчетныйАктивЕПС = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПотокиБезПрофсуждений(Команда)
	
	ОтветНаВопрос				= Вопрос("Вывести расшифровку расчета будущих денежных потоков?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	ВывестиРасшифровкуРасчета	= (ОтветНаВопрос = КодВозвратаДиалога.Да);
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 1 Тогда
		УчетныйАктивЕПС = СписокВозможныхУчетныхАктивовЕПС[0].Значение;
	Иначе
		ВыбранныйЭлемент = СписокВозможныхУчетныхАктивовЕПС.ВыбратьЭлемент("Выберите учетный актив");
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		УчетныйАктивЕПС = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	РасшифровкаРасчета = ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Ложь, ВывестиРасшифровкуРасчета);
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаРасчета.Показать(СтрШаблон("Расчет потоков '%1'", Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СверитьСПотокамиБезПрофсужденийНаСервере()
	
	Отказ = Ложь;
	
	ПотокиРасчетные = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
		ПараметрыСеанса.ТекущаяОрганизация, ЭтаФорма.Клиент, Объект.Владелец, Объект.ДатаРасчетаПотока, Ложь, , Отказ);
	
	ПотокиРасчетные.Колонки.ДатаПотока.Имя = "Дата";
	ПотокиРасчетные.Колонки.СуммаПотока.Имя = "Сумма";

		
	Если Отказ Тогда
		Возврат "Не удалось получить денежные потоки";
	КонецЕсли;
	
	ПотокиДокумента = Объект.Потоки.Выгрузить();
	
	// Сверка однородных данных
	
	ОписаниеНабора = Новый Структура;
	ОписаниеНабора.Вставить("КлючевыеПоля",			"Дата");
	ОписаниеНабора.Вставить("Ресурсы",				"Сумма");
	ОписаниеНабора.Вставить("ДанныеВнешнейСистемы",	ПотокиРасчетные);
	ОписаниеНабора.Вставить("ДанныеУчетнойСистемы",	ПотокиДокумента);

	НаборыДанных = Новый Массив;
	НаборыДанных.Добавить(ОписаниеНабора);
			
	Заголовки = Новый Структура;
	Заголовки.Вставить("Дата",  "Дата");
	Заголовки.Вставить("Сумма", "Сумма");

	ДанныеДляСверки = Новый Структура;
	ДанныеДляСверки.Вставить("ЗаголовокОтчета",				"Сверка с потоками без профсуждений");
	ДанныеДляСверки.Вставить("ПредставлениеУчетнойСистемы",	"Данные документа");
	ДанныеДляСверки.Вставить("ПредставлениеВнешнейСистемы",	"Расчетные данные");
	ДанныеДляСверки.Вставить("ПараметрыОтчета",				Новый Структура);
	ДанныеДляСверки.Вставить("НаборыДанных",				НаборыДанных);
	ДанныеДляСверки.Вставить("Заголовки",					Заголовки);
	
	ОтчетОРасхождениях	= Новый ТабличныйДокумент;
	ЕстьРасхождения		= Ложь;
	
	РаботаСОтчетами.ЗаполнитьОтчетОРасхожденияхНаборовДанных(ДанныеДляСверки, ОтчетОРасхождениях, ЕстьРасхождения);
	
	Возврат ?(ЕстьРасхождения, ОтчетОРасхождениях, "Потоки совпадают!");
	
КонецФункции

&НаКлиенте
Процедура КомандаСверитьСПотокамиБезПрофсуждений(Команда)
	
	Расхождения = СверитьСПотокамиБезПрофсужденийНаСервере();
	
	Если ТипЗнч(Расхождения) = Тип("Строка") Тогда
		Предупреждение(Расхождения);
	ИначеЕсли Расхождения <> Неопределено Тогда
		Расхождения.Показать(СтрШаблон("Расхождения потоков '%1'", Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьЭСПпоПотоку(Команда)
	
	ОтчетРасчетЭСП = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОтчетРасчетЭСП");
	ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ОтчетРасчетЭСП);
	
	ФормаОтчета = ПолучитьФорму("ВнешняяОбработка." + ИмяПодключенногоОбъекта + ".Форма", );
	
	ФормаОтчета.Дата = НачалоДня(Объект.ДатаРасчетаПотока);
	ФормаОтчета.Цена = 1000;

	ФормаОтчета.ДенежныйПоток.Очистить();
	
	Для каждого СтрокаПотока Из Объект.Поток Цикл
	
		СтрокаПотокаНаФорме = ФормаОтчета.ДенежныйПоток.Добавить();
		СтрокаПотокаНаФорме.Дата = СтрокаПотока.Дата;
		СтрокаПотокаНаФорме.Поток = СтрокаПотока.Сумма;
	
	КонецЦикла;

	ФормаОтчета.РасчетИзДокументаРегистрации();
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьПотокиРасчетомСУчетомИзмененияКСНаСервере()
	
	Объект.Поток.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумаг.Период КАК Период,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал
		|ПОМЕСТИТЬ _Номиналы
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|ГДЕ
		|	НоминалыЦенныхБумаг.ЦеннаяБумага = &Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.НомерКупона КАК НомерКупона,
		|	КупонныйДоходПоОблигациям.Период КАК Период,
		|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
		|	КупонныйДоходПоОблигациям.ДатаФиксации КАК ДатаФиксации,
		|	КупонныйДоходПоОблигациям.ДатаПубликации КАК ДатаПубликации,
		|	КупонныйДоходПоОблигациям.ФормулаРасчетаСтавки КАК ФормулаРасчетаСтавки,
		|	КупонныйДоходПоОблигациям.ВалютаОплаты КАК ВалютаОплаты,
		|	КупонныйДоходПоОблигациям.Срок КАК Срок,
		|	КупонныйДоходПоОблигациям.СтавкаКупона КАК СтавкаКупона
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона >= &ДатаОкончанияКупона
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерКупона";
	
	Запрос.УстановитьПараметр("Облигация", Объект.Владелец);
	Запрос.УстановитьПараметр("ДатаОкончанияКупона", Объект.ДатаРасчетаПотока);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрокаПотока = Объект.Поток.Добавить();
		НоваяСтрокаПотока.Дата = ВыборкаДетальныеЗаписи.ДатаОкончанияКупона;
		НоваяСтрокаПотока.Сумма = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(Объект.Владелец, ВыборкаДетальныеЗаписи.ДатаОкончанияКупона, Справочники.СчетаДоверительногоУправления.ПустаяСсылка(), , 2, Неопределено, Истина);
		НоваяСтрокаПотока.Купон = Истина;
		
	КонецЦикла;
	
	_Номиналы = Запрос.МенеджерВременныхТаблиц.Таблицы["_Номиналы"].ПолучитьДанные().Выгрузить();
	_Номиналы.Сортировать("Период Возр");
	
	ПоследнийНоминал = 0;
	ИзменениеНоминала = 0;
	
	Для Каждого _Номинал Из _Номиналы Цикл
		
		Если ПоследнийНоминал = 0 Тогда
			ПоследнийНоминал = _Номинал.Номинал;	
		Иначе	
			ИзменениеНоминала = ПоследнийНоминал - _Номинал.Номинал; 
			ПоследнийНоминал = _Номинал.Номинал;	
		КонецЕсли;	
		
		Если _Номинал.Период >= Объект.ДатаРасчетаПотока И ИзменениеНоминала > 0 Тогда
			
			НоваяСтрокаПотока = Объект.Поток.Добавить();
			НоваяСтрокаПотока.Дата = ВыборкаДетальныеЗаписи.ДатаОкончанияКупона;
			НоваяСтрокаПотока.Сумма = ИзменениеНоминала;
			НоваяСтрокаПотока.Купон = Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ПоследнийНоминал > 0 Тогда
		
		НоваяСтрокаПотока = Объект.Поток.Добавить();
		НоваяСтрокаПотока.Дата = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОкончанияКупона), ВыборкаДетальныеЗаписи.ДатаОкончанияКупона, Объект.Владелец.ДатаПогашения);
		НоваяСтрокаПотока.Сумма = ПоследнийНоминал;
		НоваяСтрокаПотока.Купон = Ложь;
		
	КонецЕсли;
	
	Объект.Поток.Сортировать("Дата Возр, Купон Убыв");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаЗаполнитьПотокиРасчетомСУчетомИзмененияКС(Команда)
	
	ОтветНаВопрос = КодВозвратаДиалога.Да;
	
	Если Объект.Поток.Количество() > 0 Тогда
	
		ОтветНаВопрос = Ждать ВопросАсинх("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
			
	КонецЕсли;		
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		КомандаЗаполнитьПотокиРасчетомСУчетомИзмененияКСНаСервере();
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОблигацию(Команда)
	
	КлючВыбора = Новый Структура("Ключ", Объект.Владелец);
	ОткрытьФорму("Справочник.Облигации.ФормаОбъекта", КлючВыбора);	
	
КонецПроцедуры
