
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("Дата", ЭтаФорма.Дата);
	ЭтаФорма.Параметры.Свойство("Клиент", ЭтаФорма.Клиент);
	ЭтаФорма.Параметры.Свойство("Партия", ЭтаФорма.Партия);
	ЭтаФорма.Параметры.Свойство("СтрокаПартии", ЭтаФорма.СтрокаПартии);
	Если ЭтаФорма.Параметры.Свойство("Отбор") И Объект.Ссылка = Справочники.ДенежныеПотокиПоОблигациям.ПустаяСсылка() Тогда
		Объект.Владелец = ЭтаФорма.Параметры.Отбор.Владелец;
	КонецЕсли;
	
	Если ЭтаФорма.Клиент <> Справочники.ЮрФизЛица.ПустаяСсылка()
		И Объект.Владелец <> Справочники.Облигации.ПустаяСсылка()
		И ЭтаФорма.Дата <> '00010101' Тогда
	
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	
	КонецЕсли;
	
	Если Объект.Ссылка = Справочники.ДенежныеПотокиПоОблигациям.ПустаяСсылка()
		И Объект.Наименование = "" Тогда
	
		Объект.Наименование = Формат(ЭтаФорма.Дата, "ДФ=dd.MM.yyyy") + ": " + СокрЛП(Объект.Владелец);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВозможныхУчетныхАктивовЕПС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Клиент = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ)
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределенияАктивовЕПС.УчетныйАктивЕПС
		|ИЗ
		|	РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУ КАК _СчетаДУ
		|		ПО (ВЫРАЗИТЬ(РаспределенияАктивовЕПС.Сделка КАК Документ.Сделка).СчетДоверительногоУправления = _СчетаДУ.СчетДоверительногоУправления)
		|			И (РаспределенияАктивовЕПС.Организация = &Организация
		|				И РаспределенияАктивовЕПС.ЦеннаяБумага = &ЦеннаяБумага)";
	
	Запрос.УстановитьПараметр("Клиент", ЭтаФорма.Клиент);
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	Запрос.УстановитьПараметр("Период", ЭтаФорма.Дата);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.Владелец);
	
	СписокВозможныхУчетныхАктивовЕПС.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйАктивЕПС"));
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		СписокВозможныхУчетныхАктивовЕПС.Добавить(БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ЭтаФорма.Дата, Перечисления.РынкиЦенныхБумаг.Облигации, Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Знач УчитыватьРешенияКлиентовПоПотокам, ВернутьРасшифровкуРасчета = Ложь)
	
	Объект.Поток.Очистить();
	
	Отказ				= Ложь;
	РасшифровкаРасчета	= Неопределено;
	
	Если ВернутьРасшифровкуРасчета Тогда
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("Операции", Новый Массив);
	КонецЕсли;
	
	Если ЭтаФорма.Партия <> Неопределено Тогда // если задана партия - нужно передавать т.к. по одной партии могут быть одни решения, а по другой - другие
		УчитыватьРешенияКлиентовПоПотокам = Новый Структура("УчитыватьРешенияКлиентовПоПотокам, Партия, СтрокаПартии", УчитыватьРешенияКлиентовПоПотокам, ЭтаФорма.Партия, ЭтаФорма.СтрокаПартии);
	КонецЕсли;
	
	ДенежныйПоток = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
		ПараметрыСеанса.ТекущаяОрганизация, ЭтаФорма.Клиент, Объект.Владелец, ЭтаФорма.Дата, УчитыватьРешенияКлиентовПоПотокам, УчетныйАктивЕПС, Отказ, СтруктураРасшифровки);
	
	Если Не Отказ Тогда
		ДенежныйПоток.Колонки.ДатаПотока.Имя = "Дата";
		ДенежныйПоток.Колонки.СуммаПотока.Имя = "Сумма";
			
		Объект.Поток.Загрузить(ДенежныйПоток);
	КонецЕсли;
	
	Если ВернутьРасшифровкуРасчета Тогда
		
		#Область Формирование_расшифровки_расчета
		
		Если СтруктураРасшифровки.Операции.Количество() = 0 Тогда
			Возврат РасшифровкаРасчета;
		КонецЕсли;	
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(СтрШаблон("Будущие денежные потоки '%1'", Объект.Владелец), , , РасшифровкаРасчета);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(СтруктураРасшифровки, ПараметрыВывода);
		
		#КонецОбласти
		
	КонецЕсли;	
	
	Возврат РасшифровкаРасчета;
	
КонецФункции

&НаКлиенте
Процедура КомандаЗаполнитьПотоки(Команда)

	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 1 Тогда
		УчетныйАктивЕПС = СписокВозможныхУчетныхАктивовЕПС[0].Значение;
	Иначе
		ВыбранныйЭлемент = СписокВозможныхУчетныхАктивовЕПС.ВыбратьЭлемент("Выберите учетный актив");
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		УчетныйАктивЕПС = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПотокиБезПрофсуждений(Команда)
	
	ОтветНаВопрос				= Вопрос("Вывести расшифровку расчета будущих денежных потоков?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	ВывестиРасшифровкуРасчета	= (ОтветНаВопрос = КодВозвратаДиалога.Да);
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 1 Тогда
		УчетныйАктивЕПС = СписокВозможныхУчетныхАктивовЕПС[0].Значение;
	Иначе
		ВыбранныйЭлемент = СписокВозможныхУчетныхАктивовЕПС.ВыбратьЭлемент("Выберите учетный актив");
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		УчетныйАктивЕПС = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	РасшифровкаРасчета = ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Ложь, ВывестиРасшифровкуРасчета);
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаРасчета.Показать(СтрШаблон("Расчет потоков '%1'", Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СверитьСПотокамиБезПрофсужденийНаСервере()
	
	Отказ = Ложь;
	
	ПотокиРасчетные = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
		ПараметрыСеанса.ТекущаяОрганизация, ЭтаФорма.Клиент, Объект.Владелец, ЭтаФорма.Дата, Ложь, , Отказ);
	
	ПотокиРасчетные.Колонки.ДатаПотока.Имя = "Дата";
	ПотокиРасчетные.Колонки.СуммаПотока.Имя = "Сумма";

		
	Если Отказ Тогда
		Возврат "Не удалось получить денежные потоки";
	КонецЕсли;
	
	ПотокиДокумента = Объект.Потоки.Выгрузить();
	
	// Сверка однородных данных
	
	ОписаниеНабора = Новый Структура;
	ОписаниеНабора.Вставить("КлючевыеПоля",			"Дата");
	ОписаниеНабора.Вставить("Ресурсы",				"Сумма");
	ОписаниеНабора.Вставить("ДанныеВнешнейСистемы",	ПотокиРасчетные);
	ОписаниеНабора.Вставить("ДанныеУчетнойСистемы",	ПотокиДокумента);

	НаборыДанных = Новый Массив;
	НаборыДанных.Добавить(ОписаниеНабора);
			
	Заголовки = Новый Структура;
	Заголовки.Вставить("Дата",  "Дата");
	Заголовки.Вставить("Сумма", "Сумма");

	ДанныеДляСверки = Новый Структура;
	ДанныеДляСверки.Вставить("ЗаголовокОтчета",				"Сверка с потоками без профсуждений");
	ДанныеДляСверки.Вставить("ПредставлениеУчетнойСистемы",	"Данные документа");
	ДанныеДляСверки.Вставить("ПредставлениеВнешнейСистемы",	"Расчетные данные");
	ДанныеДляСверки.Вставить("ПараметрыОтчета",				Новый Структура);
	ДанныеДляСверки.Вставить("НаборыДанных",				НаборыДанных);
	ДанныеДляСверки.Вставить("Заголовки",					Заголовки);
	
	ОтчетОРасхождениях	= Новый ТабличныйДокумент;
	ЕстьРасхождения		= Ложь;
	
	РаботаСОтчетами.ЗаполнитьОтчетОРасхожденияхНаборовДанных(ДанныеДляСверки, ОтчетОРасхождениях, ЕстьРасхождения);
	
	Возврат ?(ЕстьРасхождения, ОтчетОРасхождениях, "Потоки совпадают!");
	
КонецФункции

&НаКлиенте
Процедура КомандаСверитьСПотокамиБезПрофсуждений(Команда)
	
	Расхождения = СверитьСПотокамиБезПрофсужденийНаСервере();
	
	Если ТипЗнч(Расхождения) = Тип("Строка") Тогда
		Предупреждение(Расхождения);
	ИначеЕсли Расхождения <> Неопределено Тогда
		Расхождения.Показать(СтрШаблон("Расхождения потоков '%1'", Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьЭСПпоПотоку(Команда)
	
	ОтчетРасчетЭСП = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОтчетРасчетЭСП");
	ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ОтчетРасчетЭСП);
	
	ФормаОтчета = ПолучитьФорму("ВнешняяОбработка." + ИмяПодключенногоОбъекта + ".Форма", );
	
	ФормаОтчета.Дата = НачалоДня(ЭтаФорма.Дата);
	ФормаОтчета.Цена = 1000;

	ФормаОтчета.ДенежныйПоток.Очистить();
	
	Для каждого СтрокаПотока Из Объект.Поток Цикл
	
		СтрокаПотокаНаФорме = ФормаОтчета.ДенежныйПоток.Добавить();
		СтрокаПотокаНаФорме.Дата = СтрокаПотока.Дата;
		СтрокаПотокаНаФорме.Поток = СтрокаПотока.Сумма;
	
	КонецЦикла;

	ФормаОтчета.РасчетИзДокументаРегистрации();
	
КонецПроцедуры
