
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
		Сообщить("Перед печатью документ необходимо записать.");
	КонецЕсли;
	
	Если ПереданСписокМНОПоРазнымСчетамДУ(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("МассивДокументов", ПараметрКоманды);
	
	ОткрытьФорму("Обработка.ПечатьМНО.Форма.ФормаПечатьУведомленияОНамерении",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	
КонецПроцедуры

&НаСервере
Функция ПереданСписокМНОПоРазнымСчетамДУ(МассивДокументов)
	
	Запрос = Новый Запрос;
	
#Область Текст_Запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	Документ.МНО КАК МНО
		|ГДЕ
		|	МНО.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Распоряжение.СчетДоверительногоУправления
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|ГДЕ
		|	Распоряжение.Ссылка В(&МассивДокументов)
		|	И Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)";
#КонецОбласти
		
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Если Запрос.Выполнить().Выгрузить().Количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование уведомлений МНО возможно в рамках только одного счета ДУ."); 
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
