
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Блокирующие проверки
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не Запись.Действует И ЗначениеЗаполнено(Запись.ПроцентнаяСтавка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процентная ставка недействующей записи должна быть очищена.", Запись, "ПроцентнаяСтавка", "Запись", Отказ);
		КонецЕсли;
		
		Если Запись.НачалоРасчетногоМесяца <> НачалоМесяца(Запись.НачалоРасчетногоМесяца) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало расчётного месяца должно быть первым днём месяца!", Запись, "НачалоРасчетногоМесяца", "Запись", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверка возможности записи
	
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
КонецПроцедуры
