
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	// Заполняем только на основании заявок на приобретение паев	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		ЭтотОбъект.Основание	= ДанныеЗаполнения;
		ЭтотОбъект.Дата 		= ТекущаяДата();
		
		РеквизитыОснования		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Пайщик");
		ЭтотОбъект.Организация	= РеквизитыОснования.Организация;
		ЭтотОбъект.Пайщик		= РеквизитыОснования.Пайщик;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, ИмяГруппыИсполнителей)
		
	ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект(ИмяГруппыИсполнителей), ЭтотОбъект.Организация);
		
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		
		Задача.ГруппаИсполнителей = ГруппаИсполнителей;
		Задача.Основание 		  = ЭтотОбъект.Основание;
		Задача.Организация		  = ЭтотОбъект.Организация;
		
		//Если Задача.ТочкаМаршрута = БизнесПроцессы.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев.ТочкиМаршрута.ФормированиеЗаявкиПайщика Тогда
		//	
		//	Задача.ТекстЗадачи = "";
		//	
		//	// Проверяем наличие заявки - тогда задачу выполняем автоматически
		//	Если ТипЗнч(Задача.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") И ЗначениеЗаполнено(Задача.Основание) Тогда
		//		Задача.ДополнительныеСвойства.Вставить("АвтоматическоеВыполнениеЗадачи", Истина);
		//	КонецЕсли;
			
		Если Задача.ТочкаМаршрута = БизнесПроцессы.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев.ТочкиМаршрута.ПроверкаСканаПаспорта Тогда
			
			Задача.ТекстЗадачи = СтрШаблон("Проверить скан паспорта пайщика %1. Если проверка пройдена, при выполнении задачи установить флажок %2",
				ЭтотОбъект.Пайщик, "'Скан паспорта пайщика проверен'");
				
		ИначеЕсли Задача.ТочкаМаршрута = БизнесПроцессы.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев.ТочкиМаршрута.УточнениеВопросовПоПроверкеСканаПаспорта Тогда
			
			Задача.ТекстЗадачи = СтрШаблон("Уточнить вопросы по проверке скана паспорта пайщика %1", ЭтотОбъект.Пайщик);
			
		КонецЕсли;
				
	КонецЦикла;
	
				
КонецПроцедуры

Процедура ЭтоНовыйКлиентПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	// Если у пайщика отсутствуют анкетные данные, это новый клиент	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &Пайщик
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Пайщик",			ЭтотОбъект.Пайщик);
	Запрос.УстановитьПараметр("Дата",			ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить().Пустой();
	
КонецПроцедуры

Процедура ПроверкаСканаПаспортаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "КлиентскийОтдел");
	
КонецПроцедуры

Процедура ПроверкаСканаПаспортаПройденаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
    Результат = ЭтотОбъект.СканПаспортаПайщикаПроверен;	
	
КонецПроцедуры

Процедура ПроверкаСканаПаспортаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ЭтотОбъект.СканПаспортаПайщикаПроверен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "СканПаспортаПайщикаПроверен");
	
	Если ЭтотОбъект.СканПаспортаПайщикаПроверен Тогда
		
		РегистрыСведений.СтатусыЗаявокНаПриобретениеПаев.УстановитьСтатусЗаявкиНаПриобретениеПаев(
									ЭтотОбъект.Организация,
									ЭтотОбъект.Основание,
									Перечисления.СтатусыЗаявокПайщиков.Принята,
									ТекущаяДатаСеанса(),
									Отказ);
									
	КонецЕсли;
								
КонецПроцедуры  

Процедура УточнениеВопросовПоПроверкеСканаПаспортаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "КлиентскийОтдел");
	
КонецПроцедуры

Процедура ОтправкаПакетаЗаявкиВДКПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Выгрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"),
		Задача);
	
КонецПроцедуры

Процедура ОтправкаВЛККСтатусаЗаявкаПринятаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаПакетаЗаявкиВДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ТребуетсяОткрытиеЛицевогоСчетаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ОткрытьЗакрытьДепозитарныйСчет");
	
КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Загрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"),
		Задача);

КонецПроцедуры

Процедура ОтправкаВЛККСтатусаЗаявкаПринятаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
	
	ОбменСЛКК.Организация = ЭтотОбъект.Организация;
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбменСЛКК.УстановитьСтатус(ЭтотОбъект.Основание, "in_process", Отказ);
	
КонецПроцедуры

Процедура ОтправкаУведомленияОбОткрытииСчетаВЛККПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаУведомленияОбОткрытииСчетаВЛККПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	// Ищем файлы (нужны pdf и sig)
	ПрикрепленныеФайлы = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(ЭтотОбъект.Основание);
	
	Если ПрикрепленныеФайлы.Количество() = 0 Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
		
	ОбменСЛКК.Организация = ЭтотОбъект.Организация;
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	
	ЕстьФайлы = Ложь;
	Для Каждого ПрикрепленныйФайл Из ПрикрепленныеФайлы Цикл
			
		Если СтрНачинаетсяС(ПрикрепленныйФайл.Наименование, "Уведомление об открытии лицевого счета")
			И (ПрикрепленныйФайл.Расширение = "pdf"
				Или ПрикрепленныйФайл.Расширение = "sig") Тогда
			ФайлУведомления = РаботаСФайловымХранилищем.ПолучитьФайл(ПрикрепленныйФайл.ИдентификаторФайла);
			ОбменСЛКК.ВыгрузитьФайлы(ЭтотОбъект.Основание,
						ФайлУведомления.Адрес,
						ПрикрепленныйФайл.Наименование + "." + ПрикрепленныйФайл.Расширение,
						ПрикрепленныйФайл.Наименование,
						Отказ);
			ЕстьФайлы = Истина;			
		КонецЕсли;
		
		Если Отказ Тогда
			//##Зарегистрировать ошибку
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьФайлы Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

