
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	// Заполняем только на основании заявок на приобретение паев	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		ЭтотОбъект.Основание	= ДанныеЗаполнения;
		ЭтотОбъект.Дата 		= ТекущаяДата();
		
		РеквизитыОснования		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Пайщик");
		ЭтотОбъект.Организация	= РеквизитыОснования.Организация;
		ЭтотОбъект.Пайщик		= РеквизитыОснования.Пайщик;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, ИмяГруппыИсполнителей)
		
	ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект(ИмяГруппыИсполнителей), ЭтотОбъект.Организация);
		
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		
		Задача.ГруппаИсполнителей = ГруппаИсполнителей;
		Задача.Основание 		  = ЭтотОбъект.Основание;
		Задача.Организация		  = ЭтотОбъект.Организация;
		    					
	КонецЦикла;
					
КонецПроцедуры

Процедура ЭтоНовыйКлиентПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	// Если у пайщика отсутствуют анкетные данные, это новый клиент	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &Пайщик
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Пайщик",			ЭтотОбъект.Пайщик);
	Запрос.УстановитьПараметр("Дата",			ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить().Пустой();
	
КонецПроцедуры
                                          
Процедура ОтправкаПакетаЗаявкиВДКПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Выгрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"),
		Задача);
	
КонецПроцедуры

Процедура ОтправкаВЛККСтатусаЗаявкиВРаботеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаПакетаЗаявкиВДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ТребуетсяОткрытиеЛицевогоСчетаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ОткрытьЗакрытьДепозитарныйСчет");
	
КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Загрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"),
		Задача);
		
		Если Не Отказ Тогда
			РегистрыСведений.СтатусыЗаявокПайщиков.УстановитьСтатусЗаявки(
				ЭтотОбъект.Организация,
				ЭтотОбъект.Основание,
				Перечисления.СтатусыЗаявокПайщиков.Исполнена,
				ТекущаяДатаСеанса(),
				Отказ);
		КонецЕсли;
			
КонецПроцедуры

Процедура ОтправкаВЛККСтатусаЗаявкиВРаботеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	РегистрыСведений.СтатусыЗаявокПайщиков.УстановитьСтатусЗаявки(
			ЭтотОбъект.Организация,
			ЭтотОбъект.Основание,
			Перечисления.СтатусыЗаявокПайщиков.ВРаботе,
			ТекущаяДатаСеанса(),
			Отказ);
			
	Если Не Отказ Тогда	
	
		ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
		
		ОбменСЛКК.Организация = ЭтотОбъект.Организация;
		
		ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
		ОбменСЛКК.УстановитьСтатус(ЭтотОбъект.Основание, "in_process", Отказ);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОтправкаУведомленияОбОткрытииСчетаВЛККПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаУведомленияОбОткрытииСчетаВЛККПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	// Ищем файлы (нужны pdf и sig)
	ПрикрепленныеФайлы = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(ЭтотОбъект.Основание);
	
	Если ПрикрепленныеФайлы.Количество() = 0 Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// Изменяем статус заявки у нас и в ЛКК
	РегистрыСведений.СтатусыЗаявокПайщиков.УстановитьСтатусЗаявки(
				ЭтотОбъект.Организация,
				ЭтотОбъект.Основание,
				Перечисления.СтатусыЗаявокПайщиков.Исполнена,
				ТекущаяДатаСеанса(),
				Отказ);
				
	Если Отказ Тогда
		//##Зарегистрировать ошибку
		Возврат;
	КонецЕсли;
		
	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
		
	ОбменСЛКК.Организация = ЭтотОбъект.Организация;
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
		
	ОбменСЛКК.УстановитьСтатус(ЭтотОбъект.Основание, "done", Отказ);
	
	Если Отказ Тогда
		//##Зарегистрировать ошибку
		Возврат;
	КонецЕсли;
	
	ЕстьФайлы = Ложь;
	Для Каждого ПрикрепленныйФайл Из ПрикрепленныеФайлы Цикл
			
		Если СтрНачинаетсяС(ПрикрепленныйФайл.Наименование, "Уведомление об открытии лицевого счета")
			И (ПрикрепленныйФайл.Расширение = "pdf"
				Или ПрикрепленныйФайл.Расширение = "sig") Тогда
			ФайлУведомления = РаботаСФайловымХранилищем.ПолучитьФайл(ПрикрепленныйФайл.ИдентификаторФайла);
			ОбменСЛКК.ВыгрузитьФайлы(ЭтотОбъект.Основание,
						ФайлУведомления.Адрес,
						ПрикрепленныйФайл.Наименование + "." + ПрикрепленныйФайл.Расширение,
						ПрикрепленныйФайл.Наименование,
						Отказ);
			ЕстьФайлы = Истина;			
		КонецЕсли;
		
		Если Отказ Тогда
			//##Зарегистрировать ошибку
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьФайлы Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭкспортЗаявкиВПервуюФормуКоллЦентраМКБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЭкспортСтатусаЗаявкиВПервуюФормуКоллЦентраМКБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");	
	
КонецПроцедуры

Процедура ЭкспортЗаявкиВПервуюФормуКоллЦентраМКБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ОбработкаЭкспорта = Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Создать();
		
	ОбработкаЭкспорта.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбработкаЭкспорта.ЭкспортироватьДанныеЗаявки(ЭтотОбъект.Ссылка, Отказ);

КонецПроцедуры 

Процедура ЭкспортСтатусаЗаявкиВПервуюФормуКоллЦентраМКБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ) 
	
	ОбработкаЭкспорта = Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Создать(); 
		
	ОбработкаЭкспорта.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбработкаЭкспорта.ЭкспортироватьДанныеЗаявки(ЭтотОбъект.Ссылка, Отказ);

КонецПроцедуры

