
Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для Каждого Запись из ЭтотОбъект Цикл 
		Если НЕ (Запись.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии ИЛИ Запись.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоТорговойКомиссии)
			И  ЗначениеЗаполнено(Запись.АналитикаРЕПО) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("параметр Анатилика для сделок РЕПО не имеет смысла для данного вида задолженности",,,,Отказ);
		КонецЕсли;	
	КонецЦикла;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью

