
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.СчетДоверительногоУправления = ЭтаФорма.Параметры.СчетДоверительногоУправления;
	ЭтаФорма.СчетаКлиента = ЭтаФорма.Параметры.СчетаКлиента;
	
	ЭтаФорма.ДатаЗначения = ЭтаФорма.Параметры.ДатаЗначения;
	
	ЭтаФорма.Элементы.ЗначениеНастройки.ОграничениеТипа = ЭтаФорма.Параметры.ТипЗначения;
	ЭтаФорма.ЗначениеНастройки = ЭтаФорма.Параметры.ЗначениеНастройки;
	
	ЭтаФорма.Заголовок = ЭтаФорма.Параметры.ПредставлениеНастройки;
	
	ЭтаФорма.Элементы.СчетаКлиента.Видимость = (ЭтаФорма.СчетаКлиента.Количество() > 0);
	
	// #538027 Хардкод. Одно перечисление ПериодичностьПереоценкиАктивов используется и для Переоценки активов и для резервов. 
	// Но для резервов необходим выбор только нескольких значений 
	Если ЭтаФорма.Параметры.ПредставлениеНастройки = "Периодичность начисления резервов ОКУ" Тогда
		ЭтаФорма.Элементы.ЗначениеНастройки.РежимВыбораИзСписка = Истина;
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.ПериодичностьПереоценкиАктивов.Ежемесячно);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.ПериодичностьПереоценкиАктивов.Ежеквартально);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.ПериодичностьПереоценкиАктивов.Ежегодно);
	// #545971 Перечисление МетодыПризнанияРасходовПоСделкам будет использоваться в разных настроках, в которых будут различаться варианты выбора одна с пунктами РЕПО а вторая без РЕПО	
	ИначеЕсли СтрЧислоВхождений(ЭтаФорма.Параметры.ПредставлениеНастройки, "Метод признания расходов по сделкам РЕПО")  Тогда
		ЭтаФорма.Элементы.ЗначениеНастройки.РежимВыбораИзСписка = Истина;
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОплате);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриЗакрытииРЕПО);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичности);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичностиСОтражениемНаСчетеРасчетов);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОткрытииРЕПО);
	ИначеЕсли СтрЧислоВхождений(ЭтаФорма.Параметры.ПредставлениеНастройки, "Метод признания расходов по биржевым депозитам")  Тогда
		ЭтаФорма.Элементы.ЗначениеНастройки.РежимВыбораИзСписка = Истина;
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОткрытии);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОплате);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении);
		ЭтаФорма.Элементы.ЗначениеНастройки.СписокВыбора.Добавить(Перечисления.МетодыПризнанияРасходовПоСделкам.ПриЗакрытии);
	// #545971 Перечисление МетодыПризнанияРасходовПоСделкам будет использоваться в разных настроках, в которых будут различаться варианты выбора одна с пунктами РЕПО а вторая без РЕПО	
	ИначеЕсли ЭтаФорма.Параметры.ПредставлениеНастройки = "Основания для перерасчета резервов"  Тогда
		ЭтаФорма.Элементы.ЗначениеНастройки.КнопкаВыбора = Истина;
		ВидыОперацийОснованийДляРасчетаРезервов = РегистрыСведений.НастройкиУчетаОбщие.ВидыОперацийОснованийДляРасчетаРезервов();
		Для каждого ВидОперации Из ВидыОперацийОснованийДляРасчетаРезервов Цикл
			ВидОперации.Пометка = (СтрНайти(ЭтаФорма.ЗначениеНастройки, ВидОперации.Представление) > 0); 
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Этаформа.Закрыть(Новый Структура("ДатаЗначения,ЗначениеНастройки,СчетаКлиента", ЭтаФорма.ДатаЗначения, ЭтаФорма.ЗначениеНастройки, ЭтаФорма.СчетаКлиента));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	Для каждого СчетКлиента Из ЭтаФорма.СчетаКлиента Цикл
		СчетКлиента.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	Для каждого СчетКлиента Из ЭтаФорма.СчетаКлиента Цикл
		СчетКлиента.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ВидыОперацийОснованийДляРасчетаРезервов.Количество() > 0 Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Если ВидыОперацийОснованийДляРасчетаРезервов.ОтметитьЭлементы("Выберите варианты") Тогда
			ЗначениеНастройки = "";
			Для каждого ВидОперации Из ВидыОперацийОснованийДляРасчетаРезервов Цикл
				Если ВидОперации.Пометка Тогда
					ЗначениеНастройки = ЗначениеНастройки + ВидОперации.Представление + ", ";
				КонецЕсли;
			КонецЦикла;
			Если СтрДлина(ЗначениеНастройки) <> 0 Тогда
				ЗначениеНастройки = Лев(ЗначениеНастройки, СтрДлина(ЗначениеНастройки) - 2);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
