
#Область Экспортные_функции

&НаСервере
Функция СформироватьДокументыСЭД(Организация, СчетДоверительногоУправления, Период, КаталогФайлов, ОтветственноеЛицо, ПредставлениеРубля = "RUR") Экспорт
	
	// Общий комментарий
	// 
	// По брокеру ГПБ нужно выгружать отдельный файл по каждому счету, указанному в исполнителях
	// 
	// По брокеру БК нужно выгружать только один файл, в котором остатки по секциям объединены в общие ячейки через разделитель $
	// 
	
	// получим наборы полей, попадающие в отчет
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("ПоляОтчетаБрокера");
	
	ГруппыПолейОтчетаБрокера = Новый Структура("Шапка, Сделка, Подвал", Новый Массив, Новый Массив, Новый Массив);
	
	ТекущаяГруппаПолей = "";
	
	Для НомСтр = 1 По Макет.ВысотаТаблицы Цикл
		Если Не ПустаяСтрока(Макет.Область(НомСтр, 1).Текст) Тогда
			ТекущаяГруппаПолей = Макет.Область(НомСтр, 1).Текст;
		КонецЕсли;
		ГруппыПолейОтчетаБрокера[ТекущаяГруппаПолей].Добавить(Макет.Область(НомСтр, 2).Текст);
	КонецЦикла;
	
	// даже если сделка не задана, часть данных всё равно нужно заполнять
	ЗначенияПолейПустойСделки = ПолучитьЗначенияПолейПустойСделки(СчетДоверительногоУправления, Организация, Период, ПредставлениеРубля);

	СтрокаПустаяСделка = "";
	
	Для каждого Поле Из ГруппыПолейОтчетаБрокера.Сделка Цикл
		СтрокаПустаяСделка = СтрокаПустаяСделка + СериализоватьЗнчПоля(ЗначенияПолейПустойСделки[Поле], Поле) + ";";
	КонецЦикла;
	
	// отдельный файл на каждого брокера
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.Брокер КАК Брокер,
		|	Валюты.Ссылка КАК Валюта,
		|	ИменованныеОбъекты.Имя КАК ИмяБрокера
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
		|		ПО ИсполнителиПоДенежнымСредствамБрокерские.Брокер = ИменованныеОбъекты.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
		|		ПО (ВЫБОР
		|				КОГДА ИменованныеОбъекты.Имя = ""Брокер_БК_Регион""
		|					ТОГДА Валюты.Код = ""643""
		|				ИНАЧЕ ИсполнителиПоДенежнымСредствамБрокерские.РасчетныйСчет.Валюта = Валюты.Ссылка
		|			КОНЕЦ)
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия >= &Период
		|			ИЛИ ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       Период);
	
	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВыгружатьВОдинФайл 	= Ложь;
	ФайлОткрыт 			= Ложь;
	ТекущийБрокер 		= "";
	
	CSVФайлЗапись = Неопределено;
	
	ЭтоПерваяСтрока = Истина;
	
	Пока Выборка.Следующий() Цикл
		ТекстОтчета = "";
		
		Если ТекущийБрокер = "" Тогда
			ТекущийБрокер = Выборка.ИмяБрокера;
		КонецЕсли;
		
		Если Выборка.ИмяБрокера <> ТекущийБрокер Тогда
			
			Если ВыгружатьВОдинФайл Тогда
				CSVФайлЗапись.Закрыть();    
				ВыгружатьВОдинФайл 	= Ложь;
				ФайлОткрыт 			= Ложь;
			КонецЕсли;
	
			ТекущийБрокер = Выборка.ИмяБрокера;
			
		КонецЕсли;
		
		ВыгружатьВОдинФайл = ?(ТекущийБрокер = "Брокер_БК_Регион", Истина, Ложь);
		
		// сделки                                                      
		ДанныеПоСделкам = ПолучитьДанныеСделок(Организация, СчетДоверительногоУправления, Выборка.Брокер, ?(ТекущийБрокер = "Брокер_БК_Регион", Неопределено, Выборка.Валюта), Период);
		
		ВалютаПервойСделки = ?(ДанныеПоСделкам.Количество() > 0, ДанныеПоСделкам[0].ВалютаСуммы, Неопределено);
		
		// шапка
		ТаблицаДанныхШапки = ПолучитьДанныеШапки(Организация, СчетДоверительногоУправления, Выборка.Брокер, ?(ТекущийБрокер = "Брокер_БК_Регион", Неопределено, Выборка.Валюта), Период, ОтветственноеЛицо, ВалютаПервойСделки);
		
		КоличествоСтрокШапки = ТаблицаДанныхШапки.Количество();
		Если КоличествоСтрокШапки = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СчетДоверительногоУправления + " нет договора с брокером " + Выборка.Брокер + "! Вероятно, в документе неправильно выбран брокер.");
			Продолжить;
 		КонецЕсли;
				
		КопияТаблицаДанныхШапки = ТаблицаДанныхШапки.Скопировать();
		ТаблицаСводныхДвиженийИВалют = ТаблицаДанныхШапки.Скопировать(,"МестоХранения, Приход, Расход, ВалютаДСЗачисление");
		ТаблицаСводныхДвиженийИВалют.Свернуть("МестоХранения, Приход, Расход, ВалютаДСЗачисление");
		
		// Удалим строки без валюты
		СтрокиКУдалению = Новый Массив;
		Для Каждого ТекСтрока Из ТаблицаСводныхДвиженийИВалют Цикл
			Если Не ЗначениеЗаполнено(ТекСтрока.ВалютаДСЗачисление) Тогда
				СтрокиКУдалению.Добавить(ТекСтрока);
			КонецЕсли;				
		КонецЦикла;
		
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			ТаблицаСводныхДвиженийИВалют.Удалить(СтрокаКУдалению)
		КонецЦикла;
		
		Если ТаблицаСводныхДвиженийИВалют.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаСводныхДвиженийИВалют.Добавить();
			НоваяСтрока.Приход 				= "0.00";
			НоваяСтрока.Расход				= "0.00";
			НоваяСтрока.ВалютаДСЗачисление 	= "RUR";			
		КонецЕсли;
		
		СтруктураЗаменыДвижений = Новый Структура("Приход, Расход", "0.00", "0.00");
		Если КоличествоСтрокШапки > 1 Тогда
			
			// Нужно свернуть колонки c остатками и валютами остатков в строки с разделителем $
			МассивОстатковНаНачало	= ТаблицаДанныхШапки.ВыгрузитьКолонку("ВходящийОстаток");
			МассивОстатковНаКонец	= ТаблицаДанныхШапки.ВыгрузитьКолонку("ИсходящийОстаток");
			МассивПриходов			= ТаблицаСводныхДвиженийИВалют.ВыгрузитьКолонку("Приход");
			МассивРасходов			= ТаблицаСводныхДвиженийИВалют.ВыгрузитьКолонку("Расход");
			МассивВалютОстатков		= ТаблицаДанныхШапки.ВыгрузитьКолонку("ВалютаОстатка");
			МассивВалютДвижений		= ТаблицаСводныхДвиженийИВалют.ВыгрузитьКолонку("ВалютаДСЗачисление");
						
			СериализоватьДанныеВМассиве(МассивОстатковНаНачало, "ВходящийОстаток");
			СериализоватьДанныеВМассиве(МассивОстатковНаКонец, 	"ИсходящийОстаток");
			СериализоватьДанныеВМассиве(МассивПриходов,		 	"Приход");
			СериализоватьДанныеВМассиве(МассивРасходов,		 	"Расход");
			СериализоватьДанныеВМассиве(МассивВалютОстатков,	"ВалютаОстатка");
			СериализоватьДанныеВМассиве(МассивВалютДвижений,	"ВалютаДвижения");
						
			КопияТаблицаДанныхШапки.Колонки.Удалить("ВходящийОстаток");
			КопияТаблицаДанныхШапки.Колонки.Удалить("ИсходящийОстаток");
			КопияТаблицаДанныхШапки.Колонки.Удалить("Приход");
			КопияТаблицаДанныхШапки.Колонки.Удалить("Расход");
			КопияТаблицаДанныхШапки.Колонки.Удалить("ВалютаОстатка");
			КопияТаблицаДанныхШапки.Колонки.Удалить("ВалютаДСЗачисление");
			КопияТаблицаДанныхШапки.Колонки.Удалить("ВалютаДССписание");
						
			КопияТаблицаДанныхШапки.Колонки.Добавить("ВходящийОстаток",		Новый ОписаниеТипов("Строка"));
			КопияТаблицаДанныхШапки.Колонки.Добавить("ИсходящийОстаток", 	Новый ОписаниеТипов("Строка"));
			КопияТаблицаДанныхШапки.Колонки.Добавить("Приход", 				Новый ОписаниеТипов("Строка"));
			КопияТаблицаДанныхШапки.Колонки.Добавить("Расход", 				Новый ОписаниеТипов("Строка"));
			КопияТаблицаДанныхШапки.Колонки.Добавить("ВалютаОстатка", 		Новый ОписаниеТипов("Строка"));
			КопияТаблицаДанныхШапки.Колонки.Добавить("ВалютаДСЗачисление",	Новый ОписаниеТипов("Строка"));
			КопияТаблицаДанныхШапки.Колонки.Добавить("ВалютаДССписание",	Новый ОписаниеТипов("Строка"));
						
			КопияТаблицаДанныхШапки[0].ВходящийОстаток		= СтрСоединить(МассивОстатковНаНачало, "$");			
			КопияТаблицаДанныхШапки[0].ИсходящийОстаток		= СтрСоединить(МассивОстатковНаКонец, "$");
			КопияТаблицаДанныхШапки[0].Приход				= СтрСоединить(МассивПриходов, "$");
			КопияТаблицаДанныхШапки[0].Расход				= СтрСоединить(МассивРасходов, "$");
			КопияТаблицаДанныхШапки[0].ВалютаОстатка		= СтрСоединить(МассивВалютОстатков, "$"); 
			КопияТаблицаДанныхШапки[0].ВалютаДСЗачисление	= СтрСоединить(МассивВалютДвижений, "$"); 
			КопияТаблицаДанныхШапки[0].ВалютаДССписание		= СтрСоединить(МассивВалютДвижений, "$"); 
			
			Если ЭтоПерваяСтрока Тогда
				ДанныеШапки = КопияТаблицаДанныхШапки[0];
				СтруктураЗаменыДвижений = Новый Структура("Приход, Расход", ДанныеШапки.Приход, ДанныеШапки.Расход);
			КонецЕсли;

		Иначе  			
			ДанныеШапки = ТаблицаДанныхШапки[0];
			СтруктураЗаменыДвижений = Новый Структура("Приход, Расход", СериализоватьЗнчПоля(ДанныеШапки["Приход"], "Приход"), СериализоватьЗнчПоля(ДанныеШапки["Расход"], "Расход"));			
		КонецЕсли;		
				
		СтрокаШапка = "";		
		ДополнитьСтрокуЗначениями(СтрокаШапка, ГруппыПолейОтчетаБрокера.Шапка, ДанныеШапки);
		
		ДанныеШапки.ВалютаДСЗачисление	= ?(ПустаяСтрока(ДанныеШапки.ВалютаДСЗачисление), "RUR", ДанныеШапки.ВалютаДСЗачисление);
		ДанныеШапки.ВалютаДССписание	= ?(ПустаяСтрока(ДанныеШапки.ВалютаДССписание), "RUR", ДанныеШапки.ВалютаДССписание);
		
		СтрокаПодвал = "";
		ДополнитьСтрокуЗначениями(СтрокаПодвал, ГруппыПолейОтчетаБрокера.Подвал, ДанныеШапки);
				    		           		
		Если ДанныеПоСделкам.Количество() > 0 Тогда
			
			Для каждого ДанныеПоСделке Из ДанныеПоСделкам Цикл
				
				Если Не ЭтоПерваяСтрока Тогда
					
					НайдСтроки = ТаблицаДанныхШапки.НайтиСтроки(Новый Структура("МестоХранения, ВалютаОстатка", ДанныеПоСделке.МестоХранения, ДанныеПоСделке.ВалютаСуммы));
					ДанныеШапки = НайдСтроки[0];
					
					СтрокаШапка = "";
				    ДополнитьСтрокуЗначениями(СтрокаШапка, ГруппыПолейОтчетаБрокера.Шапка, ДанныеШапки, СтруктураЗаменыДвижений);
					
				КонецЕсли;  
				
				ТекстОтчета = ТекстОтчета + СтрокаШапка;
				
				Для каждого Поле Из ГруппыПолейОтчетаБрокера.Сделка Цикл
					Если Поле = "ВалютаСуммы" Тогда
						СтрокаВалюты = ?(ЭтоПерваяСтрока, СтрЗаменить(ДанныеШапки.ВалютаОстатка, "RUB", "RUR"), СериализоватьЗнчПоля(ДанныеПоСделке[Поле], Поле)) + ";";						
						ТекстОтчета = ТекстОтчета + СтрокаВалюты; 
						ЭтоПерваяСтрока = Ложь;					
					Иначе	
						ТекстОтчета = ТекстОтчета + СериализоватьЗнчПоля(ДанныеПоСделке[Поле], Поле) + ";";
					КонецЕсли;
				КонецЦикла;
				
				ТекстОтчета = ТекстОтчета + СтрокаПодвал + Символы.ПС;
			КонецЦикла;
					
		Иначе
			ТекстОтчета = СтрокаШапка + СтрЗаменить(СтрЗаменить(СтрокаПустаяСделка, "ВалютаСуммы", ДанныеШапки.ВалютаОстатка), "RUB", "RUR") + СтрокаПодвал;
							
		КонецЕсли;
		
		Если Не ФайлОткрыт Тогда
			
			Попытка
				CSVФайлЗапись = Новый ЗаписьТекста(КаталогФайлов + "\" + СтрЗаменить(СокрЛП(СчетДоверительногоУправления), """", "") + ", " + СтрЗаменить(СокрЛП(Выборка.Брокер), """", "") + ?(ТекущийБрокер = "Брокер_БК_Регион", "", ", " + Выборка.Валюта) + ".csv", КодировкаТекста.ANSI);
				ФайлОткрыт = Истина;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка выгрузки отчета брокера по счету ДУ " + СокрЛП(СчетДоверительногоУправления) + ": " + ОписаниеОшибки());
				Прервать;
			КонецПопытки;
			
		КонецЕсли;
			
	    CSVФайлЗапись.ЗаписатьСтроку(ТекстОтчета); 
		
		Если Не ВыгружатьВОдинФайл Тогда
			CSVФайлЗапись.Закрыть();
			ФайлОткрыт = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыгружатьВОдинФайл Тогда
		CSVФайлЗапись.Закрыть();    
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервереБезКонтекста
Функция ПолучитьДанныеШапки(Организация, СчетДоверительногоУправления, Брокер, Валюта, Период, ОтветственноеЛицо, ВалютаПервойСделки = Неопределено)
	
	// после долгих дебатов было решено, что комиссия начисляется в тот же день, что и списывается;
	// и торговая и брокерская комиссии пишутся в поле "комиссия брокера"
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредств.ВидДвижения КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.Оплата)
		|				ИЛИ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ОплатаКупона)
		|			ТОГДА ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств
		|		ИНАЧЕ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств
		|	КОНЕЦ КАК ВидДвиженияДенежныхСредств,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	СУММА(ОстаткиДенежныхСредств.Сумма) КАК Сумма,
		|	ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения
		|ПОМЕСТИТЬ _СводныеДвиженияДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ОстаткиДенежныхСредств.Активность
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Брокер = &Брокер
		|	И ОстаткиДенежныхСредств.Организация = &Организация
		|	И (ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств)
		|			ИЛИ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ВариационнаяМаржа)
		|			ИЛИ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|			ИЛИ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|			ИЛИ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредств.ВидДвижения,
		|	ОстаткиДенежныхСредств.Валюта,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.Оплата)
		|				ИЛИ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ОплатаКупона)
		|			ТОГДА ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств
		|		ИНАЧЕ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств
		|	КОНЕЦ,
		|	ОстаткиДенежныхСредств.МестоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СводныеДвиженияДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СводныеДвиженияДенежныхСредств.Валюта КАК Валюта,
		|	_СводныеДвиженияДенежныхСредств.МестоХранения КАК МестоХранения,
		|	СУММА(ВЫБОР
		|			КОГДА (_СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств)
		|					ИЛИ _СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ВариационнаяМаржа)
		|					ИЛИ _СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|					И _СводныеДвиженияДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА _СводныеДвиженияДенежныхСредств.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПриход,
		|	СУММА(ВЫБОР
		|			КОГДА (_СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств)
		|					ИЛИ _СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ВариационнаяМаржа)
		|					ИЛИ _СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|					И _СводныеДвиженияДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА _СводныеДвиженияДенежныхСредств.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРасход,
		|	СУММА(ВЫБОР
		|			КОГДА _СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|					И _СводныеДвиженияДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА _СводныеДвиженияДенежныхСредств.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КомиссияБрокера,
		|	СУММА(ВЫБОР
		|			КОГДА _СводныеДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|					И _СводныеДвиженияДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА _СводныеДвиженияДенежныхСредств.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КомиссияТорговая
		|ПОМЕСТИТЬ _СводныеСуммы
		|ИЗ
		|	_СводныеДвиженияДенежныхСредств КАК _СводныеДвиженияДенежныхСредств
		|
		|СГРУППИРОВАТЬ ПО
		|	_СводныеДвиженияДенежныхСредств.СчетДоверительногоУправления,
		|	_СводныеДвиженияДенежныхСредств.Валюта,
		|	_СводныеДвиженияДенежныхСредств.МестоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СводныеСуммы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(_СводныеСуммы.КомиссияТорговая) КАК КомиссияТорговая,
		|	СУММА(_СводныеСуммы.КомиссияБрокера) КАК КомиссияБрокера
		|ПОМЕСТИТЬ _СводныеСуммыКомиссии
		|ИЗ
		|	_СводныеСуммы КАК _СводныеСуммы
		|
		|СГРУППИРОВАТЬ ПО
		|	_СводныеСуммы.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СводныеСуммы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _СводныеСуммы.МестоХранения <> &РазделFX
		|				И _СводныеСуммы.Валюта <> &ВалютаУчета
		|			ТОГДА &РазделFX
		|		ИНАЧЕ _СводныеСуммы.МестоХранения
		|	КОНЕЦ КАК МестоХранения,
		|	_СводныеСуммы.Валюта КАК Валюта,
		|	СУММА(_СводныеСуммы.СуммаПриход) КАК СуммаПриход,
		|	СУММА(_СводныеСуммы.СуммаРасход) КАК СуммаРасход
		|ПОМЕСТИТЬ _СводныеСуммыДвижения
		|ИЗ
		|	_СводныеСуммы КАК _СводныеСуммы
		|
		|СГРУППИРОВАТЬ ПО
		|	_СводныеСуммы.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _СводныеСуммы.МестоХранения <> &РазделFX
		|				И _СводныеСуммы.Валюта <> &ВалютаУчета
		|			ТОГДА &РазделFX
		|		ИНАЧЕ _СводныеСуммы.МестоХранения
		|	КОНЕЦ,
		|	_СводныеСуммы.Валюта
		|
		|ИМЕЮЩИЕ
		|	(СУММА(_СводныеСуммы.СуммаПриход) <> 0
		|		ИЛИ СУММА(_СводныеСуммы.СуммаРасход) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""отчет брокера"" КАК Заголовок,
		|	РеквизитыБрокера.КраткоеНаименованиеПоУставу КАК Брокер,
		|	&ДатаОтчета КАК ДатаОтчета,
		|	&Период КАК НачалоПериода,
		|	&Период КАК КонецПериода,
		|	РеквизитыКлиента.КраткоеНаименованиеПоУставу КАК Клиент,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК КодКлиента,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговора,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаДоговора,
		|	СУММА(ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток, 0)) КАК ВходящийОстаток,
		|	СУММА(ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток, 0)) КАК ИсходящийОстаток,
		|	ЕСТЬNULL(_СводныеСуммыДвижения.СуммаПриход, ""0.00"") КАК Приход,
		|	ЕСТЬNULL(_СводныеСуммыДвижения.СуммаРасход, ""0.00"") КАК Расход,
		|	ЕСТЬNULL(_СводныеСуммыКомиссии.КомиссияБрокера + _СводныеСуммыКомиссии.КомиссияТорговая, 0) КАК НачислениеКомиссииБрокера,
		|	""RUR"" КАК НачислениеКомиссииБрокераВалюта,
		|	ЕСТЬNULL(_СводныеСуммыКомиссии.КомиссияБрокера + _СводныеСуммыКомиссии.КомиссияТорговая, 0) КАК СписаниеКомиссииБрокера,
		|	""RUR"" КАК СписаниеКомиссииБрокераВалюта,
		|	0 КАК СписаниеПрочаяКомиссия,
		|	""RUR"" КАК СписаниеПрочаяКомиссияВалюта,
		|	""-"" КАК НепонятнаяХрень,
		|	&ОтветственноеЛицо КАК РуководительБэкОфиса,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения <> &РазделFX
		|				И ОстаткиДенежныхСредствОстаткиИОбороты.Валюта <> &ВалютаУчета
		|			ТОГДА &РазделFX
		|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения
		|	КОНЕЦ КАК МестоХранения,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта КАК ВалютаОстатка,
		|	ЕСТЬNULL(_СводныеСуммыДвижения.Валюта, ""   "") КАК ВалютаДСЗачисление,
		|	ЕСТЬNULL(_СводныеСуммыДвижения.Валюта, ""   "") КАК ВалютаДССписание,
		|	"""" КАК КомментарийКЗачислениюДС,
		|	"""" КАК КомментарийКСписаниюДС,
		|	"""" КАК ЦенаВПроцентах,
		|	ВЫБОР
		|		КОГДА &ВалютаПервойСделки <> НЕОПРЕДЕЛЕНО
		|				И ОстаткиДенежныхСредствОстаткиИОбороты.Валюта = &ВалютаПервойСделки
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(_СводныеСуммыДвижения.СуммаПриход, 0) <> 0
		|				ИЛИ ЕСТЬNULL(_СводныеСуммыДвижения.СуммаРасход, 0) <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ПриоритетСтрокВалют
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Период,
		|			Брокер = &Брокер
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыБрокера
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер.ЮрФизЛицо = РеквизитыБрокера.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|				НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				Период,
		|				,
		|				Организация = &Организация
		|					И Брокер = &Брокер
		|					И ВЫБОР
		|						КОГДА &Валюта <> НЕОПРЕДЕЛЕНО
		|							ТОГДА Валюта = &Валюта
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстаткиИОбороты
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиента
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыКлиента.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СводныеСуммыКомиссии КАК _СводныеСуммыКомиссии
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = _СводныеСуммыКомиссии.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СводныеСуммыДвижения КАК _СводныеСуммыДвижения
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = _СводныеСуммыДвижения.СчетДоверительногоУправления
		|			И (ВЫБОР
		|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения <> &РазделFX
		|						И ОстаткиДенежныхСредствОстаткиИОбороты.Валюта <> &ВалютаУчета
		|					ТОГДА &РазделFX
		|				ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения
		|			КОНЕЦ = _СводныеСуммыДвижения.МестоХранения)
		|			И (ОстаткиДенежныхСредствОстаткиИОбороты.Валюта = _СводныеСуммыДвижения.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеквизитыБрокера.КраткоеНаименованиеПоУставу,
		|	РеквизитыКлиента.КраткоеНаименованиеПоУставу,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта,
		|	ЕСТЬNULL(_СводныеСуммыДвижения.СуммаПриход, ""0.00""),
		|	ЕСТЬNULL(_СводныеСуммыДвижения.СуммаРасход, ""0.00""),
		|	ЕСТЬNULL(_СводныеСуммыКомиссии.КомиссияБрокера + _СводныеСуммыКомиссии.КомиссияТорговая, 0),
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения <> &РазделFX
		|				И ОстаткиДенежныхСредствОстаткиИОбороты.Валюта <> &ВалютаУчета
		|			ТОГДА &РазделFX
		|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения
		|	КОНЕЦ,
		|	ЕСТЬNULL(_СводныеСуммыДвижения.Валюта, ""   ""),
		|	ВЫБОР
		|		КОГДА &ВалютаПервойСделки <> НЕОПРЕДЕЛЕНО
		|				И ОстаткиДенежныхСредствОстаткиИОбороты.Валюта = &ВалютаПервойСделки
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(_СводныеСуммыДвижения.СуммаПриход, 0) <> 0
		|				ИЛИ ЕСТЬNULL(_СводныеСуммыДвижения.СуммаРасход, 0) <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ,
		|	ЕСТЬNULL(_СводныеСуммыКомиссии.КомиссияБрокера + _СводныеСуммыКомиссии.КомиссияТорговая, 0),
		|	ЕСТЬNULL(_СводныеСуммыДвижения.Валюта, ""   "")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетСтрокВалют";
		
	Запрос.УстановитьПараметр("ДатаОтчета",						ТекущаяДата());
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер",							Брокер);
	Запрос.УстановитьПараметр("Валюта",							Валюта);
	Запрос.УстановитьПараметр("ОтветственноеЛицо",				ОтветственноеЛицо);
	Запрос.УстановитьПараметр("ВалютаПервойСделки", 			ВалютаПервойСделки);
	Запрос.УстановитьПараметр("ВалютаУчета", 					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета"));
	Запрос.УстановитьПараметр("РазделFX", 						ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FX"));
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьДанныеШапки

&НаСервереБезКонтекста
Функция ПолучитьДанныеСделок(Организация, СчетДоверительногоУправления, Брокер, Валюта, Период)

	МестоСовершенияСделок = "Брокерский ""ТОРГИ""(&Брокер)";
	
	Если      Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
		МестоСовершенияСделок = СтрЗаменить(МестоСовершенияСделок, "&Брокер", "РЕГИОН");
	ИначеЕсли Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ") Тогда
		МестоСовершенияСделок = СтрЗаменить(МестоСовершенияСделок, "&Брокер", "ГПБ");
	ИначеЕсли Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_КИТ_Финанс") Тогда
		МестоСовершенияСделок = СтрЗаменить(МестоСовершенияСделок, "&Брокер", "КИТ");
	Иначе
		МестоСовершенияСделок = СтрЗаменить(МестоСовершенияСделок, "&Брокер", Строка(Брокер));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПокупкиПродажиЦБ.ВидСделки КАК ВидСделки,
		|	ПокупкиПродажиЦБ.Дата КАК ДатаСделки,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ПокупкиПродажиЦБ.ДепозитарныйСчет.Родитель.НомерСчета
		|		ИНАЧЕ ПокупкиПродажиЦБ.ДепозитарныйСчет.НомерСчета
		|	КОНЕЦ КАК НомерСчетаДепо,
		|	&МестоСовершенияСделок КАК МестоСовершенияСделки,
		|	""ДКК"" КАК Депозитарий,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.Сделка.РежимПереговорныхСделок
		|			ТОГДА ""ММВБ-РПС""
		|		ИНАЧЕ ""ММВБ""
		|	КОНЕЦ КАК Биржа,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК КодЦБНаММВБ,
		|	РеквизитыЭмитентов.КраткоеНаименованиеПоУставу КАК Эмитент,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ПокупкиПродажиЦБ.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ""Облигация""
		|		КОГДА ПокупкиПродажиЦБ.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК КодЦБНаММВБ1,
		|	ПокупкиПродажиЦБ.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК РегНомерЦБ,
		|	ЕСТЬNULL(ПокупкиПродажиЦБ.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ПокупкиПродажиЦБ.Цена, 0) КАК Цена,
		|	ПокупкиПродажиЦБ.ВалютаСделки КАК ВалютаЦены,
		|	ЕСТЬNULL(ПокупкиПродажиЦБ.Сумма, 0) КАК Сумма,
		|	ПокупкиПродажиЦБ.ВалютаСделки КАК ВалютаСуммы,
		|	ЕСТЬNULL(ПокупкиПродажиЦБ.СуммаКупона, 0) КАК СуммаКупона,
		|	ПокупкиПродажиЦБ.ВалютаСделки КАК ВалютаКупона,
		|	СУММА(ЕСТЬNULL(РасходыПоТорговойКомиссии.СуммаОборот, 0)) КАК ТорговаяКомиссия,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаТорговойКомиссии,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты КАК ДатаТорговаяКомиссия,
		|	СУММА(ЕСТЬNULL(РасходыПоБрокерскойКомиссии.СуммаОборот, 0)) КАК КомиссияБрокера,
		|	РасходыПоБрокерскойКомиссии.Валюта КАК ВалютаКомиссииБрокера,
		|	ПлановыеДатыОплатПоБрокерскойКомиссии.ДатаОплаты КАК ДатаКомиссияБрокера,
		|	0 КАК КлинговаяКомиссия,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаКлинговойКомиссии,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты КАК ДатаКлинговаяКомиссия,
		|	0 КАК ДепозитарнаяКомиссия,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаДепозитарнойКомиссии,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты КАК ДатаДепозитарнаяКомиссия,
		|	0 КАК КомиссияПосредника,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаКомиссииПосредника,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты КАК ДатаКомиссияПосредника,
		|	0 КАК КомиссияПрочая,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаКомиссииПрочей,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты КАК ДатаКомиссияПрочая,
		|	ПокупкиПродажиЦБ.ДатаОплаты КАК ДатаОплаты,
		|	ПокупкиПродажиЦБ.ДатаПеререгистрации КАК ДатаПеререгистрации,
		|	ПокупкиПродажиЦБ.НомерСделки КАК НомерСделки,
		|	ПокупкиПродажиЦБ.ДатаОплатыФакт КАК ДатаОплатыФакт,
		|	ПокупкиПродажиЦБ.ДатаПеререгистрацииФакт КАК ДатаПеререгистрацииФакт,
		|	"""" КАК ИдентификаторПортфеляСЭД,
		|	ПокупкиПродажиЦБ.РодСделкиРЕПО КАК РодСделкиРЕПО,
		|	ПокупкиПродажиЦБ.НомерСделкиРЕПО КАК НомерСделкиРЕПО,
		|	ПокупкиПродажиЦБ.ДатаИВремяСделкиРЕПО КАК ДатаИВремяСделкиРЕПО,
		|	ЕСТЬNULL(ПокупкиПродажиЦБ.ПроцентПоСделкеРЕПО, 0) КАК ПроцентПоСделкеРЕПО,
		|	ПокупкиПродажиЦБ.Сделка КАК Сделка,
		|	ПокупкиПродажиЦБ.Сделка.КонтрагентНаБирже КАК КонтрагентНаБирже,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.МестоХранения <> &РазделFX
		|				И ПокупкиПродажиЦБ.ВалютаСделки <> &ВалютаУчета
		|			ТОГДА &РазделFX
		|		ИНАЧЕ ПокупкиПродажиЦБ.МестоХранения
		|	КОНЕЦ КАК МестоХранения
		|ИЗ
		|	(ВЫБРАТЬ
		|		Сделка.Ссылка КАК Сделка,
		|		Сделка.Ссылка КАК Ссылка,
		|		Сделка.Дата КАК Дата,
		|		Сделка.ВидСделки КАК ВидСделки,
		|		Сделка.НомерСделки КАК НомерСделки,
		|		Сделка.Рынок КАК Рынок,
		|		Сделка.ВалютаСделки КАК ВалютаСделки,
		|		ВЫБОР
		|			КОГДА Сделка.РаздельноеИсполнение
		|				ТОГДА Сделка.ДатаОплаты
		|			КОГДА Сделка.ОтложенноеИсполнение
		|				ТОГДА Сделка.ДатаИсполнения
		|			ИНАЧЕ Сделка.Дата
		|		КОНЕЦ КАК ДатаОплаты,
		|		ВЫБОР
		|			КОГДА Сделка.РаздельноеИсполнение
		|				ТОГДА Сделка.ДатаПоставки
		|			КОГДА Сделка.ОтложенноеИсполнение
		|				ТОГДА Сделка.ДатаИсполнения
		|			ИНАЧЕ Сделка.Дата
		|		КОНЕЦ КАК ДатаПеререгистрации,
		|		"""" КАК ДатаОплатыФакт,
		|		"""" КАК ДатаПеререгистрацииФакт,
		|		СделкаЦенныеБумаги.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|		СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СделкаЦенныеБумаги.ЦеннаяБумага.Эмитент КАК Эмитент,
		|		СделкаЦенныеБумаги.Количество КАК Количество,
		|		СделкаЦенныеБумаги.Цена КАК Цена,
		|		СделкаЦенныеБумаги.Сумма КАК Сумма,
		|		СделкаЦенныеБумаги.СуммаКупона КАК СуммаКупона,
		|		0 КАК ЧастьСделкиРЕПО,
		|		"""" КАК РодСделкиРЕПО,
		|		"""" КАК НомерСделкиРЕПО,
		|		"""" КАК ДатаИВремяСделкиРЕПО,
		|		"""" КАК ПроцентПоСделкеРЕПО,
		|		Сделка.МестоХранения КАК МестоХранения
		|	ИЗ
		|		Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|			ПО (Сделка.Ссылка = СделкаЦенныеБумаги.Ссылка)
		|	ГДЕ
		|		Сделка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|		И Сделка.Проведен
		|		И Сделка.Организация = &Организация
		|		И Сделка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И Сделка.Брокер = &Брокер
		|		И ВЫБОР
		|				КОГДА &Валюта <> НЕОПРЕДЕЛЕНО
		|					ТОГДА Сделка.ВалютаСделки = &Валюта
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсполнениеОбязательствПоСделке.Основание,
		|		ИсполнениеОбязательствПоСделке.Ссылка,
		|		ИсполнениеОбязательствПоСделке.Основание.Дата,
		|		ИсполнениеОбязательствПоСделке.ВидСделки,
		|		ИсполнениеОбязательствПоСделке.Основание.НомерСделки,
		|		ИсполнениеОбязательствПоСделке.Рынок,
		|		ИсполнениеОбязательствПоСделке.ВалютаСделки,
		|		ИсполнениеОбязательствПоСделке.Дата,
		|		ИсполнениеОбязательствПоСделке.Дата,
		|		ИсполнениеОбязательствПоСделке.Дата,
		|		ИсполнениеОбязательствПоСделке.Дата,
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.ДепозитарныйСчет,
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага,
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага.Эмитент,
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Количество,
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Цена,
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Сумма,
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона,
		|		0,
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		ИсполнениеОбязательствПоСделке.МестоХранения
		|	ИЗ
		|		Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|			ПО (ИсполнениеОбязательствПоСделке.Ссылка = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка)
		|	ГДЕ
		|		ИсполнениеОбязательствПоСделке.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|		И ИсполнениеОбязательствПоСделке.Проведен
		|		И ИсполнениеОбязательствПоСделке.Организация = &Организация
		|		И ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ИсполнениеОбязательствПоСделке.Брокер = &Брокер
		|		И ВЫБОР
		|				КОГДА &Валюта <> НЕОПРЕДЕЛЕНО
		|					ТОГДА ИсполнениеОбязательствПоСделке.ВалютаСделки = &Валюта
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СделкаРЕПО.Ссылка,
		|		СделкаРЕПО.Ссылка,
		|		СделкаРЕПО.Дата,
		|		СделкаРЕПО.ВидСделки,
		|		СделкаРЕПО.НомерСделки,
		|		СделкаРЕПО.Рынок,
		|		СделкаРЕПО.ВалютаСделки,
		|		СделкаРЕПО.Дата,
		|		СделкаРЕПО.Дата,
		|		СделкаРЕПО.Дата,
		|		СделкаРЕПО.Дата,
		|		СделкаРЕПОЦенныеБумаги.ДепозитарныйСчет,
		|		СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
		|		СделкаРЕПОЦенныеБумаги.ЦеннаяБумага.Эмитент,
		|		СделкаРЕПОЦенныеБумаги.Количество,
		|		СделкаРЕПОЦенныеБумаги.Цена,
		|		СделкаРЕПОЦенныеБумаги.Сумма,
		|		СделкаРЕПОЦенныеБумаги.СуммаКупона,
		|		1,
		|		""Первая часть РЕПО"",
		|		СделкаРЕПО.НомерСделки,
		|		СделкаРЕПО.Дата,
		|		СделкаРЕПО.СтавкаРЕПО,
		|		СделкаРЕПО.МестоХранения
		|	ИЗ
		|		Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|			ПО (СделкаРЕПО.Ссылка = СделкаРЕПОЦенныеБумаги.Ссылка)
		|	ГДЕ
		|		СделкаРЕПО.ЧастьСделкиРЕПО = 1
		|		И СделкаРЕПО.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|		И СделкаРЕПО.Проведен
		|		И СделкаРЕПО.Организация = &Организация
		|		И СделкаРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И СделкаРЕПО.Брокер = &Брокер
		|		И ВЫБОР
		|				КОГДА &Валюта <> НЕОПРЕДЕЛЕНО
		|					ТОГДА СделкаРЕПО.ВалютаСделки = &Валюта
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УсловияСделокРЕПОСрезПоследних.СделкаРЕПО,
		|		ВтораяЧастьРЕПО.Ссылка,
		|		УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата,
		|		ВтораяЧастьРЕПО.ВидСделки,
		|		ВтораяЧастьРЕПО.НомерСделки,
		|		УсловияСделокРЕПОСрезПоследних.Рынок,
		|		УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВалютаСделки,
		|		УсловияСделокРЕПОСрезПоследних.ДатаОплаты,
		|		УсловияСделокРЕПОСрезПоследних.ДатаПоставки,
		|		"""",
		|		"""",
		|		УсловияСделокРЕПОСрезПоследних.ДепозитарныйСчет,
		|		УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага,
		|		УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага.Эмитент,
		|		УсловияСделокРЕПОСрезПоследних.Количество,
		|		УсловияСделокРЕПОСрезПоследних.Цена,
		|		УсловияСделокРЕПОСрезПоследних.Сумма,
		|		УсловияСделокРЕПОСрезПоследних.СуммаКупона,
		|		2,
		|		""Вторая часть РЕПО"",
		|		УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделки,
		|		УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата,
		|		УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО,
		|		ВтораяЧастьРЕПО.МестоХранения
		|	ИЗ
		|		РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				ЧастьСделкиРЕПО = 2
		|					И НЕ Отменено
		|					И Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ДатаВторойЧастиРЕПО >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|					И СделкаРЕПО.Брокер = &Брокер
		|					И ВЫБОР
		|						КОГДА &Валюта <> НЕОПРЕДЕЛЕНО
		|							ТОГДА СделкаРЕПО.ВалютаСделки = &Валюта
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И СделкаРЕПО.Дата <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)) КАК УсловияСделокРЕПОСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК ВтораяЧастьРЕПО
		|			ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = ВтораяЧастьРЕПО.ПерваяЧастьРЕПО
		|				И (НЕ ВтораяЧастьРЕПО.ПометкаУдаления)) КАК ПокупкиПродажиЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО (КодыВТорговыхСистемахСрезПоследних.Объект = ПокупкиПродажиЦБ.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитентов
		|		ПО (РеквизитыЭмитентов.ЮрФизЛицо = ПокупкиПродажиЦБ.Эмитент.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО (УсловияСделокСрезПоследних.Сделка = ПокупкиПродажиЦБ.Сделка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО (УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = ПокупкиПродажиЦБ.Сделка)
		|			И (УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = ПокупкиПродажиЦБ.ЧастьСделкиРЕПО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				День,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК РасходыПоТорговойКомиссии
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК ПлановыеДатыОплатТорговойКомиссии
		|			ПО РасходыПоТорговойКомиссии.Сделка = ПлановыеДатыОплатТорговойКомиссии.Основание
		|				И РасходыПоТорговойКомиссии.Валюта = ПлановыеДатыОплатТорговойКомиссии.Валюта
		|		ПО ПокупкиПродажиЦБ.Сделка = РасходыПоТорговойКомиссии.Сделка
		|			И ПокупкиПродажиЦБ.ЦеннаяБумага = РасходыПоТорговойКомиссии.ЦеннаяБумага
		|			И (ВЫБОР
		|				КОГДА ПокупкиПродажиЦБ.ЧастьСделкиРЕПО = 2
		|					ТОГДА НАЧАЛОПЕРИОДА(РасходыПоТорговойКомиссии.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПокупкиПродажиЦБ.Ссылка.Дата, ДЕНЬ)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				День,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоБрокерскойКомиссии
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК ПлановыеДатыОплатПоБрокерскойКомиссии
		|			ПО РасходыПоБрокерскойКомиссии.Сделка = ПлановыеДатыОплатПоБрокерскойКомиссии.Основание
		|				И РасходыПоБрокерскойКомиссии.Валюта = ПлановыеДатыОплатПоБрокерскойКомиссии.Валюта
		|		ПО ПокупкиПродажиЦБ.Сделка = РасходыПоБрокерскойКомиссии.Сделка
		|			И ПокупкиПродажиЦБ.ЦеннаяБумага = РасходыПоБрокерскойКомиссии.ЦеннаяБумага
		|			И (ВЫБОР
		|				КОГДА ПокупкиПродажиЦБ.ЧастьСделкиРЕПО = 2
		|					ТОГДА НАЧАЛОПЕРИОДА(РасходыПоБрокерскойКомиссии.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПокупкиПродажиЦБ.Ссылка.Дата, ДЕНЬ)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПокупкиПродажиЦБ.СуммаКупона,
		|	ПокупкиПродажиЦБ.Сумма,
		|	ПокупкиПродажиЦБ.ВидСделки,
		|	ПокупкиПродажиЦБ.Дата,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ПокупкиПродажиЦБ.ДепозитарныйСчет.Родитель.НомерСчета
		|		ИНАЧЕ ПокупкиПродажиЦБ.ДепозитарныйСчет.НомерСчета
		|	КОНЕЦ,
		|	РеквизитыЭмитентов.КраткоеНаименованиеПоУставу,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ПокупкиПродажиЦБ.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ""Облигация""
		|		КОГДА ПокупкиПродажиЦБ.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ПокупкиПродажиЦБ.ЦеннаяБумага.ГосударственныйРегистрационныйНомер,
		|	ПокупкиПродажиЦБ.Количество,
		|	ПокупкиПродажиЦБ.Цена,
		|	РасходыПоБрокерскойКомиссии.Валюта,
		|	ПокупкиПродажиЦБ.ДатаОплаты,
		|	ПокупкиПродажиЦБ.ДатаПеререгистрации,
		|	ПокупкиПродажиЦБ.НомерСделки,
		|	ПокупкиПродажиЦБ.ДатаОплатыФакт,
		|	ПокупкиПродажиЦБ.ДатаПеререгистрацииФакт,
		|	ПокупкиПродажиЦБ.РодСделкиРЕПО,
		|	ПокупкиПродажиЦБ.НомерСделкиРЕПО,
		|	ПокупкиПродажиЦБ.ДатаИВремяСделкиРЕПО,
		|	ПокупкиПродажиЦБ.Сделка,
		|	КодыВТорговыхСистемахСрезПоследних.Код,
		|	ПокупкиПродажиЦБ.ВалютаСделки,
		|	РасходыПоТорговойКомиссии.Валюта,
		|	ПокупкиПродажиЦБ.ПроцентПоСделкеРЕПО,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты,
		|	ПлановыеДатыОплатПоБрокерскойКомиссии.ДатаОплаты,
		|	ПокупкиПродажиЦБ.Сделка.КонтрагентНаБирже,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.Сделка.РежимПереговорныхСделок
		|			ТОГДА ""ММВБ-РПС""
		|		ИНАЧЕ ""ММВБ""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПокупкиПродажиЦБ.МестоХранения <> &РазделFX
		|				И ПокупкиПродажиЦБ.ВалютаСделки <> &ВалютаУчета
		|			ТОГДА &РазделFX
		|		ИНАЧЕ ПокупкиПродажиЦБ.МестоХранения
		|	КОНЕЦ,
		|	КодыВТорговыхСистемахСрезПоследних.Код,
		|	ПокупкиПродажиЦБ.ВалютаСделки,
		|	ПокупкиПродажиЦБ.ВалютаСделки,
		|	РасходыПоТорговойКомиссии.Валюта,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты,
		|	РасходыПоТорговойКомиссии.Валюта,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты,
		|	РасходыПоТорговойКомиссии.Валюта,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты,
		|	РасходыПоТорговойКомиссии.Валюта,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСделки";

	Запрос.УстановитьПараметр("Период",                       	Период);
	Запрос.УстановитьПараметр("Организация",                  	Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер",                       	Брокер);
	Запрос.УстановитьПараметр("Валюта",                       	Валюта);
	Запрос.УстановитьПараметр("МестоСовершенияСделок",        	МестоСовершенияСделок);	
	Запрос.УстановитьПараметр("ВалютаУчета",			        ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета"));
	Запрос.УстановитьПараметр("РазделFX", 						ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FX")); 								

	Данные			= Запрос.Выполнить().Выгрузить();
	МассивСделок	= Данные.ВыгрузитьКолонку("Сделка");
	Данные.Колонки.Удалить("Сделка");
	
	РаботаСОтчетами.КонтрольМультивалютностиРасходовПоСделкам(СчетДоверительногоУправления, Неопределено, Неопределено, МассивСделок);
	
	Возврат Данные;

КонецФункции // ПолучитьДанныеСделок

&НаСервереБезКонтекста
Функция ПолучитьЗначенияПолейПустойСделки(Организация, СчетДоверительногоУправления, Период, ПредставлениеРубля = "RUR") 

	ПериодДДММГГГГ = Формат(Период, "ДФ=dd.MM.yyyy");
	НомерСчетаДепо = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Родитель.НомерСчета КАК НомерСчетаДепо
		|ИЗ
		|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|ГДЕ
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|	И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия >= &Период)
		|	И ИсполнителиПоЦеннымБумагам.Организация = &Организация";

	Запрос.УстановитьПараметр("Организация",                  Организация);	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период",                       Период);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НомерСчетаДепо = Выборка.НомерСчетаДепо;
	КонецЕсли;
	
	ЗначенияПолейПустойСделки = Новый Структура;
	ЗначенияПолейПустойСделки.Вставить("ВидСделки",                  "-");
	ЗначенияПолейПустойСделки.Вставить("ДатаСделки",                 ПериодДДММГГГГ + " 10:00:00");
	ЗначенияПолейПустойСделки.Вставить("НомерСчетаДепо",             НомерСчетаДепо);
	ЗначенияПолейПустойСделки.Вставить("МестоСовершенияСделки",      "Брокерский ""ТОРГИ""(РЕГИОН)");
	ЗначенияПолейПустойСделки.Вставить("Депозитарий",                "ДКК");
	ЗначенияПолейПустойСделки.Вставить("Биржа",                      "-");
	ЗначенияПолейПустойСделки.Вставить("КодЦБНаММВБ",                "-");
	ЗначенияПолейПустойСделки.Вставить("Эмитент",                    "-");
	ЗначенияПолейПустойСделки.Вставить("ТипЦБ",                      "-");
	ЗначенияПолейПустойСделки.Вставить("КодЦБНаММВБ1",               "");
	ЗначенияПолейПустойСделки.Вставить("РегНомерЦБ",                 "-");
	ЗначенияПолейПустойСделки.Вставить("Количество",                 "");
	ЗначенияПолейПустойСделки.Вставить("Цена",                       "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаЦены",                 ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("Сумма",                      "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаСуммы",                "ВалютаСуммы");
	ЗначенияПолейПустойСделки.Вставить("СуммаКупона",                "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаКупона",               ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("ТорговаяКомиссия",           "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаТорговойКомиссии",     ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("КомиссияБрокера",            "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаКомиссииБрокера",      ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("КлинговаяКомиссия",          "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаКлинговойКомиссии",    ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("ДепозитарнаяКомиссия",       "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаДепозитарнойКомиссии", ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("ДатаОплаты",                 ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("ДатаПеререгистрации",        ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("НомерСделки",                "-");
	ЗначенияПолейПустойСделки.Вставить("ДатаОплатыФакт",             ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("ДатаПеререгистрацииФакт",    ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("ДатаКомиссияБрокера",        ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("ДатаТорговаяКомиссия",       ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("ДатаКлинговаяКомиссия",      ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("ДатаДепозитарнаяКомиссия",   ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("КомиссияПосредника",         "0.00");
	ЗначенияПолейПустойСделки.Вставить("ВалютаКомиссииПосредника",   ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("ДатаКомиссияПосредника",     ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("КомиссияПрочая",             "0.00");
	ЗначенияПолейПустойСделки.Вставить("ВалютаКомиссииПрочей",       ПредставлениеРубля);
	ЗначенияПолейПустойСделки.Вставить("ДатаКомиссияПрочая",         ПериодДДММГГГГ);
	ЗначенияПолейПустойСделки.Вставить("ИдентификаторПортфеляСЭД",   "");
	ЗначенияПолейПустойСделки.Вставить("РодСделкиРЕПО",              "");
	ЗначенияПолейПустойСделки.Вставить("НомерСделкиРЕПО",            "");
	ЗначенияПолейПустойСделки.Вставить("ДатаИВремяСделкиРЕПО",       "");
	ЗначенияПолейПустойСделки.Вставить("ПроцентПоСделкеРЕПО",        "");
	ЗначенияПолейПустойСделки.Вставить("КонтрагентНаБирже",          ""); 	
	ЗначенияПолейПустойСделки.Вставить("КомментарийКЗачислениюДС",	"");
	ЗначенияПолейПустойСделки.Вставить("КомментарийКСписаниюДС",	"");
	ЗначенияПолейПустойСделки.Вставить("ВалютаДСЗачисление",        "");
	ЗначенияПолейПустойСделки.Вставить("ВалютаДССписание",          "");
	ЗначенияПолейПустойСделки.Вставить("ЦенаВПроцентах",          	"");
	
	Возврат ЗначенияПолейПустойСделки;					

КонецФункции // ПолучитьЗначенияПолейПустойСделки

&НаСервереБезКонтекста
Функция СериализоватьЗнчПоля(ЗнчПоля, ИмяПоля)
	
	Если      ТипЗнч(ЗнчПоля) = Тип("Дата") Тогда
		Если ИмяПоля = "ДатаСделки" Тогда
			Возврат Формат(ЗнчПоля, "dd.MM.yyyy ЧЧ:ММ:сс");
		Иначе
			Возврат Формат(ЗнчПоля, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЗнчПоля) = Тип("СправочникСсылка.Валюты") Тогда
		Валюта = СокрЛП(ЗнчПоля.Наименование);
		
		Если Валюта = "RUB" Тогда
			Валюта = "RUR";
		КонецЕсли;
		
		Возврат Валюта;
		
	ИначеЕсли ТипЗнч(ЗнчПоля) = Тип("Число") Тогда
		Если      ИмяПоля = "Количество" Тогда
			Возврат Формат(ЗнчПоля, "ЧЦ=19; ЧДЦ=; ЧРД=.; ЧН=0.00; ЧГ=0");
		ИначеЕсли ИмяПоля = "Цена" Тогда
			Возврат Формат(ЗнчПоля, "ЧЦ=19; ЧДЦ=9; ЧРД=.; ЧН=0.00; ЧГ=0");
		Иначе
			Возврат Формат(ЗнчПоля, "ЧЦ=19; ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=0");
		КонецЕсли;
			
	Иначе
		Возврат Строка(ЗнчПоля);
		
	КонецЕсли;
	
КонецФункции // СериализоватьЗнчПоля

&НаСервереБезКонтекста
Процедура ДополнитьСтрокуЗначениями(СтрокаРезультата, МассивПолей, Данные, СтруктураЗаменыДвижений = Неопределено)
	
	Для каждого Поле Из МассивПолей Цикл
		
		Если СтруктураЗаменыДвижений <> Неопределено И СтруктураЗаменыДвижений.Свойство(Поле) Тогда
			СтрокаРезультата = СтрокаРезультата + СтруктураЗаменыДвижений[Поле] + ";";
		Иначе
			СтрокаРезультата = СтрокаРезультата + СериализоватьЗнчПоля(Данные[Поле], Поле) + ";";
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СериализоватьДанныеВМассиве(МассивДанных, ИмяКолонки)
	
	ОбновленныйМассив = Новый Массив;
	Для Каждого ЗначениеМассива Из МассивДанных Цикл
		ОбновленныйМассив.Добавить(СериализоватьЗнчПоля(ЗначениеМассива, ИмяКолонки));
	КонецЦикла;
	
	МассивДанных = ОбновленныйМассив;
	
КонецПроцедуры

#КонецОбласти
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

