
Процедура ПередЗаписью(Отказ, Замещение)
	
	СообщенияОбОшибках = Новый Массив;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ДатаНачалаВыполнения <> НачалоДня(Запись.ПериодВыполненияНачало) Тогда
			СообщенияОбОшибках.Добавить("Для сессии статистики " + Запись.Сессия + " дата начала выполнения "
				+ Запись.ДатаНачалаВыполнения + " не соответствует началу периода выполнения " + Запись.ПериодВыполненияНачало);
		КонецЕсли;		
	КонецЦикла;
	
	Если СообщенияОбОшибках.Количество() > 0 Тогда
		
		Если СообщенияОбОшибках.Количество() > 2 Тогда // отобразим первые 2 и общее кол-во ошибочных записей
			// кол-во =2 выбрано не случайно: на экране отображается сообщение из 3х строчек, а всё
			// что ниже обрезается (видно только если скопировать текст сообщения и куда-то вставить)
			СообщенияОбОшибкахПервые2 = Новый Массив;
			СообщенияОбОшибкахПервые2.Добавить(СообщенияОбОшибках[0]);
			СообщенияОбОшибкахПервые2.Добавить(СообщенияОбОшибках[1]);
			СообщенияОбОшибкахПервые2.Добавить("... (всего " + СообщенияОбОшибках.Количество() + ")");
		Иначе
			СообщенияОбОшибкахПервые2 = СообщенияОбОшибках;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(СообщенияОбОшибкахПервые2, Символы.ПС),,,, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
