
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура СоздатьПорученияНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если Не ОбъектНаСервере.ЭтоРабочийИлиТорговыйДень(НачалоДня(ТекущаяДатаСеанса())) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущая дата не является ни торговым ни рабочим днем.");
		Возврат;
	КонецЕсли;
	
	ОбъектНаСервере.СоздатьПоручения();
	ОбъектНаСервере.ОповеститьОбОшибках(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручения(Команда)
	
	СоздатьПорученияНаСервере();
	
	Если Объект.ДополнительныеСвойства.Свойство("НовыеПоручения") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создано поручений: " + Объект.ДополнительныеСвойства.НовыеПоручения + ".");
		Объект.ДополнительныеСвойства.Удалить("НовыеПоручения");
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Команда выполнена. Отстутствуют данные для создания поручений.");
	КонецЕсли;

КонецПроцедуры