&НаСервере
Процедура СформироватьСписокРазделовОтчета()
	
	ЭтаФорма.РазделыОтчета.Очистить();
	
	ЭтаФорма.СохраняемыеРазделы = Отчеты.РегламентированныйОтчетОФинансовыхРезультатах.СформироватьСписокРазделовОтчета(ЭтаФорма.ИмяФормы);
	
	Для Каждого Раздел Из ЭтаФорма.СохраняемыеРазделы Цикл
		ДобавитьРазделОтчета(РазделыОтчета, Раздел.Значение, Раздел.Представление);
		Раздел.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРазделОтчета(РазделыОтчета, ИмяРаздела, Представление)

	НоваяСтрока = РазделыОтчета.Добавить();
	
	НоваяСтрока.ИмяРаздела = ИмяРаздела;
	НоваяСтрока.Представление = Представление;

КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	ЭтаФорма.СтруктураРеквизитовФормы = Отчеты.РегламентированныйОтчетОФинансовыхРезультатах.ПолучитьСтруктуруПараметров(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиСервер()
	
	СформироватьСписокРазделовОтчета();
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ИмяМакетаСоставаПоказателей = КонсолидированнаяОтчетность.ПолучитьИмяМакетаСоставаПоказателей("РегламентированныйОтчетОФинансовыхРезультатах", СтруктураРеквизитовФормы);	
	МакетСоставаПоказателей = Отчеты[СтруктураНаименованийОтчета.ИсточникОтчета].ПолучитьМакет(ИмяМакетаСоставаПоказателей);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МакетСоставаПоказателей", МакетСоставаПоказателей);
	СтруктураПараметров.Вставить("мТаблицаСоставПоказателей", мТаблицаСоставПоказателей);
	СтруктураПараметров.Вставить("УникальныйИдентификатор", ЭтаФорма.УникальныйИдентификатор);
	
	СтруктураПараметров.Вставить("Адрес_ТаблицаРасшифровки", Адрес_ТаблицаРасшифровки);
	СтруктураПараметров.Вставить("Адрес_мСтруктураЦветовРаскраски", Адрес_мСтруктураЦветовРаскраски);
	СтруктураПараметров.Вставить("Адрес_мСтруктураВариантыЗаполнения", Адрес_мСтруктураВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаВариантыЗаполнения", Адрес_мТаблицаВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаСчетов", Адрес_мТаблицаСчетов);
	
	КонсолидированнаяОтчетность.ЗаполнитьНачальныеНастройкиСервер(СтруктураПараметров);
	
	Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		Если Лев(ЭлементСтруктуры.Ключ, 6) = "Адрес_" Тогда
			ЭтаФорма[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено Тогда
		
		СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
		СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
		СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
		СписокСохранения.Свойство("НКО", СтруктураРеквизитовФормы.НКО);
		
		ЗаполнитьНачальныеНастройкиСервер();
		
		ЗаполнитьТабличныеДокументыИзМакетов();
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
           И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
        	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

		КонецЕсли;
		
	Иначе
		
		ЗаполнитьНачальныеНастройкиСервер();
		
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			// документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе
			// Это новый документ.
			Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
				СтруктураРеквизитовФормы.ВалютаДокумента  		  	= ЭтаФорма.НастройкиОтчета.ВалютаДокумента;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         	= ЭтаФорма.НастройкиОтчета.ЕдиницаИзмерения;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	= ЭтаФорма.НастройкиОтчета.ТочностьЕдиницыИзмерения;
				ЭтаФорма.Подписант 									= ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
			Иначе	
				СтруктураРеквизитовФормы.ВалютаДокумента  		  = СтруктураРеквизитовФормы.Организация.ВалютаУчета;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			КонецЕсли; 
			
			ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
			СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода = КонсолидированнаяОтчетность.ПолучитьОтчетНаКонецПредыдущегоПериода(СтруктураРеквизитовФормы, ИсточникОтчета);			
			ЭтаФорма.СтатусОтчета = "Черновик";
			
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьТабличныеДокументыИзМакетов();
		ЗаполнитьДенежныйПоказательСРазмерностью();
		
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
	
		Если ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
			
			ЭтаФорма.КлючТекущихНастроек = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
			КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОФинансовыхРезультатах");
		
		КонецЕсли;
				
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НаимСчетаДоверительногоУправления = СтруктураРеквизитовФормы.СчетДоверительногоУправления.Наименование;
	
	Если Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 1 Тогда 
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг "" г.""'");
	ИначеЕсли СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = "период с " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ИначеЕсли СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(НачалоКвартала(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ДФ='ММММ'") + " - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг "" г.""'");
	Иначе
		СтруктураРеквизитовФормы.СтрПериодОтчета = "Январь - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг "" г.""'");
	КонецЕсли;
	
	ИнициализироватьСтруктуруЗаголовковОтчетов();
	
	мСкопированаФорма = Неопределено;
	Параметры.Свойство("мСкопированаФорма", мСкопированаФорма);
	Если ЗначениеЗаполнено(мСкопированаФорма) Тогда 
		Модифицированность = Истина;
	КонецЕсли;
	
	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);
	Элементы.НомерКорректировки.Видимость = ЭтаФорма.СтатусОтчета = "Корректировка";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерностьВалюту()
	
	ЕдиницаИзмеренияНадпись = "";
	ПредставлениеВалютыДокумента = ?(ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента), СтруктураРеквизитовФормы.ВалютаДокумента, "руб");
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		ЕдиницаИзмеренияНадпись ="в "+ ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		ЕдиницаИзмеренияНадпись ="в тысячах " + ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		ЕдиницаИзмеренияНадпись = "в миллионах " + ПредставлениеВалютыДокумента;
	КонецЕсли;
	
	Возврат ЕдиницаИзмеренияНадпись;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДенежныйПоказательСРазмерностью()
	
	ДенежныйПоказательСРазмерностью = КонсолидированнаяОтчетность.ПолучитьДенежныйПоказательСРазмерностью(СтруктураРеквизитовФормы, ЭтаФорма);
	
	РазмерностьДокумента = ПолучитьРазмерностьВалюту();
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		ИмяРаздела = ТекСтрока.ИмяРаздела;
		
		Попытка
			ТекРаздел = ТекСтрока.ТабличныйДокумент;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если НЕ ТекРаздел.Области.Найти("ДенежныйПоказательСРазмерностью") = Неопределено
			и ТекРаздел.Области.ДенежныйПоказательСРазмерностью.СодержитЗначение
			Тогда
			ТекРаздел.Области.ДенежныйПоказательСРазмерностью.Значение = ДенежныйПоказательСРазмерностью;
		КонецЕсли;
		Если НЕ ТекРаздел.Области.Найти("НаименованиеВалютыОтчета") = Неопределено 
			и ТекРаздел.Области.НаименованиеВалютыОтчета.СодержитЗначение
			Тогда
			ТекРаздел.Области.НаименованиеВалютыОтчета.Значение = РазмерностьДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруЗаголовковОтчетов()
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов = Новый Соответствие;
	
	КонецПредыдущегоГода = КонецГода(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	ГодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ = 'гггг'");
	ГодПредыдущий = Формат(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12), "ДФ = 'гггг'");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодОтчетногоГода", "за " + ГодОтчета + "г.");
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодПредыдущегоГода", "за " + ГодПредыдущий + "г.");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаОтчетнуюДату", "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD"));
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаКонецПредыдущегоГода", "На " + Формат(КонецПредыдущегоГода, "ДЛФ=DD"));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ПоказателиОтчета;
	Перем ТаблицаРасшифровки;
	Перем РазделыСРучнойКорректировкой;
	
	СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
	
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         	 = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	 = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.ВалютаДокумента			 = СтруктураРеквизитовФормы.мСохраненныйДок.ВалютаДокумента;
	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода	 = СтруктураРеквизитовФормы.мСохраненныйДок.ОтчетНаКонецПрошлогоГода;
	Комментарий                                        	 = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтатусОтчета                                         = СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета;
	НомерКорректировки                                 	 = СтруктураРеквизитовФормы.мСохраненныйДок.НомерКорректировки;

	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	СписокСохранения.Свойство("Расшифровка", ТаблицаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		
		Адрес_ТаблицаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, УникальныйИдентификатор);
		
	КонецЕсли;
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("РазделыСРучнойКорректировкой", РазделыСРучнойКорректировкой);
	СписокСохранения.Свойство("Подписант", ЭтаФорма.Подписант);
	
	Для Каждого ТекСтрока из ЭтаФорма.РазделыОтчета Цикл
		Если Не РазделыСРучнойКорректировкой.Найти(ТекСтрока.ИмяРаздела) = Неопределено Тогда
			ТекСтрока.РучнаяКорректировка = Истина;
			КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ТекСтрока.ИмяРаздела, ТекСтрока.ТабличныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока из ПоказателиОтчета Цикл
		Попытка
			ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекСтрока.ИмяРаздела);
			ТабДок.Области[ТекСтрока.ИмяПоказателя].Значение = ТекСтрока.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеДокументыИзМакетов(ЭтоНовый = Истина)
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		Попытка
			
			Префикс = "МСФО9_";
			
			Если (ТекСтрока.ИмяРаздела = "ОтчетТитульнаяСтраница")ИЛИ(ТекСтрока.ИмяРаздела = "ДоходыЗаВычетомРасходов2017") Тогда
			
				Префикс = ?(СтруктураРеквизитовФормы.НКО, "МСФО9_НКО_", "МСФО9_");
			
			КонецЕсли; 
			
			ИмяМакета = Префикс + "Макет" + ТекСтрока.ИмяРаздела;
			
			КонсолидированнаяОтчетность.ЗаполнитьТабличныйДокументИзМакета(ЭтаФорма, ТекСтрока, ИмяМакета);
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦветФонаЯчейки(ИмяТекРаздела = "", ТекРаздел = Неопределено)

	КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяТекРаздела, ТекРаздел);
	Если ЗначениеЗаполнено(ТекРаздел = Неопределено) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяТекРаздела);
	Иначе
		ЭтаФорма.ТабличныйДокумент = ТекРаздел;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
		
		СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраница";
		СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
		
		ЗаполнитьАвто();
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
			ЭтаФорма.СтатусОтчета = "Черновик";
		КонецЕсли; 
		
		Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
			Записать(Неопределено);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьФорму Тогда
		ЭтаФорма.Открыть();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить() Экспорт
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраница";
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
	
	ЗаполнитьАвто();
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
		ЭтаФорма.СтатусОтчета = "Черновик";
	КонецЕсли; 
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьСтруктуруРеквизитовФормы();
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы, Параметры);
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	КонсолидированнаяОтчетность.ЗаполнитьСтруктуруПеременныхДляОтбора(СтруктураПеременныхДляОтбора);
	
	Инициализация(Параметры.БезОткрытияФормы);
	
	ИмяОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].ИмяРаздела;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	КонсолидированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонсолидированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета) Тогда
	
		ПредыдущаяСтрока = ЭтаФорма.РазделыОтчета.НайтиПоИдентификатору(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета);
		Если Не ПредыдущаяСтрока = Неопределено Тогда
		
			ПредыдущаяСтрока.ТабличныйДокумент = ЭтаФорма.ТабличныйДокумент;
		
		КонецЕсли; 
	
	КонецЕсли; 
		
	НаимТекущегоРаздела = Элемент.ТекущиеДанные.ИмяРаздела;
	ЭтаФорма.РучнаяКорректировка = Элемент.ТекущиеДанные.РучнаяКорректировка;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = НаимТекущегоРаздела;
	
	Если НаимТекущегоРаздела = "ОтчетТитульнаяСтраница" Тогда
		
		Элементы.РучнаяКорректировка.Доступность = Ложь;
		
	Иначе
		
		Элементы.РучнаяКорректировка.Доступность = Истина;
	
	КонецЕсли; 	
	
	ЭтаФорма.ТабличныйДокумент = Элемент.ТекущиеДанные.ТабличныйДокумент;
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Истина;
		РучнаяКорректировкаПриУстановкеСервер(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		УстановитьЦветФонаЯчейки(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
	Иначе
		
		ЭтаФорма.РучнаяКорректировка = Истина;
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РучнаяКорректировкаПриИзмененииВопросЗавершение",
		ЭтотОбъект,)
		,
		НСтр("ru = 'Будет произведено автоматическое заполнение закладки. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзмененииВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Ложь;
	ЭтаФорма.РучнаяКорректировка = Ложь;
	ЗаполнитьАвто(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриУстановкеСервер(ИмяРаздела)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Раздел", ИмяРаздела);
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Расчет(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифровкаНажатие(Неопределено);
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеОтчета

&НаСервереБезКонтекста
Функция ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет)
	Возврат РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет);
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДанныеДокумента(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегламентированныйОтчет.ДатаНачала КАК ДатаНачала,
		|	РегламентированныйОтчет.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат Новый Структура("ДатаНачала, ДатаОкончания", ВыборкаДетальныеЗаписи.ДатаНачала, ВыборкаДетальныеЗаписи.ДатаОкончания);
	
	КонецЕсли;

	Возврат Новый Структура("ДатаНачала, ДатаОкончания");
	
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьАвто(ИмяРаздела = "")

	Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(,"Необходимо указать валюту отчета!");
		Возврат;
	КонецЕсли;
	
	Если Не (ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")) Тогда
		ЭтаФорма.НастройкиОтчета = ПолучитьНастройкиОтчета(
			ЭтаФорма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, 
			ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления,
			"РегламентированныйОтчетОФинансовыхРезультатах");		
	КонецЕсли; 
	
	СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала = НачалоКвартала(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета  = НачалоКвартала(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	Если СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12);
	Иначе
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецМесяца(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода) Тогда
		
		ДанныеДокумента = ПолучитьДанныеДокумента(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
		
		СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДанныеДокумента.ДатаНачала;
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецДня(ДанныеДокумента.ДатаОкончания);
	
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
	
		СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода    = "С " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
		СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "С " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, "ДФ=dd.MM.yyyy");
		
	Иначе
		
		СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода    = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
		СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, "ДФ=dd.MM.yyyy");	
		
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	// Очистка разделов
	Очистить(ИмяРаздела);
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	нСч = 0;
	ПредставлениеОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].Представление;
	// Заполнение разделов
	Если ИмяРаздела = "" Тогда
		
		Всего = ЭтаФорма.РазделыОтчета.Количество();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				
				Состояние("Заполняется раздел: " + ТекСтрока.Представление, нСч/Всего * 100, "Заполнение...");
				Выполнить("Подключаемый_ЗаполнитьРаздел_" + ТекСтрока.ИмяРаздела + "()");
				нСч = нСч + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяРаздела + "()");
		КонецЕсли;
		
	КонецЕсли;
	
	Если нСч Тогда
		Состояние("Заполняется раздел: " + ПредставлениеОсновногоРаздела, нСч/Всего * 100, "Заполнение...");
	КонецЕсли;
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		Очистить(ИмяОсновногоРаздела);
	КонецЕсли;
	
	Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
	
	Если нСч Тогда
		Состояние();
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		
		ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета[0].ТабличныйДокумент;
		
	Иначе
		
		ЭтаФорма.ТабличныйДокумент = Элементы.РазделыОтчета.ТекущиеДанные.ТабличныйДокумент;
	
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);

КонецПроцедуры

 &НаСервере
Процедура Очистить(ИмяРаздела = "")
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Если ИмяРаздела = "" Тогда
		
		ТаблицаРасшифровки.Очистить();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			ОчиститьТабличноеПоле(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
			
		КонецЦикла;
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("Раздел", ИмяРаздела);
		НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
		ОчиститьТабличноеПоле(ТабДок, ИмяРаздела);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	ЗаполнитьЗаголовки(ИмяРаздела);
	ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела)
	
	Если ИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
		Возврат;	
	КонецЕсли; 
	
	НайденныеСтроки = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела));
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
		
			ТекСтрока.РучнаяКорректировка = Ложь;
		
		КонецЦикла; 
		
	КонецЕсли;
	
	УстановитьЦветФонаЯчейки(ИмяРаздела);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПоле(ВыбТабличныйДокумент, ИмяРаздела)
	
	Для Каждого ТекОбласть Из ВыбТабличныйДокумент.Области Цикл
			
		Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Не ТекОбласть.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка макета: раздел " + ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		ТекОбласть.Очистить();
		
	КонецЦикла;
	
	РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела);
	
КонецПроцедуры // ОчиститьТабличноеПоле()

&НаСервере
Процедура ЗаполнитьЗаголовки(ИмяРаздела = "")
	//#ЗаполнениеЗаголовков
	
	Если ИмяРаздела = "" Тогда
		мМассивРазделов = ЭтаФорма.РазделыОтчета.Выгрузить(, "ИмяРаздела").ВыгрузитьКолонку(0);
	Иначе
		мМассивРазделов = Новый Массив;
		мМассивРазделов.Добавить(ИмяРаздела);
	КонецЕсли;
	
	Для Каждого ТекИмяРаздела из мМассивРазделов Цикл
		Если ТекИмяРаздела = "Настройка"
			или ТекИмяРаздела = "Проверка"
			или ТекИмяРаздела = "ПроверкаПротоколОшибок"
			Тогда
			Продолжить;
		КонецЕсли;
		
		ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекИмяРаздела);
		
		// Настройки заполнения шапки: Текущий период
		Если НЕ ТекРаздел.Области.Найти("ТекущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
		КонецЕсли;
		
		// Настройки заполнения шапки: Предыдущий период
		Если НЕ ТекРаздел.Области.Найти("ПредыдущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ПредыдущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		КонецЕсли;
		
		// Настройки для заголовков периодов
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокНачалоПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокНачалоПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокКонецПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокКонецПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		// Настройки для титульного листа
		Если ТекИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
			Если НЕ ТекРаздел.Области.Найти("ТекущийПериод1") = Неопределено Тогда
				ТекРаздел.Области.ТекущийПериод1.Значение    = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
			Если НЕ СведенияОбОрганизации = Неопределено Тогда
			
				Если НЕ ТекРаздел.Области.Найти("Организация") = Неопределено Тогда
					ТекРаздел.Области.Организация.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
						СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
						СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				
				Если НЕ ТекРаздел.Области.Найти("ПочтовыйАдресОрганизации") = Неопределено Тогда
					ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдрес;
				КонецЕсли;	
			
			КонецЕсли; 
						
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#Область ОбщиеПроцедурыЗаполнения

&НаСервере
Функция ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь, стрДопПоля = "", стрГруппировка = "Счет")
	
	Если ТипЗнч(ВидыСубконто) = Тип("СписокЗначений") Тогда
		
		Если Развернутый Тогда
			КоличествоСубконто = ВидыСубконто.Количество();
			Для Ном = 1 По КоличествоСубконто Цикл
				стрДопПоля = стрДопПоля + Символы.ПС + "Субконто" + Ном + ",";
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СальдоОборот = "Оборот" Тогда
		
		ШаблонТекстаЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ))" + ?(ПустаяСтрока(КодКорреспондентскогоСчета), "", " И " + ВидСравненияКорсчета + ", &ВидыСубконтоКорСчета") + "
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|" + стрОтбор + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&грКонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + "
		|			И ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)), 
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|" + стрОтбор + "
		|ИТОГИ
		|	СУММА(СуммаОборотДт),
		|	СУММА(СуммаОборотКт)
		|ПО
		|	" + стрГруппировка;
		
	Иначе
		
		ШаблонТекстаЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			" + ?(СальдоОборот = "НаНачало", "&НачалоПериода", "&грКонецПериода") + ",
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ") КАК вэУправленческий" + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, "
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|		ПО вэУправленческий.Счет = СчетаСОборотнымСубконтоКонтрагенты.Счет", "") + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|" + стрОтбор + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, ?(стрОтбор = "", "ГДЕ", " И ") + "
		|			(НЕ СчетаСОборотнымСубконтоКонтрагенты.Счет ЕСТЬ NULL )
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вэУправленческий.Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			,
		|			" + ?(СальдоОборот = "НаНачало", "ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1)", "&КонецПериода") + ",
		|			,
		|			Счет В ИЕРАРХИИ (&СписокСчетов)
		|				И Счет В
		|					(ВЫБРАТЬ
		|						СчетаСОборотнымСубконтоКонтрагенты.Счет
		|					ИЗ
		|						СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			,
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|" + стрОтбор, "") + "
		|
		|ИТОГИ
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт),
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт)
		|ПО
		|	" + стрГруппировка;
	КонецЕсли;
	
	Возврат ШаблонТекстаЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, СальдоОборот, ЗаПериод, ТекРаздел, ВидыСубконто = Неопределено, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", стрТаблицаКурсовВалют = "КоэффициентыВалютПП", РезервПодОбесценение = ЛОЖЬ)
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если СальдоОборот = "НаНачало" Или СальдоОборот = "НаКонец" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто, Ложь, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	
	Если ЗаПериод = "ЗаПрошлыйПериод" Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", стрТаблицаКурсовВалют);
	КонецЕсли;
	
	Если ЭтаФорма.СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
		Запрос.УстановитьПараметр("НачалоПоследнегоКвартала", СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПоследнегоКвартала");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		
		ТекСчет = СтрокаСчета.Счет;
		
		ИмяСлагаемого     = СтрокаСчета.ИмяСлагаемого;
		ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
		ЗнакОперации      = СтрокаСчета.ЗнакОперации;
		ТекстРасшифровки  = СтрокаСчета.ТекстРасшифровки;
		
		ИмяЯчейки             = СтрокаСчета.ИмяЯчейки;
		СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		
		Если ТекстРасшифровки = "" Тогда
			СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(ТекСчет.Код), КодКорреспондентскогоСчета, ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета));
		Иначе
			СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		КонецЕсли;
			
		КонсолидированнаяОтчетность.СкорректироватьСлагаемоеНаименование_ОФР(Запрос, СлагаемоеНаименование);
		
		ТекСумма = 0;
		
		ВыборкаПоСчетам.Сбросить();
		ОтборСчета = Новый Структура("Счет", ТекСчет);
		Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
			//ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			//СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			// Вычтем из суммы корр.оборот, т.е. если берем оборот по Дт, то нужно из него вычесть оборот ко Кт. Если берем оборот по Кт, то нужно из него вычесть оборот по Дт.
			ИмяРеквизитаСуммыКорр = ?(ИмяРеквизитаСуммы = "СуммаОборотДт", "СуммаОборотКт", "СуммаОборотДт");
			ТекСуммаКорр = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммыКорр);
			ТекСумма = ТекСумма - ТекСуммаКорр;
			СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
		КонецЕсли;
		
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, СтрокаСчета.ИмяПоказателя, ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
		
	КонецЦикла;
		
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Если РезервПодОбесценение Тогда
		ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиПоследнийКвартал, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	чНачалоЦикла = 2;//?(Объект.ОтчетЗаПоследнийКвартал, 2, 1);
	Для НомерЦикла = чНачалоЦикла По 3 Цикл
		
		Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
		Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
			Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		КонецЕсли;
		
		Если НомерЦикла = 2 Тогда
			
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала;
				Запрос.УстановитьПараметр("НачалоПоследнегоКвартала", СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала);
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПоследнегоКвартала");
				
			Иначе
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			
			КонецЕсли;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
			
		ИначеЕсли НомерЦикла = 3 Тогда
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета;
				Запрос.УстановитьПараметр("НачалоПоследнегоКварталаПрошлогоПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета);
				ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПоследнегоКварталаПрошлогоПериодаОтчета");
				
			Иначе
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета;
				ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			
			КонецЕсли; 
			
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
			
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
					
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			Если ТекстРасшифровки = "" Тогда
				СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, лДата1, лДата2);
			Иначе
				СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(лДата1, лДата2, "ФП = Истина"));
			КонецЕсли;
			
			КонсолидированнаяОтчетность.СкорректироватьСлагаемоеНаименование_ОФР(Запрос, СлагаемоеНаименование);
			
			ТекСумма = 0;
			ТекСуммаРасшифровки = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
			
		КонецЦикла;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры  //ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиПоследнийКвартал, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	чНачалоЦикла = 2;//?(Объект.ОтчетЗаПоследнийКвартал, 2, 1);
	Для НомерЦикла = чНачалоЦикла По 3 Цикл
		
		Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
		Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
			Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		КонецЕсли;
		
		Если НомерЦикла = 2 Тогда
			
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала;
				Запрос.УстановитьПараметр("НачалоПоследнегоКвартала", СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала);
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПоследнегоКвартала");
				
			Иначе
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			
			КонецЕсли;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		ИначеЕсли НомерЦикла = 3 Тогда
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета;
				Запрос.УстановитьПараметр("НачалоПоследнегоКварталаПрошлогоПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета);
				ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПоследнегоКварталаПрошлогоПериодаОтчета");
				
			Иначе
				
				лДата1 = СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета;
				ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			
			КонецЕсли; 
			
			лДата2 = СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета;
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		ТекстСравненияПоСубконтоПредставление = "";
		СравнениеИтогаСНулем = "";
		КонсолидированнаяОтчетность.ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, мТаблицаСчетов, ТекстСравненияПоСубконтоПредставление, СравнениеИтогаСНулем, стрОтборВирт);
		
		стрВсеСчета = "";
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			стрВсеСчета = стрВсеСчета + ?(стрВсеСчета = "", "", ", ") + СтрокаСчета.Счет;
		КонецЦикла;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ИтогСумма = 0;
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
					
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			//Если НомерЦикла = 1 или СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
			//	// Для первой колонки и признака ОтчетЗаПоследнийКвартал всегда "Оборот"
			//	ИмяРеквизитаСуммы = "СуммаОборот" + Прав(ИмяРеквизитаСуммы, 2);
			//	ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, "Сальдо на конец периода", "Оборот за период");
			//	ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, "Сальдо на начало периода", "Оборот за период");
			//	
			//	// КешТаблицаМэппингаДляПрошлогоПериода+++
			//ИначеЕсли НомерЦикла = 3 Тогда
			//	//!!!!!!УПЦБ_ЗащищенныйМодуль.ЗаменитьСчетаПрошлогоПериодаПоМэппингуВРасшифровке(ТекстРасшифровки, Адрес_КешТаблицаМэппингаДляПрошлогоПериода);
			//	// КешТаблицаМэппингаДляПрошлогоПериода---
			//	
			//КонецЕсли;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			ТекСумма = 0;
			ТекСуммаРасшифровки = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				
				// +++
				//Если НомерЦикла = 1 или Объект.ОтчетЗаПоследнийКвартал Тогда  
					// Вычтем из суммы корр.оборот, т.е. если берем оборот по Дт, то нужно из него вычесть оборот ко Кт. Если берем оборот по Кт, то нужно из него вычесть оборот по Дт.
					//ИмяРеквизитаСуммыКорр = ?(ИмяРеквизитаСуммы = "СуммаОборотДт", "СуммаОборотКт", "СуммаОборотДт");
					//ТекСуммаКорр = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммыКорр);
					//ТекСумма = ТекСумма - ТекСуммаКорр;
				//КонецЕсли;
				// ---
				
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			ИтогСумма = ИтогСумма + ТекСумма;
			
		КонецЦикла;
			
		// Обнулим сумму, если она не подходит под условие СравнениеИтогаСНулем.
		Если СравнениеИтогаСНулем = "Больше" и ИтогСумма < 0 Тогда
			ИтогСумма = 0;
		ИначеЕсли СравнениеИтогаСНулем = "Меньше" и ИтогСумма > 0 Тогда
			ИтогСумма = 0;
		КонецЕсли;
		
		СлагаемоеНаименование = "Все субконто у которых " + ТекстСравненияПоСубконтоПредставление + " итог по счетам: " + стрВсеСчета;
		
		Если Запрос.Параметры.Свойство("мВидыДоходовРасходовНФО") Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мВидыДоходовРасходовНФО Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", ", ") + эл;
			КонецЦикла;
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор по ОФР " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("мУПЦБКлассификация") Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мУПЦБКлассификация Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если НЕ СтрокаСчета = Неопределено Тогда
			ЗнакОперации = "+";
			ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ИтогСумма, стрВсеСчета, , , , ИмяРаздела);
		КонецЕсли;
			
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			// Значение ячейки выставляем по итогу
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, ИтогСумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры  //ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды

&НаСервере
Процедура УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ СчетаСОборотнымСубконтоКонтрагенты ИЗ &ТаблицаСчетовСОбСубконто КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютТП ИЗ &КоэффициентыВалютТП КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютПП ИЗ &КоэффициентыВалютПП КАК ТЗ";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетПоКоду(Счета, флСообщитьОНеНайденномСчете = Истина)
	
	Если ТипЗнч(Счета) <> Тип("Строка") Тогда
		Возврат Неопределено;
	Иначе
		
		ПланСчетов = ПланыСчетов.Единый;
		
		СписокСчетов = Новый СписокЗначений;
		
		Счета = СтрЗаменить(Счета, " ", "");
		Счета = СтрЗаменить(Счета, ",", Символы.ПС);
		
		Для НомерСтроки = 1 По СтрЧислоСтрок(Счета) Цикл
			
			КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			СчетСсылка = ПланыСчетов.Единый.НайтиПоКоду(КодСчета);
			Если ЗначениеЗаполнено(СчетСсылка) Тогда
			
				СписокСчетов.Добавить(СчетСсылка);
			
			КонецЕсли; 
			//КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			////СчетСсылка = ПланСчетов.НайтиОсновнойПоКоду(КодСчета);
			//мСчета = УПЦБ_ЗащищенныйМодуль.НайтиОсновнойПоКоду(КодСчета, Адрес_КешТаблицаДляПоискаСчетов, Объект.РегистрБухгалтерии);
			//Если мСчета.Количество() = 0 Тогда
			//	
			//	Если флСообщитьОНеНайденномСчете Тогда
			//		
			//		ТекстСообщения = СтрШаблон(
			//		НСтр("ru = 'Не удалось определить счет по коду «%1». Данные по этому счету не попадут в отчет.'"),
			//		КодСчета);
			//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//		
			//	КонецЕсли;
			//	
			//Иначе
			//	Для Каждого СчетСсылка из мСчета Цикл
			//		СписокСчетов.Добавить(СчетСсылка);
			//	КонецЦикла;
			//КонецЕсли;
			
		КонецЦикла;
		
		Возврат СписокСчетов;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы)
	
	СуммаПоСчету = 0;
	
	Если Найти(ИмяРеквизитаСуммы, "Остаток") > 0 И Найти(ИмяРеквизитаСуммы, "Развернутый") = 0 Тогда
		Если ТекСчет.Вид = ВидСчета.АктивноПассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
				Если СуммаОборотПоСчету > 0 Тогда
					СуммаПоСчету = СуммаОборотПоСчету;
				КонецЕсли;
			ИначеЕсли Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы];
				Если СуммаОборотПоСчету < 0 Тогда
					СуммаПоСчету = -СуммаОборотПоСчету;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Активный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Пассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаПоСчету = -(ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы]);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы];
	КонецЕсли;
	
	Возврат СуммаПоСчету;
	
КонецФункции

&НаСервере
Процедура ДобавитьСчетВТаблицуСчетов(ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, КодСчета, ТекстРасшифровки = "", ИмяРеквизитаСуммы = "")
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = ПолучитьСчетПоКоду(КодСчета);
	
	Если СписокСчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокСчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого эл_СписокСчетов из СписокСчетов Цикл
		
		НоваяСтрокаСчета = мТаблицаСчетов.Добавить();
		НоваяСтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		НоваяСтрокаСчета.ИмяПоказателя = ИмяПоказателя;
		НоваяСтрокаСчета.Счет = эл_СписокСчетов.Значение;
		НоваяСтрокаСчета.ЗнакОперации = ЗнакОперации;
		НоваяСтрокаСчета.ИмяСлагаемого = ИмяСлагаемого;
		НоваяСтрокаСчета.ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, КодСчета, эл_СписокСчетов.Значение);
		Если ИмяРеквизитаСуммы <> "" Тогда
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ИмяРеквизитаСуммы;
		Иначе
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода)
	
	Возврат КонсолидированнаяОтчетность.НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода);
	
КонецФункции

&НаСервере
Функция ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого)
	
	Возврат КонсолидированнаяОтчетность.ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет = Неопределено, КорСчет = Неопределено, Сдвиг = Неопределено, ПраваяГраница = Неопределено, Раздел = Неопределено)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	СтруктураПолей = Новый Структура("СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел",
	СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел);
	
	КонсолидированнаяОтчетность.ДобавитьСтрокуВРасшифровку(ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СтруктураПолей);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПоказателя(ТабДокумент, ИмяЯчейки, Знач ЗначениеЯчейки)
	
	Попытка
		Если ТипЗнч(ЗначениеЯчейки) <> Тип("Число") И ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
			ЗначениеЯчейки = Строка(ЗначениеЯчейки);
			Если СтрНайти(ТабДокумент.Области[ИмяЯчейки].Значение, ЗначениеЯчейки) = 0 И ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = ", " + ЗначениеЯчейки;
			ИначеЕсли ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = "";
			КонецЕсли;
		КонецЕсли; 
		ТабДокумент.Области[ИмяЯчейки].Значение = ТабДокумент.Области[ИмяЯчейки].Значение + ?(ЗначениеЯчейки = Null, 0,ЗначениеЯчейки);
	Исключение
		ТекстСообщения = "Ошибка заполнения раздела: " + мИмяЗаполняемогоРаздела + " не найдена ячейка " + ИмяЯчейки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьВременныеТаблицыДокумента()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВалютаДокумента"          	, СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("НачалоПериода"            	, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода"             	, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("НачалоПредыдущегоПериода" 	, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода"  	, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("грКонецПериода"           	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("грКонецПредыдущегоПериода"	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, СтруктураРеквизитовФормы.Организация);

	ЗапрашиваемыеТаблицы = Новый СписокЗначений;
	ЗапрашиваемыеТаблицы.Добавить("КоэффициентыВалют");
	ЗапрашиваемыеТаблицы.Добавить("КурсыВалютНаКонец");
	ЗапрашиваемыеТаблицы.Добавить("ТаблицаСчетовСОбСубконто");
	ЗапрашиваемыеТаблицы.Добавить("ФинансовыеОрганизации");
	
	ВременныеТаблицы = КонсолидированнаяОтчетность.ПодготовитьВременныеТаблицыДокумента(Запрос, ЗапрашиваемыеТаблицы);
	
	Для Каждого ЭлементСтруктуры из ВременныеТаблицы Цикл 
		Запрос.УстановитьПараметр(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Если ВременныеТаблицы.Свойство("ДатаПеречняТП") Тогда 
		ЭтаФорма.Комментарий = "При построении отчета использован перечень организаций финансового сектора по состоянию на " + Формат(ВременныеТаблицы.ДатаПеречняТП, "ДФ=dd.MM.yyyy");
	КонецЕсли;		
	
	Возврат Запрос;
		
КонецФункции

#КонецОбласти 

#Область ПроцедурыЗаполненияРазделов

&НаСервере
Процедура ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов)
	
	Если Адрес_КешТаблицаДляСчетовОбесценение = "" Тогда
		мКешТаблицаДляСчетовОбесценение = Новый ТаблицаЗначений;
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Строка");
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Счет");
	Иначе
		мКешТаблицаДляСчетовОбесценение = ПолучитьИзВременногоХранилища(Адрес_КешТаблицаДляСчетовОбесценение);
	КонецЕсли;
	
	Для Каждого стр_мТаблицаСчетов из мТаблицаСчетов Цикл
		стр_мКешТаблицаДляСчетовОбесценение = мКешТаблицаДляСчетовОбесценение.Добавить();
		стр_мКешТаблицаДляСчетовОбесценение.Строка = Лев(стр_мТаблицаСчетов.ИмяЯчейки, 3);
		стр_мКешТаблицаДляСчетовОбесценение.Счет = стр_мТаблицаСчетов.Счет; 
	КонецЦикла;
	
	Адрес_КешТаблицаДляСчетовОбесценение = ПоместитьВоВременноеХранилище(мКешТаблицаДляСчетовОбесценение, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ДоходыЗаВычетомРасходовСервер(ТекРаздел, ИмяРаздела, ЗаПериод = "ЗаТекущийПериод")
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("36101");
	мВидыДоходовРасходовНФО.Добавить("36102");
	мВидыДоходовРасходовНФО.Добавить("36103");
	мВидыДоходовРасходовНФО.Добавить("36104");
	мВидыДоходовРасходовНФО.Добавить("36105");
	мВидыДоходовРасходовНФО.Добавить("36201");
	мВидыДоходовРасходовНФО.Добавить("36202");
	мВидыДоходовРасходовНФО.Добавить("36203");
	мВидыДоходовРасходовНФО.Добавить("36204");
	мВидыДоходовРасходовНФО.Добавить("36205");
	мВидыДоходовРасходовНФО.Добавить("36301");
	мВидыДоходовРасходовНФО.Добавить("36302");
	мВидыДоходовРасходовНФО.Добавить("36303");
	мВидыДоходовРасходовНФО.Добавить("36304");
	мВидыДоходовРасходовНФО.Добавить("36305");
	мВидыДоходовРасходовНФО.Добавить("36401");
	мВидыДоходовРасходовНФО.Добавить("36402");
	мВидыДоходовРасходовНФО.Добавить("36403");
	мВидыДоходовРасходовНФО.Добавить("36404");
	мВидыДоходовРасходовНФО.Добавить("36405");
	мВидыДоходовРасходовНФО.Добавить("36501");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0402", "производные финансовые инструменты", "+", "!КО", "71509", "Оборот за период #Период# по кредету счета 71509");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("46101");
	мВидыДоходовРасходовНФО.Добавить("46102");
	мВидыДоходовРасходовНФО.Добавить("46103");
	мВидыДоходовРасходовНФО.Добавить("46104");
	мВидыДоходовРасходовНФО.Добавить("46105");
	мВидыДоходовРасходовНФО.Добавить("46201");
	мВидыДоходовРасходовНФО.Добавить("46202");
	мВидыДоходовРасходовНФО.Добавить("46203");
	мВидыДоходовРасходовНФО.Добавить("46204");
	мВидыДоходовРасходовНФО.Добавить("46205");
	мВидыДоходовРасходовНФО.Добавить("46301");
	мВидыДоходовРасходовНФО.Добавить("46302");
	мВидыДоходовРасходовНФО.Добавить("46303");
	мВидыДоходовРасходовНФО.Добавить("46304");
	мВидыДоходовРасходовНФО.Добавить("46305");
	мВидыДоходовРасходовНФО.Добавить("46401");
	мВидыДоходовРасходовНФО.Добавить("46402");
	мВидыДоходовРасходовНФО.Добавить("46403");
	мВидыДоходовРасходовНФО.Добавить("46404");
	мВидыДоходовРасходовНФО.Добавить("46405");
	мВидыДоходовРасходовНФО.Добавить("46501");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0402", "производные финансовые инструменты", "-", "!ДО", "71510", "Оборот за период #Период# по дебету счета 71510");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("36101");
	мВидыДоходовРасходовНФО.Добавить("36102");
	мВидыДоходовРасходовНФО.Добавить("36103");
	мВидыДоходовРасходовНФО.Добавить("36104");
	мВидыДоходовРасходовНФО.Добавить("36105");
	мВидыДоходовРасходовНФО.Добавить("36201");
	мВидыДоходовРасходовНФО.Добавить("36202");
	мВидыДоходовРасходовНФО.Добавить("36203");
	мВидыДоходовРасходовНФО.Добавить("36204");
	мВидыДоходовРасходовНФО.Добавить("36205");
	мВидыДоходовРасходовНФО.Добавить("36301");
	мВидыДоходовРасходовНФО.Добавить("36302");
	мВидыДоходовРасходовНФО.Добавить("36303");
	мВидыДоходовРасходовНФО.Добавить("36304");
	мВидыДоходовРасходовНФО.Добавить("36305");
	мВидыДоходовРасходовНФО.Добавить("36401");
	мВидыДоходовРасходовНФО.Добавить("36402");
	мВидыДоходовРасходовНФО.Добавить("36403");
	мВидыДоходовРасходовНФО.Добавить("36404");
	мВидыДоходовРасходовНФО.Добавить("36405");
	мВидыДоходовРасходовНФО.Добавить("36501");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0403", "производные финансовые инструменты", "+", "!КО", "71509", "Оборот за период #Период# по кредету счета 71509");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("46101");
	мВидыДоходовРасходовНФО.Добавить("46102");
	мВидыДоходовРасходовНФО.Добавить("46103");
	мВидыДоходовРасходовНФО.Добавить("46104");
	мВидыДоходовРасходовНФО.Добавить("46105");
	мВидыДоходовРасходовНФО.Добавить("46201");
	мВидыДоходовРасходовНФО.Добавить("46202");
	мВидыДоходовРасходовНФО.Добавить("46203");
	мВидыДоходовРасходовНФО.Добавить("46204");
	мВидыДоходовРасходовНФО.Добавить("46205");
	мВидыДоходовРасходовНФО.Добавить("46301");
	мВидыДоходовРасходовНФО.Добавить("46302");
	мВидыДоходовРасходовНФО.Добавить("46303");
	мВидыДоходовРасходовНФО.Добавить("46304");
	мВидыДоходовРасходовНФО.Добавить("46305");
	мВидыДоходовРасходовНФО.Добавить("46401");
	мВидыДоходовРасходовНФО.Добавить("46402");
	мВидыДоходовРасходовНФО.Добавить("46403");
	мВидыДоходовРасходовНФО.Добавить("46404");
	мВидыДоходовРасходовНФО.Добавить("46405");
	мВидыДоходовРасходовНФО.Добавить("46501");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0403", "производные финансовые инструменты", "-", "!ДО", "71510", "Оборот за период #Период# по дебету счета 71510");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("33101");
	мВидыДоходовРасходовНФО.Добавить("33102");
	мВидыДоходовРасходовНФО.Добавить("33103");
	мВидыДоходовРасходовНФО.Добавить("33104");
	мВидыДоходовРасходовНФО.Добавить("33105");
	мВидыДоходовРасходовНФО.Добавить("33106");
	мВидыДоходовРасходовНФО.Добавить("33107");
	мВидыДоходовРасходовНФО.Добавить("33108");
	мВидыДоходовРасходовНФО.Добавить("33109");
	мВидыДоходовРасходовНФО.Добавить("33110");
	мВидыДоходовРасходовНФО.Добавить("33111");
	мВидыДоходовРасходовНФО.Добавить("33112");
	мВидыДоходовРасходовНФО.Добавить("33113");
	мВидыДоходовРасходовНФО.Добавить("33114");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0202", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "+", "!КО", "71503", "Оборот за период #Период# по кредету счета 71503");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("42101");
	мВидыДоходовРасходовНФО.Добавить("42102");
	мВидыДоходовРасходовНФО.Добавить("42103");
	мВидыДоходовРасходовНФО.Добавить("42104");
	мВидыДоходовРасходовНФО.Добавить("42105");
	мВидыДоходовРасходовНФО.Добавить("42106");
	мВидыДоходовРасходовНФО.Добавить("42107");
	мВидыДоходовРасходовНФО.Добавить("42108");
	мВидыДоходовРасходовНФО.Добавить("42109");
	мВидыДоходовРасходовНФО.Добавить("42110");
	мВидыДоходовРасходовНФО.Добавить("42111");
	мВидыДоходовРасходовНФО.Добавить("42112");
	мВидыДоходовРасходовНФО.Добавить("42113");
	мВидыДоходовРасходовНФО.Добавить("42114");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0202", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "-", "!ДО", "71504", "Оборот за период #Период# по дебету счета 71504");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("34101");
	мВидыДоходовРасходовНФО.Добавить("34102");
	мВидыДоходовРасходовНФО.Добавить("34103");
	мВидыДоходовРасходовНФО.Добавить("34104");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0202", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "+", "!КО", "71505", "Оборот за период #Период# по кредету счета 71505");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("43101");
	мВидыДоходовРасходовНФО.Добавить("43102");
	мВидыДоходовРасходовНФО.Добавить("43103");
	мВидыДоходовРасходовНФО.Добавить("43104");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0202", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "-", "!ДО", "71506", "Оборот за период #Период# по дебету счета 71506");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "50622,50623,50627,50628,30602,50905,61210");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("33201");
	мВидыДоходовРасходовНФО.Добавить("33202");
	мВидыДоходовРасходовНФО.Добавить("33203");
	мВидыДоходовРасходовНФО.Добавить("33204");
	мВидыДоходовРасходовНФО.Добавить("33205");
	мВидыДоходовРасходовНФО.Добавить("33206");
	мВидыДоходовРасходовНФО.Добавить("33207");
	мВидыДоходовРасходовНФО.Добавить("33208");
	мВидыДоходовРасходовНФО.Добавить("33209");
	мВидыДоходовРасходовНФО.Добавить("33210");
	мВидыДоходовРасходовНФО.Добавить("33211");
	мВидыДоходовРасходовНФО.Добавить("33212");
	мВидыДоходовРасходовНФО.Добавить("33213");
	мВидыДоходовРасходовНФО.Добавить("33214");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0203", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "+", "!КО", "71503", "Оборот за период #Период# по кредету счета 71503");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("42201");
	мВидыДоходовРасходовНФО.Добавить("42202");
	мВидыДоходовРасходовНФО.Добавить("42203");
	мВидыДоходовРасходовНФО.Добавить("42204");
	мВидыДоходовРасходовНФО.Добавить("42205");
	мВидыДоходовРасходовНФО.Добавить("42206");
	мВидыДоходовРасходовНФО.Добавить("42207");
	мВидыДоходовРасходовНФО.Добавить("42208");
	мВидыДоходовРасходовНФО.Добавить("42209");
	мВидыДоходовРасходовНФО.Добавить("42210");
	мВидыДоходовРасходовНФО.Добавить("42211");
	мВидыДоходовРасходовНФО.Добавить("42212");
	мВидыДоходовРасходовНФО.Добавить("42213");
	мВидыДоходовРасходовНФО.Добавить("42214");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0203", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "-", "!ДО", "71504", "Оборот за период #Период# по дебету счета 71504");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("34201");
	мВидыДоходовРасходовНФО.Добавить("34202");
	мВидыДоходовРасходовНФО.Добавить("34203");
	мВидыДоходовРасходовНФО.Добавить("34204");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0203", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "+", "!КО", "71505", "Оборот за период #Период# по кредету счета 71505");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("43201");
	мВидыДоходовРасходовНФО.Добавить("43202");
	мВидыДоходовРасходовНФО.Добавить("43203");
	мВидыДоходовРасходовНФО.Добавить("43204");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0203", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "-", "!ДО", "71506", "Оборот за период #Период# по дебету счета 71506");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("33601");
	мВидыДоходовРасходовНФО.Добавить("33602");
	мВидыДоходовРасходовНФО.Добавить("33603");
	мВидыДоходовРасходовНФО.Добавить("33604");
	мВидыДоходовРасходовНФО.Добавить("33605");
	мВидыДоходовРасходовНФО.Добавить("33606");
	мВидыДоходовРасходовНФО.Добавить("33607");
	мВидыДоходовРасходовНФО.Добавить("33629");
	мВидыДоходовРасходовНФО.Добавить("33630");
	мВидыДоходовРасходовНФО.Добавить("33631");
	мВидыДоходовРасходовНФО.Добавить("33632");
	мВидыДоходовРасходовНФО.Добавить("33633");
	мВидыДоходовРасходовНФО.Добавить("33634");
	мВидыДоходовРасходовНФО.Добавить("33635");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0204", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "+", "!КО", "71503", "Оборот за период #Период# по кредету счета 71503");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("42601");
	мВидыДоходовРасходовНФО.Добавить("42602");
	мВидыДоходовРасходовНФО.Добавить("42603");
	мВидыДоходовРасходовНФО.Добавить("42604");
	мВидыДоходовРасходовНФО.Добавить("42605");
	мВидыДоходовРасходовНФО.Добавить("42606");
	мВидыДоходовРасходовНФО.Добавить("42607");
	мВидыДоходовРасходовНФО.Добавить("42629");
	мВидыДоходовРасходовНФО.Добавить("42630");
	мВидыДоходовРасходовНФО.Добавить("42631");
	мВидыДоходовРасходовНФО.Добавить("42632");
	мВидыДоходовРасходовНФО.Добавить("42633");
	мВидыДоходовРасходовНФО.Добавить("42634");
	мВидыДоходовРасходовНФО.Добавить("42635");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0204", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "-", "!ДО", "71504", "Оборот за период #Период# по дебету счета 71504");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("34901");
	мВидыДоходовРасходовНФО.Добавить("34902");
	мВидыДоходовРасходовНФО.Добавить("34903");
	мВидыДоходовРасходовНФО.Добавить("34904");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0204", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "+", "!КО", "71505", "Оборот за период #Период# по кредету счета 71505");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("43501");
	мВидыДоходовРасходовНФО.Добавить("43502");
	мВидыДоходовРасходовНФО.Добавить("43503");
	мВидыДоходовРасходовНФО.Добавить("43504");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0204", "ценные бумаги, классифицированные как оцениваемые по справедливой стоимости, изменение которой отражается в составе прибыли или убытка, при первоначальном признании", "-", "!ДО", "71506", "Оборот за период #Период# по дебету счета 71506");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52101");
	мВидыДоходовРасходовНФО.Добавить("52103");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0902", "финансовые обязательства, предназначенные для торговли", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53201");
	мВидыДоходовРасходовНФО.Добавить("53203");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0902", "финансовые обязательства, предназначенные для торговли", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52101");
	мВидыДоходовРасходовНФО.Добавить("52103");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0903", "финансовые обязательства, предназначенные для торговли", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53201");
	мВидыДоходовРасходовНФО.Добавить("53203");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0903", "финансовые обязательства, предназначенные для торговли", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("36101");
	мВидыДоходовРасходовНФО.Добавить("36102");
	мВидыДоходовРасходовНФО.Добавить("36103");
	мВидыДоходовРасходовНФО.Добавить("36104");
	мВидыДоходовРасходовНФО.Добавить("36105");
	мВидыДоходовРасходовНФО.Добавить("36201");
	мВидыДоходовРасходовНФО.Добавить("36202");
	мВидыДоходовРасходовНФО.Добавить("36203");
	мВидыДоходовРасходовНФО.Добавить("36204");
	мВидыДоходовРасходовНФО.Добавить("36205");
	мВидыДоходовРасходовНФО.Добавить("36301");
	мВидыДоходовРасходовНФО.Добавить("36302");
	мВидыДоходовРасходовНФО.Добавить("36303");
	мВидыДоходовРасходовНФО.Добавить("36304");
	мВидыДоходовРасходовНФО.Добавить("36305");
	мВидыДоходовРасходовНФО.Добавить("36401");
	мВидыДоходовРасходовНФО.Добавить("36402");
	мВидыДоходовРасходовНФО.Добавить("36403");
	мВидыДоходовРасходовНФО.Добавить("36404");
	мВидыДоходовРасходовНФО.Добавить("36405");
	мВидыДоходовРасходовНФО.Добавить("36501");
	мВидыДоходовРасходовНФО.Добавить("14201");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0802", "производные финансовые инструменты", "+", "!КО", "71509", "Оборот за период #Период# по кредету счета 71509");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("46101");
	мВидыДоходовРасходовНФО.Добавить("46102");
	мВидыДоходовРасходовНФО.Добавить("46103");
	мВидыДоходовРасходовНФО.Добавить("46104");
	мВидыДоходовРасходовНФО.Добавить("46105");
	мВидыДоходовРасходовНФО.Добавить("46201");
	мВидыДоходовРасходовНФО.Добавить("46202");
	мВидыДоходовРасходовНФО.Добавить("46203");
	мВидыДоходовРасходовНФО.Добавить("46204");
	мВидыДоходовРасходовНФО.Добавить("46205");
	мВидыДоходовРасходовНФО.Добавить("46301");
	мВидыДоходовРасходовНФО.Добавить("46302");
	мВидыДоходовРасходовНФО.Добавить("46303");
	мВидыДоходовРасходовНФО.Добавить("46304");
	мВидыДоходовРасходовНФО.Добавить("46305");
	мВидыДоходовРасходовНФО.Добавить("46401");
	мВидыДоходовРасходовНФО.Добавить("46402");
	мВидыДоходовРасходовНФО.Добавить("46403");
	мВидыДоходовРасходовНФО.Добавить("46404");
	мВидыДоходовРасходовНФО.Добавить("46405");
	мВидыДоходовРасходовНФО.Добавить("46501");
	мВидыДоходовРасходовНФО.Добавить("24301");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0802", "производные финансовые инструменты", "-", "!ДО", "71510", "Оборот за период #Период# по дебету счета 71510");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("36101");
	мВидыДоходовРасходовНФО.Добавить("36102");
	мВидыДоходовРасходовНФО.Добавить("36103");
	мВидыДоходовРасходовНФО.Добавить("36104");
	мВидыДоходовРасходовНФО.Добавить("36105");
	мВидыДоходовРасходовНФО.Добавить("36201");
	мВидыДоходовРасходовНФО.Добавить("36202");
	мВидыДоходовРасходовНФО.Добавить("36203");
	мВидыДоходовРасходовНФО.Добавить("36204");
	мВидыДоходовРасходовНФО.Добавить("36205");
	мВидыДоходовРасходовНФО.Добавить("36301");
	мВидыДоходовРасходовНФО.Добавить("36302");
	мВидыДоходовРасходовНФО.Добавить("36303");
	мВидыДоходовРасходовНФО.Добавить("36304");
	мВидыДоходовРасходовНФО.Добавить("36305");
	мВидыДоходовРасходовНФО.Добавить("36401");
	мВидыДоходовРасходовНФО.Добавить("36402");
	мВидыДоходовРасходовНФО.Добавить("36403");
	мВидыДоходовРасходовНФО.Добавить("36404");
	мВидыДоходовРасходовНФО.Добавить("36405");
	мВидыДоходовРасходовНФО.Добавить("36501");
	мВидыДоходовРасходовНФО.Добавить("14201");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0803", "производные финансовые инструменты", "+", "!КО", "71509", "Оборот за период #Период# по кредету счета 71509");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("46101");
	мВидыДоходовРасходовНФО.Добавить("46102");
	мВидыДоходовРасходовНФО.Добавить("46103");
	мВидыДоходовРасходовНФО.Добавить("46104");
	мВидыДоходовРасходовНФО.Добавить("46105");
	мВидыДоходовРасходовНФО.Добавить("46201");
	мВидыДоходовРасходовНФО.Добавить("46202");
	мВидыДоходовРасходовНФО.Добавить("46203");
	мВидыДоходовРасходовНФО.Добавить("46204");
	мВидыДоходовРасходовНФО.Добавить("46205");
	мВидыДоходовРасходовНФО.Добавить("46301");
	мВидыДоходовРасходовНФО.Добавить("46302");
	мВидыДоходовРасходовНФО.Добавить("46303");
	мВидыДоходовРасходовНФО.Добавить("46304");
	мВидыДоходовРасходовНФО.Добавить("46305");
	мВидыДоходовРасходовНФО.Добавить("46401");
	мВидыДоходовРасходовНФО.Добавить("46402");
	мВидыДоходовРасходовНФО.Добавить("46403");
	мВидыДоходовРасходовНФО.Добавить("46404");
	мВидыДоходовРасходовНФО.Добавить("46405");
	мВидыДоходовРасходовНФО.Добавить("46501");
	мВидыДоходовРасходовНФО.Добавить("24301");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0803", "производные финансовые инструменты", "-", "!ДО", "71510", "Оборот за период #Период# по дебету счета 71510");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("36101");
	мВидыДоходовРасходовНФО.Добавить("36102");
	мВидыДоходовРасходовНФО.Добавить("36103");
	мВидыДоходовРасходовНФО.Добавить("36104");
	мВидыДоходовРасходовНФО.Добавить("36105");
	мВидыДоходовРасходовНФО.Добавить("36201");
	мВидыДоходовРасходовНФО.Добавить("36202");
	мВидыДоходовРасходовНФО.Добавить("36203");
	мВидыДоходовРасходовНФО.Добавить("36204");
	мВидыДоходовРасходовНФО.Добавить("36205");
	мВидыДоходовРасходовНФО.Добавить("36301");
	мВидыДоходовРасходовНФО.Добавить("36302");
	мВидыДоходовРасходовНФО.Добавить("36303");
	мВидыДоходовРасходовНФО.Добавить("36304");
	мВидыДоходовРасходовНФО.Добавить("36305");
	мВидыДоходовРасходовНФО.Добавить("36401");
	мВидыДоходовРасходовНФО.Добавить("36402");
	мВидыДоходовРасходовНФО.Добавить("36403");
	мВидыДоходовРасходовНФО.Добавить("36404");
	мВидыДоходовРасходовНФО.Добавить("36405");
	мВидыДоходовРасходовНФО.Добавить("36501");
	мВидыДоходовРасходовНФО.Добавить("14201");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0803", "производные финансовые инструменты", "+", "!КО", "71509", "Оборот за период #Период# по кредету счета 71509");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("46101");
	мВидыДоходовРасходовНФО.Добавить("46102");
	мВидыДоходовРасходовНФО.Добавить("46103");
	мВидыДоходовРасходовНФО.Добавить("46104");
	мВидыДоходовРасходовНФО.Добавить("46105");
	мВидыДоходовРасходовНФО.Добавить("46201");
	мВидыДоходовРасходовНФО.Добавить("46202");
	мВидыДоходовРасходовНФО.Добавить("46203");
	мВидыДоходовРасходовНФО.Добавить("46204");
	мВидыДоходовРасходовНФО.Добавить("46205");
	мВидыДоходовРасходовНФО.Добавить("46301");
	мВидыДоходовРасходовНФО.Добавить("46302");
	мВидыДоходовРасходовНФО.Добавить("46303");
	мВидыДоходовРасходовНФО.Добавить("46304");
	мВидыДоходовРасходовНФО.Добавить("46305");
	мВидыДоходовРасходовНФО.Добавить("46401");
	мВидыДоходовРасходовНФО.Добавить("46402");
	мВидыДоходовРасходовНФО.Добавить("46403");
	мВидыДоходовРасходовНФО.Добавить("46404");
	мВидыДоходовРасходовНФО.Добавить("46405");
	мВидыДоходовРасходовНФО.Добавить("46501");
	мВидыДоходовРасходовНФО.Добавить("24301");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П0803", "производные финансовые инструменты", "-", "!ДО", "71510", "Оборот за период #Период# по дебету счета 71510");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	//мТаблицаСчетов.Очистить();
	//мВидыДоходовРасходовНФО = Новый Массив;
	//мВидыДоходовРасходовНФО.Добавить("52101");
	//мВидыДоходовРасходовНФО.Добавить("52103");
	//Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	//ДобавитьСчетВТаблицуСчетов("П0803", "финансовые обязательства, классифицированные как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701");
	//ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	//
	//мТаблицаСчетов.Очистить();
	//мВидыДоходовРасходовНФО = Новый Массив;
	//мВидыДоходовРасходовНФО.Добавить("53201");
	//мВидыДоходовРасходовНФО.Добавить("53203");
	//Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	//ДобавитьСчетВТаблицуСчетов("П0803", "финансовые обязательства, классифицированные как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702");
	//ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", ЗаПериод, ТекРаздел, , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ПроцентныеДоходыСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31126");
	мВидыДоходовРасходовНФО.Добавить("31127");
	мВидыДоходовРасходовНФО.Добавить("31128");
	мВидыДоходовРасходовНФО.Добавить("31129");
	мВидыДоходовРасходовНФО.Добавить("31130");
	мВидыДоходовРасходовНФО.Добавить("31131");
	мВидыДоходовРасходовНФО.Добавить("31132");
	мВидыДоходовРасходовНФО.Добавить("31154");
	мВидыДоходовРасходовНФО.Добавить("31155");
	мВидыДоходовРасходовНФО.Добавить("31156");
	мВидыДоходовРасходовНФО.Добавить("31157");
	мВидыДоходовРасходовНФО.Добавить("31158");
	мВидыДоходовРасходовНФО.Добавить("31159");
	мВидыДоходовРасходовНФО.Добавить("31160");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "по финансовым активам, оцениваемым по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка", "+", "!КО", "71001", "Оборот за период #Период# по кредету счета 71001 по ОФР 31126, 31127, 31128, 31129, 31130, 31131, 31132, 31154, 31155, 31156, 31157, 31158, 31159, 31160");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31326");
	мВидыДоходовРасходовНФО.Добавить("31327");
	мВидыДоходовРасходовНФО.Добавить("31328");
	мВидыДоходовРасходовНФО.Добавить("31329");
	мВидыДоходовРасходовНФО.Добавить("31330");
	мВидыДоходовРасходовНФО.Добавить("31331");
	мВидыДоходовРасходовНФО.Добавить("31332");
	мВидыДоходовРасходовНФО.Добавить("31354");
	мВидыДоходовРасходовНФО.Добавить("31355");
	мВидыДоходовРасходовНФО.Добавить("31356");
	мВидыДоходовРасходовНФО.Добавить("31357");
	мВидыДоходовРасходовНФО.Добавить("31358");
	мВидыДоходовРасходовНФО.Добавить("31359");
	мВидыДоходовРасходовНФО.Добавить("31360");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "по финансовым активам, оцениваемым по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка", "-", "!ДО", "71003", "Оборот за период #Период# по дебету счета 71003 по ОФР 31326, 31327, 31328, 31329, 31330, 31331, 31332, 31354, 31355, 31356, 31357, 31358, 31359, 31360");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31416");
	мВидыДоходовРасходовНФО.Добавить("31417");
	мВидыДоходовРасходовНФО.Добавить("31419");
	мВидыДоходовРасходовНФО.Добавить("31420");
	мВидыДоходовРасходовНФО.Добавить("31421");
	мВидыДоходовРасходовНФО.Добавить("31422");
	мВидыДоходовРасходовНФО.Добавить("31423");
	мВидыДоходовРасходовНФО.Добавить("31448");
	мВидыДоходовРасходовНФО.Добавить("31449");
	мВидыДоходовРасходовНФО.Добавить("31450");
	мВидыДоходовРасходовНФО.Добавить("31451");
	мВидыДоходовРасходовНФО.Добавить("31452");
	мВидыДоходовРасходовНФО.Добавить("31454");
	мВидыДоходовРасходовНФО.Добавить("31455");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "по финансовым активам, оцениваемым по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка", "-", "!ДО", "71004", "Оборот за период #Период# по дебету счета 71004 по ОФР 31416, 31417, 31419, 31420, 31421, 31422, 31423, 31448, 31449, 31450, 31451, 31452, 31454, 31455");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31524");
	мВидыДоходовРасходовНФО.Добавить("31525");
	мВидыДоходовРасходовНФО.Добавить("31526");
	мВидыДоходовРасходовНФО.Добавить("31527");
	мВидыДоходовРасходовНФО.Добавить("31528");
	мВидыДоходовРасходовНФО.Добавить("31529");
	мВидыДоходовРасходовНФО.Добавить("31530");
	мВидыДоходовРасходовНФО.Добавить("31552");
	мВидыДоходовРасходовНФО.Добавить("31553");
	мВидыДоходовРасходовНФО.Добавить("31554");
	мВидыДоходовРасходовНФО.Добавить("31555");
	мВидыДоходовРасходовНФО.Добавить("31556");
	мВидыДоходовРасходовНФО.Добавить("31557");
	мВидыДоходовРасходовНФО.Добавить("31558");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "по финансовым активам, оцениваемым по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка", "+", "!КО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31524, 31525, 31526, 31527, 31528, 31529, 31530, 31552, 31553, 31554, 31555, 31556, 31557, 31558");
	ДобавитьСчетВТаблицуСчетов("П02", "по финансовым активам, оцениваемым по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка", "-", "!ДО", "71005", "Оборот за период #Период# по дебету счета 71005 по ОФР 31524, 31525, 31526, 31527, 31528, 31529, 31530, 31552, 31553, 31554, 31555, 31556, 31557, 31558");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "Флаг", , "НЕ КорСчет.Код В (""71006"", ""71005"")");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31624");
	мВидыДоходовРасходовНФО.Добавить("31625");
	мВидыДоходовРасходовНФО.Добавить("31626");
	мВидыДоходовРасходовНФО.Добавить("31627");
	мВидыДоходовРасходовНФО.Добавить("31628");
	мВидыДоходовРасходовНФО.Добавить("31629");
	мВидыДоходовРасходовНФО.Добавить("31630");
	мВидыДоходовРасходовНФО.Добавить("31652");
	мВидыДоходовРасходовНФО.Добавить("31653");
	мВидыДоходовРасходовНФО.Добавить("31654");
	мВидыДоходовРасходовНФО.Добавить("31655");
	мВидыДоходовРасходовНФО.Добавить("31656");
	мВидыДоходовРасходовНФО.Добавить("31657");
	мВидыДоходовРасходовНФО.Добавить("31658");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "по финансовым активам, оцениваемым по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка", "-", "!ДО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31624, 31625, 31626, 31627, 31628, 31629, 31630, 31652, 31653, 31654, 31655, 31656, 31657, 31658");
	ДобавитьСчетВТаблицуСчетов("П02", "по финансовым активам, оцениваемым по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка", "+", "!КО", "71006", "Оборот за период #Период# по кредиту счета 71006 по ОФР 31624, 31625, 31626, 31627, 31628, 31629, 31630, 31652, 31653, 31654, 31655, 31656, 31657, 31658");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "Флаг", , "НЕ КорСчет.Код В (""71006"", ""71005"")");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31133");
	мВидыДоходовРасходовНФО.Добавить("31134");
	мВидыДоходовРасходовНФО.Добавить("31135");
	мВидыДоходовРасходовНФО.Добавить("31136");
	мВидыДоходовРасходовНФО.Добавить("31137");
	мВидыДоходовРасходовНФО.Добавить("31138");
	мВидыДоходовРасходовНФО.Добавить("31139");
	мВидыДоходовРасходовНФО.Добавить("31161");
	мВидыДоходовРасходовНФО.Добавить("31162");
	мВидыДоходовРасходовНФО.Добавить("31163");
	мВидыДоходовРасходовНФО.Добавить("31164");
	мВидыДоходовРасходовНФО.Добавить("31165");
	мВидыДоходовРасходовНФО.Добавить("31166");
	мВидыДоходовРасходовНФО.Добавить("31167");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "по финансовым активам, имеющимся в наличии для продажи", "+", "!КО", "71001", "Оборот за период #Период# по кредету счета 71001 по ОФР 31133, 31134, 31135, 31136, 31137, 31138, 31139, 31161, 31162, 31163, 31164, 31165, 31166, 31167");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31333");
	мВидыДоходовРасходовНФО.Добавить("31334");
	мВидыДоходовРасходовНФО.Добавить("31335");
	мВидыДоходовРасходовНФО.Добавить("31336");
	мВидыДоходовРасходовНФО.Добавить("31337");
	мВидыДоходовРасходовНФО.Добавить("31338");
	мВидыДоходовРасходовНФО.Добавить("31339");
	мВидыДоходовРасходовНФО.Добавить("31361");
	мВидыДоходовРасходовНФО.Добавить("31362");
	мВидыДоходовРасходовНФО.Добавить("31363");
	мВидыДоходовРасходовНФО.Добавить("31364");
	мВидыДоходовРасходовНФО.Добавить("31365");
	мВидыДоходовРасходовНФО.Добавить("31366");
	мВидыДоходовРасходовНФО.Добавить("31367");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "по финансовым активам, имеющимся в наличии для продажи", "-", "!ДО", "71003", "Оборот за период #Период# по дебету счета 71003 по ОФР 31333, 31334, 31335, 31336, 31337, 31338, 31339, 31361, 31362, 31363, 31364, 31365, 31366, 31367");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31424");
	мВидыДоходовРасходовНФО.Добавить("31425");
	мВидыДоходовРасходовНФО.Добавить("31427");
	мВидыДоходовРасходовНФО.Добавить("31428");
	мВидыДоходовРасходовНФО.Добавить("31429");
	мВидыДоходовРасходовНФО.Добавить("31430");
	мВидыДоходовРасходовНФО.Добавить("31431");
	мВидыДоходовРасходовНФО.Добавить("31456");
	мВидыДоходовРасходовНФО.Добавить("31457");
	мВидыДоходовРасходовНФО.Добавить("31458");
	мВидыДоходовРасходовНФО.Добавить("31459");
	мВидыДоходовРасходовНФО.Добавить("31460");
	мВидыДоходовРасходовНФО.Добавить("31462");
	мВидыДоходовРасходовНФО.Добавить("31463");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "по финансовым активам, имеющимся в наличии для продажи", "-", "!ДО", "71004", "Оборот за период #Период# по дебету счета 71004 по ОФР 31424, 31425, 31427, 31428, 31429, 31430, 31431, 31456, 31457, 31458, 31459, 31460, 31462, 31463");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31531");
	мВидыДоходовРасходовНФО.Добавить("31532");
	мВидыДоходовРасходовНФО.Добавить("31533");
	мВидыДоходовРасходовНФО.Добавить("31534");
	мВидыДоходовРасходовНФО.Добавить("31535");
	мВидыДоходовРасходовНФО.Добавить("31536");
	мВидыДоходовРасходовНФО.Добавить("31537");
	мВидыДоходовРасходовНФО.Добавить("31559");
	мВидыДоходовРасходовНФО.Добавить("31560");
	мВидыДоходовРасходовНФО.Добавить("31561");
	мВидыДоходовРасходовНФО.Добавить("31562");
	мВидыДоходовРасходовНФО.Добавить("31563");
	мВидыДоходовРасходовНФО.Добавить("31564");
	мВидыДоходовРасходовНФО.Добавить("31565");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "по финансовым активам, имеющимся в наличии для продажи", "+", "!КО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31531, 31532, 31533, 31534, 31535, 31536, 31537, 31559, 31560, 31561, 31562, 31563, 31564, 31565");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31531");
	мВидыДоходовРасходовНФО.Добавить("31532");
	мВидыДоходовРасходовНФО.Добавить("31533");
	мВидыДоходовРасходовНФО.Добавить("31534");
	мВидыДоходовРасходовНФО.Добавить("31535");
	мВидыДоходовРасходовНФО.Добавить("31536");
	мВидыДоходовРасходовНФО.Добавить("31537");
	мВидыДоходовРасходовНФО.Добавить("31559");
	мВидыДоходовРасходовНФО.Добавить("31560");
	мВидыДоходовРасходовНФО.Добавить("31561");
	мВидыДоходовРасходовНФО.Добавить("31562");
	мВидыДоходовРасходовНФО.Добавить("31563");
	мВидыДоходовРасходовНФО.Добавить("31564");
	мВидыДоходовРасходовНФО.Добавить("31565");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "по финансовым активам, имеющимся в наличии для продажи", "-", "!ДО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31531, 31532, 31533, 31534, 31535, 31536, 31537, 31559, 31560, 31561, 31562, 31563, 31564, 31565");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31631");
	мВидыДоходовРасходовНФО.Добавить("31632");
	мВидыДоходовРасходовНФО.Добавить("31633");
	мВидыДоходовРасходовНФО.Добавить("31634");
	мВидыДоходовРасходовНФО.Добавить("31635");
	мВидыДоходовРасходовНФО.Добавить("31636");
	мВидыДоходовРасходовНФО.Добавить("31637");
	мВидыДоходовРасходовНФО.Добавить("31659");
	мВидыДоходовРасходовНФО.Добавить("31660");
	мВидыДоходовРасходовНФО.Добавить("31661");
	мВидыДоходовРасходовНФО.Добавить("31662");
	мВидыДоходовРасходовНФО.Добавить("31663");
	мВидыДоходовРасходовНФО.Добавить("31664");
	мВидыДоходовРасходовНФО.Добавить("31665");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "по финансовым активам, имеющимся в наличии для продажи", "-", "!ДО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31631, 31632, 31633, 31634, 31635, 31636, 31637, 31659, 31660, 31661, 31662, 31663, 31664, 31665");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31631");
	мВидыДоходовРасходовНФО.Добавить("31632");
	мВидыДоходовРасходовНФО.Добавить("31633");
	мВидыДоходовРасходовНФО.Добавить("31634");
	мВидыДоходовРасходовНФО.Добавить("31635");
	мВидыДоходовРасходовНФО.Добавить("31636");
	мВидыДоходовРасходовНФО.Добавить("31637");
	мВидыДоходовРасходовНФО.Добавить("31659");
	мВидыДоходовРасходовНФО.Добавить("31660");
	мВидыДоходовРасходовНФО.Добавить("31661");
	мВидыДоходовРасходовНФО.Добавить("31662");
	мВидыДоходовРасходовНФО.Добавить("31663");
	мВидыДоходовРасходовНФО.Добавить("31664");
	мВидыДоходовРасходовНФО.Добавить("31665");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "по финансовым активам, имеющимся в наличии для продажи", "+", "!КО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31631, 31632, 31633, 31634, 31635, 31636, 31637, 31659, 31660, 31661, 31662, 31663, 31664, 31665");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31140");
	мВидыДоходовРасходовНФО.Добавить("31141");
	мВидыДоходовРасходовНФО.Добавить("31142");
	мВидыДоходовРасходовНФО.Добавить("31143");
	мВидыДоходовРасходовНФО.Добавить("31144");
	мВидыДоходовРасходовНФО.Добавить("31145");
	мВидыДоходовРасходовНФО.Добавить("31146");
	мВидыДоходовРасходовНФО.Добавить("31168");
	мВидыДоходовРасходовНФО.Добавить("31169");
	мВидыДоходовРасходовНФО.Добавить("31170");
	мВидыДоходовРасходовНФО.Добавить("31171");
	мВидыДоходовРасходовНФО.Добавить("31172");
	мВидыДоходовРасходовНФО.Добавить("31173");
	мВидыДоходовРасходовНФО.Добавить("31174");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "по финансовым активам, удерживаемым до погашения", "+", "!КО", "71001", "Оборот за период #Период# по кредету счета 71001 по ОФР 31140, 31141, 31142, 31143, 31144, 31145, 31146, 31168, 31169, 31170, 31171, 31172, 31173, 31174");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31340");
	мВидыДоходовРасходовНФО.Добавить("31341");
	мВидыДоходовРасходовНФО.Добавить("31342");
	мВидыДоходовРасходовНФО.Добавить("31343");
	мВидыДоходовРасходовНФО.Добавить("31344");
	мВидыДоходовРасходовНФО.Добавить("31345");
	мВидыДоходовРасходовНФО.Добавить("31346");
	мВидыДоходовРасходовНФО.Добавить("31368");
	мВидыДоходовРасходовНФО.Добавить("31369");
	мВидыДоходовРасходовНФО.Добавить("31370");
	мВидыДоходовРасходовНФО.Добавить("31371");
	мВидыДоходовРасходовНФО.Добавить("31372");
	мВидыДоходовРасходовНФО.Добавить("31373");
	мВидыДоходовРасходовНФО.Добавить("31374");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "по финансовым активам, удерживаемым до погашения", "-", "!ДО", "71003", "Оборот за период #Период# по дебету счета 71003 по ОФР 31340, 31341, 31342, 31343, 31344, 31345, 31346, 31368, 31369, 31370, 31371, 31372, 31373, 31374");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31432");
	мВидыДоходовРасходовНФО.Добавить("31433");
	мВидыДоходовРасходовНФО.Добавить("31435");
	мВидыДоходовРасходовНФО.Добавить("31436");
	мВидыДоходовРасходовНФО.Добавить("31437");
	мВидыДоходовРасходовНФО.Добавить("31438");
	мВидыДоходовРасходовНФО.Добавить("31439");
	мВидыДоходовРасходовНФО.Добавить("31464");
	мВидыДоходовРасходовНФО.Добавить("31465");
	мВидыДоходовРасходовНФО.Добавить("31466");
	мВидыДоходовРасходовНФО.Добавить("31467");
	мВидыДоходовРасходовНФО.Добавить("31468");
	мВидыДоходовРасходовНФО.Добавить("31470");
	мВидыДоходовРасходовНФО.Добавить("31471");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "по финансовым активам, удерживаемым до погашения", "-", "!ДО", "71004", "Оборот за период #Период# по дебету счета 71004 по ОФР 31432, 31433, 31435, 31436, 31437, 31438, 31439, 31464, 31465, 31466, 31467, 31468, 31470, 31471");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31538");
	мВидыДоходовРасходовНФО.Добавить("31539");
	мВидыДоходовРасходовНФО.Добавить("31540");
	мВидыДоходовРасходовНФО.Добавить("31541");
	мВидыДоходовРасходовНФО.Добавить("31542");
	мВидыДоходовРасходовНФО.Добавить("31543");
	мВидыДоходовРасходовНФО.Добавить("31544");
	мВидыДоходовРасходовНФО.Добавить("31566");
	мВидыДоходовРасходовНФО.Добавить("31567");
	мВидыДоходовРасходовНФО.Добавить("31568");
	мВидыДоходовРасходовНФО.Добавить("31569");
	мВидыДоходовРасходовНФО.Добавить("31570");
	мВидыДоходовРасходовНФО.Добавить("31571");
	мВидыДоходовРасходовНФО.Добавить("31572");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "по финансовым активам, удерживаемым до погашения", "+", "!КО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31538, 31539, 31540, 31541, 31542, 31543, 31544, 31566, 31567, 31568, 31569, 31570, 31571, 31572");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31538");
	мВидыДоходовРасходовНФО.Добавить("31539");
	мВидыДоходовРасходовНФО.Добавить("31540");
	мВидыДоходовРасходовНФО.Добавить("31541");
	мВидыДоходовРасходовНФО.Добавить("31542");
	мВидыДоходовРасходовНФО.Добавить("31543");
	мВидыДоходовРасходовНФО.Добавить("31544");
	мВидыДоходовРасходовНФО.Добавить("31566");
	мВидыДоходовРасходовНФО.Добавить("31567");
	мВидыДоходовРасходовНФО.Добавить("31568");
	мВидыДоходовРасходовНФО.Добавить("31569");
	мВидыДоходовРасходовНФО.Добавить("31570");
	мВидыДоходовРасходовНФО.Добавить("31571");
	мВидыДоходовРасходовНФО.Добавить("31572");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "по финансовым активам, удерживаемым до погашения", "-", "!ДО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31538, 31539, 31540, 31541, 31542, 31543, 31544, 31566, 31567, 31568, 31569, 31570, 31571, 31572");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31638");
	мВидыДоходовРасходовНФО.Добавить("31639");
	мВидыДоходовРасходовНФО.Добавить("31640");
	мВидыДоходовРасходовНФО.Добавить("31641");
	мВидыДоходовРасходовНФО.Добавить("31642");
	мВидыДоходовРасходовНФО.Добавить("31643");
	мВидыДоходовРасходовНФО.Добавить("31644");
	мВидыДоходовРасходовНФО.Добавить("31666");
	мВидыДоходовРасходовНФО.Добавить("31667");
	мВидыДоходовРасходовНФО.Добавить("31668");
	мВидыДоходовРасходовНФО.Добавить("31669");
	мВидыДоходовРасходовНФО.Добавить("31670");
	мВидыДоходовРасходовНФО.Добавить("31671");
	мВидыДоходовРасходовНФО.Добавить("31672");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "по финансовым активам, удерживаемым до погашения", "-", "!ДО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31638, 31639, 31640, 31641, 31642, 31643, 31644, 31666, 31667, 31668, 31669, 31670, 31671, 31672");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31638");
	мВидыДоходовРасходовНФО.Добавить("31639");
	мВидыДоходовРасходовНФО.Добавить("31640");
	мВидыДоходовРасходовНФО.Добавить("31641");
	мВидыДоходовРасходовНФО.Добавить("31642");
	мВидыДоходовРасходовНФО.Добавить("31643");
	мВидыДоходовРасходовНФО.Добавить("31644");
	мВидыДоходовРасходовНФО.Добавить("31666");
	мВидыДоходовРасходовНФО.Добавить("31667");
	мВидыДоходовРасходовНФО.Добавить("31668");
	мВидыДоходовРасходовНФО.Добавить("31669");
	мВидыДоходовРасходовНФО.Добавить("31670");
	мВидыДоходовРасходовНФО.Добавить("31671");
	мВидыДоходовРасходовНФО.Добавить("31672");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "по финансовым активам, удерживаемым до погашения", "+", "!КО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31638, 31639, 31640, 31641, 31642, 31643, 31644, 31666, 31667, 31668, 31669, 31670, 31671, 31672");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31114");
	мВидыДоходовРасходовНФО.Добавить("31115");
	мВидыДоходовРасходовНФО.Добавить("31120");
	мВидыДоходовРасходовНФО.Добавить("31121");
	мВидыДоходовРасходовНФО.Добавить("31122");
	мВидыДоходовРасходовНФО.Добавить("31123");
	мВидыДоходовРасходовНФО.Добавить("31124");
	мВидыДоходовРасходовНФО.Добавить("31125");
	мВидыДоходовРасходовНФО.Добавить("31149");
	мВидыДоходовРасходовНФО.Добавить("31152");
	мВидыДоходовРасходовНФО.Добавить("31177");
	мВидыДоходовРасходовНФО.Добавить("31180");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "+", "!КО", "71001", "Оборот за период #Период# по кредету счета 71001 по ОФР 31114, 31115, 31120, 31121, 31122, 31123, 31124, 31125, 31149, 31152, 31177, 31180");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31214");
	мВидыДоходовРасходовНФО.Добавить("31215");
	мВидыДоходовРасходовНФО.Добавить("31220");
	мВидыДоходовРасходовНФО.Добавить("31221");
	мВидыДоходовРасходовНФО.Добавить("31222");
	мВидыДоходовРасходовНФО.Добавить("31223");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "+", "!КО", "71002", "Оборот за период #Период# по кредету счета 71002 по ОФР 31214, 31215, 31220, 31221, 31222, 31223");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31314");
	мВидыДоходовРасходовНФО.Добавить("31315");
	мВидыДоходовРасходовНФО.Добавить("31320");
	мВидыДоходовРасходовНФО.Добавить("31321");
	мВидыДоходовРасходовНФО.Добавить("31322");
	мВидыДоходовРасходовНФО.Добавить("31323");
	мВидыДоходовРасходовНФО.Добавить("31324");
	мВидыДоходовРасходовНФО.Добавить("31325");
	мВидыДоходовРасходовНФО.Добавить("31349");
	мВидыДоходовРасходовНФО.Добавить("31352");
	мВидыДоходовРасходовНФО.Добавить("31377");
	мВидыДоходовРасходовНФО.Добавить("31380");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "-", "!ДО", "71003", "Оборот за период #Период# по дебету счета 71003 по ОФР 31314, 31315, 31320, 31321, 31322, 31323, 31324, 31325, 31349, 31352, 31377, 31380");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31414");
	мВидыДоходовРасходовНФО.Добавить("31415");
	мВидыДоходовРасходовНФО.Добавить("31442");
	мВидыДоходовРасходовНФО.Добавить("31446");
	мВидыДоходовРасходовНФО.Добавить("31474");
	мВидыДоходовРасходовНФО.Добавить("31478");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "-", "!ДО", "71004", "Оборот за период #Период# по дебету счета 71004 по ОФР 31414, 31415, 31442, 31446, 31474, 31478");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31514");
	мВидыДоходовРасходовНФО.Добавить("31515");
	мВидыДоходовРасходовНФО.Добавить("31520");
	мВидыДоходовРасходовНФО.Добавить("31521");
	мВидыДоходовРасходовНФО.Добавить("31522");
	мВидыДоходовРасходовНФО.Добавить("31523");
	мВидыДоходовРасходовНФО.Добавить("31547");
	мВидыДоходовРасходовНФО.Добавить("31550");
	мВидыДоходовРасходовНФО.Добавить("31575");
	мВидыДоходовРасходовНФО.Добавить("31578");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "+", "!КО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31514, 31515, 31520, 31521, 31522, 31523, 31547, 31550, 31575, 31578");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31514");
	мВидыДоходовРасходовНФО.Добавить("31515");
	мВидыДоходовРасходовНФО.Добавить("31520");
	мВидыДоходовРасходовНФО.Добавить("31521");
	мВидыДоходовРасходовНФО.Добавить("31522");
	мВидыДоходовРасходовНФО.Добавить("31523");
	мВидыДоходовРасходовНФО.Добавить("31547");
	мВидыДоходовРасходовНФО.Добавить("31550");
	мВидыДоходовРасходовНФО.Добавить("31575");
	мВидыДоходовРасходовНФО.Добавить("31578");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "-", "!ДО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31514, 31515, 31520, 31521, 31522, 31523, 31547, 31550, 31575, 31578");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31614");
	мВидыДоходовРасходовНФО.Добавить("31615");
	мВидыДоходовРасходовНФО.Добавить("31620");
	мВидыДоходовРасходовНФО.Добавить("31621");
	мВидыДоходовРасходовНФО.Добавить("31622");
	мВидыДоходовРасходовНФО.Добавить("31623");
	мВидыДоходовРасходовНФО.Добавить("31647");
	мВидыДоходовРасходовНФО.Добавить("31650");
	мВидыДоходовРасходовНФО.Добавить("31675");
	мВидыДоходовРасходовНФО.Добавить("31678");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "-", "!ДО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31614, 31615, 31620, 31621, 31622, 31623, 31647, 31650, 31675, 31678");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31614");
	мВидыДоходовРасходовНФО.Добавить("31615");
	мВидыДоходовРасходовНФО.Добавить("31620");
	мВидыДоходовРасходовНФО.Добавить("31621");
	мВидыДоходовРасходовНФО.Добавить("31622");
	мВидыДоходовРасходовНФО.Добавить("31623");
	мВидыДоходовРасходовНФО.Добавить("31647");
	мВидыДоходовРасходовНФО.Добавить("31650");
	мВидыДоходовРасходовНФО.Добавить("31675");
	мВидыДоходовРасходовНФО.Добавить("31678");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "по депозитам и прочим размещенным средствам в кредитных организациях и банках-нерезидентах", "+", "!КО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31614, 31615, 31620, 31621, 31622, 31623, 31647, 31650, 31675, 31678");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31101");
	мВидыДоходовРасходовНФО.Добавить("31102");
	мВидыДоходовРасходовНФО.Добавить("31103");
	мВидыДоходовРасходовНФО.Добавить("31104");
	мВидыДоходовРасходовНФО.Добавить("31105");
	мВидыДоходовРасходовНФО.Добавить("31106");
	мВидыДоходовРасходовНФО.Добавить("31107");
	мВидыДоходовРасходовНФО.Добавить("31108");
	мВидыДоходовРасходовНФО.Добавить("31109");
	мВидыДоходовРасходовНФО.Добавить("31110");
	мВидыДоходовРасходовНФО.Добавить("31111");
	мВидыДоходовРасходовНФО.Добавить("31112");
	мВидыДоходовРасходовНФО.Добавить("31113");
	мВидыДоходовРасходовНФО.Добавить("31116");
	мВидыДоходовРасходовНФО.Добавить("31117");
	мВидыДоходовРасходовНФО.Добавить("31118");
	мВидыДоходовРасходовНФО.Добавить("31119");
	мВидыДоходовРасходовНФО.Добавить("31147");
	мВидыДоходовРасходовНФО.Добавить("31148");
	мВидыДоходовРасходовНФО.Добавить("31150");
	мВидыДоходовРасходовНФО.Добавить("31151");
	мВидыДоходовРасходовНФО.Добавить("31153");
	мВидыДоходовРасходовНФО.Добавить("31175");
	мВидыДоходовРасходовНФО.Добавить("31176");
	мВидыДоходовРасходовНФО.Добавить("31178");
	мВидыДоходовРасходовНФО.Добавить("31179");
	мВидыДоходовРасходовНФО.Добавить("31180");
	мВидыДоходовРасходовНФО.Добавить("31181");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "+", "!КО", "71001", "Оборот за период #Период# по кредету счета 71001 по ОФР 31101, 31102, 31103, 31104, 31105, 31106, 31107, 31108, 31109, 31110, 31111, 31112, 31113, 31116, 31117, 31118, 31119, 31147, 31148, 31150, 31151, 31153, 31175, 31176, 31178, 31179, 31180, 31181");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31201");
	мВидыДоходовРасходовНФО.Добавить("31202");
	мВидыДоходовРасходовНФО.Добавить("31203");
	мВидыДоходовРасходовНФО.Добавить("31204");
	мВидыДоходовРасходовНФО.Добавить("31205");
	мВидыДоходовРасходовНФО.Добавить("31206");
	мВидыДоходовРасходовНФО.Добавить("31207");
	мВидыДоходовРасходовНФО.Добавить("31208");
	мВидыДоходовРасходовНФО.Добавить("31209");
	мВидыДоходовРасходовНФО.Добавить("31210");
	мВидыДоходовРасходовНФО.Добавить("31211");
	мВидыДоходовРасходовНФО.Добавить("31212");
	мВидыДоходовРасходовНФО.Добавить("31213");
	мВидыДоходовРасходовНФО.Добавить("31216");
	мВидыДоходовРасходовНФО.Добавить("31217");
	мВидыДоходовРасходовНФО.Добавить("31218");
	мВидыДоходовРасходовНФО.Добавить("31219");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "+", "!КО", "71002", "Оборот за период #Период# по кредету счета 71002 по ОФР 31201, 31202, 31203, 31204, 31205, 31206, 31207, 31208, 31209, 31210, 31211, 31212, 31213, 31216, 31217, 31218, 31219");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31301");
	мВидыДоходовРасходовНФО.Добавить("31302");
	мВидыДоходовРасходовНФО.Добавить("31303");
	мВидыДоходовРасходовНФО.Добавить("31304");
	мВидыДоходовРасходовНФО.Добавить("31305");
	мВидыДоходовРасходовНФО.Добавить("31306");
	мВидыДоходовРасходовНФО.Добавить("31307");
	мВидыДоходовРасходовНФО.Добавить("31308");
	мВидыДоходовРасходовНФО.Добавить("31309");
	мВидыДоходовРасходовНФО.Добавить("31310");
	мВидыДоходовРасходовНФО.Добавить("31311");
	мВидыДоходовРасходовНФО.Добавить("31312");
	мВидыДоходовРасходовНФО.Добавить("31313");
	мВидыДоходовРасходовНФО.Добавить("31316");
	мВидыДоходовРасходовНФО.Добавить("31317");
	мВидыДоходовРасходовНФО.Добавить("31318");
	мВидыДоходовРасходовНФО.Добавить("31319");
	мВидыДоходовРасходовНФО.Добавить("31347");
	мВидыДоходовРасходовНФО.Добавить("31348");
	мВидыДоходовРасходовНФО.Добавить("31350");
	мВидыДоходовРасходовНФО.Добавить("31351");
	мВидыДоходовРасходовНФО.Добавить("31352");
	мВидыДоходовРасходовНФО.Добавить("31353");
	мВидыДоходовРасходовНФО.Добавить("31375");
	мВидыДоходовРасходовНФО.Добавить("31376");
	мВидыДоходовРасходовНФО.Добавить("31378");
	мВидыДоходовРасходовНФО.Добавить("31379");
	мВидыДоходовРасходовНФО.Добавить("31381");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	мУПЦБКлассификация = Новый Массив;
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "-", "!ДО", "71003", "Оборот за период #Период# по дебету счета 71003 по ОФР 31301, 31302, 31303, 31304, 31305, 31306, 31307, 31308, 31309, 31310, 31311, 31312, 31313, 31316, 31317, 31318, 31319, 31347, 31348, 31350, 31351, 31352, 31353, 31375, 31376, 31378, 31379, 31381");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31401");
	мВидыДоходовРасходовНФО.Добавить("31402");
	мВидыДоходовРасходовНФО.Добавить("31403");
	мВидыДоходовРасходовНФО.Добавить("31404");
	мВидыДоходовРасходовНФО.Добавить("31405");
	мВидыДоходовРасходовНФО.Добавить("31406");
	мВидыДоходовРасходовНФО.Добавить("31407");
	мВидыДоходовРасходовНФО.Добавить("31408");
	мВидыДоходовРасходовНФО.Добавить("31409");
	мВидыДоходовРасходовНФО.Добавить("31410");
	мВидыДоходовРасходовНФО.Добавить("31411");
	мВидыДоходовРасходовНФО.Добавить("31412");
	мВидыДоходовРасходовНФО.Добавить("31413");
	мВидыДоходовРасходовНФО.Добавить("31440");
	мВидыДоходовРасходовНФО.Добавить("31441");
	мВидыДоходовРасходовНФО.Добавить("31443");
	мВидыДоходовРасходовНФО.Добавить("31444");
	мВидыДоходовРасходовНФО.Добавить("31446");
	мВидыДоходовРасходовНФО.Добавить("31447");
	мВидыДоходовРасходовНФО.Добавить("31472");
	мВидыДоходовРасходовНФО.Добавить("31473");
	мВидыДоходовРасходовНФО.Добавить("31475");
	мВидыДоходовРасходовНФО.Добавить("31476");
	мВидыДоходовРасходовНФО.Добавить("31479");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "-", "!ДО", "71004", "Оборот за период #Период# по дебету счета 71004 по ОФР 31401, 31402, 31403, 31404, 31405, 31406, 31407, 31408, 31409, 31410, 31411, 31412, 31413, 31440, 31441, 31443, 31444, 31446, 31447, 31472, 31473, 31475, 31476, 31479");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31501");
	мВидыДоходовРасходовНФО.Добавить("31502");
	мВидыДоходовРасходовНФО.Добавить("31503");
	мВидыДоходовРасходовНФО.Добавить("31504");
	мВидыДоходовРасходовНФО.Добавить("31505");
	мВидыДоходовРасходовНФО.Добавить("31506");
	мВидыДоходовРасходовНФО.Добавить("31507");
	мВидыДоходовРасходовНФО.Добавить("31508");
	мВидыДоходовРасходовНФО.Добавить("31509");
	мВидыДоходовРасходовНФО.Добавить("31510");
	мВидыДоходовРасходовНФО.Добавить("31511");
	мВидыДоходовРасходовНФО.Добавить("31512");
	мВидыДоходовРасходовНФО.Добавить("31513");
	мВидыДоходовРасходовНФО.Добавить("31516");
	мВидыДоходовРасходовНФО.Добавить("31517");
	мВидыДоходовРасходовНФО.Добавить("31518");
	мВидыДоходовРасходовНФО.Добавить("31519");
	мВидыДоходовРасходовНФО.Добавить("31545");
	мВидыДоходовРасходовНФО.Добавить("31546");
	мВидыДоходовРасходовНФО.Добавить("31548");
	мВидыДоходовРасходовНФО.Добавить("31549");
	мВидыДоходовРасходовНФО.Добавить("31551");
	мВидыДоходовРасходовНФО.Добавить("31573");
	мВидыДоходовРасходовНФО.Добавить("31574");
	мВидыДоходовРасходовНФО.Добавить("31576");
	мВидыДоходовРасходовНФО.Добавить("31577");
	мВидыДоходовРасходовНФО.Добавить("31579");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "+", "!КО", "71005", "Оборот за период #Период# по кредету счета 71005 по ОФР 31501, 31502, 31503, 31504, 31505, 31506, 31507, 31508, 31509, 31510, 31511, 31512, 31513, 31516, 31517, 31518, 31519, 31545, 31546, 31548, 31549, 31551, 31573, 31574, 31576, 31577, 31579");
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "-", "!ДО", "71005", "Оборот за период #Период# по дебету счета 71005 по ОФР 31501, 31502, 31503, 31504, 31505, 31506, 31507, 31508, 31509, 31510, 31511, 31512, 31513, 31516, 31517, 31518, 31519, 31545, 31546, 31548, 31549, 31551, 31573, 31574, 31576, 31577, 31579");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "47903", , "НЕ КорСчет В ИЕРАРХИИ (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("31601");
	мВидыДоходовРасходовНФО.Добавить("31602");
	мВидыДоходовРасходовНФО.Добавить("31603");
	мВидыДоходовРасходовНФО.Добавить("31604");
	мВидыДоходовРасходовНФО.Добавить("31605");
	мВидыДоходовРасходовНФО.Добавить("31606");
	мВидыДоходовРасходовНФО.Добавить("31607");
	мВидыДоходовРасходовНФО.Добавить("31608");
	мВидыДоходовРасходовНФО.Добавить("31609");
	мВидыДоходовРасходовНФО.Добавить("31610");
	мВидыДоходовРасходовНФО.Добавить("31611");
	мВидыДоходовРасходовНФО.Добавить("31612");
	мВидыДоходовРасходовНФО.Добавить("31613");
	мВидыДоходовРасходовНФО.Добавить("31616");
	мВидыДоходовРасходовНФО.Добавить("31617");
	мВидыДоходовРасходовНФО.Добавить("31618");
	мВидыДоходовРасходовНФО.Добавить("31619");
	мВидыДоходовРасходовНФО.Добавить("31645");
	мВидыДоходовРасходовНФО.Добавить("31646");
	мВидыДоходовРасходовНФО.Добавить("31648");
	мВидыДоходовРасходовНФО.Добавить("31649");
	мВидыДоходовРасходовНФО.Добавить("31651");
	мВидыДоходовРасходовНФО.Добавить("31673");
	мВидыДоходовРасходовНФО.Добавить("31674");
	мВидыДоходовРасходовНФО.Добавить("31676");
	мВидыДоходовРасходовНФО.Добавить("31677");
	мВидыДоходовРасходовНФО.Добавить("31679");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "-", "!ДО", "71006", "Оборот за период #Период# по дебету счета 71006 по ОФР 31601, 31602, 31603, 31604, 31605, 31606, 31607, 31608, 31609, 31610, 31611, 31612, 31613, 31616, 31617, 31618, 31619, 31645, 31646, 31648, 31649, 31651, 31673, 31674, 31676, 31677, 31679");
	ДобавитьСчетВТаблицуСчетов("П06", "по займам выданным и прочим размещенным средствам", "+", "!КО", "71006", "Оборот за период #Период# по кредиту счета 71006 по ОФР 31601, 31602, 31603, 31604, 31605, 31606, 31607, 31608, 31609, 31610, 31611, 31612, 31613, 31616, 31617, 31618, 31619, 31645, 31646, 31648, 31649, 31651, 31673, 31674, 31676, 31677, 31679");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	//мТаблицаСчетов.Очистить();
	//мВидыДоходовРасходовНФО = Новый Массив;
	//мВидыДоходовРасходовНФО.Добавить("31101");
	//мВидыДоходовРасходовНФО.Добавить("31102");
	//мВидыДоходовРасходовНФО.Добавить("31103");
	//мВидыДоходовРасходовНФО.Добавить("31104");
	//мВидыДоходовРасходовНФО.Добавить("31105");
	//мВидыДоходовРасходовНФО.Добавить("31106");
	//мВидыДоходовРасходовНФО.Добавить("31107");
	//мВидыДоходовРасходовНФО.Добавить("31108");
	//мВидыДоходовРасходовНФО.Добавить("31109");
	//мВидыДоходовРасходовНФО.Добавить("31110");
	//мВидыДоходовРасходовНФО.Добавить("31111");
	//мВидыДоходовРасходовНФО.Добавить("31112");
	//мВидыДоходовРасходовНФО.Добавить("31113");
	//мВидыДоходовРасходовНФО.Добавить("31116");
	//мВидыДоходовРасходовНФО.Добавить("31117");
	//Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	//ДобавитьСчетВТаблицуСчетов("П07", "по финансовой аренде", "+", "!КО", "71001", "Оборот за период #Период# по кредету счета 71001 по ОФР 31101, 31102, 31103, 31104, 31105, 31106, 31107, 31108, 31109, 31110, 31111, 31112, 31113, 31116, 31117");
	//ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ПрочиеИнвестиционныеДоходыЗаВычетомРасходовСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Налог);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("34501");
	мВидыДоходовРасходовНФО.Добавить("34502");
	мВидыДоходовРасходовНФО.Добавить("34503");
	мВидыДоходовРасходовНФО.Добавить("34504");
	мВидыДоходовРасходовНФО.Добавить("34601");
	мВидыДоходовРасходовНФО.Добавить("34602");
	мВидыДоходовРасходовНФО.Добавить("34603");
	мВидыДоходовРасходовНФО.Добавить("34604");
	мВидыДоходовРасходовНФО.Добавить("34701");
	мВидыДоходовРасходовНФО.Добавить("34702");
	мВидыДоходовРасходовНФО.Добавить("34703");
	мВидыДоходовРасходовНФО.Добавить("34704");
	мВидыДоходовРасходовНФО.Добавить("34801");
	мВидыДоходовРасходовНФО.Добавить("34802");
	мВидыДоходовРасходовНФО.Добавить("34803");
	мВидыДоходовРасходовНФО.Добавить("34804");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П01", "Дивиденды и доходы от участия", "+", "!КО", "71505", "Оборот за период #Период# по кредету счета 71505 по ОФР 34501, 34502, 34503, 34504, 34601, 34602, 34603, 34604, 34701, 34702, 34703, 34704, 34801, 34802, 34803, 34804");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО + СтруктураПеременныхДляОтбора.ДополнительнаяАналитика_НЕ);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("34501");
	мВидыДоходовРасходовНФО.Добавить("34502");
	мВидыДоходовРасходовНФО.Добавить("34503");
	мВидыДоходовРасходовНФО.Добавить("34504");
	мВидыДоходовРасходовНФО.Добавить("34601");
	мВидыДоходовРасходовНФО.Добавить("34602");
	мВидыДоходовРасходовНФО.Добавить("34603");
	мВидыДоходовРасходовНФО.Добавить("34604");
	мВидыДоходовРасходовНФО.Добавить("34701");
	мВидыДоходовРасходовНФО.Добавить("34702");
	мВидыДоходовРасходовНФО.Добавить("34703");
	мВидыДоходовРасходовНФО.Добавить("34704");
	мВидыДоходовРасходовНФО.Добавить("34801");
	мВидыДоходовРасходовНФО.Добавить("34802");
	мВидыДоходовРасходовНФО.Добавить("34803");
	мВидыДоходовРасходовНФО.Добавить("34804");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П01", "Дивиденды и доходы от участия", "-", "!ДО", "71506", "Оборот за период #Период# по дебету счета 71506 по ОФР 34501, 34502, 34503, 34504, 34601, 34602, 34603, 34604, 34701, 34702, 34703, 34704, 34801, 34802, 34803, 34804");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("43101");
	мВидыДоходовРасходовНФО.Добавить("43102");
	мВидыДоходовРасходовНФО.Добавить("43103");
	мВидыДоходовРасходовНФО.Добавить("43104");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П01", "Дивиденды и доходы от участия", "-", "!ДО", "71506", "Оборот за период #Период# по дебету счета 71506 в корреспонденции со счетом 60347 по ОФР 43101, 43102, 43103, 43104");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО, "60347");	
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("37401");
	мВидыДоходовРасходовНФО.Добавить("37402");
	мВидыДоходовРасходовНФО.Добавить("37403");
	мВидыДоходовРасходовНФО.Добавить("37404");
	мВидыДоходовРасходовНФО.Добавить("37405");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "Доходы (расходы) от переоценки драгоценных металлов", "+", "!КО", "71513", "Оборот за период #Период# по кредету счета 71513 по ОФР 37401, 37402, 37403, 37404, 37405");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("47401");
	мВидыДоходовРасходовНФО.Добавить("47402");
	мВидыДоходовРасходовНФО.Добавить("47403");
	мВидыДоходовРасходовНФО.Добавить("47404");
	мВидыДоходовРасходовНФО.Добавить("47405");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "Доходы (расходы) от переоценки драгоценных металлов", "-", "!ДО", "71514", "Оборот за период #Период# по дебету счета 71514 по ОФР 47401, 47402, 47403, 47404, 47405");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("37301");
	мВидыДоходовРасходовНФО.Добавить("37302");
	мВидыДоходовРасходовНФО.Добавить("37303");
	мВидыДоходовРасходовНФО.Добавить("37304");
	мВидыДоходовРасходовНФО.Добавить("37305");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "Доходы (расходы) от операций с драгоценными металлами", "+", "!КО", "71513", "Оборот за период #Период# по кредету счета 71513 по ОФР 37301, 37302, 37303, 37304, 37305");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("47301");
	мВидыДоходовРасходовНФО.Добавить("47302");
	мВидыДоходовРасходовНФО.Добавить("47303");
	мВидыДоходовРасходовНФО.Добавить("47304");
	мВидыДоходовРасходовНФО.Добавить("47305");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "Доходы (расходы) от операций с драгоценными металлами", "-", "!ДО", "71514", "Оборот за период #Период# по дебету счета 71514 по ОФР 47301, 47302, 47303, 47304, 47305");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("38101");
	мВидыДоходовРасходовНФО.Добавить("38102");
	мВидыДоходовРасходовНФО.Добавить("38103");
	мВидыДоходовРасходовНФО.Добавить("38104");
	мВидыДоходовРасходовНФО.Добавить("38105");
	мВидыДоходовРасходовНФО.Добавить("38106");
	мВидыДоходовРасходовНФО.Добавить("38107");
	мВидыДоходовРасходовНФО.Добавить("38108");
	мВидыДоходовРасходовНФО.Добавить("38109");
	мВидыДоходовРасходовНФО.Добавить("38110");
	мВидыДоходовРасходовНФО.Добавить("38111");
	мВидыДоходовРасходовНФО.Добавить("38112");
	мВидыДоходовРасходовНФО.Добавить("38113");
	мВидыДоходовРасходовНФО.Добавить("38114");
	мВидыДоходовРасходовНФО.Добавить("38115");
	мВидыДоходовРасходовНФО.Добавить("38116");
	мВидыДоходовРасходовНФО.Добавить("38117");
	мВидыДоходовРасходовНФО.Добавить("38118");
	мВидыДоходовРасходовНФО.Добавить("38119");
	мВидыДоходовРасходовНФО.Добавить("38201");
	мВидыДоходовРасходовНФО.Добавить("38202");
	мВидыДоходовРасходовНФО.Добавить("38301");
	мВидыДоходовРасходовНФО.Добавить("38302");
	мВидыДоходовРасходовНФО.Добавить("38501");
	мВидыДоходовРасходовНФО.Добавить("38502");
	мВидыДоходовРасходовНФО.Добавить("38503");
	мВидыДоходовРасходовНФО.Добавить("38504");
	мВидыДоходовРасходовНФО.Добавить("38505");
	мВидыДоходовРасходовНФО.Добавить("38506");
	мВидыДоходовРасходовНФО.Добавить("38507");
	мВидыДоходовРасходовНФО.Добавить("38601");
	мВидыДоходовРасходовНФО.Добавить("38602");
	мВидыДоходовРасходовНФО.Добавить("38603");
	мВидыДоходовРасходовНФО.Добавить("38604");
	мВидыДоходовРасходовНФО.Добавить("38605");
	мВидыДоходовРасходовНФО.Добавить("38606");
	мВидыДоходовРасходовНФО.Добавить("38607");
	мВидыДоходовРасходовНФО.Добавить("38801");
	мВидыДоходовРасходовНФО.Добавить("38802");
	мВидыДоходовРасходовНФО.Добавить("38803");
	мВидыДоходовРасходовНФО.Добавить("38804");
	мВидыДоходовРасходовНФО.Добавить("38805");
	мВидыДоходовРасходовНФО.Добавить("38806");
	мВидыДоходовРасходовНФО.Добавить("38807");
	мВидыДоходовРасходовНФО.Добавить("38901");
	мВидыДоходовРасходовНФО.Добавить("38902");
	мВидыДоходовРасходовНФО.Добавить("38903");
	мВидыДоходовРасходовНФО.Добавить("38904");
	мВидыДоходовРасходовНФО.Добавить("38905");
	мВидыДоходовРасходовНФО.Добавить("38906");
	мВидыДоходовРасходовНФО.Добавить("38907");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "Доходы от восстановления убытков от обесценения (расходы от обесценения) финансовых активов", "+", "!КО", "71201", "Оборот за период #Период# по кредету счета 71201 по ОФР 38101, 38102, 38103, 38104, 38105, 38106, 38107, 38108, 38109, 38110, 38111, 38112, 38113, 38114, 38115, 38116, 38117, 38118, 38119, 38201, 38202, 38301, 38302, 38501, 38502, 38503, 38504, 38505, 38506, 38507, 38601, 38602, 38603, 38604, 38605, 38606, 38607, 38801, 38802, 38803, 38804, 38805, 38806, 38807, 38901, 38902, 38903, 38904, 38905, 38906, 38907");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("48101");
	мВидыДоходовРасходовНФО.Добавить("48102");
	мВидыДоходовРасходовНФО.Добавить("48103");
	мВидыДоходовРасходовНФО.Добавить("48104");
	мВидыДоходовРасходовНФО.Добавить("48105");
	мВидыДоходовРасходовНФО.Добавить("48106");
	мВидыДоходовРасходовНФО.Добавить("48107");
	мВидыДоходовРасходовНФО.Добавить("48108");
	мВидыДоходовРасходовНФО.Добавить("48109");
	мВидыДоходовРасходовНФО.Добавить("48110");
	мВидыДоходовРасходовНФО.Добавить("48111");
	мВидыДоходовРасходовНФО.Добавить("48112");
	мВидыДоходовРасходовНФО.Добавить("48113");
	мВидыДоходовРасходовНФО.Добавить("48114");
	мВидыДоходовРасходовНФО.Добавить("48115");
	мВидыДоходовРасходовНФО.Добавить("48116");
	мВидыДоходовРасходовНФО.Добавить("48117");
	мВидыДоходовРасходовНФО.Добавить("48118");
	мВидыДоходовРасходовНФО.Добавить("48119");
	мВидыДоходовРасходовНФО.Добавить("48201");
	мВидыДоходовРасходовНФО.Добавить("48202");
	мВидыДоходовРасходовНФО.Добавить("48301");
	мВидыДоходовРасходовНФО.Добавить("48302");
	мВидыДоходовРасходовНФО.Добавить("48501");
	мВидыДоходовРасходовНФО.Добавить("48502");
	мВидыДоходовРасходовНФО.Добавить("48503");
	мВидыДоходовРасходовНФО.Добавить("48504");
	мВидыДоходовРасходовНФО.Добавить("48505");
	мВидыДоходовРасходовНФО.Добавить("48506");
	мВидыДоходовРасходовНФО.Добавить("48507");
	мВидыДоходовРасходовНФО.Добавить("48601");
	мВидыДоходовРасходовНФО.Добавить("48602");
	мВидыДоходовРасходовНФО.Добавить("48603");
	мВидыДоходовРасходовНФО.Добавить("48604");
	мВидыДоходовРасходовНФО.Добавить("48605");
	мВидыДоходовРасходовНФО.Добавить("48606");
	мВидыДоходовРасходовНФО.Добавить("48607");
	мВидыДоходовРасходовНФО.Добавить("48801");
	мВидыДоходовРасходовНФО.Добавить("48802");
	мВидыДоходовРасходовНФО.Добавить("48803");
	мВидыДоходовРасходовНФО.Добавить("48804");
	мВидыДоходовРасходовНФО.Добавить("48805");
	мВидыДоходовРасходовНФО.Добавить("48806");
	мВидыДоходовРасходовНФО.Добавить("48807");
	мВидыДоходовРасходовНФО.Добавить("48901");
	мВидыДоходовРасходовНФО.Добавить("48902");
	мВидыДоходовРасходовНФО.Добавить("48903");
	мВидыДоходовРасходовНФО.Добавить("48904");
	мВидыДоходовРасходовНФО.Добавить("48905");
	мВидыДоходовРасходовНФО.Добавить("48906");
	мВидыДоходовРасходовНФО.Добавить("48907");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "Доходы от восстановления убытков от обесценения (расходы от обесценения) финансовых активов", "-", "!ДО", "71202", "Оборот за период #Период# по дебету счета 71202 по ОФР 48101, 48102, 48103, 48104, 48105, 48106, 48107, 48108, 48109, 48110, 48111, 48112, 48113, 48114, 48115, 48116, 48117, 48118, 48119, 48201, 48202, 48301, 48302, 48501, 48502, 48503, 48504, 48505, 48506, 48507, 48601, 48602, 48603, 48604, 48605, 48606, 48607, 48801, 48802, 48803, 48804, 48805, 48806, 48807, 48901, 48902, 48903, 48904, 48905, 48906, 48907");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("33615");
	мВидыДоходовРасходовНФО.Добавить("33616");
	мВидыДоходовРасходовНФО.Добавить("33617");
	мВидыДоходовРасходовНФО.Добавить("33618");
	мВидыДоходовРасходовНФО.Добавить("33619");
	мВидыДоходовРасходовНФО.Добавить("33620");
	мВидыДоходовРасходовНФО.Добавить("33621");
	мВидыДоходовРасходовНФО.Добавить("33622");
	мВидыДоходовРасходовНФО.Добавить("33623");
	мВидыДоходовРасходовНФО.Добавить("33624");
	мВидыДоходовРасходовНФО.Добавить("33625");
	мВидыДоходовРасходовНФО.Добавить("33626");
	мВидыДоходовРасходовНФО.Добавить("33627");
	мВидыДоходовРасходовНФО.Добавить("33628");
	мВидыДоходовРасходовНФО.Добавить("33643");
	мВидыДоходовРасходовНФО.Добавить("33644");
	мВидыДоходовРасходовНФО.Добавить("33645");
	мВидыДоходовРасходовНФО.Добавить("33646");
	мВидыДоходовРасходовНФО.Добавить("33647");
	мВидыДоходовРасходовНФО.Добавить("33648");
	мВидыДоходовРасходовНФО.Добавить("33649");
	мВидыДоходовРасходовНФО.Добавить("33650");
	мВидыДоходовРасходовНФО.Добавить("33651");
	мВидыДоходовРасходовНФО.Добавить("33652");
	мВидыДоходовРасходовНФО.Добавить("33653");
	мВидыДоходовРасходовНФО.Добавить("33654");
	мВидыДоходовРасходовНФО.Добавить("33655");
	мВидыДоходовРасходовНФО.Добавить("33656");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "Доходы (расходы), связанные с отнесением на финансовый результат разницы между стоимостью приобретения финансовых инструментов и их справедливой стоимостью при первоначальном признании", "+", "!КО", "71503", "Оборот за период #Период# по кредету счета 71503 по ОФР 33615, 33616, 33617, 33618, 33619, 33620, 33621, 33622, 33623, 33624, 33625, 33626, 33627, 33628, 33643, 33644, 33645, 33646, 33647, 33648, 33649, 33650, 33651, 33652, 33653, 33654, 33655, 33656");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("42615");
	мВидыДоходовРасходовНФО.Добавить("42616");
	мВидыДоходовРасходовНФО.Добавить("42617");
	мВидыДоходовРасходовНФО.Добавить("42618");
	мВидыДоходовРасходовНФО.Добавить("42619");
	мВидыДоходовРасходовНФО.Добавить("42620");
	мВидыДоходовРасходовНФО.Добавить("42621");
	мВидыДоходовРасходовНФО.Добавить("42622");
	мВидыДоходовРасходовНФО.Добавить("42623");
	мВидыДоходовРасходовНФО.Добавить("42624");
	мВидыДоходовРасходовНФО.Добавить("42625");
	мВидыДоходовРасходовНФО.Добавить("42626");
	мВидыДоходовРасходовНФО.Добавить("42627");
	мВидыДоходовРасходовНФО.Добавить("42628");
	мВидыДоходовРасходовНФО.Добавить("42643");
	мВидыДоходовРасходовНФО.Добавить("42644");
	мВидыДоходовРасходовНФО.Добавить("42645");
	мВидыДоходовРасходовНФО.Добавить("42646");
	мВидыДоходовРасходовНФО.Добавить("42647");
	мВидыДоходовРасходовНФО.Добавить("42648");
	мВидыДоходовРасходовНФО.Добавить("42649");
	мВидыДоходовРасходовНФО.Добавить("42650");
	мВидыДоходовРасходовНФО.Добавить("42651");
	мВидыДоходовРасходовНФО.Добавить("42652");
	мВидыДоходовРасходовНФО.Добавить("42653");
	мВидыДоходовРасходовНФО.Добавить("42654");
	мВидыДоходовРасходовНФО.Добавить("42655");
	мВидыДоходовРасходовНФО.Добавить("42656");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "Доходы (расходы), связанные с отнесением на финансовый результат разницы между стоимостью приобретения финансовых инструментов и их справедливой стоимостью при первоначальном признании", "-", "!ДО", "71504", "Оборот за период #Период# по дебету счета 71504 по ОФР 42615, 42616, 42617, 42618, 42619, 42620, 42621, 42622, 42623, 42624, 42625, 42626, 42627, 42628, 42643, 42644, 42645, 42646, 42647, 42648, 42649, 42650, 42651, 42652, 42653, 42654, 42655, 42656");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("32101");
	мВидыДоходовРасходовНФО.Добавить("32102");
	мВидыДоходовРасходовНФО.Добавить("32201");
	мВидыДоходовРасходовНФО.Добавить("32202");
	мВидыДоходовРасходовНФО.Добавить("32203");
	мВидыДоходовРасходовНФО.Добавить("32204");
	мВидыДоходовРасходовНФО.Добавить("32205");
	мВидыДоходовРасходовНФО.Добавить("32206");
	мВидыДоходовРасходовНФО.Добавить("32207");
	мВидыДоходовРасходовНФО.Добавить("32208");
	мВидыДоходовРасходовНФО.Добавить("32209");
	мВидыДоходовРасходовНФО.Добавить("32210");
	мВидыДоходовРасходовНФО.Добавить("32211");
	мВидыДоходовРасходовНФО.Добавить("32212");
	мВидыДоходовРасходовНФО.Добавить("32213");
	мВидыДоходовРасходовНФО.Добавить("32214");
	мВидыДоходовРасходовНФО.Добавить("32215");
	мВидыДоходовРасходовНФО.Добавить("32301");
	мВидыДоходовРасходовНФО.Добавить("32302");
	мВидыДоходовРасходовНФО.Добавить("32401");
	мВидыДоходовРасходовНФО.Добавить("32402");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "Прочее", "+", "!КО", "71501", "Оборот за период #Период# по кредету счета 71501 по ОФР 32101, 32102, 32201, 32202, 32203, 32204, 32205, 32206, 32207, 32208, 32209, 32210, 32211, 32212, 32213, 32214, 32215, 32301, 32302, 32401, 32402");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("41101");
	мВидыДоходовРасходовНФО.Добавить("41102");
	мВидыДоходовРасходовНФО.Добавить("41201");
	мВидыДоходовРасходовНФО.Добавить("41202");
	мВидыДоходовРасходовНФО.Добавить("41203");
	мВидыДоходовРасходовНФО.Добавить("41204");
	мВидыДоходовРасходовНФО.Добавить("41205");
	мВидыДоходовРасходовНФО.Добавить("41206");
	мВидыДоходовРасходовНФО.Добавить("41207");
	мВидыДоходовРасходовНФО.Добавить("41208");
	мВидыДоходовРасходовНФО.Добавить("41209");
	мВидыДоходовРасходовНФО.Добавить("41210");
	мВидыДоходовРасходовНФО.Добавить("41211");
	мВидыДоходовРасходовНФО.Добавить("41212");
	мВидыДоходовРасходовНФО.Добавить("41213");
	мВидыДоходовРасходовНФО.Добавить("41214");
	мВидыДоходовРасходовНФО.Добавить("41215");
	мВидыДоходовРасходовНФО.Добавить("41301");
	мВидыДоходовРасходовНФО.Добавить("41302");
	мВидыДоходовРасходовНФО.Добавить("41401");
	мВидыДоходовРасходовНФО.Добавить("41402");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "Прочее", "-", "!ДО", "71502", "Оборот за период #Период# по дебету счета 71502 по ОФР 41101, 41102, 41201, 41202, 41203, 41204, 41205, 41206, 41207, 41208, 41209, 41210, 41211, 41212, 41213, 41214, 41215, 41301, 41302, 41401, 41402");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("33401");
	мВидыДоходовРасходовНФО.Добавить("33402");
	мВидыДоходовРасходовНФО.Добавить("33403");
	мВидыДоходовРасходовНФО.Добавить("33404");
	мВидыДоходовРасходовНФО.Добавить("33405");
	мВидыДоходовРасходовНФО.Добавить("33406");
	мВидыДоходовРасходовНФО.Добавить("33407");
	мВидыДоходовРасходовНФО.Добавить("33408");
	мВидыДоходовРасходовНФО.Добавить("33409");
	мВидыДоходовРасходовНФО.Добавить("33410");
	мВидыДоходовРасходовНФО.Добавить("33411");
	мВидыДоходовРасходовНФО.Добавить("33412");
	мВидыДоходовРасходовНФО.Добавить("33413");
	мВидыДоходовРасходовНФО.Добавить("33414");
	мВидыДоходовРасходовНФО.Добавить("33501");
	мВидыДоходовРасходовНФО.Добавить("33502");
	мВидыДоходовРасходовНФО.Добавить("33503");
	мВидыДоходовРасходовНФО.Добавить("33504");
	мВидыДоходовРасходовНФО.Добавить("33505");
	мВидыДоходовРасходовНФО.Добавить("33506");
	мВидыДоходовРасходовНФО.Добавить("33507");
	мВидыДоходовРасходовНФО.Добавить("33508");
	мВидыДоходовРасходовНФО.Добавить("33509");
	мВидыДоходовРасходовНФО.Добавить("33510");
	мВидыДоходовРасходовНФО.Добавить("33511");
	мВидыДоходовРасходовНФО.Добавить("33512");
	мВидыДоходовРасходовНФО.Добавить("33513");
	мВидыДоходовРасходовНФО.Добавить("33514");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "Прочее", "+", "!КО", "71503", "Оборот за период #Период# по кредету счета 71503 по ОФР 33401, 33402, 33403, 33404, 33405, 33406, 33407, 33408, 33409, 33410, 33411, 33412, 33413, 33414, 33501, 33502, 33503, 33504, 33505, 33506, 33507, 33508, 33509, 33510, 33511, 33512, 33513, 33514");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("42401");
	мВидыДоходовРасходовНФО.Добавить("42402");
	мВидыДоходовРасходовНФО.Добавить("42403");
	мВидыДоходовРасходовНФО.Добавить("42404");
	мВидыДоходовРасходовНФО.Добавить("42405");
	мВидыДоходовРасходовНФО.Добавить("42406");
	мВидыДоходовРасходовНФО.Добавить("42407");
	мВидыДоходовРасходовНФО.Добавить("42408");
	мВидыДоходовРасходовНФО.Добавить("42409");
	мВидыДоходовРасходовНФО.Добавить("42410");
	мВидыДоходовРасходовНФО.Добавить("42411");
	мВидыДоходовРасходовНФО.Добавить("42412");
	мВидыДоходовРасходовНФО.Добавить("42413");
	мВидыДоходовРасходовНФО.Добавить("42414");
	мВидыДоходовРасходовНФО.Добавить("42501");
	мВидыДоходовРасходовНФО.Добавить("42502");
	мВидыДоходовРасходовНФО.Добавить("42503");
	мВидыДоходовРасходовНФО.Добавить("42504");
	мВидыДоходовРасходовНФО.Добавить("42505");
	мВидыДоходовРасходовНФО.Добавить("42506");
	мВидыДоходовРасходовНФО.Добавить("42507");
	мВидыДоходовРасходовНФО.Добавить("42508");
	мВидыДоходовРасходовНФО.Добавить("42509");
	мВидыДоходовРасходовНФО.Добавить("42510");
	мВидыДоходовРасходовНФО.Добавить("42511");
	мВидыДоходовРасходовНФО.Добавить("42512");
	мВидыДоходовРасходовНФО.Добавить("42513");
	мВидыДоходовРасходовНФО.Добавить("42514");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "Прочее", "-", "!ДО", "71504", "Оборот за период #Период# по дебету счета 71504 по ОФР 42401, 42402, 42403, 42404, 42405, 42406, 42407, 42408, 42409, 42410, 42411, 42412, 42413, 42414, 42501, 42502, 42503, 42504, 42505, 42506, 42507, 42508, 42509, 42510, 42511, 42512, 42513, 42514");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ОбщиеИАдминистративныеРасходыСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	стрОтборВирт = "#СводноМинус" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54201");
	мВидыДоходовРасходовНФО.Добавить("54202");
	мВидыДоходовРасходовНФО.Добавить("54203");
	мВидыДоходовРасходовНФО.Добавить("54204");
	мВидыДоходовРасходовНФО.Добавить("54205");
	мВидыДоходовРасходовНФО.Добавить("54206");
	мВидыДоходовРасходовНФО.Добавить("54207");
	мВидыДоходовРасходовНФО.Добавить("54208");
	мВидыДоходовРасходовНФО.Добавить("55101");
	мВидыДоходовРасходовНФО.Добавить("55102");
	мВидыДоходовРасходовНФО.Добавить("55103");
	мВидыДоходовРасходовНФО.Добавить("55104");
	мВидыДоходовРасходовНФО.Добавить("55105");
	мВидыДоходовРасходовНФО.Добавить("55106");
	мВидыДоходовРасходовНФО.Добавить("55107");
	мВидыДоходовРасходовНФО.Добавить("55108");
	мВидыДоходовРасходовНФО.Добавить("55109");
	мВидыДоходовРасходовНФО.Добавить("55110");
	мВидыДоходовРасходовНФО.Добавить("55111");
	мВидыДоходовРасходовНФО.Добавить("55112");
	мВидыДоходовРасходовНФО.Добавить("55113");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П01", "Расходы на персонал", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54201, 54202, 54203, 54204, 54205, 54206, 54207, 54208, 55101, 55102, 55103, 55104, 55105, 55106, 55107, 55108, 55109, 55110, 55111, 55112, 55113");
	ДобавитьСчетВТаблицуСчетов("П01", "Расходы на персонал", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 54201, 54202, 54203, 54204, 54205, 54206, 54207, 54208, 55101, 55102, 55103, 55104, 55105, 55106, 55107, 55108, 55109, 55110, 55111, 55112, 55113");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55408");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "Представительские расходы", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55408");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55301");
	мВидыДоходовРасходовНФО.Добавить("55302");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "Амортизация основных средств", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55301, 55302");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55303");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "Амортизация программного обеспечения и прочих нематериальных активов", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55303");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55703");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "Вознаграждение управляющей компании", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55703");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55704");
	мВидыДоходовРасходовНФО.Добавить("55706");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "Вознаграждение специализированному депозитарию", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55704, 55706");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55401");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П07", "Расходы по операционной аренде", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55401");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	стрОтборВирт = "#СводноМинус" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54101");
	мВидыДоходовРасходовНФО.Добавить("54102");
	мВидыДоходовРасходовНФО.Добавить("54103");
	мВидыДоходовРасходовНФО.Добавить("54104");
	мВидыДоходовРасходовНФО.Добавить("54105");
	мВидыДоходовРасходовНФО.Добавить("54106");
	мВидыДоходовРасходовНФО.Добавить("54107");
	мВидыДоходовРасходовНФО.Добавить("55201");
	мВидыДоходовРасходовНФО.Добавить("55202");
	мВидыДоходовРасходовНФО.Добавить("55203");
	мВидыДоходовРасходовНФО.Добавить("55204");
	мВидыДоходовРасходовНФО.Добавить("55205");
	мВидыДоходовРасходовНФО.Добавить("55206");
	мВидыДоходовРасходовНФО.Добавить("55207");
	мВидыДоходовРасходовНФО.Добавить("55208");
	мВидыДоходовРасходовНФО.Добавить("55209");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П08", "Расходы по операциям с основными средствами и нематериальными активами", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54101, 54102, 54103, 54104, 54105, 54106, 54107, 55201, 55202, 55203, 55204, 55205, 55206, 55207, 55208, 55209");
	ДобавитьСчетВТаблицуСчетов("П08", "Расходы по операциям с основными средствами и нематериальными активами", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 54101, 54102, 54103, 54104, 54105, 54106, 54107, 55201, 55202, 55203, 55204, 55205, 55206, 55207, 55208, 55209");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55406");
	мВидыДоходовРасходовНФО.Добавить("55409");
	мВидыДоходовРасходовНФО.Добавить("55410");
	мВидыДоходовРасходовНФО.Добавить("55411");
	мВидыДоходовРасходовНФО.Добавить("55415");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П09", "Профессиональные услуги (охрана, связь и другие)", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55406, 55409, 55410, 55411, 55415");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55412");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П10", "Расходы по страхованию", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55412");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53803");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П10", "Расходы по страхованию", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 53803");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55407");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П11", "Реклама и маркетинг", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55407");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55413");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П12", "Прочие налоги, за исключением налога на прибыль", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55413");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55602");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П13", "Судебные и арбитражные издержки", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55602");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55415");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П14", "Юридические и консультационные услуги", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55415");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	стрОтборВирт = "#СводноМинус" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54301");
	мВидыДоходовРасходовНФО.Добавить("54303");
	мВидыДоходовРасходовНФО.Добавить("54304");
	мВидыДоходовРасходовНФО.Добавить("55501");
	мВидыДоходовРасходовНФО.Добавить("55503");
	мВидыДоходовРасходовНФО.Добавить("55504");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П15", "Расходы на создание резервов - оценочных обязательств", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54301, 54303, 54304, 55501, 55503, 55504");
	ДобавитьСчетВТаблицуСчетов("П15", "Расходы на создание резервов - оценочных обязательств", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 54301, 54303, 54304, 55501, 55503, 55504");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55701");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П16", "Расходы по договорам на оказание услуг по ведению пенсионных счетов", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55701");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55702");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П17", "Расходы на информирование вкладчиков, участников и застрахованных лиц о состоянии счетов", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55702");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55705");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П18", "Расходы на доставку пенсий", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55705");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55405");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П19", "Командировочные расходы", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55405");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53101");
	мВидыДоходовРасходовНФО.Добавить("53102");
	мВидыДоходовРасходовНФО.Добавить("53103");
	мВидыДоходовРасходовНФО.Добавить("53104");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П20", "Услуги кредитных организаций и банков-нерезидентов", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 53101, 53102, 53103, 53104");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53401");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П21", "Неустойки, штрафы, пени", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 53401");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55601");
	мВидыДоходовРасходовНФО.Добавить("55603");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П21", "Неустойки, штрафы, пени", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55601, 55603");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53105");
	мВидыДоходовРасходовНФО.Добавить("53106");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П22", "Прочее", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 53105, 53106");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53105");
	мВидыДоходовРасходовНФО.Добавить("53106");
	мВидыДоходовРасходовНФО.Добавить("55402");
	мВидыДоходовРасходовНФО.Добавить("55403");
	мВидыДоходовРасходовНФО.Добавить("55404");
	мВидыДоходовРасходовНФО.Добавить("55414");
	мВидыДоходовРасходовНФО.Добавить("55416");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П22", "Прочее", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 53105, 53106, 55402, 55403, 55404, 55414, 55416");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ПрочиеДоходыСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	стрОтборВирт = "#СводноПлюс" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("35101");
	мВидыДоходовРасходовНФО.Добавить("35102");
	мВидыДоходовРасходовНФО.Добавить("35103");
	мВидыДоходовРасходовНФО.Добавить("35201");
	мВидыДоходовРасходовНФО.Добавить("35202");
	мВидыДоходовРасходовНФО.Добавить("35203");
	мВидыДоходовРасходовНФО.Добавить("35204");
	мВидыДоходовРасходовНФО.Добавить("35205");
	мВидыДоходовРасходовНФО.Добавить("35206");
	мВидыДоходовРасходовНФО.Добавить("35207");
	мВидыДоходовРасходовНФО.Добавить("35208");
	мВидыДоходовРасходовНФО.Добавить("35209");
	мВидыДоходовРасходовНФО.Добавить("35210");
	мВидыДоходовРасходовНФО.Добавить("35211");
	мВидыДоходовРасходовНФО.Добавить("35212");
	мВидыДоходовРасходовНФО.Добавить("35213");
	мВидыДоходовРасходовНФО.Добавить("35214");
	мВидыДоходовРасходовНФО.Добавить("35215");
	мВидыДоходовРасходовНФО.Добавить("35301");
	мВидыДоходовРасходовНФО.Добавить("35302");
	мВидыДоходовРасходовНФО.Добавить("35401");
	мВидыДоходовРасходовНФО.Добавить("35402");
	мВидыДоходовРасходовНФО.Добавить("35403");
	мВидыДоходовРасходовНФО.Добавить("45101");
	мВидыДоходовРасходовНФО.Добавить("45102");
	мВидыДоходовРасходовНФО.Добавить("45103");
	мВидыДоходовРасходовНФО.Добавить("45201");
	мВидыДоходовРасходовНФО.Добавить("45202");
	мВидыДоходовРасходовНФО.Добавить("45203");
	мВидыДоходовРасходовНФО.Добавить("45204");
	мВидыДоходовРасходовНФО.Добавить("45205");
	мВидыДоходовРасходовНФО.Добавить("45206");
	мВидыДоходовРасходовНФО.Добавить("45207");
	мВидыДоходовРасходовНФО.Добавить("45208");
	мВидыДоходовРасходовНФО.Добавить("45209");
	мВидыДоходовРасходовНФО.Добавить("45210");
	мВидыДоходовРасходовНФО.Добавить("45211");
	мВидыДоходовРасходовНФО.Добавить("45212");
	мВидыДоходовРасходовНФО.Добавить("45213");
	мВидыДоходовРасходовНФО.Добавить("45214");
	мВидыДоходовРасходовНФО.Добавить("45215");
	мВидыДоходовРасходовНФО.Добавить("45301");
	мВидыДоходовРасходовНФО.Добавить("45302");
	мВидыДоходовРасходовНФО.Добавить("45401");
	мВидыДоходовРасходовНФО.Добавить("45402");
	мВидыДоходовРасходовНФО.Добавить("45403");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П01", "Доходы по полученным кредитам, привлеченным средствам и выпущенным долговым ценным бумагам", "+", "!КО", "71507", "Оборот за период #Период# по кредету счета 71507 по ОФР 35101, 35102, 35103, 35201, 35202, 35203, 35204, 35205, 35206, 35207, 35208, 35209, 35210, 35211, 35212, 35213, 35214, 35215, 35301, 35302, 35401, 35402, 35403, 45101, 45102, 45103, 45201, 45202, 45203, 45204, 45205, 45206, 45207, 45208, 45209, 45210, 45211, 45212, 45213, 45214, 45215, 45301, 45302, 45401, 45402, 45403");
	ДобавитьСчетВТаблицуСчетов("П01", "Доходы по полученным кредитам, привлеченным средствам и выпущенным долговым ценным бумагам", "-", "!ДО", "71508", "Оборот за период #Период# по дебету счета 71508 по ОФР 35101, 35102, 35103, 35201, 35202, 35203, 35204, 35205, 35206, 35207, 35208, 35209, 35210, 35211, 35212, 35213, 35214, 35215, 35301, 35302, 35401, 35402, 35403, 45101, 45102, 45103, 45201, 45202, 45203, 45204, 45205, 45206, 45207, 45208, 45209, 45210, 45211, 45212, 45213, 45214, 45215, 45301, 45302, 45401, 45402, 45403");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52301");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "Доходы от аренды, кроме аренды инвестиционного имущества", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701 по ОФР 52301");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	стрОтборВирт = "#СводноПлюс" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52201");
	мВидыДоходовРасходовНФО.Добавить("52202");
	мВидыДоходовРасходовНФО.Добавить("52203");
	мВидыДоходовРасходовНФО.Добавить("52204");
	мВидыДоходовРасходовНФО.Добавить("53301");
	мВидыДоходовРасходовНФО.Добавить("53302");
	мВидыДоходовРасходовНФО.Добавить("53303");
	мВидыДоходовРасходовНФО.Добавить("53304");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "Доходы от восстановления (уменьшения) сумм резервов под обесценение прочих активов", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701 по ОФР 52201, 52202, 52203, 52204, 53301, 53302, 53303, 53304");
	ДобавитьСчетВТаблицуСчетов("П03", "Доходы от восстановления (уменьшения) сумм резервов под обесценение прочих активов", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 52201, 52202, 52203, 52204, 53301, 53302, 53303, 53304");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54406");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "Доходы от списания кредиторской задолженности, не связанной с деятельностью в качестве страховщика по обязательному пенсионному страхованию, деятельностью по негосударственному пенсионному обеспечению", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54406");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52401");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "Неустойки (штрафы, пени), поступления в возмещение убытков", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701 по ОФР 52401");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54401");
	мВидыДоходовРасходовНФО.Добавить("54403");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П05", "Неустойки (штрафы, пени), поступления в возмещение убытков", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54401, 54403");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	стрОтборВирт = "#СводноПлюс" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54101");
	мВидыДоходовРасходовНФО.Добавить("54102");
	мВидыДоходовРасходовНФО.Добавить("54103");
	мВидыДоходовРасходовНФО.Добавить("54104");
	мВидыДоходовРасходовНФО.Добавить("54105");
	мВидыДоходовРасходовНФО.Добавить("54106");
	мВидыДоходовРасходовНФО.Добавить("54107");
	мВидыДоходовРасходовНФО.Добавить("55201");
	мВидыДоходовРасходовНФО.Добавить("55202");
	мВидыДоходовРасходовНФО.Добавить("55203");
	мВидыДоходовРасходовНФО.Добавить("55204");
	мВидыДоходовРасходовНФО.Добавить("55205");
	мВидыДоходовРасходовНФО.Добавить("55206");
	мВидыДоходовРасходовНФО.Добавить("55207");
	мВидыДоходовРасходовНФО.Добавить("55208");
	мВидыДоходовРасходовНФО.Добавить("55209");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П06", "Доходы по операциям с основными средствами и нематериальными активами", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54101, 54102, 54103, 54104, 54105, 54106, 54107, 55201, 55202, 55203, 55204, 55205, 55206, 55207, 55208, 55209");
	ДобавитьСчетВТаблицуСчетов("П06", "Доходы по операциям с основными средствами и нематериальными активами", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71801 по ОФР 54101, 54102, 54103, 54104, 54105, 54106, 54107, 55201, 55202, 55203, 55204, 55205, 55206, 55207, 55208, 55209");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	стрОтборВирт = "#СводноПлюс" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54301");
	мВидыДоходовРасходовНФО.Добавить("54303");
	мВидыДоходовРасходовНФО.Добавить("54304");
	мВидыДоходовРасходовНФО.Добавить("55501");
	мВидыДоходовРасходовНФО.Добавить("55503");
	мВидыДоходовРасходовНФО.Добавить("55504");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П07", "Доходы от восстановления сумм резервов - оценочных обязательств некредитного характера", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54301, 54303, 54304, 55501, 55503, 55504");
	ДобавитьСчетВТаблицуСчетов("П07", "Доходы от восстановления сумм резервов - оценочных обязательств некредитного характера", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 54301, 54303, 54304, 55501, 55503, 55504");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52802");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П08", "Прочие доходы", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701 по ОФР 52802");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54402");
	мВидыДоходовРасходовНФО.Добавить("54404");
	мВидыДоходовРасходовНФО.Добавить("54405");
	мВидыДоходовРасходовНФО.Добавить("54407");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П08", "Прочие доходы", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54402, 54404, 54405, 54407");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	стрОтборВирт = "#СводноПлюс" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52701");
	мВидыДоходовРасходовНФО.Добавить("52702");
	мВидыДоходовРасходовНФО.Добавить("52703");
	мВидыДоходовРасходовНФО.Добавить("52704");
	мВидыДоходовРасходовНФО.Добавить("53701");
	мВидыДоходовРасходовНФО.Добавить("53702");
	мВидыДоходовРасходовНФО.Добавить("53703");
	мВидыДоходовРасходовНФО.Добавить("53704");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П08", "Прочие доходы", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701 по ОФР 52701, 52702, 52703, 52704, 53701, 53702, 53703, 53704");
	ДобавитьСчетВТаблицуСчетов("П08", "Прочие доходы", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 52701, 52702, 52703, 52704, 53701, 53702, 53703, 53704");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	стрОтборВирт = "#СводноПлюс" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("54201");
	мВидыДоходовРасходовНФО.Добавить("54202");
	мВидыДоходовРасходовНФО.Добавить("54203");
	мВидыДоходовРасходовНФО.Добавить("54204");
	мВидыДоходовРасходовНФО.Добавить("54205");
	мВидыДоходовРасходовНФО.Добавить("54206");
	мВидыДоходовРасходовНФО.Добавить("54207");
	мВидыДоходовРасходовНФО.Добавить("54208");
	мВидыДоходовРасходовНФО.Добавить("55101");
	мВидыДоходовРасходовНФО.Добавить("55102");
	мВидыДоходовРасходовНФО.Добавить("55103");
	мВидыДоходовРасходовНФО.Добавить("55104");
	мВидыДоходовРасходовНФО.Добавить("55105");
	мВидыДоходовРасходовНФО.Добавить("55106");
	мВидыДоходовРасходовНФО.Добавить("55107");
	мВидыДоходовРасходовНФО.Добавить("55108");
	мВидыДоходовРасходовНФО.Добавить("55109");
	мВидыДоходовРасходовНФО.Добавить("55110");
	мВидыДоходовРасходовНФО.Добавить("55111");
	мВидыДоходовРасходовНФО.Добавить("55112");
	мВидыДоходовРасходовНФО.Добавить("55113");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П08", "Прочие доходы", "+", "!КО", "71801", "Оборот за период #Период# по кредету счета 71801 по ОФР 54201, 54202, 54203, 54204, 54205, 54206, 54207, 54208, 55101, 55102, 55103, 55104, 55105, 55106, 55107, 55108, 55109, 55110, 55111, 55112, 55113");
	ДобавитьСчетВТаблицуСчетов("П08", "Прочие доходы", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 54201, 54202, 54203, 54204, 54205, 54206, 54207, 54208, 55101, 55102, 55103, 55104, 55105, 55106, 55107, 55108, 55109, 55110, 55111, 55112, 55113");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ПрочиеРасходыСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	стрОтборВирт = "#СводноМинус" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("35101");
	мВидыДоходовРасходовНФО.Добавить("35102");
	мВидыДоходовРасходовНФО.Добавить("35103");
	мВидыДоходовРасходовНФО.Добавить("35201");
	мВидыДоходовРасходовНФО.Добавить("35202");
	мВидыДоходовРасходовНФО.Добавить("35203");
	мВидыДоходовРасходовНФО.Добавить("35204");
	мВидыДоходовРасходовНФО.Добавить("35205");
	мВидыДоходовРасходовНФО.Добавить("35206");
	мВидыДоходовРасходовНФО.Добавить("35207");
	мВидыДоходовРасходовНФО.Добавить("35208");
	мВидыДоходовРасходовНФО.Добавить("35209");
	мВидыДоходовРасходовНФО.Добавить("35210");
	мВидыДоходовРасходовНФО.Добавить("35211");
	мВидыДоходовРасходовНФО.Добавить("35212");
	мВидыДоходовРасходовНФО.Добавить("35213");
	мВидыДоходовРасходовНФО.Добавить("35214");
	мВидыДоходовРасходовНФО.Добавить("35215");
	мВидыДоходовРасходовНФО.Добавить("35301");
	мВидыДоходовРасходовНФО.Добавить("35302");
	мВидыДоходовРасходовНФО.Добавить("35401");
	мВидыДоходовРасходовНФО.Добавить("35402");
	мВидыДоходовРасходовНФО.Добавить("35403");
	мВидыДоходовРасходовНФО.Добавить("45101");
	мВидыДоходовРасходовНФО.Добавить("45102");
	мВидыДоходовРасходовНФО.Добавить("45103");
	мВидыДоходовРасходовНФО.Добавить("45201");
	мВидыДоходовРасходовНФО.Добавить("45202");
	мВидыДоходовРасходовНФО.Добавить("45203");
	мВидыДоходовРасходовНФО.Добавить("45204");
	мВидыДоходовРасходовНФО.Добавить("45205");
	мВидыДоходовРасходовНФО.Добавить("45206");
	мВидыДоходовРасходовНФО.Добавить("45207");
	мВидыДоходовРасходовНФО.Добавить("45208");
	мВидыДоходовРасходовНФО.Добавить("45209");
	мВидыДоходовРасходовНФО.Добавить("45210");
	мВидыДоходовРасходовНФО.Добавить("45211");
	мВидыДоходовРасходовНФО.Добавить("45212");
	мВидыДоходовРасходовНФО.Добавить("45213");
	мВидыДоходовРасходовНФО.Добавить("45214");
	мВидыДоходовРасходовНФО.Добавить("45215");
	мВидыДоходовРасходовНФО.Добавить("45301");
	мВидыДоходовРасходовНФО.Добавить("45302");
	мВидыДоходовРасходовНФО.Добавить("45401");
	мВидыДоходовРасходовНФО.Добавить("45402");
	мВидыДоходовРасходовНФО.Добавить("45403");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П01", "Расходы (кроме процентных) по полученным кредитам, привлеченным средствам и выпущенным долговым ценным бумагам", "+", "!КО", "71507", "Оборот за период #Период# по кредету счета 71507 по ОФР 35101, 35102, 35103, 35201, 35202, 35203, 35204, 35205, 35206, 35207, 35208, 35209, 35210, 35211, 35212, 35213, 35214, 35215, 35301, 35302, 35401, 35402, 35403, 45101, 45102, 45103, 45201, 45202, 45203, 45204, 45205, 45206, 45207, 45208, 45209, 45210, 45211, 45212, 45213, 45214, 45215, 45301, 45302, 45401, 45402, 45403");
	ДобавитьСчетВТаблицуСчетов("П01", "Расходы (кроме процентных) по полученным кредитам, привлеченным средствам и выпущенным долговым ценным бумагам", "-", "!ДО", "71508", "Оборот за период #Период# по дебету счета 71508 по ОФР 35101, 35102, 35103, 35201, 35202, 35203, 35204, 35205, 35206, 35207, 35208, 35209, 35210, 35211, 35212, 35213, 35214, 35215, 35301, 35302, 35401, 35402, 35403, 45101, 45102, 45103, 45201, 45202, 45203, 45204, 45205, 45206, 45207, 45208, 45209, 45210, 45211, 45212, 45213, 45214, 45215, 45301, 45302, 45401, 45402, 45403");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	стрОтборВирт = "#СводноМинус" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52201");
	мВидыДоходовРасходовНФО.Добавить("52202");
	мВидыДоходовРасходовНФО.Добавить("52203");
	мВидыДоходовРасходовНФО.Добавить("52204");
	мВидыДоходовРасходовНФО.Добавить("53301");
	мВидыДоходовРасходовНФО.Добавить("53302");
	мВидыДоходовРасходовНФО.Добавить("53303");
	мВидыДоходовРасходовНФО.Добавить("53304");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П02", "Расходы по созданию резервов под обесценение по прочим активам", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701 по ОФР 52201, 52202, 52203, 52204, 53301, 53302, 53303, 53304");
	ДобавитьСчетВТаблицуСчетов("П02", "Расходы по созданию резервов под обесценение по прочим активам", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 52201, 52202, 52203, 52204, 53301, 53302, 53303, 53304");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("55607");
	мВидыДоходовРасходовНФО.Добавить("55608");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П03", "Расходы на благотворительность, отдых, осуществление спортивных мероприятий и мероприятий культурно-просветительского характера", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55607, 55608");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("53803");
	мВидыДоходовРасходовНФО.Добавить("55604");
	мВидыДоходовРасходовНФО.Добавить("55605");
	мВидыДоходовРасходовНФО.Добавить("55606");
	мВидыДоходовРасходовНФО.Добавить("55609");
	мВидыДоходовРасходовНФО.Добавить("55611");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "Прочие расходы", "-", "!ДО", "71802", "Оборот за период #Период# по дебету счета 71802 по ОФР 55604, 55605, 55606, 55609, 55611, 53803");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	стрОтборВирт = "#СводноМинус" + СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО;
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("52701");
	мВидыДоходовРасходовНФО.Добавить("52702");
	мВидыДоходовРасходовНФО.Добавить("52703");
	мВидыДоходовРасходовНФО.Добавить("52704");
	мВидыДоходовРасходовНФО.Добавить("53701");
	мВидыДоходовРасходовНФО.Добавить("53702");
	мВидыДоходовРасходовНФО.Добавить("53703");
	мВидыДоходовРасходовНФО.Добавить("53704");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П04", "Прочие расходы", "+", "!КО", "71701", "Оборот за период #Период# по кредету счета 71701 по ОФР 52701, 52702, 52703, 52704, 53701, 53702, 53703, 53704");
	ДобавитьСчетВТаблицуСчетов("П04", "Прочие расходы", "-", "!ДО", "71702", "Оборот за период #Период# по дебету счета 71702 по ОФР 52701, 52702, 52703, 52704, 53701, 53702, 53703, 53704");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , стрОтборВирт);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ОтчетТитульнаяСтраница(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("37201");
	мВидыДоходовРасходовНФО.Добавить("37202");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П26", "Доходы за вычетом расходов (расходы за вычетом доходов) по операциям с иностранной валютой", "+", "!КО", "71511", "Оборот за период #Период# по кредиту счета 71511 по ОФР 37201, 37202");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
	мТаблицаСчетов.Очистить();
	мВидыДоходовРасходовНФО = Новый Массив;
	мВидыДоходовРасходовНФО.Добавить("47102");
	мВидыДоходовРасходовНФО.Добавить("47201");
	мВидыДоходовРасходовНФО.Добавить("47202");
	Запрос.УстановитьПараметр("мВидыДоходовРасходовНФО", мВидыДоходовРасходовНФО);
	ДобавитьСчетВТаблицуСчетов("П26", "Доходы за вычетом расходов (расходы за вычетом доходов) по операциям с иностранной валютой", "-", "!ДО", "71512", "Оборот за период #Период# по дебету счета 71512 по ОФР 47102, 47201, 47202");
	ЗаполнитьРазделПоСпискуСчетовЗаПоследнийКварталОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "01", "02", "03", , , , СтруктураПеременныхДляОтбора.ВидыДоходовРасходовНФО);
	
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОтчетТитульнаяСтраница()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОтчетТитульнаяСтраница"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ОтчетТитульнаяСтраница(ТекРаздел, ИмяРаздела);
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ОтчетТитульнаяСтраница(ТекСтрока.ТабличныйДокумент, ИмяРаздела);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ДоходыЗаВычетомРасходов2017()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ДоходыЗаВычетомРасходов2017"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ДоходыЗаВычетомРасходовСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
			
	РасчетРаздела_ДоходыЗаВычетомРасходов(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПроцентныеДоходы()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПроцентныеДоходы"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПроцентныеДоходыСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
			
	РасчетРаздела_ПроцентныеДоходы(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПрочиеИнвестиционныеДоходыЗаВычетомРасходов()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПрочиеИнвестиционныеДоходыЗаВычетомРасходов"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПрочиеИнвестиционныеДоходыЗаВычетомРасходовСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
			
	РасчетРаздела_ПрочиеИнвестиционныеДоходыЗаВычетомРасходов(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОбщиеИАдминистративныеРасходы()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОбщиеИАдминистративныеРасходы"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ОбщиеИАдминистративныеРасходыСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
			
	РасчетРаздела_ОбщиеИАдминистративныеРасходы(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПрочиеДоходы()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПрочиеДоходы"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПрочиеДоходыСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
			
	РасчетРаздела_ПрочиеДоходы(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПрочиеРасходы()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПрочиеРасходы"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПрочиеРасходыСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
			
	РасчетРаздела_ПрочиеРасходы(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры


#КонецОбласти 

#Область ПроцедурыРасчета

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРаздела, ИмяЯчейки, Ячейка)
	// #ЧисткаИтогов
	
	Если КонсолидированнаяОтчетностьКлиентСервер.ИтоговаяЯчейкаПервыйРасчет(ЭтаФорма, ИмяРаздела, ИмяЯчейки, Ячейка)
		Тогда
		КонсолидированнаяОтчетность.УдалитьРасшифровкуЯчейки(Адрес_ТаблицаРасшифровки, ИмяРаздела, ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейкуНачало

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейку(ИмяРазделаРезультат, РазделРезультат, ИмяЯчейкиРезультат, ИмяРазделаИсточник, ИмяЯчейкиИсточник, Множитель = 1, ИмяПоказателяРезультат = "", ИмяПоказателяИсточник = "", ДобавитьКРасчетномуЗначению = ЛОЖЬ)
	
	ИмяПоказателяИсточник_исх = ИмяПоказателяИсточник;
	ИмяПоказателяРезультат = ?(ИмяПоказателяРезультат = "", "Ячейка " + ИмяЯчейкиРезультат, ИмяПоказателяРезультат);
	ИмяПоказателяИсточник = ?(ИмяПоказателяИсточник = "", "Ячейка " + ИмяЯчейкиИсточник, ИмяПоказателяИсточник);
	
	// Определим ячейку-результат
	Попытка
		ЯчейкаРезультат = РазделРезультат.Области[ИмяЯчейкиРезультат];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: не найдена ячейка %2'"),
		ИмяРазделаРезультат,
		ИмяЯчейкиРезультат);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// #ЧисткаИтогов
	Если НЕ ДобавитьКРасчетномуЗначению Тогда
		ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРазделаРезультат, ИмяЯчейкиРезультат, ЯчейкаРезультат); 
	КонецЕсли;
	
	// Табличный документ-источник
	Если ТипЗнч(ИмяРазделаИсточник) = Тип("Строка") Тогда
		
		Попытка
			РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаИсточник))[0];
			ТабИсточник = РазделОтчета.ТабличныйДокумент;
		Исключение
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Расчет итогов по разделу %1: не найден раздел %2'"),
			ИмяРазделаРезультат,
			ИмяРазделаИсточник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	Иначе
		
		// Если передан табличный документ, значит заполнение идет с текущего раздела
		ТабИсточник = ИмяРазделаИсточник;
		РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаРезультат))[0];
		
	КонецЕсли;
	СтраницаИсточник = РазделОтчета;
	
	// Определим ячейку-источник
	Попытка
		ЯчейкаИсточник = ТабИсточник.Области[ИмяЯчейкиИсточник];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: в разделе %2 не найдена ячейка %3'"),
		ИмяРазделаРезультат,
		ИмяРазделаИсточник,
		ИмяЯчейкиИсточник);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// Определим значение - источник, умноженное на "Множитель"
	ЗначениеИсточник = ЯчейкаИсточник.Значение * Множитель;
	
	// Лобавим к значению в ячейке-результат новое значение
	ЯчейкаРезультат.Значение = ЯчейкаРезультат.Значение + КонсолидированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЗначениеИсточник, СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения, СтруктураРеквизитовФормы.мДелитель);
	
	// Определим какой должен быть знак (+/-) в расшифровке
	ЗнакВРасшифровке = ?(Множитель > 0, "+", "-");
	
	Если ИмяПоказателяИсточник_исх = ""
		и Множитель <> 1 и Множитель <> -1 
		Тогда
		МножительБезЗнака = ?(Множитель > 0, Множитель, -Множитель);
		ИмяПоказателяИсточник = ИмяПоказателяИсточник + " * " + МножительБезЗнака;
	КонецЕсли;
	
	// Сформируем текст расшифровки по шаблону: "Закладка ...., имя показателя"
	ТекстРасшифровки = "Закладка «" + СтраницаИсточник.Представление + "»";
	Если ЗначениеЗаполнено(ИмяПоказателяИсточник) Тогда
		ТекстРасшифровки = ТекстРасшифровки + ", " + ИмяПоказателяИсточник;
	КонецЕсли;
	
	// Заменим служебные команды по периоду
	стрИмяПоказателяРезультат = СтрЗаменить(ИмяПоказателяРезультат, "#ПериодТекущий#", СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода);
	стрИмяПоказателяРезультат = СтрЗаменить(стрИмяПоказателяРезультат, "#ПериодПредыдущий#", СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода);
	
	// Добавим в расшифровку
	ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейкиРезультат, стрИмяПоказателяРезультат, ЗнакВРасшифровке, ТекстРасшифровки, ЗначениеИсточник, , , , , ИмяРазделаРезультат);
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейку

&НаСервере
Процедура Расчет(ИмяРаздела = "")
	
	КонсолидированнаяОтчетностьКлиентСервер.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	Если ИмяРаздела = "" Тогда
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				Выполнить("РасчетРаздела_" + СтрЗаменить(ТекСтрока.ИмяРаздела, "2017", "") + "(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела)");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
			Выполнить("РасчетРаздела_" + СтрЗаменить(ИмяРаздела, "2017", "") + "(ТекРаздел, ИмяРаздела)");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ КонсолидированнаяОтчетностьКлиентСервер.НуженПересчетОсновногоРаздела("ТабличныйДокумент" + ИмяРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет основного раздела
	Очистить(ИмяОсновногоРаздела);
	ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяОсновногоРаздела);
	Выполнить("РасчетРаздела_" + СтрЗаменить(ИмяОсновногоРаздела, "2017", "") + "(ТекРаздел, ИмяРаздела)");
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОтчетТитульнаяСтраница(ТекРаздел, ИмяРаздела)
	
	ПоказателиОтчета = Новый Структура;
	ПоказателиОтчета.Вставить("Области", Новый Структура("П1502", Новый Структура("Значение", 0)));
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода) Тогда
		
		ТаблицаПоказателиОтчета = Неопределено;
		ДанныеОтчета = СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода.ДанныеОтчета.Получить();
		
		Если ДанныеОтчета.Свойство("ПоказателиОтчета", ТаблицаПоказателиОтчета) Тогда
			НайденныеСтроки = ТаблицаПоказателиОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОтчетТитульнаяСтраница"));
			Для каждого СтрокаПоказателей Из НайденныеСтроки Цикл
				Если ПоказателиОтчета.Области.Свойство(СтрокаПоказателей.ИмяПоказателя) Тогда
					ПоказателиОтчета.Области[СтрокаПоказателей.ИмяПоказателя].Значение = СтрокаПоказателей.Значение;
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В отчете на конец предыдущего года отсутствуют данные для заполнения");
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить отчет на конец предыдущего года");
	КонецЕсли;
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1302", "ПроцентныеДоходы", "П1502", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1303", "ПроцентныеДоходы", "П1503", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1502", "ДоходыЗаВычетомРасходов2017", "П1206", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1503", ПоказателиОтчета, "П1502", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2702", "ПрочиеИнвестиционныеДоходыЗаВычетомРасходов", "П0702", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2703", "ПрочиеИнвестиционныеДоходыЗаВычетомРасходов", "П0703", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3002", "ОбщиеИАдминистративныеРасходы", "П2302", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3003", "ОбщиеИАдминистративныеРасходы", "П2303", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3402", "ПрочиеДоходы", "П0902", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3403", "ПрочиеДоходы", "П0903", );
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3502", "ПрочиеРасходы", "П0502", );
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3503", "ПрочиеРасходы", "П0503", );
	
		Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = ?(НомКол < 10, "0" + НомКол, "" + НомКол);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П22" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П22" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П38" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П38" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П54" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П57" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П60" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П61" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П48" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П48" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П51" + СтрНомКол, ТекРаздел, "П52" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П51" + СтрНомКол, ТекРаздел, "П53" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П55" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П56" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П58" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П57" + СтрНомКол, ТекРаздел, "П59" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П62" + СтрНомКол, ТекРаздел, "П63" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П62" + СтрНомКол, ТекРаздел, "П68" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П62" + СтрНомКол, ТекРаздел, "П73" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П62" + СтрНомКол, ТекРаздел, "П78" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П62" + СтрНомКол, ТекРаздел, "П79" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П64" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П65" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П66" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П67" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П68" + СтрНомКол, ТекРаздел, "П69" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П68" + СтрНомКол, ТекРаздел, "П70" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П68" + СтрНомКол, ТекРаздел, "П71" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П68" + СтрНомКол, ТекРаздел, "П72" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П74" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П75" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П76" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П77" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П80" + СтрНомКол, ТекРаздел, "П43" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П80" + СтрНомКол, ТекРаздел, "П62" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П81" + СтрНомКол, ТекРаздел, "П42" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П81" + СтрНомКол, ТекРаздел, "П80" + СтрНомКол, 1);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ПроцентныеДоходы(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		
	КонецЦикла;
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 15 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ДоходыЗаВычетомРасходов(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0606", ТекРаздел, "П0602", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0606", ТекРаздел, "П0603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0606", ТекРаздел, "П0604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0606", ТекРаздел, "П0605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1005", 1);

	Для НомКол = 2 По 6 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);


		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);

	КонецЦикла;	
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ПрочиеИнвестиционныеДоходыЗаВычетомРасходов(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		
	КонецЦикла;
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 7 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ОбщиеИАдминистративныеРасходы(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, );
		
	КонецЦикла;
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 23 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ПрочиеДоходы(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, );
		
	КонецЦикла;
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 9 Цикл
			ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"].Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РасчетРаздела_ПрочиеРасходы(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		
	КонецЦикла;
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 5 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 


#КонецОбласти 

#КонецОбласти 

#Область НастройкиОтчета

&НаКлиенте
Процедура ОткрытьФормуНастроекЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЕдиницаИзмерения 			= ДополнительныеПараметры.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= ДополнительныеПараметры.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= ДополнительныеПараметры.ВалютаДокумента;
	ИсходныйПодписант 			= ДополнительныеПараметры.Подписант;
	ОтчетНаКонецПрошлогоГода	= ДополнительныеПараметры.ОтчетНаКонецПрошлогоГода;
	ОтчетЗаПоследнийКвартал		= ДополнительныеПараметры.ОтчетЗаПоследнийКвартал;
	
	Если ЕдиницаИзмерения <> СтруктураРеквизитовФормы.ЕдиницаИзмерения Тогда
		
		ЕдиницаИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ТочностьЕдиницыИзмерения <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		
		ТочностьЕдиницыИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ВалютаДокумента <> СтруктураРеквизитовФормы.ВалютаДокумента Тогда
		
		ВалютаДокументаПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ИсходныйПодписант <> ЭтаФорма.Подписант Тогда
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ОтчетНаКонецПрошлогоГода <> СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ОтчетЗаПоследнийКвартал <> СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	Модифицированность = Истина;
	
	СтруктураОтбора = Новый Структура("ИмяРаздела", СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета.НайтиСтроки(СтруктураОтбора)[0].ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВывода()

	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении()
	
	ТекстСообщения = НСтр("ru = 'Изменена валюта представления отчетности.
	|Перезаполнить документ?'");
	
	ПоказатьВопрос(
	Новый ОписаниеОповещения(
	"ВалютаДокументаПриИзмененииЗавершение",
	ЭтотОбъект),
	ТекстСообщения,
	РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвто();
	КонецЕсли;
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в рублях точность не может превышать 2 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в тысячах рублей точность не может превышать 3 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в миллионах рублей точность не может превышать 6 знаков'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьТочность()
	
#КонецОбласти 

#Область ЗаписьОтчета

&НаКлиенте
Процедура СохранитьНаКлиенте(ВыполняемоеОповещение=Неопределено) Экспорт

	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		ИмяСобытия = "ЗаписьРегламентированногоОтчета";
	Иначе
		ИмяСобытия = "ЗаписьНовогоРегламентированногоОтчета";
	КонецЕсли; 
	
	ЗаполнитьПоказатели();
	ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
	
		Модифицированность = Ложь;
	
		ИсторияРаботыПользователя.Добавить(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок);
		
		Оповестить(ИмяСобытия, Новый Структура("Ключ", СтруктураРеквизитовФормы.мСохраненныйДок));
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	КонсолидированнаяОтчетность.ЗаписатьОтчет(ЭтаФорма);

КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьПоказатели()

	ЭтаФорма.Показатели.Очистить();
		
	Для Каждого ТекСтрока Из РазделыОтчета Цикл
		
		Попытка
			ОбластиРаздела = ТекСтрока.ТабличныйДокумент.Области;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого ТекОбласть Из ОбластиРаздела Цикл
			
			Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Если Не ТекОбласть.СодержитЗначение Тогда
					Продолжить;
				КонецЕсли;
			Исключение
				ТекстСообщения = "Ошибка макета: раздел " + ТекСтрока.ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(ТекОбласть.Значение) Тогда
			
				Продолжить;
			
			КонецЕсли; 
			
			НоваяСтрока = ЭтаФорма.Показатели.Добавить();
			НоваяСтрока.ИмяРаздела 		= ТекСтрока.ИмяРаздела;
			НоваяСтрока.ИмяПоказателя 	= ТекОбласть.Имя;
			НоваяСтрока.Значение 		= ТекОбласть.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтаФорма.Показатели.Сортировать("ИмяРаздела, ИмяПоказателя");
	
КонецПроцедуры

#КонецОбласти 

#Область Расшифровка

&НаКлиенте
Процедура РасшифровкаНажатиеВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Адрес_Расшифровка 	= ДополнительныеПараметры.Адрес_Расшифровка;
	ИмяРаздела 			= ДополнительныеПараметры.ИмяРаздела;
	
	ИмяЯчейки = "";
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатиеЗавершение(Знач Адрес_Расшифровка, Знач ИмяРаздела, ИмяЯчейки)
	
	СтруктураПараметров = Новый Структура(
	"Адрес_Расшифровка,
	|Адрес_СтруктураВариантыЗаполнения,
	|ОсобыйАлгоритмРасшифровки",
	Адрес_Расшифровка,
	Адрес_мСтруктураВариантыЗаполнения,
	Истина);
	
	ТабДок = КонсолидированнаяОтчетность.СформироватьМакетРасшифровки(ИмяРаздела, ИмяЯчейки, СтруктураПараметров);
	
	ВывестиРасшифровкуСервер(ТабДок, ИмяЯчейки);
	
	Элементы.ГруппаРасшифровки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Новый Структура("ИмяЯчейки, Раздел", ИмяЯчейки, ИмяРаздела));
	
	ЕстьРасшифровка = (Не НайденныеСтроки.Количество() = 0);
		
	СтруктураОтбора = Новый Структура("Раздел, ИмяЯчейки", ИмяРаздела, ИмяЯчейки);
	пТаблицаРасшифровки = ТаблицаРасшифровки.Скопировать(СтруктураОтбора);
	
	Если пТаблицаРасшифровки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Адрес_Расшифровка = ПоместитьВоВременноеХранилище(пТаблицаРасшифровки, УникальныйИдентификатор);
	
	Возврат ЕстьРасшифровка;
	
КонецФункции

&НаСервере
Процедура ВывестиРасшифровкуСервер(ТабДок, ИмяСтраницы)
	
	КоличествоРасшифровок = КоличествоРасшифровок + 1;
	НомерСтраницы = Формат(КоличествоРасшифровок, "ЧГ=0");
	ИмяСтраницы = ?(ИмяСтраницы = "", "Расшифровка № " + КоличествоРасшифровок, ИмяСтраницы);
	
	ИмяЭлемента = "СтраницаРасшифровки" + НомерСтраницы;
	ТекСтраница = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Элементы.СтраницыРасшифровки);
	ТекСтраница.Заголовок = ИмяСтраницы;
	
	ИмяЭлемента = "ТабДок_Расшифровка" + НомерСтраницы;
	
	МассивДобавляемых = Новый Массив;
	МассивДобавляемых.Добавить(Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов("ТабличныйДокумент")));
	ИзменитьРеквизиты(МассивДобавляемых);
	
	ТекЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ТекСтраница);
	ТекЭлемент.ПутьКДанным = ИмяЭлемента;
	ТекЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ТекЭлемент.ГоризонтальнаяПолосаПрокрутки = Ложь;
	
	ЭтотОбъект[ИмяЭлемента] = ТабДок;
	
	Элементы.СтраницыРасшифровки.ТекущаяСтраница = ТекСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьРасшифровкуСервер()
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекРасшифровка = Элементы.СтраницыРасшифровки.ТекущаяСтраница;
	СтраницыРасшифровки = Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы;
	
	Если ТекРасшифровка = Неопределено Тогда
		ТекРасшифровка = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
	КонецЕсли;
	
	ТекРасшифровка.Видимость = Ложь;
	
	МассивУдаляемых = Новый Массив;
	МассивУдаляемых.Добавить(ТекРасшифровка.ПодчиненныеЭлементы[0].ПутьКДанным);
	ИзменитьРеквизиты( , МассивУдаляемых);
	
	Элементы.Удалить(ТекРасшифровка);
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		
	ИначеЕсли Элементы.СтраницыРасшифровки.ТекущаяСтраница = Неопределено Тогда
		
		Элементы.СтраницыРасшифровки.ТекущаяСтраница = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьНажатие(Команда)
	
	ЗаполнитьАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	ЗаполнитьАвто(ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНажатие(Команда)
	
	Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Очистить(ИмяРаздела);
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		
		Очистить(ИмяОсновногоРаздела);
		Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо сохранить документ.");
		Возврат;
	
	КонецЕсли; 
	
	ИмяФайла = "Отчет о финансовых результатах " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD");
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогСохраненияФайла.Фильтр             = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок          = "Укажите файл";
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	СписокРазделовПредыдущегоГода = КонсолидированнаяОтчетность.ПолучитьСписокРазделовПредыдущегоГода("РегламентированныйОтчетОФинансовыхРезультатах", СтруктураРеквизитовФормы.мВыбраннаяФорма, СтруктураРеквизитовФормы.НКО);
	КонсолидированнаяОтчетностьКлиент.СохранитьРегламентированныйОтчетВExcel(ЭтаФорма, ДиалогСохраненияФайла.ПолноеИмяФайла, ЭтаФорма.СохраняемыеРазделы, СписокРазделовПредыдущегоГода);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНаКлиенте();
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", 					СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", 			СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения", 	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	ПараметрыФормы.Вставить("ОтчетНаКонецПрошлогоГода", 	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	ПараметрыФормы.Вставить("Подписант", 					ЭтаФорма.Подписант);
	ПараметрыФормы.Вставить("ИсточникОтчета",				СтруктураНаименованийОтчета.ИсточникОтчета);
	ПараметрыФормы.Вставить("ВыбраннаяФорма",				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	ПараметрыФормы.Вставить("ОтчетЗаПоследнийКвартал",		СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал);
	
	ФормаНастройкиОтчета = ПолучитьФорму("Отчет." + СтруктураНаименованийОтчета.ИсточникОтчета + ".Форма.НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ЕдиницаИзмерения 			= СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= СтруктураРеквизитовФормы.ВалютаДокумента;
	Подписант 					= ЭтаФорма.Подписант;
	ОтчетНаКонецПрошлогоГода 	= СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода;
	ОтчетЗаПоследнийКвартал 	= СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал;
	
	ДополнительныеПараметры = Новый Структура("ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ОтчетНаКонецПрошлогоГода, ОтчетЗаПоследнийКвартал", ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ОтчетНаКонецПрошлогоГода, ОтчетЗаПоследнийКвартал);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуНастроекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ДоступностьОтчетаЗаПоследнийКвартал = (Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 6 или Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 9);
	ФормаНастройкиОтчета.Элементы.ОтчетЗаПоследнийКвартал.Доступность = ДоступностьОтчетаЗаПоследнийКвартал;
	
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСкрытьПоказать(Команда)
	
	Элементы.ГруппаРасшифровки.Видимость = Не Элементы.ГруппаРасшифровки.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатие(Команда)
	
	ИмяРаздела = ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	Если ИмяРаздела = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИмяЯчейки = ЭтаФорма.ТабличныйДокумент.ТекущаяОбласть.Имя;
	Исключение
		Возврат;
	КонецПопытки;
	
	Адрес_Расшифровка = "";
	
	// Считываем и помещаем данные на сервере
	РасшифровкаНайдена = РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка);
	
	Если РасшифровкаНайдена = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Расшифровка не сформирована.
		|Расшифровка формируется при нажатии на кнопку ""Заполнить"".'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	Если НЕ РасшифровкаНайдена Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка для выбранной ячейки не существует.'"));
		
		Возврат;
		
		ТекстСообщения = НСтр("ru = 'Расшифровка для выбранной ячейки не существует.
		|Показать расшифровку для всех ячеек раздела?");
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РасшифровкаНажатиеВопросЗавершение",
		ЭтотОбъект,
		Новый Структура(
		"Адрес_Расшифровка,
		|ИмяРаздела",
		Адрес_Расшифровка,
		ИмяРаздела)),
		ТекстСообщения,
		РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьРасшифровкуНажатие(Команда)
	
	ЗакрытьРасшифровкуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.СтатусОтчета = "Корректировка" Тогда
		Элементы.НомерКорректировки.Видимость = Истина;
		ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
		ЭтаФорма.НомерКорректировки = ПолучитьНомерКорректировки(ЭтаФорма.СтруктураРеквизитовФормы, ИсточникОтчета);
	Иначе
		Элементы.НомерКорректировки.Видимость = Ложь;
		ЭтаФорма.НомерКорректировки = 0;
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерКорректировки(СтруктураРеквизитовФормы, ИсточникОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕстьNULL(МАКСИМУМ(РегламентированныйОтчет.НомерКорректировки), 0) КАК НомерКорректировки
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Организация = &Организация
		|	И РегламентированныйОтчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
		|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
		|	И РегламентированныйОтчет.ВалютаДокумента = &ВалютаДокумента
		|	И РегламентированныйОтчет.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И РегламентированныйОтчет.ТочностьЕдиницыИзмерения = &ТочностьЕдиницыИзмерения
		|	И РегламентированныйОтчет.ОтчетНаКонецПрошлогоГода = &ОтчетНаКонецПрошлогоГода
		|	И РегламентированныйОтчет.ОтчетЗаПоследнийКвартал = &ОтчетЗаПоследнийКвартал
		|	И РегламентированныйОтчет.ВыбраннаяФорма = &ВыбраннаяФорма
		|	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
		|	И РегламентированныйОтчет.СтатусОтчета = &СтатусОтчета";
	
	Запрос.УстановитьПараметр("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВыбраннаяФорма", 				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", 					НачалоДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", 				СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ИсточникОтчета", 				ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", 					СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ОтчетЗаПоследнийКвартал", 		Ложь);
	Запрос.УстановитьПараметр("ОтчетНаКонецПрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	Запрос.УстановитьПараметр("СтатусОтчета", 					"Корректировка");
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТочностьЕдиницыИзмерения", 		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерКорректировки = 0;
	Если Выборка.Следующий() Тогда
		НомерКорректировки = Выборка.НомерКорректировки;
	КонецЕсли;
	Возврат НомерКорректировки + 1;		
		
КонецФункции

&НаКлиенте
Процедура НомерКорректировкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.СохранитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОФинансовыхРезультатах");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетОФинансовыхРезультатах", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		СохранитьВариантНастроекНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОФинансовыхРезультатах");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетОФинансовыхРезультатах", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		ЗагрузитьВариантНастроекНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиВарианта(Команда)
	
	ДанныеВарианта = ОткрытьФормуМодально("ОбщаяФорма.ФормаНастройкиСохраняемыхРазделов",
							Новый Структура("СохраняемыеРазделы", ЭтаФорма.СохраняемыеРазделы));
	
	Если ДанныеВарианта = Неопределено ИЛИ ДанныеВарианта = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.СохраняемыеРазделы			= ДанныеВарианта.СохраняемыеРазделы;
	
КонецПроцедуры
 
#КонецОбласти 
