Перем КонечныеОстаткиПартийКПоступлению Экспорт;
Перем КонечныеОстаткиПартийКупленныхПоРепо Экспорт;
Перем КонечныеОстаткиПартийПроданныхВРепо Экспорт;
Перем КонечныеОстаткиПартийСрочныеКонтракты Экспорт;
Перем ТаблицаПлановыхОпераций Экспорт;
Перем СписокСтратегий;
Перем ВключатьВводыВыводы;
Перем СчетДоверительногоУправленияДляУчета;

Функция СуммаИзмененияНоминала(ДатаНоминала, ЦеннаяБумага)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумаг.СуммаИзменения
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|ГДЕ
		|	НоминалыЦенныхБумаг.Период = &ДатаНоминала
		|	И НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага";

	Запрос.УстановитьПараметр("ДатаНоминала", НачалоДня(ДатаНоминала));
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаИзменения;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции 

Функция ОпределитьКоээффициентЧастичногоСписания(ЦеннаяБумага, Период)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 - НоминалыЦенныхБумаг.Номинал / (НоминалыЦенныхБумаг.Номинал + НоминалыЦенныхБумаг.СуммаИзменения) КАК Коэффициент
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|ГДЕ
		|	НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
		|	И НоминалыЦенныхБумаг.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Коэффициент;
	Иначе
		Возврат 1;
	КонецЕсли;

КонецФункции

Функция ПолучитьЦенныеБумагиОцениваемыеПоФиксированномуКурсу(Период, Организация, СчетДоверительногоУправления)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.КурсВалютыНоминала КАК КурсВалютыНоминала,
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОценкиСтоимостиЦенныхБумаг.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ДатаОкончанияДействия >= &Период) КАК ОценкиСтоимостиЦенныхБумагСрезПоследних
		|ГДЕ
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.КурсВалютыНоминала <> 0";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

Функция ОпределитьСтоимостьКупонаВМоментАмортизации(Облигация, Период)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.СуммаКупона
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона = &ДатаОкончанияКупона";
	
	Запрос.УстановитьПараметр("ДатаОкончанияКупона", НачалоДня(Период));
	Запрос.УстановитьПараметр("Облигация", Облигация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	    Возврат ВыборкаДетальныеЗаписи.СуммаКупона;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

Функция ОпределитьСуммуСписанияТелаПриАмортизации(Облигация, Период, ДатаПокупки, ЦенаПокупки, ДисконтПремияНачисленный, НастройкиУчета)
	
	Возврат Обработки.РасчетПартий.ОпределитьСуммуСписанияТелаПриАмортизации(Облигация, Период, ДатаПокупки, ЦенаПокупки, ДисконтПремияНачисленный, НастройкиУчета);
	
КонецФункции

Процедура РассчитатьПартииСрочныхКонтрактовЕПС(Отказ, ТаблицаПлановыхОпераций, РассчитыватьСтоимости)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактовОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактовОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииСрочныхКонтрактовОстатки.ВидСделки КАК ВидСделки,
		|	БухПартииСрочныхКонтрактовОстатки.Партия КАК Партия,
		|	БухПартииСрочныхКонтрактовОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииСрочныхКонтрактовОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииСрочныхКонтрактовОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупки,
		|	БухПартииСрочныхКонтрактовОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииСрочныхКонтрактовОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода,
		|	БухПартииСрочныхКонтрактовОстатки.СтоимостьБазовогоАктиваВВалютеУчетаОстаток КАК СтоимостьБазовогоАктиваВВалютеУчета,
		|	БухПартииСрочныхКонтрактовОстатки.Партия.Дата КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход) КАК ВидДвижения,
		|	БухПартииСрочныхКонтрактовОстатки.Партия.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииСрочныхКонтрактовОстатки.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииСрочныхКонтрактовОстатки.Партия КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииСрочныхКонтрактовОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииСрочныхКонтрактовОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерСделки
		|ПОМЕСТИТЬ _Партии
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета) КАК БухПартииСрочныхКонтрактовОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ВидСделки,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	0,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА -ЕСТЬNULL(РасходыПоСделкеОбороты.СуммаОборот, 0)
		|		ИНАЧЕ ЕСТЬNULL(РасходыПоСделкеОбороты.СуммаОборот, 0)
		|	КОНЕЦ,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).МоментВремени,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).НомерСделки
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&КонецПериода,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И (ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделкеОбороты
		|		ПО ОперацииСЦеннымиБумагами.Операция = РасходыПоСделкеОбороты.Сделка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделкеОбороты.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Сделка)
		|	И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ОтложенноеИсполнение
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).ВидСделки,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	0,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА -ЕСТЬNULL(РасходыПоСделкеОбороты.СуммаОборот, 0)
		|		ИНАЧЕ ЕСТЬNULL(РасходыПоСделкеОбороты.СуммаОборот, 0)
		|	КОНЕЦ,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).МоментВремени,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).НомерСделки
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&КонецПериода,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И (ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделкеОбороты
		|		ПО ОперацииСЦеннымиБумагами.Основание = РасходыПоСделкеОбороты.Сделка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделкеОбороты.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Партии.ЦеннаяБумага.БазовыйАктив КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _Акции
		|ИЗ
		|	_Партии КАК Партии
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Партии.ЦеннаяБумага.БазовыйАктив) = ТИП(Справочник.Акции)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Партии.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	Партии.ВидСделки КАК ВидСделки,
		|	Партии.Партия КАК Партия,
		|	Партии.СтрокаПартии КАК СтрокаПартии,
		|	Партии.Количество КАК Количество,
		|	Партии.СтоимостьПокупки КАК СтоимостьПокупки,
		|	Партии.Переоценка КАК Переоценка,
		|	Партии.Период КАК Период,
		|	Партии.Регистратор КАК Регистратор,
		|	Партии.ВидДвижения КАК ВидДвижения,
		|	Партии.МоментВремени КАК МоментВремени,
		|	Партии.НомерСделки КАК НомерСделки,
		|	Партии.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	Партии.СтоимостьБазовогоАктиваВВалютеУчета КАК СтоимостьБазовогоАктиваВВалютеУчета
		|ИЗ
		|	_Партии КАК Партии
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	НомерСделки,
		|	МоментВремени
		|ИТОГИ ПО
		|	ЦеннаяБумага";

	#КонецОбласти 
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);
	
	ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты.Очистить();
	
	ПустаяТаблица = ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты.Выгрузить();
	
	РезультатЗапроса = Запрос.Выполнить();

	Акции = Запрос.МенеджерВременныхТаблиц.Таблицы["_Акции"].ПолучитьДанные().Выгрузить();
	Если Акции.Количество() <> 0 Тогда
	
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Организация",					ЭтотОбъект.Организация);
		ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
		ПараметрыРасчета.Вставить("ЦельРасчета",					Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
		ПараметрыРасчета.Вставить("ВалютаУчета",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
		ПараметрыРасчета.Вставить("Дата", 							КонецДня(ЭтотОбъект.КонецПериода));
		НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыРасчета.Дата, ПараметрыРасчета.Организация, ПараметрыРасчета.СчетДоверительногоУправления, ПараметрыРасчета.ЦельРасчета);
		ПараметрыРасчета.Вставить("ВидУчета",							НастройкиОценки.ВидУчетаДляОстатковПартий); 	
		ПараметрыРасчета.Вставить("ВариантРасчетаОценочнойСтоимости",	НастройкиОценки.ВариантРасчетаОценочнойСтоимости); 	
		
		РСП = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(РСП, ПараметрыРасчета);
		РСП.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
		РСП.ДополнительныеСвойства.Вставить("ВыполнятьРасчетПоУказаниюЦБ", Ложь);
		
		ОцениваемыеБумаги = Новый ТаблицаЗначений;
		
		ОцениваемыеБумаги.Колонки.Добавить("ЦеннаяБумага",		Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("Количество",		Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("ВидДвижения",		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвижений"));
		ОцениваемыеБумаги.Колонки.Добавить("Рынок",				Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
		ОцениваемыеБумаги.Колонки.Добавить("ТипЗадолженности",	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		
		ОцениваемыеБумаги.Колонки.Добавить("Партия",						Метаданные.ОпределяемыеТипы.Партия.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("СтрокаПартии",					Новый ОписаниеТипов("Число"));
		ОцениваемыеБумаги.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
		ОцениваемыеБумаги.Колонки.Добавить("СуммаРезервовПодОбесценение",	Новый ОписаниеТипов("Число"));
		
		Для каждого СтрокаАкции Из Акции Цикл
			
			СтрокаОцениваемыеБумаги = ОцениваемыеБумаги.Добавить();
			СтрокаОцениваемыеБумаги.ЦеннаяБумага = СтрокаАкции.ЦеннаяБумага;
			СтрокаОцениваемыеБумаги.Количество = 1;
			СтрокаОцениваемыеБумаги.ВидДвижения = Перечисления.ВидыДвижений.Приход;
			СтрокаОцениваемыеБумаги.Рынок = Перечисления.РынкиЦенныхБумаг.Акции;
		
		КонецЦикла;
		
		РСП.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, Неопределено, ОцениваемыеБумаги, Истина);
		ТаблицаСтоимостейАкций = РСП.СтоимостиПереоценки.Выгрузить();
		
	КонецЕсли;
	
	ВыборкаЦеннаяБумага = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦеннаяБумага.Следующий() Цикл
		
		ЦеннаяБумага = ВыборкаЦеннаяБумага.ЦеннаяБумага;
		БазовыйАктив = ЦеннаяБумага.БазовыйАктив;
		
		ПартииВНаличии = ПустаяТаблица.СкопироватьКолонки();
		
		ТекущееСостояниие = Перечисления.ВидыСделок.ПустаяСсылка(); // это переменная отражает, что у нас сейчас покупки или продажи
		
		// для фьючей не передаем СчетДоверительногоУправления - ибо не переопределяются
		УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(, Перечисления.РынкиЦенныхБумаг.Фьючерсы, ВыборкаЦеннаяБумага.ЦеннаяБумага);
		
		ВыборкаДетальныеЗаписи = ВыборкаЦеннаяБумага.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидСделки = ТекущееСостояниие
				ИЛИ ТекущееСостояниие = Перечисления.ВидыСделок.ПустаяСсылка() Тогда
				
				ПартияВНаличии = ПартииВНаличии.Добавить();
				ЗаполнитьЗначенияСвойств(ПартияВНаличии, ВыборкаДетальныеЗаписи);
				
				Если ПартияВНаличии.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
					ПартияВНаличии.УчетныйАктивЕПС = УчетныйАктивЕПС;
				КонецЕсли;
				
				НовоеДвижение = ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеДвижение, ПартияВНаличии);
				НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
				
				Если РассчитыватьСтоимости Тогда
					Если ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.ВалютныеПары") Тогда
						// пока определение СтоимостиБазовогоАктиваВВалютеУчета сделано только для валютных пар
						СтоимостьБазовогоАктиваВВалюте = ВыборкаДетальныеЗаписи.Количество * ЦеннаяБумага.Лот;
						СтоимостьБазовогоАктиваВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьБазовогоАктиваВВалюте, БазовыйАктив.Валюта, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);
						
						ПартияВНаличии.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
						НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
						
					ИначеЕсли ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.Акции") Тогда
						// и для акций
						СтоимостьБазовогоАктиваВВалюте = ВыборкаДетальныеЗаписи.Количество * ТаблицаСтоимостейАкций.НайтиСтроки(Новый Структура("ЦеннаяБумага", БазовыйАктив))[0].ЦенаКотировки;
						СтоимостьБазовогоАктиваВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьБазовогоАктиваВВалюте, БазовыйАктив.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);
						
						ПартияВНаличии.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
						НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
						
					КонецЕсли;
				
				КонецЕсли;
				
				ТекущееСостояниие = ВыборкаДетальныеЗаписи.ВидСделки;
				
			Иначе
				
				ПартииКУдалению = Новый Массив;
						
				КоличествоКСписанию = ВыборкаДетальныеЗаписи.Количество;
				
				Для каждого СтрокаПартииВНаличии Из ПартииВНаличии Цикл
					
					Если СтрокаПартииВНаличии.Количество <= КоличествоКСписанию Тогда
						КоличествоКСписаниюПартии = СтрокаПартииВНаличии.Количество;
					Иначе	
						КоличествоКСписаниюПартии = СтрокаПартииВНаличии.Количество;
					КонецЕсли;
					
					СуммаПерекурсовки = 0;
					Если ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.ВалютныеПары")
						ИЛИ ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.Акции") Тогда 

						НовоеДвижениеПерекурсовки = ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижениеПерекурсовки, СтрокаПартииВНаличии);
						
						НовоеДвижениеПерекурсовки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижениеПерекурсовки.Количество = 0;
						НовоеДвижениеПерекурсовки.Переоценка = 0;
						НовоеДвижениеПерекурсовки.ПереоценкаСНачалаГода = 0;
						НовоеДвижениеПерекурсовки.СтоимостьПокупки = 0;
						
						Если РассчитыватьСтоимости Тогда
							
							Если ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.ВалютныеПары") Тогда
								// пока определение СтоимостиБазовогоАктиваВВалютеУчета сделано только для валютных пар
								СтоимостьБазовогоАктиваВВалюте = КоличествоКСписаниюПартии * ЦеннаяБумага.Лот;
								СтоимостьБазовогоАктиваВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьБазовогоАктиваВВалюте, БазовыйАктив.Валюта, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);
							ИначеЕсли ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.Акции") Тогда
								// и для акций
								СтоимостьБазовогоАктиваВВалюте = КоличествоКСписаниюПартии * ТаблицаСтоимостейАкций.НайтиСтроки(Новый Структура("ЦеннаяБумага", БазовыйАктив))[0].ЦенаКотировки;
								СтоимостьБазовогоАктиваВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьБазовогоАктиваВВалюте, БазовыйАктив.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);
							КонецЕсли;
							
							Если КоличествоКСписаниюПартии = СтрокаПартииВНаличии.Количество Тогда
								БалансоваяСтоимостьБазовогоАктиваВВалютеУчета = СтрокаПартииВНаличии.СтоимостьБазовогоАктиваВВалютеУчета;
							Иначе
								БалансоваяСтоимостьБазовогоАктиваВВалютеУчета = СтрокаПартииВНаличии.СтоимостьБазовогоАктиваВВалютеУчета / СтрокаПартииВНаличии.Количество * КоличествоКСписаниюПартии;
							КонецЕсли;
							СуммаПерекурсовки = СтоимостьБазовогоАктиваВВалютеУчета - БалансоваяСтоимостьБазовогоАктиваВВалютеУчета;
							НовоеДвижениеПерекурсовки.СтоимостьБазовогоАктиваВВалютеУчета = СуммаПерекурсовки;
							
						КонецЕсли; 
						
					КонецЕсли;
					
							
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПартииВНаличии);
					
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
					
					Если СтрокаПартииВНаличии.Количество <= КоличествоКСписанию Тогда // закроем полностью
						
						ПартииКУдалению.Добавить(СтрокаПартииВНаличии);
						КоличествоКСписанию = КоличествоКСписанию - СтрокаПартииВНаличии.Количество;
								
					Иначе //спишем пропорционально
								
						КоэффициентСписания = КоличествоКСписанию / СтрокаПартииВНаличии.Количество;
								
						НовоеДвижение.Количество = КоличествоКСписанию;
						
						Если РассчитыватьСтоимости Тогда
						
							НовоеДвижение.СтоимостьПокупки = СтрокаПартииВНаличии.СтоимостьПокупки * КоэффициентСписания;
							НовоеДвижение.Переоценка = СтрокаПартииВНаличии.Переоценка * КоэффициентСписания;
							НовоеДвижение.ПереоценкаСНачалаГода = СтрокаПартииВНаличии.ПереоценкаСНачалаГода * КоэффициентСписания;
							НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета = СтрокаПартииВНаличии.СтоимостьБазовогоАктиваВВалютеУчета * КоэффициентСписания;
							
							СтрокаПартииВНаличии.СтоимостьПокупки = СтрокаПартииВНаличии.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
							СтрокаПартииВНаличии.Переоценка = СтрокаПартииВНаличии.Переоценка - НовоеДвижение.Переоценка;
							СтрокаПартииВНаличии.ПереоценкаСНачалаГода = СтрокаПартииВНаличии.ПереоценкаСНачалаГода - НовоеДвижение.ПереоценкаСНачалаГода;
							СтрокаПартииВНаличии.СтоимостьБазовогоАктиваВВалютеУчета = СтрокаПартииВНаличии.СтоимостьБазовогоАктиваВВалютеУчета - НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета;							
						
						КонецЕсли; 
						
						СтрокаПартииВНаличии.Количество = СтрокаПартииВНаличии.Количество - НовоеДвижение.Количество;
						
						КоличествоКСписанию = 0;
						
					КонецЕсли;
					
					НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета = НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета + СуммаПерекурсовки;
					
					Если КоличествоКСписанию = 0 Тогда
						Прервать;
					КонецЕсли;
							
				КонецЦикла;
						
				Для каждого СтрокаПартииКУдалению Из ПартииКУдалению Цикл
					ПартииВНаличии.Удалить(СтрокаПартииКУдалению);
				КонецЦикла;
				
				Если КоличествоКСписанию > 0 Тогда // а это означает переход на другую сторону силы
					
					ПартияВНаличии = ПартииВНаличии.Добавить();
					ЗаполнитьЗначенияСвойств(ПартияВНаличии, ВыборкаДетальныеЗаписи);
					ПартияВНаличии.Количество = КоличествоКСписанию;
					
					Если РассчитыватьСтоимости Тогда
						
						ПартияВНаличии.СтоимостьПокупки = ВыборкаДетальныеЗаписи.СтоимостьПокупки / ВыборкаДетальныеЗаписи.Количество * КоличествоКСписанию;
						ПартияВНаличии.Переоценка = ВыборкаДетальныеЗаписи.Переоценка / ВыборкаДетальныеЗаписи.Количество * КоличествоКСписанию; // тут 0
						
						// а тут комиссия, и ее начисляем всю
						Если ВыборкаДетальныеЗаписи.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
							// комиссия уменьшает переоценку (т.к. положительная переоценка это доход)
							ПартияВНаличии.ПереоценкаСНачалаГода = - ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода;
						ИначеЕсли ВыборкаДетальныеЗаписи.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
							// комиссия увеличивает переоценку (т.к. положительная переоценка это расход)
							ПартияВНаличии.ПереоценкаСНачалаГода = ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода;
						КонецЕсли;
					
					КонецЕсли; 
				
					Если ПартияВНаличии.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
						// для фьючей не передаем СчетДоверительногоУправления - ибо не переопределяются
						ПартияВНаличии.УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ВыборкаДетальныеЗаписи.Период, Перечисления.РынкиЦенныхБумаг.Фьючерсы, ВыборкаДетальныеЗаписи.ЦеннаяБумага);
					КонецЕсли;
					
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты.Добавить();
					ЗаполнитьЗначенияСвойств(НовоеДвижение, ПартияВНаличии);
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					
					Если РассчитыватьСтоимости Тогда
						Если ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.ВалютныеПары") Тогда
							// пока определение СтоимостиБазовогоАктиваВВалютеУчета сделано только для валютных пар
							СтоимостьБазовогоАктиваВВалюте = КоличествоКСписанию * ЦеннаяБумага.Лот;
							СтоимостьБазовогоАктиваВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьБазовогоАктиваВВалюте, БазовыйАктив.Валюта, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);
							
							ПартияВНаличии.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
							НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
							
						ИначеЕсли ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.Акции") Тогда
							// и для акций
							СтоимостьБазовогоАктиваВВалюте = КоличествоКСписанию * ТаблицаСтоимостейАкций.НайтиСтроки(Новый Структура("ЦеннаяБумага", БазовыйАктив))[0].ЦенаКотировки;
							СтоимостьБазовогоАктиваВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьБазовогоАктиваВВалюте, БазовыйАктив.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);
							
							ПартияВНаличии.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
							НовоеДвижение.СтоимостьБазовогоАктиваВВалютеУчета = СтоимостьБазовогоАктиваВВалютеУчета;
							
						КонецЕсли;
						
					КонецЕсли;
					
					ТекущееСостояниие = ВыборкаДетальныеЗаписи.ВидСделки;
					
				КонецЕсли;
					
			КонецЕсли;
		КонецЦикла;
		
		// теперь таблица приходных партий содержит только конечные остатки, которые мы и положим в соответствующую таб. часть обработки
		Для каждого СтрокаПартииВНаличии Из ПартииВНаличии Цикл
			Если СтрокаПартииВНаличии.Количество > 0 Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартийСрочныеКонтракты.Добавить(), СтрокаПартииВНаличии);
			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;
	
	ЭтотОбъект.КонечныеОстаткиПартийСрочныеКонтракты.ЗаполнитьЗначения(Перечисления.РынкиЦенныхБумаг.Фьючерсы, "Рынок");
	
КонецПроцедуры

Функция ПолучитьДанныеССдляЦБ(Рынок, ЦеннаяБумага, Количество, ДатаПереоценки)
	
	Отказ = Ложь;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация",							ЭтотОбъект.Организация);
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",			ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыРасчета.Вставить("ЦельРасчета",							Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
	Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
		ПараметрыРасчета.Вставить("ЦельРасчета",						Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	КонецЕсли;
	ПараметрыРасчета.Вставить("ВалютаУчета",							ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
	ПараметрыРасчета.Вставить("Дата",									ДатаПереоценки);
	
	НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыРасчета.Дата, ПараметрыРасчета.Организация, ПараметрыРасчета.СчетДоверительногоУправления, ПараметрыРасчета.ЦельРасчета);
	
	ПараметрыРасчета.Вставить("ВидУчета",								НастройкиОценки.ВидУчетаДляОстатковПартий); 	
	ПараметрыРасчета.Вставить("ВариантРасчетаОценочнойСтоимости",		НастройкиОценки.ВариантРасчетаОценочнойСтоимости); 	

	ОцениваемыеБумаги = Новый ТаблицаЗначений;
	
	ОцениваемыеБумаги.Колонки.Добавить("ЦеннаяБумага",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	ОцениваемыеБумаги.Колонки.Добавить("Количество",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	ОцениваемыеБумаги.Колонки.Добавить("ВидДвижения",					Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвижений"));
	ОцениваемыеБумаги.Колонки.Добавить("Рынок",							Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
	ОцениваемыеБумаги.Колонки.Добавить("ТипЗадолженности",				Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
	
	ОцениваемыеБумаги.Колонки.Добавить("Партия",						Метаданные.ОпределяемыеТипы.Партия.Тип);
	ОцениваемыеБумаги.Колонки.Добавить("СтрокаПартии",					Новый ОписаниеТипов("Число"));
	ОцениваемыеБумаги.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
	ОцениваемыеБумаги.Колонки.Добавить("СуммаРезервовПодОбесценение",	Новый ОписаниеТипов("Число"));
	
	СтрокаБумаги = ОцениваемыеБумаги.Добавить();
	СтрокаБумаги.ЦеннаяБумага = ЦеннаяБумага;
	СтрокаБумаги.Рынок = Рынок;
	СтрокаБумаги.Количество = Количество;
	СтрокаБумаги.ВидДвижения = Перечисления.ВидыДвижений.Расход;
	
	ПереоценкаЦБ = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ПереоценкаЦБ, ПараметрыРасчета);
	ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
	ПереоценкаЦБ.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, Неопределено, ОцениваемыеБумаги, Истина);
	ТаблицаСтоимостей = ПереоценкаЦБ.СтоимостиПереоценки.Выгрузить();
	
	СтрокаСтоимостей = ТаблицаСтоимостей[0];
	
	ДанныеСС = Новый Структура();
	
	ДанныеСС.Вставить("Количество", Количество);
	ДанныеСС.Вставить("СуммаРынок", Количество * СтрокаСтоимостей.ЦенаКотировки);
	
	ДанныеСС.Вставить("СуммаРынокВВалютеУчета", РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
		Новый Структура("СуммаРынок", ДанныеСС.СуммаРынок),
		СтрокаСтоимостей.ВалютаКотировки,
		ЭтотОбъект.Организация,
		ДатаПереоценки,
		?(ЗначениеЗаполнено(СтрокаСтоимостей.КурсВалютыНоминала), СтрокаСтоимостей.КурсВалютыНоминала, Неопределено),
		Отказ).СуммаРынок);
	
	Если Рынок = Перечисления.РынкиЦенныхБумаг.Облигации  Тогда
		ДанныеСС.Вставить("СуммаКупонаРынок", Количество * СтрокаСтоимостей.ЦенаКотировкиКупона);
		
		ДанныеСС.Вставить("СуммаКупонаРынокВВалютеУчета", РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
			Новый Структура("СуммаРынок", ДанныеСС.СуммаКупонаРынок),
			СтрокаСтоимостей.ВалютаКотировки,
			ЭтотОбъект.Организация,
			ДатаПереоценки,
			?(ЗначениеЗаполнено(СтрокаСтоимостей.КурсВалютыНоминала), СтрокаСтоимостей.КурсВалютыНоминала, Неопределено),
			Отказ).СуммаКупонаРынок);
		
	КонецЕсли;
	
	Возврат ДанныеСС;

КонецФункции

Функция ПолучитьПереоценкиПередВыводами(ЦельРасчета = Неопределено)

	ПереоцениватьПоСЧА = Истина;
	Если ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов Тогда
		
		НастройкиОценкиСЧА	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.НачалоПериода, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
		НастройкиОценкиЕПС	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.НачалоПериода, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЦельРасчета);
		
		Если НастройкиОценкиСЧА.ВариантРасчетаОценочнойСтоимости <> НастройкиОценкиЕПС.ВариантРасчетаОценочнойСтоимости Тогда
			ПереоцениватьПоСЧА = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПереоцениватьПоСЧА Тогда // легко и просто...
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВводыВыводыАктивовВВалютеУчета.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВыводыЦБ
			|ИЗ
			|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
			|ГДЕ
			|	ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
			|	И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
			|	И ВводыВыводыАктивовВВалютеУчета.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
			|	И ВводыВыводыАктивовВВалютеУчета.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВыводЦенныхБумагЦенныеБумаги.Ссылка КАК Ссылка,
			|	ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВыводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	ВыводЦенныхБумагЦенныеБумаги.Количество КАК Количество,
			|	ВыводЦенныхБумагЦенныеБумаги.СуммаРынок КАК СуммаРынок,
			|	ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок КАК СуммаКупонаРынок,
			|	ВыводЦенныхБумагЦенныеБумаги.ЦенаКотировки КАК ЦенаКотировки,
			|	ВыводЦенныхБумагЦенныеБумаги.ЦенаКотировкиКупона КАК ЦенаКотировкиКупона,
			|	ВыводЦенныхБумагЦенныеБумаги.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
			|	ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынокВВалютеУчета КАК СуммаКупонаРынокВВалютеУчета,
			|	ВыводЦенныхБумагЦенныеБумаги.ВидЦены КАК ВидЦены
			|ИЗ
			|	Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
			|ГДЕ
			|	ВыводЦенныхБумагЦенныеБумаги.Ссылка В
			|			(ВЫБРАТЬ
			|				ВыводыЦБ.Регистратор
			|			ИЗ
			|				ВыводыЦБ)
			|	И &УсловиеУчетногоАктива";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
		Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
		
		Если ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов Тогда
		
			ПереоцениваемыеГруппыАктивов = Новый Массив;
			ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток);
			ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи);
			ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой);
			ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи);
			
			Запрос.УстановитьПараметр("ПереоцениваемыеГруппыАктивов", ПереоцениваемыеГруппыАктивов);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"&УсловиеУчетногоАктива", 
				"(ВыводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
				|ИЛИ ВыводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС.Родитель В (&ПереоцениваемыеГруппыАктивов))");
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеУчетногоАктива", "ИСТИНА"); 
			
		КонецЕсли;		
		
		Возврат  Запрос.Выполнить().Выгрузить();
		
	Иначе // сложно и жестко - сделано для одного-единственного вывода по ДК Региону
		  // как только произойдет еще 2 таких же случая - обязуюсь расчетные данные по ЕПС запихать в документ ВыводЦБ
		
		ПереоценкиПередВыводами = Новый ТаблицаЗначений;
		
		ПереоценкиПередВыводами.Колонки.Добавить("Ссылка",							Новый ОписаниеТипов("ДокументСсылка.ВыводЦенныхБумаг"));
		ПереоценкиПередВыводами.Колонки.Добавить("ЦеннаяБумага",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
		ПереоценкиПередВыводами.Колонки.Добавить("УчетныйАктивЕПС",					Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
		ПереоценкиПередВыводами.Колонки.Добавить("Количество",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		ПереоценкиПередВыводами.Колонки.Добавить("СуммаРынок",						Новый ОписаниеТипов("Число"));
		ПереоценкиПередВыводами.Колонки.Добавить("СуммаКупонаРынок",				Новый ОписаниеТипов("Число"));
		ПереоценкиПередВыводами.Колонки.Добавить("ЦенаКотировки",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		ПереоценкиПередВыводами.Колонки.Добавить("ЦенаКотировкиКупона",				Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		ПереоценкиПередВыводами.Колонки.Добавить("СуммаРынокВВалютеУчета",			Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		ПереоценкиПередВыводами.Колонки.Добавить("СуммаКупонаРынокВВалютеУчета",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		ПереоценкиПередВыводами.Колонки.Добавить("ВидЦены",							Новый ОписаниеТипов("ПеречислениеСсылка.ИсточникиЦеныДляПереоценки"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВводыВыводыАктивовВВалютеУчета.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
			|ГДЕ
			|	ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
			|	И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
			|	И ВводыВыводыАктивовВВалютеУчета.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
			|	И ВводыВыводыАктивовВВалютеУчета.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
		Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ДокументОбъект = ВыборкаДетальныеЗаписи.Регистратор.ПолучитьОбъект();
			
			РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьРыночнуюСтоимостьЦенныхБумаг(ДокументОбъект, "ЦенныеБумаги", Неопределено, Неопределено, ЦельРасчета);
			
			Для каждого СтрокаЦенныеБумаги Из ДокументОбъект.ЦенныеБумаги Цикл
			
				СтрокаПереоценкиПередВыводами = ПереоценкиПередВыводами.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПереоценкиПередВыводами, СтрокаЦенныеБумаги);
				СтрокаПереоценкиПередВыводами.Ссылка = ВыборкаДетальныеЗаписи.Регистратор;
			
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат  ПереоценкиПередВыводами;
		
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьПереоценкиДляОпераций(УчитыватьПокупки, УчитыватьПродажи, УчитыватьПогрешность, ЦельРасчета = Неопределено)

	Если ЦельРасчета = Неопределено Тогда
		ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация",					ЭтотОбъект.Организация);
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыРасчета.Вставить("ЦельРасчета",					ЦельРасчета);
	ПараметрыРасчета.Вставить("ВалютаУчета",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
	
	МассивВидовСделок = Новый Массив;
	МассивВидовДвижений = Новый Массив;
	
	Если УчитыватьПокупки Тогда
		МассивВидовСделок.Добавить(Перечисления.ВидыСделок.Покупка);
		МассивВидовДвижений.Добавить(Перечисления.ВидыДвижений.Приход);
	КонецЕсли;
	
	Если УчитыватьПродажи Тогда
		МассивВидовСделок.Добавить(Перечисления.ВидыСделок.Продажа);
		МассивВидовДвижений.Добавить(Перечисления.ВидыДвижений.Расход);
	КонецЕсли;
	
	
	МассивТиповОпераций = Новый Массив;
	МассивТиповОпераций.Добавить(Тип("ДокументСсылка.Сделка"));
	МассивТиповОпераций.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
	МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке"));
	МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ПоставкаЦенныхБумаг"));
	МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ПогашениеЦеннойБумаги"));
	
	ПереоценкиДляОпераций = Новый ТаблицаЗначений;
	
	ПереоценкиДляОпераций.Колонки.Добавить("Ссылка",						Новый ОписаниеТипов(МассивТиповОпераций));
	ПереоценкиДляОпераций.Колонки.Добавить("ЦеннаяБумага",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
	ПереоценкиДляОпераций.Колонки.Добавить("Количество",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("СуммаРынок",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("СуммаКупонаРынок",				Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("ЦенаКотировки",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("ЦенаКотировкиКупона",			Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("СуммаРынокВВалютеУчета",		Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("СуммаКупонаРынокВВалютеУчета",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ПереоценкиДляОпераций.Колонки.Добавить("ВидЦены",						Новый ОписаниеТипов("ПеречислениеСсылка.ИсточникиЦеныДляПереоценки"));
	ПереоценкиДляОпераций.Колонки.Добавить("ВидДвижения",					Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвижений"));
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка КАК Ссылка,
		|	СделкаЦенныеБумаги.Ссылка.Рынок КАК Рынок,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	НАЧАЛОПЕРИОДА(СделкаЦенныеБумаги.Ссылка.Дата, ДЕНЬ) КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения
		|ПОМЕСТИТЬ _ОперацииСБумагами
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка.Организация = &Организация
		|	И СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И СделкаЦенныеБумаги.Ссылка.ВидСделки В(&МассивВидовСделок)
		|	И НЕ СделкаЦенныеБумаги.Ссылка.ОтложенноеИсполнение
		|	И СделкаЦенныеБумаги.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРЕПОЦенныеБумаги.Ссылка,
		|	СделкаРЕПОЦенныеБумаги.Ссылка.Рынок,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.Количество,
		|	НАЧАЛОПЕРИОДА(СделкаРЕПОЦенныеБумаги.Ссылка.Дата, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА СделкаРЕПОЦенныеБумаги.Ссылка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка.Организация = &Организация
		|	И СделкаРЕПОЦенныеБумаги.Ссылка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И СделкаРЕПОЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаРЕПОЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И СделкаРЕПОЦенныеБумаги.Ссылка.ВидСделки В(&МассивВидовСделок)
		|	И (СделкаРЕПОЦенныеБумаги.Ссылка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				И СделкаРЕПОЦенныеБумаги.Ссылка.ЧастьСделкиРЕПО = 2
		|			ИЛИ СделкаРЕПОЦенныеБумаги.Ссылка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|				И СделкаРЕПОЦенныеБумаги.Ссылка.ЧастьСделкиРЕПО = 1)
		|	И НЕ СделкаРЕПОЦенныеБумаги.Ссылка.ОтложенноеИсполнение
		|	И СделкаРЕПОЦенныеБумаги.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Рынок,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Количество,
		|	НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Дата, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|ГДЕ
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Организация = &Организация
		|	И ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.ВидСделки В(&МассивВидовСделок)
		|	И ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоставкаЦенныхБумагЦенныеБумаги.Ссылка,
		|	ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.Рынок,
		|	ПоставкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ПоставкаЦенныхБумагЦенныеБумаги.Количество,
		|	НАЧАЛОПЕРИОДА(ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.Дата, ДЕНЬ),
		|	ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.ВидДвижения
		|ИЗ
		|	Документ.ПоставкаЦенныхБумаг.ЦенныеБумаги КАК ПоставкаЦенныхБумагЦенныеБумаги
		|ГДЕ
		|	ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.Организация = &Организация
		|	И ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.ВидДвижения В(&МассивВидовДвижений)
		|	И ПоставкаЦенныхБумагЦенныеБумаги.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПогашениеЦеннойБумаги.Ссылка,
		|	ПогашениеЦеннойБумаги.Рынок,
		|	ПогашениеЦеннойБумаги.ЦеннаяБумага,
		|	ПогашениеЦеннойБумаги.Количество,
		|	НАЧАЛОПЕРИОДА(ПогашениеЦеннойБумаги.Дата, ДЕНЬ),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.ПустаяСсылка)
		|ИЗ
		|	Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|ГДЕ
		|	&ВидУчета <> ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПогашениеЦеннойБумаги.Организация = &Организация
		|	И ПогашениеЦеннойБумаги.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПогашениеЦеннойБумаги.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход) В (&МассивВидовДвижений)
		|	И ПогашениеЦеннойБумаги.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОперацииСБумагами.Рынок КАК Рынок,
		|	_ОперацииСБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ОперацииСБумагами.Количество) КАК Количество,
		|	_ОперацииСБумагами.ДатаОперации КАК ДатаОперации,
		|	_ОперацииСБумагами.ВидДвижения КАК ВидДвижения
		|ИЗ
		|	_ОперацииСБумагами КАК _ОперацииСБумагами
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОперацииСБумагами.Рынок,
		|	_ОперацииСБумагами.ЦеннаяБумага,
		|	_ОперацииСБумагами.ДатаОперации,
		|	_ОперацииСБумагами.ВидДвижения
		|ИТОГИ ПО
		|	ДатаОперации";
	
	
	// для погашения ВидДвижения = "пустая ссылка" т.к. погашения нужен отдельный расчет - там пересчет номиналов
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
	
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	
	Запрос.УстановитьПараметр("МассивВидовСделок", МассивВидовСделок);
	Запрос.УстановитьПараметр("МассивВидовДвижений", МассивВидовДвижений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОперацииСБумагами = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОперацииСБумагами"].ПолучитьДанные().Выгрузить();
	
	ВыборкаДатаОперации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДатаОперации.Следующий() Цикл
		
		ПараметрыРасчета.Вставить("Дата", КонецДня(ВыборкаДатаОперации.ДатаОперации));
		НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыРасчета.Дата, ПараметрыРасчета.Организация, ПараметрыРасчета.СчетДоверительногоУправления, ПараметрыРасчета.ЦельРасчета);
		ПараметрыРасчета.Вставить("ВидУчета",							НастройкиОценки.ВидУчетаДляОстатковПартий); 	
		ПараметрыРасчета.Вставить("ВариантРасчетаОценочнойСтоимости",	НастройкиОценки.ВариантРасчетаОценочнойСтоимости); 	
		
		Отказ = Ложь;
		
		ОцениваемыеБумаги = Новый ТаблицаЗначений;
		
		ОцениваемыеБумаги.Колонки.Добавить("ЦеннаяБумага",		Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("Количество",		Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("ВидДвижения",		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвижений"));
		ОцениваемыеБумаги.Колонки.Добавить("Рынок",				Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
		ОцениваемыеБумаги.Колонки.Добавить("ТипЗадолженности",	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		
		ОцениваемыеБумаги.Колонки.Добавить("Партия",						Метаданные.ОпределяемыеТипы.Партия.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("СтрокаПартии",					Новый ОписаниеТипов("Число"));
		ОцениваемыеБумаги.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
		ОцениваемыеБумаги.Колонки.Добавить("СуммаРезервовПодОбесценение",	Новый ОписаниеТипов("Число"));
		
		ВыборкаДетальныеЗаписи = ВыборкаДатаОперации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОцениваемыеБумаги.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		ПереоценкаЦБ = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ПереоценкаЦБ, ПараметрыРасчета);
		ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
		
		ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДатаОперации.ДатаОперации));
		
		ПереоценкаЦБ.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, Неопределено, ОцениваемыеБумаги, Истина);
		ТаблицаСтоимостей = ПереоценкаЦБ.СтоимостиПереоценки.Выгрузить();
		
		ОцениваемыеБумаги.Колонки.Добавить("СуммаРынок",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("СуммаКупонаРынок",				Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("СуммаРынокВВалютеУчета",		Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("СуммаКупонаРынокВВалютеУчета",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("ВидЦены",						Новый ОписаниеТипов("ПеречислениеСсылка.ИсточникиЦеныДляПереоценки"));
		ОцениваемыеБумаги.Колонки.Добавить("ЦенаКотировки",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		ОцениваемыеБумаги.Колонки.Добавить("ЦенаКотировкиКупона",			Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		
		Для каждого ОцениваемаяБумага Из ОцениваемыеБумаги Цикл
		
			СтрокиСтоимостей = ТаблицаСтоимостей.НайтиСтроки(Новый Структура("Рынок,ЦеннаяБумага", ОцениваемаяБумага.Рынок, ОцениваемаяБумага.ЦеннаяБумага));
			
			ЗаполнитьЗначенияСвойств(ОцениваемаяБумага, СтрокиСтоимостей[0], "ЦенаКотировки,ЦенаКотировкиКупона,ВидЦены");
			
			Если ОцениваемаяБумага.Рынок = Перечисления.РынкиЦенныхБумаг.Доли Тогда
				
				ОцениваемаяБумага.СуммаРынок = СтрокиСтоимостей[0].Сумма;
				ОцениваемаяБумага.СуммаРынокВВалютеУчета = СтрокиСтоимостей[0].СуммаВВалютеУчета;
				
			Иначе
				
				СуммаРынок = ОцениваемаяБумага.Количество * ОцениваемаяБумага.ЦенаКотировки;
				
				Если ОцениваемаяБумага.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
					И ОцениваемаяБумага.ВидДвижения = Перечисления.ВидыДвижений.ПустаяСсылка() Тогда // пересчитаем для погашений
					СуммаРынок = ОцениваемаяБумага.Количество * БухгалтерскийУчетЕПС.ПолучитьСтоимостьСУчетомАмортизацииНоминала(ОцениваемаяБумага.ЦенаКотировки, ОцениваемаяБумага.ЦеннаяБумага, ВыборкаДатаОперации.ДатаОперации, ВыборкаДатаОперации.ДатаОперации - 24 * 60 * 60);
					Если СуммаРынок = 0 Тогда // для случая если по методике СЧА в день погашения облигация оценивается в 0
					    СуммаРынок = ОцениваемаяБумага.Количество * Справочники.Облигации.ПолучитьНоминал(ОцениваемаяБумага.ЦеннаяБумага, ВыборкаДатаОперации.ДатаОперации);
						
						Если СтрокиСтоимостей[0].ВалютаКотировки = Справочники.Валюты.ПустаяСсылка() Тогда // в день погашения может не быть оценки по методике и из-за этого не заполняется ни валюта, ни курс
							СтрокиСтоимостей[0].ВалютаКотировки = ОцениваемаяБумага.ЦеннаяБумага.ВалютаНоминала;
							СтрокиСтоимостей[0].КурсВалютыНоминала = НачалоДня(ВыборкаДатаОперации.ДатаОперации);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				СуммаКупонаРынок = ОцениваемаяБумага.Количество * ОцениваемаяБумага.ЦенаКотировкиКупона;
				
				ОцениваемаяБумага.СуммаРынок = СуммаРынок;
				ОцениваемаяБумага.СуммаКупонаРынок = СуммаКупонаРынок;
				
				Если СтрокиСтоимостей[0].ВалютаКотировки = ПараметрыРасчета.ВалютаУчета Тогда
					ОцениваемаяБумага.СуммаРынокВВалютеУчета = СуммаРынок;
					Если СтрокиСтоимостей[0].ВалютаКотировки <> ОцениваемаяБумага.ЦеннаяБумага.ВалютаНоминала Тогда // валютная бумага с рублевой котировкой
						ОцениваемаяБумага.СуммаРынок = ОцениваемаяБумага.Количество * СтрокиСтоимостей[0].Цена; // Цена - в валюте номинала
					КонецЕсли;
				Иначе // вот тут есть заложенность на то, что если валюта котировке не в валюте учета, то она в валюте номинала - возможно, есть случаи опровергающие это, но пока прецедентов не было
					// теперь для расчета рублевой суммы используется неокругленная валютная сумма
					// возможно, тут будут еще изменения т.к. в ЕПС этим пользуется только Югория и у нее нет валютных активов
					// когда это будут делать в ЕПС клиенты с валютными активами скорее всего нужно будет окурглять валютную сумму
					ОцениваемаяБумага.СуммаРынокВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
						Новый Структура("СуммаРынок", СуммаРынок),
						СтрокиСтоимостей[0].ВалютаКотировки,
						ЭтотОбъект.Организация,
						ВыборкаДатаОперации.ДатаОперации,
						?(ЗначениеЗаполнено(СтрокиСтоимостей[0].КурсВалютыНоминала), СтрокиСтоимостей[0].КурсВалютыНоминала, Неопределено),
						Отказ).СуммаРынок;
				КонецЕсли;
				
				Если ОцениваемаяБумага.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
					Если СтрокиСтоимостей[0].ВалютаКотировкиКупона = ПараметрыРасчета.ВалютаУчета Тогда
						ОцениваемаяБумага.СуммаКупонаРынокВВалютеУчета = СуммаКупонаРынок;
						Если СтрокиСтоимостей[0].ВалютаКотировкиКупона <> ОцениваемаяБумага.ЦеннаяБумага.ВалютаНоминала Тогда // валютная бумага с рублевой котировкой
							ОцениваемаяБумага.СуммаКупонаРынок = ОцениваемаяБумага.Количество * СтрокиСтоимостей[0].ЦенаКупона; // Цена - в валюте номинала
						КонецЕсли;
					Иначе // вот тут есть заложенность на то, что если валюта котировке не в валюте учета, то она в валюте номинала - возможно, есть случаи опровергающие это, но пока прецедентов не было
						ОцениваемаяБумага.СуммаКупонаРынокВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
							Новый Структура("СуммаКупонаРынок", СуммаКупонаРынок),
							СтрокиСтоимостей[0].ВалютаКотировкиКупона,
							ЭтотОбъект.Организация,
							ВыборкаДатаОперации.ДатаОперации,
							?(ЗначениеЗаполнено(СтрокиСтоимостей[0].КурсВалютыНоминала), СтрокиСтоимостей[0].КурсВалютыНоминала, Неопределено),
							Отказ).СуммаКупонаРынок;
					КонецЕсли;
				Иначе
					ОцениваемаяБумага.СуммаКупонаРынок = 0;
					ОцениваемаяБумага.СуммаКупонаРынокВВалютеУчета = 0;					
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокиОперацииСБумагами = ОперацииСБумагами.НайтиСтроки(Новый Структура("ДатаОперации,Рынок,ЦеннаяБумага,ВидДвижения", ВыборкаДатаОперации.ДатаОперации, ОцениваемаяБумага.Рынок, ОцениваемаяБумага.ЦеннаяБумага, ОцениваемаяБумага.ВидДвижения));
			
			ВсегоНачислено = Новый Структура("Количество,СуммаРынок,СуммаКупонаРынок,СуммаРынокВВалютеУчета,СуммаКупонаРынокВВалютеУчета", 0, 0, 0, 0, 0);
			
			Для каждого ОперацияСБумагой Из СтрокиОперацииСБумагами Цикл
			
				СтрокаПереоценкиДляОпераций = ПереоценкиДляОпераций.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПереоценкиДляОпераций, ОцениваемаяБумага);
				
				СтрокаПереоценкиДляОпераций.Ссылка = ОперацияСБумагой.Ссылка;
				
				КоэффициентПересчета = ОперацияСБумагой.Количество / ОцениваемаяБумага.Количество;
				
				СтрокаПереоценкиДляОпераций.ВидДвижения						= ОцениваемаяБумага.ВидДвижения;
				
				СтрокаПереоценкиДляОпераций.Количество						= ОперацияСБумагой.Количество;
				
				СтрокаПереоценкиДляОпераций.СуммаРынок						= ОцениваемаяБумага.СуммаРынок					* КоэффициентПересчета;
				СтрокаПереоценкиДляОпераций.СуммаКупонаРынок				= ОцениваемаяБумага.СуммаКупонаРынок				* КоэффициентПересчета;
				СтрокаПереоценкиДляОпераций.СуммаРынокВВалютеУчета			= ОцениваемаяБумага.СуммаРынокВВалютеУчета		* КоэффициентПересчета;
				СтрокаПереоценкиДляОпераций.СуммаКупонаРынокВВалютеУчета	= ОцениваемаяБумага.СуммаКупонаРынокВВалютеУчета	* КоэффициентПересчета;
				
				Если УчитыватьПогрешность Тогда
					
					ОбщийКоэффициентПересчета = (ВсегоНачислено.Количество + ОперацияСБумагой.Количество) / ОцениваемаяБумага.Количество;
					
					Для каждого Ресурс Из ВсегоНачислено Цикл
						ВсегоНачислено[Ресурс.Ключ]	= ВсегоНачислено[Ресурс.Ключ] + СтрокаПереоценкиДляОпераций[Ресурс.Ключ];
						Если Ресурс.Ключ <> "Количество" Тогда
							ДолжноБытьНачислено = Окр(ОцениваемаяБумага[Ресурс.Ключ] * ОбщийКоэффициентПересчета, 2);
							Дельта = ДолжноБытьНачислено - ВсегоНачислено[Ресурс.Ключ];
							Если Дельта <> 0 Тогда
								СтрокаПереоценкиДляОпераций[Ресурс.Ключ] = СтрокаПереоценкиДляОпераций[Ресурс.Ключ] + Дельта;
								ВсегоНачислено[Ресурс.Ключ] = ВсегоНачислено[Ресурс.Ключ] + Дельта;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат  ПереоценкиДляОпераций;
	
КонецФункции

Процедура УчестьПогрешностиРублевыхСумм(Период, КурсПерекурсовки, ПриходныеПартии, МассивДвиженийНачисления, Отказ)

	КопияПриходныхПартийДляРасчетаПогрешностей = ПриходныеПартии.Скопировать();
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки.Добавить("КурсВалютыНоминала", Метаданные.ОпределяемыеТипы.КурсВалюты.Тип);
	КопияПриходныхПартийДляРасчетаПогрешностей.ЗаполнитьЗначения(КурсПерекурсовки, "КурсВалютыНоминала");
	
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки["ДисконтПремия"].Имя = "НачальныеДисконтПремия";
	
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки["ДисконтПремияНачисленный"].Имя = "ОценочныеДисконтПремия";
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки["ДисконтПремияНачисленныйВВалютеУчета"].Имя = "ОценочныеДисконтПремияВВалютеУчета";
	
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки["КорректировкаЭСП"].Имя = "ОценочнаяКорректировкаЭСП";
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки["КорректировкаЭСПВВалютеУчета"].Имя = "ОценочнаяКорректировкаЭСПВВалютеУчета";
	
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки["РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные"].Имя = "ОценочнаяРазницаППНеНаблюдаемыеДанные";
	КопияПриходныхПартийДляРасчетаПогрешностей.Колонки["РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета"].Имя = "ОценочнаяРазницаППНеНаблюдаемыеДанныеВВалютеУчета";
	
	
	ОбъектДляРасчетаПогрешностей = Новый Структура("Дата, Организация, СчетДоверительногоУправления");
	ОбъектДляРасчетаПогрешностей.Вставить("Дата", Период);
	ОбъектДляРасчетаПогрешностей.Вставить("Организация", ЭтотОбъект.Организация);
	ОбъектДляРасчетаПогрешностей.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ОбъектДляРасчетаПогрешностей.Вставить("ЦенныеБумаги", КопияПриходныхПартийДляРасчетаПогрешностей);
	
	РаботаСПереоценкой.РаспределитьПогрешностьОкругленияВалютныхСуммЕПС(ОбъектДляРасчетаПогрешностей, Отказ);
	
	Для каждого СтрокаЦенныеБумаги Из ОбъектДляРасчетаПогрешностей.ЦенныеБумаги Цикл
		СтрокаПриходныхПартий = ПриходныеПартии.Найти(СтрокаЦенныеБумаги.НомерСтроки, "НомерСтроки");
		
		СкорректироватьДП = СтрокаЦенныеБумаги.ОценочныеДисконтПремияВВалютеУчета - СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета;
		СкорректироватьЭСП = СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСПВВалютеУчета - СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета;
		СкорректироватьПП = СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанныеВВалютеУчета - СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
		
		Если СкорректироватьДП <> 0 ИЛИ СкорректироватьЭСП <> 0 ИЛИ СкорректироватьПП <> 0 Тогда
			
			Для каждого СтрокаДвиженийНачисления Из МассивДвиженийНачисления Цикл // приходится искать в цикле, благо это редко и массив не большой
				Если СтрокаДвиженийНачисления.Партия = СтрокаЦенныеБумаги.Партия 
					И СтрокаДвиженийНачисления.СтрокаПартии = СтрокаЦенныеБумаги.СтрокаПартии Тогда
				
					СтрокаДвиженийНачисления.ДисконтПремияНачисленныйВВалютеУчета = СтрокаДвиженийНачисления.ДисконтПремияНачисленныйВВалютеУчета + СкорректироватьДП;
					СтрокаДвиженийНачисления.КорректировкаЭСПВВалютеУчета = СтрокаДвиженийНачисления.КорректировкаЭСПВВалютеУчета + СкорректироватьЭСП;
					СтрокаДвиженийНачисления.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаДвиженийНачисления.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + СкорректироватьПП;
					
					Прервать;
				
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура РассчитатьПартииЕПС(Отказ)
	
	ЗаполнитьТаблицуПлановыхОпераций();
	
	РассчитыватьСтоимости = (ЭтотОбъект.ВариантРасчета = Перечисления.ВариантыРасчетаПартий.ПолныйРасчет);
	
	РассчитатьПартииСрочныхКонтрактовЕПС(Отказ, ТаблицаПлановыхОпераций, РассчитыватьСтоимости);
	РассчитатьПартииКПолучению(Отказ, ТаблицаПлановыхОпераций, РассчитыватьСтоимости);
	
	РесурсыРегистраПартийСодержащиеСуммы = СтрЗаменить(
		СтрСоединить(
			РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейРегистра(
				"РегистрыНакопления",
				"БухПартииЦенныхБумаг",
				Истина,
				,
				Истина),
			","),
		"Количество,",
		"") + ", СтоимостьПокупкиВВалютеУчета, СтоимостьПокупкиКупонаВВалютеУчета";
	
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета,
		Отказ);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// #436580 - для организации ДК сделано упрощение расчетов
	Организация_ДК = (ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК"));

	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.КонецПериода, ЭтотОбъект.Организация, СчетДоверительногоУправленияДляУчета);
	
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.НачалоПериода, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.КонецПериода, ЭтотОбъект.Организация, СчетДоверительногоУправленияДляУчета);
	
	Биржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
	
	МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ = РегистрыСведений.НастройкиУчетаОбщие.ПолучитьДатуНачалаНеобходимостиДанныхЕПСВоВводахЦБ(СчетДоверительногоУправленияДляУчета);	
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
	
	Порядок = "";
	Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ЛИФО Тогда
		Порядок = " УБЫВ ";
	КонецЕсли;
	
	#Область ЗапросПроданныеВРЕПО
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО КАК ПродажаРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПродажиРЕПО КАК СтрокаПродажиРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупки,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимости,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеСНачалаГодаОстаток КАК РасходыПриПокупкеСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимости,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимости,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьОстаток КАК Стоимость,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаСНачалаГодаПоложительнаяОстаток КАК ПереоценкаСНачалаГодаПоложительная,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО.Дата КАК ПериодРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.Дата КАК Период,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО.МоментВремени КАК МоментВремениРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия КАК Документ.СделкаРЕПО).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО КАК Документ.СделкаРЕПО).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК НомерСделкиРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияОстаток КАК ДисконтПремия,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупки,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальнаяОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашения,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгам,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КурсовыеРазницыСНачалаГодаОстаток КАК КурсовыеРазницыСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаОстаток КАК ИндексацияНоминала,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаСНачалаГодаОстаток КАК ИндексацияНоминалаСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладения,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПогашениеКупонаНеИсполненноеВСрокОстаток КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчетаОстаток КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЗадолженностьПоПогашениюТелаОстаток КАК ЗадолженностьПоПогашениюТела,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЗадолженностьПоПогашениюТелаВВалютеУчетаОстаток КАК ЗадолженностьПоПогашениюТелаВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЗадолженностьПоПогашениюКупонаОстаток КАК ЗадолженностьПоПогашениюКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЗадолженностьПоПогашениюКупонаВВалютеУчетаОстаток КАК ЗадолженностьПоПогашениюКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость КАК ВключатьРасходыПоПокупкеВСтоимость,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.Дата >= &ДатаЕПС
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПокупки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|			ТОГДА РеклассификацияАктивовЕПСПартии.ДатаПокупки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.Дата >= &ДатаЕПС
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПокупкиНачальная,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.КорректировкаЭСП / РеклассификацияАктивовЕПСПартии.Количество * БухПартииЦенныхБумагПроданныеВРепоОстатки.КоличествоОстаток, 0) КАК КорректировкаЭСПНачальная,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.СуммаПокупки / РеклассификацияАктивовЕПСПартии.Количество * БухПартииЦенныхБумагПроданныеВРепоОстатки.КоличествоОстаток, БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьПокупкиОстаток) КАК СтоимостьПокупкиНачальная
		|ПОМЕСТИТЬ _ПартииРЕПО
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагПроданныеВРепоОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
		|			И БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПартииРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииРЕПО.Период КАК Период
		|ПОМЕСТИТЬ _БумагиПериоды
		|ИЗ
		|	_ПартииРЕПО КАК ПартииРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БумагиПериоды.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_БумагиПериоды.Период КАК Период,
		|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала
		|ПОМЕСТИТЬ _ПериодыНоминалов
		|ИЗ
		|	_БумагиПериоды КАК _БумагиПериоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО _БумагиПериоды.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _БумагиПериоды.Период > НоминалыЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_БумагиПериоды.ЦеннаяБумага,
		|	_БумагиПериоды.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыНоминалов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПериодыНоминалов.Период КАК Период,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал
		|ПОМЕСТИТЬ _Номиналы
		|ИЗ
		|	_ПериодыНоминалов КАК _ПериодыНоминалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО _ПериодыНоминалов.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _ПериодыНоминалов.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПартииРЕПО.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ПартииРЕПО.Рынок КАК Рынок,
		|	_ПартииРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПартииРЕПО.ПродажаРЕПО КАК ПродажаРЕПО,
		|	_ПартииРЕПО.СтрокаПродажиРЕПО КАК СтрокаПродажиРЕПО,
		|	_ПартииРЕПО.Партия КАК Партия,
		|	_ПартииРЕПО.СтрокаПартии КАК СтрокаПартии,
		|	_ПартииРЕПО.Количество КАК Количество,
		|	_ПартииРЕПО.СтоимостьПокупки КАК СтоимостьПокупки,
		|	_ПартииРЕПО.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	_ПартииРЕПО.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	_ПартииРЕПО.РасходыПриПокупкеВСтоимостиВВалютеУчета КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	_ПартииРЕПО.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	_ПартииРЕПО.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	_ПартииРЕПО.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	_ПартииРЕПО.Стоимость КАК Стоимость,
		|	_ПартииРЕПО.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	_ПартииРЕПО.СтоимостьКупона КАК СтоимостьКупона,
		|	_ПартииРЕПО.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	_ПартииРЕПО.Переоценка КАК Переоценка,
		|	_ПартииРЕПО.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	_ПартииРЕПО.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	_ПартииРЕПО.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	_ПартииРЕПО.ПереоценкаКупона КАК ПереоценкаКупона,
		|	_ПартииРЕПО.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	_ПартииРЕПО.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	_ПартииРЕПО.ПериодРЕПО КАК ПериодРЕПО,
		|	_ПартииРЕПО.Период КАК Период,
		|	_ПартииРЕПО.МоментВремениРЕПО КАК МоментВремениРЕПО,
		|	_ПартииРЕПО.МоментВремени КАК МоментВремени,
		|	_ПартииРЕПО.НомерСделки КАК НомерСделки,
		|	_ПартииРЕПО.НомерСделкиРЕПО КАК НомерСделкиРЕПО,
		|	_ПартииРЕПО.ДисконтПремия КАК ДисконтПремия,
		|	_ПартииРЕПО.ДисконтПремияПокупки КАК ДисконтПремияПокупки,
		|	_ПартииРЕПО.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	_ПартииРЕПО.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	_ПартииРЕПО.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	_ПартииРЕПО.КорректировкаЭСП КАК КорректировкаЭСП,
		|	_ПартииРЕПО.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	_ПартииРЕПО.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	_Номиналы.Номинал КАК Номинал,
		|	_ПартииРЕПО.ДатаПокупки КАК ДатаПокупки,
		|	_ПартииРЕПО.ДатаПокупкиНачальная КАК ДатаПокупкиНачальная,
		|	_ПартииРЕПО.КорректировкаЭСПНачальная КАК КорректировкаЭСПНачальная,
		|	_ПартииРЕПО.СтоимостьПокупкиНачальная КАК СтоимостьПокупкиНачальная,
		|	_ПартииРЕПО.ВключатьРасходыПоПокупкеВСтоимость КАК ВключатьРасходыПоПокупкеВСтоимость,
		|	_ПартииРЕПО.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	_ПартииРЕПО.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	_ПартииРЕПО.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	_ПартииРЕПО.РазницаПервоначальногоПризнанияСНачалаГода КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	_ПартииРЕПО.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
		|	_ПартииРЕПО.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	_ПартииРЕПО.СуммаРезервовПодОбесценениеКупона КАК СуммаРезервовПодОбесценениеКупона,
		|	_ПартииРЕПО.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
		|	_ПартииРЕПО.КурсовыеРазницыСНачалаГода КАК КурсовыеРазницыСНачалаГода,
		|	_ПартииРЕПО.ИндексацияНоминала КАК ИндексацияНоминала,
		|	_ПартииРЕПО.ИндексацияНоминалаСНачалаГода КАК ИндексацияНоминалаСНачалаГода,
		|	_ПартииРЕПО.ИндексацияНоминалаЗаВремяВладения КАК ИндексацияНоминалаЗаВремяВладения,
		|	_ПартииРЕПО.ПогашениеКупонаНеИсполненноеВСрок КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	_ПартииРЕПО.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	_ПартииРЕПО.ЗадолженностьПоПогашениюТела КАК ЗадолженностьПоПогашениюТела,
		|	_ПартииРЕПО.ЗадолженностьПоПогашениюТелаВВалютеУчета КАК ЗадолженностьПоПогашениюТелаВВалютеУчета,
		|	_ПартииРЕПО.ЗадолженностьПоПогашениюКупона КАК ЗадолженностьПоПогашениюКупона,
		|	_ПартииРЕПО.ЗадолженностьПоПогашениюКупонаВВалютеУчета КАК ЗадолженностьПоПогашениюКупонаВВалютеУчета
		|ИЗ
		|	_ПартииРЕПО КАК _ПартииРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Номиналы КАК _Номиналы
		|		ПО _ПартииРЕПО.ЦеннаяБумага = _Номиналы.ЦеннаяБумага
		|			И _ПартииРЕПО.Период = _Номиналы.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодРЕПО,
		|	НомерСделкиРЕПО,
		|	МоментВремениРЕПО,
		|	Период,
		|	НомерСделки,
		|	МоментВремени";
		
	#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("ДатаЕПС", МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ);
	
	ПартииПроданныеВРЕПО = Запрос.Выполнить().Выгрузить();
	
		
	#Область ЗапросКупленныеПоРЕПО	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьОстаток КАК Стоимость,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия.Дата КАК Период,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия КАК Документ.СделкаРЕПО).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.СделкаРЕПО).НомерСделки
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК НомерСделки,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаСНачалаГодаПоложительнаяОстаток КАК ПереоценкаСНачалаГодаПоложительная,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода
		|ПОМЕСТИТЬ _ПартииРЕПО
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагКупленныеПоРЕПООстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииРЕПО.Рынок КАК Рынок,
		|	ПартииРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииРЕПО.Партия КАК Партия,
		|	ПартииРЕПО.СтрокаПартии КАК СтрокаПартии,
		|	ПартииРЕПО.Количество КАК Количество,
		|	ПартииРЕПО.Стоимость КАК Стоимость,
		|	ПартииРЕПО.СтоимостьКупона КАК СтоимостьКупона,
		|	ПартииРЕПО.Переоценка КАК Переоценка,
		|	ПартииРЕПО.ПереоценкаКупона КАК ПереоценкаКупона,
		|	ПартииРЕПО.Период КАК Период,
		|	ПартииРЕПО.МоментВремени КАК МоментВремени,
		|	ПартииРЕПО.НомерСделки КАК НомерСделки,
		|	ПартииРЕПО.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПартииРЕПО.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	ПартииРЕПО.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала,
		|	ПартииРЕПО.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	ПартииРЕПО.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета
		|ПОМЕСТИТЬ _ПартииРЕПОСПериодомНоминала
		|ИЗ
		|	_ПартииРЕПО КАК ПартииРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ПартииРЕПО.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ПартииРЕПО.Период > НоминалыЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииРЕПО.Рынок,
		|	ПартииРЕПО.ЦеннаяБумага,
		|	ПартииРЕПО.Партия,
		|	ПартииРЕПО.СтрокаПартии,
		|	ПартииРЕПО.Количество,
		|	ПартииРЕПО.Стоимость,
		|	ПартииРЕПО.СтоимостьКупона,
		|	ПартииРЕПО.Переоценка,
		|	ПартииРЕПО.ПереоценкаКупона,
		|	ПартииРЕПО.Период,
		|	ПартииРЕПО.МоментВремени,
		|	ПартииРЕПО.НомерСделки,
		|	ПартииРЕПО.ПереоценкаСНачалаГода,
		|	ПартииРЕПО.ПереоценкаСНачалаГодаПоложительная,
		|	ПартииРЕПО.ПереоценкаКупонаСНачалаГода,
		|	ПартииРЕПО.СтоимостьВВалютеУчета,
		|	ПартииРЕПО.СтоимостьКупонаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаКупонаВВалютеУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииРЕПОСПериодомНоминала.Рынок КАК Рынок,
		|	ПартииРЕПОСПериодомНоминала.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииРЕПОСПериодомНоминала.Партия КАК Партия,
		|	ПартииРЕПОСПериодомНоминала.СтрокаПартии КАК СтрокаПартии,
		|	ПартииРЕПОСПериодомНоминала.Количество КАК Количество,
		|	ПартииРЕПОСПериодомНоминала.Стоимость КАК Стоимость,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьКупона КАК СтоимостьКупона,
		|	ПартииРЕПОСПериодомНоминала.Переоценка КАК Переоценка,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупона КАК ПереоценкаКупона,
		|	ПартииРЕПОСПериодомНоминала.Период КАК Период,
		|	ПартииРЕПОСПериодомНоминала.МоментВремени КАК МоментВремени,
		|	ПартииРЕПОСПериодомНоминала.НомерСделки КАК НомерСделки,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ПериодНоминала КАК ПериодНоминала,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета
		|ИЗ
		|	_ПартииРЕПОСПериодомНоминала КАК ПартииРЕПОСПериодомНоминала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ПартииРЕПОСПериодомНоминала.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ПартииРЕПОСПериодомНоминала.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	НомерСделки,
		|	МоментВремени";
		
	#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	ПартииКупленныеПоРЕПО = Запрос.Выполнить().Выгрузить();
	
	ПартииКупленныеПоРЕПО.Колонки.Добавить("ДисконтПремияНачисленный", Новый ОписаниеТипов("Число"));
	ПартииКупленныеПоРЕПО.Колонки.Добавить("ДисконтПремияНачисленныйВВалютеУчета", Новый ОписаниеТипов("Число"));
	ПартииКупленныеПоРЕПО.Колонки.Добавить("КорректировкаЭСП", Новый ОписаниеТипов("Число"));
	ПартииКупленныеПоРЕПО.Колонки.Добавить("КорректировкаЭСПВВалютеУчета", Новый ОписаниеТипов("Число"));
	ПартииКупленныеПоРЕПО.Колонки.Добавить("РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", Новый ОписаниеТипов("Число"));
	ПартииКупленныеПоРЕПО.Колонки.Добавить("РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета", Новый ОписаниеТипов("Число"));
	
	#Область ЗапросОстаткиИОперацииСЦБ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеДанные.Рынок КАК Рынок,
		|	ПлановыеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПлановыеДанные.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ПлановыеДанные.Партия КАК Партия,
		|	ПлановыеДанные.СтрокаПартии КАК СтрокаПартии,
		|	ПлановыеДанные.Количество КАК Количество,
		|	ПлановыеДанные.Период КАК Период,
		|	ПлановыеДанные.Регистратор КАК Регистратор,
		|	ПлановыеДанные.ВидДвижения КАК ВидДвижения,
		|	ПлановыеДанные.МоментВремени КАК МоментВремени,
		|	ПлановыеДанные.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	ПлановыеДанные.ВалютаСделки КАК ВалютаСделки,
		|	ПлановыеДанные.СуммаНаОднуОблигацию КАК СуммаНаОднуОблигацию,
		|	ПлановыеДанные.ВалютаСделки КАК Валюта,
		|	ПлановыеДанные.ДатаФиксации КАК ДатаФиксации,
		|	ПлановыеДанные.ВидПогашения КАК ВидПогашения,
		|	ПлановыеДанные.Сумма КАК Сумма,
		|	ПлановыеДанные.СуммаКупона КАК СуммаКупона,
		|	ПлановыеДанные.Основание КАК Основание
		|ПОМЕСТИТЬ _ПлановыеДанные
		|ИЗ
		|	&ПлановыеДанные КАК ПлановыеДанные
		|ГДЕ
		|	ПлановыеДанные.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОтборПоЦеннымБумагам
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И (&ВключатьВводыВыводы
		|				И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) В (ТИП(Документ.ВводЦенныхБумаг), ТИП(Документ.ВыводЦенныхБумаг))
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Сделка)
		|				И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ОтложенноеИсполнение
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СделкаРЕПО)
		|				И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ОтложенноеИсполнение
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) В (ТИП(Документ.ИсполнениеОбязательствПоСделке), ТИП(Документ.ПоставкаЦенныхБумаг), ТИП(Документ.ПогашениеКупона), ТИП(Документ.Оплата), ТИП(Документ.СписаниеЦеннойБумаги), ТИП(Документ.СнятиеЦеннойБумагиСУчета), ТИП(Документ.ПогашениеЦеннойБумаги), ТИП(Документ.РеклассификацияАктивовЕПС), ТИП(Документ.НачислениеСписаниеРезервов))
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.КонвертацияЦенныхБумаг)
		|				И ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету)
		|				И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету).ВыбытиеПоЕПС)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ПлановыеДанные.ЦеннаяБумага
		|ИЗ
		|	_ПлановыеДанные КАК _ПлановыеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеСНачалаГодаОстаток КАК РасходыПриПокупкеСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашенияОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток КАК ДисконтПремияОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупкиОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальнаяОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальнаяОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК ДисконтПремияНачисленныйВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.КурсовыеРазницыСНачалаГодаОстаток КАК КурсовыеРазницыСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценениеОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгамОстаток,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК ИндексацияНоминалаОстаток,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаСНачалаГодаОстаток КАК ИндексацияНоминалаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладенияОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаПоложительнаяОстаток КАК ПереоценкаСНачалаГодаПоложительнаяОстаток,
		|	БухПартииЦенныхБумагОстатки.ПогашениеКупонаНеИсполненноеВСрокОстаток КАК ПогашениеКупонаНеИсполненноеВСрокОстаток,
		|	БухПартииЦенныхБумагОстатки.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчетаОстаток КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюКупонаОстаток КАК ЗадолженностьПоПогашениюКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюКупонаВВалютеУчетаОстаток КАК ЗадолженностьПоПогашениюКупонаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюТелаОстаток КАК ЗадолженностьПоПогашениюТелаОстаток,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюТелаВВалютеУчетаОстаток КАК ЗадолженностьПоПогашениюТелаВВалютеУчетаОстаток
		|ПОМЕСТИТЬ _ОстаткиПартийИндекс
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета
		|				И Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|				И (НЕ &РассчитыватьСтоимости
		|					ИЛИ ЦеннаяБумага В
		|						(ВЫБРАТЬ
		|							Отбор.ЦеннаяБумага
		|						ИЗ
		|							_ОтборПоЦеннымБумагам КАК Отбор))) КАК БухПартииЦенныхБумагОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупки,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупона,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимости,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеСНачалаГодаОстаток КАК РасходыПриПокупкеСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимости,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимости,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК Стоимость,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумагОстатки.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашения,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток КАК ДисконтПремия,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупки,
		|	&НачалоПериода КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход) КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.Сделка).МоментВремени
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).МоментВремени
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ВводЦенныхБумаг).МоментВремени
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.РеклассификацияАктивовЕПС).МоментВремени
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.Партия.МоментВремени
		|	КОНЕЦ КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|			ТОГДА ВЫБОР
		|					КОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки = """"
		|						ТОГДА ""9999999999999999""
		|					ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.НомерСделки
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|			ТОГДА ВЫБОР
		|					КОГДА РеклассификацияАктивовЕПСПартии.НомерСделки = """"
		|						ТОГДА ""9999999999999999""
		|					ИНАЧЕ РеклассификацияАктивовЕПСПартии.НомерСделки
		|				КОНЕЦ
		|		ИНАЧЕ ""9999999999999999""
		|	КОНЕЦ КАК НомерСделки,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальнаяОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.КурсовыеРазницыСНачалаГодаОстаток КАК КурсовыеРазницыСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупона,
		|	ЛОЖЬ КАК ПлановыеДанные,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаСделки,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгам,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка) КАК Основание,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ВводЦенныхБумаг).Дата >= &ДатаЕПС
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПокупки,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК ИндексацияНоминала,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаСНачалаГодаОстаток КАК ИндексацияНоминалаСНачалаГода,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладения,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаПоложительнаяОстаток КАК ПереоценкаСНачалаГодаПоложительная,
		|	БухПартииЦенныхБумагОстатки.ПогашениеКупонаНеИсполненноеВСрокОстаток КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	БухПартииЦенныхБумагОстатки.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчетаОстаток КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка) КАК ПерваяЧастьРЕПО,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюКупонаОстаток КАК ЗадолженностьПоПогашениюКупона,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюКупонаВВалютеУчетаОстаток КАК ЗадолженностьПоПогашениюКупонаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|			ТОГДА РеклассификацияАктивовЕПСПартии.ДатаПокупки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ВводЦенныхБумаг).Дата >= &ДатаЕПС
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПокупкиНачальная,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.КорректировкаЭСП / РеклассификацияАктивовЕПСПартии.Количество * БухПартииЦенныхБумагОстатки.КоличествоОстаток, 0) КАК КорректировкаЭСПНачальная,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.СуммаПокупки / РеклассификацияАктивовЕПСПартии.Количество * БухПартииЦенныхБумагОстатки.КоличествоОстаток, БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток) КАК СтоимостьПокупкиНачальная,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюТелаОстаток КАК ЗадолженностьПоПогашениюТела,
		|	БухПартииЦенныхБумагОстатки.ЗадолженностьПоПогашениюТелаВВалютеУчетаОстаток КАК ЗадолженностьПоПогашениюТелаВВалютеУчета,
		|	0 КАК ЧастьСделкиРЕПО,
		|	0 КАК СуммаНаОднуОблигацию,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаФиксации,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка) КАК ВидПогашения,
		|	0 КАК Сумма,
		|	0 КАК СуммаКупона,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка) КАК ВидЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаОплаты,
		|	НЕ Отбор.ЦеннаяБумага ЕСТЬ NULL КАК ЕстьДвижения
		|ПОМЕСТИТЬ _ОстаткиПартий
		|ИЗ
		|	_ОстаткиПартийИндекс КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО БухПартииЦенныхБумагОстатки.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОтборПоЦеннымБумагам КАК Отбор
		|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = Отбор.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ОстаткиПартий.Рынок КАК Рынок,
		|	_ОстаткиПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиПартий.Партия КАК Партия,
		|	_ОстаткиПартий.СтрокаПартии КАК СтрокаПартии,
		|	_ОстаткиПартий.Количество КАК Количество,
		|	_ОстаткиПартий.СтоимостьПокупки КАК СтоимостьПокупки,
		|	_ОстаткиПартий.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	_ОстаткиПартий.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	_ОстаткиПартий.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	_ОстаткиПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	_ОстаткиПартий.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	_ОстаткиПартий.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	_ОстаткиПартий.Стоимость КАК Стоимость,
		|	_ОстаткиПартий.СтоимостьКупона КАК СтоимостьКупона,
		|	_ОстаткиПартий.Переоценка КАК Переоценка,
		|	_ОстаткиПартий.ПереоценкаКупона КАК ПереоценкаКупона,
		|	_ОстаткиПартий.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
		|	_ОстаткиПартий.ДисконтПремия КАК ДисконтПремия,
		|	_ОстаткиПартий.ДисконтПремияПокупки КАК ДисконтПремияПокупки,
		|	_ОстаткиПартий.Период КАК Период,
		|	_ОстаткиПартий.Регистратор КАК Регистратор,
		|	_ОстаткиПартий.ВидДвижения КАК ВидДвижения,
		|	_ОстаткиПартий.МоментВремени КАК МоментВремени,
		|	_ОстаткиПартий.НомерСделки КАК НомерСделки,
		|	_ОстаткиПартий.КорректировкаЭСП КАК КорректировкаЭСП,
		|	_ОстаткиПартий.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	_ОстаткиПартий.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	_ОстаткиПартий.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	_ОстаткиПартий.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	_ОстаткиПартий.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияСНачалаГода КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	_ОстаткиПартий.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	_ОстаткиПартий.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	_ОстаткиПартий.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	_ОстаткиПартий.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	_ОстаткиПартий.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	_ОстаткиПартий.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	_ОстаткиПартий.КурсовыеРазницыСНачалаГода КАК КурсовыеРазницыСНачалаГода,
		|	_ОстаткиПартий.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	_ОстаткиПартий.СуммаРезервовПодОбесценениеКупона КАК СуммаРезервовПодОбесценениеКупона,
		|	_ОстаткиПартий.ПлановыеДанные КАК ПлановыеДанные,
		|	_ОстаткиПартий.ВалютаСделки КАК ВалютаСделки,
		|	_ОстаткиПартий.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
		|	_ОстаткиПартий.Основание КАК Основание,
		|	_ОстаткиПартий.ДатаПокупки КАК ДатаПокупки,
		|	_ОстаткиПартий.ИндексацияНоминала КАК ИндексацияНоминала,
		|	_ОстаткиПартий.ИндексацияНоминалаСНачалаГода КАК ИндексацияНоминалаСНачалаГода,
		|	_ОстаткиПартий.ИндексацияНоминалаЗаВремяВладения КАК ИндексацияНоминалаЗаВремяВладения,
		|	_ОстаткиПартий.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	_ОстаткиПартий.ПогашениеКупонаНеИсполненноеВСрок КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	_ОстаткиПартий.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	_ОстаткиПартий.ПерваяЧастьРЕПО КАК ПерваяЧастьРЕПО,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюКупона КАК ЗадолженностьПоПогашениюКупона,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюКупонаВВалютеУчета КАК ЗадолженностьПоПогашениюКупонаВВалютеУчета,
		|	_ОстаткиПартий.ДатаПокупкиНачальная КАК ДатаПокупкиНачальная,
		|	_ОстаткиПартий.КорректировкаЭСПНачальная КАК КорректировкаЭСПНачальная,
		|	_ОстаткиПартий.СтоимостьПокупкиНачальная КАК СтоимостьПокупкиНачальная,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюТела КАК ЗадолженностьПоПогашениюТела,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюТелаВВалютеУчета КАК ЗадолженностьПоПогашениюТелаВВалютеУчета,
		|	_ОстаткиПартий.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_ОстаткиПартий.СуммаНаОднуОблигацию КАК СуммаНаОднуОблигацию,
		|	_ОстаткиПартий.ДатаФиксации КАК ДатаФиксации,
		|	_ОстаткиПартий.ВидПогашения КАК ВидПогашения,
		|	_ОстаткиПартий.Сумма КАК Сумма,
		|	_ОстаткиПартий.СуммаКупона КАК СуммаКупона,
		|	_ОстаткиПартий.ВидЗадолженности КАК ВидЗадолженности,
		|	_ОстаткиПартий.ВалютаОплаты КАК ВалютаОплаты,
		|	_ОстаткиПартий.ЕстьДвижения КАК ЕстьДвижения
		|ПОМЕСТИТЬ _ОстаткиБезДвижений
		|ИЗ
		|	_ОстаткиПартий КАК _ОстаткиПартий
		|ГДЕ
		|	НЕ &РассчитыватьСтоимости
		|	И НЕ _ОстаткиПартий.ЕстьДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ОстаткиПартий.Рынок КАК Рынок,
		|	_ОстаткиПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиПартий.Партия КАК Партия,
		|	_ОстаткиПартий.СтрокаПартии КАК СтрокаПартии,
		|	_ОстаткиПартий.Количество КАК Количество,
		|	_ОстаткиПартий.СтоимостьПокупки КАК СтоимостьПокупки,
		|	_ОстаткиПартий.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	_ОстаткиПартий.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	_ОстаткиПартий.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	_ОстаткиПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	_ОстаткиПартий.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	_ОстаткиПартий.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	_ОстаткиПартий.Стоимость КАК Стоимость,
		|	_ОстаткиПартий.СтоимостьКупона КАК СтоимостьКупона,
		|	_ОстаткиПартий.Переоценка КАК Переоценка,
		|	_ОстаткиПартий.ПереоценкаКупона КАК ПереоценкаКупона,
		|	_ОстаткиПартий.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
		|	_ОстаткиПартий.ДисконтПремия КАК ДисконтПремия,
		|	_ОстаткиПартий.ДисконтПремияПокупки КАК ДисконтПремияПокупки,
		|	_ОстаткиПартий.Период КАК Период,
		|	_ОстаткиПартий.Регистратор КАК Регистратор,
		|	_ОстаткиПартий.ВидДвижения КАК ВидДвижения,
		|	_ОстаткиПартий.МоментВремени КАК МоментВремени,
		|	_ОстаткиПартий.НомерСделки КАК НомерСделки,
		|	_ОстаткиПартий.КорректировкаЭСП КАК КорректировкаЭСП,
		|	_ОстаткиПартий.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	_ОстаткиПартий.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	_ОстаткиПартий.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	_ОстаткиПартий.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	_ОстаткиПартий.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияСНачалаГода КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	_ОстаткиПартий.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	_ОстаткиПартий.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	_ОстаткиПартий.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	_ОстаткиПартий.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	_ОстаткиПартий.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	_ОстаткиПартий.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	_ОстаткиПартий.КурсовыеРазницыСНачалаГода КАК КурсовыеРазницыСНачалаГода,
		|	_ОстаткиПартий.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	_ОстаткиПартий.СуммаРезервовПодОбесценениеКупона КАК СуммаРезервовПодОбесценениеКупона,
		|	_ОстаткиПартий.ПлановыеДанные КАК ПлановыеДанные,
		|	_ОстаткиПартий.ВалютаСделки КАК ВалютаСделки,
		|	_ОстаткиПартий.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
		|	_ОстаткиПартий.Основание КАК Основание,
		|	_ОстаткиПартий.ДатаПокупки КАК ДатаПокупки,
		|	_ОстаткиПартий.ИндексацияНоминала КАК ИндексацияНоминала,
		|	_ОстаткиПартий.ИндексацияНоминалаСНачалаГода КАК ИндексацияНоминалаСНачалаГода,
		|	_ОстаткиПартий.ИндексацияНоминалаЗаВремяВладения КАК ИндексацияНоминалаЗаВремяВладения,
		|	_ОстаткиПартий.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	_ОстаткиПартий.ПогашениеКупонаНеИсполненноеВСрок КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	_ОстаткиПартий.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	_ОстаткиПартий.ПерваяЧастьРЕПО КАК ПерваяЧастьРЕПО,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюКупона КАК ЗадолженностьПоПогашениюКупона,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюКупонаВВалютеУчета КАК ЗадолженностьПоПогашениюКупонаВВалютеУчета,
		|	_ОстаткиПартий.ДатаПокупкиНачальная КАК ДатаПокупкиНачальная,
		|	_ОстаткиПартий.КорректировкаЭСПНачальная КАК КорректировкаЭСПНачальная,
		|	_ОстаткиПартий.СтоимостьПокупкиНачальная КАК СтоимостьПокупкиНачальная,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюТела КАК ЗадолженностьПоПогашениюТела,
		|	_ОстаткиПартий.ЗадолженностьПоПогашениюТелаВВалютеУчета КАК ЗадолженностьПоПогашениюТелаВВалютеУчета,
		|	_ОстаткиПартий.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_ОстаткиПартий.СуммаНаОднуОблигацию КАК СуммаНаОднуОблигацию,
		|	_ОстаткиПартий.ДатаФиксации КАК ДатаФиксации,
		|	_ОстаткиПартий.ВидПогашения КАК ВидПогашения,
		|	_ОстаткиПартий.Сумма КАК Сумма,
		|	_ОстаткиПартий.СуммаКупона КАК СуммаКупона,
		|	_ОстаткиПартий.ВидЗадолженности КАК ВидЗадолженности,
		|	_ОстаткиПартий.ВалютаОплаты КАК ВалютаОплаты
		|ПОМЕСТИТЬ _Партии
		|ИЗ
		|	_ОстаткиПартий КАК _ОстаткиПартий
		|ГДЕ
		|	_ОстаткиПартий.ЕстьДвижения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.РеклассификацияАктивовЕПС = ЗНАЧЕНИЕ(Документ.РеклассификацияАктивовЕПС.ПустаяСсылка)
		|			ТОГДА ОперацииСЦеннымиБумагами.Регистратор
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.РеклассификацияАктивовЕПС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.РеклассификацияАктивовЕПС = ЗНАЧЕНИЕ(Документ.РеклассификацияАктивовЕПС.ПустаяСсылка)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СтрокаРеклассификации
		|	КОНЕЦ,
		|	ВводЦенныхБумагЦенныеБумаги.Количество,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВводЦенныхБумагЦенныеБумаги.Ссылка КАК Документ.ВводЦенныхБумаг).Дата < &ДатаЕПС
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.Сумма
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПокупки > 0
		|					ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПокупки
		|				КОГДА ВводЦенныхБумагЦенныеБумаги.ДисконтПремия > 0
		|					ТОГДА ВводЦенныхБумагЦенныеБумаги.Сумма + ВводЦенныхБумагЦенныеБумаги.ДисконтПремия
		|				ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Сумма
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВводЦенныхБумагЦенныеБумаги.Ссылка КАК Документ.ВводЦенныхБумаг).Дата < &ДатаЕПС
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаПокупкиКупона
		|	КОНЕЦ,
		|	ВводЦенныхБумагЦенныеБумаги.РасходыПриПокупкеВСтоимости,
		|	0,
		|	ВводЦенныхБумагЦенныеБумаги.РасходыПриПокупкеВСтоимости,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВводЦенныхБумагЦенныеБумаги.Ссылка КАК Документ.ВводЦенныхБумаг).Дата < &ДатаЕПС
		|				ИЛИ ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.Сумма
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПокупки > 0
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПокупки
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Сумма
		|	КОНЕЦ,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаКупона,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаПереоценки,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленного,
		|	0,
		|	ВводЦенныхБумагЦенныеБумаги.ДисконтПремия,
		|	ВводЦенныхБумагЦенныеБумаги.ДисконтПремияПокупки,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВводЦенныхБумаг).МоментВремени,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки = """"
		|			ТОГДА ""9999999999999999""
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.НомерСделки
		|	КОНЕЦ,
		|	ВводЦенныхБумагЦенныеБумаги.КорректировкаЭСП,
		|	ВводЦенныхБумагЦенныеБумаги.ДисконтПремияНачисленный,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВводЦенныхБумагЦенныеБумаги.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	ВводЦенныхБумагЦенныеБумаги.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаВВалютеУчета <> 0
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаВВалютеУчета
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупона * КурсВалютыНоминала.Курс / КурсВалютыНоминала.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаВВалютеУчета <> 0
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаВВалютеУчета
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Сумма * КурсВалютыНоминала.Курс / КурсВалютыНоминала.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПереоценкиВВалютеУчета <> 0
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПереоценкиВВалютеУчета
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаПереоценки * КурсВалютыНоминала.Курс / КурсВалютыНоминала.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоВВалютеУчета <> 0
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоВВалютеУчета
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленного * КурсВалютыНоминала.Курс / КурсВалютыНоминала.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.ДисконтПремияНачисленныйВВалютеУчета <> 0
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДисконтПремияНачисленныйВВалютеУчета
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.ДисконтПремияНачисленный * КурсВалютыНоминала.Курс / КурсВалютыНоминала.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.КорректировкаЭСПВВалютеУчета <> 0
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.КорректировкаЭСПВВалютеУчета
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.КорректировкаЭСП * КурсВалютыНоминала.Курс / КурсВалютыНоминала.Кратность / КурсВалютыУчета.Курс * КурсВалютыУчета.Кратность
		|	КОНЕЦ,
		|	ВводЦенныхБумагЦенныеБумаги.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	0,
		|	ВводЦенныхБумагЦенныеБумаги.РезервПодОбесценение,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ВводЦенныхБумагЦенныеБумаги.ДатаПокупки,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаИндексацииНоминала,
		|	0,
		|	0,
		|	0,
		|	ВводЦенныхБумагЦенныеБумаги.ПогашениеКупонаНеИсполненноеВСрок,
		|	ВводЦенныхБумагЦенныеБумаги.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженностьКупон,
		|	ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженностьКупон,
		|	ВводЦенныхБумагЦенныеБумаги.ДатаПокупки,
		|	0,
		|	0,
		|	ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженность,
		|	ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженность,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|			ПО ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|				И (КурсВалютыНоминала.Период = НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.Ссылка.Дата, ДЕНЬ))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыУчета
		|			ПО ВводЦенныхБумагЦенныеБумаги.Ссылка.Организация.ВалютаУчета = КурсВалютыУчета.Валюта
		|				И (КурсВалютыУчета.Период = НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.Ссылка.Дата, ДЕНЬ))
		|		ПО ОперацииСЦеннымиБумагами.Операция = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И ОперацииСЦеннымиБумагами.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И &ВключатьВводыВыводы
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ВыводЦенныхБумагЦенныеБумаги.Партия,
		|	ВыводЦенныхБумагЦенныеБумаги.СтрокаПартии,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВыводЦенныхБумаг).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
		|		ПО ОперацииСЦеннымиБумагами.Операция = ВыводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.НомерСтроки = ВыводЦенныхБумагЦенныеБумаги.НомерСтроки
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И &ВключатьВводыВыводы
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВыводЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).МоментВремени,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).НомерСделки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ВалютаСделки,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ВалютаОплаты
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&КонецПериода,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И Организация.ВалютаУчета = Валюта
		|					И (ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделке
		|		ПО ОперацииСЦеннымиБумагами.Операция = РасходыПоСделке.Сделка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Сделка)
		|	И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ОтложенноеИсполнение
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).МоментВремени,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).НомерСделки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ВалютаСделки,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ЧастьСделкиРЕПО = 2
		|			ТОГДА ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ПерваяЧастьРЕПО
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.Регистратор
		|	КОНЕЦ,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ЧастьСделкиРЕПО,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ВалютаОплаты
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&КонецПериода,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И Организация.ВалютаУчета = Валюта
		|					И (ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделке
		|		ПО ОперацииСЦеннымиБумагами.Операция = РасходыПоСделке.Сделка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СделкаРЕПО)
		|	И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ОтложенноеИсполнение
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).МоментВремени,
		|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание.ВалютаСделки,
		|	0,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&КонецПериода,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И Организация.ВалютаУчета = Валюта
		|					И (ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделке
		|		ПО (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание = РасходыПоСделке.Сделка)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание.ВалютаСделки,
		|	0,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&КонецПериода,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И Организация.ВалютаУчета = Валюта
		|					И (ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделке
		|		ПО (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание = РасходыПоСделке.Сделка)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеКупона).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеКупона).СуммаНаОднуОблигацию,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеКупона).ДатаФиксации,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеКупона).ВалютаОплаты
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Оплата).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Оплата).ВидЗадолженности,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Оплата).ВалютаОплаты
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Оплата)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.КонвертацияЦенныхБумаг).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.КонвертацияЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СписаниеЦеннойБумаги).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СнятиеЦеннойБумагиСУчета).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СнятиеЦеннойБумагиСУчета)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету).ВыбытиеПоЕПС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).ДатаФиксации,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).ВидПогашения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).Сумма,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).СуммаКупона,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).ВалютаОплаты
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	НачислениеСписаниеРезервовПартии.Партия,
		|	НачислениеСписаниеРезервовПартии.СтрокаПартии,
		|	НачислениеСписаниеРезервовПартии.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ДатаОперации = &НачалоПериода
		|			ТОГДА ДОБАВИТЬКДАТЕ(ОперацииСЦеннымиБумагами.ДатаОперации, СЕКУНДА, 1)
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.ДатаОперации
		|	КОНЕЦ,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.НачислениеСписаниеРезервов).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	НачислениеСписаниеРезервовПартии.СуммаРезерваПартии,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеСписаниеРезервов.Партии КАК НачислениеСписаниеРезервовПартии
		|		ПО ОперацииСЦеннымиБумагами.Операция = НачислениеСписаниеРезервовПартии.Ссылка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = НачислениеСписаниеРезервовПартии.Актив
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.НачислениеСписаниеРезервов)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И &УчитыватьРезервы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеклассификацияАктивовЕПС.УчетныйАктивЕПС,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	РеклассификацияАктивовЕПСПартии.Партия,
		|	РеклассификацияАктивовЕПСПартии.СтрокаПартии,
		|	РеклассификацияАктивовЕПСПартии.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	РеклассификацияАктивовЕПСПартии.Стоимость,
		|	0,
		|	РеклассификацияАктивовЕПСПартии.Переоценка,
		|	0,
		|	0,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремия,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияПокупки,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ДатаОперации = &НачалоПериода
		|			ТОГДА ДОБАВИТЬКДАТЕ(ОперацииСЦеннымиБумагами.ДатаОперации, СЕКУНДА, 1)
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.ДатаОперации
		|	КОНЕЦ,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.РеклассификацияАктивовЕПС).МоментВремени,
		|	РеклассификацияАктивовЕПСПартии.НомерСтроки,
		|	РеклассификацияАктивовЕПСПартии.КорректировкаЭСП,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленный,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	0,
		|	РеклассификацияАктивовЕПСПартии.СтоимостьВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.ПереоценкаВВалютеУчета,
		|	0,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленныйВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.КорректировкаЭСПВВалютеУчета,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	0,
		|	РеклассификацияАктивовЕПСПартии.СуммаРезервовПодОбесценение,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	0,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО ОперацииСЦеннымиБумагами.Операция = РеклассификацияАктивовЕПСПартии.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС КАК РеклассификацияАктивовЕПС
		|		ПО ОперацииСЦеннымиБумагами.Операция = РеклассификацияАктивовЕПС.Ссылка
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПлановыеДанные.УчетныйАктивЕПС,
		|	ПлановыеДанные.Рынок,
		|	ПлановыеДанные.ЦеннаяБумага,
		|	ПлановыеДанные.Партия,
		|	ПлановыеДанные.СтрокаПартии,
		|	ПлановыеДанные.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ПлановыеДанные.Период,
		|	ПлановыеДанные.Регистратор,
		|	ПлановыеДанные.ВидДвижения,
		|	ПлановыеДанные.МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ИСТИНА,
		|	ПлановыеДанные.Валюта,
		|	0,
		|	ПлановыеДанные.Основание,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	0,
		|	0,
		|	ПлановыеДанные.ЧастьСделкиРЕПО,
		|	ПлановыеДанные.СуммаНаОднуОблигацию,
		|	ПлановыеДанные.ДатаФиксации,
		|	ПлановыеДанные.ВидПогашения,
		|	ПлановыеДанные.Сумма,
		|	ПлановыеДанные.СуммаКупона,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	_ПлановыеДанные КАК ПлановыеДанные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Рынок,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	БухПартииЦенныхБумаг.Количество,
		|	БухПартииЦенныхБумаг.СтоимостьПокупки,
		|	БухПартииЦенныхБумаг.СтоимостьПокупкиКупона,
		|	БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимости,
		|	БухПартииЦенныхБумаг.РасходыПриПокупкеСНачалаГода,
		|	БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаВСтоимости,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВСтоимости,
		|	БухПартииЦенныхБумаг.Стоимость,
		|	БухПартииЦенныхБумаг.СтоимостьКупона,
		|	БухПартииЦенныхБумаг.Переоценка,
		|	БухПартииЦенныхБумаг.ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.СуммаЧастичногоПогашения,
		|	БухПартииЦенныхБумаг.ДисконтПремия,
		|	БухПартииЦенныхБумаг.ДисконтПремияПокупки,
		|	БухПартииЦенныхБумаг.Период,
		|	БухПартииЦенныхБумаг.Регистратор,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|	КОНЕЦ,
		|	БухПартииЦенныхБумаг.МоментВремени,
		|	""9999999999999999"",
		|	БухПартииЦенныхБумаг.КорректировкаЭСП,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаСНачалаГода,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПСНачалаГода,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйСНачалаГода,
		|	БухПартииЦенныхБумаг.ПереоценкаСНачалаГода,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияСНачалаГода,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумаг.КурсовыеРазницыСНачалаГода,
		|	БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумаг.СуммаРезервовПодОбесценениеКупона,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	БухПартииЦенныхБумаг.СуммаРезервовПоСомнительнымДолгам,
		|	ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И БухПартииЦенныхБумаг.Партия.Дата >= &ДатаЕПС
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(БухПартииЦенныхБумаг.Партия.Дата, ДЕНЬ)
		|	КОНЕЦ,
		|	БухПартииЦенныхБумаг.ИндексацияНоминала,
		|	БухПартииЦенныхБумаг.ИндексацияНоминалаСНачалаГода,
		|	БухПартииЦенныхБумаг.ИндексацияНоминалаЗаВремяВладения,
		|	БухПартииЦенныхБумаг.ПереоценкаСНачалаГодаПоложительная,
		|	БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрок,
		|	БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка),
		|	БухПартииЦенныхБумаг.ЗадолженностьПоПогашениюКупона,
		|	БухПартииЦенныхБумаг.ЗадолженностьПоПогашениюКупонаВВалютеУчета,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	0,
		|	0,
		|	БухПартииЦенныхБумаг.ЗадолженностьПоПогашениюТела,
		|	БухПартииЦенныхБумаг.ЗадолженностьПоПогашениюТелаВВалютеУчета,
		|	0,
		|	0,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|ИЗ
		|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|			ПО БухПартииЦенныхБумаг.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|				И БухПартииЦенныхБумаг.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|		ПО (БухПартииЦенныхБумаг.Регистратор = КорректировкаРегистров.Ссылка)
		|			И (БухПартииЦенныхБумаг.ВидУчета = &ВидУчета)
		|ГДЕ
		|	КорректировкаРегистров.Организация = &Организация
		|	И КорректировкаРегистров.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И КорректировкаРегистров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И БухПартииЦенныхБумаг.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА Партии.Основание
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ТОГДА Партии.Основание
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА Партии.Регистратор
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА Партии.Регистратор
		|		ИНАЧЕ Партии.Регистратор
		|	КОНЕЦ КАК Основание,
		|	Партии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(Партии.Основание КАК Документ.Сделка).ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ТОГДА ВЫРАЗИТЬ(Партии.Основание КАК Документ.Сделка).ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.Сделка).ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.СделкаРЕПО).ВидСделки
		|		ИНАЧЕ ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.Сделка).ВидСделки
		|	КОНЕЦ КАК ВидСделки
		|ПОМЕСТИТЬ _ТаблицаСделок
		|ИЗ
		|	_Партии КАК Партии
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (ТИП(Документ.ИсполнениеОбязательствПоСделке), ТИП(Документ.ПоставкаЦенныхБумаг), ТИП(Документ.Сделка), ТИП(Документ.СделкаРЕПО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходыПоСделкеОбороты.Сделка КАК Сделка,
		|	РасходыПоСделкеОбороты.Период КАК Период,
		|	РасходыПоСделкеОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РасходыПоСделкеОбороты.СуммаОборот КАК СуммаОборот
		|ПОМЕСТИТЬ _РасходыПоСделкеСЗамещающимиОблигациями
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			,
		|			&КонецПериода,
		|			Запись,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И Валюта = &ВалютаУчета
		|				И Сделка В
		|					(ВЫБРАТЬ
		|						_ТаблицаСделок.Основание
		|					ИЗ
		|						_ТаблицаСделок КАК _ТаблицаСделок
		|					ГДЕ
		|						_ТаблицаСделок.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|						И _ТаблицаСделок.ЦеннаяБумага.ВалютаНоминала <> _ТаблицаСделок.Основание.ВалютаСделки)) КАК РасходыПоСделкеОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Партии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Партии.Период КАК Период
		|ПОМЕСТИТЬ _БумагиПериоды
		|ИЗ
		|	_Партии КАК Партии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БумагиПериоды.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_БумагиПериоды.Период КАК Период,
		|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала
		|ПОМЕСТИТЬ _ПериодыНоминалов
		|ИЗ
		|	_БумагиПериоды КАК _БумагиПериоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО _БумагиПериоды.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _БумагиПериоды.Период > НоминалыЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_БумагиПериоды.ЦеннаяБумага,
		|	_БумагиПериоды.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыНоминалов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПериодыНоминалов.Период КАК Период,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал
		|ПОМЕСТИТЬ _Номиналы
		|ИЗ
		|	_ПериодыНоминалов КАК _ПериодыНоминалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО _ПериодыНоминалов.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _ПериодыНоминалов.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Партии.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦенныеБумагиПредварительно
		|ИЗ
		|	_Партии КАК Партии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумагиПредварительно.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ЦенныеБумагиПредварительно.ЦеннаяБумага.Эмитент, ЗНАЧЕНИЕ(Справочник.Эмитенты.ПустаяСсылка)) КАК Эмитент,
		|	ЕСТЬNULL(_ЦенныеБумагиПредварительно.ЦеннаяБумага.Номинал, 0) КАК Номинал,
		|	ЕСТЬNULL(_ЦенныеБумагиПредварительно.ЦеннаяБумага.ВалютаНоминала, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаНоминала,
		|	ЕСТЬNULL(_ЦенныеБумагиПредварительно.ЦеннаяБумага.Амортизационная, ЛОЖЬ) КАК Амортизационная,
		|	ЕСТЬNULL(_ЦенныеБумагиПредварительно.ЦеннаяБумага.ИндексируемыйНоминал, ЛОЖЬ) КАК ИндексируемыйНоминал,
		|	ЕСТЬNULL(_ЦенныеБумагиПредварительно.ЦеннаяБумага.ДатаПогашения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПогашения,
		|	ТИПЗНАЧЕНИЯ(_ЦенныеБумагиПредварительно.ЦеннаяБумага) = ТИП(Справочник.Акции) КАК ЭтоАкция,
		|	ТИПЗНАЧЕНИЯ(_ЦенныеБумагиПредварительно.ЦеннаяБумага) = ТИП(Справочник.Облигации) КАК ЭтоОблигация,
		|	ТИПЗНАЧЕНИЯ(_ЦенныеБумагиПредварительно.ЦеннаяБумага) = ТИП(Справочник.Паи) КАК ЭтоПай,
		|	ТИПЗНАЧЕНИЯ(_ЦенныеБумагиПредварительно.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия) КАК ЭтоИСУ
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ЦенныеБумагиПредварительно КАК _ЦенныеБумагиПредварительно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партии.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	Партии.Рынок КАК Рынок,
		|	Партии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Партии.Партия КАК Партия,
		|	ВЫРАЗИТЬ(Партии.Партия КАК Документ.СделкаРЕПО).ПерваяЧастьРЕПО КАК Партия_ПерваяЧастьРЕПО,
		|	Партии.СтрокаПартии КАК СтрокаПартии,
		|	Партии.Количество КАК Количество,
		|	Партии.СтоимостьПокупки КАК СтоимостьПокупки,
		|	Партии.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	Партии.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	Партии.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	Партии.РасходыПриПокупкеВСтоимостиВВалютеУчета КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	Партии.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	Партии.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	Партии.Стоимость КАК Стоимость,
		|	Партии.СтоимостьКупона КАК СтоимостьКупона,
		|	Партии.Переоценка КАК Переоценка,
		|	Партии.ПереоценкаКупона КАК ПереоценкаКупона,
		|	Партии.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
		|	Партии.ДисконтПремия КАК ДисконтПремия,
		|	Партии.ДисконтПремияПокупки КАК ДисконтПремияПокупки,
		|	Партии.Период КАК Период,
		|	Партии.Регистратор КАК Регистратор,
		|	Партии.Основание КАК Основание,
		|	Партии.ВалютаСделки КАК ВалютаСделки,
		|	Партии.ВидДвижения КАК ВидДвижения,
		|	Партии.МоментВремени КАК МоментВремени,
		|	Партии.НомерСделки КАК НомерСделки,
		|	_Номиналы.Номинал КАК Номинал,
		|	Партии.КорректировкаЭСП КАК КорректировкаЭСП,
		|	Партии.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	Партии.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	Партии.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	Партии.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	Партии.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	Партии.РазницаПервоначальногоПризнанияСНачалаГода КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	Партии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	Партии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	Партии.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	Партии.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	Партии.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	Партии.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	Партии.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	Партии.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	Партии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	Партии.КурсовыеРазницыСНачалаГода КАК КурсовыеРазницыСНачалаГода,
		|	Партии.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	Партии.СуммаРезервовПодОбесценениеКупона КАК СуммаРезервовПодОбесценениеКупона,
		|	Партии.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
		|	Партии.ИндексацияНоминала КАК ИндексацияНоминала,
		|	Партии.ИндексацияНоминалаСНачалаГода КАК ИндексацияНоминалаСНачалаГода,
		|	Партии.ИндексацияНоминалаЗаВремяВладения КАК ИндексацияНоминалаЗаВремяВладения,
		|	Партии.ДатаПокупки КАК ДатаПокупки,
		|	Партии.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	Партии.ПогашениеКупонаНеИсполненноеВСрок КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	Партии.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	Партии.ПерваяЧастьРЕПО КАК ПерваяЧастьРЕПО,
		|	Партии.ЗадолженностьПоПогашениюКупона КАК ЗадолженностьПоПогашениюКупона,
		|	Партии.ЗадолженностьПоПогашениюКупонаВВалютеУчета КАК ЗадолженностьПоПогашениюКупонаВВалютеУчета,
		|	Партии.ДатаПокупкиНачальная КАК ДатаПокупкиНачальная,
		|	Партии.КорректировкаЭСПНачальная КАК КорректировкаЭСПНачальная,
		|	Партии.СтоимостьПокупкиНачальная КАК СтоимостьПокупкиНачальная,
		|	Партии.ПлановыеДанные КАК ПлановыеДанные,
		|	Партии.ЗадолженностьПоПогашениюТела КАК ЗадолженностьПоПогашениюТела,
		|	Партии.ЗадолженностьПоПогашениюТелаВВалютеУчета КАК ЗадолженностьПоПогашениюТелаВВалютеУчета,
		|	Партии.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	Партии.СуммаНаОднуОблигацию КАК СуммаНаОднуОблигацию,
		|	Партии.ДатаФиксации КАК ДатаФиксации,
		|	Партии.ВидПогашения КАК ВидПогашения,
		|	Партии.Сумма КАК Сумма,
		|	Партии.СуммаКупона КАК СуммаКупона,
		|	Партии.ВидЗадолженности КАК ВидЗадолженности,
		|	Партии.ВалютаОплаты КАК ВалютаОплаты
		|ИЗ
		|	_Партии КАК Партии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Номиналы КАК _Номиналы
		|		ПО Партии.ЦеннаяБумага = _Номиналы.ЦеннаяБумага
		|			И Партии.Период = _Номиналы.Период
		|ГДЕ
		|	Партии.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период"+Порядок+",
		|	ДатаПокупки"+Порядок+",
		|	НомерСделки"+Порядок+",
		|	МоментВремени"+Порядок+",
		|	СтрокаПартии"+Порядок+"
		|ИТОГИ ПО
		|	ЦеннаяБумага";

	#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("ПлановыеДанные", ТаблицаПлановыхОпераций);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);
	Запрос.УстановитьПараметр("ВключатьВводыВыводы", ВключатьВводыВыводы);
	Запрос.УстановитьПараметр("ДатаЕПС", МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ);
	Запрос.УстановитьПараметр("УчитыватьРезервы", НЕ РассчитыватьСтоимости); // резервы считаем только для динамического расчета, ЕПС работает по другому
	Запрос.УстановитьПараметр("РассчитыватьСтоимости", РассчитыватьСтоимости);
	Запрос.УстановитьПараметр("ВалютаУчета", ВалютаУчета);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	РезультатЗапроса = Запрос.Выполнить();

	//--------------------------
	ЭтотОбъект.РассчитанныеПартии.Очистить();
	ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Очистить();
	ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Очистить();
	ЭтотОбъект.КонечныеОстаткиПартий.Очистить();
	
	Если НЕ РассчитыватьСтоимости Тогда
		ЭтотОбъект.КонечныеОстаткиПартий.Загрузить(Запрос.МенеджерВременныхТаблиц.Таблицы["_ОстаткиБезДвижений"].ПолучитьДанные().Выгрузить());
	КонецЕсли;
	
	ПустаяТаблица = ЭтотОбъект.РассчитанныеПартии.ВыгрузитьКолонки();
	
	//--------------------------
	ТаблицаЦенныеБумаги = Запрос.МенеджерВременныхТаблиц.Таблицы["_ЦенныеБумаги"].ПолучитьДанные().Выгрузить();
	ТаблицаРасходыПоСделкеСЗамещающимиОблигациями = Запрос.МенеджерВременныхТаблиц.Таблицы["_РасходыПоСделкеСЗамещающимиОблигациями"].ПолучитьДанные().Выгрузить();
	
	//--------------------------
	// #416666 - для настройки УчитыватьУчетныйАктивПриСписанииПартий
	// учетный актив ЕПС выше ФИФО(или ЛИФО) - сначала спишем по ФИФО(или ЛИФО) бумаги по СС и только после перейдем к АС
	ПорядокЕПС = Новый Соответствие;
	
	ПорядокЕПС.Вставить(Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой, 1);
	ПорядокЕПС.Вставить(Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи, 2);
	ПорядокЕПС.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток, 3);
	ПорядокЕПС.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи, 4);
	ПорядокЕПС.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения, 5);
	ПорядокЕПС.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД, 6);
	
	//--------------------------
	//получим распределения активов
	РаспределенияПоСделкам = БухгалтерскийУчетЕПС.ПолучитьРаспределениеПоВидуАктива(Запрос.МенеджерВременныхТаблиц.Таблицы["_ТаблицаСделок"].ПолучитьДанные().Выгрузить());
	РаспределенияПоСделкам.Индексы.Добавить("Сделка, ЦеннаяБумага"); 

	//--------------------------
	РассчитанныеПартииКПоступлениюДляСписания = РассчитанныеПартииКПоступлению.Выгрузить();

	//--------------------------
	// #387189
	// 0. Расчет партий при расчете для целей ИД всегда считает только количество (ЭтотОбъект.ВариантРасчета = Перечисления.ВариантыРасчетаПартий.РасчетТолькоКоличества)
	// 1. Расчет партий при расчете для целей СЧА для бумаг по АС должен рассчитывать суммы, для бумаг по СС продолжаем считать только количество (ЭтотОбъект.ВариантРасчета = Перечисления.ВариантыРасчетаПартий.РасчетКоличестваДляБумагПоАССуммы)
	// 2. Расчет партий при расчете для целей ЕПС всегда считает всё (ЭтотОбъект.ВариантРасчета = Перечисления.ВариантыРасчетаПартий.ПолныйРасчет)
	// добавляем переменную для сохранения параметра РассчитыватьСтоимости - _Сохранение_РассчитыватьСтоимости:
	// 		внутри цикла по ценным бумагам перед начала цикла по операциям будем устанавливать РассчитыватьСтоимости = _Сохранение_РассчитыватьСтоимости
	//			внутри цикла по операциям если ВариантРасчета=РасчетКоличестваДляБумагПоАССуммы, то как только в таблицу приходных партий добавится строка у которой ВключатьРасходыПоПокупкеВСтоимость то мы сразу сделаем: РассчитыватьСтоимости = Истина
	_Сохранение_РассчитыватьСтоимости = РассчитыватьСтоимости;
	
	//--------------------------
	ПереоценкиПередВыводами = Неопределено;
	ПереоценкиДляОпераций = Неопределено;
	
	Если РассчитыватьСтоимости И НЕ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316 Тогда 	// для динамического расчета нет смысла рассчитывать т.к. преоценка его не интересует, 
																							// для клиентов с послаблением тоже т.к. послабление приводит к тому, что цена актива не меняется (либо всегда по цене на 18.02.22, либо всегда по цене покупки)
																							// а раз цена не меняется, то сумма переоценки определяется легко: это сумма начисления дисконта/приемии и корректировки ЭСП, взятые с обратным знаком
																							// т.е. сколько процентных доходов начислим столько переоценки и спишем (и наоборот) чтобы общая цена актива не менялась
	
		Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом ИЛИ НастройкиПоВидуУчета.НачислятьПроцентныеДоходыПоВыводимымАктивам Тогда
			ПереоценкиПередВыводами = ПолучитьПереоценкиПередВыводами(Справочники.ЦелиРасчета.ЕдиныйПланСчетов); 
		КонецЕсли;
		
		Если НастройкиПоВидуУчета.ПереоцениватьПриобретенныеАктивы ИЛИ НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей Тогда
			ПереоценкиДляОпераций = ПолучитьПереоценкиДляОпераций(НастройкиПоВидуУчета.ПереоцениватьПриобретенныеАктивы, НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей, НастройкиПоВидуУчета.УчитыватьПогрешностьОкругленияПриПродаже); 
		КонецЕсли;
		
	КонецЕсли;
	
	//--------------------------
	ДанныеРеклассификаций = Документы.РеклассификацияАктивовЕПС.ПолучитьДанныеРеклассификаций(НачалоДня(ЭтотОбъект.НачалоПериода), КонецДня(ЭтотОбъект.КонецПериода), ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	//--------------------------
	КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.КонецПериода);
	
	ЭтоКлиентБудущее	= (КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_БУДУЩЕЕ"));
	ЭтоКлиентТелеком	= (КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ТелекомСоюз"));
	ЭтоКлиентСНГ		= (КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФ_СНГ"));
	ЭтоКлиентЮгория		= (КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ГСКЮгория"));
	ЭтоКлиентСАФМАР		= (КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"));
	ЭтоКлиентЭволюция	= (КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция"));
	
	ЭтоКлиентГруппыБудущее = БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(КлиентДоверительногоУправления, ЭтотОбъект.КонецПериода);
	
	//--------------------------
	КлиентыУчитывающиеВсеЧастиСтоимостиПоФиксированномуКурсу = Новый Массив;
	КлиентыУчитывающиеВсеЧастиСтоимостиПоФиксированномуКурсу.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Большой"));
	КлиентыУчитывающиеВсеЧастиСтоимостиПоФиксированномуКурсу.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"));
	
	УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу = (КлиентыУчитывающиеВсеЧастиСтоимостиПоФиксированномуКурсу.Найти(КлиентДоверительногоУправления) <> Неопределено);
	
	//--------------------------
	НастройкиДляУчетаКорректировкиЭСП = Новый Массив;
	НастройкиДляУчетаКорректировкиЭСП.Добавить(Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке);
	НастройкиДляУчетаКорректировкиЭСП.Добавить(Перечисления.ВариантыУчетаПроцентныхДоходов.ВЗависимостиОтКритерияСущественности);
	
	//--------------------------
	// В связи с переделкой отражения партий при погашении на "как надо" обнаружилась следующая ситуация:
	// 		если у клиента стоит настройка УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу
	//		и бумага в этот день только погашается (оплата и списание позднее, в следующие дни)
	//		то в этот день необходимо списать всю переоценку, чтобы облигация вышла на номинал 
	//		остальные части стоимости (дисконт-премию-корректировку) погашение выводти на номинал по дефолту
	//		вообще, конечно, переоценку мог бы списать в конце дня документ переоценка
	//		но! у клиента может быть и ежемесячная переоценка (ДБ, например) и переоценки в это день просто не будет
	//		поэтому, сделал списание переоценки непосредственно в погашении
	//		а запрос позволяет вычислить эти погашения, по которым ни оплаты ни списания в этот день не прошло
	Если НастройкиУчетаОбщие.УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу Тогда
		#Область ПогашенияНесписанныеИНеоплаченныеВТотЖеДень
		
		ЗапросПогашения = Новый Запрос();
		ЗапросПогашения.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.Период КАК Период,
			|	ПогашениеЦеннойБумаги.Ссылка КАК Ссылка
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			День,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидБлокировкиАктива = ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение)
			|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
			|				&НачалоПериода,
			|				&ОкончаниеПериода,
			|				День,
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
			|			ПО ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание = ПогашениеЦеннойБумаги.Ссылка
			|		ПО (ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.Период)
			|			И (ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.ЦеннаяБумага = ПогашениеЦеннойБумаги.ЦеннаяБумага)
			|ГДЕ
			|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.КоличествоРасход = 0
			|	И ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.КоличествоКонечныйОстаток > 0
			|	И ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход = 0
			|	И ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток > 0";
		
		ЗапросПогашения.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
		ЗапросПогашения.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
		ЗапросПогашения.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		ЗапросПогашения.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
		
		#КонецОбласти
		
		ПогашенияНесписанныеИНеоплаченныеВТотЖеДень = ЗапросПогашения.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		// Если настройки не стоит, то нам не нужно списывать переоценку при погашении - просто пустой масси погашений
		ПогашенияНесписанныеИНеоплаченныеВТотЖеДень = Новый Массив();
	КонецЕсли;
	
	//--------------------------
	// хардкод для банкротов Открытие, Арчер и Финстойн
	// с 31.10.2022 не переоцениваем ничего
	БанкротствоФинстоунаИАрчераПризнано = (НачалоДня(ЭтотОбъект.КонецПериода) >= '20221031'); // все признали банкротство финстоуна и арчера с 31.10.22
	БанкротствоОткрытияПризнано = (НачалоДня(ЭтотОбъект.КонецПериода) >= '20221117' ИЛИ НачалоДня(ЭтотОбъект.КонецПериода) >= '20221031' И НЕ ЭтоКлиентСАФМАР); // все признали банкротство открытия с 31.10.22, а ДБ с 17.11.22
	
	//--------------------------
	ИзмененияКурсовВалют = ПолучитьИзмененияКурсовВалют(); // чтобы не проводить перекурсовку в те дни, когда курс валютый не менялся - дело в том, что перекурсовка может принять погрешности за перекурсовку
	//--------------------------
	ПереоцениваемыеГруппыАктивов = Новый Массив;
	ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток);
	ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи);
	ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой);
	ПереоцениваемыеГруппыАктивов.Добавить(Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи);
	
	//--------------------------
	РешенияКлиентовПоЗначениямЭСП = Неопределено;
	Если ЭтотОбъект.ВариантРасчета <> Перечисления.ВариантыРасчетаПартий.РасчетТолькоКоличества Тогда
		РешенияКлиентовПоЗначениямЭСП = ПолучитьРешенияКлиентовПоЗначениямЭСП();
		
		ПараметрыОценки = Новый Структура;
		ПараметрыОценки.Вставить("Клиент", 								КлиентДоверительногоУправления);
		ПараметрыОценки.Вставить("Организация",			 				ЭтотОбъект.Организация);
		ПараметрыОценки.Вставить("СчетДоверительногоУправления",		ЭтотОбъект.СчетДоверительногоУправления);
		ПараметрыОценки.Вставить("ЦельРасчета", 						Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
		
		НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(ЭтотОбъект.КонецПериода, ПараметрыОценки.Организация, ПараметрыОценки.СчетДоверительногоУправления, ПараметрыОценки.ЦельРасчета);
		ПараметрыОценки.Вставить("ВариантРасчетаОценочнойСтоимости" ,	НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости);
		
	КонецЕсли;
	
	//--------------------------
	ЦенныеБумагиЯвляющиесяДефолтнымиПоМнениюКлиента = БухгалтерскийУчетЕПС.ПолучитьЦенныеБумагиЯвляющиесяДефолтнымиПоМнениюКлиента(ЭтотОбъект.КонецПериода, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	ЦенныеБумагиОцениваемыеПоФиксированномуКурсу = ПолучитьЦенныеБумагиОцениваемыеПоФиксированномуКурсу(ЭтотОбъект.КонецПериода, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	//--------------------------
	ТипЧислаЦена = Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип.КвалификаторыЧисла;	
	РазрядностьДробнойЧасти = ТипЧислаЦена.РазрядностьДробнойЧасти;
	
	//--------------------------
	КолонкиРассчитанныеПартии = ЗаполнитьКолонкиРассчитанныеПартии();

	
	// если клиент ведет учет по стандарту МСФО9 и начисляет резервы ежедневно
	// то при выводе бумаг (возможно, что и при продаже, но это не точно) нужно начислить резервы по выводимым активам
	// для этого мы будем собирать все движения по выводу АСных бумаг, затем скопом посчитаем какой должен быть по ним резерв и откорректируем движения 
	// нам придется хранить приходные движения перед выводом и расходные движения вывода
	СчитаемРезервыПередВыводом = Ложь;
	Если НастройкиУчетаОбщие.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = Перечисления.СтандартыФинансовойОтчетности.МСФО9
		И НастройкиУчетаОбщие.ПериодичностьНачисленияРезервов = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
	
		СчитаемРезервыПередВыводом = Истина;
		
		МассивДвиженийРезервов = Новый Массив();
	
	КонецЕсли;
	
	//--------------------------
	//--------------------------
	ВыборкаЦеннаяБумага = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаЦеннаяБумага.Следующий() Цикл
		
		РассчитыватьСтоимости = _Сохранение_РассчитыватьСтоимости;
		
		ДанныеПоЦеннойБумаге = Новый Структура("ЦеннаяБумага,Эмитент,Номинал,ВалютаНоминала,Амортизационная,ИндексируемыйНоминал,ДатаПогашения,ЭтоАкция,ЭтоОблигация,ЭтоПай,ЭтоИСУ");
		
		СтрокиЦенныеБумаги = ТаблицаЦенныеБумаги.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаЦеннаяБумага.ЦеннаяБумага));
		Если СтрокиЦенныеБумаги.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ДанныеПоЦеннойБумаге, СтрокиЦенныеБумаги[0]);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проблема: по ценной бумаге " + Строка(ВыборкаЦеннаяБумага.ЦеннаяБумага) + " отсутствуют данные",,,, Отказ);
			Возврат;
		КонецЕсли;	
		
		Если ДанныеПоЦеннойБумаге.ЭтоОблигация
			И (ДанныеПоЦеннойБумаге.ДатаПогашения <> '00010101' И ДанныеПоЦеннойБумаге.ДатаПогашения < НачалоДня(ЭтотОбъект.НачалоПериода)
				ИЛИ ДанныеПоЦеннойБумаге.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Прайм")
				ИЛИ ЦенныеБумагиЯвляющиесяДефолтнымиПоМнениюКлиента.Найти(ВыборкаЦеннаяБумага.ЦеннаяБумага) <> Неопределено
				ИЛИ ВыборкаЦеннаяБумага.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстоун") И БанкротствоФинстоунаИАрчераПризнано
				ИЛИ ВыборкаЦеннаяБумага.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс") И БанкротствоФинстоунаИАрчераПризнано
				ИЛИ ВыборкаЦеннаяБумага.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг") И БанкротствоОткрытияПризнано
				ИЛИ ВыборкаЦеннаяБумага.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрХолдинг_004") И БанкротствоОткрытияПризнано) Тогда
			
			ДанныеПоЦеннойБумаге.Вставить("ЭтоДефолтнаяОблигация", ИСТИНА);
		Иначе
			ДанныеПоЦеннойБумаге.Вставить("ЭтоДефолтнаяОблигация", ЛОЖЬ);
		КонецЕсли;
		
		ДанныеПоЦеннойБумаге.Вставить("ПроводилиНачислениеПоЭтойОблигацияСРеструктуризациейПлатежей", ЛОЖЬ);
		
		ДанныеПоЦеннойБумаге.Вставить("ЭтоВалютнаяБумага", ДанныеПоЦеннойБумаге.ВалютаНоминала <> ВалютаУчета);
		
		ДанныеПоЦеннойБумаге.Вставить("ФиксированныйКурсПереоценки", 0);
		Если ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага И ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
			НайденныеСтроки = ЦенныеБумагиОцениваемыеПоФиксированномуКурсу.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаЦеннаяБумага.ЦеннаяБумага));
			Если НайденныеСтроки.Количество() > 0 Тогда
				ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки = НайденныеСтроки[0].КурсВалютыНоминала;
			КонецЕсли;
		КонецЕсли;
		
		
		ПриходныеПартии = ПустаяТаблица.СкопироватьКолонки();
		
		// #404807 - для того, что бы в случае повышенной точности брать данные из первички
		ПриходныеПартии.Колонки.Добавить("ВключатьРасходыПоПокупкеВСтоимость", Новый ОписаниеТипов("Булево"));
		
		// #416666 - настройка УчитыватьУчетныйАктивПриСписанииПартий
		Если НастройкиУчетаОбщие.УчитыватьУчетныйАктивПриСписанииПартий Тогда
			ПриходныеПартии.Колонки.Добавить("ПорядокЕПС", Новый ОписаниеТипов("Число"));
		КонецЕсли;
		
		// эта штука нужна нам для того случая если:
		// 1. Частичное погашение и погашение купона в один день
		// 2. Частичное погашение по времени раньше
		// 3. Были партии с дисконтом
		// и частичное погашение списывает часть дисконта, а погашению его начислять надо
		СписанияДисконтов = Новый ТаблицаЗначений;
		
		СписанияДисконтов.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
		СписанияДисконтов.Колонки.Добавить("Партия", Метаданные.ОпределяемыеТипы.Партия.Тип);
		СписанияДисконтов.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		// конец этой штуки
		
		// У нас есть расхожения в копейках с учетом у СНГ
		// дело в том, что они начисляют купоны - дисконты - премии УТРОМ, а мы при продаже
		// на этом постоянно вылезают копейки
		// Поэтому, принят следующий алгоритм:
		// 1. При первой продаже по партии мы будем полностью начислять по ней дисконт/премию на все количество
		// 2. Дальнейшие списания будут уже плясать от полной суммы
		// 3. По остальным партиям дисконт премия будет начислен вечерней переоценкой
		// 4. Небольшой нюанс - по тем партиям, что продавали в течении дня дисконт/премия вечером начисляться не будет - дабы не выравнивать дисконт/премию что запрещено СНГ
		ПартииПоКоторымНачисленыДисконтПремия = Новый ТаблицаЗначений;
		
		ПартииПоКоторымНачисленыДисконтПремия.Колонки.Добавить("Партия", Метаданные.ОпределяемыеТипы.Партия.Тип);
		ПартииПоКоторымНачисленыДисконтПремия.Колонки.Добавить("СтрокаПартии", Новый ОписаниеТипов("Число"));
		
		ДатаОпераций = Неопределено;
		БылоПогашениеКупонаПоБумагеВЭтомПериоде = Ложь;
		
		ВыборкаДетальныеЗаписи = ВыборкаЦеннаяБумага.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
				РассчитыватьСтоимости = _Сохранение_РассчитыватьСтоимости;
			КонецЕсли;	
			
			Если ДатаОпераций <> НачалоДня(ВыборкаДетальныеЗаписи.Период) Тогда // произошла смена дня при расчете партий
				
				ПартииПоКоторымНачисленыДисконтПремия.Очистить();
				ДатаОпераций = НачалоДня(ВыборкаДетальныеЗаписи.Период);
				БылоПогашениеКупонаПоБумагеВЭтомПериоде = Ложь;
				
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда
				Если ВыборкаДетальныеЗаписи.Регистратор = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("На начало %1 обнаружено нулевое количество ЦБ %2 по партии %3, строка %4", Формат(ЭтотОбъект.НачалоПериода, "ДФ=dd.MM.yyyy"), ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Партия, ВыборкаДетальныеЗаписи.СтрокаПартии), ВыборкаДетальныеЗаписи.Партия);
				КонецЕсли;
				Если НЕ РассчитыватьСтоимости Тогда
					Продолжить; // при динамическом расчете интересуют только изменения количества 
				КонецЕсли;
			КонецЕсли;			
			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда// ОНО О_О - начинаем тянуть корректировки в расчет 

				Если ВыборкаДетальныеЗаписи.Период > '20990601' Тогда // тянем строго с определенной даты, более ранние корректировки захардкожены и можно поломать, проводя за прошлые числа
				
					СтрокиПриходныхПартий = ПриходныеПартии.НайтиСтроки(Новый Структура("ЦеннаяБумага,Партия,СтрокаПартии,УчетныйАктивЕПС", 
																							ВыборкаДетальныеЗаписи.ЦеннаяБумага, 
																							ВыборкаДетальныеЗаписи.Партия, 
																							ВыборкаДетальныеЗаписи.СтрокаПартии,
																							ВыборкаДетальныеЗаписи.УчетныйАктивЕПС));
					Если СтрокиПриходныхПартий.Количество() <> 1 Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильно заведена ручная корректировка: " + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " по бумаге " + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага), ВыборкаДетальныеЗаписи.Регистратор);
						Отказ = Истина;
						Продолжить;
					Иначе
						СтрокаПриходныхПартий = СтрокиПриходныхПартий[0];
					КонецЕсли;
					
					Если СтрокаПриходныхПартий.Количество <= 0 Тогда // нельзя коректировать нулевую партию
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильно заведена ручная корректировка: " + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " по бумаге " + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " корректируется партия с нулевым количеством", ВыборкаДетальныеЗаписи.Регистратор);
						Отказ = Истина;
						Продолжить;
					ИначеЕсли ВыборкаДетальныеЗаписи.Количество <> 0 Тогда // нельзя коректировать количество
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильно заведена ручная корректировка: " + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " по бумаге " + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " нельзя изменять количество корректировкой", ВыборкаДетальныеЗаписи.Регистратор);
						Отказ = Истина;
						Продолжить;
					КонецЕсли;
					
					// Суть: корректировка добавляет записи в РассчитанныеПартии, но они не будут записываться 
					// и еще она должна изменять ПриходныеПартии
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи);
					
					ЗнакДвижения = ?(ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Приход, 1, -1);
					
					ДанныеДляЗанесения = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
					Для каждого СуммовоеПоле Из ДанныеДляЗанесения Цикл
						
						ИмяПоля = СуммовоеПоле.Ключ;
						СтрокаПриходныхПартий[ИмяПоля] = СтрокаПриходныхПартий[ИмяПоля] + ЗнакДвижения * НовоеДвижение[ИмяПоля];
					
					КонецЦикла;
				
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.КонвертацияЦенныхБумаг") И ВыборкаДетальныеЗаписи.Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
				Если ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
					
					ДанныеСС = ПолучитьДанныеССдляЦБ(ВыборкаДетальныеЗаписи.Рынок, ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Количество, НачалоДня(ВыборкаДетальныеЗаписи.Период));
					
					КоличествоВсего = ВыборкаДетальныеЗаписи.Количество;
					СуммаРынокВсего = ДанныеСС.СуммаРынок;
					СуммаРынокВВалютеУчетаВсего = ДанныеСС.СуммаРынокВВалютеУчета;
					
					Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
					    // переоцениим по СС
						НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
						//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;						
						
						ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, ВыборкаДетальныеЗаписи, "Регистратор,Период,Рынок");
						ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, СтрокаПриходныхПартий, "УчетныйАктивЕПС,ЦеннаяБумага,Партия,СтрокаПартии");
						
						НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						СуммаБаланс = СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка;
						СуммаБалансВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета;
						
						СуммаРынок = СуммаРынокВсего / КоличествоВсего * СтрокаПриходныхПартий.Количество;
						СуммаРынокВВалютеУчета = СуммаРынокВВалютеУчетаВсего / КоличествоВсего * СтрокаПриходныхПартий.Количество;
						
						СуммаРынокВсего = СуммаРынокВсего - СуммаРынок;
						СуммаРынокВВалютеУчета = СуммаРынокВВалютеУчета - СуммаРынок;
						
						КоличествоВсего = КоличествоВсего - СтрокаПриходныхПартий.Количество;
						
						НовоеДвижениеПереоценки.Переоценка = СуммаРынок - СуммаБаланс; 
						НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СуммаРынокВВалютеУчета - СуммаБалансВВалютеУчета; 
						НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
						Если НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета > 0 Тогда
							НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
						КонецЕсли;
						
						СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка + НовоеДвижениеПереоценки.Переоценка;
						СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
						СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода + НовоеДвижениеПереоценки.ПереоценкаСНачалаГода;
						СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная + НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная;
						
						// спишем
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
						ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи, "Регистратор,Период,Рынок");
						
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
					КонецЦикла;
					
					ПриходныеПартии.Очистить(); // все, финита
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
					
					ДанныеСС = ПолучитьДанныеССдляЦБ(ВыборкаДетальныеЗаписи.Рынок, ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Количество, НачалоДня(ВыборкаДетальныеЗаписи.Период));
					
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ЗачислениеПартии;
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи, "Регистратор,Период,Рынок,ЦеннаяБумага,Количество");
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижение.УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ВыборкаДетальныеЗаписи.Период, ВыборкаДетальныеЗаписи.Рынок, ВыборкаДетальныеЗаписи.ЦеннаяБумага, СчетДоверительногоУправленияДляУчета);
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = 1;
					НовоеДвижение.Партия = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижение.СтрокаПартии = 1;
					
					НовоеДвижение.СтоимостьПокупки = ДанныеСС.СуммаРынок;
					
					НовоеДвижение.Стоимость = ДанныеСС.СуммаРынок;
					НовоеДвижение.СтоимостьВВалютеУчета = ДанныеСС.СуммаРынокВВалютеУчета;
					
				КонецЕсли;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
				
				ЭтоОбратноеРЕПО = Ложь;
				ЭтоЗакрытиеПрямогоРЕПО = Ложь;
				
				Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
					Если ВыборкаДетальныеЗаписи.ЧастьСделкиРЕПО = 1 Тогда
						ЭтоОбратноеРЕПО = Истина;
				    ИначеЕсли ВыборкаДетальныеЗаписи.ЧастьСделкиРЕПО = 2 Тогда
						ЭтоЗакрытиеПрямогоРЕПО = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если ЭтоЗакрытиеПрямогоРЕПО Тогда // возвращаем на баланс партии
					
					ПартииПроданныеВРЕПОКУдалению = Новый Массив;
					
					ПартииПроданныеВРЕПОПоСделке = ПартииПроданныеВРЕПО.НайтиСтроки(Новый Структура("ПродажаРЕПО,СтрокаПродажиРЕПО", ВыборкаДетальныеЗаписи.ПерваяЧастьРЕПО, ВыборкаДетальныеЗаписи.СтрокаПартии));
					
					Для Каждого СтрокаПартииПроданныеВРЕПОПоСделке Из ПартииПроданныеВРЕПОПоСделке Цикл
						
						// запомним, что удалить надо из репошных 
						ПартииПроданныеВРЕПОКУдалению.Добавить(СтрокаПартииПроданныеВРЕПОПоСделке);
						
						// пришла партия
						Если СтрокаПартииПроданныеВРЕПОПоСделке.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО Тогда
							ПриходнаяПартия = ПартииКупленныеПоРЕПО.Добавить();
						Иначе	
							ПриходнаяПартия = ПриходныеПартии.Добавить();
							ПриходнаяПартия.НомерСтроки = ПриходныеПартии.Количество();
							ПриходнаяПартия.Регистратор = ВыборкаДетальныеЗаписи.Партия;
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(ПриходнаяПартия, СтрокаПартииПроданныеВРЕПОПоСделке);
						
						// движение по партиям приход сделать
						Если СтрокаПартииПроданныеВРЕПОПоСделке.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО Тогда
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Добавить();
						Иначе 
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
						КонецЕсли;	
						ЗаполнитьЗначенияСвойств(НовоеДвижение, ПриходнаяПартия);
						
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии;
						
						// движение по партиям РЕПО расход сделать
						НовоеДвижениеРЕПО = РассчитанныеПартииПрямоеРЕПО.Добавить();
						ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО,СтрокаПартииПроданныеВРЕПОПоСделке);
						НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Партия;
						
						НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижениеРЕПО.СтрокаКорзиныЦенныхБумаг = СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии;
						
					КонецЦикла;
					
					ПриходныеПартии.Сортировать("Период"); // отсортировать обязательно		
					
					// удалим партии РЕПО
					Для каждого СтрокаПартииПроданныеВРЕПОКУдалению Из ПартииПроданныеВРЕПОКУдалению Цикл
						ПартииПроданныеВРЕПО.Удалить(СтрокаПартииПроданныеВРЕПОКУдалению);
					КонецЦикла;
					
				ИначеЕсли ЭтоОбратноеРЕПО И НастройкиПоВидуУчета.УчитыватьПартииРЕПООтдельно Тогда // приходуем в РЕПОшные партии
					
					ПриходнаяПартияРЕПО = ПартииКупленныеПоРЕПО.Добавить();
					
					ЗаполнитьЗначенияСвойств(ПриходнаяПартияРЕПО, ВыборкаДетальныеЗаписи);
					
					Если РассчитыватьСтоимости Тогда
					
						ВалютаСделки = ВыборкаДетальныеЗаписи.ВалютаСделки;
						ПриходнаяПартияРЕПО.Стоимость = РаботаСВалютами.ПересчетСуммыВВалюте(ВыборкаДетальныеЗаписи.СтоимостьПокупки, ВалютаСделки, ВыборкаДетальныеЗаписи.Период, ДанныеПоЦеннойБумаге.ВалютаНоминала, ВыборкаДетальныеЗаписи.Период, Отказ);
						ПриходнаяПартияРЕПО.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СтоимостьПокупки, ВалютаСделки, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
						ПриходнаяПартияРЕПО.СтоимостьКупона = РаботаСВалютами.ПересчетСуммыВВалюте(ВыборкаДетальныеЗаписи.СтоимостьПокупкиКупона, ВалютаСделки, ВыборкаДетальныеЗаписи.Период, ДанныеПоЦеннойБумаге.ВалютаНоминала, ВыборкаДетальныеЗаписи.Период, Отказ);
						ПриходнаяПартияРЕПО.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СтоимостьПокупкиКупона, ВалютаСделки, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
						
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
					КонецЕсли; 
					
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи);
					
					НовоеДвижение.Стоимость = ПриходнаяПартияРЕПО.Стоимость;
					НовоеДвижение.СтоимостьВВалютеУчета = ПриходнаяПартияРЕПО.СтоимостьВВалютеУчета;
					НовоеДвижение.СтоимостьКупона = ПриходнаяПартияРЕПО.СтоимостьКупона;
					НовоеДвижение.СтоимостьКупонаВВалютеУчета = ПриходнаяПартияРЕПО.СтоимостьКупонаВВалютеУчета;
					
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
					
				Иначе
					
					ПартииДляРаспределения = Новый Массив;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Сделка") //по этим документам неясен учетный актив ЕПС
						 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО")
						 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
						 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
						 
						ТекСделка = ВыборкаДетальныеЗаписи.Регистратор; 
						Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
						 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
							ТекСделка = ВыборкаДетальныеЗаписи.Основание;
						КонецЕсли;
						
						КоличествоРаспределить = ВыборкаДетальныеЗаписи.Количество;
						РаспределенияПоТекущейСделкеИБумаге = РаспределенияПоСделкам.НайтиСтроки(Новый Структура("Сделка, ЦеннаяБумага", ТекСделка, ВыборкаДетальныеЗаписи.ЦеннаяБумага));
						Для Каждого СтрокаРаспределенияПоСделкам Из РаспределенияПоТекущейСделкеИБумаге Цикл
							Если СтрокаРаспределенияПоСделкам.Количество = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							СтрокаПартииДляРаспределения = Новый Структура(КолонкиРассчитанныеПартии);
														
							ЗаполнитьЗначенияСвойств(СтрокаПартииДляРаспределения, ВыборкаДетальныеЗаписи);
							
							СтрокаПартииДляРаспределения.УчетныйАктивЕПС = СтрокаРаспределенияПоСделкам.УчетныйАктивЕПС;
							СтрокаПартииДляРаспределения.Количество = МИН(СтрокаРаспределенияПоСделкам.Количество, КоличествоРаспределить);
							
							СтрокаРаспределенияПоСделкам.Количество = СтрокаРаспределенияПоСделкам.Количество - СтрокаПартииДляРаспределения.Количество;
							
							КоличествоРаспределить = КоличествоРаспределить - СтрокаПартииДляРаспределения.Количество;
							ПартииДляРаспределения.Добавить(СтрокаПартииДляРаспределения);
							Если КоличествоРаспределить = 0 Тогда
								Прервать;
							КонецЕсли; 
							
						КонецЦикла;
						 
						КоличествоРаспределить = ВыборкаДетальныеЗаписи.Количество;
						 
						ДанныеДляРаспределения = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
						ЗаполнитьЗначенияСвойств(ДанныеДляРаспределения, ВыборкаДетальныеЗаписи);
						
						ДатаКурса = ВыборкаДетальныеЗаписи.Период;
						// для валютной бумаги, если есть настройка, что берем курс датой сделки и наша партия не сделка, то дату курса ставим датой сделки
						Если ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага
							И НастройкиПоВидуУчета.ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости = Перечисления.ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости.НаДатуСделки
							И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.Сделка")
							И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.СделкаРЕПО") Тогда
							
							ДатаКурса = ТекСделка.Дата;
						
						КонецЕсли;
						
						// если мы при:
						// 1. Расчете СЧА - "НЕ РассчитыватьСтоимости" 
						// 2. Взяли бумагу по АС  - "СтрокаПартииДляРаспределения.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость"
						// 3. Причем, это валютная бумага - "ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага"
						// 4. А сделка была не в валюте номинала
						// то нужно ПересчитатьДанныеСделкиВВалютуНоминала()
						Если Не РассчитыватьСтоимости
							И СтрокаПартииДляРаспределения.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
							И ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага
							И ВыборкаДетальныеЗаписи.ВалютаСделки <> ДанныеПоЦеннойБумаге.ВалютаНоминала
							Тогда
							
							ПересчитатьДанныеСделкиВВалютуНоминала(ДатаКурса, ДанныеДляРаспределения, ВыборкаДетальныеЗаписи, ДанныеПоЦеннойБумаге.ВалютаНоминала, ТаблицаРасходыПоСделкеСЗамещающимиОблигациями, ВалютаУчета, Отказ);
							
						КонецЕсли;
						
						Если РассчитыватьСтоимости Тогда
						
							ЗаполнитьПоляВВалютеУчета(ДатаКурса, ДанныеДляРаспределения, ВыборкаДетальныеЗаписи, ДанныеПоЦеннойБумаге.ВалютаНоминала, ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки, ТаблицаРасходыПоСделкеСЗамещающимиОблигациями, ВалютаУчета, Отказ);
							
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
							
							Для каждого СтрокаПартииДляРаспределения Из ПартииДляРаспределения Цикл
								Для каждого СуммовоеПоле Из ДанныеДляРаспределения Цикл
									ИмяПоля = СуммовоеПоле.Ключ;
									СуммаКРаспределению = СуммовоеПоле.Значение;
									Сумма = СуммаКРаспределению / КоличествоРаспределить * СтрокаПартииДляРаспределения.Количество;
									СтрокаПартииДляРаспределения[ИмяПоля] = Сумма;
									ДанныеДляРаспределения[ИмяПоля] = СуммаКРаспределению - Сумма;
								КонецЦикла;
								КоличествоРаспределить = КоличествоРаспределить - СтрокаПартииДляРаспределения.Количество;
							 КонецЦикла;
						
						КонецЕсли; 						
						 
					Иначе
						 СтрокаПартииДляРаспределения = Новый Структура(КолонкиРассчитанныеПартии);
						 ЗаполнитьЗначенияСвойств(СтрокаПартииДляРаспределения, ВыборкаДетальныеЗаписи);
						 
						 Если ВыборкаДетальныеЗаписи.Регистратор <> Неопределено			// это НЕ начальные остатки партий
							 И НЕ ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация                // это не дефолтная бумага - у них сильно уж сложно
							 И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда	// курс валюты номинала фиксированный - значит, вводим строго по нему
						 	ЗаполнитьПоляВВалютеУчета(ВыборкаДетальныеЗаписи.Период, СтрокаПартииДляРаспределения, ВыборкаДетальныеЗаписи, ДанныеПоЦеннойБумаге.ВалютаНоминала, ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки, , ВалютаУчета, Отказ);
						 КонецЕсли;
						 
						 Если СтрокаПартииДляРаспределения.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
						 	СтрокаПартииДляРаспределения.УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ВыборкаДетальныеЗаписи.Период, ВыборкаДетальныеЗаписи.Рынок, ВыборкаДетальныеЗаписи.ЦеннаяБумага, СчетДоверительногоУправленияДляУчета);
						 КонецЕсли; 
						 ПартииДляРаспределения.Добавить(СтрокаПартииДляРаспределения);
					КонецЕсли;
					
					ОтсортироватьПриходы = Ложь;
					
					Для Каждого СтрокаПартииДляРаспределения Из ПартииДляРаспределения Цикл
						
						Если ЭтотОбъект.ВариантРасчета = Перечисления.ВариантыРасчетаПартий.РасчетКоличестваДляБумагПоАССуммы И НЕ РассчитыватьСтоимости // ведем расчет для целей СЧА и не считаем стоимости
							И СтрокаПартииДляРаспределения.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда	// но вот возникла партия по АС
							
							РассчитыватьСтоимости = Истина; // и вот мы уже считаем стоимости!
							
						КонецЕсли;
						
						НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
							НастройкиУчетаОбщие,
							ВыборкаДетальныеЗаписи.ЦеннаяБумага,
							СтрокаПартииДляРаспределения.УчетныйАктивЕПС,
							СтрокаПартииДляРаспределения.Партия,
							СтрокаПартииДляРаспределения.СтрокаПартии);
						
						ПриходнаяПартия = ПриходныеПартии.Добавить();
						
						ЗаполнитьЗначенияСвойств(ПриходнаяПартия, СтрокаПартииДляРаспределения);
						ПриходнаяПартия.ВключатьРасходыПоПокупкеВСтоимость = ПриходнаяПартия.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость;
						
						Если ПриходнаяПартия.ВключатьРасходыПоПокупкеВСтоимость // настроки актива важны,но с 1.1.26 для бумаг по АС могут быть применен критерий
							И НастройкиУчетаОбщие.ПроцентВключенияРасходовВСтоимостьОблигацийПоАС > 0
							И ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета / ПриходнаяПартия.СтоимостьПокупкиВВалютеУчета * 100 < НастройкиУчетаОбщие.ПроцентВключенияРасходовВСтоимостьОблигацийПоАС Тогда
							
							ПриходнаяПартия.ВключатьРасходыПоПокупкеВСтоимость = Ложь;
							
							СтрокаНастроек = РассчитанныеНастройкиДляПартии.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаНастроек, ПриходнаяПартия);
							СтрокаНастроек.Настройка = ПланыВидовХарактеристик.НастройкиУчетаЦенныхБумаг.НеВключатьРасходыВСтоимость;
							
							СтрокаНастроек.ЗначениеНастройки = Истина;
							СтрокаНастроек.Отключить = Ложь;
							
						КонецЕсли;
						
						ПриходнаяПартия.НомерСтроки = ПриходныеПартии.Количество();
						
						Если (СтрокаПартииДляРаспределения.Регистратор <> Неопределено)
							И (ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВводЦенныхБумаг")
								ИЛИ ВыборкаДетальныеЗаписи.Период < МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ) Тогда
								//обработаем стоимости, причем начальные остатки идут "как есть" - не берем их
								//вводы обрабатываем только те, которые были после константы
							
							Если РассчитыватьСтоимости Тогда
							
								ПриходнаяПартия.Стоимость = ПриходнаяПартия.СтоимостьПокупки;
								ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьПокупкиВВалютеУчета;
								
								//тут неверно, нужно собирать и конвертировать расходы отдельно
								//случился прецедент и я переделал - для случая покупки валютной бумаги за рубли (и рублевой комиссии!!)
								//НИЧЕГО пересчитывать не нужно - в РасходыПриПокупкеВСтоимостиВВалютеУчета уже лежит правильная рублевая сумма 
								//сделал для всех ситуации безоговорочно т.к. таких случаев еще НИКОГДА не было
								Если НЕ (ВыборкаДетальныеЗаписи.ВалютаСделки = ВалютаУчета И ДанныеПоЦеннойБумаге.ВалютаНоминала <> ВалютаУчета) Тогда
									ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
										ПриходнаяПартия.РасходыПриПокупкеВСтоимости,
										ДанныеПоЦеннойБумаге.ВалютаНоминала,
										ЭтотОбъект.Организация,
										ПриходнаяПартия.Период);
								КонецЕсли;
								
								Если ПриходнаяПартия.ВключатьРасходыПоПокупкеВСтоимость Тогда 
									Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда // для вводов это чисто информационные ресурсы т.к. в стоимость расходы попали ранее
										ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость + ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
										ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьВВалютеУчета + ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета;
									КонецЕсли;
								Иначе
									ПриходнаяПартия.РасходыПриПокупкеВСтоимости = 0;
									ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
								КонецЕсли;
								
								Если (СтрокаПартииДляРаспределения.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации) 
									ИЛИ (СтрокаПартииДляРаспределения.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя) Тогда
									
									УчитыватьИндексациюНоминала = Ложь;
									Если ДанныеПоЦеннойБумаге.ИндексируемыйНоминал И НастройкиПоВидуУчета.ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНачальногоНоминала Тогда
										УчитыватьИндексациюНоминала = Истина;
									КонецЕсли;
									
									СтоимостьПоНоминалу = СтрокаПартииДляРаспределения.Номинал * СтрокаПартииДляРаспределения.Количество;
									СтоимостьПоНоминалуВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтоимостьПоНоминалу, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
									
									ПриходнаяПартия.ДисконтПремия = ПриходнаяПартия.Стоимость - СтоимостьПоНоминалу;
									ДисконтПремияВВалютеУчета = ПриходнаяПартия.СтоимостьВВалютеУчета - СтоимостьПоНоминалуВВалютеУчета;
									ПриходнаяПартия.ДисконтПремияПокупки = ПриходнаяПартия.ДисконтПремия;
									
									ПриходнаяПартия.ИндексацияНоминала = 0;
									ПриходнаяПартия.ИндексацияНоминалаСНачалаГода = 0;
									
									Если УчитыватьИндексациюНоминала Тогда
										
										СтоимостьПоНоминалу = СтрокаПартииДляРаспределения.Номинал * СтрокаПартииДляРаспределения.Количество;
										СтоимостьПоНачальномуНоминалу = ДанныеПоЦеннойБумаге.Номинал * СтрокаПартииДляРаспределения.Количество;
										
										Стоимость = ПриходнаяПартия.Стоимость / СтоимостьПоНоминалу  * СтоимостьПоНачальномуНоминалу;
										
										ИндексацияНоминала = ПриходнаяПартия.Стоимость - Стоимость;
										ДисконтПремия = ПриходнаяПартия.Стоимость - СтоимостьПоНоминалу;
										
										ПриходнаяПартия.Стоимость = Стоимость;
										ПриходнаяПартия.СтоимостьВВалютеУчета = Стоимость;
										
										ПриходнаяПартия.ИндексацияНоминала = ИндексацияНоминала;
										
										ПриходнаяПартия.ДисконтПремия = ДисконтПремия;
										ПриходнаяПартия.ДисконтПремияПокупки = ДисконтПремия;
										ПриходнаяПартия.ДисконтПремияНачисленный = ?(ДисконтПремия > 0, ДисконтПремия, 0);
										ПриходнаяПартия.ДисконтПремияНачисленныйВВалютеУчета = ПриходнаяПартия.ДисконтПремияНачисленный;
										
									ИначеЕсли ПриходнаяПартия.ДисконтПремия > 0 Тогда // купили с премией
										
										// сразу начисляем ее всю
										ПриходнаяПартия.ДисконтПремияНачисленный = ПриходнаяПартия.ДисконтПремия;
										ПриходнаяПартия.ДисконтПремияНачисленныйВВалютеУчета = ДисконтПремияВВалютеУчета;
										// и отражаем на стоимости только номинальную стоимость
										ПриходнаяПартия.Стоимость = СтоимостьПоНоминалу;
										ПриходнаяПартия.СтоимостьВВалютеУчета = СтоимостьПоНоминалуВВалютеУчета;
										
										// бывают такие клиенты, которые комиссию кладут на тело, и тело становится больше номинала
										Если ПриходнаяПартия.ВключатьРасходыПоПокупкеВСтоимость Тогда
										
											ОтноситьРасходыПриПокупкеНаПремию = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ЭтотОбъект.КонецПериода,
																																 ЭтотОбъект.Организация,
																																 СчетДоверительногоУправленияДляУчета,
																																 ПриходнаяПартия.УчетныйАктивЕПС,
																																 Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
																																 "ОтноситьРасходыПриПокупкеНаПремию");
											Если НЕ ОтноситьРасходыПриПокупкеНаПремию Тогда // пихаем в тело расходы, а что делать...
												
												// точнее переносим из премии, если уже запихали туда
												ПриходнаяПартия.ДисконтПремия = ПриходнаяПартия.ДисконтПремия - ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
												ПриходнаяПартия.ДисконтПремияПокупки = ПриходнаяПартия.ДисконтПремия;
												ПриходнаяПартия.ДисконтПремияНачисленный = ПриходнаяПартия.ДисконтПремияНачисленный - ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
												ПриходнаяПартия.ДисконтПремияНачисленныйВВалютеУчета = ПриходнаяПартия.ДисконтПремияНачисленныйВВалютеУчета - ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета;
												ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость + ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
												ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьВВалютеУчета + ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета;
											
											КонецЕсли;
																																 
										КонецЕсли;
										
									ИначеЕсли ПриходнаяПартия.ДисконтПремия < 0 И НастройкиУчетаЦеннойБумаги.СтоимостьТелаРавнаНоминалу Тогда
										
										ПриходнаяПартия.ДисконтПремияНачисленный = ПриходнаяПартия.ДисконтПремия;
										ПриходнаяПартия.ДисконтПремияНачисленныйВВалютеУчета = ДисконтПремияВВалютеУчета;
										ПриходнаяПартия.Стоимость = СтоимостьПоНоминалу;
										ПриходнаяПартия.СтоимостьВВалютеУчета = СтоимостьПоНоминалуВВалютеУчета;
										
									КонецЕсли;
									
								КонецЕсли;
								
								Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
								
									ПриходнаяПартия.СтоимостьКупона = ПриходнаяПартия.СтоимостьПокупкиКупона;
									ПриходнаяПартия.СтоимостьКупонаВВалютеУчета = ПриходнаяПартия.СтоимостьПокупкиКупонаВВалютеУчета;
									
									ДанныеПоискаРешений = Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии");
									ЗаполнитьЗначенияСвойств(ДанныеПоискаРешений, ПриходнаяПартия);
									СтрокиРешений = РешенияКлиентовПоЗначениямЭСП.НайтиСтроки(ДанныеПоискаРешений);
									Если СтрокиРешений.Количество() > 0 Тогда
										
										ПараметрыДенежногоПотока = Новый Структура;
										ПараметрыДенежногоПотока.Вставить("ДоДатыПогашения", НастройкиУчетаЦеннойБумаги.РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения);
										ПараметрыДенежногоПотока.Вставить("Дата",			 ВыборкаДетальныеЗаписи.Период);
										ПараметрыДенежногоПотока.Вставить("ДатаПереоценки",	 ВыборкаДетальныеЗаписи.Период);
										ДенежныйПоток = Справочники.Облигации.ПолучитьДенежныйПоток(ПриходнаяПартия.ЦеннаяБумага, ПараметрыДенежногоПотока, ПараметрыОценки);
										
										СтоимостьАС = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьДисконтированнуюСтоимость(ДенежныйПоток, СтрокиРешений[0].ЭСП, ВыборкаДетальныеЗаписи.Период) * ПриходнаяПартия.Количество;
										
										СтоимостьПриобретения = ПриходнаяПартия.Стоимость + ПриходнаяПартия.СтоимостьПокупкиКупона;
										
										КорректировкаПП = Окр(СтоимостьАС, 2) - СтоимостьПриобретения;
										
										ПриходнаяПартия.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = КорректировкаПП;
										ПриходнаяПартия.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = КорректировкаПП;
										ПриходнаяПартия.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная = КорректировкаПП;
										
									КонецЕсли;
									
								КонецЕсли;
								
								//переоценка
								ПриходнаяПартия.Переоценка = 0;
								ПриходнаяПартия.ПереоценкаСНачалаГода = 0;
								ПриходнаяПартия.ПереоценкаСНачалаГодаПоложительная = 0;
							
							КонецЕсли; 

							ВсегоКПогашению = ПриходнаяПартия.Количество;
							ПартииСПереоценкой = РассчитанныеПартииКПоступлениюДляСписания.НайтиСтроки(Новый Структура("Регистратор, ЦеннаяБумага, УчетныйАктивЕПС", ВыборкаДетальныеЗаписи.Регистратор, СтрокаПартииДляРаспределения.ЦеннаяБумага, СтрокаПартииДляРаспределения.УчетныйАктивЕПС));
							Для Каждого ПартияСПереоценкой Из ПартииСПереоценкой Цикл
								
								Если ВсегоКПогашению = 0 Тогда
									
									Прервать;
									
								КонецЕсли;
								
								Если ПартияСПереоценкой.Количество = 0
									И ПартияСПереоценкой.ПереоценкаНаБалансе = 0
									И ПартияСПереоценкой.ПереоценкаСНачалаГода = 0
									И ПартияСПереоценкой.ПереоценкаСНачалаГодаПоложительная = 0 Тогда
									
									Продолжить;
									
								КонецЕсли;
								
								КПогашению = Мин(ПартияСПереоценкой.Количество, ВсегоКПогашению);
								
								Если РассчитыватьСтоимости Тогда
									
									ПриходнаяПартия.Переоценка = ПриходнаяПартия.Переоценка + ПартияСПереоценкой.ПереоценкаНаБалансе;
									ПриходнаяПартия.ПереоценкаВВалютеУчета = ПриходнаяПартия.ПереоценкаВВалютеУчета + ПартияСПереоценкой.ПереоценкаНаБалансеВВалютеУчета;
									
									ПриходнаяПартия.ПереоценкаСНачалаГода = ПриходнаяПартия.ПереоценкаСНачалаГода + ПартияСПереоценкой.ПереоценкаСНачалаГода;
									ПриходнаяПартия.ПереоценкаСНачалаГодаПоложительная = ПриходнаяПартия.ПереоценкаСНачалаГодаПоложительная + ПартияСПереоценкой.ПереоценкаСНачалаГодаПоложительная;
									
									Если Отказ Тогда
										Возврат;
									КонецЕсли;
									
								КонецЕсли; 
								
								ВсегоКПогашению = ВсегоКПогашению - КПогашению;
								ПартияСПереоценкой.Количество = ПартияСПереоценкой.Количество - КПогашению;
							КонецЦикла;
							
						// вводы 2016, которые надо правильно учитыватьв ЕПС,у них заполнена стоимость покупки - пока так криво выделяем	
						ИначеЕсли (ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВводЦенныхБумаг")
							И ВыборкаДетальныеЗаписи.Период > МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ)
							И СтрокаПартииДляРаспределения.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
							И РассчитыватьСтоимости Тогда
							
							ДатаПокупки = БухгалтерскийУчетЕПС.ОпределитьДатуПокупкиПартии(СтрокаПартииДляРаспределения.Партия, СтрокаПартииДляРаспределения.СтрокаПартии, Истина, МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ);
							
							ИндексацияНоминала = ВыборкаДетальныеЗаписи.ИндексацияНоминала;
							Если СтрокаПартииДляРаспределения.ЦеннаяБумага.ИндексируемыйНоминал Тогда
								// номинал берем на момент покупки!!!
								Если ДатаПокупки = Неопределено ИЛИ ДатаПокупки = '00010101' Тогда
								
									Отказ = Истина;
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не заполнена дата покупки ЦБ %1 по партии %2, строка %3",
										СтрокаПартииДляРаспределения.ЦеннаяБумага,
										СтрокаПартииДляРаспределения.Партия,
										СтрокаПартииДляРаспределения.СтрокаПартии));
									Возврат;
								
								КонецЕсли;
								
								СтоимостьПоНоминалу = СтрокаПартииДляРаспределения.Количество * Справочники.Облигации.ПолучитьНоминал(СтрокаПартииДляРаспределения.ЦеннаяБумага, ДатаПокупки);
								Если НастройкиПоВидуУчета.ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНачальногоНоминала Тогда
									СтоимостьПоНачальномуНоминалу = ДанныеПоЦеннойБумаге.Номинал * СтрокаПартииДляРаспределения.Количество;
									ИндексацияНоминала = (СтоимостьПоНоминалу - СтоимостьПоНачальномуНоминалу) * СтрокаПартииДляРаспределения.Количество;
									СтоимостьПоНоминалу = СтоимостьПоНачальномуНоминалу;
								ИначеЕсли НастройкиПоВидуУчета.ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.НеУчитывать Тогда
									ИндексацияНоминала = 0;
									СтоимостьПоНоминалу = СтрокаПартииДляРаспределения.Количество * Справочники.Облигации.ПолучитьНоминал(СтрокаПартииДляРаспределения.ЦеннаяБумага, ДатаПокупки);
								КонецЕсли;
							Иначе	// номинал берем на момент ввода!!!
								СтоимостьПоНоминалу = СтрокаПартииДляРаспределения.Количество * Справочники.Облигации.ПолучитьНоминал(СтрокаПартииДляРаспределения.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период);
							КонецЕсли;
							ПриходнаяПартия.ИндексацияНоминала = ИндексацияНоминала;
							ПриходнаяПартия.ИндексацияНоминалаСНачалаГода = ИндексацияНоминала;
							
							Если ПриходнаяПартия.ДисконтПремия > 0 ИЛИ НастройкиУчетаЦеннойБумаги.СтоимостьТелаРавнаНоминалу Тогда
								ПриходнаяПартия.Стоимость = СтоимостьПоНоминалу;
							Иначе
								ПриходнаяПартия.Стоимость = СтоимостьПоНоминалу + ПриходнаяПартия.ДисконтПремия;
							КонецЕсли;
							
							Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0	// по фикс курсу
								И НЕ ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация Тогда	// кроме дефолтных - у них все по другому
							    ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.Стоимость * ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки;
							Иначе
								ПриходнаяПартия.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПриходнаяПартия.Стоимость,ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
							КонецЕсли;
							
							Если СтрокаПартииДляРаспределения.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Магистраль_002")	// особенная бумага
								И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20251219' Тогда														// в особенный день
							
								ПриходнаяПартия.Стоимость = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета;
								ПриходнаяПартия.СтоимостьВВалютеУчета = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета;
							
							ИначеЕсли СтрокаПартииДляРаспределения.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВейлФинанс")// особенная бумага
								И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20251219' Тогда														// в особенный день
							
								ПриходнаяПартия.Стоимость = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета;
								ПриходнаяПартия.СтоимостьВВалютеУчета = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета;
							
							ИначеЕсли СтрокаПартииДляРаспределения.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Структурные_инвестиции")// особенная бумага
								И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20251219' Тогда														// в особенный день
							
								ПриходнаяПартия.Стоимость = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета;
								ПриходнаяПартия.СтоимостьВВалютеУчета = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета;
							
							ИначеЕсли СтрокаПартииДляРаспределения.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстандарт")// особенная бумага
								И (НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20251219'                                                             // в особенный день
									ИЛИ НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20251223') Тогда													 // второй особенный день	
							
								ПриходнаяПартия.СтоимостьВВалютеУчета = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета;
							
							КонецЕсли;
							
							Если НЕ ПриходнаяПартия.ВключатьРасходыПоПокупкеВСтоимость												// у бумаг по СС
								ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.РеклассификацияАктивовЕПС") Тогда	// и бумаг, прошедших рекласс
							
								ПриходнаяПартия.РасходыПриПокупкеВСтоимости = 0;													// не должно быть расходов в стоимости
								ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;										// т.к. при их покупке комиссия сразу шла на расходы
							
							Иначе // бывают такие клиенты, которые комиссию кладут на тело, и тело становится больше номинала
							
								ОтноситьРасходыПриПокупкеНаПремию = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ЭтотОбъект.КонецПериода,
																													 ЭтотОбъект.Организация,
																													 СчетДоверительногоУправленияДляУчета,
																													 ПриходнаяПартия.УчетныйАктивЕПС,
																													 Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
																													 "ОтноситьРасходыПриПокупкеНаПремию");
																													 
								Если НЕ ОтноситьРасходыПриПокупкеНаПремию И ПриходнаяПартия.ДисконтПремия = 0 Тогда // пихаем в тело расходы, а что делать...
									
									СтоимостьПоНоминалу = СтрокаПартииДляРаспределения.Количество * Справочники.Облигации.ПолучитьНоминал(СтрокаПартииДляРаспределения.ЦеннаяБумага, ДатаПокупки);
									Если ПриходнаяПартия.СтоимостьПокупки <> СтоимостьПоНоминалу Тогда
									
										ПриходнаяПартия.Стоимость = ПриходнаяПартия.СтоимостьПокупки;
										Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
											ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.Стоимость * ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки;
										Иначе
											ПриходнаяПартия.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПриходнаяПартия.Стоимость, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										КонецЕсли;
									
									КонецЕсли;
								
								КонецЕсли;
																													 
							КонецЕсли;
							
							Если ПриходнаяПартия.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
								ПриходнаяПартия.ПереоценкаСНачалаГода = ПриходнаяПартия.Переоценка
							КонецЕсли;
							
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
							
						КонецЕсли;
						
						Если НастройкиУчетаОбщие.УчитыватьУчетныйАктивПриСписанииПартий Тогда
							ПриходнаяПартия.ПорядокЕПС = ПорядокЕПС[ПриходнаяПартия.УчетныйАктивЕПС.Родитель];
							ОтсортироватьПриходы = Истина;
						КонецЕсли;
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ЗачислениеПартии;
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, ПриходнаяПартия);
						
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаПартииДляРаспределения.СтрокаПартии;
						
						
						Если ТипЗнч(СтрокаПартииДляРаспределения.Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг")
							И СтрокаПартииДляРаспределения.Партия.Дата > МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ
							И СтрокаПартииДляРаспределения.Регистратор <> Неопределено Тогда
							
							ПриходнаяПартия.Период = КонецДня(БухгалтерскийУчетЕПС.ОпределитьДатуПокупкиПартии(СтрокаПартииДляРаспределения.Партия, СтрокаПартииДляРаспределения.СтрокаПартии, Истина, МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ));
							
							ОтсортироватьПриходы = Истина;	
						
						КонецЕсли;
						
					КонецЦикла;
					
					Если ОтсортироватьПриходы Тогда
					
						Если НастройкиУчетаОбщие.УчитыватьУчетныйАктивПриСписанииПартий Тогда
						    ПриходныеПартии.Сортировать("ПорядокЕПС, Период");
						Иначе
							ПриходныеПартии.Сортировать("Период"); // отсортировать обязательно		
						КонецЕсли;
					
					КонецЕсли;

				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеКупона") Тогда
				
				БылоПогашениеКупонаПоБумагеВЭтомПериоде = Истина;
				
				Если РассчитыватьСтоимости Тогда
					
					ЭтоБанкротПрайм = Ложь;
					Если ДанныеПоЦеннойБумаге.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Прайм")
						И ВыборкаДетальныеЗаписи.Период >= '20190913' Тогда
					
						ЭтоБанкротПрайм = Истина;
					
					КонецЕсли;
					
					// для бумаг по АС берем данные по начальным дисконту/премии из первички (#404807)
					// это связано с тем, что у них комиссия идет в стоимость и требуется точность, большая чем может обеспечить ресурс ДисконтПремияПокупки
					// #436580 - для организации ДК сделано упрощение расчетов
					ИспользоватьПервичныеДанныеДляОпределенияЦеныПриобретения = (ПриходныеПартии.Найти(Истина, "ВключатьРасходыПоПокупкеВСтоимость") <> Неопределено) И НЕ Организация_ДК;
					
					Если ИспользоватьПервичныеДанныеДляОпределенияЦеныПриобретения Тогда
						ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ПриходныеПартии, СчетДоверительногоУправленияДляУчета, ВыборкаДетальныеЗаписи.Период).Выгрузить();
					Иначе 
						ДатыИЦеныПокупки = Неопределено;
					КонецЕсли;
					
					// #361945 - по Облигация_ДП_О1ГрФин1P3, Облигация_АрчерФинанс, Облигация_ОткрытиеХолдинг клиенты Будущее(с 11/2/21) и Телеком(с 10/2/21) отключили расчет НКД
					НеНачислятьИНеПогашатьНКД = Ложь;
					Если ЭтоКлиентТелеком И НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20210210'
						ИЛИ ЭтоКлиентБудущее И НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20210211' Тогда
						
						Если ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс")
							ИЛИ ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_Груп_Финанс") 
							ИЛИ ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДП_О1ГрФин1P3") 
							ИЛИ ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг") Тогда
							
							НеНачислятьИНеПогашатьНКД = Истина;
							
						КонецЕсли;
					КонецЕсли;
					
					// #584222 - по Облигация_О1Пропертиз_Дол (О1 Пропертиз Финанс АО, 4B02-01-71827-H-001P, 1000.00 USD) клиенты Будущее и Эволюция(с 01/01/25)
					Если ((ЭтоКлиентБудущее ИЛИ ЭтоКлиентЭволюция) И НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20250101')
						И (ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_Дол")) Тогда
						
						НеНачислятьИНеПогашатьНКД = Истина;
						
					КонецЕсли;
					
			        // хардкод для банкротов Открытие, Арчер и Финстойн
			        // с 31.10.2022 не переоцениваем ничего
					НеНачислятьДисконтПремиюКорректировку = Ложь;
				    Если (ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстоун") И БанкротствоФинстоунаИАрчераПризнано)
					    ИЛИ (ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс") И БанкротствоФинстоунаИАрчераПризнано)
					    ИЛИ (ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг") И БанкротствоОткрытияПризнано)
					    ИЛИ (ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрХолдинг_004") И БанкротствоОткрытияПризнано) Тогда
					   
						 НеНачислятьИНеПогашатьНКД = Истина;
						 НеНачислятьДисконтПремиюКорректировку = Истина;
					 КонецЕсли;
					 
					 
					
					ЭтоВебФинанс210522 = (ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_VEB_5.942_11/21") И НачалоДня(ВыборкаДетальныеЗаписи.Регистратор.Дата) = '20220521');
					
					КурсПерекурсовки = Неопределено;
					
					ОбщееКоличество = ВыборкаДетальныеЗаписи.Количество;
					СуммаКупонаНаОднуОблигацию = ВыборкаДетальныеЗаписи.СуммаНаОднуОблигацию;
					Если НЕ ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага Тогда
						СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
						ОбщаяСуммаВВалютеУчета = ВыборкаДетальныеЗаписи.Количество * СуммаКупонаНаОднуОблигациюВВалютеУчета;
						ОбщаяСуммаОплатыВВалютеУчета = ОбщаяСуммаВВалютеУчета;
					ИначеЕсли ВыборкаДетальныеЗаписи.ВалютаОплаты = ВалютаУчета Тогда
						// погашение купона по валютной бумаге причем сумма в рублях... маразм, блин!
						СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
						СуммаКупонаНаОднуОблигацию = ОпределитьСтоимостьКупонаВМоментАмортизации(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период);
						КурсПерекурсовки = СуммаКупонаНаОднуОблигациюВВалютеУчета / СуммаКупонаНаОднуОблигацию;
						ОбщаяСуммаВВалютеУчета = ВыборкаДетальныеЗаписи.Количество * СуммаКупонаНаОднуОблигациюВВалютеУчета;
						Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда // ОбщаяСуммаВВалютеУчета должна в этом случае быть по фиксированному курсу!
							ОбщаяСуммаВВалютеУчета = ВыборкаДетальныеЗаписи.Количество * СуммаКупонаНаОднуОблигацию * ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки;
						КонецЕсли;
						ОбщаяСуммаОплатыВВалютеУчета = ВыборкаДетальныеЗаписи.СуммаНаОднуОблигацию * ВыборкаДетальныеЗаписи.Количество; // оплата приходит не по официальному курсу и не по куурсу клиента, а по какому-то 3му
					Иначе
						СуммаКупонаНаОднуОблигациюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупонаНаОднуОблигацию, ВыборкаДетальныеЗаписи.ВалютаОплаты, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
						//можно из регистра купонов брать, отбор по дате фиксации
						Если ВыборкаДетальныеЗаписи.ВалютаОплаты <> ДанныеПоЦеннойБумаге.ВалютаНоминала Тогда
							СуммаКупонаНаОднуОблигацию = Окр(РаботаСВалютами.ПересчетСуммыВВалюте(
																	СуммаКупонаНаОднуОблигацию,
																	ВыборкаДетальныеЗаписи.ВалютаОплаты,
																	ВыборкаДетальныеЗаписи.ДатаФиксации,
																	ДанныеПоЦеннойБумаге.ВалютаНоминала,
																	ВыборкаДетальныеЗаписи.ДатаФиксации,
																	Отказ),
																6);
						КонецЕсли;
															
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
						ОбщаяСуммаВВалютеУчета = Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.Количество * СуммаКупонаНаОднуОблигацию, 
																	ВыборкаДетальныеЗаписи.ВалютаОплаты,
																	Организация, ВыборкаДетальныеЗаписи.Период, Отказ),	2);
																	
						ОбщаяСуммаОплатыВВалютеУчета = ОбщаяСуммаВВалютеУчета;
					КонецЕсли;
					
					// для бумаг, с реструктуризацией платежей по купонам, купон гасится не весь
					// остается часть купона
					// например у Облигация_ТМ-энергоФинанс в 20190925 купон не гасили, а просто разбили на куски по 15,7 на 6 будущих периодов
					// и на конец дня купон будет ненулевой, поэтому дооценивать нужно до РасчетныйКупонНаНачалоДня
					// для обычных бумаг он (РасчетныйКупонНаКонецДня) все равно будет поэтому этот код будет работать для всех
					ОблигацияСРеструктуризациейПлатежей = Ложь;
					ПроизводитьНачислениеПроцентныхПоказателей = Истина;
					
					РасчетныйКупонНаКонецДня = Справочники.Облигации.ПолучитьКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, НачалоДня(ВыборкаДетальныеЗаписи.Период), СчетДоверительногоУправленияДляУчета);
					Если РасчетныйКупонНаКонецДня <> 0 Тогда // пока такой критерий - лучше не придумал
						ОблигацияСРеструктуризациейПлатежей = Истина;	
					КонецЕсли;
					
					Если ОблигацияСРеструктуризациейПлатежей Тогда 
						
						// дооценивать будем до этого значения
						РасчетныйКупонНаНачалоДня = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, НачалоДня(ВыборкаДетальныеЗаписи.Период), СчетДоверительногоУправления, Истина);
						Если НЕ ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага Тогда
							РасчетныйКупонНаНачалоДняВВалютеУчета = РасчетныйКупонНаНачалоДня;
						Иначе	
						    РасчетныйКупонНаНачалоДняВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(РасчетныйКупонНаНачалоДня, ВыборкаДетальныеЗаписи.ВалютаОплаты, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
						КонецЕсли;
						
						// Возможно 2 варианта:
						//	1. И сумму реструктуризации и сумму этого периода запихали в одно погашение - нормас, по нему и доначислим купон до полной суммы перед погашением
						//  2. Сделали 2 разных погашения: одно на рекструктурируемую сумму, 2ое на тек. период  - тогда по первому погашению начислим, а по 2му не будем
						//  из-за п.2 делаем триггер о том, что уже начисляли
						Если ДанныеПоЦеннойБумаге.ПроводилиНачислениеПоЭтойОблигацияСРеструктуризациейПлатежей Тогда 
							ПроизводитьНачислениеПроцентныхПоказателей = Ложь;
						Иначе
							ДанныеПоЦеннойБумаге.ПроводилиНачислениеПоЭтойОблигацияСРеструктуризациейПлатежей = Истина;
						КонецЕсли;
					
					КонецЕсли;
					
					Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 И НЕ ЭтоВебФинанс210522 Тогда
					
						КурсНачисленияКупона = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки;
						
					ИначеЕсли КурсПерекурсовки <> Неопределено Тогда
						
						КурсНачисленияКупона = КурсПерекурсовки;
						
					Иначе
						
						КурсНачисленияКупона = 0;
					
					КонецЕсли;
					
					ТребуетсяУчетПогрешностиОкругленияРублевыхСумм = НастройкиПоВидуУчета.УчитыватьПогрешностьОкругленияНаПартияхВВалютеУчета И ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки = 0 И ВыборкаДетальныеЗаписи.Период > '20240101';
					МассивДвиженийНачисления = ?(ТребуетсяУчетПогрешностиОкругленияРублевыхСумм, Новый Массив(), Неопределено);

					Если ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага Тогда
						КурсВалютыИзменился = КурсВалютыИзменился(ИзмененияКурсовВалют, ДанныеПоЦеннойБумаге.ВалютаНоминала, НачалоДня(ВыборкаДетальныеЗаписи.Период));
					Иначе
						КурсВалютыИзменился = Ложь;
					КонецЕсли;
					
					//Для всех приходных партий:
					// 1. Дооценим купон
					// 2. Начислим дисконт/премию
					// 3. Начислим корректировку по ЭСП
					// 4. Спишем купон
					// 5. Если клиент отражает задолженность на счетах учета - добавим начисление задолженности по погашению купона
					Для Каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
						
						НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
							НастройкиУчетаОбщие,
							СтрокаПриходныхПартий.ЦеннаяБумага,
							СтрокаПриходныхПартий.УчетныйАктивЕПС,
							СтрокаПриходныхПартий.Партия,
							СтрокаПриходныхПартий.СтрокаПартии);
						
						Если НЕ ЭтоБанкротПрайм И ПроизводитьНачислениеПроцентныхПоказателей Тогда
							
							Если (ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки = 0 ИЛИ ЭтоВебФинанс210522) И КурсВалютыИзменился Тогда
							
								НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии, КурсПерекурсовки,, Новый Структура("ЭтоВебФинанс210522", ЭтоВебФинанс210522), Отказ);
								
								Если НастройкиУчетаОбщие.ОтражатьДоходыРасходыОтПерекурсовкиПереоценкиКакПереоценку
									И СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
								
									НовоеДвижение.ПереоценкаСНачалаГода = НовоеДвижение.ПереоценкаВВалютеУчета;
								
								КонецЕсли;
								
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								
							КонецЕсли;
							
							// 1. Дооценим купон
							ДоначислятьКупонДоСуммы = СуммаКупонаНаОднуОблигацию;
							Если ОблигацияСРеструктуризациейПлатежей Тогда
								ДоначислятьКупонДоСуммы = РасчетныйКупонНаНачалоДня;
							КонецЕсли;
							
							НовоеДвижение = ДоначислитьКупон(ВыборкаДетальныеЗаписи.Регистратор, 
																	ВыборкаДетальныеЗаписи.Период, 
																	СтрокаПриходныхПартий,
																	ДоначислятьКупонДоСуммы,
																	СтрокаПриходныхПартий.Количество,
																	КурсНачисленияКупона,
																	0,
																	Ложь,
																	Отказ);
							
							Если ТребуетсяУчетПогрешностиОкругленияРублевыхСумм Тогда
								МассивДвиженийНачисления.Добавить(НовоеДвижение);
							КонецЕсли; 
							
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
							
							Если НеНачислятьИНеПогашатьНКД Тогда
							
								НовоеДвижение.ПереоценкаКупона = 0;
								НовоеДвижение.ПереоценкаКупонаВВалютеУчета = 0;
							
							КонецЕсли;
							
							СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона + НовоеДвижение.ПереоценкаКупона;
							СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
																	
							// 2. Начислим дисконт/премию
							ДатаПокупки	= СтрокаПриходныхПартий.ДатаПокупки;
							ДатаПокупкиНачальная = СтрокаПриходныхПартий.ДатаПокупкиНачальная;
							КорректировкаЭСПНачальная = СтрокаПриходныхПартий.КорректировкаЭСПНачальная;
							ЦенаПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная / СтрокаПриходныхПартий.Количество;
							
							Если ДатыИЦеныПокупки = Неопределено Тогда
								
								НачальныйДисконт  = Окр(СтрокаПриходныхПартий.ДисконтПремияПокупки / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
								
								Если ДанныеПоЦеннойБумаге.Амортизационная ИЛИ ДанныеПоЦеннойБумаге.ИндексируемыйНоминал Тогда
									ЦенаПокупки	= Справочники.Облигации.ПолучитьНоминал(СтрокаПриходныхПартий.ЦеннаяБумага, ДатаПокупки) + НачальныйДисконт;
								Иначе
									ЦенаПокупки	= СтрокаПриходныхПартий.Номинал + НачальныйДисконт;
								КонецЕсли;
								ЦенаПокупкиКупона	= Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
								
							Иначе
								
								ДатаИЦенаПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаПриходныхПартий.НомерСтроки));
								
								НачальныйДисконт 	= ДатаИЦенаПокупки[0].НачальныйДисконт;
								ЦенаПокупки 		= ДатаИЦенаПокупки[0].ЦенаПокупки;
								ЦенаПокупкиКупона 	= ДатаИЦенаПокупки[0].ЦенаКупона;
								
							КонецЕсли;
							
							ДанныеПереоценки = Новый Структура("Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
							ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаПриходныхПартий, "Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
							ДанныеПереоценки.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДетальныеЗаписи.Период));
							ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", 0);
							ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаПриходныхПартий.ДисконтПремияНачисленный);
							ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
							ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
							ДанныеПереоценки.Вставить("Стоимость", СтрокаПриходныхПартий.Стоимость);
							
							ДанныеПокупки = Новый Структура;
							ДанныеПокупки.Вставить("НачальныйДисконт", НачальныйДисконт);
							ДанныеПокупки.Вставить("ДатаПокупки", ДатаПокупки);
							ДанныеПокупки.Вставить("ДатаПокупкиНачальная", ДатаПокупкиНачальная);
							ДанныеПокупки.Вставить("КорректировкаЭСПНачальная", КорректировкаЭСПНачальная);
							ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаПокупки);
							ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная / СтрокаПриходныхПартий.Количество);
							ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
							ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", ЦенаПокупкиНачальная);

							ДисконтИКорректировкаЭСП = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(СтрокаПриходныхПартий.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);
																										
							Если ДисконтИКорректировкаЭСП = Неопределено Тогда
								Возврат;
							КонецЕсли;
							
							Если ЭтоКлиентЮгория ИЛИ (НачальныйДисконт > 0 И СтрокаПриходныхПартий.ДисконтПремияНачисленный < ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия) ИЛИ НеНачислятьДисконтПремиюКорректировку Тогда 
							    //Купили с премией, а новая премия вдруг оказалась больше
								НовоеДвижение.ДисконтПремияНачисленный = 0; // ничего не делаем
								НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = 0; // ничего не делаем
							Иначе
								
								НовоеДвижение.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия - СтрокаПриходныхПартий.ДисконтПремияНачисленный;
								
								Для каждого СтрокаСписанияДисконтов Из СписанияДисконтов Цикл
								
									Если СтрокаСписанияДисконтов.Дата = НачалоДня(ВыборкаДетальныеЗаписи.Период) // в этот же день
										 И СтрокаСписанияДисконтов.Партия = СтрокаПриходныхПартий.Партия Тогда   // по этой же партии
									
										НовоеДвижение.ДисконтПремияНачисленный = НовоеДвижение.ДисконтПремияНачисленный - СтрокаСписанияДисконтов.Сумма;
									
									КонецЕсли;
								
								КонецЦикла;
								
								СтрокаПриходныхПартий.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия;
								
								КурсНачисленияДисконтаПремии = Неопределено; // по умолчанию курс - текущий
								Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
									КурсНачисленияДисконтаПремии = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
								КонецЕсли;
								
								СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
										Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.ДисконтПремияНачисленный, СтрокаПриходныхПартий.ДисконтПремияНачисленный), 
										ДанныеПоЦеннойБумаге.ВалютаНоминала,
										ЭтотОбъект.Организация,
										ВыборкаДетальныеЗаписи.Период,
										КурсНачисленияДисконтаПремии,
										Отказ);
										
								ОстатокДисконтПремияНачисленныйВВалютеУчета = Окр(СуммыВВалютеУчета.СуммаОстаток, 2);
										
								НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = ОстатокДисконтПремияНачисленныйВВалютеУчета - СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета;
								СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета = ОстатокДисконтПремияНачисленныйВВалютеУчета;
								
							КонецЕсли;
							
							// 3. Начислим корректировку по ЭСП
							Если НастройкиДляУчетаКорректировкиЭСП.Найти(НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода) <> Неопределено И НЕ ЭтоКлиентЮгория И НЕ НеНачислятьДисконтПремиюКорректировку Тогда
								
								КурсНачисленияКорректировкиЭСП = Неопределено; // по умолчанию курс - текущий
								Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
									КурсНачисленияКорректировкиЭСП = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
								КонецЕсли;
								
								ОценочнаяКорректировкаЭСПВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
																										Новый Структура("Сумма", ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП), 
																										ДанныеПоЦеннойБумаге.ВалютаНоминала,
																										ЭтотОбъект.Организация,
																										ВыборкаДетальныеЗаписи.Период,
																										КурсНачисленияКорректировкиЭСП,
																									Отказ).Сумма;

								НовоеДвижение.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП - СтрокаПриходныхПартий.КорректировкаЭСП;
								НовоеДвижение.КорректировкаЭСПВВалютеУчета = ОценочнаяКорректировкаЭСПВВалютеУчета - СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета;
								
								СтрокаПриходныхПартий.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП;
								СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета = ОценочнаяКорректировкаЭСПВВалютеУчета;
								
							КонецЕсли;
							
							НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
							НовоеДвижение.КорректировкаЭСПСНачалаГода = НовоеДвижение.КорректировкаЭСПВВалютеУчета;
							НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода = НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
							
							СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода + НовоеДвижение.ПереоценкаКупонаСНачалаГода;
							СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода = СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода + НовоеДвижение.КорректировкаЭСПСНачалаГода; 
							СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода = СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода + НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
							
						КонецЕсли;
							
						// 4. Спишем купон
						
						// Хардкод в этот день по этим бумагам купон не списываем
						Если (СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БизнесКонсалтиг")
							ИЛИ СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БКЗ_ФИНАНС")
							ИЛИ СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ТМ-энергоФинанс"))
							И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20190925' Тогда
						
							Продолжить;
						
						КонецЕсли;
						
						Если НеНачислятьИНеПогашатьНКД Тогда
							Продолжить;
						КонецЕсли;
						
						НовоеДвижениеСписания = ЭтотОбъект.РассчитанныеПартии.Добавить();
						//НовоеДвижениеСписания.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеКупона;
						
						НовоеДвижениеСписания.ЦеннаяБумага 		= СтрокаПриходныхПартий.ЦеннаяБумага;
						НовоеДвижениеСписания.УчетныйАктивЕПС 	= СтрокаПриходныхПартий.УчетныйАктивЕПС;
						НовоеДвижениеСписания.Партия	 		= СтрокаПриходныхПартий.Партия;
						НовоеДвижениеСписания.СтрокаПартии 		= СтрокаПриходныхПартий.СтрокаПартии;
						НовоеДвижениеСписания.Рынок 			= СтрокаПриходныхПартий.Рынок;
						
						НовоеДвижениеСписания.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижениеСписания.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижениеСписания.Период 	  = ВыборкаДетальныеЗаписи.Период;
						
						НовоеДвижениеСписания.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						НовоеДвижениеСписания.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона;
						НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета;
						НовоеДвижениеСписания.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости;
						НовоеДвижениеСписания.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона;
						НовоеДвижениеСписания.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета;
						
						НовоеДвижениеСписания.ПереоценкаКупонаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода;
						
						// для бумаг, с реструктуризацией платежей по купонам, купон гасится не весь
						// остается часть купона
						Если ОблигацияСРеструктуризациейПлатежей Тогда
							
							НовоеДвижениеСписания.ПереоценкаКупона =  СтрокаПриходныхПартий.Количество * СуммаКупонаНаОднуОблигацию - СтрокаПриходныхПартий.СтоимостьКупона;
							НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.Количество * СуммаКупонаНаОднуОблигацию - СтрокаПриходныхПартий.СтоимостьКупона;
							
							СтрокаПриходныхПартий.ПереоценкаКупона				= СтрокаПриходныхПартий.ПереоценкаКупона				- НовоеДвижениеСписания.ПереоценкаКупона				- НовоеДвижениеСписания.СтоимостьКупона;
							СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета	= СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета	- НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета	- НовоеДвижениеСписания.СтоимостьКупонаВВалютеУчета;
							
						Иначе
							
							СтрокаПриходныхПартий.ПереоценкаКупона = 0;
							СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = 0;
						
						КонецЕсли;
						
						СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости = 0;
						СтрокаПриходныхПартий.СтоимостьКупона = 0;
						СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета = 0;
						СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода = 0;
						
						СуммаОплатыВВалютеУчета = Окр(ОбщаяСуммаОплатыВВалютеУчета * СтрокаПриходныхПартий.Количество / ОбщееКоличество, 2);
						ОбщаяСуммаОплатыВВалютеУчета = ОбщаяСуммаОплатыВВалютеУчета - СуммаОплатыВВалютеУчета;
						
						ОбщаяСуммаВВалютеУчета = ОбщаяСуммаВВалютеУчета - (НовоеДвижениеСписания.СтоимостьКупонаВВалютеУчета + НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета);
						ОбщееКоличество = ОбщееКоличество - СтрокаПриходныхПартий.Количество;
						Если НастройкиПоВидуУчета.УчитыватьПогрешностьОкругленияНаПартияхВВалютеУчета И ОбщееКоличество = 0 И ОбщаяСуммаВВалютеУчета <> 0 Тогда // ситуация когда накописась копейка(и) по рублевым суммам - отправим их на последнюю строку т.к. никакой разницы нет
						
							НовоеДвижение.ПереоценкаКупонаВВалютеУчета = НовоеДвижение.ПереоценкаКупонаВВалютеУчета + ОбщаяСуммаВВалютеУчета;
							НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета = НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета + ОбщаяСуммаВВалютеУчета;

							НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаСНачалаГода + ОбщаяСуммаВВалютеУчета;
							НовоеДвижениеСписания.ПереоценкаКупонаСНачалаГода = НовоеДвижениеСписания.ПереоценкаКупонаСНачалаГода + ОбщаяСуммаВВалютеУчета;
							
						КонецЕсли;
						
						Если ОбщееКоличество = 0 И ОбщаяСуммаОплатыВВалютеУчета <> 0 Тогда
						
							СуммаОплатыВВалютеУчета = СуммаОплатыВВалютеУчета + ОбщаяСуммаОплатыВВалютеУчета;
							ОбщаяСуммаОплатыВВалютеУчета = 0;
						
						КонецЕсли;
						
						// 5. Если клиент отражает задолженность на счетах учета - добавим начисление задолженности по погашению купона
						Если НастройкиУчетаОбщие.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
						
							НовоеДвижениеНачисленияЗадолженности = ЭтотОбъект.РассчитанныеПартии.Добавить();
							//НовоеДвижениеНачисленияЗадолженности.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.НачислениеЗадолженности;
							
							ЗаполнитьЗначенияСвойств(НовоеДвижениеНачисленияЗадолженности, НовоеДвижениеСписания, );
							
							НовоеДвижениеНачисленияЗадолженности.ВидДвижения = Перечисления.ВидыДвижений.Приход;
							
							НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупона = НовоеДвижениеСписания.СтоимостьКупона + НовоеДвижениеСписания.ПереоценкаКупона;
							НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупонаВВалютеУчета = СуммаОплатыВВалютеУчета;
							
							НовоеДвижениеНачисленияЗадолженности.СтоимостьКупона = 0;
							НовоеДвижениеНачисленияЗадолженности.СтоимостьКупонаВВалютеУчета = 0;
							НовоеДвижениеНачисленияЗадолженности.ПереоценкаКупона = 0;
							НовоеДвижениеНачисленияЗадолженности.ПереоценкаКупонаВВалютеУчета = 0;
							НовоеДвижениеНачисленияЗадолженности.ПереоценкаКупонаСНачалаГода = 0;
							
							СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупона = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупона;
							СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупонаВВалютеУчета = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупонаВВалютеУчета;
						
						КонецЕсли;
						
					КонецЦикла;
					
					Если ТребуетсяУчетПогрешностиОкругленияРублевыхСумм И НЕ ЭтоКлиентЮгория Тогда
						УчестьПогрешностиРублевыхСумм(ВыборкаДетальныеЗаписи.Период, КурсПерекурсовки, ПриходныеПартии, МассивДвиженийНачисления, Отказ);
					КонецЕсли;
					
					// нужно списывать купон также по партиям, купленым по РЕПО
					Для каждого СтрокаПриходныхПартийКупленныхпоРЕПО Из ПартииКупленныеПоРЕПО Цикл
						
						Если СтрокаПриходныхПартийКупленныхпоРЕПО.ЦеннаяБумага <> ВыборкаДетальныеЗаписи.ЦеннаяБумага Тогда
							Продолжить;
						КонецЕсли;
						
						Если НастройкиУчетаОбщие.ДействияПриПогашенииКупонаНаСчетахГлавыГ <> "НеНачислять_И_НеСписывать" Тогда
							// 1. Дооценим купон
							НовоеДвижениеНачисления = ДоначислитьКупонРЕПО(ВыборкаДетальныеЗаписи.Регистратор, 
																	ВыборкаДетальныеЗаписи.Период,
																	ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО,
																	СтрокаПриходныхПартийКупленныхпоРЕПО,
																	СуммаКупонаНаОднуОблигацию,
																	СтрокаПриходныхПартийКупленныхпоРЕПО.Количество,
																	0,
																	Отказ);
																	
							СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупона = СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупона + НовоеДвижениеНачисления.ПереоценкаКупона;
							СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеНачисления.ПереоценкаКупонаВВалютеУчета;
																	
							// 2. Спишем купон
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Добавить();
							
							НовоеДвижение.ЦеннаяБумага 		= СтрокаПриходныхПартийКупленныхпоРЕПО.ЦеннаяБумага;
							НовоеДвижение.Партия	 		= СтрокаПриходныхПартийКупленныхпоРЕПО.Партия;
							НовоеДвижение.СтрокаПартии 		= СтрокаПриходныхПартийКупленныхпоРЕПО.СтрокаПартии;
							НовоеДвижение.Рынок 			= СтрокаПриходныхПартийКупленныхпоРЕПО.Рынок;
							
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период 	  = ВыборкаДетальныеЗаписи.Период;
							
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							НовоеДвижение.ПереоценкаКупона				= СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупона;
							НовоеДвижение.ПереоценкаКупонаВВалютеУчета	= СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупонаВВалютеУчета;
							НовоеДвижение.СтоимостьКупона				= СтрокаПриходныхПартийКупленныхпоРЕПО.СтоимостьКупона;
							НовоеДвижение.СтоимостьКупонаВВалютеУчета	= СтрокаПриходныхПартийКупленныхпоРЕПО.СтоимостьКупонаВВалютеУчета;
							НовоеДвижение.ПереоценкаКупонаСНачалаГода	= СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупонаСНачалаГода;
							
							СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупона = 0;
							СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупонаВВалютеУчета = 0;
							СтрокаПриходныхПартийКупленныхпоРЕПО.СтоимостьКупона = 0;
							СтрокаПриходныхПартийКупленныхпоРЕПО.СтоимостьКупонаВВалютеУчета = 0;
							СтрокаПриходныхПартийКупленныхпоРЕПО.ПереоценкаКупонаСНачалаГода = 0;

						КонецЕсли;
							
					КонецЦикла;
					
					//Для всех партий, проданных в РЕПО:
					// 1. Дооценим купон
					// 2. Начислим дисконт/премию
					// 3. Начислим корректировку по ЭСП
					// 4. Спишем купон
					// 5. Если клиент отражает задолженность на счетах учета - добавим начисление задолженности по погашению купона
					Для Каждого СтрокаПартийПроданныхВРЕПО Из ПартииПроданныеВРЕПО Цикл
						
						Если СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага <> ВыборкаДетальныеЗаписи.ЦеннаяБумага Тогда
							Продолжить;
						КонецЕсли;
						
						
						Если ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага И КурсВалютыИзменился Тогда
						
							НовоеДвижение = Перекурсовка(
								ВыборкаДетальныеЗаписи.Регистратор, 
								ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО, 
								ВыборкаДетальныеЗаписи.Период, 
								СтрокаПартийПроданныхВРЕПО, 
								СтрокаПартийПроданныхВРЕПО.Количество, 
								ВыборкаДетальныеЗаписи.СтрокаПартии, 
								КурсПерекурсовки,
								,
								,
								Отказ);
							
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
							
						КонецЕсли;
						
						// 1. Дооценим купон
						ДоначислятьКупонДоСуммы = СуммаКупонаНаОднуОблигацию;
						
						НовоеДвижение = ДоначислитьКупонРЕПО(
							ВыборкаДетальныеЗаписи.Регистратор, 
							ВыборкаДетальныеЗаписи.Период,
							ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО,
							СтрокаПартийПроданныхВРЕПО,
							ДоначислятьКупонДоСуммы,
							СтрокаПартийПроданныхВРЕПО.Количество,
							0,
							Отказ);
						
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
						СтрокаПартийПроданныхВРЕПО.ПереоценкаКупона = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупона + НовоеДвижение.ПереоценкаКупона;
						СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВВалютеУчета = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
																
						// 2. Начислим дисконт/премию
						ДатаПокупки	= СтрокаПартийПроданныхВРЕПО.ДатаПокупки;
						ДатаПокупкиНачальная = СтрокаПартийПроданныхВРЕПО.ДатаПокупкиНачальная;
						КорректировкаЭСПНачальная = СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПНачальная;
						ЦенаПокупкиНачальная = СтрокаПартийПроданныхВРЕПО.СтоимостьПокупкиНачальная / СтрокаПартийПроданныхВРЕПО.Количество;
						
						НачальныйДисконт  = Окр(СтрокаПартийПроданныхВРЕПО.ДисконтПремияПокупки / СтрокаПартийПроданныхВРЕПО.Количество, РазрядностьДробнойЧасти);
						
						Если ДанныеПоЦеннойБумаге.Амортизационная ИЛИ ДанныеПоЦеннойБумаге.ИндексируемыйНоминал Тогда
							ЦенаПокупки	= Справочники.Облигации.ПолучитьНоминал(СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага, ДатаПокупки) + НачальныйДисконт;
						Иначе
							ЦенаПокупки	= СтрокаПартийПроданныхВРЕПО.Номинал + НачальныйДисконт;
						КонецЕсли;
						ЦенаПокупкиКупона	= Окр(СтрокаПартийПроданныхВРЕПО.СтоимостьПокупкиКупона / СтрокаПартийПроданныхВРЕПО.Количество, РазрядностьДробнойЧасти);
							
						ДанныеПереоценки = Новый Структура("Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
						ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаПартийПроданныхВРЕПО, "Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
						ДанныеПереоценки.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДетальныеЗаписи.Период));
						ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", 0);
						ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный);
						ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПартийПроданныхВРЕПО.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
						ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
						ДанныеПереоценки.Вставить("Стоимость", СтрокаПартийПроданныхВРЕПО.Стоимость);
						
						ДанныеПокупки = Новый Структура;
						ДанныеПокупки.Вставить("НачальныйДисконт", НачальныйДисконт);
						ДанныеПокупки.Вставить("ДатаПокупки", ДатаПокупки);
						ДанныеПокупки.Вставить("ДатаПокупкиНачальная", ДатаПокупкиНачальная);
						ДанныеПокупки.Вставить("КорректировкаЭСПНачальная", КорректировкаЭСПНачальная);
						ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаПокупки);
						ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПартийПроданныхВРЕПО.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная / СтрокаПартийПроданныхВРЕПО.Количество);
						ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
						ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", ЦенаПокупкиНачальная);

						ДисконтИКорректировкаЭСП = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);
																									
						Если ДисконтИКорректировкаЭСП = Неопределено Тогда
							Возврат;
						КонецЕсли;
						
						НовоеДвижение.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия - СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный;
						
						Если ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага Тогда
							ОстатокДисконтПремияНачисленныйВВалютеУчета = Окр(РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
								Новый Структура("СуммаОстаток", СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный), 
								ДанныеПоЦеннойБумаге.ВалютаНоминала,
								ЭтотОбъект.Организация,
								ВыборкаДетальныеЗаписи.Период,
								,
								Отказ).СуммаОстаток, 2);
						Иначе
							ОстатокДисконтПремияНачисленныйВВалютеУчета = СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный; 
						КонецЕсли;
								
						НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = ОстатокДисконтПремияНачисленныйВВалютеУчета - СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйВВалютеУчета;
						
						Если НачальныйДисконт > 0 И СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный < ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия Тогда
						    //Купили с премией, а новая премия вдруг оказалась больше
							НовоеДвижение.ДисконтПремияНачисленный = 0; // ничего не делаем
							НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = 0; // ничего не делаем
						КонецЕсли;

						СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия;
						СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйВВалютеУчета = ОстатокДисконтПремияНачисленныйВВалютеУчета;
						
						// 3. Начислим корректировку по ЭСП
						Если НастройкиДляУчетаКорректировкиЭСП.Найти(НастройкиУчетаОбщие.ВариантУчетаКупонногоДохода) <> Неопределено Тогда
							
							Если ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага Тогда
								ОценочнаяКорректировкаЭСПВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
									Новый Структура("Сумма", ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП), 
									ДанныеПоЦеннойБумаге.ВалютаНоминала,
									ЭтотОбъект.Организация,
									ВыборкаДетальныеЗаписи.Период,
									,
									Отказ).Сумма;
							Иначе
								ОценочнаяКорректировкаЭСПВВалютеУчета = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП;
							КонецЕсли;

							НовоеДвижение.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП - СтрокаПартийПроданныхВРЕПО.КорректировкаЭСП;
							НовоеДвижение.КорректировкаЭСПВВалютеУчета = ОценочнаяКорректировкаЭСПВВалютеУчета - СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПВВалютеУчета;
							
							СтрокаПартийПроданныхВРЕПО.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП;
							СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПВВалютеУчета = ОценочнаяКорректировкаЭСПВВалютеУчета;
							
						КонецЕсли;
						
						НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
						НовоеДвижение.КорректировкаЭСПСНачалаГода = НовоеДвижение.КорректировкаЭСПВВалютеУчета;
						НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода = НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
						
						СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаСНачалаГода = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаСНачалаГода + НовоеДвижение.ПереоценкаКупонаСНачалаГода;
						СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПСНачалаГода = СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПСНачалаГода + НовоеДвижение.КорректировкаЭСПСНачалаГода; 
						СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода = СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода + НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
						
							
						// 4. Спишем купон
						НовоеДвижениеСписания = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
						//НовоеДвижениеСписания.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеКупона;
						
						НовоеДвижениеСписания.ЦеннаяБумага 		= СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага;
						НовоеДвижениеСписания.УчетныйАктивЕПС 	= СтрокаПартийПроданныхВРЕПО.УчетныйАктивЕПС;
						НовоеДвижениеСписания.Партия	 		= СтрокаПартийПроданныхВРЕПО.Партия;
						НовоеДвижениеСписания.СтрокаПартии 		= СтрокаПартийПроданныхВРЕПО.СтрокаПартии;
						НовоеДвижениеСписания.Рынок 			= СтрокаПартийПроданныхВРЕПО.Рынок;

						НовоеДвижениеСписания.ПродажаРЕПО 		= СтрокаПартийПроданныхВРЕПО.ПродажаРЕПО;
						НовоеДвижениеСписания.СтрокаПродажиРЕПО	= СтрокаПартийПроданныхВРЕПО.СтрокаПродажиРЕПО;
						
						НовоеДвижениеСписания.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижениеСписания.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижениеСписания.Период 	  = ВыборкаДетальныеЗаписи.Период;
						
						НовоеДвижениеСписания.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						НовоеДвижениеСписания.ПереоценкаКупона = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупона;
						НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВВалютеУчета;
						НовоеДвижениеСписания.ПереоценкаКупонаВСтоимости = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВСтоимости;
						НовоеДвижениеСписания.СтоимостьКупона = СтрокаПартийПроданныхВРЕПО.СтоимостьКупона;
						НовоеДвижениеСписания.СтоимостьКупонаВВалютеУчета = СтрокаПартийПроданныхВРЕПО.СтоимостьКупонаВВалютеУчета;
						
						НовоеДвижениеСписания.ПереоценкаКупонаСНачалаГода = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаСНачалаГода;

						СтрокаПартийПроданныхВРЕПО.СтоимостьКупона = 0;
						СтрокаПартийПроданныхВРЕПО.СтоимостьКупонаВВалютеУчета = 0;
						
						СтрокаПартийПроданныхВРЕПО.ПереоценкаКупона = 0;
						СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВВалютеУчета = 0;
						СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВСтоимости = 0;
						СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаСНачалаГода = 0;
						
						// 5. Если клиент отражает задолженность на счетах учета - добавим начисление задолженности по погашению купона
						Если НастройкиУчетаОбщие.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
						
							НовоеДвижениеНачисленияЗадолженности = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
							//НовоеДвижениеНачисленияЗадолженности.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.НачислениеЗадолженности;
							
							ЗаполнитьЗначенияСвойств(НовоеДвижениеНачисленияЗадолженности, НовоеДвижениеСписания, );
							
							НовоеДвижениеНачисленияЗадолженности.ВидДвижения = Перечисления.ВидыДвижений.Приход;
							
							НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупона = НовоеДвижениеСписания.СтоимостьКупона + НовоеДвижениеСписания.ПереоценкаКупона;
							НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупонаВВалютеУчета = НовоеДвижениеСписания.СтоимостьКупонаВВалютеУчета + НовоеДвижениеСписания.ПереоценкаКупонаВВалютеУчета;
							
							НовоеДвижениеНачисленияЗадолженности.СтоимостьКупона = 0;
							НовоеДвижениеНачисленияЗадолженности.СтоимостьКупонаВВалютеУчета = 0;
							НовоеДвижениеНачисленияЗадолженности.ПереоценкаКупона = 0;
							НовоеДвижениеНачисленияЗадолженности.ПереоценкаКупонаВВалютеУчета = 0;
							НовоеДвижениеНачисленияЗадолженности.ПереоценкаКупонаСНачалаГода = 0;
							
							СтрокаПартийПроданныхВРЕПО.ЗадолженностьПоПогашениюКупона = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупона;
							СтрокаПартийПроданныхВРЕПО.ЗадолженностьПоПогашениюКупонаВВалютеУчета = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюКупонаВВалютеУчета;
						
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Оплата") Тогда
				
				Если НастройкиУчетаОбщие.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов 
					И (ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюКупона
						ИЛИ ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюОблигации) Тогда
					
					ОбщееКоличество = ПриходныеПартии.Итог("Количество");
					
					Если ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюКупона Тогда
						
						ПолеЗадолженностьПоПогашению = "ЗадолженностьПоПогашениюКупона";
						ПолеЗадолженностьПоПогашениюВВалютеУчета = "ЗадолженностьПоПогашениюКупонаВВалютеУчета";
						СуммаОплаты = ВыборкаДетальныеЗаписи.СтоимостьПокупкиКупона;
						
					ИначеЕсли ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюОблигации Тогда
						
						ПолеЗадолженностьПоПогашению = "ЗадолженностьПоПогашениюТела";
						ПолеЗадолженностьПоПогашениюВВалютеУчета = "ЗадолженностьПоПогашениюТелаВВалютеУчета";
						СуммаОплаты = ВыборкаДетальныеЗаписи.СтоимостьПокупки;
						
					КонецЕсли;
					
					ОбщаяЗадолженностьПоПогашению = ПриходныеПартии.Итог(ПолеЗадолженностьПоПогашению);
					ОбщаяЗадолженностьПоПогашениюВВалютеУчета = ПриходныеПартии.Итог(ПолеЗадолженностьПоПогашениюВВалютеУчета);
					
					//если пришла оплата по купону, а задолженности нет, то это просроченная задолженность!
					//задолженность может и быть, но ее просто не хватает - в данном случае не трогаем ее, а списываем просрочку
					ЗадолженностиХватает = Истина;
					Если ВыборкаДетальныеЗаписи.ВалютаОплаты = ВалютаУчета Тогда
						ЗадолженностиХватает = (ОбщаяЗадолженностьПоПогашениюВВалютеУчета >= СуммаОплаты);
					Иначе
						ЗадолженностиХватает = (ОбщаяЗадолженностьПоПогашению >= СуммаОплаты);
					КонецЕсли;
					
					Если НЕ ЗадолженностиХватает
						И ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюКупона
						И ПриходныеПартии.Итог("ПогашениеКупонаНеИсполненноеВСрок") >= СуммаОплаты Тогда // проверим, что она есть и ее больше или столько же, сколько пришло по оплате
					
						ПолеЗадолженностьПоПогашению = "ПогашениеКупонаНеИсполненноеВСрок";
						ПолеЗадолженностьПоПогашениюВВалютеУчета = "ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета";
						
						ОбщаяЗадолженностьПоПогашению = ПриходныеПартии.Итог(ПолеЗадолженностьПоПогашению);
						ОбщаяЗадолженностьПоПогашениюВВалютеУчета = ПриходныеПартии.Итог(ПолеЗадолженностьПоПогашениюВВалютеУчета);
						
					КонецЕсли;
					
					Если ОбщаяЗадолженностьПоПогашению <= СуммаОплаты Тогда // ситуации: сколько гасили столько и пришло; пришло больше чем гасили - значит часть партий успели продать
						ДоляОплаты = 1;
						РаспределитьЗадолженностьПоПогашению = ОбщаяЗадолженностьПоПогашению;
						РаспределитьЗадолженностьПоПогашениюВВалютеУчета = ОбщаяЗадолженностьПоПогашениюВВалютеУчета;
					Иначе
						ДоляОплаты = СуммаОплаты / ОбщаяЗадолженностьПоПогашению;
						РаспределитьЗадолженностьПоПогашению = Окр(ОбщаяЗадолженностьПоПогашению * ДоляОплаты, 2);
						РаспределитьЗадолженностьПоПогашениюВВалютеУчета = Окр(ОбщаяЗадолженностьПоПогашениюВВалютеУчета * ДоляОплаты, 2);
					КонецЕсли;
					
					Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
					
						НовоеДвижениеСписания = ЭтотОбъект.РассчитанныеПартии.Добавить();
						//НовоеДвижениеСписания.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеЗадолженности;
						
						НовоеДвижениеСписания.ЦеннаяБумага 		= СтрокаПриходныхПартий.ЦеннаяБумага;
						НовоеДвижениеСписания.УчетныйАктивЕПС 	= СтрокаПриходныхПартий.УчетныйАктивЕПС;
						НовоеДвижениеСписания.Партия	 		= СтрокаПриходныхПартий.Партия;
						НовоеДвижениеСписания.СтрокаПартии 		= СтрокаПриходныхПартий.СтрокаПартии;
						НовоеДвижениеСписания.Рынок 			= СтрокаПриходныхПартий.Рынок;
						
						НовоеДвижениеСписания.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижениеСписания.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижениеСписания.Период 	  = ВыборкаДетальныеЗаписи.Период;
						
						НовоеДвижениеСписания.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						НовоеДвижениеСписания[ПолеЗадолженностьПоПогашению] = Окр(СтрокаПриходныхПартий[ПолеЗадолженностьПоПогашению] * ДоляОплаты, 2);
						НовоеДвижениеСписания[ПолеЗадолженностьПоПогашениюВВалютеУчета] = Окр(СтрокаПриходныхПартий[ПолеЗадолженностьПоПогашениюВВалютеУчета] * ДоляОплаты, 2);
						
						ОбщееКоличество = ОбщееКоличество - СтрокаПриходныхПартий.Количество;
						РаспределитьЗадолженностьПоПогашению = РаспределитьЗадолженностьПоПогашению - НовоеДвижениеСписания[ПолеЗадолженностьПоПогашению];
						РаспределитьЗадолженностьПоПогашениюВВалютеУчета = РаспределитьЗадолженностьПоПогашениюВВалютеУчета - НовоеДвижениеСписания[ПолеЗадолженностьПоПогашениюВВалютеУчета];
						
						Если ОбщееКоличество = 0 
							И (РаспределитьЗадолженностьПоПогашению <> 0 
								ИЛИ  РаспределитьЗадолженностьПоПогашениюВВалютеУчета <> 0) Тогда // погрешность на последнюю строку для задолженности это не критично
						
							НовоеДвижениеСписания[ПолеЗадолженностьПоПогашению] = НовоеДвижениеСписания[ПолеЗадолженностьПоПогашению] + РаспределитьЗадолженностьПоПогашению;
							НовоеДвижениеСписания[ПолеЗадолженностьПоПогашениюВВалютеУчета] = НовоеДвижениеСписания[ПолеЗадолженностьПоПогашениюВВалютеУчета] + РаспределитьЗадолженностьПоПогашениюВВалютеУчета;
						
						КонецЕсли;
						
						СтрокаПриходныхПартий[ПолеЗадолженностьПоПогашению] = СтрокаПриходныхПартий[ПолеЗадолженностьПоПогашению] - НовоеДвижениеСписания[ПолеЗадолженностьПоПогашению];
						СтрокаПриходныхПартий[ПолеЗадолженностьПоПогашениюВВалютеУчета] = СтрокаПриходныхПартий[ПолеЗадолженностьПоПогашениюВВалютеУчета] - НовоеДвижениеСписания[ПолеЗадолженностьПоПогашениюВВалютеУчета];
						
					КонецЦикла;
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации
					И НЕ НастройкиУчетаОбщие.СписыватьПриПолномПогашенииВМоментПогашения Тогда // эти списывают при погашении
					
					// для валютных бумаг может вылезти погрешность для сумм в валюте учета
					// хорошо, что их всего 4: стоимость, дисконт/премия, УНКД и ННКД (все остальное должно быть списано)
					// учтем эти погрешности
					ДелаемПерекурсовку = ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки = 0;
					
					Если ДелаемПерекурсовку Тогда
						
						КоличествоИтог = ПриходныеПартии.Итог("Количество");
						
						СтоимостьИтог = ПриходныеПартии.Итог("Стоимость");
						ДисконтПремияНачисленныйИтог = ПриходныеПартии.Итог("ДисконтПремияНачисленный");
						СтоимостьКупонаИтог = ПриходныеПартии.Итог("СтоимостьКупона");
						ПереоценкаКупонаИтог = ПриходныеПартии.Итог("ПереоценкаКупона");
						
						ИтогиВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
							Новый Структура("Стоимость,ДисконтПремияНачисленный,СтоимостьКупона,ПереоценкаКупона", СтоимостьИтог, ДисконтПремияНачисленныйИтог, СтоимостьКупонаИтог, ПереоценкаКупонаИтог),
							ДанныеПоЦеннойБумаге.ВалютаНоминала,
							ЭтотОбъект.Организация,
							ВыборкаДетальныеЗаписи.Период,
							Неопределено,
							Отказ);
						
					КонецЕсли;
					
					// спишем все суммы с приходных партий
					Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
						
						НовоеДвижениеПерекурсовка = Неопределено;
						Если ДелаемПерекурсовку Тогда
							НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
							
							ИтогиВВалютеУчета.Стоимость = ИтогиВВалютеУчета.Стоимость - СтрокаПриходныхПартий.СтоимостьВВалютеУчета;
							ИтогиВВалютеУчета.ДисконтПремияНачисленный = ИтогиВВалютеУчета.ДисконтПремияНачисленный - СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета;
							ИтогиВВалютеУчета.СтоимостьКупона = ИтогиВВалютеУчета.СтоимостьКупона - СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета;
							ИтогиВВалютеУчета.ПереоценкаКупона = ИтогиВВалютеУчета.ПереоценкаКупона - СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета;
							
							КоличествоИтог = КоличествоИтог - СтрокаПриходныхПартий.Количество;
							
							Если КоличествоИтог = 0 Тогда // отправим погрешности округления на последнюю строку
								НовоеДвижениеПерекурсовка.СтоимостьВВалютеУчета					= НовоеДвижениеПерекурсовка.СтоимостьВВалютеУчета					+ ИтогиВВалютеУчета.Стоимость;
								НовоеДвижениеПерекурсовка.ДисконтПремияНачисленныйВВалютеУчета	= НовоеДвижениеПерекурсовка.ДисконтПремияНачисленныйВВалютеУчета	+ ИтогиВВалютеУчета.ДисконтПремияНачисленный;
								НовоеДвижениеПерекурсовка.СтоимостьКупонаВВалютеУчета			= НовоеДвижениеПерекурсовка.СтоимостьКупонаВВалютеУчета				+ ИтогиВВалютеУчета.СтоимостьКупона;
								НовоеДвижениеПерекурсовка.ПереоценкаКупонаВВалютеУчета			= НовоеДвижениеПерекурсовка.ПереоценкаКупонаВВалютеУчета			+ ИтогиВВалютеУчета.ПереоценкаКупона;
								
								СтрокаПриходныхПартий.СтоимостьВВалютеУчета					= СтрокаПриходныхПартий.СтоимостьВВалютеУчета					+ ИтогиВВалютеУчета.Стоимость;
								СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета	= СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета	+ ИтогиВВалютеУчета.ДисконтПремияНачисленный;
								СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета			= СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета				+ ИтогиВВалютеУчета.СтоимостьКупона;
								СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета			= СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета			+ ИтогиВВалютеУчета.ПереоценкаКупона;
							КонецЕсли;
							
						КонецЕсли;
						
						// если они есть, эти суммы
						ЕстьЧтоСписывать = Ложь;
						
						СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
						Для каждого СуммовоеПоле Из СуммовыеПоля Цикл
							ИмяПоля = СуммовоеПоле.Ключ;
							СуммовыеПоля[ИмяПоля] = 0;
							Если СтрокаПриходныхПартий[ИмяПоля] <> 0 Тогда
								ЕстьЧтоСписывать = Истина;
								СуммовыеПоля[ИмяПоля] = СтрокаПриходныхПартий[ИмяПоля];
								СтрокаПриходныхПартий[ИмяПоля] = 0;
							КонецЕсли;
						КонецЦикла;
						
						Если ЕстьЧтоСписывать Тогда
						
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
							
							НовоеДвижение.ЦеннаяБумага 		= СтрокаПриходныхПартий.ЦеннаяБумага;
							НовоеДвижение.УчетныйАктивЕПС 	= СтрокаПриходныхПартий.УчетныйАктивЕПС;
							НовоеДвижение.Партия	 		= СтрокаПриходныхПартий.Партия;
							НовоеДвижение.СтрокаПартии 		= СтрокаПриходныхПартий.СтрокаПартии;
							НовоеДвижение.Рынок 			= СтрокаПриходныхПартий.Рынок;
							
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СуммовыеПоля);
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						КонецЕсли;
					
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") И ДанныеПоЦеннойБумаге.ЭтоПай Тогда
				
				// паи по списанию
				Продолжить;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги") И ДанныеПоЦеннойБумаге.ЭтоПай Тогда
				
				// т.к. по погашению паев вообще говоря не предполагается распределение по Активам ЕПС
				// то списываем приходные партии подряд
				
				КоличествоКСписанию = ВыборкаДетальныеЗаписи.Количество;
				ПриходныеПартииКУдалению = Новый Массив;
				
				Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
					
					Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
						КоличествоКСписаниюПартии = СтрокаПриходныхПартий.Количество;
					Иначе
						КоличествоКСписаниюПартии = КоличествоКСписанию;
					КонецЕсли;
					
					Если РассчитыватьСтоимости Тогда
					
						НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, КоличествоКСписаниюПартии, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
					
					КонецЕсли;
						
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
					
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
					
					Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
						
						КоличествоКСписанию = КоличествоКСписанию - СтрокаПриходныхПартий.Количество;
						ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий); // списали её всю
						
					Иначе //спишем пропорционально
						
						КоэффициентСписания = КоличествоКСписанию / СтрокаПриходныхПартий.Количество;
						
						НовоеДвижение.Количество = КоличествоКСписанию;
						
						Если РассчитыватьСтоимости Тогда
						
							НовоеДвижение.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания;
							
							НовоеДвижение.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания;
							НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета * КоэффициентСписания;
							НовоеДвижение.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания;
							НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета * КоэффициентСписания;
							НовоеДвижение.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода * КоэффициентСписания;
							НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная * КоэффициентСписания;
							НовоеДвижение.КурсовыеРазницыСНачалаГода = СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода * КоэффициентСписания;
							
							
							СтрокаПриходныхПартий.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
							
							СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
							СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
							СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
							СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета - НовоеДвижение.ПереоценкаВВалютеУчета;
							СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода - НовоеДвижение.ПереоценкаСНачалаГода;
							СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная - НовоеДвижение.ПереоценкаСНачалаГодаПоложительная;
							СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода = СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода - НовоеДвижение.КурсовыеРазницыСНачалаГода;
							
						КонецЕсли;
						
						СтрокаПриходныхПартий.Количество = СтрокаПриходныхПартий.Количество - НовоеДвижение.Количество;
						
						КоличествоКСписанию = 0;
					
					КонецЕсли;
					
					Если КоличествоКСписанию = 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если КоличествоКСписанию > 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не распределилась:" + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " по " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
					Сообщить(КоличествоКСписанию);
					Отказ = Истина;
				КонецЕсли;
				
				УдалялиПриходныеПартии = Ложь;
				Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
					ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
					УдалялиПриходныеПартии = Истина;
				КонецЦикла;
				
				Если УдалялиПриходныеПартии Тогда
					ПриходныеПартииКоличество = ПриходныеПартии.Количество();
					Для Инд = 1 По ПриходныеПартииКоличество Цикл
						ПриходныеПартии[Инд - 1].НомерСтроки = Инд;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги") 
				И НастройкиУчетаОбщие.СписыватьПриПолномПогашенииВМоментПогашения
				И ВыборкаДетальныеЗаписи.Период < БухгалтерскийУчетПовтИсп.ДатаСКоторойПерестаемСписыватьКоличествоВМоментПолногоПогашения() Тогда
				
				// ничего делать не надо - все списало погашение
				Продолжить;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги") 
				ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СнятиеЦеннойБумагиСУчета")
				ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету") Тогда
				
				ПриходныеПартииКУдалению = Новый Массив;
				
				Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
					
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету") Тогда
						НовоеДвижение.Количество = 0; // выбытие количество не списывает
						
						СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы); // обнулим остаток на партии
						Для каждого СуммовоеПоле Из СуммовыеПоля Цикл
							ИмяПоля = СуммовоеПоле.Ключ;
							СтрокаПриходныхПартий[ИмяПоля] = 0;
						КонецЦикла;
						
					Иначе
						ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий); // все, кроме выбытия убивают партию
					КонецЕсли;
					
				КонецЦикла;
				
				УдалялиПриходныеПартии = Ложь;
				Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
					ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
					УдалялиПриходныеПартии = Истина;
				КонецЦикла;
				
				Если УдалялиПриходныеПартии Тогда
					ПриходныеПартииКоличество = ПриходныеПартии.Количество();
					Для Инд = 1 По ПриходныеПартииКоличество Цикл
						ПриходныеПартии[Инд - 1].НомерСтроки = Инд;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") И ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
				
				Если РассчитыватьСтоимости // #430408 при настройке СписыватьПриПолномПогашенииВМоментПогашения и полном погашении (оферте) списываем количество, поэтому при этих условиях в количественный расчет погашение должно попасть
					ИЛИ НастройкиУчетаОбщие.СписыватьПриПолномПогашенииВМоментПогашения И ВыборкаДетальныеЗаписи.ВидПогашения <> Перечисления.ВидыПогашения.ЧастичноеПогашение Тогда
					
					// для бумаг по АС берем данные по начальным дисконту/премии из первички (#404807)
					// это связано с тем, что у них комиссия идет в стоимость и требуется точность, большая чем может обеспечить ресурс ДисконтПремияПокупки
					// #436580 - для организации ДК сделано упрощение расчетов
					ИспользоватьПервичныеДанныеДляОпределенияЦеныПриобретения = (ПриходныеПартии.Найти(Истина, "ВключатьРасходыПоПокупкеВСтоимость") <> Неопределено) И НЕ Организация_ДК;
					
					Если ИспользоватьПервичныеДанныеДляОпределенияЦеныПриобретения Тогда
						ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ПриходныеПартии, СчетДоверительногоУправленияДляУчета, ВыборкаДетальныеЗаписи.Период).Выгрузить();
					Иначе 
						ДатыИЦеныПокупки = Неопределено;
					КонецЕсли;
					
					Если ВыборкаДетальныеЗаписи.ВидПогашения = Перечисления.ВидыПогашения.ЧастичноеПогашение Тогда
						
						ЦенаПогашенияКупона = ОпределитьСтоимостьКупонаВМоментАмортизации(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период);
						Если ЦенаПогашенияКупона = 0 Тогда //в этот день не было погашения купона - начисляем процентные доходы
							СуммаКупонаНаОднуОблигацию = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, СчетДоверительногоУправленияДляУчета);
						Иначе
							СуммаКупонаНаОднуОблигацию = ЦенаПогашенияКупона;
						КонецЕсли;
						
						//ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ПриходныеПартии, СчетДоверительногоУправленияДляУчета, ВыборкаДетальныеЗаписи.Период).Выгрузить();
						
						СуммаСписанияНаОднуОблигацию = СуммаИзмененияНоминала(ВыборкаДетальныеЗаписи.Период, ВыборкаДетальныеЗаписи.ЦеннаяБумага);
						
						Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл 
							
							НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
								НастройкиУчетаОбщие,
								СтрокаПриходныхПартий.ЦеннаяБумага,
								СтрокаПриходныхПартий.УчетныйАктивЕПС,
								СтрокаПриходныхПартий.Партия,
								СтрокаПриходныхПартий.СтрокаПартии);
							
							НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
							
							// Обычно в день частичного погашения проходит ПогашениеКупона
							// поэтому ничего не делаем, но иногда бывает опс и погашения не было
							// погашения купона не было - нужно все дооценить и отдисконтировать
							//
							// Для всех приходных партий:
							// Если погашения не было
								// 1. Дооценим купон
								// 2. Начислим дисконт/премию
								// 3. Начислим корректировку по ЭСП
							// КонецЕсли
							// Теперь спишем часть тела, и при необходимости кусок дисконта 
							
							Если ЦенаПогашенияКупона = 0 Тогда 
								
								// 1. Дооценим купон
								НовоеДвижение = ДоначислитьКупон(ВыборкаДетальныеЗаписи.Регистратор, 
																		ВыборкаДетальныеЗаписи.Период, 
																		СтрокаПриходныхПартий,
																		СуммаКупонаНаОднуОблигацию,
																		СтрокаПриходныхПартий.Количество,
																		ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки,
																		0,
																		Ложь,
																		Отказ);
								//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
																		
								СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона + НовоеДвижение.ПереоценкаКупона;
								СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
								
								// 2. Начислим дисконт/премию
								ДатаПокупки	= СтрокаПриходныхПартий.ДатаПокупки;
								ДатаПокупкиНачальная	= СтрокаПриходныхПартий.ДатаПокупкиНачальная;
								КорректировкаЭСПНачальная = СтрокаПриходныхПартий.КорректировкаЭСПНачальная;
								ЦенаПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная / СтрокаПриходныхПартий.Количество;
								
								Если ДатыИЦеныПокупки = Неопределено Тогда
									
									НачальныйДисконт  = Окр(СтрокаПриходныхПартий.ДисконтПремияПокупки / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
									
									Если ДанныеПоЦеннойБумаге.Амортизационная Тогда
										ЦенаПокупки	= Справочники.Облигации.ПолучитьНоминал(СтрокаПриходныхПартий.ЦеннаяБумага, ДатаПокупки) + НачальныйДисконт;
									Иначе
										ЦенаПокупки	= СтрокаПриходныхПартий.Номинал + НачальныйДисконт;
									КонецЕсли;
									ЦенаПокупкиКупона	= Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
									
								Иначе
									
									ДатаИЦенаПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаПриходныхПартий.НомерСтроки));
									
									НачальныйДисконт 	= ДатаИЦенаПокупки[0].НачальныйДисконт;
									ЦенаПокупки 		= ДатаИЦенаПокупки[0].ЦенаПокупки;
									ЦенаПокупкиКупона 	= ДатаИЦенаПокупки[0].ЦенаКупона;
									
								КонецЕсли;
								
								ДанныеПереоценки = Новый Структура("Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
								ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаПриходныхПартий, "Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
								ДанныеПереоценки.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДетальныеЗаписи.Период));
								ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", 0);
								ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаПриходныхПартий.ДисконтПремияНачисленный);
								ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
								ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
								ДанныеПереоценки.Вставить("Стоимость", СтрокаПриходныхПартий.Стоимость);
								
								ДанныеПокупки = Новый Структура;
								ДанныеПокупки.Вставить("НачальныйДисконт", НачальныйДисконт);
								ДанныеПокупки.Вставить("ДатаПокупки", ДатаПокупки);
								ДанныеПокупки.Вставить("ДатаПокупкиНачальная", ДатаПокупкиНачальная);
								ДанныеПокупки.Вставить("КорректировкаЭСПНачальная", КорректировкаЭСПНачальная);
								ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаПокупки);
								ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная / СтрокаПриходныхПартий.Количество);
								ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
								ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", ЦенаПокупкиНачальная);

								ДисконтИКорректировкаЭСП = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(СтрокаПриходныхПартий.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);
								
								Если ДисконтИКорректировкаЭСП = Неопределено Тогда
									Возврат;
								КонецЕсли;
								
								Если ЭтоКлиентЮгория ИЛИ (НачальныйДисконт > 0 И СтрокаПриходныхПартий.ДисконтПремияНачисленный < ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия) Тогда 
								    //Купили с премией, а новая премия вдруг оказалась больше
									НовоеДвижение.ДисконтПремияНачисленный = 0; // ничего не делаем
									НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = 0;
								Иначе
									НовоеДвижение.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия - СтрокаПриходныхПартий.ДисконтПремияНачисленный;
									СтрокаПриходныхПартий.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия;
									
									КурсНачисленияДисконтаПремии = Неопределено; // по умолчанию курс - текущий
									Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
										КурсНачисленияДисконтаПремии = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
									КонецЕсли;
									
									СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
											Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.ДисконтПремияНачисленный, СтрокаПриходныхПартий.ДисконтПремияНачисленный), 
											ДанныеПоЦеннойБумаге.ВалютаНоминала,
											ЭтотОбъект.Организация,
											ВыборкаДетальныеЗаписи.Период,
											КурсНачисленияДисконтаПремии,
											Отказ);
									
									НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
									СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета = СуммыВВалютеУчета.СуммаОстаток;
									
								КонецЕсли;
								
								
								// 3. Начислим корректировку по ЭСП
								Если НастройкиДляУчетаКорректировкиЭСП.Найти(НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода) <> Неопределено И НЕ ЭтоКлиентЮгория Тогда
									
									НовоеДвижение.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП - СтрокаПриходныхПартий.КорректировкаЭСП;
									СтрокаПриходныхПартий.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП;
									
									КурсНачисленияКорректировкиЭСП = Неопределено; // по умолчанию курс - текущий
									Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
										КурсНачисленияКорректировкиЭСП = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
									КонецЕсли;
									
									СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
											Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.КорректировкаЭСП, СтрокаПриходныхПартий.КорректировкаЭСП), 
											ДанныеПоЦеннойБумаге.ВалютаНоминала,
											ЭтотОбъект.Организация,
											ВыборкаДетальныеЗаписи.Период,
											КурсНачисленияКорректировкиЭСП,
											Отказ);
									
									НовоеДвижение.КорректировкаЭСПВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
									СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета = СуммыВВалютеУчета.СуммаОстаток;
									
								КонецЕсли;
								
								НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
								НовоеДвижение.КорректировкаЭСПСНачалаГода = НовоеДвижение.КорректировкаЭСПВВалютеУчета;
								НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода = НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
								
								
								СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода + НовоеДвижение.ПереоценкаКупонаСНачалаГода;
								СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода = СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода + НовоеДвижение.КорректировкаЭСПСНачалаГода; 
								СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода = СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода + НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
						        							
							КонецЕсли;
							
							
							// Теперь спишем часть тела, и при необходимости кусок дисконта 
							Если (СтрокаПриходныхПартий.ДисконтПремия >= 0)
								ИЛИ (НастройкиУчетаЦеннойБумаги.СтоимостьТелаРавнаНоминалу И СтрокаПриходныхПартий.ДисконтПремия < 0) Тогда 
								
								// купили с премией/по номиналу или купили с дисконтом но считаем его с минусом - все списываем с тела
								СуммаСписанияТела = СуммаСписанияНаОднуОблигацию * СтрокаПриходныхПартий.Количество;
								СуммаСписанияДисконта = 0;
								
							Иначе // купили с дисконтом - часть с тела, а часть с дисконта - считаем по ЭСП
								
								ДатаПокупки	= СтрокаПриходныхПартий.ДатаПокупки;
								ДатаПокупкиНачальная	= СтрокаПриходныхПартий.ДатаПокупкиНачальная;
								КорректировкаЭСПНачальная = СтрокаПриходныхПартий.КорректировкаЭСПНачальная;
								ЦенаПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная / СтрокаПриходныхПартий.Количество;
								
								//ДатаПокупки 			= БухгалтерскийУчетЕПС.ОпределитьДатуПокупкиПартии(СтрокаПриходныхПартий.Партия, СтрокаПриходныхПартий.СтрокаПартии, , МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ);
								ЦенаПокупки 			= СтрокаПриходныхПартий.СтоимостьПокупки / СтрокаПриходныхПартий.Количество;
								ТелоКСписанию 			= ОпределитьСуммуСписанияТелаПриАмортизации(СтрокаПриходныхПартий.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, ДатаПокупкиНачальная, ЦенаПокупкиНачальная, СтрокаПриходныхПартий.ДисконтПремияНачисленный / СтрокаПриходныхПартий.Количество, НастройкиУчетаЦеннойБумаги);
								//ТелоКСписанию 			= ОпределитьСуммуСписанияТелаПриАмортизации(СтрокаПриходныхПартий.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, ДатаПокупки, ЦенаПокупки, СтрокаПриходныхПартий.ДисконтПремияНачисленный / СтрокаПриходныхПартий.Количество, НастройкиУчетаЦеннойБумаги);
								СуммаСписанияТела 		= Окр(ТелоКСписанию * СтрокаПриходныхПартий.Количество, 2);
								СуммаСписанияДисконта 	= СуммаСписанияНаОднуОблигацию * СтрокаПриходныхПартий.Количество - СуммаСписанияТела;
								
								НовоеСписание = СписанияДисконтов.Добавить();
								
								НовоеСписание.Дата 		= НачалоДня(ВыборкаДетальныеЗаписи.Период);
								НовоеСписание.Партия 	= СтрокаПриходныхПартий.Партия;
								НовоеСписание.Сумма 	= СуммаСписанияДисконта;
								
							КонецЕсли;
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.Амортизация;
							
							НовоеДвижение.ЦеннаяБумага 		= СтрокаПриходныхПартий.ЦеннаяБумага;
							НовоеДвижение.УчетныйАктивЕПС 	= СтрокаПриходныхПартий.УчетныйАктивЕПС;
							НовоеДвижение.Партия 			= СтрокаПриходныхПартий.Партия;
							НовоеДвижение.СтрокаПартии 		= СтрокаПриходныхПартий.СтрокаПартии;
							НовоеДвижение.Рынок 			= СтрокаПриходныхПартий.Рынок;
							
							НовоеДвижение.ВидДвижения 	= Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор 	= ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период 		= ВыборкаДетальныеЗаписи.Период;
							
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							НовоеДвижение.Стоимость 							= СуммаСписанияТела;
							НовоеДвижение.СтоимостьВВалютеУчета					= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.Стоимость, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
							НовоеДвижение.ДисконтПремияНачисленный 				= СуммаСписанияДисконта;
							НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета	= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.ДисконтПремияНачисленный, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
							НовоеДвижение.ДисконтПремия			 				= -СуммаСписанияДисконта;
							ОстатокПослеСписанияДисконта 						= СтрокаПриходныхПартий.ДисконтПремияНачисленный - СуммаСписанияДисконта;
							ОстатокПослеСписанияДисконтаВВалютеУчета			= СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета - НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
							
							
							//Если после списания суммы с дисконтапремии начисленной сумма стала меньше, чем сумма, начисленная за этот год, значит списали и дисконтпремию начисленную за этот год
							Если ОстатокПослеСписанияДисконта < 0 И НЕ НастройкиУчетаЦеннойБумаги.СтоимостьТелаРавнаНоминалу Тогда
								//Такая ошибка возникает когда мы купили облигацию с амортизацией номинала с дисконтом
								//и при частичном погашении номинала часть стоимости должна списаться с тела, а часть с дисконта
								//суммы списания рассчитываются в зависимости от методик и если возникает ситуация, когда с дисконта
								//нужно списать какую-то сумму, а на дисконте начислено меньше и после списания он уйдет в минус
								//то в этом случае расчет партий выдает такую ошибку
								//Но у УГМК "СтоимостьТелаРавнаНоминалу" = "Да"
								//Это значит, что при покупке с дисконтом мы отражаем на теле всю сумму номинала
								//А на дисконте отражаем отрицательное значение
								//При этой схеме всегда идет линейное начисление дисконта, без каких-то расчетов и списаний при амортизациях
								//Вся сумма амортизации уходит с тела
								//Поэтому, достаточно лишь отключить проверку ухода дисконта в минус (он и так всегда в минусах)  при частичном погашении облигации
								//Видимо, раньше таких ситуаций у УГМК не возникало
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При частичном погашении облигации " + СтрокаПриходныхПартий.ЦеннаяБумага + " по партии " + СтрокаПриходныхПартий.Партия + "/"  + СокрЛП(СтрокаПриходныхПартий.СтрокаПартии) + " сумма списания дисконта больше дисконта/премии начисл.", ВыборкаДетальныеЗаписи.Регистратор,,,Отказ);
							КонецЕсли; 
							НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода 			= ?(ОстатокПослеСписанияДисконтаВВалютеУчета < СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода, СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода - ОстатокПослеСписанияДисконтаВВалютеУчета, 0);				
							
							СтрокаПриходныхПартий.ДисконтПремияНачисленный 				= СтрокаПриходныхПартий.ДисконтПремияНачисленный - НовоеДвижение.ДисконтПремияНачисленный;
							СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета	= СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета - НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
							СтрокаПриходныхПартий.Стоимость 							= СтрокаПриходныхПартий.Стоимость - СуммаСписанияТела;
							СтрокаПриходныхПартий.СтоимостьВВалютеУчета					= СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
							СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода 	= СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода - НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
							
							
							// 4. Если клиент отражает задолженность на счетах учета - добавим начисление задолженности по погашению тела
							Если НастройкиУчетаОбщие.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
							
								НовоеДвижениеНачисленияЗадолженности = ЭтотОбъект.РассчитанныеПартии.Добавить();
								//НовоеДвижениеНачисленияЗадолженности.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.НачислениеЗадолженности;
								
								ЗаполнитьЗначенияСвойств(НовоеДвижениеНачисленияЗадолженности, НовоеДвижение, );
								
								НовоеДвижениеНачисленияЗадолженности.ВидДвижения = Перечисления.ВидыДвижений.Приход;
								
								СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
								Для каждого СуммовоеПоле Из СуммовыеПоля Цикл
									ИмяПоля = СуммовоеПоле.Ключ;
									НовоеДвижениеНачисленияЗадолженности[ИмяПоля] = 0;
								КонецЦикла;
								
								НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТела = НовоеДвижение.Стоимость + НовоеДвижение.ДисконтПремияНачисленный;
								НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТелаВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
								
								СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТела = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТела;
								СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТелаВВалютеУчета = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТелаВВалютеУчета;
							
							КонецЕсли;
							
						КонецЦикла;

						Для каждого СтрокаПартийПроданныхВРЕПО Из ПартииПроданныеВРЕПО Цикл 
							
							Если СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага <> ВыборкаДетальныеЗаписи.ЦеннаяБумага Тогда
								Продолжить;
							КонецЕсли;
							
							НовоеДвижениеПерекурсовка = Перекурсовка(
								ВыборкаДетальныеЗаписи.Регистратор,
								ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО,
								ВыборкаДетальныеЗаписи.Период,
								СтрокаПартийПроданныхВРЕПО,
								СтрокаПартийПроданныхВРЕПО.Количество,
								ВыборкаДетальныеЗаписи.СтрокаПартии,
								,
								,
								,
								Отказ);
							
							// Обычно в день частичного погашения проходит ПогашениеКупона
							// поэтому ничего не делаем, но иногда бывает опс и погашения не было
							// погашения купона не было - нужно все дооценить и отдисконтировать
							//
							// Для всех приходных партий:
							// Если погашения не было
								// 1. Дооценим купон
								// 2. Начислим дисконт/премию
								// 3. Начислим корректировку по ЭСП
							// КонецЕсли
							// Теперь спишем часть тела, и при необходимости кусок дисконта 
							
							Если ЦенаПогашенияКупона = 0 Тогда 
								
								// 1. Дооценим купон
								НовоеДвижение = ДоначислитьКупонРЕПО(
									ВыборкаДетальныеЗаписи.Регистратор, 
									ВыборкаДетальныеЗаписи.Период,
									ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО,
									СтрокаПартийПроданныхВРЕПО,
									СуммаКупонаНаОднуОблигацию,
									СтрокаПартийПроданныхВРЕПО.Количество,
									0,
									Отказ);
								
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
																		
								СтрокаПартийПроданныхВРЕПО.ПереоценкаКупона = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупона + НовоеДвижение.ПереоценкаКупона;
								СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВВалютеУчета = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
								
								// 2. Начислим дисконт/премию
								ДатаПокупки	= СтрокаПартийПроданныхВРЕПО.ДатаПокупки;
								ДатаПокупкиНачальная	= СтрокаПартийПроданныхВРЕПО.ДатаПокупкиНачальная;
								КорректировкаЭСПНачальная = СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПНачальная;
								ЦенаПокупкиНачальная = СтрокаПартийПроданныхВРЕПО.СтоимостьПокупкиНачальная / СтрокаПартийПроданныхВРЕПО.Количество;
								
								НачальныйДисконт  = Окр(СтрокаПартийПроданныхВРЕПО.ДисконтПремияПокупки / СтрокаПартийПроданныхВРЕПО.Количество, РазрядностьДробнойЧасти);
								
								Если ДанныеПоЦеннойБумаге.Амортизационная Тогда
									ЦенаПокупки	= Справочники.Облигации.ПолучитьНоминал(СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага, ДатаПокупки) + НачальныйДисконт;
								Иначе
									ЦенаПокупки	= СтрокаПартийПроданныхВРЕПО.Номинал + НачальныйДисконт;
								КонецЕсли;
								ЦенаПокупкиКупона	= Окр(СтрокаПартийПроданныхВРЕПО.СтоимостьПокупкиКупона / СтрокаПартийПроданныхВРЕПО.Количество, РазрядностьДробнойЧасти);
									
								ДанныеПереоценки = Новый Структура("Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
								ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаПартийПроданныхВРЕПО, "Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
								ДанныеПереоценки.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДетальныеЗаписи.Период));
								ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", 0);
								ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный);
								ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПартийПроданныхВРЕПО.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
								ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
								ДанныеПереоценки.Вставить("Стоимость", СтрокаПартийПроданныхВРЕПО.Стоимость);
								
								ДанныеПокупки = Новый Структура;
								ДанныеПокупки.Вставить("НачальныйДисконт", НачальныйДисконт);
								ДанныеПокупки.Вставить("ДатаПокупки", ДатаПокупки);
								ДанныеПокупки.Вставить("ДатаПокупкиНачальная", ДатаПокупкиНачальная);
								ДанныеПокупки.Вставить("КорректировкаЭСПНачальная", КорректировкаЭСПНачальная);
								ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаПокупки);
								ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПартийПроданныхВРЕПО.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная / СтрокаПартийПроданныхВРЕПО.Количество);
								ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
								ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", ЦенаПокупкиНачальная);

								ДисконтИКорректировкаЭСП = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаОбщие, Отказ);
								
								Если ДисконтИКорректировкаЭСП = Неопределено Тогда
									Возврат;
								КонецЕсли;
								
								Если НачальныйДисконт > 0 И СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный < ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия Тогда 
								    //Купили с премией, а новая премия вдруг оказалась больше
									НовоеДвижение.ДисконтПремияНачисленный = 0; // ничего не делаем
									НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = 0;
								Иначе
									НовоеДвижение.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия - СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный;
									СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия;
									
									КурсНачисленияДисконтаПремии = Неопределено; // по умолчанию курс - текущий
									Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
										КурсНачисленияДисконтаПремии = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
									КонецЕсли;
									
									СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
											Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.ДисконтПремияНачисленный, СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный), 
											ДанныеПоЦеннойБумаге.ВалютаНоминала,
											ЭтотОбъект.Организация,
											ВыборкаДетальныеЗаписи.Период,
											КурсНачисленияДисконтаПремии,
											Отказ);
									
									НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
									СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйВВалютеУчета = СуммыВВалютеУчета.СуммаОстаток;
									
								КонецЕсли;
								
								
								// 3. Начислим корректировку по ЭСП
								Если НастройкиДляУчетаКорректировкиЭСП.Найти(НастройкиУчетаОбщие.ВариантУчетаКупонногоДохода) <> Неопределено Тогда
									
									НовоеДвижение.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП - СтрокаПартийПроданныхВРЕПО.КорректировкаЭСП;
									СтрокаПартийПроданныхВРЕПО.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП;
									
									КурсНачисленияКорректировкиЭСП = Неопределено; // по умолчанию курс - текущий
									Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
										КурсНачисленияКорректировкиЭСП = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
									КонецЕсли;
									
									СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
											Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.КорректировкаЭСП, СтрокаПартийПроданныхВРЕПО.КорректировкаЭСП), 
											ДанныеПоЦеннойБумаге.ВалютаНоминала,
											ЭтотОбъект.Организация,
											ВыборкаДетальныеЗаписи.Период,
											КурсНачисленияКорректировкиЭСП,
											Отказ);
									
									НовоеДвижение.КорректировкаЭСПВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
									СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПВВалютеУчета = СуммыВВалютеУчета.СуммаОстаток;
									
								КонецЕсли;
								
								НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
								НовоеДвижение.КорректировкаЭСПСНачалаГода = НовоеДвижение.КорректировкаЭСПВВалютеУчета;
								НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода = НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
								
								
								СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаСНачалаГода = СтрокаПартийПроданныхВРЕПО.ПереоценкаКупонаСНачалаГода + НовоеДвижение.ПереоценкаКупонаСНачалаГода;
								СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПСНачалаГода = СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПСНачалаГода + НовоеДвижение.КорректировкаЭСПСНачалаГода; 
								СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода = СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода + НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
						        							
							КонецЕсли;
							
							
							// Теперь спишем часть тела, и при необходимости кусок дисконта 
							Если (СтрокаПартийПроданныхВРЕПО.ДисконтПремия >= 0)
								ИЛИ (НастройкиУчетаЦеннойБумаги.СтоимостьТелаРавнаНоминалу И СтрокаПартийПроданныхВРЕПО.ДисконтПремия < 0) Тогда 
								
								// купили с премией/по номиналу или купили с дисконтом но считаем его с минусом - все списываем с тела
								СуммаСписанияТела = СуммаСписанияНаОднуОблигацию * СтрокаПартийПроданныхВРЕПО.Количество;
								СуммаСписанияДисконта = 0;
								
							Иначе // купили с дисконтом - часть с тела, а часть с дисконта - считаем по ЭСП
								
								ДатаПокупки	= СтрокаПартийПроданныхВРЕПО.ДатаПокупки;
								ДатаПокупкиНачальная	= СтрокаПартийПроданныхВРЕПО.ДатаПокупкиНачальная;
								КорректировкаЭСПНачальная = СтрокаПартийПроданныхВРЕПО.КорректировкаЭСПНачальная;
								ЦенаПокупкиНачальная = СтрокаПартийПроданныхВРЕПО.СтоимостьПокупкиНачальная / СтрокаПартийПроданныхВРЕПО.Количество;
								
								//ДатаПокупки 			= БухгалтерскийУчетЕПС.ОпределитьДатуПокупкиПартии(СтрокаПартийПроданныхВРЕПО.Партия, СтрокаПартийПроданныхВРЕПО.СтрокаПартии, , МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ);
								ЦенаПокупки 			= СтрокаПартийПроданныхВРЕПО.СтоимостьПокупки / СтрокаПартийПроданныхВРЕПО.Количество;
								ТелоКСписанию 			= ОпределитьСуммуСписанияТелаПриАмортизации(СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, ДатаПокупкиНачальная, ЦенаПокупкиНачальная, СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный / СтрокаПартийПроданныхВРЕПО.Количество, НастройкиУчетаЦеннойБумаги);
								//ТелоКСписанию 			= ОпределитьСуммуСписанияТелаПриАмортизации(СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, ДатаПокупки, ЦенаПокупки, СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный / СтрокаПартийПроданныхВРЕПО.Количество, НастройкиУчетаЦеннойБумаги);
								СуммаСписанияТела 		= Окр(ТелоКСписанию * СтрокаПартийПроданныхВРЕПО.Количество, 2);
								СуммаСписанияДисконта 	= СуммаСписанияНаОднуОблигацию * СтрокаПартийПроданныхВРЕПО.Количество - СуммаСписанияТела;
								
								НовоеСписание = СписанияДисконтов.Добавить();
								
								НовоеСписание.Дата 		= НачалоДня(ВыборкаДетальныеЗаписи.Период);
								НовоеСписание.Партия 	= СтрокаПартийПроданныхВРЕПО.Партия;
								НовоеСписание.Сумма 	= СуммаСписанияДисконта;
								
							КонецЕсли;
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.Амортизация;
							
							НовоеДвижение.ЦеннаяБумага 		= СтрокаПартийПроданныхВРЕПО.ЦеннаяБумага;
							НовоеДвижение.УчетныйАктивЕПС 	= СтрокаПартийПроданныхВРЕПО.УчетныйАктивЕПС;
							НовоеДвижение.Партия 			= СтрокаПартийПроданныхВРЕПО.Партия;
							НовоеДвижение.СтрокаПартии 		= СтрокаПартийПроданныхВРЕПО.СтрокаПартии;
							НовоеДвижение.Рынок 			= СтрокаПартийПроданныхВРЕПО.Рынок;
							
							НовоеДвижениеСписания.ПродажаРЕПО 		= СтрокаПартийПроданныхВРЕПО.ПродажаРЕПО;
							НовоеДвижениеСписания.СтрокаПродажиРЕПО	= СтрокаПартийПроданныхВРЕПО.СтрокаПродажиРЕПО;
							
							НовоеДвижение.ВидДвижения 	= Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор 	= ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период 		= ВыборкаДетальныеЗаписи.Период;
							
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							НовоеДвижение.Стоимость 							= СуммаСписанияТела;
							НовоеДвижение.СтоимостьВВалютеУчета					= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.Стоимость, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
							НовоеДвижение.ДисконтПремияНачисленный 				= СуммаСписанияДисконта;
							НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета	= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.ДисконтПремияНачисленный, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
							НовоеДвижение.ДисконтПремия			 				= -СуммаСписанияДисконта;
							
							ОстатокПослеСписанияДисконта 						= СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный - СуммаСписанияДисконта;
							ОстатокПослеСписанияДисконтаВВалютеУчета			= СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйВВалютеУчета - НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
							
							НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода 			= ?(ОстатокПослеСписанияДисконтаВВалютеУчета < СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода, СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода - ОстатокПослеСписанияДисконтаВВалютеУчета, 0);				
							
							СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный 				= СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленный - НовоеДвижение.ДисконтПремияНачисленный;
							СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйВВалютеУчета	= СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйВВалютеУчета - НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
							СтрокаПартийПроданныхВРЕПО.Стоимость 							= СтрокаПартийПроданныхВРЕПО.Стоимость - СуммаСписанияТела;
							СтрокаПартийПроданныхВРЕПО.СтоимостьВВалютеУчета					= СтрокаПартийПроданныхВРЕПО.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
							СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода 	= СтрокаПартийПроданныхВРЕПО.ДисконтПремияНачисленныйСНачалаГода - НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
							
							
							// 4. Если клиент отражает задолженность на счетах учета - добавим начисление задолженности по погашению тела
							Если НастройкиУчетаОбщие.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
							
								НовоеДвижениеНачисленияЗадолженности = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
								//НовоеДвижениеНачисленияЗадолженности.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.НачислениеЗадолженности;
								
								ЗаполнитьЗначенияСвойств(НовоеДвижениеНачисленияЗадолженности, НовоеДвижение, );
								
								НовоеДвижениеНачисленияЗадолженности.ВидДвижения = Перечисления.ВидыДвижений.Приход;
								
								СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
								Для каждого СуммовоеПоле Из СуммовыеПоля Цикл
									ИмяПоля = СуммовоеПоле.Ключ;
									НовоеДвижениеНачисленияЗадолженности[ИмяПоля] = 0;
								КонецЦикла;
								
								НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТела = НовоеДвижение.Стоимость + НовоеДвижение.ДисконтПремияНачисленный;
								НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТелаВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
								
								СтрокаПартийПроданныхВРЕПО.ЗадолженностьПоПогашениюТела = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТела;
								СтрокаПартийПроданныхВРЕПО.ЗадолженностьПоПогашениюТелаВВалютеУчета = НовоеДвижениеНачисленияЗадолженности.ЗадолженностьПоПогашениюТелаВВалютеУчета;
							
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе // полное погашение или оферта
						
						Если РассчитыватьСтоимости Тогда
							
							ОбязательныйРасчетДисконтаПремииДоОферты = Ложь;
							Если ВыборкаДетальныеЗаписи.ВидПогашения = Перечисления.ВидыПогашения.Оферта Тогда
								
								ТипОферты = Справочники.Облигации.ОпределитьТипОферты(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период);
																						
								// Согласно разъяснению ЦБ РФ № 17-2-2-ОЭ/20820 от 22.07.2019 
								// в случае обязательного досрочного погашения необходимо полностью начислить все процентные доходы (дисконты-премию-корректировку)
								Если ТипОферты = Перечисления.ТипыОфертПоОблигациям.Досрочно И ВыборкаДетальныеЗаписи.Период >= '20190722' Тогда
									
									// эта настройка будет обработана в РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания
									// будем считать не до погашения, а до этой обязательной оферты
									ОбязательныйРасчетДисконтаПремииДоОферты = Истина;
								
								КонецЕсли;
							
							КонецЕсли;
							
							
							КурсПерекурсовки = Неопределено;
							
							СуммаНаОднуОблигацию = ВыборкаДетальныеЗаписи.Сумма / ВыборкаДетальныеЗаписи.Количество;
							СуммаКупонаНаОднуОблигацию = ВыборкаДетальныеЗаписи.СуммаКупона / ВыборкаДетальныеЗаписи.Количество;
							
							Если НЕ ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага Тогда // гасим рублевую в рублях - всё хорошо
								СуммаНаОднуОблигациюВВалютеУчета = СуммаНаОднуОблигацию;
								СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
							ИначеЕсли ВыборкаДетальныеЗаписи.ВалютаОплаты = ВалютаУчета Тогда
								// погашение валютной бумаги причем сумма в рублях... маразм, блин!
								СуммаНаОднуОблигациюВВалютеУчета = СуммаНаОднуОблигацию;
								СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
								
								СуммаНаОднуОблигацию = Справочники.Облигации.ПолучитьНоминал(ВыборкаДетальныеЗаписи.ЦеннаяБумага, НачалоДня(ВыборкаДетальныеЗаписи.Период));
								СуммаКупонаНаОднуОблигацию = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, НачалоДня(ВыборкаДетальныеЗаписи.Период), СчетДоверительногоУправленияДляУчета, Истина);
								
								//КурсПерекурсовки = СуммаНаОднуОблигациюВВалютеУчета / СуммаНаОднуОблигацию;
							Иначе
								
								СуммаНаОднуОблигациюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.Сумма, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ) / ВыборкаДетальныеЗаписи.Количество;
								СуммаКупонаНаОднуОблигациюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СуммаКупона, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ) / ВыборкаДетальныеЗаписи.Количество;
								
							КонецЕсли;
							
					       // хардкод для банкрота вейла
					       // с 31.12.2022 у Эволюции купон списан и равен 0, Будущее пока банкроство не признало
					       Если ВыборкаДетальныеЗаписи.Период >= '20221231' И ЭтоКлиентЭволюция Тогда
							   Если ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВейлФинанс") Тогда
								   
									СуммаКупонаНаОднуОблигацию = 0;
									СуммаКупонаНаОднуОблигациюВВалютеУчета = 0;
									
					           КонецЕсли;
					       КонецЕсли;
							
							Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
							
								КурсНачисленияКупона = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки;
								
							ИначеЕсли КурсПерекурсовки <> Неопределено Тогда
								
								КурсНачисленияКупона = КурсПерекурсовки;
								
							Иначе
								
								КурсНачисленияКупона = 0;
							
							КонецЕсли;
						
						КонецЕсли;
						
						Перекурсовывать = Истина;
						Если ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_До2")
							И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20240514' Тогда
						
							Перекурсовывать = Ложь;
						
						КонецЕсли;
						
						ПриходныеПартииКУдалению = Новый Массив;
						
						//Для всех приходных партий:
						// Мы можем гасить по оферте, и купон гасится отдельно, а можем и по конечному погашению, тогда купон вместе 
						// Если конечное погашение
						// 		1. Дооценим купон
						// 		2. Начислим дисконт/премию
						// 		3. Начислим корректировку по ЭСП
						// КонецЕсли
						// 
						Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
							
							НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
								НастройкиУчетаОбщие,
								СтрокаПриходныхПартий.ЦеннаяБумага,
								СтрокаПриходныхПартий.УчетныйАктивЕПС,
								СтрокаПриходныхПартий.Партия,
								СтрокаПриходныхПартий.СтрокаПартии);
							
							Если ОбязательныйРасчетДисконтаПремииДоОферты = Истина Тогда
								НастройкиУчетаЦеннойБумаги.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты;
							КонецЕсли;
							
							Если РассчитыватьСтоимости Тогда
							
								Если Перекурсовывать Тогда
								
									НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии, КурсПерекурсовки,,, Отказ);
								
								КонецЕсли;
								
								Если СуммаКупонаНаОднуОблигацию <> 0 Или НЕ БылоПогашениеКупонаПоБумагеВЭтомПериоде Тогда //если 0 то это оферта и есть погашение купона, оно и начислит
									
									// 1. Дооценим купон
									НовоеДвижение = ДоначислитьКупон(ВыборкаДетальныеЗаписи.Регистратор, 
																			ВыборкаДетальныеЗаписи.Период, 
																			СтрокаПриходныхПартий,
																			СуммаКупонаНаОднуОблигацию,
																			СтрокаПриходныхПартий.Количество,
																			КурсНачисленияКупона,
																			0,
																			Ложь,
																			Отказ);
									//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
									
									СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона + НовоеДвижение.ПереоценкаКупона;
									СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
									
									Если НастройкиУчетаЦеннойБумаги.ПереоцениватьОблигацииПриПолномПогашении 
										И НЕ ДанныеПоЦеннойБумаге.ИндексируемыйНоминал Тогда // у таких облигаций отдельная тема ниже
									
										// Переоценка тела
										НовоеДвижение.Переоценка = -СтрокаПриходныхПартий.Переоценка;
										НовоеДвижение.ПереоценкаВВалютеУчета = -СтрокаПриходныхПартий.ПереоценкаВВалютеУчета;
										НовоеДвижение.ПереоценкаСНачалаГода = НовоеДвижение.ПереоценкаВВалютеУчета;
										Если НовоеДвижение.ПереоценкаВВалютеУчета > 0 Тогда
											НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = НовоеДвижение.ПереоценкаВВалютеУчета;
										КонецЕсли;
										
										СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка + НовоеДвижение.Переоценка;
										СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета + НовоеДвижение.ПереоценкаВВалютеУчета;
										СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода + НовоеДвижение.ПереоценкаСНачалаГода;
										Если НовоеДвижение.ПереоценкаСНачалаГодаПоложительная > 0 Тогда
											СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная + НовоеДвижение.ПереоценкаСНачалаГодаПоложительная;
										КонецЕсли;
									
									КонецЕсли; 
									
									// 2. Начислим дисконт/премию
									ДатаПокупки	= СтрокаПриходныхПартий.ДатаПокупки;
									ДатаПокупкиНачальная	= СтрокаПриходныхПартий.ДатаПокупкиНачальная;
									КорректировкаЭСПНачальная = СтрокаПриходныхПартий.КорректировкаЭСПНачальная;
									ЦенаПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная / СтрокаПриходныхПартий.Количество;
									
									Если ДатыИЦеныПокупки = Неопределено Тогда
										
										НачальныйДисконт  = Окр(СтрокаПриходныхПартий.ДисконтПремияПокупки / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
										
										Если ДанныеПоЦеннойБумаге.Амортизационная Тогда
											ЦенаПокупки	= Справочники.Облигации.ПолучитьНоминал(СтрокаПриходныхПартий.ЦеннаяБумага, ДатаПокупки) + НачальныйДисконт;
										Иначе
											ЦенаПокупки	= СтрокаПриходныхПартий.Номинал + НачальныйДисконт;
										КонецЕсли;
										ЦенаПокупкиКупона	= Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
										
									Иначе
										
										ДатаИЦенаПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаПриходныхПартий.НомерСтроки));
										
										НачальныйДисконт 	= ДатаИЦенаПокупки[0].НачальныйДисконт;
										ЦенаПокупки 		= ДатаИЦенаПокупки[0].ЦенаПокупки;
										ЦенаПокупкиКупона 	= ДатаИЦенаПокупки[0].ЦенаКупона;
										
									КонецЕсли;

									РассчитыватьКорректировкуЭСП = НастройкиДляУчетаКорректировкиЭСП.Найти(НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода) <> Неопределено	// или клиент считает корректировку ЭСП по всем видам активов
																	ИЛИ СтрокаПриходныхПартий.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость;						// или это вид актива, предполагающий расчет корректировки ЭСП
									
									Если РассчитыватьКорректировкуЭСП Тогда
										НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке;	// принудительно посчитать ЭСП
									КонецЕсли; 																	
									
									ДанныеПереоценки = Новый Структура("Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
									ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаПриходныхПартий, "Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
									ДанныеПереоценки.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДетальныеЗаписи.Период));
									ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", 0);
									Если ВыборкаДетальныеЗаписи.ВидПогашения = Перечисления.ВидыПогашения.Оферта	// бумага гасится по оферте
										И РассчитыватьКорректировкуЭСП												// это АС ная бумага и корректировку ЭСП считаем
										И ОпределитьСтоимостьКупонаВМоментАмортизации(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период) = 0 Тогда // И самое важно что гасим НЕ в день окончания купонного периода
									
										ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", СуммаКупонаНаОднуОблигацию * СтрокаПриходныхПартий.Количество); // то хвостик купона нужно обязательно включить в АС!
									
									КонецЕсли;
									
									ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаПриходныхПартий.ДисконтПремияНачисленный);
									ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
									ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
									ДанныеПереоценки.Вставить("Стоимость", СтрокаПриходныхПартий.Стоимость);
									
									ДанныеПокупки = Новый Структура;
									ДанныеПокупки.Вставить("НачальныйДисконт", НачальныйДисконт);
									ДанныеПокупки.Вставить("ДатаПокупки", ДатаПокупки);
									ДанныеПокупки.Вставить("ДатаПокупкиНачальная", ДатаПокупкиНачальная);
									ДанныеПокупки.Вставить("КорректировкаЭСПНачальная", КорректировкаЭСПНачальная);
									ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаПокупки);
									ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная / СтрокаПриходныхПартий.Количество);
									ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
									ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", ЦенаПокупкиНачальная);
									
									ДисконтИКорректировкаЭСП = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(СтрокаПриходныхПартий.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);
									
									Если ДисконтИКорректировкаЭСП = Неопределено Тогда
										Возврат;
									КонецЕсли;
									
									Если НачальныйДисконт > 0 
										И СтрокаПриходныхПартий.ДисконтПремияНачисленный < ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия Тогда 
									    //Купили с премией, а новая премия вдруг оказалась больше
										НовоеДвижение.ДисконтПремияНачисленный = 0; // ничего не делаем
										НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = 0; // ничего не делаем
									Иначе
										НовоеДвижение.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия - СтрокаПриходныхПартий.ДисконтПремияНачисленный;
										СтрокаПриходныхПартий.ДисконтПремияНачисленный = ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия;
										
										Если НачальныйДисконт < 0 И ДанныеПоЦеннойБумаге.Амортизационная Тогда // купили с дисконтом + амортизационная
											// проверим расхождения, могут появиться, из-за округлений начислиляется не дополной стоимости
											Расхождение = СтрокаПриходныхПартий.ДисконтПремияНачисленный + СтрокаПриходныхПартий.Стоимость - СуммаНаОднуОблигацию * СтрокаПриходныхПартий.Количество;
											Если Расхождение < 0 Тогда
												
												НовоеДвижение.ДисконтПремияНачисленный = НовоеДвижение.ДисконтПремияНачисленный - Расхождение;
												СтрокаПриходныхПартий.ДисконтПремияНачисленный = СтрокаПриходныхПартий.ДисконтПремияНачисленный - Расхождение;
											
											КонецЕсли;
											
										КонецЕсли;
										
										КурсНачисленияДисконтаПремии = Неопределено; // по умолчанию курс - текущий
										Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
											КурсНачисленияДисконтаПремии = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
										КонецЕсли;
										
										СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
												Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.ДисконтПремияНачисленный, СтрокаПриходныхПартий.ДисконтПремияНачисленный), 
												ДанныеПоЦеннойБумаге.ВалютаНоминала,
												ЭтотОбъект.Организация,
												ВыборкаДетальныеЗаписи.Период,
												КурсНачисленияДисконтаПремии,
												Отказ);
										
										НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
										СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета = СуммыВВалютеУчета.СуммаОстаток;
																											
									КонецЕсли;																			
									
									// 3. Начислим корректировку по ЭСП
									Если РассчитыватьКорректировкуЭСП Тогда
										
										Если СтрокаПриходныхПартий.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
											И СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN084")
											И СтрокаПриходныхПартий.ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_291") Тогда
											
											НовоеДвижение.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП - СтрокаПриходныхПартий.КорректировкаЭСП - СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная;
											СтрокаПриходныхПартий.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП - СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная;
											
										Иначе
											
											НовоеДвижение.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП - СтрокаПриходныхПартий.КорректировкаЭСП;
											СтрокаПриходныхПартий.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП;
											
										КонецЕсли;
										
										
										КурсНачисленияКорректировкиЭСП = Неопределено; // по умолчанию курс - текущий
										Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
											КурсНачисленияКорректировкиЭСП = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
										КонецЕсли;
										
										СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
												Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.КорректировкаЭСП, СтрокаПриходныхПартий.КорректировкаЭСП), 
												ДанныеПоЦеннойБумаге.ВалютаНоминала,
												ЭтотОбъект.Организация,
												ВыборкаДетальныеЗаписи.Период,
												КурсНачисленияКорректировкиЭСП,
												Отказ);
										
										НовоеДвижение.КорректировкаЭСПВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
										СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета = СуммыВВалютеУчета.СуммаОстаток;
										
										НовоеДвижение.КорректировкаЭСПСНачалаГода = НовоеДвижение.КорректировкаЭСПВВалютеУчета;
										СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода = СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода + НовоеДвижение.КорректировкаЭСПСНачалаГода; 
										
									КонецЕсли;
									
									
									// 4. Начислим корректировку ПП
									НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = ДисконтИКорректировкаЭСП.ОценочнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные - СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
									СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = ДисконтИКорректировкаЭСП.ОценочнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
										
									КурсНачисленияКорректировкиПП = Неопределено; // по умолчанию курс - текущий
									Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
										КурсНачисленияКорректировкиПП = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
									КонецЕсли;
									
									СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
											Новый Структура("СуммаДвижение, СуммаОстаток", НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные), 
											ДанныеПоЦеннойБумаге.ВалютаНоминала,
											ЭтотОбъект.Организация,
											ВыборкаДетальныеЗаписи.Период,
											КурсНачисленияКорректировкиПП,
											Отказ);
									
									НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
									СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СуммыВВалютеУчета.СуммаОстаток;
									
									
									// 5. Начислим переоценку купона
									НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
									НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода = НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
									
									СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода + НовоеДвижение.ПереоценкаКупонаСНачалаГода;
									СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода = СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода + НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
									
									// 6. Начислим индексацию номинала, если соответствующие настройки
									Если ДанныеПоЦеннойБумаге.ИндексируемыйНоминал Тогда
										
										НоминальнаяСтоимостьКПогашению = СуммаНаОднуОблигацию * СтрокаПриходныхПартий.Количество;
										
										Если (НастройкиПоВидуУчета.ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНачальногоНоминала
											ИЛИ НастройкиПоВидуУчета.ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНоминалаПриПокупке) Тогда
											
											ТекущаяНоминальнаяСтоимость = СтрокаПриходныхПартий.Стоимость
												+ СтрокаПриходныхПартий.ДисконтПремияНачисленный
												+ СтрокаПриходныхПартий.КорректировкаЭСП
												+ СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные
												+ СтрокаПриходныхПартий.ИндексацияНоминала;
												
											НачислитьИндексацииНоминала = НоминальнаяСтоимостьКПогашению - ТекущаяНоминальнаяСтоимость;
											
											НовоеДвижение.ИндексацияНоминала = НачислитьИндексацииНоминала;
											НовоеДвижение.ИндексацияНоминалаСНачалаГода = НачислитьИндексацииНоминала;
											
											СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала + НовоеДвижение.ИндексацияНоминала;
											СтрокаПриходныхПартий.ИндексацияНоминалаСНачалаГода = СтрокаПриходныхПартий.ИндексацияНоминалаСНачалаГода + НовоеДвижение.ИндексацияНоминалаСНачалаГода;
											
										Иначе // если настройка НеУчитывать, то индексация в переоценке и начисляем на переоценку
											
											ТекущаяНоминальнаяСтоимость = СтрокаПриходныхПартий.Стоимость
												+ СтрокаПриходныхПартий.ДисконтПремияНачисленный
												+ СтрокаПриходныхПартий.КорректировкаЭСП
												+ СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные
												+ СтрокаПриходныхПартий.Переоценка;
												
											НачислитьИндексацииНоминала = НоминальнаяСтоимостьКПогашению - ТекущаяНоминальнаяСтоимость;
											
											НовоеДвижение.Переоценка = НачислитьИндексацииНоминала;
											НовоеДвижение.ПереоценкаВВалютеУчета = НачислитьИндексацииНоминала;
											НовоеДвижение.ПереоценкаСНачалаГода = НачислитьИндексацииНоминала;
											Если НовоеДвижение.ПереоценкаВВалютеУчета > 0 Тогда
												НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = НачислитьИндексацииНоминала;
											КонецЕсли;
											
											СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка + НовоеДвижение.Переоценка;
											СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета + НовоеДвижение.ПереоценкаВВалютеУчета;
											СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода + НовоеДвижение.ПереоценкаСНачалаГода;
											Если НовоеДвижение.ПереоценкаСНачалаГодаПоложительная > 0 Тогда
												СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная + НовоеДвижение.ПереоценкаСНачалаГодаПоложительная;
											КонецЕсли;
											
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
							// какие-либо списания проводим если стоит настройка СписыватьПриПолномПогашенииВМоментПогашения
							Если НастройкиУчетаОбщие.СписыватьПриПолномПогашенииВМоментПогашения Тогда
							
								НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
								//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
								
								ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
								НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								Если ВыборкаДетальныеЗаписи.Период < БухгалтерскийУчетПовтИсп.ДатаСКоторойПерестаемСписыватьКоличествоВМоментПолногоПогашения() Тогда
								
									ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий);	// приходная партия уходит
									
								Иначе
									
									НовоеДвижение.Количество = 0; // не списываем количество
									
									// у приходной партии обнуляем суммы, но не количество
									Для каждого СуммовоеПоле Из Новый Структура(РесурсыРегистраПартийСодержащиеСуммы) Цикл
										СтрокаПриходныхПартий[СуммовоеПоле.Ключ] = 0;
									КонецЦикла;
									
								КонецЕсли;
								
							ИначеЕсли ПогашенияНесписанныеИНеоплаченныеВТотЖеДень.Найти(ВыборкаДетальныеЗаписи.Регистратор) <> Неопределено Тогда
							// если стоит настройка УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу
							// и по этому погашения в день погашения не было ни оплаты, ни списания
							// то мы должны списать переоценку и только ее
								НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
								//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
								
								НовоеДвижение.ЦеннаяБумага 		= СтрокаПриходныхПартий.ЦеннаяБумага;
								НовоеДвижение.УчетныйАктивЕПС 	= СтрокаПриходныхПартий.УчетныйАктивЕПС;
								НовоеДвижение.Партия	 		= СтрокаПриходныхПартий.Партия;
								НовоеДвижение.СтрокаПартии 		= СтрокаПриходныхПартий.СтрокаПартии;
								НовоеДвижение.Рынок 			= СтрокаПриходныхПартий.Рынок;
								
								НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								НовоеДвижение.Переоценка 							= СтрокаПриходныхПартий.Переоценка;
								НовоеДвижение.ПереоценкаВВалютеУчета 				= СтрокаПриходныхПартий.ПереоценкаВВалютеУчета;
								НовоеДвижение.ПереоценкаСНачалаГода 				= СтрокаПриходныхПартий.ПереоценкаСНачалаГода;
								НовоеДвижение.ПереоценкаСНачалаГодаПоложительная	= СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная;
								
							КонецЕсли;
							// во всех остальных случаях списание сумм будет идти в оплате или списании (в том, что раньше), а количество спишет списание
							
						КонецЦикла;
						
						УдалялиПриходныеПартии = Ложь;
						Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
							ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
							УдалялиПриходныеПартии = Истина;
						КонецЦикла;
						
						Если УдалялиПриходныеПартии Тогда
							ПриходныеПартииКоличество = ПриходныеПартии.Количество();
							Для Инд = 1 По ПриходныеПартииКоличество Цикл
								ПриходныеПартии[Инд - 1].НомерСтроки = Инд;
							КонецЦикла;
						КонецЕсли;
						
					КонецЕсли;					
				
				КонецЕсли; 

			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") И ДанныеПоЦеннойБумаге.ЭтоИСУ Тогда
				
				// т.к. по погашению паев вообще говоря не предполагается распределение по Активам ЕПС
				// то списываем приходные партии подряд
				
				КоличествоКСписанию = ВыборкаДетальныеЗаписи.Количество;
				ПриходныеПартииКУдалению = Новый Массив;
				
				Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
					
					Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
						КоличествоКСписаниюПартии = СтрокаПриходныхПартий.Количество;
					Иначе
						КоличествоКСписаниюПартии = КоличествоКСписанию;
					КонецЕсли;
					
					Если РассчитыватьСтоимости Тогда
					
						НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, КоличествоКСписаниюПартии, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
					
					КонецЕсли;
						
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
					
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
					
					Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
						
						КоличествоКСписанию = КоличествоКСписанию - СтрокаПриходныхПартий.Количество;
						ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий); // списали её всю
						
					Иначе //спишем пропорционально
						
						КоэффициентСписания = КоличествоКСписанию / СтрокаПриходныхПартий.Количество;
						
						НовоеДвижение.Количество = КоличествоКСписанию;
						
						Если РассчитыватьСтоимости Тогда
						
							НовоеДвижение.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания;
							
							НовоеДвижение.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания;
							НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета * КоэффициентСписания;
							НовоеДвижение.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания;
							НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета * КоэффициентСписания;
							НовоеДвижение.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода * КоэффициентСписания;
							НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная * КоэффициентСписания;
							НовоеДвижение.КурсовыеРазницыСНачалаГода = СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода * КоэффициентСписания;
							
							
							СтрокаПриходныхПартий.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
							
							СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
							СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
							СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
							СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета - НовоеДвижение.ПереоценкаВВалютеУчета;
							СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода - НовоеДвижение.ПереоценкаСНачалаГода;
							СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная - НовоеДвижение.ПереоценкаСНачалаГодаПоложительная;
							СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода = СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода - НовоеДвижение.КурсовыеРазницыСНачалаГода;
							
						КонецЕсли;
						
						СтрокаПриходныхПартий.Количество = СтрокаПриходныхПартий.Количество - НовоеДвижение.Количество;
						
						КоличествоКСписанию = 0;
					
					КонецЕсли;
					
					// не списываем количество
					// оно будет в списании списываться
					НовоеДвижение.Количество = 0;
					
					Если КоличествоКСписанию = 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если КоличествоКСписанию > 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не распределилась:" + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " по " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
					Сообщить(КоличествоКСписанию);
					Отказ = Истина;
				КонецЕсли;
				
				УдалялиПриходныеПартии = Ложь;
				Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
					ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
					УдалялиПриходныеПартии = Истина;
				КонецЦикла;
				
				Если УдалялиПриходныеПартии Тогда
					ПриходныеПартииКоличество = ПриходныеПартии.Количество();
					Для Инд = 1 По ПриходныеПартииКоличество Цикл
						ПриходныеПартии[Инд - 1].НомерСтроки = Инд;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.НачислениеСписаниеРезервов") Тогда
				
				// #315386 - резервы участвуют в динамическом расчете - это нужно для СЧА
				
				СтрокиПриходныхПартий = ПриходныеПартии.НайтиСтроки(Новый Структура("ЦеннаяБумага,Партия,СтрокаПартии", 
																						ВыборкаДетальныеЗаписи.ЦеннаяБумага, 
																						ВыборкаДетальныеЗаписи.Партия, 
																						ВыборкаДетальныеЗаписи.СтрокаПартии));
																						
				Если СтрокиПриходныхПартий.Количество() <> 1 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет партий для резерва:" + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " по " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
					Сообщить(КоличествоКСписанию);
					Отказ = Истина;
				Иначе

					СтрокаПриходныхПартий = СтрокиПриходныхПартий[0];
					
					// Поскольку резервы теперь разделены + контроль необходимости идет в само документе резервов, то в данном месте никаких контролей делать не нужно
				
					СуммаНачисленияРезерва = ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение - СтрокаПриходныхПартий.СуммаРезервовПодОбесценение;
					
					СтрокаПриходныхПартий.СуммаРезервовПодОбесценение = ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение;
					
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий, "УчетныйАктивЕПС,Рынок,ЦеннаяБумага,Партия,СтрокаПартии");
					
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
					
					НовоеДвижение.СуммаРезервовПодОбесценение = СуммаНачисленияРезерва;
				
				КонецЕсли;					
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.РеклассификацияАктивовЕПС") Тогда
				
				ПриходныеПартииКУдалению = Новый Массив;
				
				СтрокиПриходныхПартий = ПриходныеПартии.НайтиСтроки(Новый Структура("ЦеннаяБумага,Партия,СтрокаПартии", 
																						ВыборкаДетальныеЗаписи.ЦеннаяБумага, 
																						ВыборкаДетальныеЗаписи.Партия, 
																						ВыборкаДетальныеЗаписи.СтрокаПартии));
				Если СтрокиПриходныхПартий.Количество() <> 1 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет партий для реклассификации:" + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " по " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
					Отказ = Истина;
					Возврат;
				Иначе
					СтрокаПриходныхПартий = СтрокиПриходныхПартий[0];
				КонецЕсли;
				
				СтрокиРеклассификации = ДанныеРеклассификаций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,Партия,СтрокаПартии", 
																						ВыборкаДетальныеЗаписи.Регистратор,
																						ВыборкаДетальныеЗаписи.ЦеннаяБумага, 
																						ВыборкаДетальныеЗаписи.Партия, 
																						ВыборкаДетальныеЗаписи.СтрокаПартии));
				Если СтрокиРеклассификации.Количество() <> 1 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных документа реклассификации:" + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " по " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
					Отказ = Истина;
					Возврат;
				Иначе
					СтрокаРеклассификации = СтрокиРеклассификации[0];
				КонецЕсли;
				
				Если СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток									// из СС
					И (СтрокаРеклассификации.УчетныйАктивЕПСРодитель = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД											// в АС
						ИЛИ СтрокаРеклассификации.УчетныйАктивЕПСРодитель = Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения) Тогда    // тоже в АС
					// СС -> АС
					// дооценить старую партию, если нужно
					НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
					//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
					
					ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, ВыборкаДетальныеЗаписи, "Регистратор,Период,Рынок");
					ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, СтрокаПриходныхПартий, "УчетныйАктивЕПС,ЦеннаяБумага,Партия,СтрокаПартии");
					
					НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					НовоеДвижениеПереоценки.Переоценка = СтрокаРеклассификации.ДооценкаПоПрофсуждению; 
					НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета; 
					НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета;
					Если СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета > 0 Тогда
						НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
					КонецЕсли;
					
					НовоеДвижениеПереоценки.ПереоценкаКупона = СтрокаРеклассификации.ДооценкаКупона; 
					НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета = СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета; 
					НовоеДвижениеПереоценки.ПереоценкаКупонаСНачалаГода = СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета;
					
					НовоеДвижениеПереоценки.ДисконтПремияНачисленный = СтрокаРеклассификации.ДоначислениеДисконтаПремии; 
					НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета = СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода = СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					
					НовоеДвижениеПереоценки.КорректировкаЭСП = СтрокаРеклассификации.ДоначислениеКорректировкиЭСП; 
					НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета = СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					НовоеДвижениеПереоценки.КорректировкаЭСПСНачалаГода = СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнания; 
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета; 
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияСНачалаГода = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета; 
					
					
					СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка + СтрокаРеклассификации.ДооценкаПоПрофсуждению; 
					СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета + СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета; 
					СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода + СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета; 
					Если СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета > 0 Тогда
						СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная + СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета; 
					КонецЕсли;
					
					СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона + СтрокаРеклассификации.ДооценкаКупона; 
					СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета + СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета; 
					СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода + СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета; 
					
					СтрокаПриходныхПартий.ДисконтПремияНачисленный = СтрокаПриходныхПартий.ДисконтПремияНачисленный + СтрокаРеклассификации.ДоначислениеДисконтаПремии; 
					СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета = СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета + СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода = СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода + СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					
					СтрокаПриходныхПартий.КорректировкаЭСП = СтрокаПриходныхПартий.КорректировкаЭСП + СтрокаРеклассификации.ДоначислениеКорректировкиЭСП; 
					СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета = СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета + СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода = СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода + СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					
					СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные + СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнания; 
					СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета; 
					СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияСНачалаГода = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияСНачалаГода + СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета; 
					
					// полностью списать партию
					НовоеДвижениеСписания = ЭтотОбъект.РассчитанныеПартии.Добавить();
					//НовоеДвижениеСписания.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
					
					ЗаполнитьЗначенияСвойств(НовоеДвижениеСписания, СтрокаПриходныхПартий);
					НовоеДвижениеСписания.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижениеСписания.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижениеСписания.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижениеСписания.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
					Для каждого СуммовоеПоле Из СуммовыеПоля Цикл
						ИмяПоля = СуммовоеПоле.Ключ;
						СтрокаПриходныхПартий[ИмяПоля] = 0;
					КонецЦикла;
					
					ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий);
					
					СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
					Для каждого СуммовоеПоле Из СуммовыеПоля Цикл
						ИмяПоля = СуммовоеПоле.Ключ;
						СтрокаПриходныхПартий[ИмяПоля] = 0;
					КонецЦикла;
					
					
					// создать новую партию
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи, "Регистратор,Период,Рынок,УчетныйАктивЕПС,ЦеннаяБумага,
					|Количество, Стоимость,СтоимостьВВалютеУчета,Переоценка,ПереоценкаВВалютеУчета,ДисконтПремия,ДисконтПремияПокупки,ДисконтПремияНачисленный,
					|ДисконтПремияНачисленныйВВалютеУчета,КорректировкаЭСП,КорректировкаЭСПВВалютеУчета,РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
					|РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,СуммаРезервовПодОбесценение");
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, НовоеДвижениеСписания, "СтоимостьКупона,СтоимостьКупонаВВалютеУчета,ПереоценкаКупона,ПереоценкаКупонаВВалютеУчета,ПереоценкаКупонаСНачалаГода,ДисконтПремияНачисленныйСНачалаГода");
					
					Если ВыборкаДетальныеЗаписи.Регистратор.ОставлятьПартииБезИзменений Тогда
						ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи, "Партия, СтрокаПартии");
					Иначе	
						НовоеДвижение.Партия = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижение.СтрокаПартии = ВыборкаДетальныеЗаписи.НомерСделки;
					КонецЕсли;
					
					НовоеДвижение.СтоимостьПокупкиКупона = НовоеДвижение.СтоимостьКупона + НовоеДвижение.ПереоценкаКупона;
					НовоеДвижение.СтоимостьПокупки = НовоеДвижение.Стоимость + НовоеДвижение.Переоценка + НовоеДвижение.ДисконтПремияНачисленный + НовоеДвижение.КорректировкаЭСП + НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
					
					ПриходнаяПартия = ПриходныеПартии.Добавить();
					ЗаполнитьЗначенияСвойств(ПриходнаяПартия, НовоеДвижение);
					ПриходнаяПартия.НомерСтроки = ПриходныеПартии.Количество();
					
					ПриходнаяПартия.ДатаПокупки = ВыборкаДетальныеЗаписи.Период;
					ПриходнаяПартия.ДатаПокупкиНачальная = СтрокаПриходныхПартий.ДатаПокупкиНачальная;
					ПриходнаяПартия.СтоимостьПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная;
					
				ИначеЕсли (СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД											// из АС
							ИЛИ СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения)			// тоже из АС
					И СтрокаРеклассификации.УчетныйАктивЕПСРодитель = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток Тогда									// в СС
					// АС -> СС
					
					// это услови закоментил т.к. оно слегка искуственное - все ведб понятно по активам
					//Если СтрокаРеклассификации.КорректировкаЭСПРазницаППРезервВПереоценку Тогда
						
					// полностью списать партию
					НовоеДвижениеСписания = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижениеСписания, СтрокаПриходныхПартий);
					НовоеДвижениеСписания.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижениеСписания.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижениеСписания.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижениеСписания.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					// создать движение с новым учетным активом ЕПС и, по настройкам, новую партию 
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, НовоеДвижениеСписания);
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					НовоеДвижение.УчетныйАктивЕПС = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;

					// и это, на мой взгляд, искуственное условие - при реклассе из АС в СС всегда оставляем регистратор 
					
					//Если ВыборкаДетальныеЗаписи.Регистратор.ОставлятьПартииБезИзменений Тогда
					//	НовоеДвижение.УчетныйАктивЕПС = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
					//Иначе
					//	НовоеДвижение.Партия = ВыборкаДетальныеЗаписи.Регистратор;
					//	НовоеДвижение.СтрокаПартии = ВыборкаДетальныеЗаписи.НомерСделки;
					//	НовоеДвижение.УчетныйАктивЕПС = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
					//КонецЕсли;	
					
					НовоеДвижение.Переоценка = СтрокаРеклассификации.Переоценка;
					НовоеДвижение.КорректировкаЭСП = СтрокаРеклассификации.КорректировкаЭСП;
					НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаРеклассификации.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
					НовоеДвижение.СуммаРезервовПодОбесценение = СтрокаРеклассификации.СуммаРезервовПодОбесценение;
					
					НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаРеклассификации.ПереоценкаВВалютеУчета;
					НовоеДвижение.КорректировкаЭСПВВалютеУчета = СтрокаРеклассификации.КорректировкаЭСПВВалютеУчета;
					НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаРеклассификации.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
					
					НовоеДвижение.КорректировкаЭСПСНачалаГода = 0;
					НовоеДвижение.РазницаПервоначальногоПризнанияСНачалаГода = 0;
					
					
					СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
					Для Каждого СуммовоеПоле Из СуммовыеПоля Цикл
						ИмяПоля = СуммовоеПоле.Ключ;
						СтрокаПриходныхПартий[ИмяПоля] = 0;
					КонецЦикла;
					
					ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий);
					
					ПриходнаяПартия = ПриходныеПартии.Добавить();
					ЗаполнитьЗначенияСвойств(ПриходнаяПартия, НовоеДвижение);
					ПриходнаяПартия.НомерСтроки = ПриходныеПартии.Количество();
					
					ПриходнаяПартия.ДатаПокупки = ВыборкаДетальныеЗаписи.Период;
					ПриходнаяПартия.ДатаПокупкиНачальная = СтрокаПриходныхПартий.ДатаПокупкиНачальная;
					ПриходнаяПартия.СтоимостьПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная;
					
					// дооценить новую партию, если нужно
					НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, ПриходнаяПартия, "Регистратор,Период,Рынок,УчетныйАктивЕПС,ЦеннаяБумага,Партия,СтрокаПартии");
					
					НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					НовоеДвижениеПереоценки.Переоценка = СтрокаРеклассификации.ДооценкаПоПрофсуждению; 
					НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета; 
					НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета;
					Если СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета > 0 Тогда
						НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
					КонецЕсли;
					
					НовоеДвижениеПереоценки.ПереоценкаКупона = СтрокаРеклассификации.ДооценкаКупона; 
					НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета = СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета; 
					НовоеДвижениеПереоценки.ПереоценкаКупонаСНачалаГода = СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета;
					
					НовоеДвижениеПереоценки.ДисконтПремияНачисленный = СтрокаРеклассификации.ДоначислениеДисконтаПремии; 
					НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета = СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода = СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					
					НовоеДвижениеПереоценки.КорректировкаЭСП = СтрокаРеклассификации.ДоначислениеКорректировкиЭСП; 
					НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета = СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					НовоеДвижениеПереоценки.КорректировкаЭСПСНачалаГода = СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнания; 
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета; 
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияСНачалаГода = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета;
						
				Иначе
					// последний вариант - из АС в АС
						
					// полностью списать партию
					НовоеДвижениеСписания = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижениеСписания, СтрокаПриходныхПартий);
					НовоеДвижениеСписания.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижениеСписания.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижениеСписания.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижениеСписания.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					// создать движение с новым учетным активом ЕПС и, по настройкам, новую партию 
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, НовоеДвижениеСписания);
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;

					НовоеДвижение.УчетныйАктивЕПС = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
					
					// тоже искуственное условие - при реклассе из АС в АС всегда оставляем регистратор
					
					//Если ВыборкаДетальныеЗаписи.Регистратор.ОставлятьПартииБезИзменений Тогда
					//	НовоеДвижение.УчетныйАктивЕПС = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
					//Иначе
					//	НовоеДвижение.Партия = ВыборкаДетальныеЗаписи.Регистратор;
					//	НовоеДвижение.СтрокаПартии = ВыборкаДетальныеЗаписи.НомерСделки;
					//	НовоеДвижение.УчетныйАктивЕПС = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
					//КонецЕсли;	
					
					СуммовыеПоля = Новый Структура(РесурсыРегистраПартийСодержащиеСуммы);
					Для Каждого СуммовоеПоле Из СуммовыеПоля Цикл
						ИмяПоля = СуммовоеПоле.Ключ;
						СтрокаПриходныхПартий[ИмяПоля] = 0;
					КонецЦикла;
					
					ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий);
					
					ПриходнаяПартия = ПриходныеПартии.Добавить();
					ЗаполнитьЗначенияСвойств(ПриходнаяПартия, НовоеДвижение);
					ПриходнаяПартия.НомерСтроки = ПриходныеПартии.Количество();
					
					ПриходнаяПартия.ДатаПокупки = ВыборкаДетальныеЗаписи.Период;
					ПриходнаяПартия.ДатаПокупкиНачальная = СтрокаПриходныхПартий.ДатаПокупкиНачальная;
					ПриходнаяПартия.СтоимостьПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная;
					
					// дооценить новую партию, если нужно
					НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, ПриходнаяПартия, "Регистратор,Период,Рынок,УчетныйАктивЕПС,ЦеннаяБумага,Партия,СтрокаПартии");
					
					НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
					НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.НомерСделки;
					
					НовоеДвижениеПереоценки.Переоценка = СтрокаРеклассификации.ДооценкаПоПрофсуждению; 
					НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета; 
					НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета;
					Если СтрокаРеклассификации.ДооценкаПоПрофсуждениюВВалютеУчета > 0 Тогда
						НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
					КонецЕсли;
					
					НовоеДвижениеПереоценки.ПереоценкаКупона = СтрокаРеклассификации.ДооценкаКупона; 
					НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета = СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета; 
					НовоеДвижениеПереоценки.ПереоценкаКупонаСНачалаГода = СтрокаРеклассификации.ДооценкаКупонаВВалютеУчета;
					
					НовоеДвижениеПереоценки.ДисконтПремияНачисленный = СтрокаРеклассификации.ДоначислениеДисконтаПремии; 
					НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета = СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода = СтрокаРеклассификации.ДоначислениеДисконтаПремииВВалютеУчета; 
					
					НовоеДвижениеПереоценки.КорректировкаЭСП = СтрокаРеклассификации.ДоначислениеКорректировкиЭСП; 
					НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета = СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					НовоеДвижениеПереоценки.КорректировкаЭСПСНачалаГода = СтрокаРеклассификации.ДоначислениеКорректировкиЭСПВВалютеУчета; 
					
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнания; 
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета; 
					НовоеДвижениеПереоценки.РазницаПервоначальногоПризнанияСНачалаГода = СтрокаРеклассификации.ДоначислениеРазницаПервоначальногоПризнанияВВалютеУчета; 
						
				КонецЕсли;	
				
				УдалялиПриходныеПартии = Ложь;
				Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
					ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
					УдалялиПриходныеПартии = Истина;
				КонецЦикла;
				
				Если УдалялиПриходныеПартии Тогда
					ПриходныеПартииКоличество = ПриходныеПартии.Количество();
					Для Инд = 1 По ПриходныеПартииКоличество Цикл
						ПриходныеПартии[Инд - 1].НомерСтроки = Инд;
					КонецЦикла;
				КонецЕсли;
				
				Если НЕ РассчитыватьСтоимости  // если мы не считали стоимости (если считали то и так все хорошо)
					И ЭтотОбъект.ВариантРасчета = Перечисления.ВариантыРасчетаПартий.РасчетКоличестваДляБумагПоАССуммы // и вели расчет для целей СЧА (для ИД это не нужно)
					И НовоеДвижение.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда // и появляется бумага по АС, то...
					
					РассчитыватьСтоимости = Истина; // начинаем считать стоимости!!!
					
				КонецЕсли;
				
			Иначе // продажа или погашение паев или вывод цб
				
				ЭтоПрямоеРЕПО = Ложь;
				ЭтоЗакрытиеОбратногоРЕПО = Ложь;
				Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
				    Если ВыборкаДетальныеЗаписи.ЧастьСделкиРЕПО = 1 Тогда
						ЭтоПрямоеРЕПО = Истина;
					ИначеЕсли ВыборкаДетальныеЗаписи.ЧастьСделкиРЕПО = 2 Тогда
						ЭтоЗакрытиеОбратногоРЕПО = Истина;
					КонецЕсли;
				КонецЕсли;
				
				
				Если ЭтоЗакрытиеОбратногоРЕПО И НастройкиПоВидуУчета.УчитыватьПартииРЕПООтдельно Тогда
					// просто списываем РЕПОшные партии
					
					ПартииКупленныеПоРЕПОКУдалению = Новый Массив;
					
					ПартииКупленныеПоРЕПОПоСделке = ПартииКупленныеПоРЕПО.НайтиСтроки(Новый Структура("Партия,СтрокаПартии", ВыборкаДетальныеЗаписи.Партия_ПерваяЧастьРЕПО, ВыборкаДетальныеЗаписи.СтрокаПартии));
					
					Для Каждого СтрокаПартииКупленныеПоРЕПОПоСделке Из ПартииКупленныеПоРЕПОПоСделке Цикл
						
						Если НастройкиУчетаОбщие.ПерекурсовыватьВалютныеАктивыНаДатуЗакрытияПоБумагамПоСделкамОбратногоРЕПО Тогда //Для перекурсовки для Будущего. Пока не сделано параметра по которому будет это пересчитываться.
							
							МассивРесурсовКПерекурсовке = Новый Массив;
							МассивРесурсовКПерекурсовке.Добавить("СтоимостьВВалютеУчета");
							МассивРесурсовКПерекурсовке.Добавить("СтоимостьКупонаВВалютеУчета");
							МассивРесурсовКПерекурсовке.Добавить("ПереоценкаВВалютеУчета");
							МассивРесурсовКПерекурсовке.Добавить("ПереоценкаКупонаВВалютеУчета");
							
							НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО, ВыборкаДетальныеЗаписи.Период, СтрокаПартииКупленныеПоРЕПОПоСделке, СтрокаПартииКупленныеПоРЕПОПоСделке.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,МассивРесурсовКПерекурсовке,,Отказ);  //,,,,,Отказ); //  
							
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
							
						КонецЕсли;
						
						Если НастройкиУчетаОбщие.ДоначислятьНКДНаДатуЗакрытияПоБумагамПоСделкамОбратногоРЕПО Тогда
							
							// Дооценим купон
							ДоначислятьКупонДоСуммы = Справочники.Облигации.ПолучитьКупон(СтрокаПартииКупленныеПоРЕПОПоСделке.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, СчетДоверительногоУправления);
							
							НовоеДвижение = ДоначислитьКупонРЕПО(ВыборкаДетальныеЗаписи.Регистратор, 
																	ВыборкаДетальныеЗаписи.Период,
																	ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО,
																	СтрокаПартииКупленныеПоРЕПОПоСделке,
																	ДоначислятьКупонДоСуммы,
																	СтрокаПартииКупленныеПоРЕПОПоСделке.Количество,
																	0,
																	Отказ);
							
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
							
							СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупона = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупона + НовоеДвижение.ПереоценкаКупона;
							СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
							
						КонецЕсли;
						
						// запомним, что удалить надо из репошных 
						ПартииКупленныеПоРЕПОКУдалению.Добавить(СтрокаПартииКупленныеПоРЕПОПоСделке);
						
						// движение по партиям РЕПО расход сделать
						НовоеДвижениеРЕПО = РассчитанныеПартииОбратноеРЕПО.Добавить();
						ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, СтрокаПартииКупленныеПоРЕПОПоСделке);
						
						НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижениеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
						НовоеДвижениеРЕПО.СтрокаКорзиныЦенныхБумаг = СтрокаПартииКупленныеПоРЕПОПоСделке.СтрокаПартии;
						
					КонецЦикла;
					
					// удалим партии РЕПО
					Для каждого СтрокаПартииКупленныеПоРЕПОКУдалению Из ПартииКупленныеПоРЕПОКУдалению Цикл
						ПартииКупленныеПоРЕПО.Удалить(СтрокаПартииКупленныеПоРЕПОКУдалению);
					КонецЦикла;
					
				Иначе
					
					//Остальные расходы спишем с приходов. Остальные это 
					
					ДокументыДляСписания = ПустаяТаблица.СкопироватьКолонки();
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Сделка") //по этим документам неясен учетный актив ЕПС
						 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО")
						 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
						 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
						 
						КоличествоРаспределить = ВыборкаДетальныеЗаписи.Количество;
						ТекСделка = ВыборкаДетальныеЗаписи.Регистратор;
						Если ТипЗнч(ТекСделка) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
						ИЛИ ТипЗнч(ТекСделка) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
							ТекСделка = ВыборкаДетальныеЗаписи.Основание;
						КонецЕсли;
						
						РаспределенияПоТекущейСделкеИБумаге = РаспределенияПоСделкам.НайтиСтроки(Новый Структура("Сделка, ЦеннаяБумага", ТекСделка, ВыборкаДетальныеЗаписи.ЦеннаяБумага));
						
						Для каждого СтрокаРаспределенияПоСделкам Из РаспределенияПоТекущейСделкеИБумаге Цикл
							Если СтрокаРаспределенияПоСделкам.Количество = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							СтрокаДокументыДляСписания = ДокументыДляСписания.Добавить();
							
							ЗаполнитьЗначенияСвойств(СтрокаДокументыДляСписания, ВыборкаДетальныеЗаписи);
							
							СтрокаДокументыДляСписания.УчетныйАктивЕПС = СтрокаРаспределенияПоСделкам.УчетныйАктивЕПС;
							СтрокаДокументыДляСписания.Количество = МИН(СтрокаРаспределенияПоСделкам.Количество, КоличествоРаспределить);
							
							СтрокаРаспределенияПоСделкам.Количество = СтрокаРаспределенияПоСделкам.Количество - СтрокаДокументыДляСписания.Количество;
							
							КоличествоРаспределить = КоличествоРаспределить - СтрокаДокументыДляСписания.Количество;
							Если КоличествоРаспределить = 0 Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если КоличествоРаспределить <> 0 Тогда // по части активов неясно как их распределять - распределение определяем по приходным партиям
						
							СтрокаДокументыДляСписания = ДокументыДляСписания.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаДокументыДляСписания, ВыборкаДетальныеЗаписи);
							СтрокаДокументыДляСписания.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка(); // и УчетныйАктивЕПС неизвестен
							СтрокаДокументыДляСписания.Количество = КоличествоРаспределить;
						
						КонецЕсли;
						
					Иначе
						СтрокаДокументыДляСписания = ДокументыДляСписания.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДокументыДляСписания, ВыборкаДетальныеЗаписи);
						
						Если СтрокаДокументыДляСписания.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
							// попытаемся определить актив из приходных партий
							МассивУчетныхАктивов = ПриходныеПартии.ВыгрузитьКолонку("УчетныйАктивЕПС");
							РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(МассивУчетныхАктивов);
							Если МассивУчетныхАктивов.Количество() > 1  Тогда
								
								ТекстСообщения = СтрШаблон("По ценной бумаге: %1 есть несколько учетных активов. Но в %2 учетный актив не задан!", 
								Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага), 
								Строка(ВыборкаДетальныеЗаписи.Регистратор));
								
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
							Иначе
								СтрокаДокументыДляСписания.УчетныйАктивЕПС = МассивУчетныхАктивов[0];
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					
					КоличествоКСписаниюВсего = ДокументыДляСписания.Итог("Количество");
					Если РассчитыватьСтоимости
						И НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом
						И НЕ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316
						И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")
						И (ВыборкаДетальныеЗаписи.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() ИЛИ
							ПереоцениваемыеГруппыАктивов.Найти(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.Родитель) <> Неопределено)
						И ПереоценкиПередВыводами <> Неопределено // это возникает когда расчет динамический, а бумага по АС и расчет переопределился на нединамический, но для АС переоценка смысла не имеет
					Тогда
					
						ПереоценкаПередВыводами = ПереоценкиПередВыводами.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага",
															ВыборкаДетальныеЗаписи.Регистратор,
															ВыборкаДетальныеЗаписи.ЦеннаяБумага));
															
						Если ПереоценкаПередВыводами.Количество() <> 1 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить цену бумаги при выводе:" + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага));
							Отказ = Истина;
						КонецЕсли;
						
						СуммаРынокВсего = ПереоценкаПередВыводами[0].СуммаРынок;
						СуммаРынокВВалютеУчетаВсего = ПереоценкаПередВыводами[0].СуммаРынокВВалютеУчета;
						
					ИначеЕсли РассчитыватьСтоимости
						И НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей
						И НЕ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316
						И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВыводЦенныхБумаг")
						И (ВыборкаДетальныеЗаписи.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() ИЛИ
							ПереоцениваемыеГруппыАктивов.Найти(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.Родитель) <> Неопределено)
						И ПереоценкиДляОпераций <> Неопределено // это возникает когда расчет динамический, а бумага по АС и расчет переопределился на нединамический, но для АС переоценка смысла не имеет
					Тогда
						
						ПереоценкаПередПродажами = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения",
															ВыборкаДетальныеЗаписи.Регистратор,
															ВыборкаДетальныеЗаписи.ЦеннаяБумага,
															Перечисления.ВидыДвижений.Расход));
															
						Если ПереоценкаПередПродажами.Количество() <> 1 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить цену бумаги при продаже:" + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага));
							Отказ = Истина;
						КонецЕсли;
						
						СуммаРынокВсего = ПереоценкаПередПродажами[0].СуммаРынок;
						СуммаРынокВВалютеУчетаВсего = ПереоценкаПередПродажами[0].СуммаРынокВВалютеУчета;
						
					КонецЕсли;
					
					Для каждого СтрокаДокументыДляСписания Из ДокументыДляСписания Цикл
					
						ПриходныеПартииКУдалению = Новый Массив;
						ПриходныеПартииКУдалениюРЕПО = Новый Массив;
						
						КоличествоКСписанию = СтрокаДокументыДляСписания.Количество;
						СписываемыйУчетныйАктивЕПС = СтрокаДокументыДляСписания.УчетныйАктивЕПС;
						
						Если РассчитыватьСтоимости И ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
							
							Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки = 0 Тогда
								СуммаКупонаНаОднуОблигацию = Справочники.Облигации.ПолучитьКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, НачалоДня(ВыборкаДетальныеЗаписи.Период), СчетДоверительногоУправленияДляУчета);
							Иначе
								СуммаКупонаНаОднуОблигацию = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, НачалоДня(ВыборкаДетальныеЗаписи.Период), СчетДоверительногоУправленияДляУчета, Истина, 6);
							КонецЕсли;
							
						КонецЕсли; 
						
						// для бумаг по АС берем данные по начальным дисконту/премии из первички (#404807)
						// это связано с тем, что у них комиссия идет в стоимость и требуется точность, большая чем может обеспечить ресурс ДисконтПремияПокупки
						// #436580 - для организации ДК сделано упрощение расчетов
						ИспользоватьПервичныеДанныеДляОпределенияЦеныПриобретения = (ПриходныеПартии.Найти(Истина, "ВключатьРасходыПоПокупкеВСтоимость") <> Неопределено) И НЕ Организация_ДК;
						
						Если ИспользоватьПервичныеДанныеДляОпределенияЦеныПриобретения Тогда
							ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ПриходныеПартии, СчетДоверительногоУправленияДляУчета, ВыборкаДетальныеЗаписи.Период).Выгрузить();
						Иначе 
							ДатыИЦеныПокупки = Неопределено;
						КонецЕсли;
						
						Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
							
							Если СтрокаПриходныхПартий.УчетныйАктивЕПС <> СписываемыйУчетныйАктивЕПС
								И СписываемыйУчетныйАктивЕПС <> Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
								Продолжить;
							КонецЕсли;
							
							Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")
								И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Партия) Тогда
							
								Если СтрокаПриходныхПартий.Партия <> ВыборкаДетальныеЗаписи.Партия
									ИЛИ СтрокаПриходныхПартий.СтрокаПартии <> ВыборкаДетальныеЗаписи.СтрокаПартии Тогда
									
									Продолжить;
								
								КонецЕсли;	
							
							КонецЕсли;
							
							Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
								КоличествоКСписаниюПартии = СтрокаПриходныхПартий.Количество;
							Иначе
								КоличествоКСписаниюПартии = КоличествоКСписанию;
							КонецЕсли;
							
							КоличествоКСписаниюВсего = КоличествоКСписаниюВсего - КоличествоКСписаниюПартии;
							
							НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
								НастройкиУчетаОбщие,
								СтрокаПриходныхПартий.ЦеннаяБумага,
								СтрокаПриходныхПартий.УчетныйАктивЕПС,
								СтрокаПриходныхПартий.Партия,
								СтрокаПриходныхПартий.СтрокаПартии);
							
							Если РассчитыватьСтоимости Тогда
								
								ЭтоФинстандартПослеДефолтаКоторыйУжеНеКурсуем = 
									(СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстандарт")
									И НачалоДня(ВыборкаДетальныеЗаписи.Период) > '20200605');
								
								НовоеДвижениеПерекурсовка = Неопределено;
								Если ДанныеПоЦеннойБумаге.ЭтоВалютнаяБумага И НЕ ЭтоФинстандартПослеДефолтаКоторыйУжеНеКурсуем Тогда // возможно, будем делать перекурсовку
									Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки = 0 Тогда // бумагу перекурсовываем по курсу ЦБ
										НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор,
											ЭтотОбъект.РассчитанныеПартии,
											ВыборкаДетальныеЗаписи.Период,
											СтрокаПриходныхПартий,
											КоличествоКСписаниюПартии,
											ВыборкаДетальныеЗаписи.СтрокаПартии,
											,
											,
											,
											Отказ);
									ИначеЕсли ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация			// у дефолтных валютных облигаций есть фишка: их общая стоимость равна нулю путем отрицательной переоценки, но!
										И НЕ УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу Тогда 	// если клиент не считает все части по 1му курсу
														
										РесурсыКПерекурсовке = Новый Массив();
										РесурсыКПерекурсовке.Добавить("СтоимостьВВалютеУчета");		// тело идет по курсу ЦБ и курсуется, а переоценка делается такой, чтобы выйти в ноль 
										
										НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор,
											ЭтотОбъект.РассчитанныеПартии,
											ВыборкаДетальныеЗаписи.Период,
											СтрокаПриходныхПартий,
											КоличествоКСписаниюПартии,
											ВыборкаДетальныеЗаписи.СтрокаПартии,
											,
											РесурсыКПерекурсовке,
											,
											Отказ);
									КонецЕсли;
								КонецЕсли;
								
								НовоеДвижениеПереоценки = Неопределено;
								
								ЭтоБумагаБезДатыПогашения		= (ДанныеПоЦеннойБумаге.ДатаПогашения = '00010101');
								ЭтоБумагаСПрошедшимПогашением	= (ДанныеПоЦеннойБумаге.ДатаПогашения < НачалоДня(ВыборкаДетальныеЗаписи.Период));
								ЭтоВыводКоторыйНеСчитаем		= (ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")
									И НастройкиУчетаОбщие.НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода);
								ЭтоПромсвязьПоКоторойНичегоНеНачисляем = (СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПромСвязьКапитал_001"));
								
								Если ДанныеПоЦеннойБумаге.ЭтоОблигация
									И НЕ ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация
									И НЕ ЭтоБумагаБезДатыПогашения
									И НЕ ЭтоБумагаСПрошедшимПогашением
									И НЕ ЭтоВыводКоторыйНеСчитаем
									И НЕ ЭтоПромсвязьПоКоторойНичегоНеНачисляем Тогда
								
									НовоеДвижениеПереоценки = ДоначислитьКупон(ВыборкаДетальныеЗаписи.Регистратор,
																							ВыборкаДетальныеЗаписи.Период,
																							СтрокаПриходныхПартий,
																							СуммаКупонаНаОднуОблигацию,
																							КоличествоКСписаниюПартии,
																							ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки, 
																							0,
																							Ложь,
																							Отказ);
									//НовоеДвижениеПереоценкиКупона.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
																							
									ДатаПокупки	= СтрокаПриходныхПартий.ДатаПокупки;
									ДатаПокупкиНачальная = СтрокаПриходныхПартий.ДатаПокупкиНачальная;
									КорректировкаЭСПНачальная = СтрокаПриходныхПартий.КорректировкаЭСПНачальная;
									ЦенаПокупкиНачальная = СтрокаПриходныхПартий.СтоимостьПокупкиНачальная / СтрокаПриходныхПартий.Количество;
									
									Если ДатыИЦеныПокупки = Неопределено Тогда
										
										НачальныйДисконт  = Окр(СтрокаПриходныхПартий.ДисконтПремияПокупки / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
										
										Если ДанныеПоЦеннойБумаге.Амортизационная Тогда
											ЦенаПокупки	= Справочники.Облигации.ПолучитьНоминал(СтрокаПриходныхПартий.ЦеннаяБумага, ДатаПокупки) + НачальныйДисконт;
										Иначе
											ЦенаПокупки	= СтрокаПриходныхПартий.Номинал + НачальныйДисконт;
										КонецЕсли;
										ЦенаПокупкиКупона	= Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
										
									Иначе
										
										ДатаИЦенаПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаПриходныхПартий.НомерСтроки));
										
										НачальныйДисконт 	= ДатаИЦенаПокупки[0].НачальныйДисконт;
										ЦенаПокупки 		= ДатаИЦенаПокупки[0].ЦенаПокупки;
										ЦенаПокупкиКупона 	= ДатаИЦенаПокупки[0].ЦенаКупона;
										
									КонецЕсли;
																							
									ДанныеПереоценки = Новый Структура("УчетныйАктивЕПС, Партия, СтрокаПартии");
									ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаПриходныхПартий, "УчетныйАктивЕПС, Партия, СтрокаПартии");
									ДанныеПереоценки.Вставить("Количество", КоличествоКСписаниюПартии);
									ДанныеПереоценки.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДетальныеЗаписи.Период));
									ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", СуммаКупонаНаОднуОблигацию * КоличествоКСписаниюПартии);
									ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаПриходныхПартий.ДисконтПремияНачисленный * КоличествоКСписаниюПартии / СтрокаПриходныхПартий.Количество);
									ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные * КоличествоКСписаниюПартии / СтрокаПриходныхПартий.Количество);
									ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
									ДанныеПереоценки.Вставить("Стоимость", СтрокаПриходныхПартий.Стоимость * КоличествоКСписаниюПартии / СтрокаПриходныхПартий.Количество);
									
									ДанныеПокупки = Новый Структура;
									ДанныеПокупки.Вставить("НачальныйДисконт", НачальныйДисконт);
									ДанныеПокупки.Вставить("ДатаПокупки", ДатаПокупки);
									ДанныеПокупки.Вставить("ДатаПокупкиНачальная", ДатаПокупкиНачальная);
									ДанныеПокупки.Вставить("КорректировкаЭСПНачальная", КорректировкаЭСПНачальная);
									ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаПокупки);
									ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная / СтрокаПриходныхПартий.Количество);
									ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
									ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", ЦенаПокупкиНачальная);

																
									// #458445 - так как с 01.01.23 переходим на переоценку/начисление %ных доходов при выводах и продажах всегда
									// то, теперь по умолчанию корректировка ЭСП перед выводом продажей начисляться будет (если бумага по АС, конечно)
									// а если клиенту не надо - пусть шлет письмо, будем хардкодить
									// т.е. меняем схему наоборот для корректировки ЭСП
									Если НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20230101' Тогда
									    Если СтрокаПриходныхПартий.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда
											НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке;	// принудительно посчитать ЭСП
										КонецЕсли;
									Иначе	
										// #368618 - спец. письмо от Эволюции "начислить ЭСП" перед выводом
										РоссетиПАО24032021 = (СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РоссетиПАО_002")
												 			   И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20210324'
												 			   И Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправленияДляУчета, ВыборкаДетальныеЗаписи.Период) 
															   		= ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция"));
																	
										Сафмар250521ОткрытиеОткрытиеИПСБ = (Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправленияДляУчета, ВыборкаДетальныеЗаписи.Период) 
															   		= ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар") // САФМАР
																И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20210525'
																И (СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг")
																	ИЛИ СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрХолдинг_004")
																	ИЛИ СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПСБ_013")));
																	
										Если РоссетиПАО24032021 ИЛИ Сафмар250521ОткрытиеОткрытиеИПСБ Тогда
											НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке;	// принудительно посчитать ЭСП
										КонецЕсли; 																	
									КонецЕсли;
									
									ДисконтИКорректировкаЭСП = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(СтрокаПриходныхПартий.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);
									
									Если ДисконтИКорректировкаЭСП = Неопределено Тогда
										Возврат;
									КонецЕсли;
									
									ДисконтПремияНачисленныйПоПроданным = СтрокаПриходныхПартий.ДисконтПремияНачисленный / СтрокаПриходныхПартий.Количество * КоличествоКСписаниюПартии;
									
									НовоеДвижениеПереоценки.ДисконтПремияНачисленный = Окр(ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия, 2) - Окр(ДисконтПремияНачисленныйПоПроданным, 2);
									
									КурсНачисленияДисконтаПремии = Неопределено; // по умолчанию курс - текущий
									Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
										КурсНачисленияДисконтаПремии = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
									КонецЕсли;
									
									СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
											Новый Структура("СуммаДвижение", НовоеДвижениеПереоценки.ДисконтПремияНачисленный), 
											ДанныеПоЦеннойБумаге.ВалютаНоминала,
											ЭтотОбъект.Организация,
											ВыборкаДетальныеЗаписи.Период,
											КурсНачисленияДисконтаПремии,
											Отказ);
									
									НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
									НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода = НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета;
										
									Если НастройкиУчетаОбщие.УтреннееНачислениеДисконтаПремии Тогда 
										
										// смотрим, продавали ли уже эту партию
										СтрокиНачислены = ПартииПоКоторымНачисленыДисконтПремия.НайтиСтроки(Новый Структура("Партия,СтрокаПартии", СтрокаПриходныхПартий.Партия, СтрокаПриходныхПартий.СтрокаПартии));
										Если СтрокиНачислены.Количество() = 0 Тогда // еще не начисляли
											
											СтрокаНачисления = ПартииПоКоторымНачисленыДисконтПремия.Добавить();
											
											СтрокаНачисления.Партия				= СтрокаПриходныхПартий.Партия;
											СтрокаНачисления.СтрокаПартии		= СтрокаПриходныхПартий.СтрокаПартии;
											

											ДанныеПереоценки = Новый Структура("Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
											ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаПриходныхПартий, "Количество, УчетныйАктивЕПС, Партия, СтрокаПартии");
											ДанныеПереоценки.Вставить("ДатаПереоценки", НачалоДня(ВыборкаДетальныеЗаписи.Период));
											ДанныеПереоценки.Вставить("ОценочнаяСуммаКупона", СуммаКупонаНаОднуОблигацию * СтрокаПриходныхПартий.Количество);
											ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаПриходныхПартий.ДисконтПремияНачисленный);
											ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
											ДанныеПереоценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
											ДанныеПереоценки.Вставить("Стоимость", СтрокаПриходныхПартий.Стоимость);
											
											ДанныеПокупки = Новый Структура;
											ДанныеПокупки.Вставить("НачальныйДисконт", НачальныйДисконт);
											ДанныеПокупки.Вставить("ДатаПокупки", ДатаПокупки);
											ДанныеПокупки.Вставить("ДатаПокупкиНачальная", ДатаПокупкиНачальная);
											ДанныеПокупки.Вставить("КорректировкаЭСПНачальная", КорректировкаЭСПНачальная);
											ДанныеПокупки.Вставить("ЦенаПокупки", ЦенаПокупки);
											ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная / СтрокаПриходныхПартий.Количество);
											ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);
											ДанныеПокупки.Вставить("ЦенаПокупкиНачальная", ЦенаПокупкиНачальная);

											// расчитаем в целом по всем
											ДисконтИКорректировкаЭСП = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(СтрокаПриходныхПартий.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);
											
											// начислим на всю партию сразу
											НовоеДвижениеПереоценки.ДисконтПремияНачисленный = Окр(ДисконтИКорректировкаЭСП.ОценочныеДисконтПремия, 2) - Окр(СтрокаПриходныхПартий.ДисконтПремияНачисленный, 2);
											
											НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета  = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижениеПереоценки.ДисконтПремияНачисленный, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
											НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода = НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета;
											
											// в данном случае сразу включаем в стоимость партии всю сумму дисконта и премии
											СтрокаПриходныхПартий.ДисконтПремияНачисленный				= СтрокаПриходныхПартий.ДисконтПремияНачисленный				+ НовоеДвижениеПереоценки.ДисконтПремияНачисленный;
											СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета	= СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета	+ НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета;
											СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода	= СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода		+ НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода;
											
										Иначе
											
											НовоеДвижениеПереоценки.ДисконтПремияНачисленный				= 0;
											
											НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета	= 0;
											НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода	= 0;
											
										КонецЕсли;	
										
									ИначеЕсли НачальныйДисконт > 0 И НовоеДвижениеПереоценки.ДисконтПремияНачисленный > 0 Тогда
										
										//Купили с премией, а новая премия вдруг оказалась больше
										НовоеДвижениеПереоценки.ДисконтПремияНачисленный = 0; // ничего не делаем
										
										НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета	= 0;
										НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода	= 0;
										
									КонецЕсли;
									
									ВыводПоГруппеБудущее = (ЭтоКлиентГруппыБудущее И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг"));
									// уникальная ситуация: по бумаге прилетела досрочная оферта (т.е. надо считать АС) и в этот же день мы ее выводим
									// получается, нужно при выводи посчитать АС, несмотря на то, что будущее не считает АС при выводе
									Если ВыводПоГруппеБудущее
										И СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ФПК_007")
										И НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20251027' Тогда
									
										ВыводПоГруппеБудущее = Ложь; 
									
									КонецЕсли;
									
									Если НЕ ВыводПоГруппеБудущее																								// группа будущее не считает АС при выводе бумаг
										И (НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20230101'																// с 1.1.23 считаем у всех корректировку ЭСП
											ИЛИ НастройкиДляУчетаКорректировкиЭСП.Найти(НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода) <> Неопределено	// те клиенты, что корректировку всегда считают
											ИЛИ РоссетиПАО24032021 ИЛИ Сафмар250521ОткрытиеОткрытиеИПСБ)														// хардкоды
										И НЕ ЭтоПрямоеРЕПО																										// при прямом РЕПО не происходит прекращение признания, поэтому не считаем
										Тогда
										
										НовоеДвижениеПереоценки.КорректировкаЭСП = ДисконтИКорректировкаЭСП.ОценочнаяКорректировкаЭСП
											- СтрокаПриходныхПартий.КорректировкаЭСП / СтрокаПриходныхПартий.Количество * КоличествоКСписаниюПартии;
											
											
										КурсНачисленияКорректировкиЭСП = Неопределено; // по умолчанию курс - текущий
										Если УчитыватьВсеЧастиСтоимостиПоФиксированномуКурсу И ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки <> 0 Тогда
											КурсНачисленияКорректировкиЭСП = ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки; // если есть то будет он, если нет, то будет неопределено и возьмется текущий
										КонецЕсли;
										
										СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
												Новый Структура("СуммаДвижение", НовоеДвижениеПереоценки.КорректировкаЭСП), 
												ДанныеПоЦеннойБумаге.ВалютаНоминала,
												ЭтотОбъект.Организация,
												ВыборкаДетальныеЗаписи.Период,
												КурсНачисленияКорректировкиЭСП,
												Отказ);
										
										НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета = СуммыВВалютеУчета.СуммаДвижение;
										НовоеДвижениеПереоценки.КорректировкаЭСПСНачалаГода = НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета;
										
									КонецЕсли;
									
									НовоеДвижениеПереоценки.ПереоценкаКупонаСНачалаГода = НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета;
									НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
										
								КонецЕсли;
								
								// значения по умолчанию для дефолтных бумаг, если бумага не дефолтная, то ниже эти суммы расчитаются
								СуммаРынок = 0;
								СуммаРынокВВалютеУчета = 0;
								
								Если (НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг") И ПереоценкиПередВыводами <> Неопределено
									ИЛИ НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВыводЦенныхБумаг") И ПереоценкиДляОпераций <> Неопределено)
									И (НЕ ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация ИЛИ НовоеДвижениеПерекурсовка <> Неопределено) // могли перекурсовать дефолтную и теперь нужно переоценить!
									И ПереоцениваемыеГруппыАктивов.Найти(СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель) <> Неопределено
									И НЕ ЭтоПромсвязьПоКоторойНичегоНеНачисляем Тогда
									
									Если НовоеДвижениеПереоценки = Неопределено Тогда
										
										НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
										//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
										
										НовоеДвижениеПереоценки.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
										НовоеДвижениеПереоценки.Период = ВыборкаДетальныеЗаписи.Период;
										НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
										НовоеДвижениеПереоценки.Рынок = ВыборкаДетальныеЗаписи.Рынок;
										НовоеДвижениеПереоценки.УчетныйАктивЕПС = СтрокаПриходныхПартий.УчетныйАктивЕПС;
										НовоеДвижениеПереоценки.ЦеннаяБумага = СтрокаПриходныхПартий.ЦеннаяБумага;
										НовоеДвижениеПереоценки.Партия = СтрокаПриходныхПартий.Партия;
										НовоеДвижениеПереоценки.СтрокаПартии = СтрокаПриходныхПартий.СтрокаПартии;
										НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
										
									КонецЕсли;
									
									Если НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316 Тогда
										
										Если ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
										
											НовоеДвижениеПереоценки.Переоценка =  - (НовоеДвижениеПереоценки.ДисконтПремияНачисленный + НовоеДвижениеПереоценки.КорректировкаЭСП);
											НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета =  - (НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета + НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета);
											НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											Если НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета > 0 Тогда
												НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											КонецЕсли;
										
										КонецЕсли;
										
									Иначе
										
										Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
										
											ПереоценкаПередВыводамиПродажами = ПереоценкиПередВыводами.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага",
																				ВыборкаДетальныеЗаписи.Регистратор,
																				СтрокаПриходныхПартий.ЦеннаяБумага));
											ВыводПродажа = "выводом";
											
										Иначе
											
											ПереоценкаПередВыводамиПродажами = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения",
																				ВыборкаДетальныеЗаписи.Регистратор,
																				СтрокаПриходныхПартий.ЦеннаяБумага,
																				Перечисления.ВидыДвижений.Расход));
											ВыводПродажа = "продажей";
											
										КонецЕсли;
										
																			
										Если ПереоценкаПередВыводамиПродажами.Количество() <> 1 Тогда
											ТекстСообщения = СтрШаблон("Не удалось определить цену бумаги перед %1: %2 / %3", ВыводПродажа, ВыборкаДетальныеЗаписи.Регистратор, СтрокаПриходныхПартий.ЦеннаяБумага); 
											ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
										КонецЕсли;
									
										Если НастройкиПоВидуУчета.УчитыватьПогрешностьОкругленияНаПартиях Тогда // чтобы СЧА с рынком совпадали учитываем погрешность округления
										
											СуммаРынок = Окр(ПереоценкаПередВыводамиПродажами[0].СуммаРынок / ПереоценкаПередВыводамиПродажами[0].Количество * КоличествоКСписаниюПартии, 2);
											СуммаРынокВВалютеУчета = Окр(ПереоценкаПередВыводамиПродажами[0].СуммаРынокВВалютеУчета / ПереоценкаПередВыводамиПродажами[0].Количество * КоличествоКСписаниюПартии, 2);
											
											СуммаРынокВсего = СуммаРынокВсего - СуммаРынок;
											СуммаРынокВВалютеУчетаВсего = СуммаРынокВВалютеУчетаВсего - СуммаРынокВВалютеУчета;
											
											Если КоличествоКСписаниюВсего = 0 Тогда
											
												СуммаРынок = СуммаРынок + СуммаРынокВсего;
												СуммаРынокВВалютеУчета = СуммаРынокВВалютеУчета + СуммаРынокВВалютеУчетаВсего;
												
												СуммаРынокВсего = 0;
												СуммаРынокВВалютеУчетаВсего = 0;
											
											КонецЕсли;
											
										Иначе // а в этом случае - не учитываем
											
											ЦенаКотировки = ПереоценкаПередВыводамиПродажами[0].ЦенаКотировки;
											Если ЦенаКотировки = 0 Тогда // бывает не заполняют
												ЦенаКотировки = ПереоценкаПередВыводамиПродажами[0].СуммаРынок / ПереоценкаПередВыводамиПродажами[0].Количество
											КонецЕсли;
											
											СуммаРынок = Окр(ЦенаКотировки * КоличествоКСписаниюПартии, 2);
											СуммаРынокВВалютеУчета = Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаРынок, ДанныеПоЦеннойБумаге.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период), 2);
											
										КонецЕсли;
										
										Если ПереоценкаПередВыводамиПродажами[0].ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.Дефолт
											И НовоеДвижениеПерекурсовка = Неопределено Тогда
										
											// для дефолта переоценки нет, если только его не курсовали ранее
										
										ИначеЕсли ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
											
											ДобавитьКБалансу = 0;
											ДобавитьКБалансуВВалютеУчета = 0;
											Если ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация Тогда
											
												ДобавитьКБалансу = СтрокаПриходныхПартий.СтоимостьКупона
													+ СтрокаПриходныхПартий.ПереоценкаКупона
													+ СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупона
													+ СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрок;
													
												ДобавитьКБалансуВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета
													+ СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета
													+ СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупонаВВалютеУчета
													+ СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета;
											
											КонецЕсли;
											
											СуммаБаланс = (СтрокаПриходныхПартий.Стоимость
															+ СтрокаПриходныхПартий.Переоценка
															+ СтрокаПриходныхПартий.ДисконтПремияНачисленный
															+ СтрокаПриходныхПартий.КорректировкаЭСП
															+ СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные
															+ ДобавитьКБалансу)
														/ СтрокаПриходныхПартий.Количество
														* КоличествоКСписаниюПартии;
											СуммаБаланс = Окр(СуммаБаланс, 2);
										    Если НЕ НастройкиУчетаОбщие.УтреннееНачислениеДисконтаПремии Тогда // у тех, кто УтреннееНачислениеДисконтаПремии дисконт уже включен
												СуммаБаланс = СуммаБаланс + НовоеДвижениеПереоценки.ДисконтПремияНачисленный;
												СуммаБаланс = СуммаБаланс + НовоеДвижениеПереоценки.КорректировкаЭСП;
											КонецЕсли;
											
											НовоеДвижениеПереоценки.Переоценка = СуммаРынок - СуммаБаланс;
											
											СуммаБалансВВалютеУчета = (СтрокаПриходныхПартий.СтоимостьВВалютеУчета
															+ СтрокаПриходныхПартий.ПереоценкаВВалютеУчета
															+ СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета
															+ СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета
															+ СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
															+ ДобавитьКБалансуВВалютеУчета)
														/ СтрокаПриходныхПартий.Количество
														* КоличествоКСписаниюПартии;
														
											Если НовоеДвижениеПерекурсовка <> Неопределено Тогда
												СуммаБалансВВалютеУчета = СуммаБалансВВалютеУчета + НовоеДвижениеПерекурсовка.КорректировкаЭСПВВалютеУчета;
											КонецЕсли;
														
											СуммаБалансВВалютеУчета = Окр(СуммаБалансВВалютеУчета, 2);
										    Если НЕ НастройкиУчетаОбщие.УтреннееНачислениеДисконтаПремии Тогда // у тех, кто УтреннееНачислениеДисконтаПремии дисконт уже включен
												СуммаБалансВВалютеУчета = СуммаБалансВВалютеУчета + НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета;
												СуммаБалансВВалютеУчета = СуммаБалансВВалютеУчета + НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета;
											КонецЕсли;
											
											НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СуммаРынокВВалютеУчета - СуммаБалансВВалютеУчета;
												
											НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											Если НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета > 0 Тогда
												НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											КонецЕсли;
											
										Иначе
												
											СуммаБаланс = (СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка)
														/ СтрокаПриходныхПартий.Количество
														* КоличествоКСписаниюПартии;
											
											НовоеДвижениеПереоценки.Переоценка = СуммаРынок - СуммаБаланс; 
											
											СуммаБалансВВалютеУчета = (СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета)
														/ СтрокаПриходныхПартий.Количество
														* КоличествоКСписаниюПартии;
											
											НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СуммаРынокВВалютеУчета - СуммаБалансВВалютеУчета; 
											НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											Если НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета > 0 Тогда
												НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											КонецЕсли;
												
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
							
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
							
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
								
								ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий); // списали её всю
								КоличествоКСписанию = КоличествоКСписанию - СтрокаПриходныхПартий.Количество;
								
							Иначе //спишем пропорционально
								
								КоэффициентСписания = КоличествоКСписанию / СтрокаПриходныхПартий.Количество;
								
								КоэффициентСписанияРесурсовСНачалаГода = КоэффициентСписания;
								Если НастройкиУчетаОбщие.ОтражатьПартииНаЛицевыхСчетах И НЕ Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
									КоэффициентСписанияРесурсовСНачалаГода = 0;	
								КонецЕсли;
								
								
								НовоеДвижение.Количество = КоличествоКСписанию;
								
								// #315386 - резервы теперь участвуют в динамическом расчете - это нужно для СЧА
								НовоеДвижение.СуммаРезервовПодОбесценение = СтрокаПриходныхПартий.СуммаРезервовПодОбесценение * КоэффициентСписания;
								СтрокаПриходныхПартий.СуммаРезервовПодОбесценение = СтрокаПриходныхПартий.СуммаРезервовПодОбесценение - НовоеДвижение.СуммаРезервовПодОбесценение;
								
								Если РассчитыватьСтоимости Тогда
								
									НовоеДвижение.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания;
									НовоеДвижение.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания;
									
									Если СтрокаПриходныхПартий.ВключатьРасходыПоПокупкеВСтоимость Тогда 
										НовоеДвижение.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания;
										НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания;
									Иначе 
										НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
										НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
									КонецЕсли;
									
									НовоеДвижение.РасходыПриПокупкеСНачалаГода = СтрокаПриходныхПартий.РасходыПриПокупкеСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
									НовоеДвижение.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания;
									НовоеДвижение.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания;
									НовоеДвижение.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания;
									НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета * КоэффициентСписания;
									НовоеДвижение.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания;
									НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета * КоэффициентСписания;
									НовоеДвижение.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
									НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная * КоэффициентСписанияРесурсовСНачалаГода;
									НовоеДвижение.РазницаПервоначальногоПризнанияСНачалаГода = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
									НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные * КоэффициентСписания;
									НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета * КоэффициентСписания;
									НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная * КоэффициентСписания;
									НовоеДвижение.КурсовыеРазницыСНачалаГода = СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
									
									НовоеДвижение.СуммаРезервовПодОбесценениеКупона = СтрокаПриходныхПартий.СуммаРезервовПодОбесценениеКупона * КоэффициентСписания;
									НовоеДвижение.СуммаРезервовПоСомнительнымДолгам = СтрокаПриходныхПартий.СуммаРезервовПоСомнительнымДолгам * КоэффициентСписания;
									
									Если ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
										
										НовоеДвижение.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания;
										НовоеДвижение.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета * КоэффициентСписания;
										НовоеДвижение.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания;
										НовоеДвижение.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета * КоэффициентСписания;
										НовоеДвижение.СуммаЧастичногоПогашения = СтрокаПриходныхПартий.СуммаЧастичногоПогашения * КоэффициентСписания;
										НовоеДвижение.ДисконтПремия = СтрокаПриходныхПартий.ДисконтПремия * КоэффициентСписания;
										НовоеДвижение.ДисконтПремияПокупки = СтрокаПриходныхПартий.ДисконтПремияПокупки * КоэффициентСписания;
										НовоеДвижение.ДисконтПремияНачисленный = СтрокаПриходныхПартий.ДисконтПремияНачисленный * КоэффициентСписания;
										НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета * КоэффициентСписания;
										НовоеДвижение.КорректировкаЭСП = СтрокаПриходныхПартий.КорректировкаЭСП * КоэффициентСписания;
										НовоеДвижение.КорректировкаЭСПВВалютеУчета = СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета * КоэффициентСписания;
										
										НовоеДвижение.ПереоценкаКупонаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
										НовоеДвижение.КорректировкаЭСПСНачалаГода = СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
										НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода = СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
										
										НовоеДвижение.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала * КоэффициентСписания;
										НовоеДвижение.ИндексацияНоминалаСНачалаГода = СтрокаПриходныхПартий.ИндексацияНоминалаСНачалаГода * КоэффициентСписанияРесурсовСНачалаГода;
										
										НовоеДвижение.ПогашениеКупонаНеИсполненноеВСрок = СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрок * КоэффициентСписания;
										НовоеДвижение.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета = СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета * КоэффициентСписания;
										
										НовоеДвижение.ЗадолженностьПоПогашениюТела = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТела * КоэффициентСписания;
										НовоеДвижение.ЗадолженностьПоПогашениюТелаВВалютеУчета = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТелаВВалютеУчета * КоэффициентСписания;
										
										НовоеДвижение.ЗадолженностьПоПогашениюКупона = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупона * КоэффициентСписания;
										НовоеДвижение.ЗадолженностьПоПогашениюКупонаВВалютеУчета = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупонаВВалютеУчета * КоэффициентСписания;

									КонецЕсли;

									//#414202 - согласно решению бухгалтерии если при частичном выводе(списании, продажи) партии СтоимостьПокупки или ДисконтПремияПокупки делятся
									// между выводимыми и остающимися бумагами с точностью 0,005 то остаться должно БОЛЬШЕ, а уйти МЕНЬШЕ 
									// Например: было 126337,50руб на 1010700 бумаг, выводим 11607 бумаг и сумма разбивается на 1450,875руб (выводим) и 124886,625руб (остается)
									// согласно решению вывести мы должны 1450,87руб, а остаться 124886,63руб
									// такое бывает только для бумаг по АС(у них может быть нецелая цена покупки) и когда из пртии с четным количеством выводим нечетную часть
									Если ДанныеПоЦеннойБумаге.ЭтоОблигация И ПереоцениваемыеГруппыАктивов.Найти(СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель) = Неопределено Тогда	// бумага по АС
										
										СтоимостьПокупкиРасчетная = Окр(СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания, 15); // уберем дальние незаметные хвостики
										Если НовоеДвижение.СтоимостьПокупки > СтоимостьПокупкиРасчетная	И НовоеДвижение.СтоимостьПокупки - СтоимостьПокупкиРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.СтоимостьПокупки = НовоеДвижение.СтоимостьПокупки - 0.01;
										КонецЕсли;
										
										ДисконтПремияРасчетная = Окр(СтрокаПриходныхПартий.ДисконтПремия * КоэффициентСписания, 15);
										Если НовоеДвижение.ДисконтПремия > ДисконтПремияРасчетная	И НовоеДвижение.ДисконтПремия - ДисконтПремияРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.ДисконтПремия = НовоеДвижение.ДисконтПремия - 0.01;
										КонецЕсли;
										
										ДисконтПремияПокупкиРасчетная = Окр(СтрокаПриходныхПартий.ДисконтПремияПокупки * КоэффициентСписания, 15);
										Если НовоеДвижение.ДисконтПремияПокупки > ДисконтПремияПокупкиРасчетная	И НовоеДвижение.ДисконтПремияПокупки - ДисконтПремияПокупкиРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.ДисконтПремияПокупки = НовоеДвижение.ДисконтПремияПокупки - 0.01;
										КонецЕсли;
										
										РасходыПриПокупкеВСтоимостиРасчетная = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания, 15);
										Если НовоеДвижение.РасходыПриПокупкеВСтоимости > РасходыПриПокупкеВСтоимостиРасчетная	И НовоеДвижение.РасходыПриПокупкеВСтоимости - РасходыПриПокупкеВСтоимостиРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.РасходыПриПокупкеВСтоимости = НовоеДвижение.РасходыПриПокупкеВСтоимости - 0.01;
										КонецЕсли;
										
										РасходыПриПокупкеВСтоимостиВВалютеУчетаРасчетная = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания, 15);
										Если НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета > РасходыПриПокупкеВСтоимостиВВалютеУчетаРасчетная	И НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета - РасходыПриПокупкеВСтоимостиВВалютеУчетаРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета - 0.01;
										КонецЕсли;
										
									КонецЕсли;
									
									
									Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")                       // по указанию Татьяны это теперь только для выводов бумаг
										И ПереоцениваемыеГруппыАктивов.Найти(СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель) <> Неопределено Тогда // но разумеется только для переоцениваемых активов
									
										// мы пропорционально списываем части стоимости бумаги и к сожалению можем попасть на округление, нужно это учесть т.к. при выводе например мы должны биться со СЧА по общей сумме вывода
										// для акций куски стоимости это Стоимость и Переоценка
										// для облигаций еще добавятся ДисконтПремияНачисленный и КорректировкаЭСП (конечно, если стоит настройка ВключатьПроцентныеДоходыИКорректировкиВБалансовуюСтоимостьПриПереоценке, но она у всех стоит) 
										// корректировку ПП не буду добавлять из-за специфичности - с ней буду работать, когда буду делать общую задачу по крорректировке ПП
										ОбщаяСумма = СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка;
										ОбщаяСуммаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета;
										
										СуммаСписания = НовоеДвижение.Стоимость + НовоеДвижение.Переоценка;
										СуммаСписанияВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.ПереоценкаВВалютеУчета;
										
										Если ДанныеПоЦеннойБумаге.ЭтоОблигация И НастройкиУчетаОбщие.ВключатьПроцентныеДоходыИКорректировкиВБалансовуюСтоимостьПриПереоценке Тогда
											ОбщаяСумма = ОбщаяСумма + СтрокаПриходныхПартий.ДисконтПремияНачисленный + СтрокаПриходныхПартий.КорректировкаЭСП;
											ОбщаяСуммаВВалютеУчета = ОбщаяСуммаВВалютеУчета + СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета + СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета;
											
											СуммаСписания = СуммаСписания + НовоеДвижение.ДисконтПремияНачисленный + НовоеДвижение.КорректировкаЭСП;
											СуммаСписанияВВалютеУчета = СуммаСписанияВВалютеУчета + НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета + НовоеДвижение.КорректировкаЭСПВВалютеУчета;
										КонецЕсли;
										
										ОбщаяСумма = Окр(ОбщаяСумма * КоэффициентСписания, 2);
										ОбщаяСуммаВВалютеУчета = Окр(ОбщаяСуммаВВалютеУчета * КоэффициентСписания, 2);
										
										Если ОбщаяСумма <> СуммаСписания Тогда
											НовоеДвижение.Переоценка = НовоеДвижение.Переоценка + ОбщаяСумма - СуммаСписания;
										КонецЕсли;
										Если ОбщаяСуммаВВалютеУчета <> СуммаСписанияВВалютеУчета Тогда
											НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + ОбщаяСуммаВВалютеУчета - СуммаСписанияВВалютеУчета;
										КонецЕсли;
									
									КонецЕсли; 
									
									СтрокаПриходныхПартий.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
									СтрокаПриходныхПартий.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона - НовоеДвижение.СтоимостьПокупкиКупона;
									СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости - НовоеДвижение.РасходыПриПокупкеВСтоимости;
									СтрокаПриходныхПартий.РасходыПриПокупкеСНачалаГода = СтрокаПриходныхПартий.РасходыПриПокупкеСНачалаГода - НовоеДвижение.РасходыПриПокупкеСНачалаГода;
									СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета - НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета;
									СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияСНачалаГода = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияСНачалаГода - НовоеДвижение.РазницаПервоначальногоПризнанияСНачалаГода;
									СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные - НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
									СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная - НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная;
									СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета - НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
									СтрокаПриходныхПартий.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости - НовоеДвижение.ПереоценкаВСтоимости;
									СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - НовоеДвижение.ПереоценкаКупонаВСтоимости;
									СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
									СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
									СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
									СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета - НовоеДвижение.ПереоценкаВВалютеУчета;
									СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода - НовоеДвижение.ПереоценкаСНачалаГода;
									СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная - НовоеДвижение.ПереоценкаСНачалаГодаПоложительная;
									СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода = СтрокаПриходныхПартий.КурсовыеРазницыСНачалаГода - НовоеДвижение.КурсовыеРазницыСНачалаГода;
									
									СтрокаПриходныхПартий.СуммаРезервовПодОбесценениеКупона = СтрокаПриходныхПартий.СуммаРезервовПодОбесценениеКупона - НовоеДвижение.СуммаРезервовПодОбесценениеКупона;
									СтрокаПриходныхПартий.СуммаРезервовПоСомнительнымДолгам = СтрокаПриходныхПартий.СуммаРезервовПоСомнительнымДолгам - НовоеДвижение.СуммаРезервовПоСомнительнымДолгам;
									
									Если ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
									
										СтрокаПриходныхПартий.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона - НовоеДвижение.СтоимостьКупона;
										СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета - НовоеДвижение.СтоимостьКупонаВВалютеУчета;
										СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона - НовоеДвижение.ПереоценкаКупона;
										СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета - НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
										СтрокаПриходныхПартий.СуммаЧастичногоПогашения = СтрокаПриходныхПартий.СуммаЧастичногоПогашения - НовоеДвижение.СуммаЧастичногоПогашения;
										СтрокаПриходныхПартий.ДисконтПремия = СтрокаПриходныхПартий.ДисконтПремия - НовоеДвижение.ДисконтПремия;
										СтрокаПриходныхПартий.ДисконтПремияПокупки = СтрокаПриходныхПартий.ДисконтПремияПокупки - НовоеДвижение.ДисконтПремияПокупки;
										СтрокаПриходныхПартий.ДисконтПремияНачисленный = СтрокаПриходныхПартий.ДисконтПремияНачисленный - НовоеДвижение.ДисконтПремияНачисленный;
										СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета = СтрокаПриходныхПартий.ДисконтПремияНачисленныйВВалютеУчета - НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета;
										СтрокаПриходныхПартий.КорректировкаЭСП = СтрокаПриходныхПартий.КорректировкаЭСП - НовоеДвижение.КорректировкаЭСП;
										СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета = СтрокаПриходныхПартий.КорректировкаЭСПВВалютеУчета - НовоеДвижение.КорректировкаЭСПВВалютеУчета;
										
										СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаКупонаСНачалаГода - НовоеДвижение.ПереоценкаКупонаСНачалаГода;
										СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода = СтрокаПриходныхПартий.КорректировкаЭСПСНачалаГода - НовоеДвижение.КорректировкаЭСПСНачалаГода;
										СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода = СтрокаПриходныхПартий.ДисконтПремияНачисленныйСНачалаГода - НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода;
										
										СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала - НовоеДвижение.ИндексацияНоминала;
										СтрокаПриходныхПартий.ИндексацияНоминалаСНачалаГода = СтрокаПриходныхПартий.ИндексацияНоминалаСНачалаГода - НовоеДвижение.ИндексацияНоминалаСНачалаГода;
										
										СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрок = СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрок - НовоеДвижение.ПогашениеКупонаНеИсполненноеВСрок;
										СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета = СтрокаПриходныхПартий.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета - НовоеДвижение.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета;
										
										СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТела = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТела - НовоеДвижение.ЗадолженностьПоПогашениюТела;
										СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТелаВВалютеУчета = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюТелаВВалютеУчета - НовоеДвижение.ЗадолженностьПоПогашениюТелаВВалютеУчета;
										
										СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупона = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупона - НовоеДвижение.ЗадолженностьПоПогашениюКупона;
										СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупонаВВалютеУчета = СтрокаПриходныхПартий.ЗадолженностьПоПогашениюКупонаВВалютеУчета - НовоеДвижение.ЗадолженностьПоПогашениюКупонаВВалютеУчета;
										
									КонецЕсли;
									
								КонецЕсли;
								
								СтрокаПриходныхПартий.Количество = СтрокаПриходныхПартий.Количество - НовоеДвижение.Количество;
								
								КоличествоКСписанию = 0;
								
							КонецЕсли;

							Если РассчитыватьСтоимости Тогда
							
								Если ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
									
									Если НовоеДвижениеПереоценки <> Неопределено Тогда
										
										НовоеДвижение.ПереоценкаКупона = НовоеДвижение.ПереоценкаКупона + НовоеДвижениеПереоценки.ПереоценкаКупона;
										НовоеДвижение.ПереоценкаКупонаВВалютеУчета = НовоеДвижение.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета;
										
										НовоеДвижение.КорректировкаЭСП = НовоеДвижение.КорректировкаЭСП + НовоеДвижениеПереоценки.КорректировкаЭСП;
										НовоеДвижение.КорректировкаЭСПВВалютеУчета = НовоеДвижение.КорректировкаЭСПВВалютеУчета + НовоеДвижениеПереоценки.КорректировкаЭСПВВалютеУчета;
										
										НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаСНачалаГода + НовоеДвижениеПереоценки.ПереоценкаКупонаСНачалаГода;
										НовоеДвижение.КорректировкаЭСПСНачалаГода = НовоеДвижение.КорректировкаЭСПСНачалаГода + НовоеДвижениеПереоценки.КорректировкаЭСПСНачалаГода;
										
										Если НЕ НастройкиУчетаОбщие.УтреннееНачислениеДисконтаПремии Тогда // добавляем у кого не усреднения, у тех у кого есть они уже запиханы в партию выше
										
											НовоеДвижение.ДисконтПремияНачисленный				= НовоеДвижение.ДисконтПремияНачисленный				+ НовоеДвижениеПереоценки.ДисконтПремияНачисленный;
											НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета	= НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета	+ НовоеДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета;
											НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода	= НовоеДвижение.ДисконтПремияНачисленныйСНачалаГода		+ НовоеДвижениеПереоценки.ДисконтПремияНачисленныйСНачалаГода;
										
										КонецЕсли;
										
									
										НовоеДвижение.Переоценка = НовоеДвижение.Переоценка + НовоеДвижениеПереоценки.Переоценка;
										НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
										НовоеДвижение.ПереоценкаСНачалаГода = НовоеДвижение.ПереоценкаСНачалаГода + НовоеДвижениеПереоценки.ПереоценкаСНачалаГода;
										НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = НовоеДвижение.ПереоценкаСНачалаГодаПоложительная + НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная;
										
									    // сверим сумму списания с той суммой, что должна была уйти по рынку
										СуммаСписания = НовоеДвижение.Стоимость
														+ НовоеДвижение.Переоценка
														+ НовоеДвижение.ДисконтПремияНачисленный
														+ НовоеДвижение.КорректировкаЭСП
														+ НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
										
										СуммаСписанияВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета
														+ НовоеДвижение.ПереоценкаВВалютеУчета
														+ НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета
														+ НовоеДвижение.КорректировкаЭСПВВалютеУчета
														+ НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
														
										Если ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация Тогда
										
											СуммаСписания = СуммаСписания
												+ НовоеДвижение.СтоимостьКупона
												+ НовоеДвижение.ПереоценкаКупона
												+ НовоеДвижение.ЗадолженностьПоПогашениюКупона
												+ НовоеДвижение.ПогашениеКупонаНеИсполненноеВСрок;
												
											СуммаСписанияВВалютеУчета = СуммаСписанияВВалютеУчета
												+ НовоеДвижение.СтоимостьКупонаВВалютеУчета
												+ НовоеДвижение.ПереоценкаКупонаВВалютеУчета
												+ НовоеДвижение.ЗадолженностьПоПогашениюКупонаВВалютеУчета
												+ НовоеДвижение.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета;
										
										КонецЕсли;				
										
										// если ушла не та сумма, что должна уйти по рынку, откорректируем ее переоценкой, но, разумеется, это только для ССных активов
										Если ПереоцениваемыеГруппыАктивов.Найти(СтрокаПриходныхПартий.УчетныйАктивЕПС.Родитель) <> Неопределено
											И (СуммаСписания <> СуммаРынок ИЛИ СуммаСписанияВВалютеУчета <> СуммаРынокВВалютеУчета) // разумеется, если мы ввобще переоцениваем перед выбытием
											И (НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг") И ПереоценкиПередВыводами <> Неопределено
												ИЛИ НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВыводЦенныхБумаг") И ПереоценкиДляОпераций <> Неопределено)
											И (НЕ ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация ИЛИ НовоеДвижениеПерекурсовка <> Неопределено) Тогда
											
											СписалиЛишку = СуммаСписания - СуммаРынок;
											СписалиЛишкуВВалютеУчета = СуммаСписанияВВалютеУчета - СуммаРынокВВалютеУчета;
											
											НовоеДвижение.Переоценка = НовоеДвижение.Переоценка - СписалиЛишку;
											НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета - СписалиЛишкуВВалютеУчета;
											НовоеДвижение.ПереоценкаСНачалаГода = НовоеДвижение.ПереоценкаСНачалаГода - СписалиЛишкуВВалютеУчета;
											НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = НовоеДвижение.ПереоценкаСНачалаГодаПоложительная - СписалиЛишкуВВалютеУчета;
											
											НовоеДвижениеПереоценки.Переоценка = НовоеДвижениеПереоценки.Переоценка - СписалиЛишку;
											НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета - СписалиЛишкуВВалютеУчета;
											НовоеДвижениеПереоценки.ПереоценкаСНачалаГода = НовоеДвижениеПереоценки.ПереоценкаСНачалаГода - СписалиЛишкуВВалютеУчета;
											НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная = НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная - СписалиЛишкуВВалютеУчета;
											
										КонецЕсли;
										
									КонецЕсли;
									
									Если СчитаемРезервыПередВыводом // считать резервы перед выводом нада + у нас вывод + они вообще есть
										И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")
										И НовоеДвижение.СуммаРезервовПодОбесценение <> 0 Тогда
									
										МассивДвиженийРезервов.Добавить(Новый Структура("ДвижениеПриход, ДвижениеРасход", НовоеДвижениеПереоценки, НовоеДвижение));
									
									КонецЕсли;
									
								Иначе
									
									Если НовоеДвижениеПереоценки <> Неопределено Тогда
									
										НовоеДвижение.Переоценка = НовоеДвижение.Переоценка + НовоеДвижениеПереоценки.Переоценка;
										НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
										НовоеДвижение.ПереоценкаСНачалаГода = НовоеДвижение.ПереоценкаСНачалаГода + НовоеДвижениеПереоценки.ПереоценкаСНачалаГода;
										НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = НовоеДвижение.ПереоценкаСНачалаГодаПоложительная + НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная;
									
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли; 
							
							Если ЭтоПрямоеРЕПО Тогда
								
								// сделаем движение по продаже РЕПО
								НовоеДвижениеРЕПО = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
								
								ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, НовоеДвижение);
								
								НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Приход;
								НовоеДвижениеРЕПО.ПродажаРЕПО = ВыборкаДетальныеЗаписи.Партия;
								НовоеДвижениеРЕПО.СтрокаПродажиРЕПО = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								// добавим партии РЕПО
								СтрокаПартииПроданныеВРЕПО = ПартииПроданныеВРЕПО.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаПартииПроданныеВРЕПО, НовоеДвижениеРЕПО);
								
							КонецЕсли;
							
							
							Если КоличествоКСписанию = 0 Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если КоличествоКСписанию > 0 И ЭтоПрямоеРЕПО
							И ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Расход И НастройкиУчетаОбщие.РазрешатьКороткуюПозициюПоСделкамРЕПОвЕПС Тогда // при прямом РЕПО, если не хватило собственных партий - пытаемся добрать из взятых в РЕПО
							
							Для Каждого СтрокаПриходныхПартий Из ПартииКупленныеПоРЕПО Цикл
								
								Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
									КоличествоКСписаниюПартии = СтрокаПриходныхПартий.Количество;
								Иначе
									КоличествоКСписаниюПартии = КоличествоКСписанию;
								КонецЕсли;
								
								КоличествоКСписаниюВсего = КоличествоКСписаниюВсего - КоличествоКСписаниюПартии;
								
								Если РассчитыватьСтоимости Тогда
									
									НовоеДвижениеПерекурсовка = Неопределено;
									Если ДанныеПоЦеннойБумаге.ФиксированныйКурсПереоценки = 0 Тогда
										
										НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, КоличествоКСписаниюПартии, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
										
									КонецЕсли;
									
									
									Если ДанныеПоЦеннойБумаге.ЭтоОблигация И НЕ ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация Тогда
										
										НовоеДвижениеПереоценки = ДоначислитьКупонРЕПО(ВыборкаДетальныеЗаписи.Регистратор,
										ВыборкаДетальныеЗаписи.Период,
										ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО,
										СтрокаПриходныхПартий,
										СуммаКупонаНаОднуОблигацию,
										КоличествоКСписаниюПартии,
										0,
										Отказ);
										
										ЦенаПокупкиНачальная = СтрокаПриходныхПартий.Стоимость / СтрокаПриходныхПартий.Количество;
										
										Если ДатыИЦеныПокупки = Неопределено Тогда
											
											НачальныйДисконт  = 0;
											
											Если ДанныеПоЦеннойБумаге.Амортизационная Тогда
												ЦенаПокупки	= Справочники.Облигации.ПолучитьНоминал(СтрокаПриходныхПартий.ЦеннаяБумага, ДатаПокупки) + НачальныйДисконт;
											Иначе
												ЦенаПокупки	= СтрокаПриходныхПартий.Номинал + НачальныйДисконт;
											КонецЕсли;
											ЦенаПокупкиКупона	= Окр(СтрокаПриходныхПартий.СтоимостьКупона / СтрокаПриходныхПартий.Количество, РазрядностьДробнойЧасти);
											
										Иначе
											
											ДатаИЦенаПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаПриходныхПартий.НомерСтроки));
											
											НачальныйДисконт 	= ДатаИЦенаПокупки[0].НачальныйДисконт;
											ЦенаПокупки 		= ДатаИЦенаПокупки[0].ЦенаПокупки;
											ЦенаПокупкиКупона 	= ДатаИЦенаПокупки[0].ЦенаКупона;
											
										КонецЕсли;
										
										НовоеДвижениеПереоценки.ПереоценкаКупонаСНачалаГода = НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета;
										НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
										
									КонецЕсли;
									
								КонецЕсли;
								
								НовоеДвижение = ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Добавить();
								
								ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
								
								НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
									
									ПриходныеПартииКУдалениюРЕПО.Добавить(СтрокаПриходныхПартий); // списали её всю
									КоличествоКСписанию = КоличествоКСписанию - СтрокаПриходныхПартий.Количество;
									
								Иначе //спишем пропорционально
									
									КоэффициентСписания = КоличествоКСписанию / СтрокаПриходныхПартий.Количество;
									
									НовоеДвижение.Количество = КоличествоКСписанию;
									
									Если РассчитыватьСтоимости Тогда
										
										НовоеДвижение.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания;
										НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета * КоэффициентСписания;
										НовоеДвижение.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания;
										НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета * КоэффициентСписания;
										
										Если ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
											
											НовоеДвижение.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания;
											НовоеДвижение.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета * КоэффициентСписания;
											НовоеДвижение.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания;
											НовоеДвижение.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета * КоэффициентСписания;
											
										КонецЕсли;
										
										СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
										СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
										СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
										СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета - НовоеДвижение.ПереоценкаВВалютеУчета;
										СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода - НовоеДвижение.ПереоценкаСНачалаГода;
										СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная - НовоеДвижение.ПереоценкаСНачалаГодаПоложительная;
										
										Если ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
											
											СтрокаПриходныхПартий.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона - НовоеДвижение.СтоимостьКупона;
											СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета - НовоеДвижение.СтоимостьКупонаВВалютеУчета;
											СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона - НовоеДвижение.ПереоценкаКупона;
											СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета - НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
											
										КонецЕсли;
										
									КонецЕсли;
									
									СтрокаПриходныхПартий.Количество = СтрокаПриходныхПартий.Количество - НовоеДвижение.Количество;
									
									КоличествоКСписанию = 0;
									
								КонецЕсли;
								
								Если РассчитыватьСтоимости Тогда
									
									Если ДанныеПоЦеннойБумаге.ЭтоОблигация Тогда
										
										Если ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация Тогда
											// для дефолтных бумаг
										Иначе
											
											НовоеДвижение.ПереоценкаКупона = НовоеДвижение.ПереоценкаКупона + НовоеДвижениеПереоценки.ПереоценкаКупона;
											НовоеДвижение.ПереоценкаКупонаВВалютеУчета = НовоеДвижение.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета;
											
											НовоеДвижение.ПереоценкаКупонаСНачалаГода = НовоеДвижение.ПереоценкаКупонаСНачалаГода + НовоеДвижениеПереоценки.ПереоценкаКупонаСНачалаГода;
											
										КонецЕсли;
										
										Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей И НЕ ДанныеПоЦеннойБумаге.ЭтоДефолтнаяОблигация Тогда
											
											НовоеДвижение.Переоценка = НовоеДвижение.Переоценка + НовоеДвижениеПереоценки.Переоценка;
											НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											НовоеДвижение.ПереоценкаСНачалаГода = НовоеДвижение.ПереоценкаСНачалаГода + НовоеДвижениеПереоценки.ПереоценкаСНачалаГода;
											НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = НовоеДвижение.ПереоценкаСНачалаГодаПоложительная + НовоеДвижениеПереоценки.ПереоценкаСНачалаГодаПоложительная;
											
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЕсли; 
								
								Если ЭтоПрямоеРЕПО Тогда
									
									// сделаем движение по продаже РЕПО
									НовоеДвижениеРЕПО = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
									
									ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, НовоеДвижение);
									
									НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Приход;
									НовоеДвижениеРЕПО.ПродажаРЕПО = ВыборкаДетальныеЗаписи.Партия;
									НовоеДвижениеРЕПО.СтрокаПродажиРЕПО = ВыборкаДетальныеЗаписи.СтрокаПартии;
									НовоеДвижениеРЕПО.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО;
									
									// добавим партии РЕПО
									СтрокаПартииПроданныеВРЕПО = ПартииПроданныеВРЕПО.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаПартииПроданныеВРЕПО, НовоеДвижениеРЕПО);
									
								КонецЕсли;
								
								
								Если КоличествоКСписанию = 0 Тогда
									Прервать;
								КонецЕсли;
								
							КонецЦикла;
							
							
						КонецЕсли;
						
						Если КоличествоКСписанию > 0 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не распределилась:" + Строка(СписываемыйУчетныйАктивЕПС) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " по " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
							Сообщить(КоличествоКСписанию);
							Отказ = Истина;
						КонецЕсли;
						
						УдалялиПриходныеПартии = Ложь;
						Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
							ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
							УдалялиПриходныеПартии = Истина;
						КонецЦикла;
						
						Если УдалялиПриходныеПартии Тогда
							ПриходныеПартииКоличество = ПриходныеПартии.Количество();
							Для Инд = 1 По ПриходныеПартииКоличество Цикл
								ПриходныеПартии[Инд - 1].НомерСтроки = Инд;
							КонецЦикла;
						КонецЕсли;
						
						Для Каждого СтрокаПриходныхПартийКУдалениюРЕПО Из ПриходныеПартииКУдалениюРЕПО Цикл
							ПартииКупленныеПоРЕПО.Удалить(СтрокаПриходныхПартийКУдалениюРЕПО);
						КонецЦикла;
						
					КонецЦикла;
				
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		// теперь таблица приходных партий содержит только конечные остатки, которые мы и положим в соответствующую таб. часть обработки
		Для каждого СтрокаПартии Из ПриходныеПартии Цикл
			ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартий.Добавить(), СтрокаПартии);
		КонецЦикла;
		
	КонецЦикла;
	
	// посчитаем резервы и откорректируем движения
	Если СчитаемРезервыПередВыводом И МассивДвиженийРезервов.Количество() > 0 Тогда 
		
		АктивыПоАС = ПустаяТаблица.СкопироватьКолонки("УчетныйАктивЕПС, Партия, СтрокаПартии, ДатаПокупки, Количество, Стоимость");
		АктивыПоАС.Колонки.Добавить("ЦеннаяБумага",									Метаданные.ОпределяемыеТипы.СубъектыАналитики.Тип);
		АктивыПоАС.Колонки.Добавить("ОценочныеДисконтПремия",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		АктивыПоАС.Колонки.Добавить("ОценочнаяКорректировкаЭСП",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		АктивыПоАС.Колонки.Добавить("ОценочнаяРазницаППНеНаблюдаемыеДанные",		Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		АктивыПоАС.Колонки.Добавить("ОценочнаяСуммаКупона",							Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		АктивыПоАС.Колонки.Добавить("СуммаРезервовПодОбесценение",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		АктивыПоАС.Колонки.Добавить("НачальнаяРазницаППНеНаблюдаемыеДанные",		Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		АктивыПоАС.Колонки.Добавить("ЗадолженностьПоПогашениюКупонаВВалютеУчета",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		АктивыПоАС.Колонки.Добавить("Эмитент",										Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
		АктивыПоАС.Колонки.Добавить("НомерСтрокиПриход",							Новый ОписаниеТипов("Число"));
		АктивыПоАС.Колонки.Добавить("НомерСтрокиРасход",							Новый ОписаниеТипов("Число"));
		АктивыПоАС.Колонки.Добавить("Обработано",									Новый ОписаниеТипов("Булево"));
		АктивыПоАС.Колонки.Добавить("EAD",											Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
			
		Для каждого СтрокаДвиженийРезервов Из МассивДвиженийРезервов Цикл
			
			СтрокаДвиженийВыводРезервов = СтрокаДвиженийРезервов.ДвижениеРасход;
			
			СтрокаАктивыПоАС = АктивыПоАС.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаАктивыПоАС, СтрокаДвиженийВыводРезервов, "ЦеннаяБумага, УчетныйАктивЕПС, Партия, СтрокаПартии, ДатаПокупки, Количество"); 
			
			СтрокаАктивыПоАС.Стоимость									= СтрокаДвиженийВыводРезервов.СтоимостьВВалютеУчета;
			СтрокаАктивыПоАС.ОценочныеДисконтПремия						= СтрокаДвиженийВыводРезервов.ДисконтПремияНачисленныйВВалютеУчета;
			СтрокаАктивыПоАС.ОценочнаяКорректировкаЭСП					= СтрокаДвиженийВыводРезервов.КорректировкаЭСПВВалютеУчета;
			СтрокаАктивыПоАС.ОценочнаяРазницаППНеНаблюдаемыеДанные		= СтрокаДвиженийВыводРезервов.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
			СтрокаАктивыПоАС.ОценочнаяСуммаКупона						= СтрокаДвиженийВыводРезервов.СтоимостьКупонаВВалютеУчета + СтрокаДвиженийВыводРезервов.ПереоценкаКупонаВВалютеУчета;
			СтрокаАктивыПоАС.СуммаРезервовПодОбесценение				= СтрокаДвиженийВыводРезервов.СуммаРезервовПодОбесценение;
			СтрокаАктивыПоАС.НачальнаяРазницаППНеНаблюдаемыеДанные		= СтрокаДвиженийВыводРезервов.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная;
			СтрокаАктивыПоАС.ЗадолженностьПоПогашениюКупонаВВалютеУчета	= СтрокаДвиженийВыводРезервов.ЗадолженностьПоПогашениюКупонаВВалютеУчета;
			СтрокаАктивыПоАС.Эмитент									= СтрокаДвиженийВыводРезервов.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
			СтрокаАктивыПоАС.НомерСтрокиПриход							= СтрокаДвиженийРезервов.ДвижениеПриход.НомерСтроки;
			СтрокаАктивыПоАС.НомерСтрокиРасход							= СтрокаДвиженийРезервов.ДвижениеРасход.НомерСтроки;
			СтрокаАктивыПоАС.Обработано									= Ложь;
			СтрокаАктивыПоАС.EAD										= СтрокаАктивыПоАС.Стоимость
																			+ СтрокаАктивыПоАС.ОценочныеДисконтПремия
																			+ СтрокаАктивыПоАС.ОценочнаяКорректировкаЭСП
																			+ СтрокаАктивыПоАС.ОценочнаяРазницаППНеНаблюдаемыеДанные
																			+ СтрокаАктивыПоАС.ОценочнаяСуммаКупона;
			
		КонецЦикла;
		
		ДокументНачисленияРезервов = Документы.НачислениеСписаниеРезервов.СоздатьДокумент();
		ДокументНачисленияРезервов.Дата = КонецДня(ЭтотОбъект.КонецПериода);
		ДокументНачисленияРезервов.Организация = ЭтотОбъект.Организация;
		ДокументНачисленияРезервов.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		ДокументНачисленияРезервов.ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов;
		ДокументНачисленияРезервов.ДополнительныеСвойства.Вставить("АктивыПоАС", АктивыПоАС);
		
		ДокументНачисленияРезервов.ЗаполнитьРезервы(Отказ);
		
		Для каждого СтрокаРезервы Из ДокументНачисленияРезервов.Партии Цикл
		
			СтрокиАктивыПоАС = АктивыПоАС.НайтиСтроки(Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии, Количество, EAD, Обработано",
				СтрокаРезервы.Актив, СтрокаРезервы.Партия, СтрокаРезервы.СтрокаПартии, СтрокаРезервы.Количество, СтрокаРезервы.EAD, Ложь));
				
			Если СтрокиАктивыПоАС.Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Возникли проблемы с расчетом резервов при выводе",,,, Отказ);
				Возврат;
			КонецЕсли;
			
			СтрокаАктивыПоАС = СтрокиАктивыПоАС[0];
			
			ДвижениеПриход = ЭтотОбъект.РассчитанныеПартии[СтрокаАктивыПоАС.НомерСтрокиПриход - 1];
			ДвижениеРасход = ЭтотОбъект.РассчитанныеПартии[СтрокаАктивыПоАС.НомерСтрокиРасход - 1];

			ДельтаРезерв = СтрокаРезервы.СуммаРезерваПартии - ДвижениеРасход.СуммаРезервовПодОбесценение;
			
			ДвижениеПриход.СуммаРезервовПодОбесценение = ДвижениеПриход.СуммаРезервовПодОбесценение + ДельтаРезерв;
			ДвижениеРасход.СуммаРезервовПодОбесценение = ДвижениеРасход.СуммаРезервовПодОбесценение + ДельтаРезерв;
			
			СтрокаАктивыПоАС.Обработано = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// таблица партий РЕПО, в отличие от приходных партий, не сгруппирована по бумагам,
	// поэтому выносим её за "бумажный" цикл
	Для каждого СтрокаПартии Из ПартииКупленныеПоРЕПО Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартийКупленныхПоРепо.Добавить(), СтрокаПартии);
	КонецЦикла;
	Для каждого СтрокаПартии Из ПартииПроданныеВРЕПО Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартийПроданныхВРепо.Добавить(), СтрокаПартии);
	КонецЦикла;
	
	РассчитыватьСтоимости = _Сохранение_РассчитыватьСтоимости;
	
КонецПроцедуры
	
Процедура РассчитатьПартииКПолучению(Отказ, ПлановыеОперации, РассчитыватьСтоимости)
	
	СписокСуммовыхПолей =
		"СтоимостьПокупки,СтоимостьПокупкиКупона,РасходыПриПокупкеВСтоимости,ПереоценкаВСтоимости,
		|ПереоценкаКупонаВСтоимости,Стоимость,СтоимостьКупона,Переоценка,ПереоценкаКупона,
		|СтоимостьВВалютеУчета,СтоимостьКупонаВВалютеУчета,ПереоценкаВВалютеУчета,ПереоценкаКупонаВВалютеУчета,
		|ПереоценкаКупонаСНачалаГода,ПереоценкаСНачалаГода,ПереоценкаСНачалаГодаПоложительная";
					
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета,
		Отказ);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Биржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
		
	Порядок = "";
	Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ЛИФО Тогда
		Порядок = " УБЫВ ";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеДанные.Рынок КАК Рынок,
		|	ПлановыеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПлановыеДанные.Регистратор КАК Партия,
		|	ПлановыеДанные.СтрокаПартии КАК СтрокаПартии,
		|	ПлановыеДанные.Количество КАК Количество,
		|	ПлановыеДанные.Период КАК Период,
		|	ПлановыеДанные.Регистратор КАК Регистратор,
		|	ПлановыеДанные.ВидДвижения КАК ВидДвижения,
		|	ПлановыеДанные.МоментВремени КАК МоментВремени,
		|	ПлановыеДанные.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	ПлановыеДанные.ВалютаСделки КАК ВалютаСделки,
		|	ПлановыеДанные.ДатаОплаты КАК ДатаОплаты,
		|	ПлановыеДанные.ДатаПоставки КАК ДатаПоставки,
		|	ПлановыеДанные.СуммаНаОднуОблигацию КАК СуммаНаОднуОблигацию,
		|	ПлановыеДанные.ВалютаСделки КАК Валюта,
		|	ПлановыеДанные.ДатаФиксации КАК ДатаФиксации,
		|	ПлановыеДанные.ВидПогашения КАК ВидПогашения,
		|	ПлановыеДанные.Сумма КАК Сумма,
		|	ПлановыеДанные.СуммаКупона КАК СуммаКупона,
		|	ПлановыеДанные.Основание КАК Основание
		|ПОМЕСТИТЬ _ПлановыеДанные
		|ИЗ
		|	&ПлановыеДанные КАК ПлановыеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходыПоСделкеОбороты.Сделка КАК Сделка,
		|	РасходыПоСделкеОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РасходыПоСделкеОбороты.СуммаОборот КАК СуммаОборот,
		|	РасходыПоСделкеОбороты.Рынок КАК Рынок
		|ПОМЕСТИТЬ _РасходыПоСделке
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			,
		|			&КонецПериода,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)) КАК РасходыПоСделкеОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сделка,
		|	Рынок,
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагКПолучениюОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагКПолучениюОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупки,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупона,
		|	БухПартииЦенныхБумагКПолучениюОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимости,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимости,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимости,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтоимостьОстаток КАК Стоимость,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	NULL КАК СуммаЧастичногоПогашения,
		|	NULL КАК ДисконтПремия,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Партия.Дата КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход) КАК ВидДвижения,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Партия.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагКПолучениюОстатки.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.Партия КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагКПолучениюОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерСделки,
		|	NULL КАК КорректировкаЭСП,
		|	NULL КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода,
		|	NULL КАК КорректировкаЭСПСНачалаГода,
		|	NULL КАК ДисконтПремияНачисленныйСНачалаГода,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток КАК ПереоценкаНаБалансе,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеВВалютеУчетаОстаток КАК ПереоценкаНаБалансеВВалютеУчета,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	НЕОПРЕДЕЛЕНО КАК ВалютаСделки,
		|	ЛОЖЬ КАК ПлановыеДанные,
		|	NULL КАК Основание,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаСНачалаГодаПоложительнаяОстаток КАК ПереоценкаСНачалаГодаПоложительная
		|ПОМЕСТИТЬ _Партии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагКПолучениюОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).МоментВремени,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).НомерСделки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СделкаДокумент.ВалютаСделки,
		|	ЛОЖЬ,
		|	NULL,
		|	0
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделке КАК РасходыПоСделке
		|		ПО ОперацииСЦеннымиБумагами.Операция = РасходыПоСделке.Сделка
		|			И ОперацииСЦеннымиБумагами.Рынок = РасходыПоСделке.Рынок
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|		ПО ((ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка)) = СделкаДокумент.Ссылка)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Сделка)
		|	И НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ДатаОплаты, ДЕНЬ) > НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ)
		|	И НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ДатаПоставки, ДЕНЬ) > НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ)
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ВидСделки = &Покупка
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).МестоХранения <> &МестоХраненияВнебиржевойРынок
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).МоментВремени,
		|	СделкаДокумент.НомерСделки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СделкаДокумент.ВалютаСделки,
		|	ЛОЖЬ,
		|	NULL,
		|	0
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|		ПО (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание = СделкаДокумент.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделке КАК РасходыПоСделке
		|		ПО (СделкаДокумент.Ссылка = РасходыПоСделке.Сделка)
		|			И ОперацииСЦеннымиБумагами.Рынок = РасходыПоСделке.Рынок
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИзменениеУсловийСделки)
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание.ВидСделки = &Покупка
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание.МестоХранения <> &МестоХраненияВнебиржевойРынок
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).МоментВремени,
		|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СделкаДокумент.ВалютаСделки,
		|	ЛОЖЬ,
		|	NULL,
		|	0
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделке КАК РасходыПоСделке
		|		ПО (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание = РасходыПоСделке.Сделка)
		|			И ОперацииСЦеннымиБумагами.Рынок = РасходыПоСделке.ЦеннаяБумага
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|		ПО (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание = СделкаДокумент.Ссылка)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СделкаДокумент.ВидСделки = &Покупка
		|	И НАЧАЛОПЕРИОДА(СделкаДокумент.ДатаОплаты, ДЕНЬ) > НАЧАЛОПЕРИОДА(СделкаДокумент.Дата, ДЕНЬ)
		|	И НАЧАЛОПЕРИОДА(СделкаДокумент.ДатаПоставки, ДЕНЬ) > НАЧАЛОПЕРИОДА(СделкаДокумент.Дата, ДЕНЬ)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	ЕСТЬNULL(РасходыПоСделке.СуммаОборот, 0),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СделкаДокумент.ВалютаСделки,
		|	ЛОЖЬ,
		|	NULL,
		|	0
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделке КАК РасходыПоСделке
		|		ПО (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание = РасходыПоСделке.Сделка)
		|			И ОперацииСЦеннымиБумагами.Рынок = РасходыПоСделке.Рынок
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|		ПО (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание = СделкаДокумент.Ссылка)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СделкаДокумент.ВидСделки = &Покупка
		|	И НАЧАЛОПЕРИОДА(СделкаДокумент.ДатаОплаты, ДЕНЬ) > НАЧАЛОПЕРИОДА(СделкаДокумент.Дата, ДЕНЬ)
		|	И НАЧАЛОПЕРИОДА(СделкаДокумент.ДатаПоставки, ДЕНЬ) > НАЧАЛОПЕРИОДА(СделкаДокумент.Дата, ДЕНЬ)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка),
		|	_ПлановыеДанные.Рынок,
		|	_ПлановыеДанные.ЦеннаяБумага,
		|	_ПлановыеДанные.Партия,
		|	_ПлановыеДанные.СтрокаПартии,
		|	_ПлановыеДанные.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	_ПлановыеДанные.Период,
		|	_ПлановыеДанные.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	_ПлановыеДанные.МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	_ПлановыеДанные.ВалютаСделки,
		|	ИСТИНА,
		|	_ПлановыеДанные.Основание,
		|	0
		|ИЗ
		|	_ПлановыеДанные КАК _ПлановыеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _ПлановыеДанные.Основание = Сделка.Ссылка
		|			И (Сделка.ВидСделки = &Покупка)
		|ГДЕ
		|	_ПлановыеДанные.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И _ПлановыеДанные.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И _ПлановыеДанные.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|	И _ПлановыеДанные.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партии.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	Партии.Рынок КАК Рынок,
		|	Партии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Партии.Партия КАК Партия,
		|	Партии.СтрокаПартии КАК СтрокаПартии,
		|	Партии.Количество КАК Количество,
		|	Партии.СтоимостьПокупки КАК СтоимостьПокупки,
		|	Партии.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	Партии.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	Партии.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	Партии.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	Партии.Стоимость КАК Стоимость,
		|	Партии.СтоимостьКупона КАК СтоимостьКупона,
		|	Партии.Переоценка КАК Переоценка,
		|	Партии.ПереоценкаКупона КАК ПереоценкаКупона,
		|	Партии.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
		|	Партии.ДисконтПремия КАК ДисконтПремия,
		|	Партии.Период КАК Период,
		|	Партии.Регистратор КАК Регистратор,
		|	Партии.ВидДвижения КАК ВидДвижения,
		|	Партии.МоментВремени КАК МоментВремени,
		|	Партии.НомерСделки КАК НомерСделки,
		|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала,
		|	Партии.КорректировкаЭСП КАК КорректировкаЭСП,
		|	Партии.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	Партии.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	Партии.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	Партии.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	Партии.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	Партии.ПереоценкаНаБалансе КАК ПереоценкаНаБалансе,
		|	Партии.ПереоценкаНаБалансеВВалютеУчета КАК ПереоценкаНаБалансеВВалютеУчета,
		|	Партии.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	Партии.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	Партии.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	Партии.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	Партии.ВалютаСделки КАК ВалютаСделки,
		|	Партии.ПлановыеДанные КАК ПлановыеДанные,
		|	Партии.Основание КАК Основание,
		|	Партии.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная
		|ПОМЕСТИТЬ _ПартииСПериодомНоминала
		|ИЗ
		|	_Партии КАК Партии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО Партии.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И Партии.Период > НоминалыЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Партии.УчетныйАктивЕПС,
		|	Партии.Рынок,
		|	Партии.ЦеннаяБумага,
		|	Партии.Партия,
		|	Партии.СтрокаПартии,
		|	Партии.Количество,
		|	Партии.СтоимостьПокупки,
		|	Партии.СтоимостьПокупкиКупона,
		|	Партии.РасходыПриПокупкеВСтоимости,
		|	Партии.ПереоценкаВСтоимости,
		|	Партии.ПереоценкаКупонаВСтоимости,
		|	Партии.Стоимость,
		|	Партии.СтоимостьКупона,
		|	Партии.Переоценка,
		|	Партии.ПереоценкаКупона,
		|	Партии.СуммаЧастичногоПогашения,
		|	Партии.ДисконтПремия,
		|	Партии.Период,
		|	Партии.Регистратор,
		|	Партии.ВидДвижения,
		|	Партии.МоментВремени,
		|	Партии.НомерСделки,
		|	Партии.КорректировкаЭСП,
		|	Партии.ДисконтПремияНачисленный,
		|	Партии.ПереоценкаКупонаСНачалаГода,
		|	Партии.КорректировкаЭСПСНачалаГода,
		|	Партии.ДисконтПремияНачисленныйСНачалаГода,
		|	Партии.ПереоценкаСНачалаГода,
		|	Партии.ПереоценкаНаБалансе,
		|	Партии.ПереоценкаНаБалансеВВалютеУчета,
		|	Партии.СтоимостьВВалютеУчета,
		|	Партии.СтоимостьКупонаВВалютеУчета,
		|	Партии.ПереоценкаВВалютеУчета,
		|	Партии.ПереоценкаКупонаВВалютеУчета,
		|	Партии.ВалютаСделки,
		|	Партии.ПлановыеДанные,
		|	Партии.Основание,
		|	Партии.ПереоценкаСНачалаГодаПоложительная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииСПериодомНоминала.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ПартииСПериодомНоминала.Рынок КАК Рынок,
		|	ПартииСПериодомНоминала.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииСПериодомНоминала.Партия КАК Партия,
		|	ПартииСПериодомНоминала.СтрокаПартии КАК СтрокаПартии,
		|	ПартииСПериодомНоминала.Количество КАК Количество,
		|	ПартииСПериодомНоминала.СтоимостьПокупки КАК СтоимостьПокупки,
		|	ПартииСПериодомНоминала.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	ПартииСПериодомНоминала.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	ПартииСПериодомНоминала.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	ПартииСПериодомНоминала.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	ПартииСПериодомНоминала.Стоимость КАК Стоимость,
		|	ПартииСПериодомНоминала.СтоимостьКупона КАК СтоимостьКупона,
		|	ПартииСПериодомНоминала.Переоценка КАК Переоценка,
		|	ПартииСПериодомНоминала.ПереоценкаКупона КАК ПереоценкаКупона,
		|	ПартииСПериодомНоминала.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
		|	ПартииСПериодомНоминала.ДисконтПремия КАК ДисконтПремия,
		|	ПартииСПериодомНоминала.Период КАК Период,
		|	ПартииСПериодомНоминала.Регистратор КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ПартииСПериодомНоминала.ПлановыеДанные
		|			ТОГДА ПартииСПериодомНоминала.Основание
		|		КОГДА ПартииСПериодомНоминала.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|			ТОГДА ВЫРАЗИТЬ(ПартииСПериодомНоминала.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
		|		КОГДА ПартииСПериодомНоминала.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА ВЫРАЗИТЬ(ПартииСПериодомНоминала.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание
		|		КОГДА ПартииСПериодомНоминала.Регистратор ССЫЛКА Документ.ИзменениеУсловийСделки
		|			ТОГДА ВЫРАЗИТЬ(ПартииСПериодомНоминала.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание
		|	КОНЕЦ КАК Основание,
		|	ПартииСПериодомНоминала.ВидДвижения КАК ВидДвижения,
		|	ПартииСПериодомНоминала.МоментВремени КАК МоментВремени,
		|	ПартииСПериодомНоминала.НомерСделки КАК НомерСделки,
		|	ПартииСПериодомНоминала.ПериодНоминала КАК ПериодНоминала,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал,
		|	ПартииСПериодомНоминала.КорректировкаЭСП КАК КорректировкаЭСП,
		|	ПартииСПериодомНоминала.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	ПартииСПериодомНоминала.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	ПартииСПериодомНоминала.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	ПартииСПериодомНоминала.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	ПартииСПериодомНоминала.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПартииСПериодомНоминала.ПереоценкаНаБалансе КАК ПереоценкаНаБалансе,
		|	ПартииСПериодомНоминала.ПереоценкаНаБалансеВВалютеУчета КАК ПереоценкаНаБалансеВВалютеУчета,
		|	ПартииСПериодомНоминала.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	ПартииСПериодомНоминала.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	ПартииСПериодомНоминала.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	ПартииСПериодомНоминала.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	ПартииСПериодомНоминала.ВалютаСделки КАК ВалютаСделки,
		|	ПартииСПериодомНоминала.ПлановыеДанные КАК ПлановыеДанные,
		|	ПартииСПериодомНоминала.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная
		|ИЗ
		|	_ПартииСПериодомНоминала КАК ПартииСПериодомНоминала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ПартииСПериодомНоминала.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ПартииСПериодомНоминала.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период"+Порядок+",
		|	НомерСделки"+Порядок+",
		|	МоментВремени"+Порядок+"
		|ИТОГИ ПО
		|	ЦеннаяБумага";
	#КонецОбласти 

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Покупка", Перечисления.ВидыСделок.Покупка);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("ПлановыеДанные", ПлановыеОперации);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("МестоХраненияВнебиржевойРынок", ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок"));
	Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);

	ЭтотОбъект.РассчитанныеПартииКПоступлению.Очистить();
	ЭтотОбъект.КонечныеОстаткиПартийКПоступлению.Очистить();
	
	ПустаяТаблица = ЭтотОбъект.РассчитанныеПартииКПоступлению.Выгрузить();
	ПустаяТаблица.Колонки.Добавить("ВалютаСделки", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//получим распределения активов
	ТаблицаДляСделок = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТаблицаДляСделок.Свернуть("Регистратор, Основание", "");
	
	РеквизитыРегистраторов = ПолучитьРеквизитыДокументов(РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой), "БухПартииЦенныхБумагКПолучению");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.Сделка"));
	МассивТипов.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
	
	МассивТиповПартий = Новый Массив;
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.Сделка"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.ПоставкаЦенныхБумаг"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.ВводЦенныхБумаг"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.КорректировкаРегистров"));
	
	ТаблицаСделок = Новый ТаблицаЗначений;
	ТаблицаСделок.Колонки.Добавить("Основание", Новый ОписаниеТипов(МассивТипов));
	
	Для каждого СтрокаТаблицыДляСделок Из ТаблицаДляСделок Цикл
		Если ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
			СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
			СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Основание;
		ИначеЕсли ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.ИзменениеУсловийСделки") Тогда
			СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
			СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Основание;
		ИначеЕсли ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
			СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
			СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Основание;
		ИначеЕсли ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.Сделка") Тогда
			СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
			СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Регистратор;
		ИначеЕсли ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
			СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
			СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Регистратор;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСделок.Свернуть("Основание", "");
	
	РаспределенияПоСделкам = БухгалтерскийУчетЕПС.ПолучитьРаспределениеПоВидуАктива(ТаблицаСделок);
	РаспределенияПоСделкам.Индексы.Добавить("Сделка, ЦеннаяБумага"); 
	
	ВыборкаЦеннаяБумага = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦеннаяБумага.Следующий() Цикл
		
		ЭтоОблигация = Ложь;
		Если ТипЗнч(ВыборкаЦеннаяБумага.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
			ЭтоОблигация = Истина;
		КонецЕсли;
		
		ЭтоПай = Ложь;
		Если ТипЗнч(ВыборкаЦеннаяБумага.ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
			ЭтоПай = Истина;
		КонецЕсли;
		
		ВалютаНоминала = ВыборкаЦеннаяБумага.ЦеннаяБумага.ВалютаНоминала;
		
		ПриходныеПартии = ПустаяТаблица.СкопироватьКолонки();
		
		ВыборкаДетальныеЗаписи = ВыборкаЦеннаяБумага.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
				
				ПартииДляРаспределения = ПустаяТаблица.СкопироватьКолонки();
				
				Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Сделка") //по этим документам неясен учетный актив ЕПС
					 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИзменениеУсловийСделки") 
					 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
					 
					ТекСделка = ВыборкаДетальныеЗаписи.Регистратор; 
					Если ТипЗнч(ТекСделка) = Тип("ДокументСсылка.ИзменениеУсловийСделки") Тогда
						ТекСделка = ВыборкаДетальныеЗаписи.Основание;
					КонецЕсли;
					
					КоличествоРаспределить = ВыборкаДетальныеЗаписи.Количество;
					РаспределенияПоТекущейСделкеИБумаге = РаспределенияПоСделкам.НайтиСтроки(Новый Структура("Сделка, ЦеннаяБумага", ТекСделка, ВыборкаДетальныеЗаписи.ЦеннаяБумага));
					Для каждого СтрокаРаспределенияПоСделкам Из РаспределенияПоТекущейСделкеИБумаге Цикл
						Если СтрокаРаспределенияПоСделкам.Количество = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						СтрокаПартииДляРаспределения = ПартииДляРаспределения.Добавить();
						
						ЗаполнитьЗначенияСвойств(СтрокаПартииДляРаспределения, ВыборкаДетальныеЗаписи);
						
						СтрокаПартииДляРаспределения.УчетныйАктивЕПС = СтрокаРаспределенияПоСделкам.УчетныйАктивЕПС;
						СтрокаПартииДляРаспределения.Количество = МИН(СтрокаРаспределенияПоСделкам.Количество, КоличествоРаспределить);
						
						КоличествоРаспределить = КоличествоРаспределить - СтрокаПартииДляРаспределения.Количество;
						Если КоличествоРаспределить = 0 Тогда
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					 
					ДанныеДляРаспределения = Новый Структура(СписокСуммовыхПолей);
					ЗаполнитьЗначенияСвойств(ДанныеДляРаспределения, ВыборкаДетальныеЗаписи);
					
					Если РассчитыватьСтоимости Тогда
					
						КоличествоРаспределить = ВыборкаДетальныеЗаписи.Количество;
						 
						Для каждого СтрокаПартииДляРаспределения Из ПартииДляРаспределения Цикл
							Для каждого СуммовоеПоле Из ДанныеДляРаспределения Цикл
								ИмяПоля = СуммовоеПоле.Ключ;
								СуммаКРаспределению = СуммовоеПоле.Значение;
								Если СтрокаПартииДляРаспределения.Количество = 0 И КоличествоРаспределить = 0 Тогда // это покупка паев
									Сумма = СуммаКРаспределению;
								Иначе
									Сумма = СуммаКРаспределению / КоличествоРаспределить * СтрокаПартииДляРаспределения.Количество;	
								КонецЕсли;
								СтрокаПартииДляРаспределения[ИмяПоля] = Сумма;
								ДанныеДляРаспределения[ИмяПоля] = СуммаКРаспределению - Сумма;
							КонецЦикла;
							КоличествоРаспределить = КоличествоРаспределить - СтрокаПартииДляРаспределения.Количество;
						 КонецЦикла;	
					
					КонецЕсли; 					
					
				Иначе
					 СтрокаПартииДляРаспределения = ПартииДляРаспределения.Добавить();
					 ЗаполнитьЗначенияСвойств(СтрокаПартииДляРаспределения, ВыборкаДетальныеЗаписи);
					 
					 Если СтрокаПартииДляРаспределения.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
					 	СтрокаПартииДляРаспределения.УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ВыборкаДетальныеЗаписи.Период, ВыборкаДетальныеЗаписи.Рынок, ВыборкаДетальныеЗаписи.ЦеннаяБумага, СчетДоверительногоУправленияДляУчета);
					 КонецЕсли;
				КонецЕсли;
				
				Для каждого СтрокаПартииДляРаспределения Из ПартииДляРаспределения Цикл
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИзменениеУсловийСделки") Тогда
						СтрокиПриходныхПартий = ПриходныеПартии.НайтиСтроки(Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, Количество", СтрокаПартииДляРаспределения.ЦеннаяБумага, СтрокаПартииДляРаспределения.УчетныйАктивЕПС, СтрокаПартииДляРаспределения.Количество));
						Если СтрокиПриходныхПартий.Количество() <> 1 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение условий сделки с заменой бумаг или их количества не будут обработаны при расчете партий: "+ВыборкаДетальныеЗаписи.Регистратор,,,,Отказ);
							Возврат;
						КонецЕсли;
						СтрокаПриходныеПартии = СтрокиПриходныхПартий[0];
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартииКПоступлению.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныеПартии);
						
						ВалютаСделки = ВыборкаДетальныеЗаписи.ВалютаСделки;
						//добавляем дельту по стоимости
						НовоеДвижение.Количество = 0;
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижение.Период		= СтрокаПартииДляРаспределения.Период;
						
						Если РассчитыватьСтоимости Тогда
						
							НовоеДвижение.СтоимостьПокупки = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаПартииДляРаспределения.СтоимостьПокупки - СтрокаПриходныеПартии.СтоимостьПокупки, ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаНоминала, СтрокаПартииДляРаспределения.Период, Отказ);
							НовоеДвижение.СтоимостьПокупкиКупона = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаПартииДляРаспределения.СтоимостьПокупкиКупона - СтрокаПриходныеПартии.СтоимостьПокупкиКупона, ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаНоминала, СтрокаПартииДляРаспределения.Период, Отказ);
							
							СтрокаПартииДляРаспределения.Стоимость = СтрокаПартииДляРаспределения.СтоимостьПокупки;
							Если СтрокаПартииДляРаспределения.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда 
								//допускаем что расходы - в валюте номинала. Иначе - нужен регистр
								СтрокаПартииДляРаспределения.Стоимость = СтрокаПартииДляРаспределения.Стоимость + СтрокаПартииДляРаспределения.РасходыПриПокупкеВСтоимости;
							Иначе
								СтрокаПартииДляРаспределения.РасходыПриПокупкеВСтоимости = 0;
							КонецЕсли;
							СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаПартииДляРаспределения.Стоимость, ВалютаНоминала, ЭтотОбъект.Организация,  СтрокаПартииДляРаспределения.Период, Отказ);
							СтрокаПартииДляРаспределения.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаПартииДляРаспределения.СтоимостьКупона, ВалютаНоминала, ЭтотОбъект.Организация,  СтрокаПартииДляРаспределения.Период, Отказ);
							
							НовоеДвижение.Стоимость = СтрокаПартииДляРаспределения.Стоимость - СтрокаПриходныеПартии.Стоимость;
							НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПартииДляРаспределения.СтоимостьВВалютеУчета - СтрокаПриходныеПартии.СтоимостьВВалютеУчета;
							НовоеДвижение.СтоимостьКупона = СтрокаПартииДляРаспределения.СтоимостьКупона - СтрокаПриходныеПартии.СтоимостьКупона;
							НовоеДвижение.СтоимостьКупонаВВалютеУчета = СтрокаПартииДляРаспределения.СтоимостьКупонаВВалютеУчета - СтрокаПриходныеПартии.СтоимостьКупонаВВалютеУчета;
							НовоеДвижение.Переоценка = 0;
							НовоеДвижение.ПереоценкаВВалютеУчета = 0;
							НовоеДвижение.ПереоценкаКупона = 0;
							НовоеДвижение.ПереоценкаКупонаВВалютеУчета = 0;
							НовоеДвижение.ПереоценкаСНачалаГода = 0;
							НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = 0;
							НовоеДвижение.ПереоценкаКупонаСНачалаГода = 0;
							НовоеДвижение.ПереоценкаНаБалансе = 0;
							НовоеДвижение.ПереоценкаНаБалансеВВалютеУчета = 0;
							
							
							СтрокаПриходныеПартии.СтоимостьПокупки = СтрокаПриходныеПартии.СтоимостьПокупки + НовоеДвижение.СтоимостьПокупки;
							СтрокаПриходныеПартии.СтоимостьПокупкиКупона = СтрокаПриходныеПартии.СтоимостьПокупкиКупона + НовоеДвижение.СтоимостьПокупкиКупона;
							СтрокаПриходныеПартии.Стоимость = СтрокаПриходныеПартии.Стоимость + НовоеДвижение.Стоимость;
							СтрокаПриходныеПартии.СтоимостьВВалютеУчета = СтрокаПриходныеПартии.СтоимостьВВалютеУчета + НовоеДвижение.СтоимостьВВалютеУчета;
							СтрокаПриходныеПартии.СтоимостьКупона = СтрокаПриходныеПартии.СтоимостьКупона + НовоеДвижение.СтоимостьКупона;
							СтрокаПриходныеПартии.СтоимостьКупонаВВалютеУчета = СтрокаПриходныеПартии.СтоимостьКупонаВВалютеУчета + НовоеДвижение.СтоимостьКупонаВВалютеУчета;							
						
						КонецЕсли; 
						
					Иначе
						ПриходнаяПартия = ПриходныеПартии.Добавить();
						
						ЗаполнитьЗначенияСвойств(ПриходнаяПартия, СтрокаПартииДляРаспределения);
						
						Если (СтрокаПартииДляРаспределения.Регистратор <> Неопределено) И РассчитыватьСтоимости Тогда //обработаем стоимости, причем начальные остатки идут "как есть" - не берем их
							
							// стоимости покупок идут в валюте сделки, а на стоимостях мы все учитываем в валюте номинала
							Если СтрокаПартииДляРаспределения.ВалютаСделки = ВалютаНоминала Тогда
								ПриходнаяПартия.Стоимость = ПриходнаяПартия.СтоимостьПокупки;
								ПриходнаяПартия.СтоимостьКупона = ПриходнаяПартия.СтоимостьПокупкиКупона;
							Иначе
								ПриходнаяПартия.Стоимость = РаботаСВалютами.ПересчетСуммыВВалюте(ПриходнаяПартия.СтоимостьПокупки, СтрокаПартииДляРаспределения.ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаНоминала, СтрокаПартииДляРаспределения.Период, Отказ);
								ПриходнаяПартия.СтоимостьКупона = РаботаСВалютами.ПересчетСуммыВВалюте(ПриходнаяПартия.СтоимостьПокупкиКупона, СтрокаПартииДляРаспределения.ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаНоминала, СтрокаПартииДляРаспределения.Период, Отказ);
							КонецЕсли;
							
							// пересчитываем при необходимости из валюты сделки в валюту учета
							Если СтрокаПартииДляРаспределения.ВалютаСделки = ВалютаУчета Тогда
								ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьПокупки;
								ПриходнаяПартия.СтоимостьКупонаВВалютеУчета = ПриходнаяПартия.СтоимостьПокупкиКупона;
							Иначе
								ПриходнаяПартия.СтоимостьВВалютеУчета = РаботаСВалютами.ПересчетСуммыВВалюте(ПриходнаяПартия.СтоимостьПокупки, СтрокаПартииДляРаспределения.ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаУчета, СтрокаПартииДляРаспределения.Период, Отказ);
								ПриходнаяПартия.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПересчетСуммыВВалюте(ПриходнаяПартия.СтоимостьПокупкиКупона, СтрокаПартииДляРаспределения.ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаУчета, СтрокаПартииДляРаспределения.Период, Отказ);
							КонецЕсли;
							
							// для АСных бумаг считаем расходы (комиссии)
							Если ПриходнаяПартия.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда
								// считаем, что валюта расходов всегда равна валюте сделки
								// от старого допущения отказываемся - "допускаем что расходы в валюте номинала"
								Если СтрокаПартииДляРаспределения.ВалютаСделки = ВалютаУчета Тогда
									Если ВалютаНоминала = ВалютаУчета Тогда
										РасходыПриПокупкеВСтоимости = ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
									Иначе	
										РасходыПриПокупкеВСтоимости = РаботаСВалютами.ПересчетСуммыВВалюте(ПриходнаяПартия.РасходыПриПокупкеВСтоимости, СтрокаПартииДляРаспределения.ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаНоминала, СтрокаПартииДляРаспределения.Период, Отказ);
									КонецЕсли;
									РасходыПриПокупкеВСтоимостиВВалютеУчета = ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
								Иначе
									РасходыПриПокупкеВСтоимости = РаботаСВалютами.ПересчетСуммыВВалюте(ПриходнаяПартия.РасходыПриПокупкеВСтоимости, СтрокаПартииДляРаспределения.ВалютаСделки, СтрокаПартииДляРаспределения.Период, ВалютаНоминала, СтрокаПартииДляРаспределения.Период, Отказ);
									РасходыПриПокупкеВСтоимостиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПриходнаяПартия.РасходыПриПокупкеВСтоимости, СтрокаПартииДляРаспределения.ВалютаСделки, ЭтотОбъект.Организация, ПриходнаяПартия.Период, Отказ);
								КонецЕсли;
								ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость + РасходыПриПокупкеВСтоимости;
								ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьВВалютеУчета + РасходыПриПокупкеВСтоимостиВВалютеУчета;
							Иначе
								ПриходнаяПартия.РасходыПриПокупкеВСтоимости = 0;
							КонецЕсли;
							
						КонецЕсли;
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартииКПоступлению.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, ПриходнаяПартия);
						
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаПартииДляРаспределения.СтрокаПартии;
					КонецЕсли;
						
				КонецЦикла;
				
				
			Иначе //Остальные расходы спишем с приходов. Остальные это 
				
				ТекСделка = ВыборкаДетальныеЗаписи.Регистратор;
				Если ТипЗнч(ТекСделка) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
				 	ИЛИ ТипЗнч(ТекСделка) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
					ТекСделка = ВыборкаДетальныеЗаписи.Основание;
				КонецЕсли;
				
				ПриходныеПартииКСписанию = ПриходныеПартии.НайтиСтроки(Новый Структура("Партия, ЦеннаяБумага", ТекСделка, ВыборкаДетальныеЗаписи.ЦеннаяБумага));
				КоличествоКСписанию = ВыборкаДетальныеЗаписи.Количество;//СтрокаДокументыДляСписания.Количество;
				
				Для каждого СтрокаПриходныхПартий Из ПриходныеПартииКСписанию Цикл
					
					Если ЭтоПай И СтрокаПриходныхПартий.Количество = 0 Тогда // тяжелый случай, будем молиться что частичных поставок не будет...
					
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартииКПоступлению.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
						
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						КоличествоКСписанию = 0;
						
						Продолжить;
						
					КонецЕсли;
					
					
					Если СтрокаПриходныхПартий.Количество = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
						КоличествоКСписаниюПартии = СтрокаПриходныхПартий.Количество;
					Иначе
						КоличествоКСписаниюПартии = КоличествоКСписанию;
					КонецЕсли;
					
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартииКПоступлению.Добавить();
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
					
					НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
					НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
					НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
					НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
					
					Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
						
						КоличествоКСписанию = КоличествоКСписанию - СтрокаПриходныхПартий.Количество;
						
						СтрокаПриходныхПартий.Количество = СтрокаПриходныхПартий.Количество - СтрокаПриходныхПартий.Количество;
						
					Иначе //спишем пропорционально
						
						КоэффициентСписания = КоличествоКСписанию / СтрокаПриходныхПартий.Количество;
						
						НовоеДвижение.Количество = КоличествоКСписанию;
						
						Если РассчитыватьСтоимости Тогда
						
							НовоеДвижение.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания;
							НовоеДвижение.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания;
							
							Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда //чтоб не нарваться на коругление(Карлсон, ты???) спишем с суммой и вычтем
								НовоеДвижение.РасходыПриПокупкеВСтоимости = (СтрокаПриходныхПартий.СтоимостьПокупки + СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости) * КоэффициентСписания - НовоеДвижение.СтоимостьПокупки;
							Иначе //раз не включены то и не списываем
								НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
							КонецЕсли;
							
							НовоеДвижение.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания;
							НовоеДвижение.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания;
							НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета * КоэффициентСписания;
							НовоеДвижение.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания;
							НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета * КоэффициентСписания;
							НовоеДвижение.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода * КоэффициентСписания;
							НовоеДвижение.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная * КоэффициентСписания;
							НовоеДвижение.ПереоценкаНаБалансе = СтрокаПриходныхПартий.ПереоценкаНаБалансе * КоэффициентСписания;
							НовоеДвижение.ПереоценкаНаБалансеВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаНаБалансеВВалютеУчета * КоэффициентСписания;
							
							СтрокаПриходныхПартий.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
							СтрокаПриходныхПартий.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона - НовоеДвижение.СтоимостьПокупкиКупона;
							СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости - НовоеДвижение.РасходыПриПокупкеВСтоимости;
							
							СтрокаПриходныхПартий.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости - НовоеДвижение.ПереоценкаВСтоимости;
							СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - НовоеДвижение.ПереоценкаКупонаВСтоимости;
							СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
							СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
							СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
							СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета - НовоеДвижение.ПереоценкаВВалютеУчета;
							СтрокаПриходныхПартий.ПереоценкаСНачалаГода = СтрокаПриходныхПартий.ПереоценкаСНачалаГода - НовоеДвижение.ПереоценкаСНачалаГода;
							СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная = СтрокаПриходныхПартий.ПереоценкаСНачалаГодаПоложительная - НовоеДвижение.ПереоценкаСНачалаГодаПоложительная;
							СтрокаПриходныхПартий.ПереоценкаНаБалансе = СтрокаПриходныхПартий.ПереоценкаНаБалансе - НовоеДвижение.ПереоценкаНаБалансе;							
							СтрокаПриходныхПартий.ПереоценкаНаБалансеВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаНаБалансеВВалютеУчета - НовоеДвижение.ПереоценкаНаБалансеВВалютеУчета;
						
						КонецЕсли; 
						
						СтрокаПриходныхПартий.Количество = СтрокаПриходныхПартий.Количество - НовоеДвижение.Количество;
						
						КоличествоКСписанию = 0;
						
					КонецЕсли;
					
					Если КоличествоКСписанию = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		// теперь таблица приходных партий содержит только конечные остатки, которые мы и положим в соответствующую таб. часть обработки
		Для каждого СтрокаПриходныеПартии Из ПриходныеПартии Цикл
			Если СтрокаПриходныеПартии.Количество > 0 Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартийКПоступлению.Добавить(), СтрокаПриходныеПартии);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
	
Функция ДоначислитьКупон(Регистратор, Период, СтрокаПриходныхПартий, СуммаКупона, Количество, ФиксированныйКурсПереоценки = 0, СтрокаКорзиныЦенныхБумаг, ОтражатьНаПереоценкеПолнуюСумму, Отказ)
	
	Если НЕ ОтражатьНаПереоценкеПолнуюСумму Тогда
		СуммаДооценкиКупона = СуммаКупона * СтрокаПриходныхПартий.Количество - СтрокаПриходныхПартий.СтоимостьКупона - СтрокаПриходныхПартий.ПереоценкаКупона;
	Иначе
		СуммаДооценкиКупона = СуммаКупона * СтрокаПриходныхПартий.Количество - СтрокаПриходныхПартий.ПереоценкаКупона;
	КонецЕсли;
	
	НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		НовоеДвижение.УчетныйАктивЕПС 	= СтрокаПриходныхПартий.УчетныйАктивЕПС;
	Иначе
		НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаКорзиныЦенныхБумаг;
	КонецЕсли;
	
	НовоеДвижение.Рынок 			= СтрокаПриходныхПартий.Рынок;
	НовоеДвижение.ЦеннаяБумага 		= СтрокаПриходныхПартий.ЦеннаяБумага;
	НовоеДвижение.Партия 			= СтрокаПриходныхПартий.Партия;
	НовоеДвижение.СтрокаПартии 		= СтрокаПриходныхПартий.СтрокаПартии;
	
	НовоеДвижение.ВидДвижения 		= Перечисления.ВидыДвижений.Приход;
	НовоеДвижение.Регистратор 		= Регистратор;
	НовоеДвижение.Период 			= Период;
	
	//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
	
	Если Количество <> СтрокаПриходныхПартий.Количество Тогда
		СуммаДооценкиКупона = Окр(СуммаДооценкиКупона * Количество / СтрокаПриходныхПартий.Количество, 2);
	КонецЕсли;
	
	НовоеДвижение.ПереоценкаКупона = СуммаДооценкиКупона;
	
	Если НовоеДвижение.ПереоценкаКупона <> 0 Тогда
		Если ФиксированныйКурсПереоценки = 0 Тогда
			НовоеДвижение.ПереоценкаКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
																				СуммаДооценкиКупона,
																				СтрокаПриходныхПартий.ЦеннаяБумага.ВалютаНоминала,
																				ЭтотОбъект.Организация,
																				Период,
																				Отказ);
		Иначе
			НовоеДвижение.ПереоценкаКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
																				Новый Структура("Сумма", СуммаДооценкиКупона),
																				СтрокаПриходныхПартий.ЦеннаяБумага.ВалютаНоминала,
																				ЭтотОбъект.Организация,
																				Период,
																				ФиксированныйКурсПереоценки,
																				Отказ).Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовоеДвижение;
	
КонецФункции

Функция ДоначислитьКупонРЕПО(Регистратор, Период, ТаблицаДвижений, СтрокаПриходныхПартий, СуммаКупона, Количество, СтрокаКорзиныЦенныхБумаг, Отказ)
	
	НовоеДвижение = ТаблицаДвижений.Добавить();  
	
	Если ЭтотОбъект.ВидУчета <> Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаКорзиныЦенныхБумаг;
	КонецЕсли;
	
	СвойстваКЗаполнению = "Рынок, ЦеннаяБумага, Партия, СтрокаПартии";
	
	Если ТаблицаДвижений = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО Тогда
		СвойстваКЗаполнению = СвойстваКЗаполнению + ", УчетныйАктивЕПС, ПродажаРЕПО, СтрокаПродажиРЕПО";
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий, СвойстваКЗаполнению);
	
	НовоеДвижение.ВидДвижения 		= Перечисления.ВидыДвижений.Приход;
	НовоеДвижение.Регистратор 		= Регистратор;
	НовоеДвижение.Период 			= Период;

	СуммаДооценкиКупона = СуммаКупона * СтрокаПриходныхПартий.Количество - СтрокаПриходныхПартий.СтоимостьКупона - СтрокаПриходныхПартий.ПереоценкаКупона;
	
	Если Количество <> СтрокаПриходныхПартий.Количество Тогда
		СуммаДооценкиКупона = Окр(СуммаДооценкиКупона * Количество / СтрокаПриходныхПартий.Количество, 2);
	КонецЕсли;
	
	НовоеДвижение.ПереоценкаКупона = СуммаДооценкиКупона;
	
	Если НовоеДвижение.ПереоценкаКупона <> 0 Тогда
		НовоеДвижение.ПереоценкаКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
																			СуммаДооценкиКупона,
																			СтрокаПриходныхПартий.ЦеннаяБумага.ВалютаНоминала,
																			ЭтотОбъект.Организация,
																			Период,
																			Отказ);
	КонецЕсли;
	
	Возврат НовоеДвижение;
	
КонецФункции

Функция Перекурсовка(Регистратор, ТаблицаДвижений, Период, СтрокаПриходныхПартий, Количество, СтрокаКорзиныЦенныхБумаг, КурсВалюты = Неопределено, РесурсыКПерекурсовке = Неопределено, ПараметрыПерекурсовки = Неопределено, Отказ)
	
	ПараметрыПроверки67ФЗ = Неопределено;
	ЭтоВебФинанс210522 = Ложь;
	ОтражатьНаПриходнойПартии = Истина;
	
	Если ПараметрыПерекурсовки <> Неопределено Тогда
		ПараметрыПерекурсовки.Свойство("ПараметрыПроверки67ФЗ", ПараметрыПроверки67ФЗ);
		
		Если НЕ ПараметрыПерекурсовки.Свойство("ЭтоВебФинанс210522", ЭтоВебФинанс210522) Тогда
			ЭтоВебФинанс210522 = Ложь;
		КонецЕсли;
		Если НЕ ПараметрыПерекурсовки.Свойство("ОтражатьНаПриходнойПартии", ОтражатьНаПриходнойПартии) Тогда
			ОтражатьНаПриходнойПартии = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СуммыПерекурсовки = Новый Структура("СтоимостьВВалютеУчета,СтоимостьКупонаВВалютеУчета,ПереоценкаВВалютеУчета,ПереоценкаКупонаВВалютеУчета, ДисконтПремияНачисленныйВВалютеУчета,КорректировкаЭСПВВалютеУчета,РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,КурсовыеРазницыСНачалаГода, СтрокаКорзиныЦенныхБумаг",
							0, 0, 0, 0, 0, 0, 0, 0, 0);
							
	// Акции при продаже не курсуем!!! (ПБУ 3 п.7)
	Если СтрокаПриходныхПартий.Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
	
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.Сделка")
			ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
			ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
		
			Возврат СуммыПерекурсовки;
		
		КонецЕсли;	
	
	КонецЕсли;
	
	Если СтрокаПриходныхПартий.Количество = 0 Тогда
	
		ТексСообщения = СтрШаблон("Обнаружено нолевое количество ценных бумаг %1, партия %2, строка партии %3",
									СтрокаПриходныхПартий.ЦеннаяБумага,
									СтрокаПриходныхПартий.Партия,
									СтрокаПриходныхПартий.СтрокаПартии);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТексСообщения,,,, Отказ);
		Возврат СуммыПерекурсовки;
		
	КонецЕсли;
	
	
	СуммыВВалюте = Новый Структура();
	
	Если РесурсыКПерекурсовке = Неопределено Тогда
	
		Если ЭтотОбъект.ВидУчета <> Перечисления.ВидыУчета.НалоговыйУчет Тогда
			СуммыВВалюте.Вставить("СтоимостьВВалютеУчета", СтрокаПриходныхПартий.Стоимость);
			СуммыВВалюте.Вставить("СтоимостьКупонаВВалютеУчета", СтрокаПриходныхПартий.СтоимостьКупона);
			СуммыВВалюте.Вставить("ПереоценкаВВалютеУчета", СтрокаПриходныхПартий.Переоценка);
		КонецЕсли;
		СуммыВВалюте.Вставить("ПереоценкаКупонаВВалютеУчета", СтрокаПриходныхПартий.ПереоценкаКупона);
		Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			СуммыВВалюте.Вставить("ДисконтПремияНачисленныйВВалютеУчета", СтрокаПриходныхПартий.ДисконтПремияНачисленный);
			СуммыВВалюте.Вставить("КорректировкаЭСПВВалютеУчета", СтрокаПриходныхПартий.КорректировкаЭСП);
			СуммыВВалюте.Вставить("РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета", СтрокаПриходныхПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(РесурсыКПерекурсовке) = Тип("Массив") Тогда	
		Для Каждого РесурсКПерекурсовке Из РесурсыКПерекурсовке Цикл
			
			СуммыВВалюте.Вставить(РесурсКПерекурсовке, СтрокаПриходныхПартий[СтрЗаменить(РесурсКПерекурсовке,"ВВалютеУчета","")]);
			
		КонецЦикла;		
	КонецЕсли;
	
	РаботаСВалютами.ПолучитьСуммыВВалютеУчета(СуммыВВалюте, СтрокаПриходныхПартий.ЦеннаяБумага.ВалютаНоминала, ЭтотОбъект.Организация, Период, КурсВалюты, Отказ);
	
	КоэффициентПерекурсовки = Количество/СтрокаПриходныхПартий.Количество;
	
	Для каждого СуммаВВалюте Из СуммыВВалюте Цикл
		
		ИмяРесурса = СуммаВВалюте.Ключ;
		ВалютнаяСумма = СуммаВВалюте.Значение;
		
		СуммыПерекурсовки[ИмяРесурса] = (Окр(ВалютнаяСумма, 2) - СтрокаПриходныхПартий[ИмяРесурса]) * КоэффициентПерекурсовки;
		Если ИмяРесурса = "ПереоценкаКупонаВВалютеУчета" И ПараметрыПроверки67ФЗ <> Неопределено Тогда 
			Если СуммыПерекурсовки[ИмяРесурса] <> 0 И БухгалтерскийУчет.КурсоваяРазницаПереоценкиУдовлетворяет67ФЗ(СуммыПерекурсовки[ИмяРесурса], ПараметрыПроверки67ФЗ.ВидУчета, ПараметрыПроверки67ФЗ.СчетУчетаПереоценки, Период) Тогда 			
				СуммыПерекурсовки[ИмяРесурса] = 0;
			КонецЕсли;		
		КонецЕсли	
						
	КонецЦикла;
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
	
		СуммыПерекурсовки.КурсовыеРазницыСНачалаГода = СуммыПерекурсовки.СтоимостьВВалютеУчета + СуммыПерекурсовки.СтоимостьКупонаВВалютеУчета + СуммыПерекурсовки.ПереоценкаВВалютеУчета 
			+ СуммыПерекурсовки.ПереоценкаКупонаВВалютеУчета + СуммыПерекурсовки.ДисконтПремияНачисленныйВВалютеУчета + СуммыПерекурсовки.КорректировкаЭСПВВалютеУчета 
			+ СуммыПерекурсовки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
			
	КонецЕсли;
	
	ЕстьНенулевыеСуммы = Ложь;
	Для Каждого СуммаПерекурсовки из СуммыПерекурсовки Цикл
		Если СуммаПерекурсовки.Значение <> 0 Тогда
			ЕстьНенулевыеСуммы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНенулевыеСуммы Тогда
		
		НовоеДвижение = ТаблицаДвижений.Добавить();
		
		//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.Перекурсовка;
		
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СуммыПерекурсовки);
		
		НовоеДвижение.ЦеннаяБумага 		= СтрокаПриходныхПартий.ЦеннаяБумага;
		Если ТаблицаДвижений <> ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО Тогда
			НовоеДвижение.УчетныйАктивЕПС 	= СтрокаПриходныхПартий.УчетныйАктивЕПС;
		КонецЕсли;	
		НовоеДвижение.Партия 			= СтрокаПриходныхПартий.Партия;
		НовоеДвижение.СтрокаПартии 		= СтрокаПриходныхПартий.СтрокаПартии;
		НовоеДвижение.Рынок 			= СтрокаПриходныхПартий.Рынок;
		НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаКорзиныЦенныхБумаг;
		
		НовоеДвижение.ВидДвижения 		= Перечисления.ВидыДвижений.Приход;
		НовоеДвижение.Регистратор 		= Регистратор;
		НовоеДвижение.Период 			= Период;
		
		
		Если ТаблицаДвижений = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО Тогда
			НовоеДвижение.ПродажаРЕПО 			= СтрокаПриходныхПартий.ПродажаРЕПО;
			НовоеДвижение.СтрокаПродажиРЕПО 	= СтрокаПриходныхПартий.СтрокаПродажиРЕПО;
		КонецЕсли;
		
		Если ЭтоВебФинанс210522 Тогда // курсуем только купон!
		
			НовоеДвижение.СтоимостьВВалютеУчета = 0;
			НовоеДвижение.СтоимостьКупонаВВалютеУчета = 0;
			НовоеДвижение.ПереоценкаВВалютеУчета = 0;
			НовоеДвижение.ДисконтПремияНачисленныйВВалютеУчета = 0;
			НовоеДвижение.КорректировкаЭСПВВалютеУчета = 0;
			НовоеДвижение.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = 0;
			НовоеДвижение.КурсовыеРазницыСНачалаГода = 0;
		
		КонецЕсли;
		
		Если ОтражатьНаПриходнойПартии Тогда
			СтрокаПриходныхПартий_Колонки = СтрокаПриходныхПартий.Владелец().Колонки;
			Для Каждого СуммаПерекурсовки Из СуммыПерекурсовки Цикл
				ИмяРесурса = СуммаПерекурсовки.Ключ;
				Если СтрокаПриходныхПартий_Колонки.Найти(ИмяРесурса) <> Неопределено Тогда
					Если ЗначениеЗаполнено(НовоеДвижение[ИмяРесурса]) Тогда
						СтрокаПриходныхПартий[ИмяРесурса] = СтрокаПриходныхПартий[ИмяРесурса] + НовоеДвижение[ИмяРесурса];
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла; 
			
		КонецЕсли;
			
		Возврат НовоеДвижение;
		
	Иначе
		
		Возврат СуммыПерекурсовки;
		
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьПоляВВалютеУчета(ДатаКурса, ДанныеДляРаспределения, ВыборкаДетальныеЗаписи, ВалютаНоминала, ФиксированныйКурсПереоценки, ТаблицаРасходыПоСделкеСЗамещающимиОблигациями = Неопределено, ВалютаУчета, Отказ)
	
	Если ФиксированныйКурсПереоценки <> 0 Тогда
	
		ДанныеДляРаспределения.СтоимостьПокупкиВВалютеУчета = ДанныеДляРаспределения.СтоимостьПокупки * ФиксированныйКурсПереоценки;
		ДанныеДляРаспределения.СтоимостьПокупкиКупонаВВалютеУчета = ДанныеДляРаспределения.СтоимостьПокупкиКупона * ФиксированныйКурсПереоценки;
		ДанныеДляРаспределения.РасходыПриПокупкеВСтоимостиВВалютеУчета = ДанныеДляРаспределения.РасходыПриПокупкеВСтоимости * ФиксированныйКурсПереоценки;
		ДанныеДляРаспределения.ПереоценкаВВалютеУчета = ДанныеДляРаспределения.Переоценка * ФиксированныйКурсПереоценки;
		
	Иначе
		
		ПересчитатьДанныеСделкиВВалютуНоминала(ДатаКурса, ДанныеДляРаспределения, ВыборкаДетальныеЗаписи, ВалютаНоминала, ТаблицаРасходыПоСделкеСЗамещающимиОблигациями, ВалютаУчета, Отказ);
		
	КонецЕсли;	
		
КонецФункции

Процедура ЗаписатьПартии(ИмяРегистра, ТаблицаПартий, Отказ)

	Если ТаблицаПартий.Количество() > 0 Тогда
	
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		#Область Текст_запроса_типы_регистраторов
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ТаблицаПартий.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ _Регистраторы
			|ИЗ
			|	&ТаблицаПартий КАК ТаблицаПартий
			|ГДЕ
			|	ТаблицаПартий.Регистратор <> НЕОПРЕДЕЛЕНО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Регистраторы.Регистратор КАК Регистратор,
			|	ТИПЗНАЧЕНИЯ(_Регистраторы.Регистратор) КАК ТипЗначения
			|ПОМЕСТИТЬ _ТипыРегистраторов
			|ИЗ
			|	_Регистраторы КАК _Регистраторы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Регистраторы";
		#КонецОбласти
		
		Запрос.УстановитьПараметр("ТаблицаПартий", ТаблицаПартий);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
		Запрос.УстановитьПараметр("ВидУчета", ВидУчета);
		
		Запрос.Выполнить();
		
		ВыборкаТипыЗначений = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_ТипыРегистраторов", Истина, "ТипЗначения", , "ТипЗначения").Выбрать();
		
		МассивВариантов = Новый Массив;
		
		Если ВыборкаТипыЗначений.Количество() > 0 Тогда
			
			Пока ВыборкаТипыЗначений.Следующий() Цикл
			
				МетаданныеДокумента = Метаданные.НайтиПоТипу(ВыборкаТипыЗначений.ТипЗначения);
				
				Вариант = СтрШаблон(
					"КОГДА ТИПЗНАЧЕНИЯ(_ТипыРегистраторов.Регистратор) = ТИП(%1)
					|			ТОГДА ВЫРАЗИТЬ(_ТипыРегистраторов.Регистратор КАК %1).Дата",
					МетаданныеДокумента.ПолноеИмя());
					
				МассивВариантов.Добавить(Вариант);
			
			КонецЦикла;
				
			ПодстрокаРегистраторДата = СтрШаблон(
				"ВЫБОР
				|		%1
				|	КОНЕЦ", СтрСоединить(МассивВариантов, Символы.ПС));
				
			#Область Текст_запроса_Поиск_нарушений_дат_запрета
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ТипыРегистраторов.Регистратор КАК Регистратор,
				|	&РегистраторДата КАК Дата
				|ПОМЕСТИТЬ _ДатыРегистраторов
				|ИЗ
				|	_ТипыРегистраторов КАК _ТипыРегистраторов
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	_ТипыРегистраторов.Регистратор
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КОНЕЦПЕРИОДА(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования, ДЕНЬ) КАК ДатаЗапретаРедактирования
				|ПОМЕСТИТЬ _ДатыЗапрета
				|ИЗ
				|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
				|ГДЕ
				|	ДатыЗапретаРедактирования.Организация = &Организация
				|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления = &СчетДоверительногоУправления
				|	И ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
				|	И ДатыЗапретаРедактирования.ВидУчета = &ВидУчета
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	_ДатыРегистраторов.Регистратор КАК Регистратор
				|ПОМЕСТИТЬ _СтарыеДвижения
				|ИЗ
				|	_ДатыРегистраторов КАК _ДатыРегистраторов
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыЗапрета КАК _ДатыЗапрета
				|		ПО (ИСТИНА)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
				|		ПО (БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления)
				|			И (БухПартииЦенныхБумаг.Активность)
				|			И (БухПартииЦенныхБумаг.ВидУчета = &ВидУчета)
				|			И _ДатыРегистраторов.Регистратор = БухПартииЦенныхБумаг.Регистратор
				|			И (_ДатыРегистраторов.Дата <= _ДатыЗапрета.ДатаЗапретаРедактирования)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	_ДатыРегистраторов.Регистратор КАК Регистратор
				|ПОМЕСТИТЬ _НовыеДвижения
				|ИЗ
				|	_ДатыРегистраторов КАК _ДатыРегистраторов
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыЗапрета КАК _ДатыЗапрета
				|		ПО _ДатыРегистраторов.Дата <= _ДатыЗапрета.ДатаЗапретаРедактирования";
			#КонецОбласти
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РегистраторДата", ПодстрокаРегистраторДата);
			
			Если ИмяРегистра <> "БухПартииЦенныхБумаг" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухПартииЦенныхБумаг", ИмяРегистра);
			КонецЕсли;
			
			Запрос.Выполнить();
			
			ПроверитьНарушенияДатЗапрета(Запрос, "_СтарыеДвижения", ИмяРегистра, Отказ);
			ПроверитьНарушенияДатЗапрета(Запрос, "_НовыеДвижения", ИмяРегистра, Отказ);
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
			ВыборкаДаты = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_ДатыРегистраторов").Выбрать();
			ДатыДвижений = Новый Соответствие;
			Пока ВыборкаДаты.Следующий() Цикл
				ДатыДвижений.Вставить(ВыборкаДаты.Регистратор, ВыборкаДаты.Дата);
			КонецЦикла;
			
			ТаблицаПартий.Сортировать("Регистратор, НомерСтроки");
				
			ТекущийРегистратор = Неопределено;
			ДатаДвижений = Неопределено;
			Движения = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			
			МассивРесурсов = Новый Массив();
			Для Каждого Ресурс Из Метаданные.РегистрыНакопления[ИмяРегистра].Ресурсы Цикл
				МассивРесурсов.Добавить(Ресурс.Имя);
			КонецЦикла;
			
			Для Каждого СтрокаПартий Из ТаблицаПартий Цикл
				
				Если ТипЗнч(СтрокаПартий.Регистратор) = Тип("ДокументОбъект.КорректировкаРегистров")						// не нужно их записывать, они и так записаны
					ИЛИ ТипЗнч(СтрокаПартий.Регистратор) = Тип("ДокументОбъект.РегистрацияСуммПогашенийНеИсполненныхВСрок")	// не нужно их записывать, они проводятся по-другому
				Тогда 
					Продолжить;
				КонецЕсли;
				
				Если ТекущийРегистратор <> СтрокаПартий.Регистратор Тогда
					
					Если ТекущийРегистратор <> Неопределено Тогда
						
						Попытка
							Движения.ДополнительныеСвойства.Вставить("ЗаписьВСоставеРасчетаПартий", Истина);
							Движения.Записать(Истина);
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ТекущийРегистратор,,, Отказ);
							Возврат;
						КонецПопытки;
					
					КонецЕсли;
					
					ТекущийРегистратор = СтрокаПартий.Регистратор;
					//ДатаДвижений = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПартий.Регистратор, "Дата");
					ДатаДвижений = ДатыДвижений[СтрокаПартий.Регистратор];
					
					Движения = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
					Движения.Отбор.Регистратор.Установить(ТекущийРегистратор);
					Движения.Прочитать();
					
					НомерЗаписи = Движения.Количество() - 1;
					Пока НомерЗаписи >= 0 Цикл
						Если Движения[НомерЗаписи].ВидУчета = ЭтотОбъект.ВидУчета Тогда
							Движения.Удалить(НомерЗаписи);
						КонецЕсли;
						НомерЗаписи = НомерЗаписи - 1;
					КонецЦикла;		
					
				КонецЕсли;
				
				ПустаяЗапись = Истина;
				Для Каждого Ресурс Из МассивРесурсов Цикл
					Если СтрокаПартий[Ресурс] <> 0 Тогда
						ПустаяЗапись = Ложь;
						Прервать;				
					КонецЕсли;
				КонецЦикла;
				Если ПустаяЗапись Тогда
					Продолжить;
				КонецЕсли;
			
				Движение = Движения.Добавить();
				Движение.Организация = ЭтотОбъект.Организация;
				Движение.СчетДоверительногоУправления = СчетДоверительногоУправленияДляУчета;
				Движение.ВидУчета = ЭтотОбъект.ВидУчета;
				ЗаполнитьЗначенияСвойств(Движение, СтрокаПартий);
				Движение.ВидДвижения = ?(СтрокаПартий.ВидДвижения = Перечисления.ВидыДвижений.Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
				Если ТекущийРегистратор <> Неопределено Тогда
					Движение.Период = ДатаДвижений;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТекущийРегистратор <> Неопределено Тогда
			
				Попытка
					Движения.ДополнительныеСвойства.Вставить("ЗаписьВСоставеРасчетаПартий", Истина);
					Движения.Записать(Истина);
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ТекущийРегистратор,,, Отказ);
					Возврат;
				КонецПопытки;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;

	//затрем все движения по документам, не попавшим в список регистраторов
	РегистраторыПартий = ТаблицаПартий.ВыгрузитьКолонку("Регистратор");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	НЕ БухПартииЦенныхБумаг.Регистратор В (&Регистраторы)
		|	И БухПартииЦенныхБумаг.Период >= &НачалоПериода
		|	И БухПартииЦенныхБумаг.Период <= &КонецПериода
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
		|	И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) <> ТИП(Документ.КорректировкаРегистров)
		|	И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) <> ТИП(Документ.РегистрацияСуммПогашенийНеИсполненныхВСрок)
		|	И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) <> ТИП(Документ.НачислениеСписаниеРезервов)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.Регистратор";
		
	Если ИмяРегистра<>"БухПартииЦенныхБумаг" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухПартииЦенныхБумаг", ИмяРегистра);
	КонецЕсли;
			
	Запрос.УстановитьПараметр("Регистраторы", РегистраторыПартий);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движения = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
		Движения.Прочитать();
		КоличествоСтрокаНабора = Движения.Количество();
		Для СЦ=-(КоличествоСтрокаНабора-1) По 0 Цикл
			СтрокаНабораЗаписей = Движения[-СЦ];
			Если СтрокаНабораЗаписей.ВидУчета = ЭтотОбъект.ВидУчета Тогда
				Движения.Удалить(СтрокаНабораЗаписей);
			КонецЕсли;
		КонецЦикла;
		Попытка
			Движения.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ВыборкаДетальныеЗаписи.Регистратор,,, Отказ);
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНастройки(Отказ)

	Если РассчитанныеНастройкиДляПартии.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;	
	
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправленияДляУчета, КонецПериода);
	
	РассчитанныеНастройкиДляПартии.Сортировать("Регистратор, НомерСтроки");
		
	ТекущийРегистратор = Неопределено;
	Движения = РегистрыСведений.ЗначенияНастроекУчетаЦенныхБумаг.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаНастроек Из РассчитанныеНастройкиДляПартии Цикл
		
		Если ТекущийРегистратор <> СтрокаНастроек.Регистратор Тогда
			
			Если ТекущийРегистратор <> Неопределено Тогда
				Попытка
					Движения.Записать(Истина);
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ТекущийРегистратор,,, Отказ);
					Возврат;
				КонецПопытки;
			КонецЕсли;
			
			ТекущийРегистратор = СтрокаНастроек.Регистратор;
			
			Движения = РегистрыСведений.ЗначенияНастроекУчетаЦенныхБумаг.СоздатьНаборЗаписей();
			Движения.Отбор.Регистратор.Установить(ТекущийРегистратор);
			Движения.Прочитать();
			Движения.Очистить();
			
		КонецЕсли;
		
		Движение = Движения.Добавить();
		Движение.Организация = ЭтотОбъект.Организация;
		Движение.Клиент = Клиент;
		ЗаполнитьЗначенияСвойств(Движение, СтрокаНастроек);
		
	КонецЦикла;
	
	Если ТекущийРегистратор <> Неопределено Тогда
		Попытка
			Движения.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ТекущийРегистратор,,, Отказ);
			Возврат;
		КонецПопытки;
	КонецЕсли; 

	//затрем все движения по документам, не попавшим в список регистраторов
	Регистраторы = РассчитанныеНастройкиДляПартии.ВыгрузитьКолонку("Регистратор");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекУчетаЦенныхБумаг.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг КАК ЗначенияНастроекУчетаЦенныхБумаг
		|ГДЕ
		|	НЕ ЗначенияНастроекУчетаЦенныхБумаг.Регистратор В (&Регистраторы)
		|	И ЗначенияНастроекУчетаЦенныхБумаг.Период >= &НачалоПериода
		|	И ЗначенияНастроекУчетаЦенныхБумаг.Период <= &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ЗначенияНастроекУчетаЦенныхБумаг.Регистратор) В (ТИП(Документ.Сделка), ТИП(Документ.Сделка), ТИП(Документ.Сделка))
		|	И ЗначенияНастроекУчетаЦенныхБумаг.Регистратор.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияНастроекУчетаЦенныхБумаг.Регистратор";
			
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движения = РегистрыСведений.ЗначенияНастроекУчетаЦенныхБумаг.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
		Движения.Прочитать();
		Движения.Очистить();
		Попытка
			Движения.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ВыборкаДетальныеЗаписи.Регистратор,,, Отказ);
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПлановыхОпераций()

	Если ТаблицаПлановыхОпераций = Неопределено Тогда
		ТаблицаПлановыхОпераций = РегистрыСведений.ОперацииСЦеннымиБумагами.ПолучитьОписаниеТаблицыПлановыхОпераций();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРеквизитыДокументов(ТаблицаДляСделок, ИмяРегистра)
	
	ПолучаемыеПоля = "ВалютаСделки, ЧастьСделкиРЕПО, СуммаНаОднуОблигацию, ВалютаОплаты, ДатаФиксации, ВидПогашения, Сумма, Количество, СуммаКупона, Основание, ПогашениеЦеннойБумаги, ВидЗадолженности";
	МассивПолей = СтрРазделить(СтрЗаменить(ПолучаемыеПоля, " ", ""), ",", Ложь);
	
	ПоляДляЗапроса = "";
	ПоследнееПоле = МассивПолей[МассивПолей.ВГраница()];
	Для каждого Поле Из МассивПолей Цикл
		
		Если ТаблицаДляСделок.Колонки.Найти(Поле) = Неопределено Тогда
			ТаблицаДляСделок.Колонки.Добавить(Поле, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1)));
		КонецЕсли; 
		
		ПоляДляЗапроса = ПоляДляЗапроса + Символы.Таб + "Таблица." + Поле + " КАК " + Поле;
		Если Поле <> ПоследнееПоле Тогда
			ПоляДляЗапроса = ПоляДляЗапроса + ", " + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	ПоляДляТаблицаДляСделок = СтрЗаменить(ПоляДляЗапроса, "Таблица.", "ТаблицаДляСделок.");
	ПоляДляТаблицаРегистраторов = СтрЗаменить(ПоляДляЗапроса, "Таблица.", "_ТаблицаРегистраторов.");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДляСделок", ТаблицаДляСделок);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаДляСделок.Период КАК Период,
		|	ТаблицаДляСделок.Регистратор КАК Регистратор,
		|	ТаблицаДляСделок.ПлановыеДанные КАК ПлановыеДанные,
		|	&ПоляДляТаблицаДляСделок КАК ПоляДляТаблицаДляСделок
		|ПОМЕСТИТЬ _ТаблицаРегистраторов
		|ИЗ
		|	&ТаблицаДляСделок КАК ТаблицаДляСделок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаРегистраторов.Регистратор КАК Регистратор,
		|	_ТаблицаРегистраторов.Период КАК Дата,
		|	&ПоляДляТаблицаРегистраторов КАК ПоляДляТаблицаРегистраторов
		|ИЗ
		|	_ТаблицаРегистраторов КАК _ТаблицаРегистраторов
		|ГДЕ
		|	_ТаблицаРегистраторов.ПлановыеДанные";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляДляТаблицаДляСделок КАК ПоляДляТаблицаДляСделок", ПоляДляТаблицаДляСделок);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляДляТаблицаРегистраторов КАК ПоляДляТаблицаРегистраторов", ПоляДляТаблицаРегистраторов);
	
	
	ТипыРегистраторов = Метаданные.РегистрыНакопления[ИмяРегистра].СтандартныеРеквизиты.Регистратор.Тип.Типы();
	Для каждого ТипРегистратора Из ТипыРегистраторов Цикл
	
		МдРегистратора = Метаданные.НайтиПоТипу(ТипРегистратора);
		
		ПоляВыборки = "ДокументРегистратор.Дата КАК Дата";
		
		Для каждого Поле Из МассивПолей Цикл
			Реквизит = МдРегистратора.Реквизиты.Найти(Поле);
			ПоляВыборки = ПоляВыборки + ", " + Символы.ПС + Символы.Таб + ?(Реквизит = Неопределено, "НЕОПРЕДЕЛЕНО", "ДокументРегистратор." + Реквизит.Имя) + " КАК " + Поле;
		КонецЦикла; 
		
		Запрос.Текст = Запрос.Текст + СтрЗаменить(СтрЗаменить("
			|
			|ОБЪЕДИНИТЬ
			|
			|" + "ВЫБРАТЬ
			|	ДокументРегистратор.Ссылка КАК Регистратор,
		   	|	&ПоляВыборки КАК ПоляВыборки
		   	|ИЗ
		   	|	_ТаблицаРегистраторов КАК _ТаблицаРегистраторов
		   	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК ДокументРегистратор
		   	|		ПО _ТаблицаРегистраторов.Регистратор = ДокументРегистратор.Ссылка
		   	|ГДЕ
		   	|	НЕ _ТаблицаРегистраторов.ПлановыеДанные", "Сделка", МдРегистратора.Имя), "&ПоляВыборки КАК ПоляВыборки", ПоляВыборки);
	
	КонецЦикла; 
	
	Соответствие = Новый Соответствие;
	
	Для Каждого ТекСтрока Из Запрос.Выполнить().Выгрузить() Цикл
		Соответствие.Вставить(ТекСтрока.Регистратор, ТекСтрока);
	КонецЦикла;
	
	Возврат Соответствие;
		
КонецФункции

Процедура РассчитатьПартииБУНУ(Отказ, НастройкиПоВидуУчета)
	
	// Итак, у нас есть случаи, когда погашение купона(пока только оно) проводится раньше поступления бумаг
	// из-за хитрых вывертов брокера
	// но списывать как-то надо
	// заведем массив таблицу HardcoreParty
	// это захардкоженые движения партий
	// т.е. по определенным регистраторам будут подствляться именно эти движения
	НестандартныеДвиженияПартий = ЗаполнитьНестандартныеДвиженияПартий();	
	// если что, то заполнение этих партий есть в обработке:
	// \\am-1c00\Коля\ПолучитьДвиженияПартийДляНестандартныхОпераций.erf
	// там юзается ЗначениеВСтрокуВнутр
	
	// нужет для тех случаев чтобы 1 раз заполнить нестандартные движения партий
	// и больше этот регистратор не трогать
	МассивОбработанныхРегистраторов = Новый Массив;
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
	
	МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ = РегистрыСведений.НастройкиУчетаОбщие.ПолучитьДатуНачалаНеобходимостиДанныхЕПСВоВводахЦБ(СчетДоверительногоУправленияДляУчета);	
	
	РесурсыПартий = Новый Массив;
	РесурсыПартий.Добавить("Количество");
	РесурсыПартий.Добавить("СтоимостьПокупки");
	РесурсыПартий.Добавить("СтоимостьПокупкиКупона");
	РесурсыПартий.Добавить("РасходыПриПокупкеВСтоимости");
	РесурсыПартий.Добавить("РасходыПриПокупкеВСтоимостиВВалютеУчета");
	РесурсыПартий.Добавить("ПереоценкаВСтоимости");
	РесурсыПартий.Добавить("ПереоценкаКупонаВСтоимости");
	РесурсыПартий.Добавить("Стоимость");
	РесурсыПартий.Добавить("СтоимостьВВалютеУчета");
	РесурсыПартий.Добавить("СтоимостьКупона");
	РесурсыПартий.Добавить("СтоимостьКупонаВВалютеУчета");
	РесурсыПартий.Добавить("Переоценка");
	РесурсыПартий.Добавить("ПереоценкаВВалютеУчета");
	РесурсыПартий.Добавить("ПереоценкаКупона");
	РесурсыПартий.Добавить("ПереоценкаКупонаВВалютеУчета");
	РесурсыПартий.Добавить("ИндексацияНоминала");
	РесурсыПартий.Добавить("ИндексацияНоминалаЗаВремяВладения");
	РесурсыПартий.Добавить("СуммаЧастичногоПогашения");
		
	ЭтоНалоговыйУчет = ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета);
	
	Если НастройкиПоВидуУчета = Неопределено Тогда
		
		НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
			ЭтотОбъект.КонецПериода,
			ЭтотОбъект.Организация,
			СчетДоверительногоУправленияДляУчета,
			ЭтотОбъект.ВидУчета,
			Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиУчетаПереоценки = БухгалтерскийУчет.ОпределитьНастройкиУчетаПереоценки(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета);
		
	НастройкиУчетаИндексацииНоминала = БухгалтерскийУчет.ОпределитьНастройкиУчетаИндексацииНоминала(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета);
		
	НастройкиУчетаОтражатьНаПереоценкеПолнуюСумму = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктивов(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета,
		"ОтражатьНаПереоценкеПолнуюСумму");
		
	НастройкиУчетаПогашения = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктивов(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета,
		"ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении");
		
	НастройкиУчетаЧастичногоПогашения = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктивов(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета,
		"ОтражениеДоходаАммортизационныхОблигаций");
				
	НастройкиДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктивов(
		ЭтотОбъект.КонецПериода,
		ЭтотОбъект.Организация,
		СчетДоверительногоУправленияДляУчета,
		ЭтотОбъект.ВидУчета,
		"ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением");
		
	ВариантУчетаИндексацииНоминала = НастройкиПоВидуУчета.ВариантУчетаИндексацииНоминала;	
	ИндексироватьНоминал = Ложь;
	Если ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНоминалаПриПокупке 
		ИЛИ ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНачальногоНоминала  Тогда
		ИндексироватьНоминал = Истина;
	КонецЕсли;		
	
	ЭтотОбъект.РассчитанныеПартии.Очистить();
	ЭтотОбъект.РассчитанныеПартииКПоступлению.Очистить();
	ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Очистить();
	ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Очистить();
	ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты.Очистить();
	
	
	ТаблицаШаблон = ЭтотОбъект.РассчитанныеПартии.Выгрузить();
	Если НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий > 2 Тогда
		
		НоваяТаблицаШаблон = Новый ТаблицаЗначений;
		
		ПараметрыЧисла_19_2 = Новый КвалификаторыЧисла(19, 2);
		ОписаниеСумм = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий));
		
		Для каждого Колонка Из ТаблицаШаблон.Колонки Цикл
			Если Колонка.ТипЗначения.КвалификаторыЧисла = ПараметрыЧисла_19_2 Тогда
				НоваяТаблицаШаблон.Колонки.Добавить(Колонка.Имя, ОписаниеСумм, Колонка.Заголовок, Колонка.Ширина);
			Иначе
				НоваяТаблицаШаблон.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок, Колонка.Ширина);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаШаблон = НоваяТаблицаШаблон;
	
	КонецЕсли;
	
	
	ОтменыСделок = ПолучитьОтменыСделок_БУНУ();
	ПартииПроданныеВРЕПО = ПолучитьПартииПроданныеВРЕПО_БУНУ();
	ПартииКупленныеПоРЕПО = ПолучитьПартииКупленныеПоРЕПО_БУНУ();
	
	КомиссииПоПокупкам = Неопределено;
	Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость ИЛИ НастройкиУчета.ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости Тогда
	
		КомиссииПоПокупкам = ПолучитьКомиссииПоПокупкам_БУНУ();
		ПоставкиПоПокупкам = ПолучитьПоставкиПоПокупкам_БУНУ();
	
	КонецЕсли;
	
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.КонецПериода);
	
	ЭтоКлиентБудущее = (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_БУДУЩЕЕ"));
	ЭтоКлиентЭволюция	= (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция"));
	ЭтоКлиентТелеком = (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ТелекомСоюз"));
	ЭтоКлиентСНГ = (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФ_СНГ"));
	
	ЭтоФизЛицо = Ложь;
	Если СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет
		ИЛИ СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица Тогда
	
		ЭтоФизЛицо = Истина;
	
	КонецЕсли;	
	
	//--------------------------
	// #416666 - добавил настройка РаспределениеПартийНУДолжноСовпадатьСЕПС
	Если ЭтоНалоговыйУчет И НастройкиУчета.РаспределениеПартийНУДолжноСовпадатьСЕПС Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.Регистратор КАК Регистратор,
			|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.Ссылка, ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.Партия, БухПартииЦенныхБумаг.Партия)) КАК Партия,
			|	ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.СтрокаПартии, ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.СтрокаПартии, БухПартииЦенныхБумаг.СтрокаПартии)) КАК СтрокаПартии,
			|	БухПартииЦенныхБумаг.Количество КАК Количество
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
			|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
			|			ПО РеклассификацияАктивовЕПСПартии.Ссылка = ВводЦенныхБумагЦенныеБумаги.РеклассификацияАктивовЕПС
			|				И РеклассификацияАктивовЕПСПартии.НомерСтроки = ВводЦенныхБумагЦенныеБумаги.СтрокаРеклассификации
			|		ПО БухПартииЦенныхБумаг.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
			|			И БухПартииЦенныхБумаг.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
			|ГДЕ
			|	БухПартииЦенныхБумаг.Период >= &НачалоПериода
			|	И БухПартииЦенныхБумаг.Период <= &КонецПериода
			|	И БухПартииЦенныхБумаг.Организация = &Организация
			|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И БухПартииЦенныхБумаг.Количество > 0";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
		
		СписанияПартийЕПС = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	//--------------------------
	ПереоценкиПередВыводами = Неопределено;
	ПереоценкиДляОпераций = Неопределено;
	
	Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом ИЛИ НастройкиПоВидуУчета.НачислятьПроцентныеДоходыПоВыводимымАктивам Тогда
		ПереоценкиПередВыводами = ПолучитьПереоценкиПередВыводами(); 
	КонецЕсли;
	
	Если НастройкиПоВидуУчета.ПереоцениватьПриобретенныеАктивы ИЛИ НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей Тогда
		ПереоценкиДляОпераций = ПолучитьПереоценкиДляОпераций(НастройкиПоВидуУчета.ПереоцениватьПриобретенныеАктивы, НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей, НастройкиПоВидуУчета.УчитыватьПогрешностьОкругленияПриПродаже); 
	КонецЕсли;
	
	
	Порядок = "";
	Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ЛИФО Тогда
		Порядок = " УБЫВ ";
	КонецЕсли;
	
	#Область ЗапросОстаткиИОперацииСЦБ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.Сделка).ВалютаСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).ВалютаСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ВводЦенныхБумаг).Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК ВалютаСделки,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупки,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупона,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимости,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимости,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимости,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК Стоимость,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумагОстатки.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашения,
		|	&НачалоПериода КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход) КАК ВидДвижения,
		|	БухПартииЦенныхБумагОстатки.Партия.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|			ТОГДА ВЫБОР
		|					КОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки = """"
		|						ТОГДА ""9999999999999999""
		|					ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.НомерСделки
		|				КОНЕЦ
		|		ИНАЧЕ ""9999999999999999""
		|	КОНЕЦ КАК НомерСделки,
		|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК ИндексацияНоминала,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладения,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ВводЦенныхБумагЦенныеБумаги.ДатаПокупки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПокупки,
		|	ЛОЖЬ КАК ПлановыеДанные,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|			И (ВводЦенныхБумагЦенныеБумаги.Ссылка.Организация = &Организация)
		|			И (ВводЦенныхБумагЦенныеБумаги.Ссылка.СчетДоверительногоУправления В (&СписокСтратегий))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	КурсыВалют.Валюта,
		|	ВводЦенныхБумагЦенныеБумаги.СтрокаПартии,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.КоличествоНУ
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Количество
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаНУ - ВводЦенныхБумагЦенныеБумаги.РасходыПриПокупкеВСтоимости
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНУ
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупона
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.РасходыПриПокупкеВСтоимости
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаНУ
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНУ
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупона
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА 0
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаПереоценки
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоНУ
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленного
		|	КОНЕЦ,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВводЦенныхБумаг).МоментВремени,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки = """"
		|			ТОГДА ""9999999999999999""
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.НомерСделки
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВЫБОР
		|					КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаНУВВалютеУчета > 0
		|						ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаНУВВалютеУчета
		|					ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаНУ * КурсыВалют.Курс / КурсыВалют.Кратность
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаВВалютеУчета > 0
		|					ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаВВалютеУчета
		|				ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВЫБОР
		|					КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНУВВалютеУчета > 0
		|						ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНУВВалютеУчета
		|					ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНУ * КурсыВалют.Курс / КурсыВалют.Кратность
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаВВалютеУчета > 0
		|					ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаВВалютеУчета
		|				ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупона * КурсыВалют.Курс / КурсыВалют.Кратность
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПереоценкиВВалютеУчета <> 0
		|					ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаПереоценкиВВалютеУчета
		|				ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаПереоценки * КурсыВалют.Курс / КурсыВалют.Кратность
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|			ТОГДА ВЫБОР
		|					КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоНУВВалютеУчета > 0
		|						ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоНУВВалютеУчета
		|					ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоНУ * КурсыВалют.Курс / КурсыВалют.Кратность
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоВВалютеУчета > 0
		|					ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленногоВВалютеУчета
		|				ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.СуммаКупонаНачисленного * КурсыВалют.Курс / КурсыВалют.Кратность
		|			КОНЕЦ
		|	КОНЕЦ,
		|	0,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаИндексацииНоминала,
		|	ВводЦенныхБумагЦенныеБумаги.ДатаПокупки,
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА &ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО ВводЦенныхБумагЦенныеБумаги.Ссылка.Валюта = КурсыВалют.Валюта
		|				И (НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.Ссылка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|		ПО ОперацииСЦеннымиБумагами.Операция = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И ОперацииСЦеннымиБумагами.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|			И (ВЫБОР
		|				КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|					ТОГДА ВводЦенныхБумагЦенныеБумаги.КоличествоНУ
		|				ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.Количество
		|			КОНЕЦ <> 0)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И &ВключатьВводыВыводы
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.Партия, ВыводЦенныхБумагЦенныеБумаги.Партия),
		|	ВыводЦенныхБумагЦенныеБумаги.ВалютаКотировки,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.СтрокаПартии, ВыводЦенныхБумагЦенныеБумаги.СтрокаПартии),
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВыводЦенныхБумаг).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА &ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости
		|			ТОГДА ВыводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|			ПО ВыводЦенныхБумагЦенныеБумаги.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
		|				И ВыводЦенныхБумагЦенныеБумаги.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
		|		ПО ОперацииСЦеннымиБумагами.Операция = ВыводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.НомерСтроки = ВыводЦенныхБумагЦенныеБумаги.НомерСтроки
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И &ВключатьВводыВыводы
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВыводЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	КурсВалютыСделки.Валюта,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).МоментВремени,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).НомерСделки,
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСделки
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыСделки.Период)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ВалютаСделки = КурсВалютыСделки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Сделка)
		|	И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Сделка).ОтложенноеИсполнение
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	КурсВалютыСделки.Валюта,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).МоментВремени,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).НомерСделки,
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСделки
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыСделки.Период)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ВалютаСделки = КурсВалютыСделки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СделкаРЕПО)
		|	И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СделкаРЕПО).ОтложенноеИсполнение
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	КурсВалютыСделки.Валюта,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).МоментВремени,
		|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки,
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСделки
		|		ПО (ВЫБОР
		|				КОГДА ОперацииСЦеннымиБумагами.ДатаОперации < &ДатаПереходаКВзятиюКурсовВалютДатойДоговора
		|					ТОГДА НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыСделки.Период
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).Дата, ДЕНЬ) = КурсВалютыСделки.Период
		|			КОНЕЦ)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).ВалютаСделки = КурсВалютыСделки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (ВЫБОР
		|				КОГДА ОперацииСЦеннымиБумагами.ДатаОперации < &ДатаПереходаКВзятиюКурсовВалютДатойДоговора
		|					ТОГДА НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).Дата, ДЕНЬ) = КурсВалютыНоминала.Период
		|			КОНЕЦ)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	КурсВалютыСделки.Валюта,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ОперацииСЦеннымиБумагами.Сумма
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.Сумма * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ОперацииСЦеннымиБумагами.СуммаКупона
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).МоментВремени,
		|	"""",
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыСделки.Курс / КурсВалютыСделки.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСделки
		|		ПО (ВЫБОР
		|				КОГДА ОперацииСЦеннымиБумагами.ДатаОперации < &ДатаПереходаКВзятиюКурсовВалютДатойДоговора
		|					ТОГДА НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыСделки.Период
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).Дата, ДЕНЬ) = КурсВалютыСделки.Период
		|			КОНЕЦ)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПоставкаЦенныхБумаг).ВалютаСделки = КурсВалютыСделки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (ВЫБОР
		|				КОГДА ОперацииСЦеннымиБумагами.ДатаОперации < &ДатаПереходаКВзятиюКурсовВалютДатойДоговора
		|					ТОГДА НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.Сделка).Дата, ДЕНЬ) = КурсВалютыНоминала.Период
		|			КОНЕЦ)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	КурсВалютыПолученияДохода.Валюта,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыПолученияДохода.Курс / КурсВалютыПолученияДохода.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеКупона).МоментВремени,
		|	"""",
		|	0,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыПолученияДохода.Курс / КурсВалютыПолученияДохода.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыПолученияДохода
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыПолученияДохода.Период)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеКупона).ВалютаОплаты = КурсВалютыПолученияДохода.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	КурсВалютыПолученияДохода.Валюта,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыПолученияДохода.Курс / КурсВалютыПолученияДохода.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыПолученияДохода.Курс / КурсВалютыПолученияДохода.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).МоментВремени,
		|	"""",
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыПолученияДохода.Курс / КурсВалютыПолученияДохода.Кратность,
		|	ОперацииСЦеннымиБумагами.СуммаКупона * КурсВалютыПолученияДохода.Курс / КурсВалютыПолученияДохода.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыПолученияДохода
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыПолученияДохода.Период)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).ВалютаОплаты = КурсВалютыПолученияДохода.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	&ВалютаУчета,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СписаниеЦеннойБумаги).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	&ВалютаУчета,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.СнятиеЦеннойБумагиСУчета).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СнятиеЦеннойБумагиСУчета)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	&ВалютаУчета,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету).ВыбытиеПоБУ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	&ВалютаУчета,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.Оплата).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Оплата)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Основание) = ТИП(Документ.СделкаРЕПО)
		|				ТОГДА ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.СделкаРЕПО).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.ПогашениеЦеннойБумаги).ВидПогашения <> ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ЧастичноеПогашение)
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание,
		|	КурсВалютыПогашенияКупона.Валюта,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).ВозвратныйКупонКЗачету * КурсВалютыПогашенияКупона.Курс / КурсВалютыПогашенияКупона.Кратность / КурсВалютыНоминала.Курс * КурсВалютыНоминала.Кратность,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага.ВалютаНоминала = КурсВалютыНоминала.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыПогашенияКупона
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыПогашенияКупона.Период)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).ВалютаЗадолженностиПоКупону = КурсВалютыПогашенияКупона.Валюта)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИзменениеУсловийСделки)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).ВозвратныйКупонКЗачету > 0
		|	И ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание ССЫЛКА Документ.СделкаРЕПО
		|	И ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание КАК Документ.СделкаРЕПО).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	И ОперацииСЦеннымиБумагами.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИзменениеУсловийСделки).Основание,
		|	&ВалютаУчета,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО).МоментВремени,
		|	"""",
		|	ОперацииСЦеннымиБумагами.Сумма * КурсВалютыНоминала.Курс / КурсВалютыНоминала.Кратность,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыНоминала
		|		ПО (НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) = КурсВалютыНоминала.Период)
		|			И (ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала = КурсВалютыНоминала.Валюта)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	&ВалютаУчета,
		|	ОперацииСЦеннымиБумагами.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор,
		|	ОперацииСЦеннымиБумагами.ВидДвижения,
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.КонвертацияЦенныхБумаг).МоментВремени,
		|	"""",
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.КонвертацияЦенныхБумаг)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	УчетныйАктивЕПС" + Порядок + ",
		|	Период" + Порядок + ",
		|	ДатаПокупки" + Порядок + ",
		|	НомерСделки" + Порядок + ",
		|	МоментВремени" + Порядок + ",
		|	СтрокаПартии" + Порядок + "
		|ИТОГИ ПО
		|	Рынок,
		|	ЦеннаяБумага";
	
	#КонецОбласти
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВыбытиеПоБУ", "ВыбытиеПоНУ");
	КонецЕсли;
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);
	Запрос.УстановитьПараметр("ВключатьВводыВыводы", ВключатьВводыВыводы);
	Запрос.УстановитьПараметр("ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости", НастройкиУчета.ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости);
	Запрос.УстановитьПараметр("ВалютаУчета", ВалютаУчета);
	
	// #678414 - по БУ и НУ курс валюты должен браться по дате ДОГОВОРА (т.е. Сделки, а не исполнения или поставки)
	// чтобы не поломать старые периоды завожу ДатаПереходаКВзятиюКурсовВалютДатойДоговора
	// #техдолг - прикрутить настройку ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости из настроек по виду учета
	Запрос.УстановитьПараметр("ДатаПереходаКВзятиюКурсовВалютДатойДоговора", '20250501');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РеквизитыРегистраторов = ПолучитьРеквизитыДокументов(РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой), "БухПартииЦенныхБумаг");
	
	Если НастройкиУчета.ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости Тогда
	
		ТаблицаСделок = Новый ТаблицаЗначений;
		ТаблицаСделок.Колонки.Добавить("Основание", Метаданные.ОпределяемыеТипы.Сделки.Тип);
		
		ТаблицаДляСделок = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
		ТаблицаДляСделок.Свернуть("Регистратор", "");
		Для каждого СтрокаТаблицыДляСделок Из ТаблицаДляСделок Цикл
			Если ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
				СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
				СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Регистратор.Основание;
			ИначеЕсли ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
				СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
				СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Регистратор.Основание;
			ИначеЕсли ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.Сделка") Тогда
				СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
				СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Регистратор;
			ИначеЕсли ТипЗнч(СтрокаТаблицыДляСделок.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
				СтрокаТаблицаСделок = ТаблицаСделок.Добавить();
				СтрокаТаблицаСделок.Основание = СтрокаТаблицыДляСделок.Регистратор;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаСделок.Свернуть("Основание", "");
		
		РаспределенияПоСделкам = БухгалтерскийУчетЕПС.ПолучитьРаспределениеПоВидуАктива(ТаблицаСделок);
		РаспределенияПоСделкам.Индексы.Добавить("Сделка, ЦеннаяБумага"); 
	
	КонецЕсли;
	
	ВыборкаРынок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРынок.Следующий() Цикл
		Рынок = ВыборкаРынок.Рынок;
		ЭтоРынокОблигаций = Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
		
		ВыборкаЦеннаяБумага = ВыборкаРынок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦеннаяБумага.Следующий() Цикл
			
			ЦеннаяБумага 		= ВыборкаЦеннаяБумага.ЦеннаяБумага;
			УчетныйАктив 		= БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.КонецПериода, Рынок, ЦеннаяБумага);
			УчетныйАктивКупон 	= БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.КонецПериода, Рынок, ЦеннаяБумага, Истина);
			
			Если ЭтоНалоговыйУчет Тогда 				
				НастройкиУчетаАктиваКупон = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
					ЭтотОбъект.КонецПериода,
					ЭтотОбъект.Организация,
					СчетДоверительногоУправленияДляУчета,
					УчетныйАктивКупон,
					ЭтотОбъект.ВидУчета);	
			Иначе 
				НастройкиУчетаАктиваКупон = Неопределено;
			КонецЕсли;	
			
			УчитыватьПереоценкуОтдельно 	 = ?(НастройкиУчетаПереоценки.Свойство(УчетныйАктив.ИмяПредопределенныхДанных), 	 НастройкиУчетаПереоценки[УчетныйАктив.ИмяПредопределенныхДанных], Неопределено);
			УчитыватьПереоценкуОтдельноКупон = ?(НастройкиУчетаПереоценки.Свойство(УчетныйАктивКупон.ИмяПредопределенныхДанных), НастройкиУчетаПереоценки[УчетныйАктивКупон.ИмяПредопределенныхДанных], Неопределено);
			
			ОтражатьНаПереоценкеПолнуюСумму  	 = ?(НастройкиУчетаОтражатьНаПереоценкеПолнуюСумму.Свойство(УчетныйАктив.ИмяПредопределенныхДанных), 	  НастройкиУчетаОтражатьНаПереоценкеПолнуюСумму[УчетныйАктив.ИмяПредопределенныхДанных], Неопределено);
			ОтражатьНаПереоценкеПолнуюСуммуКупон = ?(НастройкиУчетаОтражатьНаПереоценкеПолнуюСумму.Свойство(УчетныйАктивКупон.ИмяПредопределенныхДанных), НастройкиУчетаОтражатьНаПереоценкеПолнуюСумму[УчетныйАктивКупон.ИмяПредопределенныхДанных], Неопределено);
			
			ВариантПогашения 			= ?(НастройкиУчетаПогашения.Свойство(УчетныйАктив.ИмяПредопределенныхДанных), 		НастройкиУчетаПогашения[УчетныйАктив.ИмяПредопределенныхДанных], Неопределено);
			ВариантЧастичногоПогашения 	= ?(НастройкиУчетаЧастичногоПогашения.Свойство(УчетныйАктив.ИмяПредопределенныхДанных),  НастройкиУчетаЧастичногоПогашения[УчетныйАктив.ИмяПредопределенныхДанных], Неопределено);
			
			УчитыватьИндексациюОтдельно 	 = ?(НастройкиУчетаИндексацииНоминала.Свойство(УчетныйАктив.ИмяПредопределенныхДанных), 	 НастройкиУчетаИндексацииНоминала[УчетныйАктив.ИмяПредопределенныхДанных], Неопределено);
			
			ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением = ?(НастройкиДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением.Свойство(УчетныйАктивКупон.ИмяПредопределенныхДанных), НастройкиДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением[УчетныйАктивКупон.ИмяПредопределенныхДанных], Неопределено);
			
			ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
			
			ИндексируемыйНоминал = Ложь;
			ЭтоДефолтнаяОблигация = Ложь;
			Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
				ИндексируемыйНоминал = ЦеннаяБумага.ИндексируемыйНоминал;
				
				ЭтоДефолтнаяОблигация = (ВыборкаЦеннаяБумага.ЦеннаяБумага.ДатаПогашения < НачалоДня(ЭтотОбъект.НачалоПериода));
				
				Если ВыборкаЦеннаяБумага.ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Прайм") Тогда
					ЭтоДефолтнаяОблигация = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			ПриходныеПартии = ТаблицаШаблон.СкопироватьКолонки();
			
			ПогрешностиОкругления = ТаблицаШаблон.СкопироватьКолонки();
			
			ВыборкаДетальныеЗаписи = ВыборкаЦеннаяБумага.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если НестандартныеДвиженияПартий.Количество() > 0 Тогда
					
					Если МассивОбработанныхРегистраторов.Найти(ВыборкаДетальныеЗаписи.Регистратор) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					НестандартныеДвиженияПартийПоРегистратору = НестандартныеДвиженияПартий.НайтиСтроки(Новый Структура("Регистратор", ВыборкаДетальныеЗаписи.Регистратор));
					
					Если НестандартныеДвиженияПартийПоРегистратору.Количество() > 0 Тогда
					
						Для каждого СтрокаДвиженияПартий Из НестандартныеДвиженияПартийПоРегистратору Цикл
						
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаДвиженияПартий);
						
						КонецЦикла;
						
						МассивОбработанныхРегистраторов.Добавить(ВыборкаДетальныеЗаписи.Регистратор);
						
						Продолжить;
						
					КонецЕсли;
				
				КонецЕсли;
				
				
				// уточнения по методу расчета по-среднему (+ добавильст партии по АС, которые идут именно как партии):
				// 1. при списании из "общей кучи" нужно учитывать 2 "кучки" по СС и любое количество кучек по АС:
				//		а. то, что было на утро
				//		б. то, что поступило в течение дня
				//      в - ... партии по АС, которых может быть много
				// 2. каждая кучка списывается отдельно
				// 3. какие возможны ситуации при списании(продаже):
				//		а. на утро было достаточное количество, чтобы списать (напр.: на утро было 100, потом купили 3, потом продаем 50)
				//			значит, кучка 1.а уходит по-среднему, кучка 1.б не трогается
				//		б. на утро было недостаточное количество, чтобы списать (напр.: на утро было 100, потом купили 3, потом продаем 101)
				//			значит, кучка 1.а уходит вся, как есть, а кучка 1.б списывается по-среднему
				//		в. на утро ничего не было, продаем то, что пришло за день
				//			значит, кучка 1.б списывается по-среднему
				//		г. только после исчерпания кучек 1.а и 1.б мы приступаем к кучкам по АС (кучка в и т.д.)
				//
				//	Решаться эта задача будет тем, что если раньше при методе расчета по-среднему была всегда одна строка (общая кучка),
				// 	то теперь их будет 2: 
				//		а. строке 0 будет кучка 1.а
				//		б. строке 1 будет кучка 1.б (+ будет заполнено поле период, чтобы понимать в каком дне мы ее, пардон, отложили)
				//		в. в строках 2 и больше будту партии по АС
				//	перед каждой операцией (не важно приход или расход) мы будем проверять можно ли кучку 1.б переложить в кучку 1.а и перекладывать если можно
				//	приход будет идти следующим образом:
				//		а. если бумага по СС то в кучку 1.б
				//		б. если бумага по АС, то просто добавляем партии
				//  расход будет идти по алгоритму из п.3
				Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ПоСреднему
					И ПриходныеПартии.Количество() > 1
					И ПриходныеПартии[1].Количество > 0 Тогда
					
					ПартииНаНачалоДня = ПриходныеПартии[0];
					ПриходнаяПартия = ПриходныеПартии[1];
					
					Если ПриходнаяПартия.Период < НачалоДня(ВыборкаДетальныеЗаписи.Период) Тогда // наступил новый день - нужна переброска
						Для каждого РеквизитПартий Из Метаданные.РегистрыНакопления.БухПартииЦенныхБумаг.Ресурсы Цикл
							Если РесурсыПартий.Найти(РеквизитПартий.Имя) <> Неопределено Тогда 
								ПартииНаНачалоДня[РеквизитПартий.Имя] = ПартииНаНачалоДня[РеквизитПартий.Имя] + ПриходнаяПартия[РеквизитПартий.Имя];
								ПриходнаяПартия[РеквизитПартий.Имя] = 0;
							КонецЕсли;
						КонецЦикла;
						ПриходныеПартии.Удалить(ПриходнаяПартия);
					КонецЕсли;
				КонецЕсли;
				
				// Проверим на отмены
				Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Сделка")
					ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
				
					ОтменыСделки = ОтменыСделок.НайтиСтроки(Новый Структура("Основание", ВыборкаДетальныеЗаписи.Регистратор));
					Если ОтменыСделки.Количество() > 0 Тогда
						// предполагаем, что количество отмен не может быть больше одной
						ДатаОтмены = ОтменыСделки[0].ДатаОперации;
						
						Если НачалоДня(ДатаОтмены) <> НачалоДня(ВыборкаДетальныеЗаписи.Период) Тогда
						    // отменять сделку можно только в тот же день!
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не поддерживаются отмены сделок, совершенные не в день сделки: " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
							Отказ = Истина;
							Возврат;
							
						Иначе
							// седлка отменена - не считаем партии по ней
							Продолжить;
							
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.КонвертацияЦенныхБумаг") Тогда
					
					#Область Конвертация
					Если ВыборкаДетальныеЗаписи.Рынок <> Перечисления.РынкиЦенныхБумаг.Акции Тогда 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет партий по документу Конвертация ценных бумаг предусмотрен только для акций");
						Продолжить;						
					КонецЕсли;
					ЭтоВыделение = (ВыборкаДетальныеЗаписи.Регистратор.ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.Выделение); // особый вид, при котором партиеобразующим документом будет конвертация
					Если ЭтоВыделение Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид конвертации 'Выделение' пока не реализован");
						Продолжить;						
					КонецЕсли;
					
					Коэффициент = ВыборкаДетальныеЗаписи.Регистратор.Коэффициент;
					
					Если ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
						
						//спишем все партии
						Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
							ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи, "Регистратор,Период,Рынок");
							
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
							
							// при обмене сохраняем партию (по НУ, согласно НК, по БУ до первого обратного случая), будет выделение - добавлю условие
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
							ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи, "Регистратор, Период");
							
							НовоеДвижение.ЦеннаяБумага = ВыборкаДетальныеЗаписи.Регистратор.ЦеннаяБумагаНовая;
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							НовоеДвижение.Количество = СтрокаПриходныхПартий.Количество * Коэффициент; 
							
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ЗачислениеПартии;
							
						КонецЦикла;
						
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ЗачислениеПартии;
						
					ИначеЕсли ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
						
						Продолжить;  // проводка сделана выше в секции расход
						
					КонецЕсли;
					#КонецОбласти
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
					
					#Область Приход
					ЭтоОбратноеРЕПО = Ложь;
					ЭтоЗакрытиеПрямогоРЕПО = Ложь;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
						Если РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ЧастьСделкиРЕПО = 1 Тогда
							ЭтоОбратноеРЕПО = Истина;
					    ИначеЕсли РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ЧастьСделкиРЕПО = 2 Тогда
							ЭтоЗакрытиеПрямогоРЕПО = Истина;
						КонецЕсли;
					ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг")
						И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
						
						Если РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Основание.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
							ЭтоОбратноеРЕПО = Истина;
					    ИначеЕсли РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Основание.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
							ЭтоЗакрытиеПрямогоРЕПО = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
					Если ЭтоЗакрытиеПрямогоРЕПО Тогда // возвращаем на баланс партии
						
						ПартииПроданныеВРЕПОКУдалению = Новый Массив;
						
						Если ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
							ПартииПроданныеВРЕПОПоСделке = ПартииПроданныеВРЕПО.НайтиСтроки(Новый Структура("ПродажаРЕПО,СтрокаПродажиРЕПО", ВыборкаДетальныеЗаписи.Партия.ПерваяЧастьРЕПО, ВыборкаДетальныеЗаписи.СтрокаПартии));
						Иначе
							ПартииПроданныеВРЕПОПоСделке = Новый Массив;
							
							ПартииПроданныеВРЕПОПоБумаге = ПартииПроданныеВРЕПО.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаДетальныеЗаписи.ЦеннаяБумага));
							Для Каждого ПартияПроданнаяВРЕПОПоБумаге ИЗ ПартииПроданныеВРЕПОПоБумаге Цикл
								//куда пихать СтрокаПродажиРЕПО?
								Если НЕ ЗначениеЗаполнено(ПартияПроданнаяВРЕПОПоБумаге.ПродажаРЕПО) Тогда
									//пока Коля не отпустит переоценку. Там не заполнены измерения
									Продолжить;
								КонецЕсли;
								// пропускаем биржевые репо
								Если ТипЗнч(ПартияПроданнаяВРЕПОПоБумаге.ПродажаРЕПО) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
									Продолжить;
								КонецЕсли;
								Если ПартияПроданнаяВРЕПОПоБумаге.ПродажаРЕПО.Основание = ВыборкаДетальныеЗаписи.Партия.Основание Тогда
									
									ПартииПроданныеВРЕПОПоСделке.Добавить(ПартияПроданнаяВРЕПОПоБумаге);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						Для каждого СтрокаПартииПроданныеВРЕПОПоСделке Из ПартииПроданныеВРЕПОПоСделке Цикл
							
							// запомним, что удалить надо из репошных 
							ПартииПроданныеВРЕПОКУдалению.Добавить(СтрокаПартииПроданныеВРЕПОПоСделке);
							
							Если ТипЗнч(СтрокаПартииПроданныеВРЕПОПоСделке.Партия) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
								
								// пришла партия
								ПриходнаяПартияРЕПО = ПартииКупленныеПоРЕПО.Добавить();
								ЗаполнитьЗначенияСвойств(ПриходнаяПартияРЕПО, СтрокаПартииПроданныеВРЕПОПоСделке);
								//ПриходнаяПартияРЕПО.НомерСтроки = ПартииКупленныеПоРЕПО.Количество();
								
								// движение по партиям приход сделать
								НовоеДвижениеРЕПО = ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Добавить();
								ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, ПриходнаяПартияРЕПО);
								
								НовоеДвижениеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
								НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Приход;
								НовоеДвижениеРЕПО.СтрокаКорзиныЦенныхБумаг = СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии;
								
							Иначе
								
								НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО, ВыборкаДетальныеЗаписи.Период, СтрокаПартииПроданныеВРЕПОПоСделке, СтрокаПартииПроданныеВРЕПОПоСделке.Количество, СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии,,,, Отказ);
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии;
								
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								
								// пришла партия
								ДанныеПартии = Новый Структура();
								ДанныеПартии.Вставить("ЦеннаяБумага", СтрокаПартииПроданныеВРЕПОПоСделке.ЦеннаяБумага);
								ДанныеПартии.Вставить("Партия", СтрокаПартииПроданныеВРЕПОПоСделке.Партия);
								ДанныеПартии.Вставить("СтрокаПартии", СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии);
								
								НайденныеСтроки = ПриходныеПартии.НайтиСтроки(ДанныеПартии);
								Если НайденныеСтроки.Количество() = 0 Тогда 
									
									ПриходнаяПартия = ПриходныеПартии.Добавить();
									ЗаполнитьЗначенияСвойств(ПриходнаяПартия, СтрокаПартииПроданныеВРЕПОПоСделке);
									ПриходнаяПартия.НомерСтроки = ПриходныеПартии.Количество();
									ПриходнаяПартия.Период = ПриходнаяПартия.Партия.Дата;
									
									НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
									ЗаполнитьЗначенияСвойств(НовоеДвижение, ПриходнаяПартия);
									
									НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
									НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
									НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
									НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии;
									
									//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ЗачислениеПартии;
									
								Иначе
									
									ПриходнаяПартия = НайденныеСтроки[0];
									
									Для Каждого Ресурс из РесурсыПартий Цикл
										ПриходнаяПартия[Ресурс] = ПриходнаяПартия[Ресурс] + СтрокаПартииПроданныеВРЕПОПоСделке[Ресурс];	
									КонецЦикла;	
																		
									НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
									ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПартииПроданныеВРЕПОПоСделке);
									
									НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
									НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
									НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
									НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии;
																	
									//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ЗачислениеПартии;
									
								КонецЕсли;
								
								// добавим дооценку вернувшихся из РЕПО бумаг, но это только для обычных партий партии, обратного РЕПО не дооцениваем
								Если НастройкиПоВидуУчета.ПереоцениватьПриобретенныеАктивы  Тогда
								
									ЭтоЗакрытиеКороткойПозиции = Ложь;
									Если ТипЗнч(ПриходнаяПартия.Партия) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
										ЭтоЗакрытиеКороткойПозиции = Истина;
									ИначеЕсли ТипЗнч(ПриходнаяПартия.Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
										ИЛИ ТипЗнч(ПриходнаяПартия.Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
										Если ТипЗнч(ПриходнаяПартия.Партия.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда 
											ЭтоЗакрытиеКороткойПозиции = Истина;
										КонецЕсли;
									КонецЕсли;
									
									Если НЕ ЭтоЗакрытиеКороткойПозиции Тогда // дооценим
									
										ПереоценкаДляПокупки = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения", 
																	ВыборкаДетальныеЗаписи.Регистратор, 
																	ЦеннаяБумага, 
																	Перечисления.ВидыДвижений.Приход));
										
										Если ПереоценкаДляПокупки.Количество() <> 1 Тогда
											ТекстСообщения = СтрШаблон("Не удалось определить цену бумаги %1 для покупки %2", ЦеннаяБумага, ВыборкаДетальныеЗаписи.Регистратор); 
											ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
											Возврат;
										КонецЕсли;
										
										Если СтрокаПартииПроданныеВРЕПОПоСделке.Количество = ПереоценкаДляПокупки[0].Количество Тогда
											СуммаРынок = ПереоценкаДляПокупки[0].СуммаРынок;
											СуммаРынокВВалютеУчета = ПереоценкаДляПокупки[0].СуммаРынокВВалютеУчета;
										Иначе
											СуммаРынок = ПереоценкаДляПокупки[0].СуммаРынок / ПереоценкаДляПокупки[0].Количество * СтрокаПартииПроданныеВРЕПОПоСделке.Количество;
											СуммаРынокВВалютеУчета = ПереоценкаДляПокупки[0].СуммаРынокВВалютеУчета / ПереоценкаДляПокупки[0].Количество * СтрокаПартииПроданныеВРЕПОПоСделке.Количество;
											
											ПереоценкаДляПокупки[0].СуммаРынок = ПереоценкаДляПокупки[0].СуммаРынок - СуммаРынок;
											ПереоценкаДляПокупки[0].СуммаРынокВВалютеУчета = ПереоценкаДляПокупки[0].СуммаРынокВВалютеУчета - СуммаРынокВВалютеУчета;
											ПереоценкаДляПокупки[0].Количество = ПереоценкаДляПокупки[0].Количество - СтрокаПартииПроданныеВРЕПОПоСделке.Количество;
										КонецЕсли;
										
										НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
										
										ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, НовоеДвижение, "Регистратор,Период,Рынок,ЦеннаяБумага,Партия,СтрокаПартии");
										НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
										НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
										
										//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
										
										Если УчитыватьПереоценкуОтдельно Тогда
											
											НовоеДвижениеПереоценки.Переоценка				= СуммаРынок - (НовоеДвижение.Стоимость + НовоеДвижение.Переоценка); 
											НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета	= СуммаРынокВВалютеУчета - (НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.ПереоценкаВВалютеУчета); 
											
											ПриходнаяПартия.Переоценка						= ПриходнаяПартия.Переоценка + НовоеДвижениеПереоценки.Переоценка;
											ПриходнаяПартия.ПереоценкаВВалютеУчета			= ПриходнаяПартия.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
											
										Иначе
											
											НовоеДвижениеПереоценки.Стоимость				= СуммаРынок - НовоеДвижение.Стоимость; 
											НовоеДвижениеПереоценки.СтоимостьВВалютеУчета	= СуммаРынокВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета; 
											НовоеДвижениеПереоценки.ПереоценкаВСтоимости	= НовоеДвижениеПереоценки.Стоимость;
											
											ПриходнаяПартия.Стоимость						= ПриходнаяПартия.Стоимость + НовоеДвижениеПереоценки.Стоимость;
											ПриходнаяПартия.СтоимостьВВалютеУчета			= ПриходнаяПартия.СтоимостьВВалютеУчета + НовоеДвижениеПереоценки.СтоимостьВВалютеУчета;
											ПриходнаяПартия.ПереоценкаВСтоимости			= ПриходнаяПартия.ПереоценкаВСтоимости + НовоеДвижениеПереоценки.ПереоценкаВСтоимости;
											
										КонецЕсли;
										
									
									КонецЕсли;
								
								КонецЕсли;
								
							КонецЕсли;						
							
							// движение по партиям РЕПО расход сделать
							НовоеДвижениеРЕПО = РассчитанныеПартииПрямоеРЕПО.Добавить();
							ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, СтрокаПартииПроданныеВРЕПОПоСделке);
							
							НовоеДвижениеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижениеРЕПО.СтрокаКорзиныЦенныхБумаг = СтрокаПартииПроданныеВРЕПОПоСделке.СтрокаПартии;
							
						КонецЦикла;
						
						//ПриходныеПартии.Сортировать("Период,НомерСделки,МоментВремени"); // отсортировать обязательно
						ПриходныеПартии.Сортировать("Период"); // отсортировать обязательно
						
						// удалим партии РЕПО
						Для каждого СтрокаПартииПроданныеВРЕПОКУдалению Из ПартииПроданныеВРЕПОКУдалению Цикл
							ПартииПроданныеВРЕПО.Удалить(СтрокаПартииПроданныеВРЕПОКУдалению);
						КонецЦикла;
						
					ИначеЕсли ЭтоОбратноеРЕПО И НастройкиПоВидуУчета.УчитыватьПартииРЕПООтдельно Тогда // приходуем в РЕПОшные партии
						
						ПриходнаяПартияРЕПО = ПартииКупленныеПоРЕПО.Добавить();
						
						ЗаполнитьЗначенияСвойств(ПриходнаяПартияРЕПО, ВыборкаДетальныеЗаписи);
						
						ВалютаСделки = РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВалютаСделки;
						ПриходнаяПартияРЕПО.Стоимость = РаботаСВалютами.ПересчетСуммыВВалюте(ВыборкаДетальныеЗаписи.СтоимостьПокупки, ВалютаСделки, ВыборкаДетальныеЗаписи.Период, ВалютаНоминала, ВыборкаДетальныеЗаписи.Период, Отказ);
						ПриходнаяПартияРЕПО.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СтоимостьПокупки, ВалютаСделки, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
						ПриходнаяПартияРЕПО.СтоимостьКупона = РаботаСВалютами.ПересчетСуммыВВалюте(ВыборкаДетальныеЗаписи.СтоимостьПокупкиКупона, ВалютаСделки, ВыборкаДетальныеЗаписи.Период, ВалютаНоминала, ВыборкаДетальныеЗаписи.Период, Отказ);
						ПриходнаяПартияРЕПО.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СтоимостьПокупкиКупона, ВалютаСделки, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
						
						//Если был аванс, то по курсу оплаты
						Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
							
							СделкаРЕПО = РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Основание;
							
							//допустим, условия оплаты первой части соблюдены
							Если СделкаРЕПО.ДатаОплаты < СделкаРЕПО.ДатаПоставки Тогда
								ЗапросРЕПО = Новый Запрос;
								ЗапросРЕПО.Текст = 
									"ВЫБРАТЬ РАЗРЕШЕННЫЕ
									|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) КАК Дата,
									|	ОплатаОснования.Ссылка.ВалютаОплаты КАК ВалютаОплаты,
									|	СУММА(ОплатаОснования.СуммаОплаты) КАК СуммаОплаты,
									|	СУММА(ОплатаОснования.СуммаОплатыКупона) КАК СуммаОплатыКупона
									|ИЗ
									|	Документ.Оплата.Основания КАК ОплатаОснования
									|ГДЕ
									|	ОплатаОснования.Основание = &СделкаРЕПО
									|	И ОплатаОснования.Ссылка.ВидЗадолженности = &ВидЗадолженности
									|
									|СГРУППИРОВАТЬ ПО
									|	ОплатаОснования.Ссылка.ВалютаОплаты,
									|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ)";
								
								ЗапросРЕПО.УстановитьПараметр("ВидЗадолженности", Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО);
								ЗапросРЕПО.УстановитьПараметр("СделкаРЕПО", СделкаРЕПО);
								
								РезультатЗапросаРЕПО = ЗапросРЕПО.Выполнить();
								
								ВыборкаДетальныеЗаписиРЕПО = РезультатЗапросаРЕПО.Выбрать();
								
								//Считаем, что частичных оплат по 1-й части РЕПО НЕТ!
								//Если появятся - надо дорабатывать
								Если ВыборкаДетальныеЗаписиРЕПО.Следующий() Тогда
									Если ВыборкаДетальныеЗаписиРЕПО.Дата < ВыборкаДетальныеЗаписи.Период Тогда
										ПриходнаяПартияРЕПО.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписиРЕПО.СуммаОплаты, ВыборкаДетальныеЗаписиРЕПО.ВалютаОплаты, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписиРЕПО.Дата, Отказ);
										ПриходнаяПартияРЕПО.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписиРЕПО.СуммаОплатыКупона, ВыборкаДетальныеЗаписиРЕПО.ВалютаОплаты, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписиРЕПО.Дата, Отказ);
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;
						
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи);
						
						НовоеДвижение.Стоимость = ПриходнаяПартияРЕПО.Стоимость;
						НовоеДвижение.СтоимостьВВалютеУчета = ПриходнаяПартияРЕПО.СтоимостьВВалютеУчета;
						НовоеДвижение.СтоимостьКупона = ПриходнаяПартияРЕПО.СтоимостьКупона;
						НовоеДвижение.СтоимостьКупонаВВалютеУчета = ПриходнаяПартияРЕПО.СтоимостьКупонаВВалютеУчета;
						
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
					ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО") Тогда	
						
						КоличествоДолиОбщее = ПриходныеПартии.Итог("Количество");
						
						СтоимостьКРаспределению = ВыборкаДетальныеЗаписи.Стоимость;
						СтоимостьВВалютеУчетаКРаспределению = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
						КоличествоКРаспределению = ВыборкаДетальныеЗаписи.Количество;
						//распределяем по приходным партиям
						Для Каждого ПриходнаяПартия из ПриходныеПартии Цикл
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
							
							ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи);
							ЗаполнитьЗначенияСвойств(НовоеДвижение, ПриходнаяПартия, "Партия,СтрокаПартии");
							
							НовоеДвижение.Стоимость	 			= СтоимостьКРаспределению * ПриходнаяПартия.Количество / КоличествоДолиОбщее;
							НовоеДвижение.СтоимостьВВалютеУчета = СтоимостьВВалютеУчетаКРаспределению * ПриходнаяПартия.Количество / КоличествоДолиОбщее;
							НовоеДвижение.Количество 			= КоличествоКРаспределению * ПриходнаяПартия.Количество / КоличествоДолиОбщее;
							
							Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Регистратор, "Основание.ВзносВУставныйКапитал") Тогда
								НовоеДвижение.СтоимостьПокупки  =  НовоеДвижение.Стоимость;
							КонецЕсли;
							
							КоличествоДолиОбщее = КоличествоДолиОбщее - ПриходнаяПартия.Количество;
							
							ПриходнаяПартия.Количество 				= ПриходнаяПартия.Количество + НовоеДвижение.Количество;
							ПриходнаяПартия.Стоимость 				= ПриходнаяПартия.Стоимость + НовоеДвижение.Стоимость;
							ПриходнаяПартия.СтоимостьВВалютеУчета 	= ПриходнаяПартия.СтоимостьВВалютеУчета + НовоеДвижение.СтоимостьВВалютеУчета;
							
							Если НовоеДвижение.Стоимость < 0 Тогда
								НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								НовоеДвижение.Стоимость	 			= - НовоеДвижение.Стоимость;
								НовоеДвижение.СтоимостьВВалютеУчета = - НовоеДвижение.СтоимостьВВалютеУчета;
								НовоеДвижение.Количество 			= - НовоеДвижение.Количество;
							ИначеЕсли НовоеДвижение.Стоимость = 0 И НовоеДвижение.Количество < 0 Тогда
								НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								НовоеДвижение.Количество 			= - НовоеДвижение.Количество;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе
						
						// определим учетный актив если у клиента предусмотрена возможность учета бумаг по АС при виде учета БУ
						// я заложился на невозможность частичного распределения партии (купили 100 бумаг и 50 распределили на АС и 50 на СС) т.к. за время ведения ЕПС такого не было никогда
						// также добавлю (или уже добавил в Документ.РаспределениеАктивовЕПС) контроль этого 
						// и да! я добавляю заполнение реквизита УчетныйАктивЕПС для партий по БУ т.к. "Так решила стая!"
						Если НастройкиУчета.ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости
							И (ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Сделка")
								ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
							 	ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг")) Тогда
							
							ТекСделка = ВыборкаДетальныеЗаписи.Регистратор; 
							Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
							 ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
								ТекСделка = ВыборкаДетальныеЗаписи.Регистратор.Основание;
							КонецЕсли;
							
							РаспределениеПоТекущейСделкеИБумаге = РаспределенияПоСделкам.НайтиСтроки(Новый Структура("Сделка, ЦеннаяБумага", ТекСделка, ВыборкаДетальныеЗаписи.ЦеннаяБумага));
							Если РаспределениеПоТекущейСделкеИБумаге.Количество() = 0 Тогда
								УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка();
							Иначе								
								УчетныйАктивЕПС = РаспределениеПоТекущейСделкеИБумаге[0].УчетныйАктивЕПС;
								
								// нас не интересуют неАС активы - не заполняем УчетныйАктивЕПС по ним
								Если УчетныйАктивЕПС.Родитель <> Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД
									И УчетныйАктивЕПС.Родитель <> Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения Тогда
								
									УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка(); 	
								
								КонецЕсли;
							КонецЕсли;
							
						Иначе
							УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПустаяСсылка();
						КонецЕсли;
						
						Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ПоСреднему
							И ПриходныеПартии.Количество() > 1
							И НЕ ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда // не АС партия
							
							ПриходнаяПартия = ПриходныеПартии[1];
							
							Для каждого РеквизитПартий Из Метаданные.РегистрыНакопления.БухПартииЦенныхБумаг.Ресурсы Цикл
								Если РесурсыПартий.Найти(РеквизитПартий.Имя) <> Неопределено Тогда 
									Если РеквизитПартий.Имя = "СуммаРезервовПодОбесценение"
										ИЛИ РеквизитПартий.Имя = "СуммаРезервовПоСомнительнымДолгам"
										ИЛИ РеквизитПартий.Имя = "СтоимостьВВалютеУчета"
										ИЛИ РеквизитПартий.Имя = "СтоимостьКупонаВВалютеУчета" Тогда
										Продолжить;
									КонецЕсли;
									
									Если РеквизитПартий.Имя = "Стоимость" Тогда
										Если ВыборкаДетальныеЗаписи.Регистратор <> Неопределено Тогда
											ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость + ВыборкаДетальныеЗаписи.СтоимостьПокупки;
										Иначе
											ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость + ВыборкаДетальныеЗаписи.Стоимость;
										КонецЕсли;
										ПриходнаяПартия.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПриходнаяПартия.Стоимость,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
											
											РасходыПриПокупкеВСтоимости = РассчитатьРасходыПриПокупкеВСтоимости_БУНУ(ЦеннаяБумага, ВалютаНоминала, ВыборкаДетальныеЗаписи, КомиссииПоПокупкам, ПоставкиПоПокупкам);
											
											ПриходнаяПартия.РасходыПриПокупкеВСтоимости = РасходыПриПокупкеВСтоимости.РасходыПриПокупкеВСтоимости;
											ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета = РасходыПриПокупкеВСтоимости.РасходыПриПокупкеВСтоимостиВВалютеУчета;
											
											ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость + ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
											ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьВВалютеУчета + ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета;
											
										КонецЕсли;
									ИначеЕсли РеквизитПартий.Имя = "СтоимостьКупона" Тогда
										Если ВыборкаДетальныеЗаписи.Регистратор <> Неопределено Тогда
											ПриходнаяПартия.СтоимостьКупона = ПриходнаяПартия.СтоимостьКупона + ВыборкаДетальныеЗаписи.СтоимостьПокупкиКупона;
										Иначе
											ПриходнаяПартия.СтоимостьКупона = ПриходнаяПартия.СтоимостьКупона + ВыборкаДетальныеЗаписи.СтоимостьКупона;
										КонецЕсли;
										ПриходнаяПартия.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПриходнаяПартия.СтоимостьКупона,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
									Иначе
										ПриходнаяПартия[РеквизитПартий.Имя] = ПриходнаяПартия[РеквизитПартий.Имя] + ВыборкаДетальныеЗаписи[РеквизитПартий.Имя];
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							
						Иначе
							
							ПриходнаяПартия = ПриходныеПартии.Добавить();
							
							ЗаполнитьЗначенияСвойств(ПриходнаяПартия, ВыборкаДетальныеЗаписи);
							
							Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ПоСреднему Тогда
								
								ПриходнаяПартия.Партия = Неопределено;
								ПриходнаяПартия.СтрокаПартии = 0;
								
								Если ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда // бумага по АС, значит мы заполняем начиная со строки 2 (строки 0 и 1 это кучки 1.а и 1.б (см.комментарий выше по учету по-среднему))
									Если ПриходныеПартии.Количество() = 2 Тогда
										ПриходнаяПартия = ПриходныеПартии.Добавить(); // оставим пустое место под кучку 1.б
									ИначеЕсли ПриходныеПартии.Количество() = 1 Тогда
										ПриходнаяПартия = ПриходныеПартии.Добавить(); // оставим пустое место под кучку 1.а
										ПриходнаяПартия = ПриходныеПартии.Добавить(); // оставим пустое место под кучку 1.б
									КонецЕсли;
									ЗаполнитьЗначенияСвойств(ПриходнаяПартия, ВыборкаДетальныеЗаписи);
								КонецЕсли;
								
							КонецЕсли;
							
							ПриходнаяПартия.УчетныйАктивЕПС = УчетныйАктивЕПС;
							
							Если ВыборкаДетальныеЗаписи.Регистратор <> Неопределено Тогда //начальные остатки идут "как есть" - не берем их
								
								Если ТипЗнч(ПриходнаяПартия.Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
									
									Если НЕ УчитыватьПереоценкуОтдельноКупон Тогда
										
										ПриходнаяПартия.СтоимостьКупона = ПриходнаяПартия.СтоимостьКупона + ПриходнаяПартия.ПереоценкаКупона;
										ПриходнаяПартия.СтоимостьКупонаВВалютеУчета = ПриходнаяПартия.СтоимостьКупонаВВалютеУчета + ПриходнаяПартия.ПереоценкаКупонаВВалютеУчета;
										
										ПриходнаяПартия.ПереоценкаКупона = 0;
										ПриходнаяПартия.ПереоценкаКупонаВВалютеУчета = 0;
									
									КонецЕсли;
									
								Иначе
									ПриходнаяПартия.Стоимость = ПриходнаяПартия.СтоимостьПокупки;
									ПриходнаяПартия.СтоимостьКупона = ПриходнаяПартия.СтоимостьПокупкиКупона;
									
									Если ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") И ВалютаНоминала <> ВалютаУчета Тогда
										
										СтруктураСтоимостьВВалютеУчета = ПолучитьСуммуВВалютеУчетаДляПоставки(ВыборкаДетальныеЗаписи.Партия, ВыборкаДетальныеЗаписи.СтрокаПартии, Отказ);
										
										ПриходнаяПартия.СтоимостьВВалютеУчета = СтруктураСтоимостьВВалютеУчета.СуммаВВалютеУчета;
										ПриходнаяПартия.СтоимостьКупонаВВалютеУчета = СтруктураСтоимостьВВалютеУчета.СуммаКупонаВВалютеУчета;
										
									ИначеЕсли Не ВыборкаДетальныеЗаписи.ВалютаСделки = ВалютаУчета Тогда //Если купили за рубли, то стоимость в ВУ не трогаем

										// переделал т.к. теряется точность
										ПриходнаяПартия.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СтоимостьПокупки,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										ПриходнаяПартия.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПриходнаяПартия.СтоимостьКупона,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										
									КонецЕсли;
									
									Если ИндексироватьНоминал И ИндексируемыйНоминал Тогда
										//типа тока в рублях
										ПриходнаяПартия.ИндексацияНоминала = (Справочники.Облигации.ПолучитьНоминал(ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период) - ЦеннаяБумага.Номинал) * ПриходнаяПартия.Количество;
										// в НУ и БУ ИндексацияНоминала считается только за время владения!
										//ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость - ПриходнаяПартия.ИндексацияНоминала;
										//ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьВВалютеУчета - ПриходнаяПартия.ИндексацияНоминала;
									КонецЕсли;
									
									Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость ИЛИ ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда 
										
										РасходыПриПокупкеВСтоимости = РассчитатьРасходыПриПокупкеВСтоимости_БУНУ(ЦеннаяБумага, ВалютаНоминала, ВыборкаДетальныеЗаписи, КомиссииПоПокупкам, ПоставкиПоПокупкам);
										
										ПриходнаяПартия.РасходыПриПокупкеВСтоимости = РасходыПриПокупкеВСтоимости.РасходыПриПокупкеВСтоимости;
										ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета = РасходыПриПокупкеВСтоимости.РасходыПриПокупкеВСтоимостиВВалютеУчета;
										
										ПриходнаяПартия.Стоимость = ПриходнаяПартия.Стоимость + ПриходнаяПартия.РасходыПриПокупкеВСтоимости;
										ПриходнаяПартия.СтоимостьВВалютеУчета = ПриходнаяПартия.СтоимостьВВалютеУчета + ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета;
										
									Иначе
										
										ПриходнаяПартия.РасходыПриПокупкеВСтоимости = 0;
										ПриходнаяПартия.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
										
									КонецЕсли;
									
								КонецЕсли;
								
								Если ЭтоРынокОблигаций И ЦеннаяБумага.ИндексируемыйНоминал Тогда
									Если ТипЗнч(ПриходнаяПартия.Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
										//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При расчете партий по облигации "+ЦеннаяБумага+" с индексируемым номиналом не отработано получение даты покупки по документу " + ПриходнаяПартия.Партия + " с целью расчета индексации номинала");
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
							Если ТипЗнч(ПриходнаяПартия.Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг")
								И ПриходнаяПартия.Партия.Дата > МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ
								И ВыборкаДетальныеЗаписи.Регистратор <> Неопределено Тогда
								
								ДатаПокупкиПартии = БухгалтерскийУчетЕПС.ОпределитьДатуПокупкиПартии(ПриходнаяПартия.Партия, ПриходнаяПартия.СтрокаПартии, Истина, МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ);
								
								Если ДатаПокупкиПартии = Неопределено Тогда
									
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не заполнена дата покупки ЦБ %1 по партии %2, строка %3",
										ЦеннаяБумага,
										ПриходнаяПартия.Партия,
										ПриходнаяПартия.СтрокаПартии),,,,Отказ);
									
									Возврат;
								
								КонецЕсли;
								
								ПриходнаяПартия.Период = КонецДня(ДатаПокупкиПартии);
								
								ПриходныеПартии.Сортировать("ДатаПокупки, Период, СтрокаПартии");

							КонецЕсли;
							
						КонецЕсли;
						
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, ВыборкаДетальныеЗаписи);
						НовоеДвижение.УчетныйАктивЕПС = УчетныйАктивЕПС;
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ЗачислениеПартии;
						
						Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ПоСреднему
							И НЕ ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда
							
							НовоеДвижение.Партия = Неопределено;
							НовоеДвижение.СтрокаПартии = 0;
							
						КонецЕсли;
						
						Если ВыборкаДетальныеЗаписи.Регистратор <> Неопределено Тогда //начальные остатки идут "как есть" - не берем их
							
							Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
								
								Если НЕ УчитыватьПереоценкуОтдельноКупон Тогда
									
									НовоеДвижение.СтоимостьКупона = НовоеДвижение.СтоимостьКупона + НовоеДвижение.ПереоценкаКупона;
									НовоеДвижение.СтоимостьКупонаВВалютеУчета = НовоеДвижение.СтоимостьКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
									
									НовоеДвижение.ПереоценкаКупона = 0;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета = 0;
								
								КонецЕсли;
								
							Иначе
								
								НовоеДвижение.Стоимость = НовоеДвижение.СтоимостьПокупки;
								НовоеДвижение.СтоимостьКупона = НовоеДвижение.СтоимостьПокупкиКупона;
								// переделал т.к. теряется точность
								Если ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.Сделка")
									ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
									ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда 
									
									Если ВыборкаДетальныеЗаписи.ВалютаСделки = ВалютаУчета  Тогда // купили за рубли - никаких перекурсовок
									
										НовоеДвижение.СтоимостьВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
										НовоеДвижение.СтоимостьКупонаВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета;
										
									ИначеЕсли ВалютаНоминала <> ВалютаУчета // купили валютную бумагу за другую валюту - бабац!
										И ВыборкаДетальныеЗаписи.ВалютаСделки <> ВалютаУчета
										И ВыборкаДетальныеЗаписи.ВалютаСделки <> ВалютаНоминала Тогда
										
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По документу " + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " идет покупка валютных бумаг за валюту, данная ситуация пока не реализована", ВыборкаДетальныеЗаписи.Регистратор);
										Отказ = Истина;
										Возврат;
										
									Иначе
										
										НовоеДвижение.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СтоимостьПокупки,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										НовоеДвижение.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.СтоимостьКупона,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										
									КонецЕсли;
									
								Иначе
									
									НовоеДвижение.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СтоимостьПокупки,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
									НовоеДвижение.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.СтоимостьКупона,ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
									
								КонецЕсли;
								
								Если ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") И ВалютаНоминала <> ВалютаУчета Тогда
									
									СтруктураСтоимостьВВалютеУчета = ПолучитьСуммуВВалютеУчетаДляПоставки(ВыборкаДетальныеЗаписи.Партия, ВыборкаДетальныеЗаписи.СтрокаПартии, Отказ);
										
									НовоеДвижение.СтоимостьВВалютеУчета = СтруктураСтоимостьВВалютеУчета.СуммаВВалютеУчета;
									НовоеДвижение.СтоимостьКупонаВВалютеУчета = СтруктураСтоимостьВВалютеУчета.СуммаКупонаВВалютеУчета;
																	
								КонецЕсли;
								Если ИндексироватьНоминал И ИндексируемыйНоминал Тогда
									//типа тока в рублях
									НовоеДвижение.ИндексацияНоминала = (Справочники.Облигации.ПолучитьНоминал(ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период) - ЦеннаяБумага.Номинал) * НовоеДвижение.Количество;
									// в НУ и БУ ИндексацияНоминала считается только за время владения!
									//НовоеДвижение.Стоимость = НовоеДвижение.Стоимость - НовоеДвижение.ИндексацияНоминала;
									НовоеДвижение.Стоимость = НовоеДвижение.Стоимость;
									//НовоеДвижение.СтоимостьВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета - НовоеДвижение.ИндексацияНоминала;
									НовоеДвижение.СтоимостьВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета;
								КонецЕсли;
								
								Если (НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость ИЛИ ЗначениеЗаполнено(УчетныйАктивЕПС)) И ВыборкаДетальныеЗаписи.Регистратор <> Неопределено Тогда
									
									РасходыПриПокупкеВСтоимости = РассчитатьРасходыПриПокупкеВСтоимости_БУНУ(ЦеннаяБумага, ВалютаНоминала, ВыборкаДетальныеЗаписи, КомиссииПоПокупкам, ПоставкиПоПокупкам);
									
									НовоеДвижение.РасходыПриПокупкеВСтоимости = РасходыПриПокупкеВСтоимости.РасходыПриПокупкеВСтоимости;
									НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = РасходыПриПокупкеВСтоимости.РасходыПриПокупкеВСтоимостиВВалютеУчета;
									
									НовоеДвижение.СтоимостьВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета;
									НовоеДвижение.Стоимость = НовоеДвижение.Стоимость + НовоеДвижение.РасходыПриПокупкеВСтоимости;
									
								Иначе
									
									НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
									НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
									
								КонецЕсли;
																
							КонецЕсли;
						КонецЕсли;
						
						Если ВыборкаДетальныеЗаписи.Регистратор <> Неопределено
							И НастройкиПоВидуУчета.ПереоцениватьПриобретенныеАктивы 
							И (ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.Сделка")
								ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
								ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг")) Тогда
								
							ПереоценкаДляПокупки = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения", 
														ВыборкаДетальныеЗаписи.Партия, 
														ЦеннаяБумага, 
														Перечисления.ВидыДвижений.Приход));
							
							Если ПереоценкаДляПокупки.Количество() <> 1 Тогда
								ТекстСообщения = СтрШаблон("Не удалось определить цену бумаги %1 для покупки %2", ЦеннаяБумага, ВыборкаДетальныеЗаписи.Партия); 
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
								Возврат;
							КонецЕсли;
							
							СуммаРынок = ПереоценкаДляПокупки[0].СуммаРынок;
							СуммаРынокВВалютеУчета = ПереоценкаДляПокупки[0].СуммаРынокВВалютеУчета;
							
							НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
							
							ЗаполнитьЗначенияСвойств(НовоеДвижениеПереоценки, ВыборкаДетальныеЗаписи, "Регистратор,Период,Рынок,ЦеннаяБумага,Партия,СтрокаПартии");
							НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
							НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
							
							Если УчитыватьПереоценкуОтдельно Тогда
								
								НовоеДвижениеПереоценки.Переоценка				= СуммаРынок - (ПриходнаяПартия.Стоимость + ПриходнаяПартия.Переоценка); 
								НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета	= СуммаРынокВВалютеУчета - (ПриходнаяПартия.СтоимостьВВалютеУчета + ПриходнаяПартия.ПереоценкаВВалютеУчета); 
								
								ПриходнаяПартия.Переоценка						= ПриходнаяПартия.Переоценка + НовоеДвижениеПереоценки.Переоценка;
								ПриходнаяПартия.ПереоценкаВВалютеУчета			= ПриходнаяПартия.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
								
							Иначе
								
								НовоеДвижениеПереоценки.Стоимость				= СуммаРынок - ПриходнаяПартия.Стоимость; 
								НовоеДвижениеПереоценки.СтоимостьВВалютеУчета	= СуммаРынокВВалютеУчета - ПриходнаяПартия.СтоимостьВВалютеУчета; 
								НовоеДвижениеПереоценки.ПереоценкаВСтоимости	= НовоеДвижениеПереоценки.Стоимость;
								
								ПриходнаяПартия.Стоимость						= ПриходнаяПартия.Стоимость + НовоеДвижениеПереоценки.Стоимость;
								ПриходнаяПартия.СтоимостьВВалютеУчета			= ПриходнаяПартия.СтоимостьВВалютеУчета + НовоеДвижениеПереоценки.СтоимостьВВалютеУчета;
								ПриходнаяПартия.ПереоценкаВСтоимости			= ПриходнаяПартия.ПереоценкаВСтоимости + НовоеДвижениеПереоценки.ПереоценкаВСтоимости;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					#КонецОбласти
	
				ИначеЕсли (ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги")
					И (РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидПогашения <> Перечисления.ВидыПогашения.ЧастичноеПогашение))
					И ЭтоРынокОблигаций Тогда 
					
					#Область ПогашениеОблигацииНеЧастичное
					
					Если НастройкиПоВидуУчета.МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Кассовый Тогда // при кассовом методе погашение ничего не делает
						Продолжить;
					КонецЕсли;
					
					ЭтоОферта = РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидПогашения = Перечисления.ВидыПогашения.Оферта;
					КоличествоОферты = РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Количество;
					
					
					СуммаКупонаНаОднуОблигацию = РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].СуммаКупона / РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Количество;
					
					Если ВалютаНоминала = ВалютаУчета Тогда
						СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
					ИначеЕсли РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВалютаОплаты = ВалютаУчета Тогда
						// погашение купона по валютной бумаге причем сумма в рублях... маразм, блин!
						СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
						
						СуммаКупонаНаОднуОблигацию = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, НачалоДня(ВыборкаДетальныеЗаписи.Период), СчетДоверительногоУправленияДляУчета, Истина);
						
						КурсПерекурсовки = СуммаКупонаНаОднуОблигациюВВалютеУчета / СуммаКупонаНаОднуОблигацию;
					Иначе
						
						СуммаКупонаНаОднуОблигациюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].СуммаКупона, ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ) / РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Количество;
						
					КонецЕсли;
					
					
					Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей Тогда
					
						ПереоценкаПередПродажами = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения",
															ВыборкаДетальныеЗаписи.Регистратор,
															ВыборкаДетальныеЗаписи.ЦеннаяБумага,
															Перечисления.ВидыДвижений.ПустаяСсылка()));
															
						Если ПереоценкаПередПродажами.Количество() <> 1 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить цену бумаги перед продажей:" + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага));
							Отказ = Истина;
						КонецЕсли;
						
						СуммаРынокВсего = ПереоценкаПередПродажами[0].СуммаРынок;
						СуммаРынокВВалютеУчетаВсего = ПереоценкаПередПродажами[0].СуммаРынокВВалютеУчета;
						ОбщееКоличество = ПереоценкаПередПродажами[0].Количество;
					
					КонецЕсли;
					
					
					Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл //Спишем со всех приходных партий все купоны
						
						Если ЭтоОферта И КоличествоОферты = 0 Тогда
							Прервать;
						КонецЕсли;
						
						НовоеДвижениеПерекурсовки = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
						НовоеДвижениеПерекурсовки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
						Если ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением Тогда
							
							_ОтражатьНаПереоценкеПолнуюСуммуКупон = ОтражатьНаПереоценкеПолнуюСуммуКупон;
							// хардкод для СНГ - согласно письму фонда, СНГ прекращает с 1го января 2020года учитывать УНКД отдельно и начинает учитывать "как все"
							Если ЭтоКлиентСНГ Тогда
							
								Если СтрокаПриходныхПартий.ДатаПокупки < '20200101' Тогда
									_ОтражатьНаПереоценкеПолнуюСуммуКупон = Истина;
								Иначе
									_ОтражатьНаПереоценкеПолнуюСуммуКупон = Ложь;
								КонецЕсли;
							
							КонецЕсли;
							// хардкод для СНГ
							
							НовоеДвижениеНачисленияНКД = ДоначислитьКупон(ВыборкаДетальныеЗаписи.Регистратор, 
																	ВыборкаДетальныеЗаписи.Период, 
																	СтрокаПриходныхПартий,
																	СуммаКупонаНаОднуОблигацию,
																	СтрокаПриходныхПартий.Количество,
																	0,
																	ВыборкаДетальныеЗаписи.СтрокаПартии,
																	_ОтражатьНаПереоценкеПолнуюСуммуКупон,
																	Отказ);
																		
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
																	
							СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона + НовоеДвижениеНачисленияНКД.ПереоценкаКупона;
							СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеНачисленияНКД.ПереоценкаКупонаВВалютеУчета;
						
						КонецЕсли;
						
						Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей
							И НЕ ПереоценкаПередПродажами[0].ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.Дефолт Тогда
							
							НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
							
							НовоеДвижениеПереоценки.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижениеПереоценки.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
							НовоеДвижениеПереоценки.Рынок = ВыборкаДетальныеЗаписи.Рынок;
							НовоеДвижениеПереоценки.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
							НовоеДвижениеПереоценки.Партия = СтрокаПриходныхПартий.Партия;
							НовоеДвижениеПереоценки.СтрокаПартии = СтрокаПриходныхПартий.СтрокаПартии;
							НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
							
							ЦенаКотировки = ПереоценкаПередПродажами[0].ЦенаКотировки;
							СуммаРынок = Окр(ПереоценкаПередПродажами[0].СуммаРынок / ПереоценкаПередПродажами[0].Количество * СтрокаПриходныхПартий.Количество, 2);
							СуммаРынокВВалютеУчета = Окр(ПереоценкаПередПродажами[0].СуммаРынокВВалютеУчета / ПереоценкаПередПродажами[0].Количество * СтрокаПриходныхПартий.Количество, 2);
							
							СуммаРынокВсего = СуммаРынокВсего - СуммаРынок;
							СуммаРынокВВалютеУчетаВсего = СуммаРынокВВалютеУчетаВсего - СуммаРынокВВалютеУчета;
							
							ОбщееКоличество = ОбщееКоличество - СтрокаПриходныхПартий.Количество;
							Если ОбщееКоличество = 0 Тогда
							
								СуммаРынок = СуммаРынок + СуммаРынокВсего;
								СуммаРынокВВалютеУчета = СуммаРынокВВалютеУчета + СуммаРынокВВалютеУчетаВсего;
								
								СуммаРынокВсего = 0;
								СуммаРынокВВалютеУчетаВсего = 0;
							
							КонецЕсли;
							
							Если УчитыватьПереоценкуОтдельно Тогда
								НовоеДвижениеПереоценки.Переоценка = СуммаРынок	- (СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка); 
								НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СуммаРынокВВалютеУчета	- (СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета); 
								
								СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка + НовоеДвижениеПереоценки.Переоценка;
								СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
							Иначе
								НовоеДвижениеПереоценки.Стоимость = СуммаРынок - СтрокаПриходныхПартий.Стоимость; 
								НовоеДвижениеПереоценки.СтоимостьВВалютеУчета = СуммаРынокВВалютеУчета - СтрокаПриходныхПартий.СтоимостьВВалютеУчета; 
								НовоеДвижениеПереоценки.ПереоценкаВСтоимости = НовоеДвижениеПереоценки.Стоимость;
								
								СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость + НовоеДвижениеПереоценки.Стоимость;
								СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета + НовоеДвижениеПереоценки.СтоимостьВВалютеУчета;
								СтрокаПриходныхПартий.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости + НовоеДвижениеПереоценки.ПереоценкаВСтоимости;
							КонецЕсли;
							
						КонецЕсли;
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
						
						Если ЭтоОферта Тогда
							СпишемПоОферте = Мин(КоличествоОферты, НовоеДвижение.Количество);
							
							Если СпишемПоОферте < НовоеДвижение.Количество Тогда
								
								Для Каждого Ресурс из РесурсыПартий Цикл
									НовоеДвижение[Ресурс] = НовоеДвижение[Ресурс] * СпишемПоОферте / СтрокаПриходныхПартий.Количество;
								КонецЦикла;
								
							КонецЕсли;
							
							КоличествоОферты = КоличествоОферты - СпишемПоОферте;
						КонецЕсли;
						
						Если ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментСписания Тогда
							
							НовоеДвижение.Количество = 0;
							НовоеДвижение.СтоимостьПокупки = 0;
							НовоеДвижение.ПереоценкаВСтоимости = 0;
							НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
							НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
							НовоеДвижение.Стоимость = 0;
							НовоеДвижение.СтоимостьВВалютеУчета = 0;
							НовоеДвижение.Переоценка = 0;
							НовоеДвижение.ПереоценкаВВалютеУчета = 0;
							НовоеДвижение.СуммаЧастичногоПогашения = 0;
							НовоеДвижение.ИндексацияНоминала = 0;
							НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = 0;
							НовоеДвижение.ИндексацияНоминалаСНачалаГода = 0;							
							
							НовоеДвижение.СтоимостьПокупкиКупона = 0;
							Если ОтражатьНаПереоценкеПолнуюСуммуКупон Тогда
								НовоеДвижение.СтоимостьКупона = 0;
								НовоеДвижение.СтоимостьКупонаВВалютеУчета = 0;
							КонецЕсли;
							
						ИначеЕсли ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения Тогда	
							
							НовоеДвижение.Количество = 0; // количество не списываем - его спишет списание
							
						КонецЕсли;
						
						Если НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий > 2 Тогда
							//надо добавить суммы в валюте учета? пока пропустили
							Если (СтрокаПриходныхПартий.СтоимостьКупона - Окр(СтрокаПриходныхПартий.СтоимостьКупона, 2) <> 0) 
								 ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости, 2) <> 0)
								 ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупона - Окр(СтрокаПриходныхПартий.ПереоценкаКупона, 2) <> 0) Тогда
							
								ПогрешностьОкругления = ПогрешностиОкругления.Добавить();
								
								ЗаполнитьЗначенияСвойств(ПогрешностьОкругления, СтрокаПриходныхПартий);
								ПогрешностьОкругления.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								ПогрешностьОкругления.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								ПогрешностьОкругления.Период = ВыборкаДетальныеЗаписи.Период;
								ПогрешностьОкругления.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								Если ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментСписания Тогда
								
									ПогрешностьОкругления.Количество = 0;
									ПогрешностьОкругления.СтоимостьПокупки = 0;
									ПогрешностьОкругления.ПереоценкаВСтоимости = 0;
									ПогрешностьОкругления.РасходыПриПокупкеВСтоимости = 0;
									ПогрешностьОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
									ПогрешностьОкругления.Стоимость = 0;
									ПогрешностьОкругления.Переоценка = 0;
									ПогрешностьОкругления.СуммаЧастичногоПогашения = 0;
									ПогрешностьОкругления.ИндексацияНоминала = 0;
									ПогрешностьОкругления.ИндексацияНоминалаЗаВремяВладения = 0;
									ПогрешностьОкругления.ИндексацияНоминалаСНачалаГода = 0;									
								
								КонецЕсли;
								
								ПогрешностьОкругления.СтоимостьПокупкиКупона = 0;
								
								Если ОтражатьНаПереоценкеПолнуюСуммуКупон Тогда
									ПогрешностьОкругления.СтоимостьКупона = 0;
								Иначе
									НовоеДвижение.СтоимостьКупона = Окр(СтрокаПриходныхПартий.СтоимостьКупона, 2);
									ПогрешностьОкругления.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона - НовоеДвижение.СтоимостьКупона;
								КонецЕсли;
							
								НовоеДвижение.ПереоценкаКупонаВСтоимости = Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости, 2);
								ПогрешностьОкругления.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - НовоеДвижение.ПереоценкаКупонаВСтоимости;
							
								НовоеДвижение.ПереоценкаКупона = Окр(СтрокаПриходныхПартий.ПереоценкаКупона, 2);
								ПогрешностьОкругления.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона - НовоеДвижение.ПереоценкаКупона;
							
							КонецЕсли;
						
						КонецЕсли;
						
						Для Каждого Ресурс из РесурсыПартий Цикл
							СтрокаПриходныхПартий[Ресурс] = СтрокаПриходныхПартий[Ресурс] - НовоеДвижение[Ресурс];
						КонецЦикла;

					КонецЦикла;
					
					#КонецОбласти

				ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеКупона") Тогда
					
					#Область ПогашениеКупона
					
					// #361945 - по Облигация_ДП_О1ГрФин1P3, Облигация_АрчерФинанс, Облигация_ОткрытиеХолдинг клиенты Будущее(с 11/2/21) и Телеком(с 10/2/21) отключили расчет НКД
					НеНачислятьИНеПогашатьНКД = Ложь;
					Если ЭтоКлиентТелеком И НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20210210'
						ИЛИ ЭтоКлиентБудущее И НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20210211' Тогда
						
						Если ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс")
							ИЛИ ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_Груп_Финанс") 
							ИЛИ ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДП_О1ГрФин1P3") 
							ИЛИ ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг") Тогда
							
							Продолжить;;
							
						КонецЕсли;
					КонецЕсли;
					
					// #584222 - по Облигация_О1Пропертиз_Дол (О1 Пропертиз Финанс АО, 4B02-01-71827-H-001P, 1000.00 USD) клиенты Будущее и Эволюция(с 01/01/25)
					Если ((ЭтоКлиентБудущее ИЛИ ЭтоКлиентЭволюция) И НачалоДня(ВыборкаДетальныеЗаписи.Период) >= '20250101')
						И (ВыборкаДетальныеЗаписи.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_Дол")) Тогда
							
						Продолжить;
							
					КонецЕсли;
					
					КурсПерекурсовки = Неопределено;
					
					СуммаКупонаНаОднуОблигацию = РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].СуммаНаОднуОблигацию;
					Если ВалютаНоминала = ВалютаУчета Тогда
						СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
					ИначеЕсли РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВалютаОплаты = ВалютаУчета Тогда
						// погашение купона по валютной бумаге причем сумма в рублях... маразм, блин!
						СуммаКупонаНаОднуОблигациюВВалютеУчета = СуммаКупонаНаОднуОблигацию;
						СуммаКупонаНаОднуОблигацию = ОпределитьСтоимостьКупонаВМоментАмортизации(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период);
						КурсПерекурсовки = СуммаКупонаНаОднуОблигациюВВалютеУчета / СуммаКупонаНаОднуОблигацию;
					Иначе
						СуммаКупонаНаОднуОблигациюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупонаНаОднуОблигацию, РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВалютаОплаты, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
						//можно из регистра купонов брать, отбор по дате фиксации
						СуммаКупонаНаОднуОблигацию = Окр(РаботаСВалютами.ПересчетСуммыВВалюте(
																СуммаКупонаНаОднуОблигацию,
																РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВалютаОплаты,
																РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ДатаФиксации,
																ВалютаНоминала,
																РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ДатаФиксации,
																Отказ),
															2);
															
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
					КонецЕсли;
					
					Если КурсПерекурсовки <> Неопределено Тогда
						КурсНачисленияКупона = КурсПерекурсовки;
					Иначе
						КурсНачисленияКупона = 0;
					КонецЕсли;
					
					Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл //Спишем со всех приходных партий все купоны
						
						Если ЭтоНалоговыйУчет Тогда 
							ПараметрыПроверки67ФЗ = Новый Структура("СчетУчетаПереоценки, ВидУчета", НастройкиУчетаАктиваКупон.СчетУчетаПереоценки, ЭтотОбъект.ВидУчета);
						Иначе	
							ПараметрыПроверки67ФЗ = Неопределено;
						КонецЕсли;	
													
						НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,, Новый Структура("ПараметрыПроверки67ФЗ", ПараметрыПроверки67ФЗ), Отказ);
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
						Если ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением И НЕ ЭтоДефолтнаяОблигация Тогда
							
							// хардкод для СНГ - согласно письму фонда, СНГ прекращает с 1го января 2020года учитывать УНКД отдельно и начинает учитывать "как все"
							// при это по бумагам купленным, до 1го января 2020года доначисление НКД должно идти "по-старому" т.е. без учета УНКД,
							// а списание уже должно идти "по-новому"
							// в связи с этим в функцию ДоначислитьКупон был добавлен параметр ОтражатьНаПереоценкеПолнуюСуммуКупон
							// но вообще говоря этот параметр нужно было добавить даже без СНГ т.к. у нас не учитывалась ранее комбинация настроек:
							// ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением и ОтражатьНаПереоценкеПолнуюСуммуКупон
							_ОтражатьНаПереоценкеПолнуюСуммуКупон = ОтражатьНаПереоценкеПолнуюСуммуКупон;
							Если ЭтоКлиентСНГ Тогда
							
								Если СтрокаПриходныхПартий.ДатаПокупки < '20200101' Тогда
									_ОтражатьНаПереоценкеПолнуюСуммуКупон = Истина;
								Иначе
									_ОтражатьНаПереоценкеПолнуюСуммуКупон = Ложь;
								КонецЕсли;
							
							КонецЕсли;
							// хардкод для СНГ
							
							НовоеДвижение = ДоначислитьКупон(ВыборкаДетальныеЗаписи.Регистратор, 
																	ВыборкаДетальныеЗаписи.Период, 
																	СтрокаПриходныхПартий,
																	СуммаКупонаНаОднуОблигацию,
																	СтрокаПриходныхПартий.Количество,
																	КурсНачисленияКупона,
																	ВыборкаДетальныеЗаписи.СтрокаПартии,
																	_ОтражатьНаПереоценкеПолнуюСуммуКупон,
																	Отказ);
																		
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
																	
							СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона + НовоеДвижение.ПереоценкаКупона;
							СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета + НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
							
						
						КонецЕсли;
						
						// согласно последним указаниям Тани индексация в данном случае
						// сохранил код т.к. скорее всего будет создание настройки для этого
						//Если ЭтоНалоговыйУчет Тогда
						//	Если ИндексируемыйНоминал И ИндексироватьНоминал Тогда
						//		НовоеДвижение = ИндексацияНоминала(ВыборкаДетальныеЗаписи.Регистратор, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, Отказ);
						//		СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала + НовоеДвижение.ИндексацияНоминала;
						//	КонецЕсли;
						//КонецЕсли;
						
						// Хардкод в этот день по этим бумагам купон не списываем
						Если (СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БизнесКонсалтиг")
							ИЛИ СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БКЗ_ФИНАНС")
							ИЛИ СтрокаПриходныхПартий.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ТМ-энергоФинанс"))
							И НачалоДня(ВыборкаДетальныеЗаписи.Период) = '20190925' Тогда
						
							Продолжить;
						
						КонецЕсли;
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеКупона;
						
						НовоеДвижение.Количество = 0;
						НовоеДвижение.СтоимостьПокупки = 0;
						НовоеДвижение.ПереоценкаВСтоимости = 0;
						НовоеДвижение.СтоимостьПокупкиКупона = 0;
						Если ОтражатьНаПереоценкеПолнуюСуммуКупон Тогда
							НовоеДвижение.СтоимостьКупона = 0;
							НовоеДвижение.СтоимостьКупонаВВалютеУчета = 0;
						КонецЕсли;
						НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
						НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
						НовоеДвижение.Стоимость = 0;
						НовоеДвижение.СтоимостьВВалютеУчета = 0;
						НовоеДвижение.Переоценка = 0;
						НовоеДвижение.ПереоценкаВВалютеУчета = 0;
						НовоеДвижение.СуммаЧастичногоПогашения = 0;
						НовоеДвижение.ИндексацияНоминала = 0;
						НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = 0;
						
						Если НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий > 2 Тогда
							//пока для валюты учета пропускаем
							Если (СтрокаПриходныхПартий.СтоимостьКупона - Окр(СтрокаПриходныхПартий.СтоимостьКупона, 2) <> 0) 
								 ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости, 2) <> 0)
								 ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупона - Окр(СтрокаПриходныхПартий.ПереоценкаКупона, 2) <> 0) Тогда
							
								ПогрешностьОкругления = ПогрешностиОкругления.Добавить();
								
								ЗаполнитьЗначенияСвойств(ПогрешностьОкругления, СтрокаПриходныхПартий);
								ПогрешностьОкругления.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								ПогрешностьОкругления.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								ПогрешностьОкругления.Период = ВыборкаДетальныеЗаписи.Период;
								ПогрешностьОкругления.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								ПогрешностьОкругления.Количество = 0;
								ПогрешностьОкругления.СтоимостьПокупки = 0;
								ПогрешностьОкругления.ПереоценкаВСтоимости = 0;
								ПогрешностьОкругления.РасходыПриПокупкеВСтоимости = 0;
								ПогрешностьОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
								ПогрешностьОкругления.Стоимость = 0;
								ПогрешностьОкругления.Переоценка = 0;
								ПогрешностьОкругления.СуммаЧастичногоПогашения = 0;
								ПогрешностьОкругления.СтоимостьПокупкиКупона = 0;
								
								Если ОтражатьНаПереоценкеПолнуюСуммуКупон Тогда
									ПогрешностьОкругления.СтоимостьКупона = 0;
								Иначе
									НовоеДвижение.СтоимостьКупона = Окр(СтрокаПриходныхПартий.СтоимостьКупона, 2);
									ПогрешностьОкругления.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона - НовоеДвижение.СтоимостьКупона;
								КонецЕсли;
							
								НовоеДвижение.ПереоценкаКупонаВСтоимости = Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости, 2);
								ПогрешностьОкругления.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - НовоеДвижение.ПереоценкаКупонаВСтоимости;
							
								НовоеДвижение.ПереоценкаКупона = Окр(СтрокаПриходныхПартий.ПереоценкаКупона, 2);
								ПогрешностьОкругления.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона - НовоеДвижение.ПереоценкаКупона;
							
							КонецЕсли;
						
						КонецЕсли;
						
						СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости = 0;
						СтрокаПриходныхПартий.ПереоценкаКупона = 0;
						СтрокаПриходныхПартий.ПереоценкаКупонавВалютеУчета = 0;
						Если НЕ ОтражатьНаПереоценкеПолнуюСуммуКупон Тогда
							СтрокаПриходныхПартий.СтоимостьКупона = 0;
							СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета = 0;
						КонецЕсли;
					КонецЦикла;
					
					СтрокиПартийПроданныхВРЕПО = ПартииПроданныеВРЕПО.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаДетальныеЗаписи.ЦеннаяБумага));
					Для Каждого СтрокаПартииПроданнойВРЕПО ИЗ СтрокиПартийПроданныхВРЕПО Цикл
						
						НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО, ВыборкаДетальныеЗаписи.Период, СтрокаПартииПроданнойВРЕПО, СтрокаПартииПроданнойВРЕПО.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПартииПроданнойВРЕПО);
						
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						НовоеДвижение.Количество = 0;
						НовоеДвижение.СтоимостьПокупки = 0;
						НовоеДвижение.ПереоценкаВСтоимости = 0;
						НовоеДвижение.СтоимостьПокупкиКупона = 0;
						Если ОтражатьНаПереоценкеПолнуюСуммуКупон Тогда
							НовоеДвижение.СтоимостьКупона = 0;
							НовоеДвижение.СтоимостьКупонаВВалютеУчета = 0;
						КонецЕсли;
						НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
						НовоеДвижение.Стоимость = 0;
						НовоеДвижение.СтоимостьВВалютеУчета = 0;
						НовоеДвижение.Переоценка = 0;
						НовоеДвижение.ПереоценкаВВалютеУчета = 0;
						НовоеДвижение.СуммаЧастичногоПогашения = 0;
						НовоеДвижение.ИндексацияНоминала = 0;
						НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = 0;
						
						СтрокаПартииПроданнойВРЕПО.ПереоценкаКупонаВСтоимости = 0;
						СтрокаПартииПроданнойВРЕПО.ПереоценкаКупона = 0;
						СтрокаПартииПроданнойВРЕПО.ПереоценкаКупонавВалютеУчета = 0;
						Если НЕ ОтражатьНаПереоценкеПолнуюСуммуКупон Тогда
							СтрокаПартииПроданнойВРЕПО.СтоимостьКупона = 0;
							СтрокаПартииПроданнойВРЕПО.СтоимостьКупонаВВалютеУчета = 0;
						КонецЕсли;
					КонецЦикла;
					
					#КонецОбласти

				ИначеЕсли (ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги")
						  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги"))
						  И ЭтоРынокОблигаций Тогда
						  
					#Область ПогашениеИлиСписаниеОблигации
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги")
						 И РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидПогашения <> Перечисления.ВидыПогашения.ЧастичноеПогашение
						 И ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментСписания Тогда
						Продолжить;
					КонецЕсли;
						  
					КоличествоКСписанию = ПриходныеПартии.Итог("Количество"); // по умолчанию списываем все количество, что есть
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") 
						И РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидПогашения = Перечисления.ВидыПогашения.Оферта Тогда
						КоличествоКСписанию = РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Количество; // но возможно, что погашаем не все бумаги
					ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги") Тогда 
						КоличествоКСписанию = ВыборкаДетальныеЗаписи.Количество; // списание также возможно на часть бумаг
					КонецЕсли;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") И НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей Тогда
					
						ПереоценкаПередПродажами = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения",
															ВыборкаДетальныеЗаписи.Регистратор,
															ВыборкаДетальныеЗаписи.ЦеннаяБумага,
															Перечисления.ВидыДвижений.ПустаяСсылка()));
															
						Если ПереоценкаПередПродажами.Количество() <> 1 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить цену бумаги перед продажей:" + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага));
							Отказ = Истина;
						КонецЕсли;
						
						СуммаРынокВсего = ПереоценкаПередПродажами[0].СуммаРынок;
						СуммаРынокВВалютеУчетаВсего = ПереоценкаПередПродажами[0].СуммаРынокВВалютеУчета;
						ОбщееКоличество = ПереоценкаПередПродажами[0].Количество;
					
					КонецЕсли;
					
					
					ПриходныеПартииКУдалению = Новый Массив;
					
					Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл //Спишем либо все приходные партии либо пропорционально части номинала
						
						Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги")
							 ИЛИ РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидПогашения = Перечисления.ВидыПогашения.ПолноеПогашение Тогда
							 
							Если КоличествоКСписанию = 0 Тогда // все списали
								Прервать;
							КонецЕсли;
							
							// Списание и полное погашение гасят все партии
							
							Если ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения
						 		И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги") Тогда
								//движений по деньгам не делаем, двигаем только количество
								
							Иначе

								НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								
								Если ИндексируемыйНоминал И ИндексироватьНоминал Тогда
									НовоеДвижение = ИндексацияНоминала(ВыборкаДетальныеЗаписи.Регистратор,
																		ВыборкаДетальныеЗаписи.Период,
																		СтрокаПриходныхПартий,
																		СтрокаПриходныхПартий.Количество,
																		УчитыватьИндексациюОтдельно,
																		Отказ);
									СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала + НовоеДвижение.ИндексацияНоминала;
									СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения + НовоеДвижение.ИндексацияНоминалаЗаВремяВладения;									
								КонецЕсли;	
								
							КонецЕсли;
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
							
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
							
							Если НастройкиПоВидуУчета.МетодОпределенияДоходовИРасходов <> Перечисления.МетодыОпределенияДоходовИРасходов.Кассовый
								И ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения
						 		И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги") Тогда
								
								//списываем только количество, суммы списало погашение
								Для Каждого Ресурс из РесурсыПартий Цикл
									Если Ресурс = "Количество" Тогда 
										Продолжить; 
									КонецЕсли;
									НовоеДвижение[Ресурс] = 0;
								КонецЦикла;
							
							КонецЕсли;
							
							Спишем = Мин(КоличествоКСписанию, НовоеДвижение.Количество);
							
							Если Спишем < НовоеДвижение.Количество Тогда
								Для Каждого Ресурс из РесурсыПартий Цикл
									НовоеДвижение[Ресурс] = НовоеДвижение[Ресурс] * Спишем / НовоеДвижение.Количество;
									СтрокаПриходныхПартий[Ресурс] = СтрокаПриходныхПартий[Ресурс] - НовоеДвижение[Ресурс];
								КонецЦикла;
							Иначе
								ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий);
							КонецЕсли;
							
							КоличествоКСписанию = КоличествоКСписанию - Спишем;
							
							Если НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий > 2 Тогда
								//для сумм в валюте учета по ка пропускаю
								Если (СтрокаПриходныхПартий.СтоимостьПокупки - Окр(СтрокаПриходныхПартий.СтоимостьПокупки, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.СтоимостьПокупкиКупона - Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости - Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета - Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.ПереоценкаВСтоимости - Окр(СтрокаПриходныхПартий.ПереоценкаВСтоимости, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.Стоимость - Окр(СтрокаПриходныхПартий.Стоимость, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.СтоимостьКупона - Окр(СтрокаПриходныхПартий.СтоимостьКупона, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.Переоценка - Окр(СтрокаПриходныхПартий.Переоценка, 2) <> 0)
									 ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупона - Окр(СтрокаПриходныхПартий.ПереоценкаКупона, 2) <> 0)
									 Тогда
									
									ПогрешностьОкругления = ПогрешностиОкругления.Добавить();
									
									ЗаполнитьЗначенияСвойств(ПогрешностьОкругления, СтрокаПриходныхПартий);
									ПогрешностьОкругления.ВидДвижения = Перечисления.ВидыДвижений.Расход;
									ПогрешностьОкругления.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
									ПогрешностьОкругления.Период = ВыборкаДетальныеЗаписи.Период;
									ПогрешностьОкругления.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
									
									НовоеДвижение.СтоимостьПокупки = Окр(СтрокаПриходныхПартий.СтоимостьПокупки, 2);
									ПогрешностьОкругления.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
								
									НовоеДвижение.СтоимостьПокупкиКупона = Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона, 2);
									ПогрешностьОкругления.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона - НовоеДвижение.СтоимостьПокупкиКупона;
								
									НовоеДвижение.РасходыПриПокупкеВСтоимости = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости, 2);
									ПогрешностьОкругления.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости - НовоеДвижение.РасходыПриПокупкеВСтоимости;
								
									НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета, 2);
									ПогрешностьОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета - НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета;
								
									НовоеДвижение.ПереоценкаВСтоимости = Окр(СтрокаПриходныхПартий.ПереоценкаВСтоимости, 2);
									ПогрешностьОкругления.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости - НовоеДвижение.ПереоценкаВСтоимости;
								
									НовоеДвижение.ПереоценкаКупонаВСтоимости = Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости, 2);
									ПогрешностьОкругления.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - НовоеДвижение.ПереоценкаКупонаВСтоимости;
								
									НовоеДвижение.Стоимость = Окр(СтрокаПриходныхПартий.Стоимость, 2);
									ПогрешностьОкругления.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
								
									НовоеДвижение.СтоимостьКупона = Окр(СтрокаПриходныхПартий.СтоимостьКупона, 2);
									ПогрешностьОкругления.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона - НовоеДвижение.СтоимостьКупона;
								
									НовоеДвижение.Переоценка = Окр(СтрокаПриходныхПартий.Переоценка, 2);
									ПогрешностьОкругления.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
								
									НовоеДвижение.ПереоценкаКупона = Окр(СтрокаПриходныхПартий.ПереоценкаКупона, 2);
									ПогрешностьОкругления.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона - НовоеДвижение.ПереоценкаКупона;
								
								КонецЕсли;
							КонецЕсли;
							
						Иначе
							// Частичное погашение или уменьшает партии
							Если ВариантЧастичногоПогашения = Перечисления.ВариантыОтраженияДоходаАммортизационныхОблигаций.ПриЧастичномПогашении 
								 И СтрокаПриходныхПартий.СуммаЧастичногоПогашения = 0 Тогда
							
								НовоеДвижениеПерекурсовки = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
								НовоеДвижениеПерекурсовки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								
								Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей
									И НЕ ПереоценкаПередПродажами[0].ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.Дефолт Тогда
									
									НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
									
									НовоеДвижениеПереоценки.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
									НовоеДвижениеПереоценки.Период = ВыборкаДетальныеЗаписи.Период;
									НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
									НовоеДвижениеПереоценки.Рынок = ВыборкаДетальныеЗаписи.Рынок;
									НовоеДвижениеПереоценки.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
									НовоеДвижениеПереоценки.Партия = СтрокаПриходныхПартий.Партия;
									НовоеДвижениеПереоценки.СтрокаПартии = СтрокаПриходныхПартий.СтрокаПартии;
									НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
									
									//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
									
									ЦенаКотировки = ПереоценкаПередПродажами[0].ЦенаКотировки;
									СуммаРынок = Окр(ПереоценкаПередПродажами[0].СуммаРынок / ПереоценкаПередПродажами[0].Количество * СтрокаПриходныхПартий.Количество, 2);
									СуммаРынокВВалютеУчета = Окр(ПереоценкаПередПродажами[0].СуммаРынокВВалютеУчета / ПереоценкаПередПродажами[0].Количество * СтрокаПриходныхПартий.Количество, 2);
									
									СуммаРынокВсего = СуммаРынокВсего - СуммаРынок;
									СуммаРынокВВалютеУчетаВсего = СуммаРынокВВалютеУчетаВсего - СуммаРынокВВалютеУчета;
									
									ОбщееКоличество = ОбщееКоличество - СтрокаПриходныхПартий.Количество;
									Если ОбщееКоличество = 0 Тогда
									
										СуммаРынок = СуммаРынок + СуммаРынокВсего;
										СуммаРынокВВалютеУчета = СуммаРынокВВалютеУчета + СуммаРынокВВалютеУчетаВсего;
										
										СуммаРынокВсего = 0;
										СуммаРынокВВалютеУчетаВсего = 0;
									
									КонецЕсли;
									
									Если УчитыватьПереоценкуОтдельно Тогда
										НовоеДвижениеПереоценки.Переоценка = СуммаРынок	- (СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка); 
										НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СуммаРынокВВалютеУчета	- (СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета); 
										
										СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка + НовоеДвижениеПереоценки.Переоценка;
										СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета + НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
									Иначе
										НовоеДвижениеПереоценки.Стоимость = СуммаРынок - СтрокаПриходныхПартий.Стоимость; 
										НовоеДвижениеПереоценки.СтоимостьВВалютеУчета = СуммаРынокВВалютеУчета - СтрокаПриходныхПартий.СтоимостьВВалютеУчета; 
										НовоеДвижениеПереоценки.ПереоценкаВСтоимости = НовоеДвижениеПереоценки.Стоимость;
										
										СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость + НовоеДвижениеПереоценки.Стоимость;
										СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета + НовоеДвижениеПереоценки.СтоимостьВВалютеУчета;
										СтрокаПриходныхПартий.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости + НовоеДвижениеПереоценки.ПереоценкаВСтоимости;
									КонецЕсли;
									
								КонецЕсли;
								
								// согласно последним указаниям Тани индексация в данном случае
								// сохранил код т.к. скорее всего будет создание настройки для этого
								//Если ЭтоНалоговыйУчет Тогда
								//	Если ИндексируемыйНоминал И ИндексироватьНоминал Тогда
								//		НовоеДвижение = ИндексацияНоминала(ВыборкаДетальныеЗаписи.Регистратор,
								//											ВыборкаДетальныеЗаписи.Период,
								//											СтрокаПриходныхПартий,
								//											СтрокаПриходныхПартий.Количество,
								//											УчитыватьИндексациюОтдельно,
								//											Отказ);
								//		СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала + НовоеДвижение.ИндексацияНоминала;
								//		СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения + НовоеДвижение.ИндексацияНоминалаЗаВремяВладения;
								//	КонецЕсли;
								//КонецЕсли;
									
								НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
								
								ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
								НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
								НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
								
								НовоеДвижение.Количество = 0; //при частичном количество не списываем
								//тут посчитать надо
								КоэффициентСписания = ОпределитьКоээффициентЧастичногоСписания(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период);
								
								НовоеДвижение.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания;
								НовоеДвижение.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания;
								НовоеДвижение.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания;
								НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета * КоэффициентСписания;
								НовоеДвижение.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания;
								НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета * КоэффициентСписания;
								
								Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
									//НовоеДвижение.РасходыПриПокупкеВСтоимости = НовоеДвижение.Стоимость - НовоеДвижение.СтоимостьПокупки - НовоеДвижение.ПереоценкаВСтоимости;
									НовоеДвижение.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания;
									НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания;
								Иначе
									НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
									НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
								КонецЕсли; 

								//купон не списываем
								НовоеДвижение.СтоимостьПокупкиКупона = 0; 
								НовоеДвижение.ПереоценкаКупонаВСтоимости = 0;
								НовоеДвижение.СтоимостьКупона = 0;
								НовоеДвижение.СтоимостьКупонаВВалютеУчета = 0;
								НовоеДвижение.ПереоценкаКупона = 0;
								НовоеДвижение.ПереоценкаКупонаВВалютеУчета = 0;
								
								Если НастройкиПоВидуУчета.СписыватьКупленныйКупонПриЧастичномПогашенииОблигации Тогда // но иногда списываем
									НовоеДвижение.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания;
									НовоеДвижение.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета * КоэффициентСписания;
									НовоеДвижение.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания;
									НовоеДвижение.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания;
									НовоеДвижение.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета * КоэффициентСписания;
								КонецЕсли;
								
								Если НастройкиУчета.УчитыватьПогрешностьСложенияСтоимостиИПереоценкиЦеннойБумаги Тогда
								
									// мы пропорционально списываем части стоимости бумаги и к сожалению можем попасть на округление, нужно это учесть т.к. при выводе например мы должны биться со СЧА по общей сумме вывода
									// для всех бумаг куски стоимости это Стоимость и Переоценка
									ОбщаяСумма = СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка;
									ОбщаяСуммаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета;
									
									СуммаСписания = НовоеДвижение.Стоимость + НовоеДвижение.Переоценка;
									СуммаСписанияВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.ПереоценкаВВалютеУчета;
									
									ОбщаяСумма = Окр(ОбщаяСумма * КоэффициентСписания, 2);
									ОбщаяСуммаВВалютеУчета = Окр(ОбщаяСуммаВВалютеУчета * КоэффициентСписания, 2);
									
									Если ОбщаяСумма <> СуммаСписания Тогда
										НовоеДвижение.Переоценка = НовоеДвижение.Переоценка + ОбщаяСумма - СуммаСписания;
									КонецЕсли;
									Если ОбщаяСуммаВВалютеУчета <> СуммаСписанияВВалютеУчета Тогда
										НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + ОбщаяСуммаВВалютеУчета - СуммаСписанияВВалютеУчета;
									КонецЕсли;
								
								КонецЕсли;
								
								Если НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий > 2 Тогда
									//для валютных пока попускаем
									Если (СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания - Окр(СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания - Окр(СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания, 2) <> 0) 
										ИЛИ (СтрокаПриходныхПартий.Стоимость * КоэффициентСписания - Окр(СтрокаПриходныхПартий.Стоимость * КоэффициентСписания, 2) <> 0) 
										ИЛИ (СтрокаПриходныхПартий.Переоценка * КоэффициентСписания - Окр(СтрокаПриходныхПартий.Переоценка * КоэффициентСписания, 2) <> 0) 
										ИЛИ (НастройкиПоВидуУчета.СписыватьКупленныйКупонПриЧастичномПогашенииОблигации 
											И ((СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания - Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания, 2) <> 0)
												ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания - Окр(СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания, 2) <> 0)
												ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания - Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания, 2) <> 0)
												ИЛИ (СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания - Окр(СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания, 2) <> 0)
											  )
											) 
										Тогда
										
										ПогрешностьОкругления = ПогрешностиОкругления.Добавить();
										
										ЗаполнитьЗначенияСвойств(ПогрешностьОкругления, НовоеДвижение);
										ПогрешностьОкругления.ВидДвижения = Перечисления.ВидыДвижений.Расход;
										ПогрешностьОкругления.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
										ПогрешностьОкругления.Период = ВыборкаДетальныеЗаписи.Период;
										ПогрешностьОкругления.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
										
										НовоеДвижение.СтоимостьПокупки = Окр(НовоеДвижение.СтоимостьПокупки, 2);
										ПогрешностьОкругления.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания - НовоеДвижение.СтоимостьПокупки;
										
										НовоеДвижение.ИндексацияНоминала = Окр(НовоеДвижение.ИндексацияНоминала, 2);
										ПогрешностьОкругления.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала * КоэффициентСписания - НовоеДвижение.ИндексацияНоминала;
										
										НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = Окр(НовоеДвижение.ИндексацияНоминалаЗаВремяВладения, 2);
										ПогрешностьОкругления.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения * КоэффициентСписания - НовоеДвижение.ИндексацияНоминалаЗаВремяВладения;
										
										НовоеДвижение.ПереоценкаВСтоимости = Окр(НовоеДвижение.ПереоценкаВСтоимости, 2);
										ПогрешностьОкругления.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания - НовоеДвижение.ПереоценкаВСтоимости;
										
										НовоеДвижение.Стоимость = Окр(НовоеДвижение.Стоимость, 2);
										ПогрешностьОкругления.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания - НовоеДвижение.Стоимость;
										
										НовоеДвижение.Переоценка = Окр(НовоеДвижение.Переоценка, 2);
										ПогрешностьОкругления.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания - НовоеДвижение.Переоценка;
										
										Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
											НовоеДвижение.РасходыПриПокупкеВСтоимости = Окр(НовоеДвижение.РасходыПриПокупкеВСтоимости, 2);
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания - НовоеДвижение.РасходыПриПокупкеВСтоимости;
											
											НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = Окр(НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета, 2);
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания - НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета;
										Иначе
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимости = 0;
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
										КонецЕсли; 
										
										Если НастройкиПоВидуУчета.СписыватьКупленныйКупонПриЧастичномПогашенииОблигации Тогда
										
											НовоеДвижение.СтоимостьПокупкиКупона = Окр(НовоеДвижение.СтоимостьПокупкиКупона, 2);
											ПогрешностьОкругления.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания - НовоеДвижение.СтоимостьПокупкиКупона;
										
											НовоеДвижение.ПереоценкаКупонаВСтоимости = Окр(НовоеДвижение.ПереоценкаКупонаВСтоимости, 2);
											ПогрешностьОкругления.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания - НовоеДвижение.ПереоценкаКупонаВСтоимости;
										
											НовоеДвижение.ПереоценкаКупона = Окр(НовоеДвижение.ПереоценкаКупона, 2);
											ПогрешностьОкругления.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания - НовоеДвижение.ПереоценкаКупона;
										
											НовоеДвижение.СтоимостьКупона = Окр(НовоеДвижение.СтоимостьКупона, 2);
											ПогрешностьОкругления.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания - НовоеДвижение.СтоимостьКупона;
											
										Иначе
											
											ПогрешностьОкругления.СтоимостьПокупкиКупона = 0; 
											ПогрешностьОкругления.ПереоценкаКупонаВСтоимости = 0;
											ПогрешностьОкругления.СтоимостьКупона = 0;
											ПогрешностьОкругления.ПереоценкаКупона = 0;
											
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								
								//тут теже подсчитаные партии
								СтрокаПриходныхПартий.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
								СтрокаПриходныхПартий.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости - НовоеДвижение.ПереоценкаВСтоимости;
								СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
								СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
								СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
								СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета - НовоеДвижение.ПереоценкаВВалютеУчета;
								СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала - НовоеДвижение.ИндексацияНоминала;
								СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения - НовоеДвижение.ИндексацияНоминалаЗаВремяВладения;
								СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости - НовоеДвижение.РасходыПриПокупкеВСтоимости;
								СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета - НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета;
								
								//#464047
								Если НастройкиПоВидуУчета.СписыватьКупленныйКупонПриЧастичномПогашенииОблигации Тогда // списываем купон, если таковой есть
									СтрокаПриходныхПартий.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона - НовоеДвижение.СтоимостьПокупкиКупона;
									СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона - НовоеДвижение.ПереоценкаКупона;
									СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета - НовоеДвижение.ПереоценкаКупонаВВалютеУчета;									
									СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - НовоеДвижение.ПереоценкаКупонаВСтоимости;									
									СтрокаПриходныхПартий.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона - НовоеДвижение.СтоимостьКупона;		
									СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета - НовоеДвижение.СтоимостьКупонаВВалютеУчета;
								КонецЕсли;
								
							Иначе //или же дописывает суммы погашений к партиям
							
								СуммаИзмененияНоминала = СуммаИзмененияНоминала(ВыборкаДетальныеЗаписи.Период, ВыборкаДетальныеЗаписи.ЦеннаяБумага);
								
								НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								
								// согласно последним указаниям Тани индексация в данном случае
								// сохранил код т.к. скорее всего будет создание настройки для этого
								//Если ЭтоНалоговыйУчет Тогда
								//	Если ИндексируемыйНоминал И ИндексироватьНоминал Тогда
								//		СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала + НовоеДвижение.ИндексацияНоминала;
								//		НовоеДвижение = ИндексацияНоминала(ВыборкаДетальныеЗаписи.Регистратор,
								//											ВыборкаДетальныеЗаписи.Период,
								//											СтрокаПриходныхПартий,
								//											СтрокаПриходныхПартий.Количество,
								//											УчитыватьИндексациюОтдельно,
								//											Отказ);
								//	КонецЕсли;
								//КонецЕсли;
								
								НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
								
								ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
								
								НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
								НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
								НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.Амортизация;
								
								НовоеДвижение.СуммаЧастичногоПогашения = СтрокаПриходныхПартий.Количество * СуммаИзмененияНоминала;  
								
								НовоеДвижение.Количество = 0;
								НовоеДвижение.СтоимостьПокупки = 0;
								НовоеДвижение.СтоимостьПокупкиКупона = 0;
								НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
								НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
								НовоеДвижение.ПереоценкаВСтоимости = 0;
								НовоеДвижение.ПереоценкаКупонаВСтоимости = 0;
								НовоеДвижение.Стоимость = 0;
								НовоеДвижение.СтоимостьВВалютеУчета = 0;
								НовоеДвижение.СтоимостьКупона = 0;
								НовоеДвижение.СтоимостьКупонаВВалютеУчета = 0;
								НовоеДвижение.Переоценка = 0;
								НовоеДвижение.ПереоценкаВВалютеУчета = 0;
								НовоеДвижение.ПереоценкаКупона = 0;
								НовоеДвижение.ПереоценкаКупонаВВалютеУчета = 0;
								
								СтрокаПриходныхПартий.СуммаЧастичногоПогашения = СтрокаПриходныхПартий.СуммаЧастичногоПогашения + СтрокаПриходныхПартий.Количество * СуммаИзмененияНоминала;  
								
								// *******************************************
								// я не не буду тут приделывать учет до 4х знаков после запятой так как он тут нафиг не нужен
								// *******************************************
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
						ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
					КонецЦикла;
					
					#КонецОбласти

				ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИзменениеУсловийСделки") Тогда	
					
					#Область ИзменениеУсловийСделки
					
					СтрокиПартийКупленныеПоРЕПО = ПартииКупленныеПоРЕПО.НайтиСтроки(Новый Структура("Партия", ВыборкаДетальныеЗаписи.Партия));
										
					Для Каждого СтрокаПартииКупленныеПоРЕПО Из СтрокиПартийКупленныеПоРЕПО Цикл
												
						НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПартииКупленныеПоРЕПО, СтрокаПартииКупленныеПоРЕПО.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
												
						Если Отказ Тогда
							Возврат;
						КонецЕсли;
						
						НовоеДвижениеРЕПО = РассчитанныеПартииОбратноеРЕПО.Добавить();
												
						ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, СтрокаПартииКупленныеПоРЕПО);
						
						НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижениеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
						
						НовоеДвижениеРЕПО.Количество = 0;
																		
						СтоимостьКупонаВалютеНоминала = ВыборкаДетальныеЗаписи.СтоимостьКупона; 
						ВалютаСделки = ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала;
						
						НовоеДвижениеРЕПО.СтоимостьКупона = Мин(СтрокаПартииКупленныеПоРЕПО.СтоимостьКупона, СтоимостьКупонаВалютеНоминала);
						
						НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижениеРЕПО.СтоимостьКупона,
							ВалютаСделки, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);
											
						НовоеДвижениеРЕПО.Стоимость = СтоимостьКупонаВалютеНоминала - НовоеДвижениеРЕПО.СтоимостьКупона;
						
						НовоеДвижениеРЕПО.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижениеРЕПО.Стоимость, 
							ВалютаСделки, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период);					
						
						СтрокаПартииКупленныеПоРЕПО.Стоимость = СтрокаПартииКупленныеПоРЕПО.Стоимость - НовоеДвижениеРЕПО.Стоимость;						
						СтрокаПартииКупленныеПоРЕПО.СтоимостьКупона = СтрокаПартииКупленныеПоРЕПО.СтоимостьКупона - НовоеДвижениеРЕПО.СтоимостьКупона;
						
						СтрокаПартииКупленныеПоРЕПО.СтоимостьВВалютеУчета = СтрокаПартииКупленныеПоРЕПО.СтоимостьВВалютеУчета - НовоеДвижениеРЕПО.СтоимостьВВалютеУчета;						
						СтрокаПартииКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета - НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета;
						
					КонецЦикла;	
					
					#КонецОбласти
					
				ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СнятиеЦеннойБумагиСУчета")
					ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету") Тогда
					
					#Область СнятиеЦеннойБумагиСУчета_ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету
					
					// Списываем все
					ПриходныеПартииКУдалению = Новый Массив;
					
					Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл //Спишем либо все приходные партии либо пропорционально части номинала
						
						// Ни валютные, ни номиналоиндексируемые бумаги мы ни разу с учета не снимали и стоимость по ним ни разу не выбывала
						// так что нужность нижележащего кода под очень большим вопросом - закоментировал его от греха подальше
						//
						//НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
						//НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						//
						//Если Отказ Тогда
						//	Возврат;
						//КонецЕсли;
						//
						//Если ЭтоНалоговыйУчет Тогда
						//	Если ИндексируемыйНоминал И ИндексироватьНоминал Тогда
						//		НовоеДвижение = ИндексацияНоминала(ВыборкаДетальныеЗаписи.Регистратор,
						//											ВыборкаДетальныеЗаписи.Период,
						//											СтрокаПриходныхПартий,
						//											СтрокаПриходныхПартий.Количество,
						//											УчитыватьИндексациюОтдельно,
						//											Отказ);
						//		СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала + НовоеДвижение.ИндексацияНоминала;
						//		СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения + НовоеДвижение.ИндексацияНоминалаЗаВремяВладения;
						//	КонецЕсли;
						//КонецЕсли;
						
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
						НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
						НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
						НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
						НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
						
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
						
						Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СнятиеЦеннойБумагиСУчета") Тогда
							ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий); // снятие удаляет партию
						ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету") Тогда
							НовоеДвижение.Количество = 0; // а выбытие не удаляет, еще и не списывает количество
							
							Для Каждого Ресурс из РесурсыПартий Цикл // спишем суммы с остатков
								Если Ресурс = "Количество" Тогда 
									Продолжить; 
								КонецЕсли;
								СтрокаПриходныхПартий[Ресурс] = 0;	
							КонецЦикла;	
							
						КонецЕсли;
						
					КонецЦикла;
						
					Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
						ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
					КонецЦикла;
					
					#КонецОбласти
					
				ИначеЕсли НЕ ЭтоРынокОблигаций
							И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги")
							И ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментСписания Тогда
							
					Продолжить;
					
				ИначеЕсли НЕ ЭтоРынокОблигаций
							И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеЦеннойБумаги")
							И ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения Тогда
							
					Продолжить;
					
				ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Оплата") Тогда
					
					#Область Оплата
					
					Если НастройкиПоВидуУчета.МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Кассовый
						И (РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации
							ИЛИ РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона) Тогда
							
						ОплатаТела = (РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации);
						ОплатаКупона = (РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона);
						РесурсыКупона = "СтоимостьКупона,СтоимостьКупонаВВалютеУчета,ПереоценкаКупона,ПереоценкаКупонаВВалютеУчета,";
						
						Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл 
							
							НовоеДвижение = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, СтрокаПриходныхПартий.Количество, ВыборкаДетальныеЗаписи.СтрокаПартии,,,, Отказ);
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							Если Отказ Тогда
								Возврат;
							КонецЕсли;
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
							
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий, "Рынок, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС");
							
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							Для Каждого Ресурс из РесурсыПартий Цикл
								Если Ресурс = "Количество" Тогда 
									Продолжить; 
								КонецЕсли;
								ЭтоРесурсКупона = (СтрНайти(РесурсыКупона, Ресурс + ",") <> 0);
								
								Если ОплатаТела И НЕ ЭтоРесурсКупона 
									ИЛИ ОплатаКупона И ЭтоРесурсКупона Тогда
									
									НовоеДвижение[Ресурс] = СтрокаПриходныхПартий[Ресурс];	
									СтрокаПриходныхПартий[Ресурс] = 0;
									
								КонецЕсли;
							КонецЦикла;
							
						КонецЦикла;
							
					//оплата по покупками РЕПО
					ИначеЕсли РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО 
						ИЛИ РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
						
						//по 1-й части покупки РЕПО если оплата позже, то перекурсовать бумаги
						//по 2-й части покупки РЕПО если оплата раньше, то погасить суммы и оставить количество
						ЗапросДляРЕПО = Новый Запрос;
						ЗапросДляРЕПО.Текст = 
							"ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|	ОплатаОснования.Основание КАК Основание,
							|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) КАК ДатаОплаты,
							|	НАЧАЛОПЕРИОДА(ПоставкаЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаПоставки,
							|	ОплатаОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
							|	ПоставкаЦенныхБумаг1Ч.Ссылка КАК ПоставкаЦенныхБумагПоПервойЧасти,
							|	ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.СделкаРЕПО).ВалютаСделки КАК ВалютаСделки,
							|	ОплатаОснования.КурсОплаты КАК КурсОплаты,
							|	ОплатаОснования.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
							|	ЕСТЬNULL(ПоставкаЦенныхБумаг.Ссылка, ЗНАЧЕНИЕ(Документ.ПоставкаЦенныхБумаг.)) КАК ПоставкаЦенныхБумаг
							|ИЗ
							|	Документ.Оплата.Основания КАК ОплатаОснования
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг1Ч
							|		ПО ОплатаОснования.Основание = ПоставкаЦенныхБумаг1Ч.Основание
							|			И (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО) = ПоставкаЦенныхБумаг1Ч.ВидЗадолженности)
							|			И (ПоставкаЦенныхБумаг1Ч.Проведен)
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
							|		ПО ОплатаОснования.Основание = ПоставкаЦенныхБумаг.Основание
							|			И ОплатаОснования.Ссылка.ВидЗадолженности = ПоставкаЦенныхБумаг.ВидЗадолженности
							|			И (ПоставкаЦенныхБумаг.Проведен)
							|ГДЕ
							|	ОплатаОснования.Ссылка = &Ссылка
							|	И (ОплатаОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
							|				И НАЧАЛОПЕРИОДА(ЕСТЬNULL(ПоставкаЦенныхБумаг.Дата, ОплатаОснования.Ссылка.Дата), ДЕНЬ) < НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ)
							|			ИЛИ ОплатаОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
							|				И НАЧАЛОПЕРИОДА(ЕСТЬNULL(ПоставкаЦенныхБумаг.Дата, ДОБАВИТЬКДАТЕ(ОплатаОснования.Ссылка.Дата, ДЕНЬ, 1)), ДЕНЬ) > НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ))
							|	И ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.СделкаРЕПО).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)";
						
						ЗапросДляРЕПО.УстановитьПараметр("Ссылка", ВыборкаДетальныеЗаписи.Регистратор);
						
						РезультатЗапросаДляРЕПО = ЗапросДляРЕПО.Выполнить();
						
						ВыборкаДетальныеЗаписиДляРЕПО = РезультатЗапросаДляРЕПО.Выбрать();
						
						Пока ВыборкаДетальныеЗаписиДляРЕПО.Следующий() Цикл
							
							Если ВыборкаДетальныеЗаписиДляРЕПО.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО
								И ВыборкаДетальныеЗаписиДляРЕПО.ВалютаСделки <> ВалютаУчета Тогда
								
								//перекурсовать бумаги
								СтрокиПартийКупленныеПоРЕПО = ПартииКупленныеПоРЕПО.НайтиСтроки(Новый Структура("Партия",ВыборкаДетальныеЗаписиДляРЕПО.ПоставкаЦенныхБумагПоПервойЧасти));
								Для каждого СтрокаПартииКупленныеПоРЕПО Из СтрокиПартийКупленныеПоРЕПО Цикл
									НовоеДвижениеРЕПО = РассчитанныеПартииОбратноеРЕПО.Добавить();
									ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, СтрокаПартииКупленныеПоРЕПО);
									
									НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Приход;
									НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
									НовоеДвижениеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
									НовоеДвижениеРЕПО.Количество = 0;
									НовоеДвижениеРЕПО.Стоимость = 0;
									НовоеДвижениеРЕПО.СтоимостьКупона = 0;
									НовоеДвижениеРЕПО.СтоимостьВВалютеУчета = 
										Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаПартииКупленныеПоРЕПО.Стоимость, ВыборкаДетальныеЗаписиДляРЕПО.ВалютаСделки, ЭтотОбъект.Организация, ?(ВыборкаДетальныеЗаписиДляРЕПО.СобственныйКурсОплаты, ВыборкаДетальныеЗаписиДляРЕПО.КурсОплаты, ВыборкаДетальныеЗаписи.Период), Отказ), 2)
										- СтрокаПартииКупленныеПоРЕПО.СтоимостьВВалютеУчета;
									НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета = 
										Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаПартииКупленныеПоРЕПО.СтоимостьКупона, ВыборкаДетальныеЗаписиДляРЕПО.ВалютаСделки, ЭтотОбъект.Организация, ?(ВыборкаДетальныеЗаписиДляРЕПО.СобственныйКурсОплаты, ВыборкаДетальныеЗаписиДляРЕПО.КурсОплаты, ВыборкаДетальныеЗаписи.Период), Отказ), 2)
										- СтрокаПартииКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета;
										
									СтрокаПартииКупленныеПоРЕПО.СтоимостьВВалютеУчета = СтрокаПартииКупленныеПоРЕПО.СтоимостьВВалютеУчета + НовоеДвижениеРЕПО.СтоимостьВВалютеУчета;
									СтрокаПартииКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета + НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета;
									
								КонецЦикла;
								
							ИначеЕсли ВыборкаДетальныеЗаписиДляРЕПО.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
								
								//списать суммы
								СтрокиПартийКупленныеПоРЕПО = ПартииКупленныеПоРЕПО.НайтиСтроки(Новый Структура("Партия",ВыборкаДетальныеЗаписиДляРЕПО.ПоставкаЦенныхБумагПоПервойЧасти));
								Для каждого СтрокаПартииКупленныеПоРЕПО Из СтрокиПартийКупленныеПоРЕПО Цикл
									НовоеДвижениеРЕПО = РассчитанныеПартииОбратноеРЕПО.Добавить();
									ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, СтрокаПартииКупленныеПоРЕПО);
									
									НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
									НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
									НовоеДвижениеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
									НовоеДвижениеРЕПО.Количество = 0;
									НовоеДвижениеРЕПО.Стоимость = СтрокаПартииКупленныеПоРЕПО.Стоимость;
									НовоеДвижениеРЕПО.СтоимостьВВалютеУчета = СтрокаПартииКупленныеПоРЕПО.СтоимостьВВалютеУчета;
									НовоеДвижениеРЕПО.СтоимостьКупона = СтрокаПартииКупленныеПоРЕПО.СтоимостьКупона;
									НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета;
									
									СтрокаПартииКупленныеПоРЕПО.Стоимость = 0;
									СтрокаПартииКупленныеПоРЕПО.СтоимостьВВалютеУчета = 0;
									СтрокаПартииКупленныеПоРЕПО.СтоимостьКупона = 0;
									СтрокаПартииКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета = 0;
									
								КонецЦикла;
								
							КонецЕсли;
							
						КонецЦикла;

					КонецЕсли;
					
					#КонецОбласти
					
				// ПРОДАЖИ НАЧИНАЮТЯ ОТСЮДА
				Иначе //Остальные расходы спишем с приходов. Остальные это 
				
					ЭтоПрямоеРЕПО = Ложь;
					ЭтоЗакрытиеОбратногоРЕПО = Ложь;
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
					    Если РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ЧастьСделкиРЕПО = 1 Тогда
							ЭтоПрямоеРЕПО = Истина;
						ИначеЕсли РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].ЧастьСделкиРЕПО = 2 Тогда
							ЭтоЗакрытиеОбратногоРЕПО = Истина;
						КонецЕсли;
					ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг")
						И ТипЗнч(РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
					    Если РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Основание.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
							ЭтоПрямоеРЕПО = Истина;
						ИначеЕсли РеквизитыРегистраторов[ВыборкаДетальныеЗаписи.Регистратор].Основание.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
							ЭтоЗакрытиеОбратногоРЕПО = Истина;
						КонецЕсли;
					КонецЕсли;
					
					Если ЭтоЗакрытиеОбратногоРЕПО И НастройкиПоВидуУчета.УчитыватьПартииРЕПООтдельно Тогда

						// просто списываем РЕПОшные партии
						ПартииКупленныеПоРЕПОКУдалению = Новый Массив;
						
						Если ТипЗнч(ВыборкаДетальныеЗаписи.Партия) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
							ПартииКупленныеПоРЕПОПоСделке = ПартииКупленныеПоРЕПО.НайтиСтроки(Новый Структура("Партия,СтрокаПартии", ВыборкаДетальныеЗаписи.Партия.ПерваяЧастьРЕПО, ВыборкаДетальныеЗаписи.СтрокаПартии));
						Иначе
							ПартииКупленныеПоРЕПОПоСделке = Новый Массив;
							
							ПартииКупленныеПоРЕПОПоБумаге = ПартииКупленныеПоРЕПО.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаДетальныеЗаписи.ЦеннаяБумага));
							Для Каждого ПартияКупленнаяПоРЕПОПоБумаге ИЗ ПартииКупленныеПоРЕПОПоБумаге Цикл
								//куда пихать СтрокаПродажиРЕПО?
								Если НЕ ЗначениеЗаполнено(ПартияКупленнаяПоРЕПОПоБумаге.Партия) Тогда
									//пока Коля не отпустит переоценку. Там не заполнены измерения
									Продолжить;
								КонецЕсли;
								//т.к. иногда бывают(бывали?) отложенные исполнения по биржевым РЕПО
								Если ТипЗнч(ПартияКупленнаяПоРЕПОПоБумаге.Партия) = Тип("ДокументСсылка.СделкаРЕПО") 
										И ПартияКупленнаяПоРЕПОПоБумаге.Партия = ВыборкаДетальныеЗаписи.Партия.Основание 
									ИЛИ ТипЗнч(ПартияКупленнаяПоРЕПОПоБумаге.Партия) <> Тип("ДокументСсылка.СделкаРЕПО")
										И ПартияКупленнаяПоРЕПОПоБумаге.Партия.Основание = ВыборкаДетальныеЗаписи.Партия.Основание Тогда
									
									ПартииКупленныеПоРЕПОПоСделке.Добавить(ПартияКупленнаяПоРЕПОПоБумаге);
									
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;                     
						
						ОсталосьЗакрытьКупленныхПоРЕПО = ВыборкаДетальныеЗаписи.Количество;
						
						Для каждого СтрокаПартииКупленныеПоРЕПОПоСделке Из ПартииКупленныеПоРЕПОПоСделке Цикл
							
							Если ОсталосьЗакрытьКупленныхПоРЕПО = 0 Тогда
								Прервать;
							КонецЕсли;
							
							ЗакроемПоРЕПО = Мин(СтрокаПартииКупленныеПоРЕПОПоСделке.Количество, ОсталосьЗакрытьКупленныхПоРЕПО);
							ОсталосьЗакрытьКупленныхПоРЕПО = ОсталосьЗакрытьКупленныхПоРЕПО - ЗакроемПоРЕПО;
							
							// движение по партиям РЕПО расход сделать
							НовоеДвижениеРЕПО = РассчитанныеПартииОбратноеРЕПО.Добавить();
							ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, СтрокаПартииКупленныеПоРЕПОПоСделке);
							
							НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижениеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижениеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижениеРЕПО.СтрокаКорзиныЦенныхБумаг = СтрокаПартииКупленныеПоРЕПОПоСделке.СтрокаПартии;
							
							Если ЗакроемПоРЕПО = СтрокаПартииКупленныеПоРЕПОПоСделке.Количество Тогда
								// запомним, что удалить надо из репошных 
								ПартииКупленныеПоРЕПОКУдалению.Добавить(СтрокаПартииКупленныеПоРЕПОПоСделке);
							Иначе
								
								КоэффициентСписания = ЗакроемПоРЕПО / НовоеДвижениеРЕПО.Количество;
								
								НовоеДвижениеРЕПО.Количество 							= ЗакроемПоРЕПО;
								НовоеДвижениеРЕПО.Стоимость 							= НовоеДвижениеРЕПО.Стоимость * КоэффициентСписания;
								НовоеДвижениеРЕПО.СтоимостьКупона 						= НовоеДвижениеРЕПО.СтоимостьКупона * КоэффициентСписания;
								НовоеДвижениеРЕПО.СтоимостьВВалютеУчета 				= НовоеДвижениеРЕПО.СтоимостьВВалютеУчета * КоэффициентСписания;
								НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета 			= НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета * КоэффициентСписания;
								НовоеДвижениеРЕПО.Переоценка 							= НовоеДвижениеРЕПО.Переоценка * КоэффициентСписания;
								НовоеДвижениеРЕПО.ПереоценкаВВалютеУчета 				= НовоеДвижениеРЕПО.ПереоценкаВВалютеУчета * КоэффициентСписания;
								НовоеДвижениеРЕПО.ПереоценкаКупона 						= НовоеДвижениеРЕПО.ПереоценкаКупона * КоэффициентСписания;
								НовоеДвижениеРЕПО.ПереоценкаКупонаВВалютеУчета 			= НовоеДвижениеРЕПО.ПереоценкаКупонаВВалютеУчета * КоэффициентСписания;
								
								СтрокаПартииКупленныеПоРЕПОПоСделке.Количество = СтрокаПартииКупленныеПоРЕПОПоСделке.Количество - НовоеДвижениеРЕПО.Количество;
								СтрокаПартииКупленныеПоРЕПОПоСделке.Стоимость = СтрокаПартииКупленныеПоРЕПОПоСделке.Стоимость - НовоеДвижениеРЕПО.Стоимость;
								СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупона = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупона - НовоеДвижениеРЕПО.СтоимостьКупона;
								СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьВВалютеУчета - НовоеДвижениеРЕПО.СтоимостьВВалютеУчета;
								СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупонаВВалютеУчета - НовоеДвижениеРЕПО.СтоимостьКупонаВВалютеУчета;
								СтрокаПартииКупленныеПоРЕПОПоСделке.Переоценка = СтрокаПартииКупленныеПоРЕПОПоСделке.Переоценка - НовоеДвижениеРЕПО.Переоценка;
								СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаВВалютеУчета - НовоеДвижениеРЕПО.ПереоценкаВВалютеУчета;
								СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупона = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупона - НовоеДвижениеРЕПО.ПереоценкаКупона;
								СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупонаВВалютеУчета - НовоеДвижениеРЕПО.ПереоценкаКупонаВВалютеУчета;
								
							КонецЕсли;
								
						КонецЦикла;
						
						Если ОсталосьЗакрытьКупленныхПоРЕПО <> 0 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На момент документа " + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага)+" не хватает " + ОсталосьЗакрытьКупленныхПоРЕПО, ВыборкаДетальныеЗаписи.Регистратор,,,Отказ);
						КонецЕсли;
						
						// удалим партии РЕПО
						Для каждого СтрокаПартииКупленныеПоРЕПОКУдалению Из ПартииКупленныеПоРЕПОКУдалению Цикл
							ПартииКупленныеПоРЕПО.Удалить(СтрокаПартииКупленныеПоРЕПОКУдалению);
						КонецЦикла;
						
					Иначе
						
						Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")
							И (НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом ИЛИ НастройкиПоВидуУчета.НачислятьПроцентныеДоходыПоВыводимымАктивам) Тогда
						
							ПереоценкаПередВыводами = ПереоценкиПередВыводами.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага",
																ВыборкаДетальныеЗаписи.Регистратор,
																ВыборкаДетальныеЗаписи.ЦеннаяБумага));
																
							Если ПереоценкаПередВыводами.Количество() = 0 // цена должна быть хоть какая-нибудь
								ИЛИ ПереоценкаПередВыводами.Количество() <> 1 И ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда // но для НУ допустима ситуация нескольких цен из-за параллельного ЕПСа и цен по АС
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить цену бумаги перед выводом:" + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага));
								Отказ = Истина;
							Иначе
								СуммаРынокВсего = ПереоценкаПередВыводами[0].СуммаРынок;
								СуммаРынокВВалютеУчетаВсего = ПереоценкаПередВыводами[0].СуммаРынокВВалютеУчета;
								КоличествоВсего = ПереоценкаПередВыводами[0].Количество;
							КонецЕсли;
							
						ИначеЕсли НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей И ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
							
							ПереоценкаПередПродажами = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения",
																ВыборкаДетальныеЗаписи.Регистратор,
																ВыборкаДетальныеЗаписи.ЦеннаяБумага,
																Перечисления.ВидыДвижений.Расход));
																
							Если ПереоценкаПередПродажами.Количество() <> 1 Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить цену бумаги перед продажей:" + Строка(ВыборкаДетальныеЗаписи.Регистратор) + " / "+ Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага));
								Отказ = Истина;
							Иначе
								СуммаРынокВсего = ПереоценкаПередПродажами[0].СуммаРынок;
								СуммаРынокВВалютеУчетаВсего = ПереоценкаПередПродажами[0].СуммаРынокВВалютеУчета;
								КоличествоВсего = ПереоценкаПередПродажами[0].Количество; 
							КонецЕсли;
							
						ИначеЕсли ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением Тогда
							
							СуммаКупонаНаОднуОблигацию = Справочники.Облигации.ПолучитьКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, СчетДоверительногоУправленияДляУчета);
							
						КонецЕсли;
						
						ПриходныеПартииКУдалению = Новый Массив;
						
						КоличествоКСписанию = ВыборкаДетальныеЗаписи.Количество;
						
						Для каждого СтрокаПриходныхПартий Из ПриходныеПартии Цикл
							
							Если КоличествоКСписанию = 0 Тогда
								Прервать;
							КонецЕсли;
							
							КоличествоКСписаниюПоПартии = Мин(СтрокаПриходныхПартий.Количество, КоличествоКСписанию);
							
							// #416666 - настройка РаспределениеПартийНУДолжноСовпадатьСЕПС
							Если ЭтоНалоговыйУчет И НастройкиУчета.РаспределениеПартийНУДолжноСовпадатьСЕПС Тогда
								
								Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")
									И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Партия)
									И СписокСтратегий.Найти(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Партия, "СчетДоверительногоУправления")) <> Неопределено Тогда
								
									Если СтрокаПриходныхПартий.Партия <> ВыборкаДетальныеЗаписи.Партия
										ИЛИ СтрокаПриходныхПартий.СтрокаПартии <> ВыборкаДетальныеЗаписи.СтрокаПартии Тогда
										
										Продолжить;
									
									КонецЕсли;	
									
								Иначе // для сделок и исполнений, увы, приходится смотреть как это делает ЕПС
									
									// а как ЕПС списывал данную партию?
									СписаниеПартииЕПС = СписанияПартийЕПС.НайтиСтроки(
															Новый Структура("Регистратор, ЦеннаяБумага, Партия, СтрокаПартии",
																ВыборкаДетальныеЗаписи.Регистратор,
																ЦеннаяБумага,
																СтрокаПриходныхПартий.Партия,
																СтрокаПриходныхПартий.СтрокаПартии));
																
									Если СписаниеПартииЕПС.Количество() = 0 Тогда 
										// Если никак не списывал, то и мы не будем
										Продолжить;								
									ИначеЕсли СписаниеПартииЕПС[0].Количество = 0 Тогда 
										Продолжить;
									Иначе
										// Сколько ЕПС списал - столько же и мы спишем
										КоличествоКСписаниюПоПартии = СписаниеПартииЕПС[0].Количество;
										СписаниеПартииЕПС[0].Количество = 0;
									КонецЕсли;
									
								КонецЕсли;
							
							КонецЕсли;
							
							МассивРесурсовКПерекурсовке = Неопределено;
							ТребуетсяПерекурсовка = Ложь; 
							Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
								ТребуетсяПерекурсовка = Истина;
							ИначеЕсли ЭтоПрямоеРЕПО Тогда
								ТребуетсяПерекурсовка = Истина;
							ИначеЕсли ЭтоРынокОблигаций И ЭтоФизЛицо И ЭтоНалоговыйУчет И ВыборкаДетальныеЗаписи.ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда 
								// 214.1 НК РФ: 
								ТребуетсяПерекурсовка = Истина;
								
								МассивРесурсовКПерекурсовке = Новый Массив;
								МассивРесурсовКПерекурсовке.Добавить("СтоимостьВВалютеУчета");
								МассивРесурсовКПерекурсовке.Добавить("СтоимостьКупонаВВалютеУчета");
								
							ИначеЕсли НЕ ЭтоНалоговыйУчет Тогда
								ТребуетсяПерекурсовка = Истина; //#452426  
							КонецЕсли;
							
							Если ТребуетсяПерекурсовка Тогда
								
								НовоеДвижениеПерекурсовка = Перекурсовка(ВыборкаДетальныеЗаписи.Регистратор, ЭтотОбъект.РассчитанныеПартии, ВыборкаДетальныеЗаписи.Период, СтрокаПриходныхПартий, КоличествоКСписаниюПоПартии, ВыборкаДетальныеЗаписи.СтрокаПартии,, МассивРесурсовКПерекурсовке,Новый Структура("ОтражатьНаПриходнойПартии", Ложь), Отказ);
								НовоеДвижениеПерекурсовка.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								
							Иначе
								НовоеДвижениеПерекурсовка = Неопределено;
							КонецЕсли;
							
							НовоеДвижениеИндексация = Неопределено;
							
							Если ИндексируемыйНоминал И ИндексироватьНоминал Тогда
								//индексируемый номинал пока только у рублевых бумаг, поэтому не заморачиваемся
								
								НовоеДвижениеИндексация = Неопределено;
								НовоеДвижениеИндексация = ИндексацияНоминала(ВыборкаДетальныеЗаписи.Регистратор,
																				ВыборкаДетальныеЗаписи.Период,
																				СтрокаПриходныхПартий,
																				КоличествоКСписаниюПоПартии,
																				УчитыватьИндексациюОтдельно,
																				Отказ);
								НовоеДвижениеИндексация.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							КонецЕсли;
							
							
							НовоеДвижениеПереоценки = Неопределено;
							НовоеДвижениеПереоценкиКупона = Неопределено;
							Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг") И (НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом ИЛИ НастройкиПоВидуУчета.НачислятьПроцентныеДоходыПоВыводимымАктивам)
								ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВыводЦенныхБумаг") И НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей Тогда
								
								Если НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей Тогда
								
									ПереоценкаПередВыводамиПродажами = ПереоценкиДляОпераций.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага,ВидДвижения",
																		ВыборкаДетальныеЗаписи.Регистратор,
																		СтрокаПриходныхПартий.ЦеннаяБумага,
																		Перечисления.ВидыДвижений.Расход));
									ВыводПродажа = "продажей";
									
								Иначе
									
									ПереоценкаПередВыводамиПродажами = ПереоценкиПередВыводами.НайтиСтроки(Новый Структура("Ссылка,ЦеннаяБумага",
																		ВыборкаДетальныеЗаписи.Регистратор,
																		СтрокаПриходныхПартий.ЦеннаяБумага));
									ВыводПродажа = "выводом";
									
								КонецЕсли;
								
								Если ПереоценкаПередВыводамиПродажами.Количество() = 0 // цена должна быть хоть какая-нибудь
									ИЛИ ПереоценкаПередВыводамиПродажами.Количество() <> 1 И ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда // но для НУ допустима ситуация нескольких цен из-за параллельного ЕПСа и цен по АС
									
									ТекстСообщения = СтрШаблон("Не удалось определить цену бумаги перед %1: %2 / %3", ВыводПродажа, ВыборкаДетальныеЗаписи.Регистратор, СтрокаПриходныхПартий.ЦеннаяБумага); 
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
								КонецЕсли;
								
								НовоеДвижениеПереоценки = ЭтотОбъект.РассчитанныеПартии.Добавить();
								
								
								НовоеДвижениеПереоценки.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
								НовоеДвижениеПереоценки.Период = ВыборкаДетальныеЗаписи.Период;
								НовоеДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Приход;
								НовоеДвижениеПереоценки.Рынок = ВыборкаДетальныеЗаписи.Рынок;
								НовоеДвижениеПереоценки.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
								НовоеДвижениеПереоценки.Партия = СтрокаПриходныхПартий.Партия;
								НовоеДвижениеПереоценки.СтрокаПартии = СтрокаПриходныхПартий.СтрокаПартии;
								НовоеДвижениеПереоценки.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
								
								//НовоеДвижениеПереоценки.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
								
								Если (НастройкиПоВидуУчета.ПереоцениватьАктивыПередВыводом ИЛИ НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей)
									И НЕ ПереоценкаПередВыводамиПродажами[0].ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.Дефолт Тогда
								
									ЦенаКотировки = ПереоценкаПередВыводамиПродажами[0].ЦенаКотировки;
									СуммаРынок = Окр(СуммаРынокВсего * КоличествоКСписаниюПоПартии / КоличествоВсего, 2);
									СуммаРынокВВалютеУчета = Окр(СуммаРынокВВалютеУчетаВсего * КоличествоКСписаниюПоПартии / КоличествоВсего, 2);
									
									СуммаРынокВсего = СуммаРынокВсего - СуммаРынок;
									СуммаРынокВВалютеУчетаВсего = СуммаРынокВВалютеУчетаВсего - СуммаРынокВВалютеУчета;
									КоличествоВсего = КоличествоВсего - КоличествоКСписаниюПоПартии;
									
									Если УчитыватьПереоценкуОтдельно Тогда
										
										НовоеДвижениеПереоценки.Переоценка = СуммаРынок
												- (СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка)
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии; 
										НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = СуммаРынокВВалютеУчета
												- (СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета)
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии; 
										
										Если НовоеДвижениеПерекурсовка <> Неопределено Тогда
											НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета = НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета
												- (НовоеДвижениеПерекурсовка.СтоимостьВВалютеУчета + НовоеДвижениеПерекурсовка.ПереоценкаВВалютеУчета);
										КонецЕсли;
											
									Иначе
										НовоеДвижениеПереоценки.Стоимость = СуммаРынок
												- СтрокаПриходныхПартий.Стоимость 
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии; 
												
										НовоеДвижениеПереоценки.СтоимостьВВалютеУчета = СуммаРынокВВалютеУчета
												- СтрокаПриходныхПартий.СтоимостьВВалютеУчета
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии; 
												
										НовоеДвижениеПереоценки.ПереоценкаВСтоимости = НовоеДвижениеПереоценки.Стоимость;
										
										Если НовоеДвижениеПерекурсовка <> Неопределено Тогда
											НовоеДвижениеПереоценки.СтоимостьВВалютеУчета = НовоеДвижениеПереоценки.СтоимостьВВалютеУчета
												- НовоеДвижениеПерекурсовка.СтоимостьВВалютеУчета;
										КонецЕсли;
											
									КонецЕсли;
									
								КонецЕсли;
								
								Если (НастройкиПоВидуУчета.НачислятьПроцентныеДоходыПоВыводимымАктивам ИЛИ НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей) И ЭтоРынокОблигаций
									И ВыборкаДетальныеЗаписи.ЦеннаяБумага.Эмитент <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Прайм") Тогда
								
									ЦенаКотировки = ПереоценкаПередВыводамиПродажами[0].ЦенаКотировкиКупона;
									
									Если ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынок = 0 Тогда
									
										ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынок = Справочники.Облигации.ПолучитьКупон(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ВыборкаДетальныеЗаписи.Период, СчетДоверительногоУправленияДляУчета);
										ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынокВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынок, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										
										ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынок = ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынок * ПереоценкаПередВыводамиПродажами[0].Количество;
										ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынокВВалютеУчета = ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынокВВалютеУчета * ПереоценкаПередВыводамиПродажами[0].Количество;
										
									КонецЕсли;
									
									СуммаКупонаРынок = ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынок / ПереоценкаПередВыводамиПродажами[0].Количество * КоличествоКСписаниюПоПартии;
									СуммаКупонаРынокВВалютеУчета = ПереоценкаПередВыводамиПродажами[0].СуммаКупонаРынокВВалютеУчета / ПереоценкаПередВыводамиПродажами[0].Количество * КоличествоКСписаниюПоПартии;
									
									Если УчитыватьПереоценкуОтдельноКупон Тогда
										
										НовоеДвижениеПереоценки.ПереоценкаКупона = СуммаКупонаРынок
												- (СтрокаПриходныхПартий.СтоимостьКупона + СтрокаПриходныхПартий.ПереоценкаКупона)
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии;  
												
										НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета = СуммаКупонаРынокВВалютеУчета
												- (СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета)
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии;
												
										Если НовоеДвижениеПерекурсовка <> Неопределено Тогда
											НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета = НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета
												- (НовоеДвижениеПерекурсовка.СтоимостьКупонаВВалютеУчета + НовоеДвижениеПерекурсовка.ПереоценкаКупонаВВалютеУчета);
										КонецЕсли;
											
									Иначе
												
										НовоеДвижениеПереоценки.СтоимостьКупона = СуммаКупонаРынок
												- СтрокаПриходныхПартий.СтоимостьКупона
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии; 
												
										НовоеДвижениеПереоценки.СтоимостьКупонаВВалютеУчета = СуммаКупонаРынокВВалютеУчета
												- СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета
												/ СтрокаПриходныхПартий.Количество
												* КоличествоКСписаниюПоПартии; 
										
										Если НовоеДвижениеПерекурсовка <> Неопределено Тогда
											НовоеДвижениеПереоценки.СтоимостьКупонаВВалютеУчета = НовоеДвижениеПереоценки.СтоимостьКупонаВВалютеУчета
												- НовоеДвижениеПерекурсовка.СтоимостьКупонаВВалютеУчета;
										КонецЕсли;
											
									КонецЕсли;
									
								КонецЕсли;
								
							ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) <> Тип("ДокументСсылка.ВыводЦенныхБумаг")
									И ДоначислятьКупонДоПолнойСтоимостиПередПродажейИПогашением Тогда // это не вывод - это продажа
								
								// хардкод для СНГ - согласно письму фонда, СНГ прекращает с 1го января 2020года учитывать УНКД отдельно и начинает учитывать "как все"
								_ОтражатьНаПереоценкеПолнуюСуммуКупон = ОтражатьНаПереоценкеПолнуюСуммуКупон;
								Если ЭтоКлиентСНГ Тогда
								
									Если СтрокаПриходныхПартий.ДатаПокупки < '20200101' Тогда
										_ОтражатьНаПереоценкеПолнуюСуммуКупон = Истина;
									Иначе
										_ОтражатьНаПереоценкеПолнуюСуммуКупон = Ложь;
									КонецЕсли;
								
								КонецЕсли;
								// хардкод для СНГ
								
								НовоеДвижениеПереоценкиКупона = ДоначислитьКупон(ВыборкаДетальныеЗаписи.Регистратор, 
																		ВыборкаДетальныеЗаписи.Период, 
																		СтрокаПриходныхПартий,
																		СуммаКупонаНаОднуОблигацию,
																		КоличествоКСписаниюПоПартии,
																		КурсНачисленияКупона,
																		ВыборкаДетальныеЗаписи.СтрокаПартии,
																		_ОтражатьНаПереоценкеПолнуюСуммуКупон,
																		Отказ);
																			
								Если Отказ Тогда
									Возврат;
								КонецЕсли;
								
							КонецЕсли;
							
							НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();
							
							ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПриходныхПартий);
							
							НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Расход;
							НовоеДвижение.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
							НовоеДвижение.Период = ВыборкаДетальныеЗаписи.Период;
							НовоеДвижение.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
							
							//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.СписаниеПартии;
							
							Если СтрокаПриходныхПартий.Количество <= КоличествоКСписанию Тогда
								ПриходныеПартииКУдалению.Добавить(СтрокаПриходныхПартий); //списали её всю
								КоличествоКСписанию = КоличествоКСписанию - СтрокаПриходныхПартий.Количество;
								
								Если НовоеДвижениеПерекурсовка <> Неопределено Тогда
									НовоеДвижение.СтоимостьВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижениеПерекурсовка.СтоимостьВВалютеУчета;
									НовоеДвижение.СтоимостьКупонаВВалютеУчета = НовоеДвижение.СтоимостьКупонаВВалютеУчета + НовоеДвижениеПерекурсовка.СтоимостьКупонаВВалютеУчета;
									НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + НовоеДвижениеПерекурсовка.ПереоценкаВВалютеУчета;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета = НовоеДвижение.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеПерекурсовка.ПереоценкаКупонаВВалютеУчета;
								КонецЕсли;
								
								Если НовоеДвижениеИндексация <> Неопределено Тогда
								
									НовоеДвижение.ИндексацияНоминала = НовоеДвижение.ИндексацияНоминала + НовоеДвижениеИндексация.ИндексацияНоминала;
									НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = НовоеДвижение.ИндексацияНоминалаЗаВремяВладения + НовоеДвижениеИндексация.ИндексацияНоминалаЗаВремяВладения;
								
								КонецЕсли;
								
								Если НовоеДвижениеПереоценкиКупона <> Неопределено Тогда
									
									НовоеДвижение.ПереоценкаКупона = НовоеДвижение.ПереоценкаКупона + НовоеДвижениеПереоценкиКупона.ПереоценкаКупона;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета = НовоеДвижение.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеПереоценкиКупона.ПереоценкаКупонаВВалютеУчета;
								
								КонецЕсли;
								
								Если НовоеДвижениеПереоценки <> Неопределено Тогда
								
									НовоеДвижение.Стоимость						= НовоеДвижение.Стоимость						+ НовоеДвижениеПереоценки.Стоимость;
									НовоеДвижение.СтоимостьВВалютеУчета			= НовоеДвижение.СтоимостьВВалютеУчета			+ НовоеДвижениеПереоценки.СтоимостьВВалютеУчета;
									НовоеДвижение.ПереоценкаВСтоимости			= НовоеДвижение.ПереоценкаВСтоимости			+ НовоеДвижениеПереоценки.ПереоценкаВСтоимости;
									НовоеДвижение.Переоценка					= НовоеДвижение.Переоценка						+ НовоеДвижениеПереоценки.Переоценка;
									НовоеДвижение.ПереоценкаВВалютеУчета		= НовоеДвижение.ПереоценкаВВалютеУчета			+ НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
									НовоеДвижение.СтоимостьКупона			 	= НовоеДвижение.СтоимостьКупона					+ НовоеДвижениеПереоценки.СтоимостьКупона;
									НовоеДвижение.СтоимостьКупонаВВалютеУчета	= НовоеДвижение.СтоимостьКупонаВВалютеУчета		+ НовоеДвижениеПереоценки.СтоимостьКупонаВВалютеУчета;
									НовоеДвижение.ПереоценкаКупона			 	= НовоеДвижение.ПереоценкаКупона				+ НовоеДвижениеПереоценки.ПереоценкаКупона;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета	= НовоеДвижение.ПереоценкаКупонаВВалютеУчета	+ НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета;
								
								КонецЕсли;
								
								//Последнюю партию спишем всю! Погрешности неоткуда взяться
								
								//Более того, если партия полностью списалась, можно и погрешности по ней не считать
								//Хотя я тут не до конца уверен, но я позже это обдумаю
								
								Для каждого СтрокаПогрешностиОкругления Из ПогрешностиОкругления Цикл
								
									Если СтрокаПогрешностиОкругления.ЦеннаяБумага = НовоеДвижение.ЦеннаяБумага
										 И СтрокаПогрешностиОкругления.Партия = НовоеДвижение.Партия
										 И СтрокаПогрешностиОкругления.СтрокаПартии = НовоеДвижение.СтрокаПартии
										 Тогда
									
										СтрокаПогрешностиОкругления.СтоимостьПокупки = 0;
										СтрокаПогрешностиОкругления.СтоимостьПокупкиКупона = 0;
										СтрокаПогрешностиОкругления.РасходыПриПокупкеВСтоимости = 0;
										СтрокаПогрешностиОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
										СтрокаПогрешностиОкругления.ПереоценкаВСтоимости = 0;
										СтрокаПогрешностиОкругления.ПереоценкаКупонаВСтоимости = 0;
										СтрокаПогрешностиОкругления.Стоимость = 0;
										СтрокаПогрешностиОкругления.СтоимостьВВалютеУчета = 0;
										СтрокаПогрешностиОкругления.СтоимостьКупона = 0;
										СтрокаПогрешностиОкругления.СтоимостьКупонаВВалютеУчета = 0;
										СтрокаПогрешностиОкругления.Переоценка = 0;
										СтрокаПогрешностиОкругления.ПереоценкаВВалютеУчета = 0;
										СтрокаПогрешностиОкругления.ПереоценкаКупона = 0;
										СтрокаПогрешностиОкругления.ПереоценкаКупонаВВалютеУчета = 0;
										СтрокаПогрешностиОкругления.СуммаЧастичногоПогашения = 0;
									
									КонецЕсли;
								
								КонецЦикла;
								
								Если ЭтоПрямоеРЕПО Тогда
									
									// сделаем движение по продаже РЕПО
									НовоеДвижениеРЕПО = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
									
									ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, НовоеДвижение);
									
									НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Приход;
									НовоеДвижениеРЕПО.ПродажаРЕПО = ВыборкаДетальныеЗаписи.Партия;
									НовоеДвижениеРЕПО.СтрокаПродажиРЕПО = ВыборкаДетальныеЗаписи.СтрокаПартии;
									
									// добавим партии РЕПО
									СтрокаПартииПроданныеВРЕПО = ПартииПроданныеВРЕПО.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаПартииПроданныеВРЕПО, НовоеДвижениеРЕПО);
									
								КонецЕсли;
								
							Иначе //спишем пропорционально
								
								КоэффициентСписания = КоличествоКСписанию / СтрокаПриходныхПартий.Количество;
								
								НовоеДвижение.Количество = КоличествоКСписанию;
								
								НовоеДвижение.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания;
								НовоеДвижение.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания;
								
								НовоеДвижение.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания;
								НовоеДвижение.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания;
								НовоеДвижение.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания;
								НовоеДвижение.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета * КоэффициентСписания;
								НовоеДвижение.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания;
								НовоеДвижение.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета * КоэффициентСписания;
								НовоеДвижение.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания;
								НовоеДвижение.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета * КоэффициентСписания;
								НовоеДвижение.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания;
								НовоеДвижение.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета * КоэффициентСписания;
								НовоеДвижение.СуммаЧастичногоПогашения = СтрокаПриходныхПартий.СуммаЧастичногоПогашения * КоэффициентСписания;
								НовоеДвижение.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала * КоэффициентСписания;
								НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения * КоэффициентСписания;
								
								Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
								
									НовоеДвижение.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания;
									НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания;
									
									Если ЭтоНалоговыйУчет И НастройкиУчета.РаспределениеПартийНУДолжноСовпадатьСЕПС И ЭтоРынокОблигаций Тогда // тут отдельная ветка
									
										//#414202 - согласно решению бухгалтерии если при частичном выводе(списании, продажи) партии СтоимостьПокупки или ДисконтПремияПокупки делятся
										// между выводимыми и остающимися бумагами с точностью 0,005 то остаться должно БОЛЬШЕ, а уйти МЕНЬШЕ 
										// Например: было 126337,50руб на 1010700 бумаг, выводим 11607 бумаг и сумма разбивается на 1450,875руб (выводим) и 124886,625руб (остается)
										// согласно решению вывести мы должны 1450,87руб, а остаться 124886,63руб
										// такое бывает только для бумаг по АС(у них может быть нецелая цена покупки) и когда из пртии с четным количеством выводим нечетную часть
										
										// тут повторен кусок кода из РассчитатьПартииЕПС - это нужно чтобы с ресурсов СтоимостьПокупки и РасходыПриПокупкеВСтоимости уходили те же суммы, что и в ЕПС
										// так как эти ресурсы у ЕПС и НУ идентичны
										
										СтоимостьПокупкиРасчетная = Окр(СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания, 15); // уберем дальние незаметные хвостики
										Если НовоеДвижение.СтоимостьПокупки > СтоимостьПокупкиРасчетная	И НовоеДвижение.СтоимостьПокупки - СтоимостьПокупкиРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.СтоимостьПокупки = НовоеДвижение.СтоимостьПокупки - 0.01;
										КонецЕсли;
										
										РасходыПриПокупкеВСтоимостиРасчетная = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания, 15);
										Если НовоеДвижение.РасходыПриПокупкеВСтоимости > РасходыПриПокупкеВСтоимостиРасчетная	И НовоеДвижение.РасходыПриПокупкеВСтоимости - РасходыПриПокупкеВСтоимостиРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.РасходыПриПокупкеВСтоимости = НовоеДвижение.РасходыПриПокупкеВСтоимости - 0.01;
										КонецЕсли;
										
										РасходыПриПокупкеВСтоимостиВВалютеУчетаРасчетная = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания, 15);
										Если НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета > РасходыПриПокупкеВСтоимостиВВалютеУчетаРасчетная	И НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета - РасходыПриПокупкеВСтоимостиВВалютеУчетаРасчетная = 0.005 Тогда // округлилось в большую сторону с точностью 0,005 
											НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета - 0.01;
										КонецЕсли;
										
										НовоеДвижение.Стоимость = НовоеДвижение.СтоимостьПокупки + НовоеДвижение.РасходыПриПокупкеВСтоимости;
										
										Если ВалютаНоминала = ВалютаУчета Тогда
											НовоеДвижение.СтоимостьВВалютеУчета = НовоеДвижение.Стоимость
										Иначе
											НовоеДвижение.СтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.Стоимость, ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										КонецЕсли;
										
									ИначеЕсли НовоеДвижение.СтоимостьПокупки <> НовоеДвижение.Стоимость - НовоеДвижение.РасходыПриПокупкеВСтоимости - НовоеДвижение.ПереоценкаВСтоимости Тогда
										
										НовоеДвижение.РасходыПриПокупкеВСтоимости = НовоеДвижение.Стоимость - НовоеДвижение.СтоимостьПокупки - НовоеДвижение.ПереоценкаВСтоимости;
										
										Если ВалютаНоминала = ВалютаУчета Тогда
											НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = НовоеДвижение.РасходыПриПокупкеВСтоимости;
										Иначе
											НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета
																									- РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.СтоимостьПокупки, ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ)
																									- РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НовоеДвижение.ПереоценкаВСтоимости, ВалютаНоминала, Организация, ВыборкаДетальныеЗаписи.Период, Отказ);
										КонецЕсли;
										
									КонецЕсли;
								Иначе //раз не включены то и не списываем
									НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
									НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
								КонецЕсли;
								
								Если НовоеДвижениеИндексация <> Неопределено Тогда
								
									НовоеДвижение.ИндексацияНоминала = НовоеДвижение.ИндексацияНоминала + НовоеДвижениеИндексация.ИндексацияНоминала;
									НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = НовоеДвижение.ИндексацияНоминалаЗаВремяВладения + НовоеДвижениеИндексация.ИндексацияНоминалаЗаВремяВладения;
								
								КонецЕсли;
								
								Если НастройкиУчета.УчитыватьПогрешностьСложенияСтоимостиИПереоценкиЦеннойБумаги Тогда
								
									// мы пропорционально списываем части стоимости бумаги и к сожалению можем попасть на округление, нужно это учесть т.к. при выводе например мы должны биться со СЧА по общей сумме вывода
									// для всех бумаг куски стоимости это Стоимость и Переоценка
									ОбщаяСумма = СтрокаПриходныхПартий.Стоимость + СтрокаПриходныхПартий.Переоценка;
									ОбщаяСуммаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета + СтрокаПриходныхПартий.ПереоценкаВВалютеУчета;
									
									СуммаСписания = НовоеДвижение.Стоимость + НовоеДвижение.Переоценка;
									СуммаСписанияВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижение.ПереоценкаВВалютеУчета;
									
									ОбщаяСумма = Окр(ОбщаяСумма * КоэффициентСписания, 2);
									ОбщаяСуммаВВалютеУчета = Окр(ОбщаяСуммаВВалютеУчета * КоэффициентСписания, 2);
									
									Если ОбщаяСумма <> СуммаСписания Тогда
										НовоеДвижение.Переоценка = НовоеДвижение.Переоценка + ОбщаяСумма - СуммаСписания;
									КонецЕсли;
									Если ОбщаяСуммаВВалютеУчета <> СуммаСписанияВВалютеУчета Тогда
										НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + ОбщаяСуммаВВалютеУчета - СуммаСписанияВВалютеУчета;
									КонецЕсли;
								
								КонецЕсли;
								
								Если НастройкиПоВидуУчета.УчитыватьПогрешностьОкругленияПриПродаже И НЕ НастройкиПоВидуУчета.ПереоцениватьАктивыПередПродажей Тогда // если стоит ПереоцениватьАктивыПередПродажей, то не нужно усреднять усредняется при переоценке
									
									// Сколько мы списали по каждой партии
									СтрокиСписанийПартии = ЭтотОбъект.РассчитанныеПартии.НайтиСтроки(Новый Структура("Партия,СтрокаПартии", СтрокаПриходныхПартий.Партия, СтрокаПриходныхПартий.СтрокаПартии));
									
									БылоСписано = Новый Структура("Количество,СтоимостьПокупки,СтоимостьПокупкиКупона,ПереоценкаВСтоимости,ПереоценкаКупонаВСтоимости,
										|Стоимость,СтоимостьВВалютеУчета,СтоимостьКупона,СтоимостьКупонаВВалютеУчета,Переоценка,ПереоценкаВВалютеУчета,ПереоценкаКупона,ПереоценкаКупонаВВалютеУчета,СуммаЧастичногоПогашения",
										0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
										
									БылоПогашениеКупона = Ложь;
									Для каждого СтрокаСписанийПартии Из СтрокиСписанийПартии Цикл
										// берем только наш день
										Если НачалоДня(НовоеДвижение.Период) = НачалоДня(СтрокаСписанийПартии.Период) Тогда
											
											Если ТипЗнч(СтрокаСписанийПартии.Регистратор) = Тип("ДокументСсылка.ПогашениеКупона") Тогда
												БылоПогашениеКупона = Истина;
											КонецЕсли;
											
											Если СтрокаСписанийПартии.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
												ЗнакДвижения = 1;
											ИначеЕсли СтрокаСписанийПартии.ВидДвижения = Перечисления.ВидыДвижений.Приход И ЗначениеЗаполнено(СтрокаСписанийПартии.Регистратор) Тогда
												ЗнакДвижения = -1;
											Иначе
												Продолжить;
											КонецЕсли;
											
											Для каждого РесурсБылоСписано Из БылоСписано Цикл
											
												БылоСписано[РесурсБылоСписано.Ключ] = БылоСписано[РесурсБылоСписано.Ключ] + ЗнакДвижения * СтрокаСписанийПартии[РесурсБылоСписано.Ключ];
											
											КонецЦикла;
										
										КонецЕсли;
										
									КонецЦикла;
									
									Если НовоеДвижениеПереоценки <> Неопределено Тогда
									
										БылоСписано["Стоимость"]					= БылоСписано["Стоимость"]						+ НовоеДвижениеПереоценки.Стоимость;
										БылоСписано["СтоимостьВВалютеУчета"]		= БылоСписано["СтоимостьВВалютеУчета"]			+ НовоеДвижениеПереоценки.СтоимостьВВалютеУчета;
										БылоСписано["ПереоценкаВСтоимости"]			= БылоСписано["ПереоценкаВСтоимости"]			+ НовоеДвижениеПереоценки.ПереоценкаВСтоимости;
										БылоСписано["Переоценка"]					= БылоСписано["Переоценка"]						+ НовоеДвижениеПереоценки.Переоценка;
										БылоСписано["ПереоценкаВВалютеУчета"]		= БылоСписано["ПереоценкаВВалютеУчета"]			+ НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
										БылоСписано["СтоимостьКупона"]			 	= БылоСписано["СтоимостьКупона"]				+ НовоеДвижениеПереоценки.СтоимостьКупона;
										БылоСписано["СтоимостьКупонаВВалютеУчета"]	= БылоСписано["СтоимостьКупонаВВалютеУчета"]	+ НовоеДвижениеПереоценки.СтоимостьКупонаВВалютеУчета;
										БылоСписано["ПереоценкаКупона"]			 	= БылоСписано["ПереоценкаКупона"]				+ НовоеДвижениеПереоценки.ПереоценкаКупона;
										БылоСписано["ПереоценкаКупонаВВалютеУчета"]	= БылоСписано["ПереоценкаКупонаВВалютеУчета"]	+ НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета;
									
									КонецЕсли;
									
									Если БылоСписано.Количество > КоличествоКСписанию Тогда // т.е. у на уже не 1ое списание - могут появиться округления
										// Это некий общий коэффициент списания для всех списание по партии за день 
										ОбщийКоэффициентСписания = БылоСписано.Количество / (СтрокаПриходныхПартий.Количество + БылоСписано.Количество - НовоеДвижение.Количество);
										
										Для каждого РесурсБылоСписано Из БылоСписано Цикл
											
											Если БылоПогашениеКупона И // купон уже списан - корректировать нечего
												(РесурсБылоСписано.Ключ = "СтоимостьПокупкиКупона" 
													ИЛИ РесурсБылоСписано.Ключ = "ПереоценкаКупонаВСтоимости" 
													ИЛИ РесурсБылоСписано.Ключ = "СтоимостьКупона"
													ИЛИ РесурсБылоСписано.Ключ = "СтоимостьКупонаВВалютеУчета"
													ИЛИ РесурсБылоСписано.Ключ = "ПереоценкаКупона"
													ИЛИ РесурсБылоСписано.Ключ = "ПереоценкаКупонаВВалютеУчета") Тогда
											
												Продолжить;
											
											КонецЕсли;
											
											// сколько мы могли бы списать, если бы продавали одной сделкой, а не несколькими
											ДолжноБытьСписано = Окр((СтрокаПриходныхПартий[РесурсБылоСписано.Ключ] - НовоеДвижение[РесурсБылоСписано.Ключ] + РесурсБылоСписано.Значение) * ОбщийКоэффициентСписания, 2, РежимОкругления.Окр15как10);
											Если ДолжноБытьСписано <> РесурсБылоСписано.Значение Тогда // откорректируем сумму списания
												НовоеДвижение[РесурсБылоСписано.Ключ] = НовоеДвижение[РесурсБылоСписано.Ключ] + (ДолжноБытьСписано - РесурсБылоСписано.Значение);
											КонецЕсли;
										
										КонецЦикла;
									КонецЕсли;
									
								КонецЕсли;
								
								Если НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий > 2 Тогда
									//для валютных сумм не делаю пока
									КоэффициентСписания = КоличествоКСписанию / СтрокаПриходныхПартий.Количество;
									
									Если (СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания - Окр(СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания - Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания - Окр(СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания - Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.Стоимость * КоэффициентСписания - Окр(СтрокаПриходныхПартий.Стоимость * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания - Окр(СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.Переоценка * КоэффициентСписания - Окр(СтрокаПриходныхПартий.Переоценка * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания - Окр(СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания, 2) <> 0)
										ИЛИ (СтрокаПриходныхПартий.СуммаЧастичногоПогашения * КоэффициентСписания - Окр(СтрокаПриходныхПартий.СуммаЧастичногоПогашения * КоэффициентСписания, 2) <> 0)
										Тогда
										
										ПогрешностьОкругления = ПогрешностиОкругления.Добавить();
										
										ЗаполнитьЗначенияСвойств(ПогрешностьОкругления, НовоеДвижение);
										ПогрешностьОкругления.ВидДвижения = Перечисления.ВидыДвижений.Расход;
										ПогрешностьОкругления.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
										ПогрешностьОкругления.Период = ВыборкаДетальныеЗаписи.Период;
										ПогрешностьОкругления.СтрокаКорзиныЦенныхБумаг = ВыборкаДетальныеЗаписи.СтрокаПартии;
											
										НовоеДвижение.СтоимостьПокупки = Окр(СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания, 2);
										ПогрешностьОкругления.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки * КоэффициентСписания - НовоеДвижение.СтоимостьПокупки;
											
										НовоеДвижение.СтоимостьПокупкиКупона = Окр(СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания, 2);
										ПогрешностьОкругления.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона * КоэффициентСписания - НовоеДвижение.СтоимостьПокупкиКупона;
										
										Если НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость Тогда
											НовоеДвижение.РасходыПриПокупкеВСтоимости = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания, 2);
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости * КоэффициентСписания - НовоеДвижение.РасходыПриПокупкеВСтоимости;
											
											НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = Окр(СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания, 2);
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета * КоэффициентСписания - НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета;
										Иначе
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимости = 0;
											ПогрешностьОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
										КонецЕсли; 
										
										НовоеДвижение.ПереоценкаВСтоимости = Окр(СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания, 2);
										ПогрешностьОкругления.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости * КоэффициентСписания - НовоеДвижение.ПереоценкаВСтоимости;
										
										НовоеДвижение.ПереоценкаКупонаВСтоимости = Окр(СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания, 2);
										ПогрешностьОкругления.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости * КоэффициентСписания - НовоеДвижение.ПереоценкаКупонаВСтоимости;
										
										НовоеДвижение.Стоимость = Окр(СтрокаПриходныхПартий.Стоимость * КоэффициентСписания, 2);
										ПогрешностьОкругления.Стоимость = СтрокаПриходныхПартий.Стоимость * КоэффициентСписания - НовоеДвижение.Стоимость;
										
										НовоеДвижение.СтоимостьКупона = Окр(СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания, 2);
										ПогрешностьОкругления.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона * КоэффициентСписания - НовоеДвижение.СтоимостьКупона;
										
										НовоеДвижение.Переоценка = Окр(СтрокаПриходныхПартий.Переоценка * КоэффициентСписания, 2);
										ПогрешностьОкругления.Переоценка = СтрокаПриходныхПартий.Переоценка * КоэффициентСписания - НовоеДвижение.Переоценка;
										
										НовоеДвижение.ПереоценкаКупона = Окр(СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания, 2);
										ПогрешностьОкругления.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона * КоэффициентСписания - НовоеДвижение.ПереоценкаКупона;
										
										НовоеДвижение.СуммаЧастичногоПогашения = Окр(СтрокаПриходныхПартий.СуммаЧастичногоПогашения * КоэффициентСписания, 2);
										ПогрешностьОкругления.СуммаЧастичногоПогашения = СтрокаПриходныхПартий.СуммаЧастичногоПогашения * КоэффициентСписания - НовоеДвижение.СуммаЧастичногоПогашения;
										
									КонецЕсли;
								КонецЕсли;
								
								СтрокаПриходныхПартий.СтоимостьПокупки = СтрокаПриходныхПартий.СтоимостьПокупки - НовоеДвижение.СтоимостьПокупки;
								СтрокаПриходныхПартий.СтоимостьПокупкиКупона = СтрокаПриходныхПартий.СтоимостьПокупкиКупона - НовоеДвижение.СтоимостьПокупкиКупона;
								СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимости - НовоеДвижение.РасходыПриПокупкеВСтоимости;
								СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета = СтрокаПриходныхПартий.РасходыПриПокупкеВСтоимостиВВалютеУчета - НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета;
								
								СтрокаПриходныхПартий.ПереоценкаВСтоимости = СтрокаПриходныхПартий.ПереоценкаВСтоимости - НовоеДвижение.ПереоценкаВСтоимости;
								СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости = СтрокаПриходныхПартий.ПереоценкаКупонаВСтоимости - НовоеДвижение.ПереоценкаКупонаВСтоимости;
								СтрокаПриходныхПартий.Стоимость = СтрокаПриходныхПартий.Стоимость - НовоеДвижение.Стоимость;
								СтрокаПриходныхПартий.СтоимостьВВалютеУчета = СтрокаПриходныхПартий.СтоимостьВВалютеУчета - НовоеДвижение.СтоимостьВВалютеУчета;
								СтрокаПриходныхПартий.СтоимостьКупона = СтрокаПриходныхПартий.СтоимостьКупона - НовоеДвижение.СтоимостьКупона;
								СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета = СтрокаПриходныхПартий.СтоимостьКупонаВВалютеУчета - НовоеДвижение.СтоимостьКупонаВВалютеУчета;
								СтрокаПриходныхПартий.Переоценка = СтрокаПриходныхПартий.Переоценка - НовоеДвижение.Переоценка;
								СтрокаПриходныхПартий.ПереоценкаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаВВалютеУчета - НовоеДвижение.ПереоценкаВВалютеУчета;
								СтрокаПриходныхПартий.ПереоценкаКупона = СтрокаПриходныхПартий.ПереоценкаКупона - НовоеДвижение.ПереоценкаКупона;
								СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета = СтрокаПриходныхПартий.ПереоценкаКупонаВВалютеУчета - НовоеДвижение.ПереоценкаКупонаВВалютеУчета;
								СтрокаПриходныхПартий.СуммаЧастичногоПогашения = СтрокаПриходныхПартий.СуммаЧастичногоПогашения - НовоеДвижение.СуммаЧастичногоПогашения;
								СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала - НовоеДвижение.ИндексацияНоминала;
								СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения - НовоеДвижение.ИндексацияНоминалаЗаВремяВладения;
								
								//добавим перекурсовку
								Если НовоеДвижениеПерекурсовка <> Неопределено Тогда
									НовоеДвижение.СтоимостьВВалютеУчета = НовоеДвижение.СтоимостьВВалютеУчета + НовоеДвижениеПерекурсовка.СтоимостьВВалютеУчета;
									НовоеДвижение.СтоимостьКупонаВВалютеУчета = НовоеДвижение.СтоимостьКупонаВВалютеУчета + НовоеДвижениеПерекурсовка.СтоимостьКупонаВВалютеУчета;
									НовоеДвижение.ПереоценкаВВалютеУчета = НовоеДвижение.ПереоценкаВВалютеУчета + НовоеДвижениеПерекурсовка.ПереоценкаВВалютеУчета;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета = НовоеДвижение.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеПерекурсовка.ПереоценкаКупонаВВалютеУчета;
								КонецЕсли;
								
								//добавим индексацию номинала
								Если НовоеДвижениеИндексация <> Неопределено Тогда
									СтрокаПриходныхПартий.ИндексацияНоминала = СтрокаПриходныхПартий.ИндексацияНоминала + НовоеДвижениеИндексация.ИндексацияНоминала;
									СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения = СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения + НовоеДвижениеИндексация.ИндексацияНоминалаЗаВремяВладения;
								КонецЕсли;
								
								//добавим переоценку НКД
								Если НовоеДвижениеПереоценкиКупона <> Неопределено Тогда
									
									НовоеДвижение.ПереоценкаКупона = НовоеДвижение.ПереоценкаКупона + НовоеДвижениеПереоценкиКупона.ПереоценкаКупона;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета = НовоеДвижение.ПереоценкаКупонаВВалютеУчета + НовоеДвижениеПереоценкиКупона.ПереоценкаКупонаВВалютеУчета;
								
								КонецЕсли;
								
								Если НовоеДвижениеПереоценки <> Неопределено Тогда
								
									НовоеДвижение.Стоимость						= НовоеДвижение.Стоимость						+ НовоеДвижениеПереоценки.Стоимость;
									НовоеДвижение.СтоимостьВВалютеУчета			= НовоеДвижение.СтоимостьВВалютеУчета			+ НовоеДвижениеПереоценки.СтоимостьВВалютеУчета;
									НовоеДвижение.Переоценка					= НовоеДвижение.Переоценка						+ НовоеДвижениеПереоценки.Переоценка;
									НовоеДвижение.ПереоценкаВСтоимости			= НовоеДвижение.ПереоценкаВСтоимости			+ НовоеДвижениеПереоценки.ПереоценкаВСтоимости;
									НовоеДвижение.ПереоценкаВВалютеУчета		= НовоеДвижение.ПереоценкаВВалютеУчета			+ НовоеДвижениеПереоценки.ПереоценкаВВалютеУчета;
									НовоеДвижение.СтоимостьКупона			 	= НовоеДвижение.СтоимостьКупона					+ НовоеДвижениеПереоценки.СтоимостьКупона;
									НовоеДвижение.СтоимостьКупонаВВалютеУчета	= НовоеДвижение.СтоимостьКупонаВВалютеУчета		+ НовоеДвижениеПереоценки.СтоимостьКупонаВВалютеУчета;
									НовоеДвижение.ПереоценкаКупона			 	= НовоеДвижение.ПереоценкаКупона				+ НовоеДвижениеПереоценки.ПереоценкаКупона;
									НовоеДвижение.ПереоценкаКупонаВВалютеУчета	= НовоеДвижение.ПереоценкаКупонаВВалютеУчета	+ НовоеДвижениеПереоценки.ПереоценкаКупонаВВалютеУчета;
								
								КонецЕсли;
								
								СтрокаПриходныхПартий.Количество = СтрокаПриходныхПартий.Количество - НовоеДвижение.Количество;
								
								Если ЭтоПрямоеРЕПО Тогда
									
									// сделаем движение по продаже РЕПО
									НовоеДвижениеРЕПО = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
									
									ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПО, НовоеДвижение);
									
									НовоеДвижениеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Приход;
									НовоеДвижениеРЕПО.ПродажаРЕПО = ВыборкаДетальныеЗаписи.Партия;
									НовоеДвижениеРЕПО.СтрокаПродажиРЕПО = ВыборкаДетальныеЗаписи.СтрокаПартии;
									
									// добавим партии РЕПО
									СтрокаПартииПроданныеВРЕПО = ПартииПроданныеВРЕПО.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаПартииПроданныеВРЕПО, НовоеДвижениеРЕПО);
									
								КонецЕсли;
								
								КоличествоКСписанию = 0;
								
								Прервать;
								
							КонецЕсли;
							
						КонецЦикла;
						
						Для каждого СтрокаПриходныхПартийКУдалению Из ПриходныеПартииКУдалению Цикл
							ПриходныеПартии.Удалить(СтрокаПриходныхПартийКУдалению);
						КонецЦикла;
						
						
						Если КоличествоКСписанию > 0 Тогда
							
							Если ЭтоПрямоеРЕПО ИЛИ НастройкиПоВидуУчета.РазрешеноОткрыватьКороткиеПозиции Тогда // будем продавать РЕПОшные партии
								
								ПартииКупленныеПоРЕПОКУдалению = Новый Массив;
								
								ПартииКупленныеПоРЕПОПоСделке = ПартииКупленныеПоРЕПО.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаДетальныеЗаписи.ЦеннаяБумага));
								
								Для каждого СтрокаПартииКупленныеПоРЕПОПоСделке Из ПартииКупленныеПоРЕПОПоСделке Цикл
									
									Если КоличествоКСписанию = 0 Тогда
										Прервать;
									КонецЕсли;
									
									Если СтрокаПартииКупленныеПоРЕПОПоСделке.Количество <= КоличествоКСписанию Тогда
									
										// запомним, что удалить надо из репошных 
										ПартииКупленныеПоРЕПОКУдалению.Добавить(СтрокаПартииКупленныеПоРЕПОПоСделке);
										
										// движение по партиям РЕПО расход сделать
										НовоеДвижениеРЕПООбратноеРЕПО = РассчитанныеПартииОбратноеРЕПО.Добавить();
										ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПООбратноеРЕПО, СтрокаПартииКупленныеПоРЕПОПоСделке);
										
										НовоеДвижениеРЕПООбратноеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
										НовоеДвижениеРЕПООбратноеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
										НовоеДвижениеРЕПООбратноеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
										НовоеДвижениеРЕПООбратноеРЕПО.СтрокаКорзиныЦенныхБумаг = СтрокаПартииКупленныеПоРЕПОПоСделке.СтрокаПартии;
										
										
										КоличествоКСписанию = КоличествоКСписанию - СтрокаПартииКупленныеПоРЕПОПоСделке.Количество;
										
									Иначе
										
										// пропорционально
										// движение по партиям РЕПО расход сделать
										НовоеДвижениеРЕПООбратноеРЕПО = РассчитанныеПартииОбратноеРЕПО.Добавить();
										ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПООбратноеРЕПО, СтрокаПартииКупленныеПоРЕПОПоСделке);
										
										НовоеДвижениеРЕПООбратноеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Расход;
										НовоеДвижениеРЕПООбратноеРЕПО.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
										НовоеДвижениеРЕПООбратноеРЕПО.Период = ВыборкаДетальныеЗаписи.Период;
										НовоеДвижениеРЕПООбратноеРЕПО.СтрокаКорзиныЦенныхБумаг = СтрокаПартииКупленныеПоРЕПОПоСделке.СтрокаПартии;
										
										НовоеДвижениеРЕПООбратноеРЕПО.Количество = КоличествоКСписанию;
										
										НовоеДвижениеРЕПООбратноеРЕПО.Стоимость = СтрокаПартииКупленныеПоРЕПОПоСделке.Стоимость / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										НовоеДвижениеРЕПООбратноеРЕПО.СтоимостьВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьВВалютеУчета / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										НовоеДвижениеРЕПООбратноеРЕПО.СтоимостьКупона = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупона / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										НовоеДвижениеРЕПООбратноеРЕПО.СтоимостьКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупонаВВалютеУчета / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										НовоеДвижениеРЕПООбратноеРЕПО.Переоценка = СтрокаПартииКупленныеПоРЕПОПоСделке.Переоценка / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										НовоеДвижениеРЕПООбратноеРЕПО.ПереоценкаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаВВалютеУчета / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										НовоеДвижениеРЕПООбратноеРЕПО.ПереоценкаКупона = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупона / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										НовоеДвижениеРЕПООбратноеРЕПО.ПереоценкаКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупонаВВалютеУчета / СтрокаПартииКупленныеПоРЕПОПоСделке.Количество * КоличествоКСписанию;
										
										КоличествоКСписанию = 0;
										
										СтрокаПартииКупленныеПоРЕПОПоСделке.Количество = СтрокаПартииКупленныеПоРЕПОПоСделке.Количество - НовоеДвижениеРЕПООбратноеРЕПО.Количество;
										
										СтрокаПартииКупленныеПоРЕПОПоСделке.Стоимость = СтрокаПартииКупленныеПоРЕПОПоСделке.Стоимость - НовоеДвижениеРЕПООбратноеРЕПО.Стоимость;
										СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьВВалютеУчета - НовоеДвижениеРЕПООбратноеРЕПО.СтоимостьВВалютеУчета;
										СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупона = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупона - НовоеДвижениеРЕПООбратноеРЕПО.СтоимостьКупона;
										СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.СтоимостьКупонаВВалютеУчета - НовоеДвижениеРЕПООбратноеРЕПО.СтоимостьКупонаВВалютеУчета;
										СтрокаПартииКупленныеПоРЕПОПоСделке.Переоценка = СтрокаПартииКупленныеПоРЕПОПоСделке.Переоценка - НовоеДвижениеРЕПООбратноеРЕПО.Переоценка;
										СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаВВалютеУчета - НовоеДвижениеРЕПООбратноеРЕПО.ПереоценкаВВалютеУчета;
										СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупона = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупона - НовоеДвижениеРЕПООбратноеРЕПО.ПереоценкаКупона;
										СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупонаВВалютеУчета = СтрокаПартииКупленныеПоРЕПОПоСделке.ПереоценкаКупонаВВалютеУчета - НовоеДвижениеРЕПООбратноеРЕПО.ПереоценкаКупонаВВалютеУчета;
										
									КонецЕсли;
									
									Если ЭтоПрямоеРЕПО Тогда // у нас РЕПОвРЕПО получилось
									
										// сделаем движение по продаже РЕПО
										НовоеДвижениеРЕПОПрямоеРЕПО = ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО.Добавить();
										
										ЗаполнитьЗначенияСвойств(НовоеДвижениеРЕПОПрямоеРЕПО, НовоеДвижениеРЕПООбратноеРЕПО);
										
										НовоеДвижениеРЕПОПрямоеРЕПО.ВидДвижения = Перечисления.ВидыДвижений.Приход;
										НовоеДвижениеРЕПОПрямоеРЕПО.ПродажаРЕПО = ВыборкаДетальныеЗаписи.Партия;
										НовоеДвижениеРЕПОПрямоеРЕПО.СтрокаПродажиРЕПО = ВыборкаДетальныеЗаписи.СтрокаПартии;
										
										// добавим партии РЕПО
										СтрокаПартииПроданныеВРЕПО = ПартииПроданныеВРЕПО.Добавить();
										ЗаполнитьЗначенияСвойств(СтрокаПартииПроданныеВРЕПО, НовоеДвижениеРЕПОПрямоеРЕПО);
									
									КонецЕсли;
									
								КонецЦикла;
								
								Для каждого СтрокаПартииКупленныеПоРЕПОКУдалению Из ПартииКупленныеПоРЕПОКУдалению Цикл
									ПартииКупленныеПоРЕПО.Удалить(СтрокаПартииКупленныеПоРЕПОКУдалению);
								КонецЦикла;
								
							КонецЕсли;
							
							Если КоличествоКСписанию > 0 Тогда
							
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не распределилась: " + Строка(ВыборкаДетальныеЗаписи.ЦеннаяБумага) + " по " + Строка(ВыборкаДетальныеЗаписи.Регистратор), ВыборкаДетальныеЗаписи.Регистратор);
								Сообщить(КоличествоКСписанию);
								Отказ = Истина;
							
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;		
				КонецЕсли;
			КонецЦикла;
			
			Если НастройкиПоВидуУчета.МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимости.ПоСреднему
				И ПриходныеПартии.Количество() > 1 Тогда
				
				ПартииНаНачалоДня = ПриходныеПартии[0];
				ПриходнаяПартия = ПриходныеПартии[1];
				
				Для каждого РеквизитПартий Из Метаданные.РегистрыНакопления.БухПартииЦенныхБумаг.Ресурсы Цикл
					Если РесурсыПартий.Найти(РеквизитПартий.Имя) <> Неопределено Тогда 
						ПартииНаНачалоДня[РеквизитПартий.Имя] = ПартииНаНачалоДня[РеквизитПартий.Имя] + ПриходнаяПартия[РеквизитПартий.Имя];
						ПриходнаяПартия[РеквизитПартий.Имя] = 0;
					КонецЕсли;
				КонецЦикла;
				
				ПриходныеПартии.Удалить(ПриходнаяПартия);
			КонецЕсли;
			
			// ПогрешностиОкругления
			// обработаем их
			Если НастройкиПоВидуУчета.ТочностьРасчетаСтоимостиПартий > 2 Тогда
				// тут будем накапливать погрешность
				ПогрешностьСтоимостьПокупки				= 0;
				ПогрешностьСтоимостьПокупкиКупона		= 0;
				ПогрешностьРасходыПриПокупкеВСтоимости	= 0;
				ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета	= 0;
				ПогрешностьПереоценкаВСтоимости			= 0;
				ПогрешностьПереоценкаКупонаВСтоимости	= 0;
				ПогрешностьСтоимость					= 0;
				ПогрешностьСтоимостьКупона				= 0;
				ПогрешностьПереоценка					= 0;
				ПогрешностьПереоценкаКупона				= 0;
				ПогрешностьСуммаЧастичногоПогашения		= 0;
				
				Для каждого СтрокаПогрешностиОкругления Из ПогрешностиОкругления Цикл
					
					ПогрешностьСтоимостьПокупки				= ПогрешностьСтоимостьПокупки				+ СтрокаПогрешностиОкругления.СтоимостьПокупки;
					ПогрешностьСтоимостьПокупкиКупона		= ПогрешностьСтоимостьПокупкиКупона			+ СтрокаПогрешностиОкругления.СтоимостьПокупкиКупона;
					ПогрешностьРасходыПриПокупкеВСтоимости	= ПогрешностьРасходыПриПокупкеВСтоимости	+ СтрокаПогрешностиОкругления.РасходыПриПокупкеВСтоимости;
					ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета	= ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета	+ СтрокаПогрешностиОкругления.РасходыПриПокупкеВСтоимостиВВалютеУчета;
					ПогрешностьПереоценкаВСтоимости			= ПогрешностьПереоценкаВСтоимости			+ СтрокаПогрешностиОкругления.ПереоценкаВСтоимости;
					ПогрешностьПереоценкаКупонаВСтоимости	= ПогрешностьПереоценкаКупонаВСтоимости		+ СтрокаПогрешностиОкругления.ПереоценкаКупонаВСтоимости;
					ПогрешностьСтоимость					= ПогрешностьСтоимость						+ СтрокаПогрешностиОкругления.Стоимость;
					ПогрешностьСтоимостьКупона				= ПогрешностьСтоимостьКупона				+ СтрокаПогрешностиОкругления.СтоимостьКупона;
					ПогрешностьПереоценка					= ПогрешностьПереоценка						+ СтрокаПогрешностиОкругления.Переоценка;
					ПогрешностьПереоценкаКупона				= ПогрешностьПереоценкаКупона				+ СтрокаПогрешностиОкругления.ПереоценкаКупона;
					ПогрешностьСуммаЧастичногоПогашения		= ПогрешностьСуммаЧастичногоПогашения		+ СтрокаПогрешностиОкругления.СуммаЧастичногоПогашения;
					
					Если ПогрешностьСтоимостьПокупки > 0.01 ИЛИ ПогрешностьСтоимостьПокупки < -0.01
						ИЛИ ПогрешностьСтоимостьПокупкиКупона > 0.01 ИЛИ ПогрешностьСтоимостьПокупкиКупона < -0.01
						ИЛИ ПогрешностьРасходыПриПокупкеВСтоимости > 0.01 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимости < -0.01
						ИЛИ ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета > 0.01 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета < -0.01
						ИЛИ ПогрешностьПереоценкаВСтоимости > 0.01 ИЛИ ПогрешностьПереоценкаВСтоимости < -0.01
						ИЛИ ПогрешностьПереоценкаКупонаВСтоимости > 0.01 ИЛИ ПогрешностьПереоценкаКупонаВСтоимости < -0.01
						ИЛИ ПогрешностьСтоимость > 0.01 ИЛИ ПогрешностьСтоимость < -0.01
						ИЛИ ПогрешностьСтоимостьКупона > 0.01 ИЛИ ПогрешностьСтоимостьКупона < -0.01
						ИЛИ ПогрешностьПереоценка > 0.01 ИЛИ ПогрешностьПереоценка < -0.01
						ИЛИ ПогрешностьПереоценкаКупона > 0.01 ИЛИ ПогрешностьПереоценкаКупона < -0.01
						ИЛИ ПогрешностьСуммаЧастичногоПогашения > 0.01 ИЛИ ПогрешностьСуммаЧастичногоПогашения < -0.01 	Тогда
					
						НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();						
						
						ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПогрешностиОкругления);
						
						//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.УчетПогрешностиОкругления;
						
						//НовоеДвижение.СписаниеПогрешностиОкругления = Истина;
						НовоеДвижение.Количество = 0;
						
						Если ПогрешностьСтоимостьПокупки > 0.01 ИЛИ ПогрешностьСтоимостьПокупки < -0.01 Тогда
							НовоеДвижение.СтоимостьПокупки = Окр(ПогрешностьСтоимостьПокупки, 2);
							ПогрешностьСтоимостьПокупки = ПогрешностьСтоимостьПокупки - Окр(ПогрешностьСтоимостьПокупки, 2);
						Иначе
							НовоеДвижение.СтоимостьПокупки = 0;
						КонецЕсли;
						Если ПогрешностьСтоимостьПокупкиКупона > 0.01 ИЛИ ПогрешностьСтоимостьПокупкиКупона < -0.01 Тогда
							НовоеДвижение.СтоимостьПокупкиКупона = Окр(ПогрешностьСтоимостьПокупкиКупона, 2);
							ПогрешностьСтоимостьПокупкиКупона = ПогрешностьСтоимостьПокупкиКупона - Окр(ПогрешностьСтоимостьПокупкиКупона, 2);
						Иначе
							НовоеДвижение.СтоимостьПокупкиКупона = 0;
						КонецЕсли;
						Если ПогрешностьРасходыПриПокупкеВСтоимости > 0.01 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимости < -0.01 Тогда
							НовоеДвижение.РасходыПриПокупкеВСтоимости = Окр(ПогрешностьРасходыПриПокупкеВСтоимости, 2);
							ПогрешностьРасходыПриПокупкеВСтоимости = ПогрешностьРасходыПриПокупкеВСтоимости - Окр(ПогрешностьРасходыПриПокупкеВСтоимости, 2);
						Иначе
							НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
						КонецЕсли;
						Если ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета > 0.01 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета < -0.01 Тогда
							НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = Окр(ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета, 2);
							ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета = ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета - Окр(ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета, 2);
						Иначе
							НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
						КонецЕсли;
						Если ПогрешностьПереоценкаВСтоимости > 0.01 ИЛИ ПогрешностьПереоценкаВСтоимости < -0.01 Тогда
							НовоеДвижение.ПереоценкаВСтоимости = Окр(ПогрешностьПереоценкаВСтоимости, 2);
							ПогрешностьПереоценкаВСтоимости = ПогрешностьПереоценкаВСтоимости - Окр(ПогрешностьПереоценкаВСтоимости, 2);
						Иначе
							НовоеДвижение.ПереоценкаВСтоимости = 0;
						КонецЕсли;
						Если ПогрешностьПереоценкаКупонаВСтоимости > 0.01 ИЛИ ПогрешностьПереоценкаКупонаВСтоимости < -0.01 Тогда
							НовоеДвижение.ПереоценкаКупонаВСтоимости = Окр(ПогрешностьПереоценкаКупонаВСтоимости, 2);
							ПогрешностьПереоценкаКупонаВСтоимости = ПогрешностьПереоценкаКупонаВСтоимости - Окр(ПогрешностьПереоценкаКупонаВСтоимости, 2);
						Иначе
							НовоеДвижение.ПереоценкаКупонаВСтоимости = 0;
						КонецЕсли;
						Если ПогрешностьСтоимость > 0.01 ИЛИ ПогрешностьСтоимость < -0.01 Тогда
							НовоеДвижение.Стоимость = Окр(ПогрешностьСтоимость, 2);
							ПогрешностьСтоимость = ПогрешностьСтоимость - Окр(ПогрешностьСтоимость, 2);
						Иначе
							НовоеДвижение.Стоимость = 0;
						КонецЕсли;
						Если ПогрешностьСтоимостьКупона > 0.01 ИЛИ ПогрешностьСтоимостьКупона < -0.01 Тогда
							НовоеДвижение.СтоимостьКупона = Окр(ПогрешностьСтоимостьКупона, 2);
							ПогрешностьСтоимостьКупона = ПогрешностьСтоимостьКупона - Окр(ПогрешностьСтоимостьКупона, 2);
						Иначе
							НовоеДвижение.СтоимостьКупона = 0;
						КонецЕсли;
						Если ПогрешностьПереоценка > 0.01 ИЛИ ПогрешностьПереоценка < -0.01 Тогда
							НовоеДвижение.Переоценка = Окр(ПогрешностьПереоценка, 2);
							ПогрешностьПереоценка = ПогрешностьПереоценка - Окр(ПогрешностьПереоценка, 2);
						Иначе
							НовоеДвижение.Переоценка = 0;
						КонецЕсли;
						Если ПогрешностьПереоценкаКупона > 0.01 ИЛИ ПогрешностьПереоценкаКупона < -0.01 Тогда
							НовоеДвижение.ПереоценкаКупона = Окр(ПогрешностьПереоценкаКупона, 2);
							ПогрешностьПереоценкаКупона = ПогрешностьПереоценкаКупона - Окр(ПогрешностьПереоценкаКупона, 2);
						Иначе
							НовоеДвижение.ПереоценкаКупона = 0;
						КонецЕсли;
						Если ПогрешностьСуммаЧастичногоПогашения > 0.01 ИЛИ ПогрешностьСуммаЧастичногоПогашения < -0.01 Тогда
							НовоеДвижение.СуммаЧастичногоПогашения = Окр(ПогрешностьСуммаЧастичногоПогашения, 2);
							ПогрешностьСуммаЧастичногоПогашения = ПогрешностьСуммаЧастичногоПогашения - Окр(ПогрешностьСуммаЧастичногоПогашения, 2);
						Иначе
							НовоеДвижение.СуммаЧастичногоПогашения = 0;
						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
				
				//что-то набежало к концу
				Если ПогрешностьСтоимостьПокупки > 0.005 ИЛИ ПогрешностьСтоимостьПокупки < -0.005
					ИЛИ ПогрешностьСтоимостьПокупкиКупона > 0.005 ИЛИ ПогрешностьСтоимостьПокупкиКупона < -0.005
					ИЛИ ПогрешностьРасходыПриПокупкеВСтоимости > 0.005 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимости < -0.005
					ИЛИ ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета > 0.005 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета < -0.005
					ИЛИ ПогрешностьПереоценкаВСтоимости > 0.005 ИЛИ ПогрешностьПереоценкаВСтоимости < -0.005
					ИЛИ ПогрешностьПереоценкаКупонаВСтоимости > 0.005 ИЛИ ПогрешностьПереоценкаКупонаВСтоимости < -0.005
					ИЛИ ПогрешностьСтоимость > 0.005 ИЛИ ПогрешностьСтоимость < -0.005
					ИЛИ ПогрешностьСтоимостьКупона > 0.005 ИЛИ ПогрешностьСтоимостьКупона < -0.005
					ИЛИ ПогрешностьПереоценка > 0.005 ИЛИ ПогрешностьПереоценка < -0.005
					ИЛИ ПогрешностьПереоценкаКупона > 0.005 ИЛИ ПогрешностьПереоценкаКупона < -0.005
					ИЛИ ПогрешностьСуммаЧастичногоПогашения > 0.005 ИЛИ ПогрешностьСуммаЧастичногоПогашения < -0.005 	Тогда
					
					СтрокаПогрешностиОкругления = ПогрешностиОкругления[ПогрешностиОкругления.Количество() - 1];
					
					НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();						
					
					ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаПогрешностиОкругления);
					
					//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.УчетПогрешностиОкругления;
					
					//НовоеДвижение.СписаниеПогрешностиОкругления = Истина;
					НовоеДвижение.Количество = 0;
					
					Если ПогрешностьСтоимостьПокупки > 0.005 ИЛИ ПогрешностьСтоимостьПокупки < -0.005 Тогда
						НовоеДвижение.СтоимостьПокупки = Окр(ПогрешностьСтоимостьПокупки, 2);
						ПогрешностьСтоимостьПокупки = ПогрешностьСтоимостьПокупки - Окр(ПогрешностьСтоимостьПокупки, 2);
					Иначе
						НовоеДвижение.СтоимостьПокупки = 0;
					КонецЕсли;
					Если ПогрешностьСтоимостьПокупкиКупона > 0.005 ИЛИ ПогрешностьСтоимостьПокупкиКупона < -0.005 Тогда
						НовоеДвижение.СтоимостьПокупкиКупона = Окр(ПогрешностьСтоимостьПокупкиКупона, 2);
						ПогрешностьСтоимостьПокупкиКупона = ПогрешностьСтоимостьПокупкиКупона - Окр(ПогрешностьСтоимостьПокупкиКупона, 2);
					Иначе
						НовоеДвижение.СтоимостьПокупкиКупона = 0;
					КонецЕсли;
					Если ПогрешностьРасходыПриПокупкеВСтоимости > 0.005 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимости < -0.005 Тогда
						НовоеДвижение.РасходыПриПокупкеВСтоимости = Окр(ПогрешностьРасходыПриПокупкеВСтоимости, 2);
						ПогрешностьРасходыПриПокупкеВСтоимости = ПогрешностьРасходыПриПокупкеВСтоимости - Окр(ПогрешностьРасходыПриПокупкеВСтоимости, 2);
					Иначе
						НовоеДвижение.РасходыПриПокупкеВСтоимости = 0;
					КонецЕсли;
					Если ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета > 0.005 ИЛИ ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета < -0.005 Тогда
						НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = Окр(ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета, 2);
						ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета = ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета - Окр(ПогрешностьРасходыПриПокупкеВСтоимостиВВалютеУчета, 2);
					Иначе
						НовоеДвижение.РасходыПриПокупкеВСтоимостиВВалютеУчета = 0;
					КонецЕсли;
					Если ПогрешностьПереоценкаВСтоимости > 0.005 ИЛИ ПогрешностьПереоценкаВСтоимости < -0.005 Тогда
						НовоеДвижение.ПереоценкаВСтоимости = Окр(ПогрешностьПереоценкаВСтоимости, 2);
						ПогрешностьПереоценкаВСтоимости = ПогрешностьПереоценкаВСтоимости - Окр(ПогрешностьПереоценкаВСтоимости, 2);
					Иначе
						НовоеДвижение.ПереоценкаВСтоимости = 0;
					КонецЕсли;
					Если ПогрешностьПереоценкаКупонаВСтоимости > 0.005 ИЛИ ПогрешностьПереоценкаКупонаВСтоимости < -0.005 Тогда
						НовоеДвижение.ПереоценкаКупонаВСтоимости = Окр(ПогрешностьПереоценкаКупонаВСтоимости, 2);
						ПогрешностьПереоценкаКупонаВСтоимости = ПогрешностьПереоценкаКупонаВСтоимости - Окр(ПогрешностьПереоценкаКупонаВСтоимости, 2);
					Иначе
						НовоеДвижение.ПереоценкаКупонаВСтоимости = 0;
					КонецЕсли;
					Если ПогрешностьСтоимость > 0.005 ИЛИ ПогрешностьСтоимость < -0.005 Тогда
						НовоеДвижение.Стоимость = Окр(ПогрешностьСтоимость, 2);
						ПогрешностьСтоимость = ПогрешностьСтоимость - Окр(ПогрешностьСтоимость, 2);
					Иначе
						НовоеДвижение.Стоимость = 0;
					КонецЕсли;
					Если ПогрешностьСтоимостьКупона > 0.005 ИЛИ ПогрешностьСтоимостьКупона < -0.005 Тогда
						НовоеДвижение.СтоимостьКупона = Окр(ПогрешностьСтоимостьКупона, 2);
						ПогрешностьСтоимостьКупона = ПогрешностьСтоимостьКупона - Окр(ПогрешностьСтоимостьКупона, 2);
					Иначе
						НовоеДвижение.СтоимостьКупона = 0;
					КонецЕсли;
					Если ПогрешностьПереоценка > 0.005 ИЛИ ПогрешностьПереоценка < -0.005 Тогда
						НовоеДвижение.Переоценка = Окр(ПогрешностьПереоценка, 2);
						ПогрешностьПереоценка = ПогрешностьПереоценка - Окр(ПогрешностьПереоценка, 2);
					Иначе
						НовоеДвижение.Переоценка = 0;
					КонецЕсли;
					Если ПогрешностьПереоценкаКупона > 0.005 ИЛИ ПогрешностьПереоценкаКупона < -0.005 Тогда
						НовоеДвижение.ПереоценкаКупона = Окр(ПогрешностьПереоценкаКупона, 2);
						ПогрешностьПереоценкаКупона = ПогрешностьПереоценкаКупона - Окр(ПогрешностьПереоценкаКупона, 2);
					Иначе
						НовоеДвижение.ПереоценкаКупона = 0;
					КонецЕсли;
					Если ПогрешностьСуммаЧастичногоПогашения > 0.005 ИЛИ ПогрешностьСуммаЧастичногоПогашения < -0.005 Тогда
						НовоеДвижение.СуммаЧастичногоПогашения = Окр(ПогрешностьСуммаЧастичногоПогашения, 2);
						ПогрешностьСуммаЧастичногоПогашения = ПогрешностьСуммаЧастичногоПогашения - Окр(ПогрешностьСуммаЧастичногоПогашения, 2);
					Иначе
						НовоеДвижение.СуммаЧастичногоПогашения = 0;
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
			
			// теперь таблица приходных партий содержит только конечные остатки, которые мы и положим в соответствующую таб. часть обработки
			Для каждого СтрокаПартии Из ПриходныеПартии Цикл
				ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартий.Добавить(), СтрокаПартии);
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	// таблица партий РЕПО, в отличие от приходных партий, не сгруппирована по бумагам,
	// поэтому выносим её за "бумажный" цикл
	Для каждого СтрокаПартии Из ПартииКупленныеПоРЕПО Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартийКупленныхПоРепо.Добавить(), СтрокаПартии);
	КонецЦикла;
	Для каждого СтрокаПартии Из ПартииПроданныеВРЕПО Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.КонечныеОстаткиПартийПроданныхВРепо.Добавить(), СтрокаПартии);
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьПартии(Отказ, НастройкиПоВидуУчета = Неопределено) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".РассчитатьПартии";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	СчетДоверительногоУправленияДляУчета = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	СписокСтратегий = Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления);
	
	// по собственным счетам вводы/выводы могут быть только между портфелями и в учет попадать не должны
	ВключатьВводыВыводы = (ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.Собственный);
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		РассчитатьПартииЕПС(Отказ);
	Иначе
		РассчитатьПартииБУНУ(Отказ, НастройкиПоВидуУчета);
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

Функция ПолучитьСуммуВВалютеУчетаДляПоставки(Партия, СтрокаПартии, Отказ)

	Тикет = Партия.Основание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(СделкаЦенныеБумаги.Сумма) КАК Сумма,
		|	СУММА(СделкаЦенныеБумаги.СуммаКупона) КАК СуммаКупона,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.СтрокаПартии = &СтрокаПартии
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтрокаПартии
		|ПОМЕСТИТЬ СуммыТикета
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Тикет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.СтрокаПартии = &СтрокаПартии
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.ВидДвижения КАК ВидДвижения,
		|	ЗадолженностиПоДенежнымСредствам.Сумма / (СуммаНашаБумага.Сумма + ЕСТЬNULL(СуммаНеНашиБумаги.Сумма, 0)) * СуммаНашаБумага.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА СуммаНашаБумага.СуммаКупона = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствам.СуммаКупона / (СуммаНашаБумага.СуммаКупона + ЕСТЬNULL(СуммаНеНашиБумаги.СуммаКупона, 0)) * СуммаНашаБумага.СуммаКупона
		|	КОНЕЦ КАК СуммаКупона,
		|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
		|	КурсыВалют.Курс КАК Курс
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) = КурсыВалют.Период)
		|			И (КурсыВалют.Валюта = &ВалютаСделки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыТикета КАК СуммаНашаБумага
		|		ПО (СуммаНашаБумага.СтрокаПартии = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыТикета КАК СуммаНеНашиБумаги
		|		ПО (СуммаНеНашиБумаги.СтрокаПартии = 0)
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Основание = &Тикет
		|	И ЗадолженностиПоДенежнымСредствам.Период >= &ДатаТикета
		|	И ЗадолженностиПоДенежнымСредствам.Период < &ДатаПоставки
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = &ВидЗадолженности";
	
	Запрос.УстановитьПараметр("Тикет", Тикет);
	Запрос.УстановитьПараметр("ВидЗадолженности", Справочники.ВидыЗадолженности.ПоСделке);
	Запрос.УстановитьПараметр("СтрокаПартии", СтрокаПартии);
	Запрос.УстановитьПараметр("ВалютаСделки", Тикет.ВалютаСделки);
	Запрос.УстановитьПараметр("ДатаТикета", Тикет.Дата);
	Запрос.УстановитьПараметр("ДатаПоставки", Партия.Дата);
	
	СуммаПоТикету = 0;
	СуммаОплачено = 0;
	СуммаОплаченоВВалютеУчета = 0;
	СуммаКупонаПоТикету = 0;
	СуммаКупонаОплачено = 0;
	СуммаКупонаОплаченоВВалютеУчета = 0;
	
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
		    СуммаПоТикету = СуммаПоТикету + ВыборкаДетальныеЗаписи.Сумма;
			СуммаКупонаПоТикету = СуммаКупонаПоТикету + ВыборкаДетальныеЗаписи.СуммаКупона;
		Иначе
			СуммаОплачено = СуммаОплачено + ВыборкаДетальныеЗаписи.Сумма;
			СуммаОплаченоВВалютеУчета = СуммаОплаченоВВалютеУчета + ВыборкаДетальныеЗаписи.Сумма * ВыборкаДетальныеЗаписи.Курс;
			СуммаКупонаОплачено = СуммаКупонаОплачено + ВыборкаДетальныеЗаписи.СуммаКупона;
			СуммаКупонаОплаченоВВалютеУчета = СуммаКупонаОплаченоВВалютеУчета + ВыборкаДетальныеЗаписи.СуммаКупона * ВыборкаДетальныеЗаписи.Курс;
		КонецЕсли;
	КонецЦикла;
	
	// неоплаченную сумму считаем по курсу на момент поставки
	// а все, что оплачено считаем по курсу на дату оплаты
	СуммаВВалютеУчета = СуммаОплаченоВВалютеУчета + РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаПоТикету - СуммаОплачено, Тикет.ВалютаСделки, ЭтотОбъект.Организация, Партия.Дата, Отказ);
	СуммаКупонаВВалютеУчета = СуммаКупонаОплаченоВВалютеУчета + РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупонаПоТикету - СуммаКупонаОплачено, Тикет.ВалютаСделки, ЭтотОбъект.Организация, Партия.Дата, Отказ);

	Результат = Новый Структура();
	Результат.Вставить("СуммаВВалютеУчета",СуммаВВалютеУчета);
	Результат.Вставить("СуммаКупонаВВалютеУчета",СуммаКупонаВВалютеУчета);
	
	Возврат Результат;
		
КонецФункции //

Процедура РассчитатьИЗаписатьПартии(Отказ) Экспорт

	СчетДоверительногоУправленияДляУчета = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	СписокСтратегий = Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления);
	// по собственным счетам вводы/выводы могут быть только между портфелями и в учет попадать не должны
	ВключатьВводыВыводы = (ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.Собственный);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.БухПартииЦенныхБумаг");
	ЭлементБлокировки.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
	ЭлементБлокировки.УстановитьЗначение("ВидУчета", ЭтотОбъект.ВидУчета);
	ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО");
	ЭлементБлокировки.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
	ЭлементБлокировки.УстановитьЗначение("ВидУчета", ЭтотОбъект.ВидУчета);
	ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо");
	ЭлементБлокировки.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
	ЭлементБлокировки.УстановитьЗначение("ВидУчета", ЭтотОбъект.ВидУчета);
	ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.БухПартииЦенныхБумагКПолучению");
	ЭлементБлокировки.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
	ЭлементБлокировки.УстановитьЗначение("ВидУчета", ЭтотОбъект.ВидУчета);
	ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.БухПартииСрочныхКонтрактов");
	ЭлементБлокировки.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
	ЭлементБлокировки.УстановитьЗначение("ВидУчета", ЭтотОбъект.ВидУчета);
	ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Блокировка.Заблокировать();
	
	ЭтотОбъект.ВариантРасчета = Перечисления.ВариантыРасчетаПартий.ПолныйРасчет;
	
	РассчитатьПартии(Отказ);
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;

	РегистрыДляЗаписи = Новый Соответствие;
	
	РегистрыДляЗаписи.Вставить("БухПартииЦенныхБумаг",					ЭтотОбъект.РассчитанныеПартии);
	РегистрыДляЗаписи.Вставить("БухПартииЦенныхБумагКПолучению",		ЭтотОбъект.РассчитанныеПартииКПоступлению);
	РегистрыДляЗаписи.Вставить("БухПартииЦенныхБумагКупленныеПоРЕПО",	ЭтотОбъект.РассчитанныеПартииОбратноеРЕПО);
	РегистрыДляЗаписи.Вставить("БухПартииЦенныхБумагПроданныеВРепо",	ЭтотОбъект.РассчитанныеПартииПрямоеРЕПО);
	РегистрыДляЗаписи.Вставить("БухПартииСрочныхКонтрактов",			ЭтотОбъект.РассчитанныеПартииСрочныеКонтракты);

	Для каждого Элемент Из РегистрыДляЗаписи Цикл
		ЗаписатьПартии(Элемент.Ключ, Элемент.Значение, Отказ);
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ЗаписатьНастройки(Отказ);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ИндексацияНоминала(Регистратор, Период, СтрокаПриходныхПартий, Количество, УчитыватьИндексациюОтдельно, Отказ)
	
	Если СтрокаПриходныхПартий.Рынок <> Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ СтрокаПриходныхПартий.ЦеннаяБумага.ИндексируемыйНоминал Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Облигация = СтрокаПриходныхПартий.ЦеннаяБумага;
		
	КоэффициентИндексации = Количество/СтрокаПриходныхПартий.Количество;
	
	НовоеДвижение = ЭтотОбъект.РассчитанныеПартии.Добавить();

	НовоеДвижение.Рынок = 			СтрокаПриходныхПартий.Рынок;
	НовоеДвижение.ЦеннаяБумага = 	СтрокаПриходныхПартий.ЦеннаяБумага;
	НовоеДвижение.Партия = 			СтрокаПриходныхПартий.Партия;
	НовоеДвижение.СтрокаПартии = 	СтрокаПриходныхПартий.СтрокаПартии;
	
	НовоеДвижение.ВидДвижения = Перечисления.ВидыДвижений.Приход;
	НовоеДвижение.Регистратор = Регистратор;
	НовоеДвижение.Период = Период;
	НовоеДвижение.СтрокаКорзиныЦенныхБумаг = СтрокаПриходныхПартий.СтрокаПартии;
	
	//НовоеДвижение.ВидДвиженияПартий = Перечисления.ВидыДвиженийПартий.ПереоценкаИНачислениеПроцентов;
	
	Если ТипЗнч(СтрокаПриходныхПартий.Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
		ДатаПокупки = СтрокаПриходныхПартий.ДатаПокупки;
	Иначе
		ДатаПокупки = СтрокаПриходныхПартий.Партия.Дата;
	КонецЕсли;
	
	НовоеДвижение.ИндексацияНоминалаЗаВремяВладения = (Справочники.Облигации.ПолучитьНоминал(Облигация, Период) - Справочники.Облигации.ПолучитьНоминал(Облигация, ДатаПокупки)) * Количество
										- СтрокаПриходныхПартий.ИндексацияНоминалаЗаВремяВладения * КоэффициентИндексации;
	
	Возврат НовоеДвижение;
	
КонецФункции

Функция ПолучитьОтменыСделок_БУНУ()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.Регистратор КАК Регистратор,
		|	ОперацииСЦеннымиБумагами.Основание КАК Основание,
		|	ОперацииСЦеннымиБумагами.ДатаОперации КАК ДатаОперации
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ОтменаСделки)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

Функция ПолучитьПартииПроданныеВРЕПО_БУНУ()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО КАК ПродажаРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПродажиРЕПО КАК СтрокаПродажиРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупки,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимости,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеСНачалаГодаОстаток КАК РасходыПриПокупкеСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимости,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимости,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьОстаток КАК Стоимость,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО.Дата КАК ПериодРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.Дата КАК Период,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО.МоментВремени КАК МоментВремениРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия КАК Документ.СделкаРЕПО).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО КАК Документ.СделкаРЕПО).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ПродажаРЕПО КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК НомерСделкиРЕПО,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК ДисконтПремияНачисленныйВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияОстаток КАК ДисконтПремияОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашенияОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценениеОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупонаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгамОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаОстаток КАК ИндексацияНоминалаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаСНачалаГодаОстаток КАК ИндексацияНоминалаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладенияОстаток,
		|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КурсовыеРазницыСНачалаГодаОстаток КАК КурсовыеРазницыСНачалаГодаОстаток
		|ПОМЕСТИТЬ _ПартииРЕПО
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагПроданныеВРепоОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииРЕПО.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ПартииРЕПО.Рынок КАК Рынок,
		|	ПартииРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииРЕПО.ПродажаРЕПО КАК ПродажаРЕПО,
		|	ПартииРЕПО.СтрокаПродажиРЕПО КАК СтрокаПродажиРЕПО,
		|	ПартииРЕПО.Партия КАК Партия,
		|	ПартииРЕПО.СтрокаПартии КАК СтрокаПартии,
		|	ПартииРЕПО.Количество КАК Количество,
		|	ПартииРЕПО.СтоимостьПокупки КАК СтоимостьПокупки,
		|	ПартииРЕПО.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	ПартииРЕПО.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	ПартииРЕПО.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	ПартииРЕПО.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	ПартииРЕПО.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	ПартииРЕПО.Стоимость КАК Стоимость,
		|	ПартииРЕПО.СтоимостьКупона КАК СтоимостьКупона,
		|	ПартииРЕПО.Переоценка КАК Переоценка,
		|	ПартииРЕПО.ПереоценкаКупона КАК ПереоценкаКупона,
		|	ПартииРЕПО.ПериодРЕПО КАК ПериодРЕПО,
		|	ПартииРЕПО.Период КАК Период,
		|	ПартииРЕПО.МоментВремениРЕПО КАК МоментВремениРЕПО,
		|	ПартииРЕПО.МоментВремени КАК МоментВремени,
		|	ПартииРЕПО.НомерСделки КАК НомерСделки,
		|	ПартииРЕПО.НомерСделкиРЕПО КАК НомерСделкиРЕПО,
		|	ПартииРЕПО.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПартииРЕПО.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала,
		|	ПартииРЕПО.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчетаОстаток,
		|	ПартииРЕПО.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток,
		|	ПартииРЕПО.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
		|	ПартииРЕПО.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
		|	ПартииРЕПО.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчетаОстаток,
		|	ПартииРЕПО.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК ДисконтПремияНачисленныйВВалютеУчетаОстаток,
		|	ПартииРЕПО.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток,
		|	ПартииРЕПО.ДисконтПремияОстаток КАК ДисконтПремияОстаток,
		|	ПартииРЕПО.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	ПартииРЕПО.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашенияОстаток,
		|	ПартииРЕПО.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценениеОстаток,
		|	ПартииРЕПО.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупонаОстаток,
		|	ПартииРЕПО.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгамОстаток,
		|	ПартииРЕПО.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	ПартииРЕПО.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГодаОстаток,
		|	ПартииРЕПО.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	ПартииРЕПО.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГодаОстаток,
		|	ПартииРЕПО.ИндексацияНоминалаОстаток КАК ИндексацияНоминалаОстаток,
		|	ПартииРЕПО.ИндексацияНоминалаСНачалаГодаОстаток КАК ИндексацияНоминалаСНачалаГодаОстаток,
		|	ПартииРЕПО.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладенияОстаток,
		|	ПартииРЕПО.КурсовыеРазницыСНачалаГодаОстаток КАК КурсовыеРазницыСНачалаГодаОстаток
		|ПОМЕСТИТЬ _ПартииРЕПОСПериодомНоминала
		|ИЗ
		|	_ПартииРЕПО КАК ПартииРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ПартииРЕПО.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ПартииРЕПО.Период > НоминалыЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииРЕПО.УчетныйАктивЕПС,
		|	ПартииРЕПО.Рынок,
		|	ПартииРЕПО.ЦеннаяБумага,
		|	ПартииРЕПО.ПродажаРЕПО,
		|	ПартииРЕПО.СтрокаПродажиРЕПО,
		|	ПартииРЕПО.Партия,
		|	ПартииРЕПО.СтрокаПартии,
		|	ПартииРЕПО.Количество,
		|	ПартииРЕПО.СтоимостьПокупки,
		|	ПартииРЕПО.СтоимостьПокупкиКупона,
		|	ПартииРЕПО.РасходыПриПокупкеВСтоимости,
		|	ПартииРЕПО.РасходыПриПокупкеСНачалаГода,
		|	ПартииРЕПО.ПереоценкаВСтоимости,
		|	ПартииРЕПО.ПереоценкаКупонаВСтоимости,
		|	ПартииРЕПО.Стоимость,
		|	ПартииРЕПО.СтоимостьКупона,
		|	ПартииРЕПО.Переоценка,
		|	ПартииРЕПО.ПереоценкаКупона,
		|	ПартииРЕПО.ПериодРЕПО,
		|	ПартииРЕПО.Период,
		|	ПартииРЕПО.МоментВремениРЕПО,
		|	ПартииРЕПО.МоментВремени,
		|	ПартииРЕПО.НомерСделки,
		|	ПартииРЕПО.НомерСделкиРЕПО,
		|	ПартииРЕПО.ПереоценкаСНачалаГода,
		|	ПартииРЕПО.ПереоценкаКупонаСНачалаГода,
		|	ПартииРЕПО.СтоимостьВВалютеУчетаОстаток,
		|	ПартииРЕПО.СтоимостьКупонаВВалютеУчетаОстаток,
		|	ПартииРЕПО.ПереоценкаВВалютеУчетаОстаток,
		|	ПартииРЕПО.ПереоценкаКупонаВВалютеУчетаОстаток,
		|	ПартииРЕПО.КорректировкаЭСПВВалютеУчетаОстаток,
		|	ПартииРЕПО.ДисконтПремияНачисленныйВВалютеУчетаОстаток,
		|	ПартииРЕПО.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток,
		|	ПартииРЕПО.ДисконтПремияОстаток,
		|	ПартииРЕПО.КорректировкаЭСПОстаток,
		|	ПартииРЕПО.СуммаЧастичногоПогашенияОстаток,
		|	ПартииРЕПО.СуммаРезервовПодОбесценениеОстаток,
		|	ПартииРЕПО.СуммаРезервовПодОбесценениеКупонаОстаток,
		|	ПартииРЕПО.СуммаРезервовПоСомнительнымДолгамОстаток,
		|	ПартииРЕПО.ДисконтПремияНачисленныйОстаток,
		|	ПартииРЕПО.ДисконтПремияНачисленныйСНачалаГодаОстаток,
		|	ПартииРЕПО.КорректировкаЭСПСНачалаГодаОстаток,
		|	ПартииРЕПО.РазницаПервоначальногоПризнанияСНачалаГодаОстаток,
		|	ПартииРЕПО.ИндексацияНоминалаОстаток,
		|	ПартииРЕПО.ИндексацияНоминалаСНачалаГодаОстаток,
		|	ПартииРЕПО.ИндексацияНоминалаЗаВремяВладенияОстаток,
		|	ПартииРЕПО.КурсовыеРазницыСНачалаГодаОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииРЕПОСПериодомНоминала.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ПартииРЕПОСПериодомНоминала.Рынок КАК Рынок,
		|	ПартииРЕПОСПериодомНоминала.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииРЕПОСПериодомНоминала.ПродажаРЕПО КАК ПродажаРЕПО,
		|	ПартииРЕПОСПериодомНоминала.СтрокаПродажиРЕПО КАК СтрокаПродажиРЕПО,
		|	ПартииРЕПОСПериодомНоминала.Партия КАК Партия,
		|	ПартииРЕПОСПериодомНоминала.СтрокаПартии КАК СтрокаПартии,
		|	ПартииРЕПОСПериодомНоминала.Количество КАК Количество,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьПокупки КАК СтоимостьПокупки,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьПокупкиКупона КАК СтоимостьПокупкиКупона,
		|	ПартииРЕПОСПериодомНоминала.РасходыПриПокупкеВСтоимости КАК РасходыПриПокупкеВСтоимости,
		|	ПартииРЕПОСПериодомНоминала.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаВСтоимости КАК ПереоценкаВСтоимости,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупонаВСтоимости КАК ПереоценкаКупонаВСтоимости,
		|	ПартииРЕПОСПериодомНоминала.Стоимость КАК Стоимость,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьКупона КАК СтоимостьКупона,
		|	ПартииРЕПОСПериодомНоминала.Переоценка КАК Переоценка,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупона КАК ПереоценкаКупона,
		|	ПартииРЕПОСПериодомНоминала.ПериодРЕПО КАК ПериодРЕПО,
		|	ПартииРЕПОСПериодомНоминала.Период КАК Период,
		|	ПартииРЕПОСПериодомНоминала.МоментВремениРЕПО КАК МоментВремениРЕПО,
		|	ПартииРЕПОСПериодомНоминала.МоментВремени КАК МоментВремени,
		|	ПартииРЕПОСПериодомНоминала.НомерСделки КАК НомерСделки,
		|	ПартииРЕПОСПериодомНоминала.НомерСделкиРЕПО КАК НомерСделкиРЕПО,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ПериодНоминала КАК ПериодНоминала,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток КАК РасходыПриПокупкеВСтоимостиВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ДисконтПремияОстаток КАК ДисконтПремия,
		|	ПартииРЕПОСПериодомНоминала.КорректировкаЭСПОстаток КАК КорректировкаЭСП,
		|	ПартииРЕПОСПериодомНоминала.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашения,
		|	ПартииРЕПОСПериодомНоминала.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	ПартииРЕПОСПериодомНоминала.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупона,
		|	ПартииРЕПОСПериодомНоминала.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгам,
		|	ПартииРЕПОСПериодомНоминала.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленный,
		|	ПартииРЕПОСПериодомНоминала.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ИндексацияНоминалаОстаток КАК ИндексацияНоминала,
		|	ПартииРЕПОСПериодомНоминала.ИндексацияНоминалаСНачалаГодаОстаток КАК ИндексацияНоминалаСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ИндексацияНоминалаЗаВремяВладенияОстаток КАК ИндексацияНоминалаЗаВремяВладения,
		|	ПартииРЕПОСПериодомНоминала.КурсовыеРазницыСНачалаГодаОстаток КАК КурсовыеРазницыСНачалаГода
		|ИЗ
		|	_ПартииРЕПОСПериодомНоминала КАК ПартииРЕПОСПериодомНоминала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ПартииРЕПОСПериодомНоминала.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ПартииРЕПОСПериодомНоминала.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодРЕПО,
		|	НомерСделкиРЕПО,
		|	МоментВремениРЕПО,
		|	Период,
		|	НомерСделки,
		|	МоментВремени";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьПартииКупленныеПоРЕПО_БУНУ()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьОстаток КАК Стоимость,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаОстаток КАК СтоимостьКупона,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия.Дата КАК Период,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия КАК Документ.СделкаРЕПО).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.СделкаРЕПО).НомерСделки
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК НомерСделки,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода
		|ПОМЕСТИТЬ _ПартииРЕПО
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагКупленныеПоРЕПООстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииРЕПО.Рынок КАК Рынок,
		|	ПартииРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииРЕПО.Партия КАК Партия,
		|	ПартииРЕПО.СтрокаПартии КАК СтрокаПартии,
		|	ПартииРЕПО.Количество КАК Количество,
		|	ПартииРЕПО.Стоимость КАК Стоимость,
		|	ПартииРЕПО.СтоимостьКупона КАК СтоимостьКупона,
		|	ПартииРЕПО.Переоценка КАК Переоценка,
		|	ПартииРЕПО.ПереоценкаКупона КАК ПереоценкаКупона,
		|	ПартииРЕПО.Период КАК Период,
		|	ПартииРЕПО.МоментВремени КАК МоментВремени,
		|	ПартииРЕПО.НомерСделки КАК НомерСделки,
		|	ПартииРЕПО.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПартииРЕПО.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала,
		|	ПартииРЕПО.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	ПартииРЕПО.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета
		|ПОМЕСТИТЬ _ПартииРЕПОСПериодомНоминала
		|ИЗ
		|	_ПартииРЕПО КАК ПартииРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ПартииРЕПО.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ПартииРЕПО.Период > НоминалыЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииРЕПО.Рынок,
		|	ПартииРЕПО.ЦеннаяБумага,
		|	ПартииРЕПО.Партия,
		|	ПартииРЕПО.СтрокаПартии,
		|	ПартииРЕПО.Количество,
		|	ПартииРЕПО.Стоимость,
		|	ПартииРЕПО.СтоимостьКупона,
		|	ПартииРЕПО.Переоценка,
		|	ПартииРЕПО.ПереоценкаКупона,
		|	ПартииРЕПО.Период,
		|	ПартииРЕПО.МоментВремени,
		|	ПартииРЕПО.НомерСделки,
		|	ПартииРЕПО.ПереоценкаСНачалаГода,
		|	ПартииРЕПО.ПереоценкаКупонаСНачалаГода,
		|	ПартииРЕПО.СтоимостьВВалютеУчета,
		|	ПартииРЕПО.СтоимостьКупонаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаВВалютеУчета,
		|	ПартииРЕПО.ПереоценкаКупонаВВалютеУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииРЕПОСПериодомНоминала.Рынок КАК Рынок,
		|	ПартииРЕПОСПериодомНоминала.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПартииРЕПОСПериодомНоминала.Партия КАК Партия,
		|	ПартииРЕПОСПериодомНоминала.СтрокаПартии КАК СтрокаПартии,
		|	ПартииРЕПОСПериодомНоминала.Количество КАК Количество,
		|	ПартииРЕПОСПериодомНоминала.Стоимость КАК Стоимость,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьКупона КАК СтоимостьКупона,
		|	ПартииРЕПОСПериодомНоминала.Переоценка КАК Переоценка,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупона КАК ПереоценкаКупона,
		|	ПартииРЕПОСПериодомНоминала.Период КАК Период,
		|	ПартииРЕПОСПериодомНоминала.МоментВремени КАК МоментВремени,
		|	ПартииРЕПОСПериодомНоминала.НомерСделки КАК НомерСделки,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	ПартииРЕПОСПериодомНоминала.ПериодНоминала КАК ПериодНоминала,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	ПартииРЕПОСПериодомНоминала.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета
		|ИЗ
		|	_ПартииРЕПОСПериодомНоминала КАК ПартииРЕПОСПериодомНоминала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ПартииРЕПОСПериодомНоминала.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ПартииРЕПОСПериодомНоминала.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	НомерСделки,
		|	МоментВремени";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьКомиссииПоПокупкам_БУНУ()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Основание
		|ПОМЕСТИТЬ _СделкиПокупкиСКомиссией
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))
		|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.Сделка)
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.Сделка)
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
		|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.ВидДвижения КАК ВидДвижения,
		|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
		|	КурсыВалют.Курс КАК Курс
		|ИЗ
		|	_СделкиПокупкиСКомиссией КАК Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО Сделки.Основание = ЗадолженностиПоДенежнымСредствам.Основание
		|			И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (ЗадолженностиПоДенежнымСредствам.Валюта = КурсыВалют.Валюта)
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) = КурсыВалют.Период)
		|ГДЕ
		|	НЕ ЗадолженностиПоДенежнымСредствам.Период ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Основание,
		|	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьПоставкиПоПокупкам_БУНУ()

	// Это для случая внебиржевых сделок, фильтр идет по раздельному исполнению
	// т.к. лучшего фильтра не нашел
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание КАК Основание
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.Сделка)
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).РаздельноеИсполнение) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.Основание КАК Основание,
		|	ЗадолженностиПоЦеннымБумагам.ВидДвижения КАК ВидДвижения,
		|	ЗадолженностиПоЦеннымБумагам.Регистратор КАК Регистратор,
		|	ЗадолженностиПоЦеннымБумагам.Количество КАК Количество,
		|	ЗадолженностиПоЦеннымБумагам.Период КАК Период
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
		|		ПО _Сделки.Основание = ЗадолженностиПоЦеннымБумагам.Основание
		|
		|УПОРЯДОЧИТЬ ПО
		|	Основание,
		|	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправленияДляУчета);
	Запрос.УстановитьПараметр("СписокСтратегий", СписокСтратегий);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция РассчитатьРасходыПриПокупкеВСтоимости_БУНУ(ЦеннаяБумага, ВалютаНоминала, ВыборкаДетальныеЗаписи, КомиссииПоПокупкам, ПоставкиПоПокупкам)

	// ПОНЯТИЕ:
	// Признавать(применяемо к комиссии) - отправлять на стоимость бумаги
	
	//Как все будет работать:
	//1. Смотрим включаются ли комиссии в стоимость
	//2. Если включаются то формируем таблицу комиссий
	//3. Если не включаются то не формируем таблицу комиссий
	//4. Таблица будет иметь следующие колонки: 
	//	Сделка - это понятно что
	//	Документ начисления комиссии - либо начисление, либо сама сделка (для торговой комиссии)
	//	Валюта комиссии - это тоже понятно
	//	Сумма комиссии - это либо сумма оплаты комиссии, либо неоплаченая комиссия на конец периода
	//	Документ оплаты комиссии - либо оплата, либо Неопределено если это остаток неоплаченной
	//5. Собираем комиссию просто:
	//	Получим сделки по которым были остатки на начало + движуха по комиссии и бумагам
	//	Джойним к ним начисления, оплаты и остатки
	//	Важно! Берем только сделки покупки
	//6. Дальше просто - при расчете партий, когда приходуем партию получаем из таблицы комиссий строки
	//7. Из этих строк расчитываем комиссию
	//8. Возможна одна сложность - поставка идет частями и тут нужно определять какая у нас часть
	//9. Но вероятность этого КРАЙНЕ мала, поэтому тут можно сделать запрос, чтобы это выяснить
	//10.Все!
	
	
	ПолноеИсполнение = Истина; // нет частичной поставки
	
	Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Сделка") Тогда
		
		Сделка = ВыборкаДетальныеЗаписи.Регистратор;
		
	ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
		
		Сделка = ВыборкаДетальныеЗаписи.Регистратор.Основание;
		
	ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
		
		Сделка = ВыборкаДетальныеЗаписи.Регистратор.Основание;
		
		СтрокиПоставок = ПоставкиПоПокупкам.НайтиСтроки(Новый Структура("Основание", Сделка));
		Если СтрокиПоставок.Количество() = 2 Тогда // Самый частый и простой вариант: одна сделка - одна поставка
			
			Если СтрокиПоставок[0].Количество <> СтрокиПоставок[1].Количество Тогда
				ПолноеИсполнение = Ложь;
			КонецЕсли;
			
		Иначе // начали считать
			ПолноеИсполнение = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	НачисленоРуб = 0;
	НачисленоВал = 0;
	
	ОплаченоРуб = 0;
	ОплаченоВал = 0;
	
	СтрокиКомиссии = КомиссииПоПокупкам.НайтиСтроки(Новый Структура("Основание", Сделка));
	
	Для каждого СтрокаКомиссии Из СтрокиКомиссии Цикл
		
		Если СтрокаКомиссии.Период > КонецДня(ВыборкаДетальныеЗаписи.Период) Тогда
			Прервать;
		КонецЕсли;
		
		СуммаРуб = СтрокаКомиссии.Сумма * СтрокаКомиссии.Курс;
		СуммаВал = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаРуб, ЭтотОбъект.Организация.ВалютаУчета, СтрокаКомиссии.Период, ВалютаНоминала, СтрокаКомиссии.Период);
		
		
	#Область РасчетЧастичнойПоставки
		
		Если НЕ ПолноеИсполнение Тогда // редчайший случай, когда у нас идет частичная поставка
			
			КоличествоКПоставке = 0; // Количество бумаг по сделке
			КоличествоПоставлено = 0;
			
			СуммаРубПризнано = 0; // расчитаем, сколько уже признали расходов
			СуммаВалПризнано = 0;
			
			Для каждого СтрокаПоставок Из СтрокиПоставок Цикл
			
				Если СтрокаПоставок.ВидДвижения = ВидДвиженияНакопления.Приход Тогда // это сделка или 
				
					КоличествоКПоставке = КоличествоКПоставке + СтрокаПоставок.Количество;
					
				Иначе
					
					КоличествоПоставлено = КоличествоПоставлено + СтрокаПоставок.Количество;

					Если СтрокаПоставок.Регистратор = ВыборкаДетальныеЗаписи.Регистратор Тогда // Наша поставка
						
						Если КоличествоПоставлено = КоличествоКПоставке Тогда // наша поставка последняя - заметаем все под коврик
							
							СуммаРуб = СуммаРуб - СуммаРубПризнано;
							СуммаВал = СуммаВал - СуммаВалПризнано;
							
						Иначе
							
							СуммаРуб = Окр(СуммаРуб / КоличествоКПоставке * СтрокаПоставок.Количество);
							СуммаВал = Окр(СуммаВал / КоличествоКПоставке * СтрокаПоставок.Количество);
						
						КонецЕсли;
						
						Прервать;
						
					Иначе // это мы считаем, сколько мы признавали при предыдущих поставках
						
						СуммаРубПризнано = Окр(СуммаРуб / КоличествоКПоставке * СтрокаПоставок.Количество);
						СуммаВалПризнано = Окр(СуммаВал / КоличествоКПоставке * СтрокаПоставок.Количество);
						
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЕсли;
		
	#КонецОбласти		
		
		Если СтрокаКомиссии.ВидДвижения = ВидДвиженияНакопления.Приход Тогда // начисление
			
			НачисленоРуб = НачисленоРуб + СуммаРуб;
			
		Иначе // оплата
			
			ОплаченоРуб = ОплаченоРуб + СуммаРуб;
			ОплаченоВал = ОплаченоВал + СуммаВал;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НачисленоРуб = НачисленоРуб - ОплаченоРуб;
	НачисленоВал = РаботаСВалютами.ПересчетСуммыВВалюте(НачисленоРуб, ЭтотОбъект.Организация.ВалютаУчета, ВыборкаДетальныеЗаписи.Период, ВалютаНоминала, ВыборкаДетальныеЗаписи.Период);
	
	Возврат Новый Структура("РасходыПриПокупкеВСтоимости, РасходыПриПокупкеВСтоимостиВВалютеУчета", ОплаченоВал + НачисленоВал, ОплаченоРуб + НачисленоРуб);
	
КонецФункции

Функция ЗаполнитьНестандартныеДвиженияПартий()

	МакетДанных = ЭтотОбъект.ПолучитьМакет("НестандартныеДвиженияПартий");
	
	ТаблицаНестандартныеДвиженияПартий = ЭтотОбъект.РассчитанныеПартии.Выгрузить();
	ТаблицаНестандартныеДвиженияПартий.Очистить();
	
	ТаблицаНестандартныеДвиженияПартий.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка"));
	
	Для ИндексСтрок = 2 По МакетДанных.ВысотаТаблицы Цикл
	
		Если СокрЛп(ЭтотОбъект.ВидУчета) <> СокрЛП(МакетДанных.Область(ИндексСтрок, 6).Текст) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтотОбъект.Организация <> ЗначениеИзСтрокиВнутр(МакетДанных.Область(ИндексСтрок, 4).Текст) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтотОбъект.СчетДоверительногоУправления <> ЗначениеИзСтрокиВнутр(МакетДанных.Область(ИндексСтрок, 5).Текст) Тогда
			Продолжить;
		КонецЕсли;
		
		ПериодДвижения = Дата(МакетДанных.Область(ИндексСтрок, 3).Текст);
		
		Если ПериодДвижения < ЭтотОбъект.НачалоПериода ИЛИ ПериодДвижения > ЭтотОбъект.КонецПериода Тогда
		    Продолжить;
		КонецЕсли;
		
		СтрокаТаблицаНестандартныеДвиженияПартий = ТаблицаНестандартныеДвиженияПартий.Добавить();
		
		Для ИндексКолонок = 1 По МакетДанных.ШиринаСтраницы Цикл
		
			ИмяКолонки = МакетДанных.Область(1, ИндексКолонок).Текст;
			
			Значение = МакетДанных.Область(ИндексСтрок, ИндексКолонок).Текст;
			Если Значение = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИмяКолонки = "Регистратор" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.Регистратор = ЗначениеИзСтрокиВнутр(Значение);
			ИначеЕсли ИмяКолонки = "ВидДвижения" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.ВидДвижения = ?(Значение = "Расход", ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			ИначеЕсли ИмяКолонки = "Период" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.Период = Дата(Значение);
			ИначеЕсли ИмяКолонки = "Организация" Тогда
			ИначеЕсли ИмяКолонки = "СчетДоверительногоУправления" Тогда
			ИначеЕсли ИмяКолонки = "ВидУчета" Тогда
			ИначеЕсли ИмяКолонки = "Рынок" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.Рынок = Перечисления.РынкиЦенныхБумаг[Значение];
			ИначеЕсли ИмяКолонки = "ЦеннаяБумага" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.ЦеннаяБумага = ЗначениеИзСтрокиВнутр(Значение);
			ИначеЕсли ИмяКолонки = "Партия" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.Партия = ЗначениеИзСтрокиВнутр(Значение);
			ИначеЕсли ИмяКолонки = "УчетныйАктивЕПС" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.УчетныйАктивЕПС = ЗначениеИзСтрокиВнутр(Значение);
			//ИначеЕсли ИмяКолонки = "СписаниеПогрешностиОкругления" Тогда
			//	СтрокаТаблицаНестандартныеДвиженияПартий.СписаниеПогрешностиОкругления = ?(Значение = "Нет", Ложь, Истина);
			ИначеЕсли ИмяКолонки = "Содержание" Тогда
				СтрокаТаблицаНестандартныеДвиженияПартий.Содержание = Значение;
			Иначе
				СтрокаТаблицаНестандартныеДвиженияПартий[ИмяКолонки] = Число(Значение);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаНестандартныеДвиженияПартий;

КонецФункции

Функция ПолучитьИзмененияКурсовВалют()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалют.Период КАК Период,
		|	КурсыВалют.Валюта КАК Валюта,
		|	КурсыВалют.Курс КАК Курс,
		|	КурсыВалют.Кратность КАК Кратность
		|ПОМЕСТИТЬ _КурсыЗаПериод
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период >= &НачалоВзятия
		|	И КурсыВалют.Период <= &ОкончаниеПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Периоды.Период КАК Период,
		|	МАКСИМУМ(_ПредыдущиеПериоды.Период) КАК ПредыдущийПериод,
		|	_Периоды.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Периоды
		|ИЗ
		|	_КурсыЗаПериод КАК _Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыЗаПериод КАК _ПредыдущиеПериоды
		|		ПО _Периоды.Валюта = _ПредыдущиеПериоды.Валюта
		|			И _Периоды.Период > _ПредыдущиеПериоды.Период
		|ГДЕ
		|	_Периоды.Период >= &НачалоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	_Периоды.Валюта,
		|	_Периоды.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Периоды.Валюта КАК Валюта,
		|	_Периоды.Период КАК Период,
		|	ВЫБОР
		|		КОГДА _КурсыЗаПериод.Курс = _КурсыЗаПредыдущийПериод.Курс
		|				И _КурсыЗаПериод.Кратность = _КурсыЗаПредыдущийПериод.Кратность
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК КурсИзменился
		|ИЗ
		|	_Периоды КАК _Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыЗаПериод КАК _КурсыЗаПериод
		|		ПО _Периоды.Валюта = _КурсыЗаПериод.Валюта
		|			И _Периоды.Период = _КурсыЗаПериод.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыЗаПериод КАК _КурсыЗаПредыдущийПериод
		|		ПО _Периоды.Валюта = _КурсыЗаПредыдущийПериод.Валюта
		|			И _Периоды.ПредыдущийПериод = _КурсыЗаПредыдущийПериод.Период";
	
	Запрос.УстановитьПараметр("НачалоВзятия", НачалоДня(ЭтотОбъект.НачалоПериода) - 24 * 60 * 60);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция КурсВалютыИзменился(ИзмененияКурсовВалют, Валюта, Период); 

	Возврат	ИзмененияКурсовВалют.НайтиСтроки(Новый Структура("Валюта, Период", Валюта, Период))[0].КурсИзменился;

КонецФункции 

Функция ПолучитьРешенияКлиентовПоЗначениямЭСП()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РешенияКлиентовПоЗначениямЭСП.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РешенияКлиентовПоЗначениямЭСП.Партия КАК Партия,
		|	РешенияКлиентовПоЗначениямЭСП.СтрокаПартии КАК СтрокаПартии,
		|	РешенияКлиентовПоЗначениямЭСП.ЭСП КАК ЭСП
		|ИЗ
		|	РегистрСведений.РешенияКлиентовПоЗначениямЭСП КАК РешенияКлиентовПоЗначениямЭСП
		|ГДЕ
		|	РешенияКлиентовПоЗначениямЭСП.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И РешенияКлиентовПоЗначениямЭСП.Организация = &Организация
		|	И РешенияКлиентовПоЗначениямЭСП.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РешенияКлиентовПоЗначениямЭСП.Активность
		|	И РешенияКлиентовПоЗначениямЭСП.Используется";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ЭтотОбъект.КонецПериода));
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ЗаполнитьКолонкиРассчитанныеПартии()

	Колонки = Новый Структура;
	Для Каждого Колонка Из Метаданные.Обработки.РасчетПартий.ТабличныеЧасти.РассчитанныеПартии.Реквизиты Цикл
		Колонки.Вставить(Колонка.Имя);
	КонецЦикла;
	Возврат Новый ФиксированнаяСтруктура(Колонки);
	
КонецФункции 

Функция ПересчитатьДанныеСделкиВВалютуНоминала(ДатаКурса, ДанныеДляРаспределения, ВыборкаДетальныеЗаписи, ВалютаНоминала, ТаблицаРасходыПоСделкеСЗамещающимиОблигациями = Неопределено, ВалютаУчета, Отказ)
	
	ВалютаСделки = ВыборкаДетальныеЗаписи.ВалютаСделки;		

	ДанныеДляРаспределения.СтоимостьПокупки = РаботаСВалютами.ПересчетСуммыВВалюте(ДанныеДляРаспределения.СтоимостьПокупки, ВалютаСделки, ДатаКурса, ВалютаНоминала, ДатаКурса, Отказ);
	ДанныеДляРаспределения.СтоимостьПокупкиКупона = РаботаСВалютами.ПересчетСуммыВВалюте(ДанныеДляРаспределения.СтоимостьПокупкиКупона, ВалютаСделки, ДатаКурса, ВалютаНоминала, ДатаКурса, Отказ);
	
	СуммыПрихода = Новый Структура();
	СуммыПрихода.Вставить("СтоимостьПокупкиВВалютеУчета", ДанныеДляРаспределения.СтоимостьПокупки);
	СуммыПрихода.Вставить("СтоимостьПокупкиКупонаВВалютеУчета", ДанныеДляРаспределения.СтоимостьПокупкиКупона);
	СуммыПрихода.Вставить("РасходыПриПокупкеВСтоимостиВВалютеУчета", ДанныеДляРаспределения.РасходыПриПокупкеВСтоимости);
		
	РаботаСВалютами.ПолучитьСуммыВВалютеУчета(СуммыПрихода, ВалютаНоминала, ЭтотОбъект.Организация, ВыборкаДетальныеЗаписи.Период, , Отказ);
	ДанныеДляРаспределения.СтоимостьПокупкиВВалютеУчета = СуммыПрихода.СтоимостьПокупкиВВалютеУчета;
	ДанныеДляРаспределения.СтоимостьПокупкиКупонаВВалютеУчета = СуммыПрихода.СтоимостьПокупкиКупонаВВалютеУчета;
	ДанныеДляРаспределения.РасходыПриПокупкеВСтоимостиВВалютеУчета = СуммыПрихода.РасходыПриПокупкеВСтоимостиВВалютеУчета;
	
	Если ВалютаСделки = ВалютаУчета И ВалютаСделки <> ВалютаНоминала И ТаблицаРасходыПоСделкеСЗамещающимиОблигациями <> Неопределено Тогда
		ОтборТаблицыРасходыПоСделке = Новый Структура();
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Сделка") Тогда
			ОтборТаблицыРасходыПоСделке.Вставить("Сделка", ВыборкаДетальныеЗаписи.Регистратор);
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке")
			Или ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
			ОтборТаблицыРасходыПоСделке.Вставить("Сделка", ВыборкаДетальныеЗаписи.Основание);
		Иначе
			ОтборТаблицыРасходыПоСделке.Вставить("Сделка", ВыборкаДетальныеЗаписи.Регистратор);
		КонецЕсли;	
			
		ОтборТаблицыРасходыПоСделке.Вставить("ЦеннаяБумага", ВыборкаДетальныеЗаписи.ЦеннаяБумага);
		СтрокиТаблицыРасходыПоСделке = ТаблицаРасходыПоСделкеСЗамещающимиОблигациями.НайтиСтроки(ОтборТаблицыРасходыПоСделке);
		
		РасходыПриПокупкеВСтоимости = 0;
		РасходыПриПокупкеСНачалаГода = 0;
		
		Для Каждого СтрокаТаблицыРасходыПоСделке Из СтрокиТаблицыРасходыПоСделке Цикл
			СуммаРасходыПриПокупкеВСтоимости = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаТаблицыРасходыПоСделке.СуммаОборот, ВалютаСделки, СтрокаТаблицыРасходыПоСделке.Период, ВалютаНоминала, СтрокаТаблицыРасходыПоСделке.Период, Отказ);
			РасходыПриПокупкеВСтоимости = РасходыПриПокупкеВСтоимости + Окр(СуммаРасходыПриПокупкеВСтоимости, 2);
			РасходыПриПокупкеСНачалаГода = РасходыПриПокупкеСНачалаГода + Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаРасходыПриПокупкеВСтоимости, ВалютаСделки, ЭтотОбъект.Организация, СтрокаТаблицыРасходыПоСделке.Период, Отказ), 2);
		КонецЦикла;	
			
		ДанныеДляРаспределения.РасходыПриПокупкеВСтоимости = РасходыПриПокупкеВСтоимости;
		ДанныеДляРаспределения.РасходыПриПокупкеСНачалаГода = РасходыПриПокупкеСНачалаГода;
			
	Иначе	
		ДанныеДляРаспределения.РасходыПриПокупкеВСтоимости = РаботаСВалютами.ПересчетСуммыВВалюте(ДанныеДляРаспределения.РасходыПриПокупкеВСтоимости, ВалютаСделки, ДатаКурса, ВалютаНоминала, ДатаКурса, Отказ);
		ДанныеДляРаспределения.РасходыПриПокупкеСНачалаГода = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ДанныеДляРаспределения.РасходыПриПокупкеВСтоимости, ВалютаСделки, ЭтотОбъект.Организация, ДатаКурса, Отказ);
	КонецЕсли;	
	
КонецФункции

Процедура ПроверитьНарушенияДатЗапрета(Запрос, ИмяВременнойТаблицы, ИмяРегистра, Отказ)

	Выборка = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, ИмяВременнойТаблицы).Выбрать();
	Если Выборка.Следующий() Тогда
	
		ПредставлениеРегистра = Метаданные.РегистрыНакопления[ИмяРегистра].Представление();
		ПредставлениеРегистра = ПредставлениеРегистра + "' по виду учета '" + ВидУчета;
		
		ТекстСообщения = СтрШаблон("Запрещено редактирование регистра '%1', т.к. период меньше даты запрета редактирования",
			ПредставлениеРегистра + "' по документу '" + Выборка.Регистратор);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Регистратор, , , Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

КонечныеОстаткиПартийКПоступлению = ЭтотОбъект.КонечныеОстаткиПартий.Выгрузить();
КонечныеОстаткиПартийКупленныхПоРепо = ЭтотОбъект.КонечныеОстаткиПартий.Выгрузить();
КонечныеОстаткиПартийПроданныхВРепо = ЭтотОбъект.КонечныеОстаткиПартий.Выгрузить();
КонечныеОстаткиПартийСрочныеКонтракты = ЭтотОбъект.КонечныеОстаткиПартий.Выгрузить();

МассивТиповПродажиРЕПО = Новый Массив;
МассивТиповПродажиРЕПО.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
МассивТиповПродажиРЕПО.Добавить(Тип("ДокументСсылка.ПоставкаЦенныхБумаг"));
МассивТиповПродажиРЕПО.Добавить(Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке"));

КонечныеОстаткиПартийПроданныхВРепо.Колонки.Добавить("ПродажаРЕПО", Новый ОписаниеТипов(МассивТиповПродажиРЕПО));
КонечныеОстаткиПартийПроданныхВРепо.Колонки.Добавить("СтрокаПродажиРЕПО", Новый ОписаниеТипов("Число"));

ТаблицаПлановыхОпераций = Неопределено;
