
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЭтоВыводПоОбменуПаев = ТипЗнч(Данные.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;
			
	Если Данные.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику Тогда
		Представление = "Вывод д/с при погашении паев ";
	ИначеЕсли ЭтоВыводПоОбменуПаев Тогда
		Представление = "Вывод д/с по обмену паев ";	
	Иначе
		Представление = "Вывод денежных средств ";
	КонецЕсли;

	Представление = Представление + СокрЛП(Данные.Номер) + " от " + Данные.Дата;
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВидОперации");
	Поля.Добавить("Основание");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Функция ПолучитьДанныеЗаполненияПоЗаявкеПайщика(Основание, МоментВремени) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.Организация КАК Организация,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.ЗаявкаПайщика)
	|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.ЗаявкаПайщика).РасчетныйСчет
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК РасчетныйСчетКонтрагента,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаОборот КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОжидаетсяНачислениеНДФЛ
	|ПОМЕСТИТЬ _Задолженность
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			,
	|			Организация = &Организация
	|				И Основание = &Основание
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПередПайщиками)
	|				И НЕ Аванс) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленияНалоговОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НачисленияНалоговОбороты.Налогоплательщик КАК Налогоплательщик,
	|	НачисленияНалоговОбороты.СуммаОборот КАК СуммаНДФЛ,
	|	НачисленияНалоговОбороты.БазаНалогаОборот КАК БазаНалога,
	|	РасчетНДФЛПайщиковНалоговаяБаза.Основание КАК ЗаявкаПайщика,
	|	НачисленияНалоговОбороты.Основание КАК РасчетНДФЛПайщиков
	|ПОМЕСТИТЬ _НачислениеНалога
	|ИЗ
	|	РегистрНакопления.НачисленияНалогов.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			Регистратор,
	|			Организация = &Организация
	|				И Налогоплательщик = &Пайщик
	|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.РасчетНДФЛПайщиков)) КАК НачисленияНалоговОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛПайщиков.НалоговаяБаза КАК РасчетНДФЛПайщиковНалоговаяБаза
	|		ПО НачисленияНалоговОбороты.Основание = РасчетНДФЛПайщиковНалоговаяБаза.Ссылка
	|			И НачисленияНалоговОбороты.Налогоплательщик = РасчетНДФЛПайщиковНалоговаяБаза.Пайщик
	|			И (РасчетНДФЛПайщиковНалоговаяБаза.Основание = &Основание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсполнителиПоДенежнымСредствамСобственные.Организация КАК Организация,
	|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет
	|ПОМЕСТИТЬ _РасчетныйСчет
	|ИЗ
	|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
	|ГДЕ
	|	(ИсполнителиПоДенежнымСредствамСобственные.Организация, ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				_Задолженность.Организация КАК Организация,
	|				_Задолженность.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|			ИЗ
	|				_Задолженность КАК _Задолженность)
	|	И НЕ ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Транзитный
	|	И НЕ ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.ТранзитныйПИФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Задолженность.Организация КАК Организация,
	|	_Задолженность.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_Задолженность.Основание КАК Основание,
	|	_Задолженность.Контрагент КАК Контрагент,
	|	_Задолженность.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента,
	|	_Задолженность.Сумма КАК Сумма,
	|	_РасчетныйСчет.РасчетныйСчет КАК РасчетныйСчет,
	|	ЕСТЬNULL(_НачислениеНалога.СуммаНДФЛ, 0) КАК СуммаНДФЛ,
	|	_Задолженность.ОжидаетсяНачислениеНДФЛ КАК ОжидаетсяРасчетНДФЛ,
	|	ВЫБОР
	|		КОГДА _НачислениеНалога.РасчетНДФЛПайщиков ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьРасчетНДФЛ
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|		ЛЕВОЕ СОЕДИНЕНИЕ _РасчетныйСчет КАК _РасчетныйСчет
	|		ПО _Задолженность.Организация = _РасчетныйСчет.Организация
	|			И _Задолженность.СчетДоверительногоУправления = _РасчетныйСчет.СчетДоверительногоУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НачислениеНалога КАК _НачислениеНалога
	|		ПО _Задолженность.Контрагент = _НачислениеНалога.Налогоплательщик
	|			И _Задолженность.Основание = _НачислениеНалога.ЗаявкаПайщика";
	
	Запрос.УстановитьПараметр("Основание", Основание); 
	Запрос.УстановитьПараметр("Организация", Основание.Организация);
	Запрос.УстановитьПараметр("Пайщик", Основание.Пайщик); 
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(МоментВремени, ВидГраницы.Исключая));
	
	Данные = Запрос.Выполнить().Выгрузить(); 
	Результат = Новый Структура();
	
	Для Каждого СтрокаДанные Из Данные Цикл
		Результат = РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(СтрокаДанные);
		Возврат Результат;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

