
#Область Сведения_о_внешней_обработке

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительныйОтчет",
		"Отчет по деятельности ОПС № 0420254 / 0420255",
		"2.68",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область Автоматизация_формирования_отчета

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("ФорматВывода");	
	Настройки.Добавить("ВывестиКолонкиДляФормы264");
	Настройки.Добавить("ВидДоговораДоверительногоУправления");
	Настройки.Добавить("СформироватьРазделДоходностиПоУК");
	
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	Отказ = Ложь;
	
	Если ЭтотОбъект.СформироватьРазделДоходностиПоУК Тогда
		
		// Дозаполняем реквизиты отчета
		ЭтотОбъект.Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
		ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления[СокрЛП(НастройкиОтчета.ВидДоговораДоверительногоУправления)];
		ЭтотОбъект.СтандартМСФО = СтандартМСФОИзНастроек(Клиент, Отказ); 
		
	КонецЕсли;
	
	Если Отказ Тогда
		НастройкиОтчета.Вставить("Отказ");
		Возврат;
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;	
	
	СформироватьОтчет(ДокументРезультат, , Неопределено, Отказ);
	
	Если Отказ Тогда
		НастройкиОтчета.Вставить("Отказ");
		Возврат;
	КонецЕсли;
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда	
		НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Формирование_отчета

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	Если ЭтотОбъект.СформироватьРазделДоходностиПоУК Тогда
		ПроверяемыеРеквизиты.Добавить("Клиент");
		ПроверяемыеРеквизиты.Добавить("ВидДоговораДоверительногоУправления");
		ПроверяемыеРеквизиты.Добавить("СтандартМСФО");
	Иначе
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
	КонецЕсли;
	
	// Проверяем дату запрета редактирования проводок ЕПС
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", 							ЭтотОбъект.Период.ДатаНачала);	
	Запрос.УстановитьПараметр("КонецПериода", 							ЭтотОбъект.Период.ДатаОкончания);	
	Запрос.УстановитьПараметр("Организация", 							ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления", 	ЭтотОбъект.ВидДоговораДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 			ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Клиент",									ЭтотОбъект.Клиент);		
	Запрос.УстановитьПараметр("СформироватьРазделДоходностиПоУК",		СформироватьРазделДоходностиПоУК);
	
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
	    |ПОМЕСТИТЬ _СчетаДоверительногоУправления
	    |ИЗ
	    |	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	    |			&КонецПериода,
	    |			Организация = &Организация
	    |				И ВЫБОР
	    |					КОГДА &СформироватьРазделДоходностиПоУК
	    |						ТОГДА Клиент = &Клиент
	    |								И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
	    |					ИНАЧЕ СчетДоверительногоУправления = &СчетДоверительногоУправления
	    |				КОНЕЦ
	    |				И (СчетДоверительногоУправления.ДатаРасторжения > &НачалоПериода
	    |					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КлиентыДоверительногоУправленияСрезПоследних";
		
	Выборка = Запрос.Выполнить();
	
	Если РаботаСОтчетами.ЕстьДатыЗапретаРедактированияСчетовДоверительногоУправленияДоДатыПроверки(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект.Период.ДатаОкончания, ЭтотОбъект.Организация, Перечисления.ГруппыЗапретаРедактирования.Проводки, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет) Тогда	
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не сформирован");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	СтрСохраняемыеДанные = ?(ЭтотОбъект.СформироватьРазделДоходностиПоУК, "Период,Организация,Клиент,ВидДоговораДоверительногоУправления", "Период,Организация,СчетДоверительногоУправления,ФорматВывода");
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, ЭтотОбъект);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Процедура СформироватьОтчет(ДокументРезультат, АдресВХранилище = "", АдресВХранилищеСДаннымиДляРасшифровки = "", Отказ = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.СформироватьРазделДоходностиПоУК И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Клиент, "ВидЮрФизЛица") <> Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбран клиент-физическое лицо",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// С этой даты обновляются заголовки у фин. реза. Сумма фин. реза приведена в соответствие заголовку.
	ДатаОбновленияЗаголовкаФинРезультата = '20220101';
	
	ДокументРезультат.Очистить();
	
	Если ЭтотОбъект.СформироватьРазделДоходностиПоУК Тогда
		ВариантФормы = ?(ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами, "0420254", "0420255");		
	ИначеЕсли СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда
		ВариантФормы = "0420254";
	ИначеЕсли СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда
		ВариантФормы = "0420255";
	Иначе
		ВызватьИсключение "Неверный вид договора доверительного управления: " + СчетДоверительногоУправления.ВидДоговораДоверительногоУправления;
	КонецЕсли;
	
	//Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,Клиент,ВидДоговораДоверительногоУправления,СчетДоверительногоУправления,ФорматВывода,СформироватьРазделДоходностиПоУК");	
	ДопИмя = ?(ЭтотОбъект.СформироватьРазделДоходностиПоУК, ".ДоходностьПоУК" , "");
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ДопИмя;
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	РаботаСОтчетами.ЗапомнитьКлючВариантаОтчета(ЭтотОбъект, ВариантФормы); 
	
	ДанныеОтчета = ПолучитьДанныеОтчета(ВариантФормы, ЭтотОбъект.СформироватьРазделДоходностиПоУК, ДатаОбновленияЗаголовкаФинРезультата);
	Если ДанныеОтчета.Свойство("Отказ") Тогда
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
		
	Если Не ЭтотОбъект.СформироватьРазделДоходностиПоУК Тогда  	
				
		Если ВариантФормы = "0420254" Тогда
			МакетОтчета = ПолучитьМакет("Макет17Подраздел1");                            		
		ИначеЕсли ВариантФормы = "0420255" И ЭтотОбъект.Период.ДатаОкончания >= '20190419' Тогда // Дата публикации нового указания ЦБ
			МакетОтчета = ПолучитьМакет("Макет51_Ред20190404");	
		ИначеЕсли ВариантФормы = "0420255" Тогда
			МакетОтчета = ПолучитьМакет("Макет51");
		Иначе 
			ВызватьИсключение "Нет макета для варианта формы: " + ВариантФормы;
		КонецЕсли;
		
		УстановитьФорматРесурсов(МакетОтчета);
		
		ОбластьШапка  = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрока = МакетОтчета.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьИтогов = МакетОтчета.ПолучитьОбласть("СтрокаИтогов");
		
		Если ВариантФормы = "0420254" Тогда
			ЗаголовокКолонкиФинРеза = "Финансовый результат от размещения средств пенсионных резервов (до выплаты вознаграждения управляющей компании)";
			ЗаголовокКолонкиФинРеза_Таблица2 = "Финансовый результат от размещения средств пенсионных резервов (до выплаты вознаграждения управляющей компании), в том числе:";
			
			Если ЭтотОбъект.Период.ДатаНачала >= ДатаОбновленияЗаголовкаФинРезультата Тогда
				ЗаголовокКолонкиФинРеза = "Финансовый результат от размещения средств пенсионных резервов (до выплаты вознаграждения управляющей компании, специализированному депозитарию и фонду)";
				ЗаголовокКолонкиФинРеза_Таблица2 = "Финансовый результат от размещения средств пенсионных резервов (до выплаты вознаграждения фонду), в том числе:";
			КонецЕсли;
		Иначе
			ЗаголовокКолонкиФинРеза = "Финансовый результат от инвестирования средств пенсионных накоплений (до выплаты вознаграждения управляющей компании)";
			ЗаголовокКолонкиФинРеза_Таблица2 = "Финансовый результат от инвестирования пенсионных накоплений (до выплаты вознаграждения управляющей компании), в том числе:";
			
			Если ЭтотОбъект.Период.ДатаНачала >= ДатаОбновленияЗаголовкаФинРезультата Тогда
				ЗаголовокКолонкиФинРеза = "Финансовый результат от инвестирования средств пенсионных накоплений (до вычета вознаграждения фонду)";
				ЗаголовокКолонкиФинРеза_Таблица2 = "Финансовый результат от инвестирования пенсионных накоплений (до выплаты вознаграждения фонду), в том числе:";
			КонецЕсли;
		КонецЕсли;	
		
		ЗаголовокКолонкиФинРеза = ЗаголовокКолонкиФинРеза + ?(ЭтотОбъект.ФорматВывода = 0, ", тыс. руб.", ", руб.");
		ОбластьШапка.Параметры.Заполнить(ДанныеОтчета);
		ОбластьШапка.Параметры.ЗаголовокКолонкиФинРеза = ЗаголовокКолонкиФинРеза;
				
		ОбластьСтрока.Параметры.Заполнить(ДанныеОтчета);
		ОбластьИтогов.Параметры.Заполнить(ДанныеОтчета);

		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьСтрока);
		ДокументРезультат.Вывести(ОбластьИтогов);

		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		
		Если ВариантФормы = "0420254" Тогда
			МакетОтчета = ПолучитьМакет("Макет17Подраздел2");
		ИначеЕсли ВариантФормы = "0420255" Тогда
			МакетОтчета = ПолучитьМакет("Макет52");
		Иначе 
			ВызватьИсключение "Нет макета для варианта формы: " + ВариантФормы;
		КонецЕсли;
		
		УстановитьФорматРесурсов(МакетОтчета);
		
		МакетОтчета.Параметры.Заполнить(ДанныеОтчета);
		МакетОтчета.Параметры.ЗаголовокКолонкиФинРеза_Таблица2 = ЗаголовокКолонкиФинРеза_Таблица2;
		
		// Ресурсы по которым считается доля в %
		РесурсыСДолей = Новый Структура("ФинансовыйРезультатВсего, ДивидендыИПроценты, РеализацияАктивов, ИзменениеРыночнойСтоимости, ДругиеВидыДохода");
		ЗаполнитьЗначенияСвойств(РесурсыСДолей, ДанныеОтчета);
		Если ДанныеОтчета.ФинансовыйРезультат <> 0 Тогда
			Для каждого КлючИЗнач из РесурсыСДолей Цикл
				МакетОтчета.Параметры[СокрЛП(КлючИЗнач.Ключ) + "Доля"] = 100 * КлючИЗнач.Значение / ДанныеОтчета.ФинансовыйРезультат; 	
			КонецЦикла;
		КонецЕсли;			
		
		ДокументРезультат.Вывести(МакетОтчета);
		
	ИначеЕсли ЭтотОбъект.Период.ДатаОкончания >= '20210930' И ЭтотОбъект.СформироватьРазделДоходностиПоУК Тогда  			
		
		// Выводим новый раздел с 01.10.2021 				
		ПодготовитьИВывестиРезультатПоДоходностиУК(ДокументРезультат, ДанныеОтчета, АдресВХранилище, АдресВХранилищеСДаннымиДляРасшифровки, Отказ); 
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);		
			
КонецПроцедуры

Процедура УстановитьФорматРесурсов(МакетОтчета)
	
	Если ЭтотОбъект.ФорматВывода = 1 Тогда
		МакетОтчета.Область("ОбластьРесурсы").Формат = "ЧДЦ=2";
		Для СчГор = 1 по МакетОтчета.ШиринаТаблицы Цикл
			Для СчВерт = 1 по МакетОтчета.ВысотаТаблицы Цикл
				Ячейка = МакетОтчета.Область(СчГор, СчВерт);
				Если СтрНайти(Ячейка.Текст, " тыс.") Тогда
					Ячейка.Текст = СтрЗаменить(Ячейка.Текст, " тыс.", "");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ЭтотОбъект.ФорматВывода = 0 Тогда
		МакетОтчета.Область("ОбластьРесурсы").Формат = "ЧДЦ=5; ЧС=3";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеОтчета(ВариантФормы, ТолькоОсновныеДанные, ДатаОбновленияЗаголовкаФинРезультата)
	
	ВидыСубконтоГФУ = ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов;
	
	ДанныеОтчета = Новый Структура;
	
	ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",			Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ЮрФизЛицо",		ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ОГРН
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)
		|					И ЮрФизЛицо = &ЮрФизЛицо) КАК ДокументыЮридическихЛицСрезПоследних
		|		ПО (ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &Период)";
	
	ДанныеЮрЛицаОрганизации = Запрос.Выполнить().Выгрузить();
	
	Если ДанныеЮрЛицаОрганизации.Количество() = 0 Тогда
		ВызватьИсключение "Не указаны реквизиты юр. лица " + ЮрФизЛицо;
	КонецЕсли;
	
	// Справочные данные
	ДанныеОтчета.Вставить("НомерСтроки", 1);
	ДанныеОтчета.Вставить("ИНН",  		 ДанныеЮрЛицаОрганизации[0].ИНН);
	ДанныеОтчета.Вставить("ОГРН",        ДанныеЮрЛицаОрганизации[0].ОГРН);
	
	ДанныеОтчета.Вставить("ПредставлениеОрганизации", ДанныеЮрЛицаОрганизации[0].КраткоеНаименованиеПоУставу);
	ДанныеОтчета.Вставить("НаименованиеУК", 		ДанныеЮрЛицаОрганизации[0].КраткоеНаименованиеПоУставу);
	ДанныеОтчета.Вставить("ИдентификаторУК", 		ДанныеЮрЛицаОрганизации[0].ПолноеНаименованиеПоУставу + "_" + ДанныеОтчета.ИНН + "_" + ДанныеОтчета.ОГРН);
	ДанныеОтчета.Вставить("ИдентификаторУК_ИНН", 	ДанныеОтчета.ИНН);
	ДанныеОтчета.Вставить("ИдентификаторУК_ОГРН", 	ДанныеОтчета.ОГРН);
	
	ДанныеОтчета.Вставить("ПредставлениеПериода", "с " + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	ДанныеОтчета.Вставить("НомерДоговора",        ЭтотОбъект.СчетДоверительногоУправления.НомерДоговора);
	
	ДанныеОтчета.Вставить("ДатаДоговора",          Формат(ЭтотОбъект.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
	ДанныеОтчета.Вставить("ДатаДоговораПолностью", Формат(ЭтотОбъект.СчетДоверительногоУправления.ДатаЗаключения, "ДФ='«dd» MMMM yyyy'"));
	
	КлиентДоверительногоУправления = ?(ЭтотОбъект.СформироватьРазделДоходностиПоУК, ЭтотОбъект.Клиент, Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления));
	Если ТипЗнч(КлиентДоверительногоУправления) = Тип("СправочникСсылка.ЮрФизЛица") Тогда		
		ПредставлениеЮрФизЛица = РегистрыСведений.РеквизитыЮридическихЛиц.СрезПоследних(Период.ДатаОкончания, Новый Структура("ЮрФизЛицо,Подразделение,Язык", КлиентДоверительногоУправления, Справочники.Подразделения.ГруппаКомпаний, Справочники.Языки.Русский))[0].КраткоеНаименованиеПоУставу;		
	КонецЕсли;
	
	ДанныеОтчета.Вставить("ПредставлениеЮрФизЛица", ПредставлениеЮрФизЛица);
	
	Если ТолькоОсновныеДанные Тогда
		Возврат ДанныеОтчета;
	КонецЕсли;
		
	// Показатели
	
	ДанныеОтчета.Вставить("ОплатаУслугУК",        ПолучитьВознаграждениеУК());
	
	СР = СуммаРезервовПриПереходеНаМСФО9();
		
	ФинРез = -ОборотЕПС("Сч 710,712,713,715,717,718,720,725,727,728 КорСч !479") - СР;
	ДанныеОтчета.Вставить("ФинансовыйРезультат", Финрез);
	ДанныеОтчета.Вставить("ФинансовыйРезультатВсего",  Финрез);
	
	Если ВариантФормы = "0420254" И ЭтотОбъект.Период.ДатаНачала >= ДатаОбновленияЗаголовкаФинРезультата Тогда
		ВознаграждениеСпецдепа = ПолучитьВознаграждениеСпецдепозитария();
		ДанныеОтчета.Вставить("ФинансовыйРезультат", Финрез + ВознаграждениеСпецдепа);				
		ДанныеОтчета.Вставить("ФинансовыйРезультатВсего",  Финрез - ДанныеОтчета.ОплатаУслугУК);
	КонецЕсли;
		
	ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов;
		
	ДанныеОтчета.Вставить("ОборотыПоСделкам",				0);
	ДанныеОтчета.Вставить("ОборотыПоСделкамНебиржевым",		0);
	ДанныеОтчета.Вставить("ОборотыПоСделкамБиржевым",		0);
	
	ЗаполнитьОборотыПоСделкам(ДанныеОтчета);
	
	ДанныеОтчета.Вставить("ОплатаУслугБрокера",     		  0);
	ДанныеОтчета.Вставить("ОплатаУслугБрокераПоБиржевым",     0);
	ДанныеОтчета.Вставить("ОплатаУслугБрокераПоНебиржевым",   0);
	ДанныеОтчета.Вставить("ОплатаУслугБиржи", 0);
	
	Отказ = Ложь;
	ЗаполнитьОплатыБрокеруИБирже(ДанныеОтчета, Отказ);
	
	Если Отказ Тогда
		ДанныеОтчета.Вставить("Отказ", Отказ);
		Возврат ДанныеОтчета;
	КонецЕсли;
			
	ДанныеОтчета.Вставить("ОплатаУслугСпецДепозитария",						0);
	ДанныеОтчета.Вставить("ОплатаУслугСпецДепозитарияВознаграждение",		0);
	ДанныеОтчета.Вставить("ОплатаУслугСпецДепозитарияНеобходимыеРасходы",	0);
	ДанныеОтчета.Вставить("ОплатаРасходовУправляющейКомпании",				0);
	ДанныеОтчета.Вставить("ОплатаВознагражденияУправляющейКомпании",		0);
	ДанныеОтчета.Вставить("ОплатаРасходовНаСтрахованиеРиска",				0);
	ДанныеОтчета.Вставить("ОплатаУслугБанков",								0);
	ДанныеОтчета.Вставить("ПрочиеРасходы",									0);
	
	ЗаполнитьРасходы(ДанныеОтчета);	
	
	ДанныеОтчета.Вставить("ДивидендыИПроценты",         -ОборотЕПС("Сч 715,725 КорСч !479", ПолучитьУсловиеПоГФУ("345,346", "Субконто1"), ВидыСубконтоГФУ)
														-ОборотЕПС("Сч 710     КорСч !479")
														-ОборотЕПС("Сч 71506   КорСч 60347"));
	ДанныеОтчета.Вставить("РеализацияАктивов",          -ОборотЕПС("Сч 715,725 КорСч !479", ПолучитьУсловиеПоГФУ("331,333,334,335,336,341,343,349,371,421,423,424,425,426,431,433,471", "Субконто1"), ВидыСубконтоГФУ)
														+ОборотЕПС("Сч 71506   КорСч 60347"));
	ДанныеОтчета.Вставить("ИзменениеРыночнойСтоимости", -ОборотЕПС("Сч 715,725 КорСч !479", ПолучитьУсловиеПоГФУ("332,342,372,422,432,472", "Субконто1"), ВидыСубконтоГФУ));
	
	ДанныеОтчета.Вставить("ДругиеВидыДохода",           ДанныеОтчета.ФинансовыйРезультатВсего - ДанныеОтчета.ДивидендыИПроценты - ДанныеОтчета.РеализацияАктивов - ДанныеОтчета.ИзменениеРыночнойСтоимости);
	
	// Для расшифровки

	ПоляРасшифровки = Новый Структура;	
	
	Для Каждого Поле Из ДанныеОтчета Цикл
		ПоляРасшифровки.Вставить("Расшифровка" + Поле.Ключ, Поле.Ключ);						
	КонецЦикла;
	
	РаботаСКоллекциями.ДополнитьСтруктуру(ДанныеОтчета, ПоляРасшифровки);	
	
	Возврат ДанныеОтчета;
	
КонецФункции

Функция ЗаполнитьОборотыПоСделкам_ПолучитьТекстЗапроса()
		
	ТекстЗапроса = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	    |ПОМЕСТИТЬ _СчетаДоверительногоУправления
	    |ИЗ
	    |	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	    |			&КонецПериода,
	    |			СчетДоверительногоУправления = &СчетДоверительногоУправления
	    |				И СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт) КАК СуммаСделки,
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК СделкаРЕПО,
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.СделкаРЕПО).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК СуммаВнебиржевых,
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.СделкаРЕПО).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА 0
	    |			ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
	    |		КОНЕЦ) КАК СуммаБиржевых,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период КАК ДатаОперации
	    |ПОМЕСТИТЬ _ОборотыРЕПО
	    |ИЗ
	    |	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			День,
	    |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства10),
	    |			,
	    |			Организация = &Организация
	    |				И СчетДоверительногоУправления В
	    |					(ВЫБРАТЬ
	    |						СчетаДоверительногоУправления.СчетДоверительногоУправления
	    |					ИЗ
	    |						_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления)
	    |				И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.СделкаРЕПО)
	    |				И КорСубконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ОткрытиеРЕПО),
	    |			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
	    |			) КАК ЕдиныйБухгалтерскийУчетОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт),
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.СделкаРЕПО).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
	    |			ИНАЧЕ 0
	    |		КОНЕЦ),
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.СделкаРЕПО).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА 0
	    |			ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
	    |		КОНЕЦ),
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период
	    |ИЗ
	    |	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			День,
	    |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства10),
	    |			,
	    |			Организация = &Организация
	    |				И СчетДоверительногоУправления В
	    |					(ВЫБРАТЬ
	    |						СчетаДоверительногоУправления.СчетДоверительногоУправления
	    |					ИЗ
	    |						_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления)
	    |				И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.СделкаРЕПО)
	    |				И КорСубконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ЗакрытиеРЕПО),
	    |			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
	    |			) КАК ЕдиныйБухгалтерскийУчетОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт),
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.СделкаРЕПО).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
	    |			ИНАЧЕ 0
	    |		КОНЕЦ),
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.СделкаРЕПО).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА 0
	    |			ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
	    |		КОНЕЦ),
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период
	    |ИЗ
	    |	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			День,
	    |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства11),
	    |			,
	    |			Организация = &Организация
	    |				И СчетДоверительногоУправления В
	    |					(ВЫБРАТЬ
	    |						СчетаДоверительногоУправления.СчетДоверительногоУправления
	    |					ИЗ
	    |						_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления)
	    |				И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.СделкаРЕПО)
	    |				И КорСубконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПроцентыПоРЕПО),
	    |			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
	    |			) КАК ЕдиныйБухгалтерскийУчетОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Сделка,
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК СуммаВнебиржевых,
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА 0
	    |			ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
	    |		КОНЕЦ) КАК СуммаБиржевых,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период КАК ДатаОперации
	    |ПОМЕСТИТЬ _ОборотыПоСделкамРазвернутые
	    |ИЗ
	    |	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			День,
	    |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты07),
	    |			,
	    |			Организация = &Организация
	    |				И СчетДоверительногоУправления В
	    |					(ВЫБРАТЬ
	    |						СчетаДоверительногоУправления.СчетДоверительногоУправления
	    |					ИЗ
	    |						_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления)
	    |				И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.Сделка)
	    |				И ВЫБОР
	    |					КОГДА &НачалоПериода >= &НачалоОтдельногоРасчетаВалютныхСделок
	    |						ТОГДА Валюта = &ВалютаУчета
	    |					ИНАЧЕ ИСТИНА
	    |				КОНЕЦ,
	    |			,
	    |			) КАК ЕдиныйБухгалтерскийУчетОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	СУММА(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.ВалютнаяСуммаОборотДт * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(26, 2))),
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.ВалютнаяСуммаОборотДт * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(26, 2))
	    |			ИНАЧЕ 0
	    |		КОНЕЦ),
	    |	СУММА(ВЫБОР
	    |			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |				ТОГДА 0
	    |			ИНАЧЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.ВалютнаяСуммаОборотДт * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(26, 2))
	    |		КОНЕЦ),
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период
	    |ИЗ
	    |	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			ДЕНЬ,
	    |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты07),
	    |			,
	    |			Организация = &Организация
	    |				И СчетДоверительногоУправления В
	    |					(ВЫБРАТЬ
	    |						СчетаДоверительногоУправления.СчетДоверительногоУправления
	    |					ИЗ
	    |						_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления)
	    |				И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.Сделка)
	    |				И ВЫБОР
	    |					КОГДА &НачалоПериода >= &НачалоОтдельногоРасчетаВалютныхСделок
	    |						ТОГДА Валюта <> &ВалютаУчета
	    |					ИНАЧЕ ЛОЖЬ
	    |				КОНЕЦ,
	    |			,
	    |			) КАК ЕдиныйБухгалтерскийУчетОбороты
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	    |		ПО ЕдиныйБухгалтерскийУчетОбороты.Валюта = КурсыВалют.Валюта
	    |			И ЕдиныйБухгалтерскийУчетОбороты.Период = КурсыВалют.Период
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
	    |	ЕдиныйБухгалтерскийУчетОбороты.Период,
	    |	ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ВЫРАЗИТЬ((УсловияСделокСрезПоследних.Сумма + УсловияСделокСрезПоследних.СуммаКупона) * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(26, 2)),
	    |	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления,
	    |	СделкаЦенныеБумаги.Ссылка,
	    |	ВЫБОР
	    |		КОГДА СделкаЦенныеБумаги.Ссылка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |			ТОГДА ВЫРАЗИТЬ((УсловияСделокСрезПоследних.Сумма + УсловияСделокСрезПоследних.СуммаКупона) * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(26, 2))
	    |		ИНАЧЕ 0
	    |	КОНЕЦ,
	    |	ВЫБОР
	    |		КОГДА СделкаЦенныеБумаги.Ссылка = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	    |			ТОГДА 0
	    |		ИНАЧЕ ВЫРАЗИТЬ((УсловияСделокСрезПоследних.Сумма + УсловияСделокСрезПоследних.СуммаКупона) * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(26, 2))
	    |	КОНЕЦ,
	    |	УсловияСделокСрезПоследних.Период
	    |ИЗ
	    |	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокСрезПоследних
	    |		ПО СделкаЦенныеБумаги.Ссылка = УсловияСделокСрезПоследних.Сделка
	    |			И (УсловияСделокСрезПоследних.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	    |		ПО СделкаЦенныеБумаги.Ссылка.ВалютаСделки = КурсыВалют.Валюта
	    |			И (УсловияСделокСрезПоследних.ДатаИсполнения = КурсыВалют.Период)
	    |ГДЕ
	    |	СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	    |	И СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления В
	    |			(ВЫБРАТЬ
	    |				СчетаДоверительногоУправления.СчетДоверительногоУправления
	    |			ИЗ
	    |				_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления)
	    |	И СделкаЦенныеБумаги.Ссылка.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары))
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	СУММА(_ОборотыРЕПО.СуммаСделки),
	    |	_ОборотыРЕПО.СчетДоверительногоУправления,
	    |	_ОборотыРЕПО.СделкаРЕПО,
	    |	СУММА(_ОборотыРЕПО.СуммаВнебиржевых),
	    |	СУММА(_ОборотыРЕПО.СуммаБиржевых),
	    |	_ОборотыРЕПО.ДатаОперации
	    |ИЗ
	    |	_ОборотыРЕПО КАК _ОборотыРЕПО
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	    |		ПО (ЗначенияДополнительныхСведений.Свойство.Ключ = ""НеУчитыватьСделкиРЕПОВОборотахПоСделкам"")
	    |			И (ЗначенияДополнительныхСведений.Объект В
	    |				(ВЫБРАТЬ
	    |					ВЫРАЗИТЬ(СчетаДоверительногоУправления.Клиент КАК Справочник.ЮрФизЛица) КАК Клиент
	    |				ИЗ
	    |					_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления))
	    |ГДЕ
	    |	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, ЛОЖЬ) = ЛОЖЬ
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	_ОборотыРЕПО.СчетДоверительногоУправления,
	    |	_ОборотыРЕПО.СделкаРЕПО,
	    |	_ОборотыРЕПО.ДатаОперации
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	СделкаЦенныеБумаги.Ссылка КАК Сделка
	    |ПОМЕСТИТЬ _ЦенныеБумагиСделок
	    |ИЗ
	    |	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
	    |ГДЕ
	    |	СделкаЦенныеБумаги.НомерСтроки = 1
	    |	И СделкаЦенныеБумаги.Ссылка В
	    |			(ВЫБРАТЬ
	    |				_ОборотыПоСделкамРазвернутые.Сделка
	    |			ИЗ
	    |				_ОборотыПоСделкамРазвернутые КАК _ОборотыПоСделкамРазвернутые
	    |			ГДЕ
	    |				ТИПЗНАЧЕНИЯ(_ОборотыПоСделкамРазвернутые.Сделка) = ТИП(Документ.Сделка))
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
	    |	СделкаРЕПОЦенныеБумаги.Ссылка
	    |ИЗ
	    |	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
	    |ГДЕ
	    |	СделкаРЕПОЦенныеБумаги.НомерСтроки = 1
	    |	И СделкаРЕПОЦенныеБумаги.Ссылка В
	    |			(ВЫБРАТЬ
	    |				_ОборотыПоСделкамРазвернутые.Сделка
	    |			ИЗ
	    |				_ОборотыПоСделкамРазвернутые КАК _ОборотыПоСделкамРазвернутые
	    |			ГДЕ
	    |				ТИПЗНАЧЕНИЯ(_ОборотыПоСделкамРазвернутые.Сделка) = ТИП(Документ.СделкаРЕПО))
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ОборотыПоСделкамРазвернутые.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	СУММА(_ОборотыПоСделкамРазвернутые.СуммаОборотДт) КАК ОборотыПоСделкам,
	    |	СУММА(_ОборотыПоСделкамРазвернутые.СуммаВнебиржевых) КАК ОборотыПоСделкамНебиржевым,
	    |	СУММА(_ОборотыПоСделкамРазвернутые.СуммаБиржевых) КАК ОборотыПоСделкамБиржевым
	    |ИЗ
	    |	_ОборотыПоСделкамРазвернутые КАК _ОборотыПоСделкамРазвернутые
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	_ОборотыПоСделкамРазвернутые.СчетДоверительногоУправления";

	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаполнитьОборотыПоСделкам(ДанныеОтчета)
	
	ТекстЗапроса = ЗаполнитьОборотыПоСделкам_ПолучитьТекстЗапроса();
	
	Запрос = Новый Запрос(ТекстЗапроса);	
	
	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		и Выборка.ОборотыПоСделкам <> NULL Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОтчета, Выборка);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВознаграждениеСпецдепозитария()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход КАК СуммаПриход
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОбороты";
	
	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.СуммаПриход, 0);
	
КонецФункции

Функция ПолучитьЗначениеДопСведенийНеУчитыватьРЕПО(ЮрФизЛицо);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Свойство.Ключ = ""НеУчитыватьСделкиРЕПОВОборотахПоСделкам""
		|	И ЗначенияДополнительныхСведений.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Ключ", 	"СчетаДоверительногоУправления.КонтрольСтраховыхКомпаний.ВидПортфеляСтраховойКомпании");
	Запрос.УстановитьПараметр("Объект", ЮрФизЛицо);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;	
	
	Возврат Ложь;

КонецФункции			

Функция ЗаполнитьОплатыБрокеру_ПолучитьТекстЗапроса()
			 	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(_КомиссииПоСделкам.Сумма) КАК ОплатаУслугБрокера,
	|	СУММА(ВЫБОР
	|			КОГДА _КомиссииПоСделкам.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	|				ТОГДА _КомиссииПоСделкам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОплатаУслугБрокераПоНебиржевым,
	|	СУММА(ВЫБОР
	|			КОГДА _КомиссииПоСделкам.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	|				ТОГДА 0
	|			ИНАЧЕ _КомиссииПоСделкам.Сумма
	|		КОНЕЦ) КАК ОплатаУслугБрокераПоБиржевым,
	|	_КомиссииПоСделкам.Период КАК Период,
	|	_КомиссииПоСделкам.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ _ОплатыБрокеру
	|ИЗ
	|	_КомиссииПоСделкам КАК _КомиссииПоСделкам
	|ГДЕ
	|	_КомиссииПоСделкам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
	|
	|СГРУППИРОВАТЬ ПО
	|	_КомиссииПоСделкам.Период,
	|	_КомиссииПоСделкам.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(_ОплатыБрокеру.ОплатаУслугБрокера) КАК ОплатаУслугБрокера,
	|	СУММА(_ОплатыБрокеру.ОплатаУслугБрокераПоНебиржевым) КАК ОплатаУслугБрокераПоНебиржевым,
	|	СУММА(_ОплатыБрокеру.ОплатаУслугБрокераПоБиржевым) КАК ОплатаУслугБрокераПоБиржевым
	|ИЗ
	|	_ОплатыБрокеру КАК _ОплатыБрокеру";
	
	Возврат ТекстЗапроса;
	
КонецФункции
	
Процедура ДанныеПоКомиссиям(Запрос, Отказ = Ложь)
	
	УстановитьОбщиеПараметрыЗапроса(Запрос);	
	
	ДатаПоследнейСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПоследнегоРасчетаСЧАЗаПериод(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	Если Не ЗначениеЗаполнено(ДатаПоследнейСЧА) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить настройки формирования СЧА за выбранный период для счета ДУ " + СокрЛП(ЭтотОбъект.СчетДоверительногоУправления), ЭтотОбъект.СчетДоверительногоУправления);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Договора еще могло не быть на начало периода, тогда используем последний рабочий день до даты начала периода
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "ДатаЗаключения") < НачалоДня(ЭтотОбъект.Период.ДатаНачала) Тогда	
		ДатаПоследнейСЧАДоНачалаПериода = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаНачала);
	Иначе
		ДатаПоследнейСЧАДоНачалаПериода = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ЭтотОбъект.Период.ДатаНачала) - 1 , -1);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ДатаПоследнейСЧАДоНачалаПериода", ДатаПоследнейСЧАДоНачалаПериода);  
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _СчетаДоверительногоУправления
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|			&КонецПериода,
	|			СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;";
	
	Запрос.Выполнить();
	
	РаботаСОтчетами.ПоместитьКомиссииПоСделкамЗаПериодВМенеджерВременныхТаблиц(Запрос, ЭтотОбъект.Организация, ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, Новый Структура("ДатаПоследнейСЧА, ДатаПоследнейСЧАДоначалаПериода", ДатаПоследнейСЧА, ДатаПоследнейСЧАДоНачалаПериода),,, Отказ);
	  
КонецПроцедуры

Процедура ЗаполнитьОплатыБрокеруИБирже(ДанныеОтчета, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДанныеПоКомиссиям(Запрос, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = ЗаполнитьОплатыБрокеру_ПолучитьТекстЗапроса();   	
				
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		и Выборка.ОплатаУслугБрокера <> NULL Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОтчета, Выборка);
	КонецЕсли;
	
	Запрос.Текст = ЗаполнитьОплатыБирже_ПолучитьТекстЗапроса();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		и Выборка.ОплатаУслугБиржи <> NULL Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОтчета, Выборка);
	КонецЕсли;

КонецПроцедуры

Функция ЗаполнитьОплатыБирже_ПолучитьТекстЗапроса()
		
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(_КомиссииПоСделкам.Сумма) КАК ОплатаУслугБиржи,
	|	_КомиссииПоСделкам.Период КАК Период,
	|	_КомиссииПоСделкам.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ _ОплатыБиржи
	|ИЗ
	|	_КомиссииПоСделкам КАК _КомиссииПоСделкам
	|ГДЕ
	|	_КомиссииПоСделкам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
	|
	|СГРУППИРОВАТЬ ПО
	|	_КомиссииПоСделкам.Период,
	|	_КомиссииПоСделкам.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(_ОплатыБиржи.ОплатаУслугБиржи) КАК ОплатаУслугБиржи
	|ИЗ
	|	_ОплатыБиржи КАК _ОплатыБиржи";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗаполнитьРасходы_ПолучитьТекстЗапроса(ВидРасходов = Неопределено)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (&ВидыЗадолженностиОплатаУслугСпецДепозитария)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплатаУслугСпецДепозитария,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (&ВидыЗадолженностиОплатаУслугСпецДепозитарияВознаграждение)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплатаУслугСпецДепозитарияВознаграждение,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (&ВидыЗадолженностиОплатаУслугСпецДепозитарияНеобходимыеРасходы)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплатаУслугСпецДепозитарияНеобходимыеРасходы,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (&ВидыЗадолженностиОплатаРасходовУправляющейКомпании)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплатаРасходовУправляющейКомпании,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (&ВидыЗадолженностиОплатаРасходовНаСтрахованиеРиска)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплатаРасходовНаСтрахованиеРиска,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (&ВидыЗадолженностиОплатаУслугБанков)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплатаУслугБанков,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (&ВидыЗадолженностиПрочиеРасходы)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПрочиеРасходы,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Период КАК Период,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ПрочиеРасходы
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВидЗадолженности В (&ВидыЗадолженности)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Период,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_ПрочиеРасходы.ОплатаУслугСпецДепозитария) КАК ОплатаУслугСпецДепозитария,
		|	СУММА(_ПрочиеРасходы.ОплатаУслугСпецДепозитарияВознаграждение) КАК ОплатаУслугСпецДепозитарияВознаграждение,
		|	СУММА(_ПрочиеРасходы.ОплатаУслугСпецДепозитарияНеобходимыеРасходы) КАК ОплатаУслугСпецДепозитарияНеобходимыеРасходы,
		|	СУММА(_ПрочиеРасходы.ОплатаРасходовУправляющейКомпании) КАК ОплатаРасходовУправляющейКомпании,
		|	СУММА(_ПрочиеРасходы.ОплатаРасходовНаСтрахованиеРиска) КАК ОплатаРасходовНаСтрахованиеРиска,
		|	СУММА(_ПрочиеРасходы.ОплатаУслугБанков) КАК ОплатаУслугБанков,
		|	СУММА(_ПрочиеРасходы.ПрочиеРасходы) КАК ПрочиеРасходы
		|ИЗ
		|	_ПрочиеРасходы КАК _ПрочиеРасходы";
	
	ВсеВидыЗадолженностиЗапроса = Новый Массив;
	
	ВидыРасходов = Новый Массив;
	ВидыРасходов.Добавить("ОплатаУслугСпецДепозитарияВознаграждение");
	ВидыРасходов.Добавить("ОплатаУслугСпецДепозитарияНеобходимыеРасходы");
	ВидыРасходов.Добавить("ОплатаУслугСпецДепозитария");
	ВидыРасходов.Добавить("ОплатаРасходовУправляющейКомпании");
	ВидыРасходов.Добавить("ОплатаВознагражденияУправляющейКомпании");
	ВидыРасходов.Добавить("ОплатаРасходовНаСтрахованиеРиска");
	ВидыРасходов.Добавить("ОплатаУслугБанков");
	ВидыРасходов.Добавить("ПрочиеРасходы");
	
	Для Каждого ТекущийВидРасходов Из ВидыРасходов Цикл
		
		ВидыЗадолженности = Новый Массив;	
		
		Если СтрНачинаетсяС(ТекущийВидРасходов, "ОплатаУслугСпецДепозитария") Тогда 	
			
			Если ТекущийВидРасходов = "ОплатаУслугСпецДепозитария"
				ИЛИ ТекущийВидРасходов = "ОплатаУслугСпецДепозитарияВознаграждение"
			Тогда
				ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария);
				ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамСпецдепозитария);
				ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария);
				ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоДепозитарнойКомиссии);
			КонецЕсли;
			
			Если ТекущийВидРасходов = "ОплатаУслугСпецДепозитария"
				ИЛИ ТекущийВидРасходов = "ОплатаУслугСпецДепозитарияНеобходимыеРасходы"
			Тогда
				ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария);
			КонецЕсли;
			
		ИначеЕсли ТекущийВидРасходов = "ОплатаРасходовУправляющейКомпании" Тогда 	
			
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего);
			
		ИначеЕсли ТекущийВидРасходов = "ОплатаВознагражденияУправляющейКомпании" Тогда 	
			
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего);
			
		ИначеЕсли ТекущийВидРасходов = "ОплатаРасходовНаСтрахованиеРиска" Тогда 	
			
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоВозмещениюСтраховыхПремий);
			
		ИначеЕсли ТекущийВидРасходов = "ОплатаУслугБанков" Тогда 	
			
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоБанковскойКомиссии);
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаЗаПереводДС);
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаБанкКлиентИРКО);
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаОткрытиеИВедениеСчета);
			
		ИначеЕсли ТекущийВидРасходов = "ПрочиеРасходы" Тогда 	
			
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоПрочимДоходамИРасходам);
			ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоВознаграждениюОценщика);
			
		КонецЕсли;
		
		ВидыЗадолженностиЗапроса = Новый Массив;
		
		Для Каждого ВидЗадолженности Из ВидыЗадолженности Цикл
			ВидыЗадолженностиЗапроса.Добавить(СтрШаблон("ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.%1)", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЗадолженности, "ИмяПредопределенныхДанных")));
		КонецЦикла;	
		
		ВидыЗадолженностиСтрокой = СтрСоединить(ВидыЗадолженностиЗапроса, ", ");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидыЗадолженности" + ТекущийВидРасходов, ВидыЗадолженностиСтрокой);
		
		Если ТекущийВидРасходов = ВидРасходов ИЛИ ВидРасходов = Неопределено Тогда
			ВсеВидыЗадолженностиЗапроса.Добавить(ВидыЗадолженностиСтрокой); 
		КонецЕсли;	
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидыЗадолженности", СтрСоединить(ВсеВидыЗадолженностиЗапроса, ", "));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаполнитьРасходы(ДанныеОтчета)
	
	Запрос = Новый Запрос(ЗаполнитьРасходы_ПолучитьТекстЗапроса());	
	
	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОтчета, Выборка);
	КонецЕсли;
	
КонецПроцедуры

Функция ОборотДтКтЕПС_ПолучитьТекстЗапроса(МассивСтрокСчетов, УсловиеЗапроса, МенеджерВременныхТаблиц = Неопределено)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Рег.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			&СчетаДт,
	|			&ВидыСубконтоДт,
	|			&СчетаКт,
	|			&ВидыСубконтоКт,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И &Условие) КАК Рег";
	
	Если ПустаяСтрока(МассивСтрокСчетов[0]) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетаДт", "");	
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетаДт", "СчетДт В(&СчетаДт)");
	КонецЕсли;
	
	Если ПустаяСтрока(МассивСтрокСчетов[1]) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетаКт", "");	
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетаКт", "СчетКт В(&СчетаКт)");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &Условие", ?(ПустаяСтрока(УсловиеЗапроса), "", "И " + УсловиеЗапроса));
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СчетДоверительногоУправления = &СчетДоверительногоУправления", "СчетДоверительногоУправления В (ВЫБРАТЬ _СчетаДоверительногоУправления.СчетДоверительногоУправления ИЗ _СчетаДоверительногоУправления)");			
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ОборотДтКтЕПС(Знач ОписаниеПроводки, УсловиеЗапроса = "", ВидыСубконтоДт = Неопределено, ВидыСубконтоКт = Неопределено, МенеджерВременныхТаблиц = Неопределено)
	
	ОписаниеПроводки = ВРег(ОписаниеПроводки);
	
	МассивСтрокСчетов = ПолучитьСтрокиСчетов(ОписаниеПроводки, "ДТ", "КТ");

	Запрос = Новый Запрос;                          	
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	
	ТекстЗапроса = ОборотДтКтЕПС_ПолучитьТекстЗапроса(МассивСтрокСчетов, УсловиеЗапроса);
	
	Если Не ПустаяСтрока(МассивСтрокСчетов[0]) Тогда
		Запрос.УстановитьПараметр("СчетаДт", ПолучитьМассивСчетовЕПС(МассивСтрокСчетов[0]));
	КонецЕсли;
	
	Если Не ПустаяСтрока(МассивСтрокСчетов[1]) Тогда
		Запрос.УстановитьПараметр("СчетаКт", ПолучитьМассивСчетовЕПС(МассивСтрокСчетов[1]));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;	

	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Запрос.УстановитьПараметр("ВидыСубконтоДт", ВидыСубконтоДт);
	Запрос.УстановитьПараметр("ВидыСубконтоКт", ВидыСубконтоКт);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Значение = 0;
	Иначе
		Значение = Результат.Выгрузить()[0].СуммаОборот;
	КонецЕсли;	
	
	Возврат ?(Значение = NULL, 0, Значение);
	
КонецФункции

Функция ОборотЕПС(ОписаниеПроводки, УсловиеЗапроса = "", ВидыСубконто = Неопределено, ВидыСубконтоКор = Неопределено, МенеджерВременныхТаблиц = Неопределено)
	
	ОписаниеПроводки = ВРег(ОписаниеПроводки);
	
	МассивСтрокСчетов = ПолучитьСтрокиСчетов(ОписаниеПроводки, "СЧ", "КОРСЧ");

	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			&Счета,
	|			&ВидыСубконто,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И &Условие,
	|			&КорСчета,
	|			&ВидыСубконтоКор) КАК ЕдиныйБухгалтерскийУчетОбороты";
	
	Если ПустаяСтрока(МассивСтрокСчетов[0]) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Счета", "");	
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Счета", "Счет В(&Счета)");
		Запрос.УстановитьПараметр("Счета", ПолучитьМассивСчетовЕПС(МассивСтрокСчетов[0]));
	КонецЕсли;
	
	Если ПустаяСтрока(МассивСтрокСчетов[1]) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КорСчета", "");	
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КорСчета", "КорСчет В(&КорСчета)");
		Запрос.УстановитьПараметр("КорСчета", ПолучитьМассивСчетовЕПС(МассивСтрокСчетов[1]));
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СчетДоверительногоУправления = &СчетДоверительногоУправления", "СчетДоверительногоУправления В (ВЫБРАТЬ _СчетаДоверительногоУправления.СчетДоверительногоУправления ИЗ _СчетаДоверительногоУправления)");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &Условие", ?(ПустаяСтрока(УсловиеЗапроса), "", "И " + УсловиеЗапроса));
	
	Запрос.Текст = ТекстЗапроса;	

	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Запрос.УстановитьПараметр("ВидыСубконто", 		ВидыСубконто);
	Запрос.УстановитьПараметр("ВидыСубконтоКор", 	ВидыСубконтоКор);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Значение = 0;
	Иначе
		Значение = Результат.Выгрузить()[0].СуммаОборот;
	КонецЕсли;	
	
	Возврат ?(Значение = NULL, 0, Значение);
	
КонецФункции

Функция ПолучитьСтрокиСчетов(СтрокаСчетов, ПервыйПрефикс, ВторойПрефикс)
	
	СтрокиСчетов = Новый Массив;
	
	Позиция1 = СтрНайти(СтрокаСчетов, ПервыйПрефикс);
	Позиция2 = СтрНайти(СтрокаСчетов, ВторойПрефикс);
	
	Если Позиция1 > Позиция2
		и Позиция2 > 0 Тогда
		ВызватьИсключение "Не верно указаны счета: " + СтрокаСчетов + " : " + ПервыйПрефикс + " : " + ВторойПрефикс;
	КонецЕсли;
	
	Если Позиция1 = 0 Тогда
		ПерваяПодстрока = "";
	ИначеЕсли Позиция2 = 0 Тогда
		ПерваяПодстрока = Сред(СтрокаСчетов, Позиция1 + СтрДлина(ПервыйПрефикс));
	Иначе
		ПерваяПодстрока = Сред(СтрокаСчетов, Позиция1 + СтрДлина(ПервыйПрефикс), Позиция2 - Позиция1 - СтрДлина(ПервыйПрефикс));
	КонецЕсли;
	
	Если Позиция2 = 0 Тогда
		ВтораяПодстрока = "";
	Иначе
		ВтораяПодстрока = Сред(СтрокаСчетов, Позиция2 + СтрДлина(ВторойПрефикс));	
	КонецЕсли;

	СтрокиСчетов.Добавить(СокрЛП(ПерваяПодстрока));
	СтрокиСчетов.Добавить(СокрЛП(ВтораяПодстрока));

	Возврат СтрокиСчетов;
	
КонецФункции

Функция ПолучитьМассивСчетовЕПС(ПереченьКодов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Единый.Ссылка
	|ИЗ
	|	ПланСчетов.Единый КАК Единый
	|ГДЕ
	|	&Условие",
	"&Условие",
	ПолучитьУсловиеПоСчету(ПереченьКодов, "Единый.Ссылка"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

Функция ПолучитьУсловиеПоГФУ(ПереченьКодов, ПолеСубконто)
	
	Возврат ПолучитьУсловиеПоПеречнюКодов(ПереченьКодов, "Код", "(ВЫРАЗИТЬ(" + ПолеСубконто + " КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов))");
	
КонецФункции

Функция ПолучитьУсловиеПоСчету(ПереченьКодов, ПолеСчет)
	
	Возврат ПолучитьУсловиеПоПеречнюКодов(ПереченьКодов, "Код", ПолеСчет);
	
КонецФункции

Функция ПолучитьУсловиеПоПеречнюКодов(ПереченьКодов, ИмяПоля, ИмяТаблицы)
	
	Если ПустаяСтрока(ПереченьКодов) Тогда
		Возврат "ИСТИНА";
	КонецЕсли;
	
	МассивСтрок = СтрРазделить(ПереченьКодов, ",", Ложь);
	
	СоответствиеДлинОбщее = Новый Соответствие;
	СоответствиеДлинОбщее.Вставить(0, Новый Соответствие); // Условия отрицания
	СоответствиеДлинОбщее.Вставить(1, Новый Соответствие);
	
	Для каждого Подстрока из МассивСтрок Цикл
		
		ПодстрокаБезДопСимволов = СокрЛП(Подстрока);
		
		Если Лев(ПодстрокаБезДопСимволов, 1) = "!" Тогда
			СоответствиеДлин = СоответствиеДлинОбщее[0];
			ПодстрокаБезДопСимволов = СокрЛ(Сред(ПодстрокаБезДопСимволов, 2));
		Иначе
			СоответствиеДлин = СоответствиеДлинОбщее[1];	
		КонецЕсли;
		
		ДлинаПодстроки = СтрДлина(ПодстрокаБезДопСимволов);
		МассивПодстрок = СоответствиеДлин[ДлинаПодстроки];
		Если МассивПодстрок = Неопределено Тогда
			МассивПодстрок = Новый Массив;
			СоответствиеДлин.Вставить(ДлинаПодстроки, МассивПодстрок);
		КонецЕсли;
		
		МассивПодстрок.Добавить("""" + ПодстрокаБезДопСимволов + """");
		
	КонецЦикла;
	
	МассивОбщихУсловий = Новый Массив;
	Для каждого КлючИЗначОбщее из СоответствиеДлинОбщее Цикл
		
		СоответствиеДлин = КлючИЗначОбщее.Значение;
		
		Если СоответствиеДлин.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если КлючИЗначОбщее.Ключ = 0 Тогда
			Префикс    = "Не ";
			Соединение = "И ";
		Иначе
			Префикс = "";
			Соединение = "ИЛИ ";
		КонецЕсли;
		
		МассивУсловий = Новый Массив;
		Для каждого КлючИЗнач из СоответствиеДлин Цикл
			
			СтрокаУсловия = Префикс + "ПОДСТРОКА(" + ИмяТаблицы + "." + ИмяПоля + ", 1, " + Формат(КлючИЗнач.Ключ, "ЧГ=0") + ")";
			Если КлючИЗнач.Значение.Количество() = 1 Тогда
				СтрокаУсловия = СтрокаУсловия + " = " + КлючИЗнач.Значение[0];	
			Иначе
				СтрокаУсловия = СтрокаУсловия + " В(" + СтрСоединить(КлючИЗнач.Значение, ", ") + ")";
			КонецЕсли;
			
			МассивУсловий.Добавить(СтрокаУсловия);
			
		КонецЦикла;
		
		МассивОбщихУсловий.Добавить("(" + СтрСоединить(МассивУсловий, Символы.ПС + Символы.Таб + Соединение) + ")");
		
	КонецЦикла;
	
	ТекстУсловия = СтрСоединить(МассивОбщихУсловий, Символы.ПС + Символы.Таб + "И ");
	
	Возврат ТекстУсловия;

КонецФункции

Процедура УстановитьОбщиеПараметрыЗапроса(Запрос)
	
	Запрос.УстановитьПараметр("НачалоПериода", 							ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 							ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", 							ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 			ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВалютаУчета", 							ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
	Запрос.УстановитьПараметр("НачалоОтдельногоРасчетаВалютныхСделок", 	'20210101');
	
КонецПроцедуры

Функция ПолучитьВариантРасчетаОценочнойСтоимости()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиЦелейРасчетаСрезПоследних.ВариантРасчетаОценочнойСтоимости КАК ВариантРасчетаОценочнойСтоимости
	|ИЗ
	|	РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
	|			&ДатаОкончания,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаобъектовВУправлении)) КАК НастройкиЦелейРасчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаОкончания", 					КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВариантРасчетаОценочнойСтоимости;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДюрации(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.Облигация КАК ЦеннаяБумага,
		|	КотировкиТорговыхПлощадок.DURATION КАК Дюрация,
		|	Номиналы.Номинал КАК Номинал
		|ИЗ
		|	_Облигации КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|		ПО (КотировкиТорговыхПлощадок.ЦеннаяБумага = _ЦенныеБумаги.Облигация)
		|			И (КотировкиТорговыхПлощадок.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))
		|			И (КотировкиТорговыхПлощадок.Биржа = &Биржа)
		|			И (КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим)
		|			И (КотировкиТорговыхПлощадок.Период = &ПоследняяДатаТоргов)
		|			И (КотировкиТорговыхПлощадок.DURATION > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК Номиналы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ЦенныеБумаги.Облигация КАК ЦеннаяБумага,
		|				МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
		|			ИЗ
		|				_Облигации КАК _ЦенныеБумаги
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|					ПО (НоминалыЦенныхБумаг.ЦеннаяБумага = _ЦенныеБумаги.Облигация)
		|						И (НоминалыЦенныхБумаг.Период <= &Период)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ЦенныеБумаги.Облигация) КАК ДатыИзмененийНоминала
		|			ПО (ДатыИзмененийНоминала.ЦеннаяБумага = Номиналы.ЦеннаяБумага)
		|				И (ДатыИзмененийНоминала.Период = Номиналы.Период)
		|		ПО (Номиналы.ЦеннаяБумага = _ЦенныеБумаги.Облигация)";
		
	ПоследняяДатаТоргов = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Константы.ОсновнойКалендарьКотировок.Получить(), НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	ММВБ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
	
	Запрос.УстановитьПараметр("Биржа",					ММВБ);
	Запрос.УстановитьПараметр("Период",					ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПоследняяДатаТоргов",	ПоследняяДатаТоргов);

	ТаблицаДюраций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДюрации Из ТаблицаДюраций Цикл
		Если Не ЗначениеЗаполнено(СтрокаДюрации.Дюрация) Тогда
			СтрокаДюрации.Дюрация = Справочники.Облигации.ПолучитьДоходностьИДюрацию(СтрокаДюрации.ЦеннаяБумага, Ложь, НачалоДня(Период.ДатаОкончания), СтрокаДюрации.Номинал, ЭтотОбъект.СчетДоверительногоУправления, ММВБ).Дюрация; 
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТаблицаДюраций;
	
КонецФункции

Процедура ПолучитьСостояниеПортфеляНаДату(Запрос, Дата, ЭтоНачалоПериода = Ложь)
	
	ЦельРасчета	= Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
	ЦельРасчетаБаланс	= Справочники.ЦелиРасчета.ЕдиныйПланСчетов;

	ВидУчетаБаланс = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	
	ПоследнийРабочийДень = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Дата);
	
	ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов = БухгалтерскийУчет.ОпределитьНастройкуУчета(Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов");	
	
	Запрос.Текст =
	
	#Область Текст_запроса
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА 1
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|						ТОГДА 2
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
		|						ТОГДА 3
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|						ТОГДА 4
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|						ТОГДА 5
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Порядок,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерГосРегистрации,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Номинал,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток / БухПартииЦенныхБумагОстатки.КоличествоОстаток
		|	КОНЕЦ КАК БалансоваяЦена,
		|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК БалансоваяСтоимостьБезНКД,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК НКДУплаченныйНачисленный,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Дисконт,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток > 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК Корректировка,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ""Ипотечный сертификат участия""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид,
		|	ЛОЖЬ КАК МакетПрочее,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	ЛОЖЬ КАК РЕПО,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				ИЛИ БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|				ИЛИ БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|				ИЛИ БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|				ИЛИ БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫБОР
		|					КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|							ИЛИ БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Валюта,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД)
		|				И &ПереходНаМСФО9
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения)
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель
		|	КОНЕЦ КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВидУчета = &ВидУчетаБаланс
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА 1
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|						ТОГДА 2
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
		|						ТОГДА 3
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|						ТОГДА 4
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|						ТОГДА 5
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Рынок,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ""Ипотечный сертификат участия""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Партия,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтрокаПартии,
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				ИЛИ БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|				ИЛИ БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|				ИЛИ БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|				ИЛИ БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				ИЛИ БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫБОР
		|					КОГДА БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага.ВалютаНоминала.Код = ""643""
		|							ИЛИ БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага.ВалютаНоминала = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага.ВалютаНоминала
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД)
		|				И &ПереходНаМСФО9
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения)
		|		ИНАЧЕ БухПартииЦенныхБумагКПолучениюОстатки.УчетныйАктивЕПС.Родитель
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВидУчета = &ВидУчетаБаланс
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагКПолучениюОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.Порядок КАК Порядок,
		|	_ЦенныеБумаги.Рынок КАК Рынок,
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Эмитент КАК Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации КАК НомерГосРегистрации,
		|	_ЦенныеБумаги.Номинал КАК Номинал,
		|	СУММА(_ЦенныеБумаги.Количество) КАК Количество,
		|	ВЫБОР
		|		КОГДА СУММА(_ЦенныеБумаги.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) / СУММА(_ЦенныеБумаги.Количество)
		|	КОНЕЦ КАК БалансоваяЦена,
		|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
		|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
		|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
		|	СУММА(_ЦенныеБумаги.Дисконт) КАК Дисконт,
		|	СУММА(_ЦенныеБумаги.Премия) КАК Премия,
		|	СУММА(_ЦенныеБумаги.Корректировка) КАК Корректировка,
		|	_ЦенныеБумаги.Вид КАК Вид,
		|	_ЦенныеБумаги.МакетПрочее КАК МакетПрочее,
		|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
		|	_ЦенныеБумаги.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ЦенныеБумагиСПартиями КАК _ЦенныеБумаги
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЦенныеБумаги.Рынок,
		|	_ЦенныеБумаги.ЦеннаяБумага,
		|	_ЦенныеБумаги.Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации,
		|	_ЦенныеБумаги.Вид,
		|	_ЦенныеБумаги.МакетПрочее,
		|	_ЦенныеБумаги.Номинал,
		|	_ЦенныеБумаги.Порядок,
		|	_ЦенныеБумаги.РЕПО,
		|	_ЦенныеБумаги.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета + БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная - БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + БухПартииЦенныхБумаг.ИндексацияНоминала - БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение) КАК БалансоваяСтоимость,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК НКД,
		|	СУММА(ВЫБОР
		|			КОГДА &УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета
		|		КОНЕЦ) КАК Переоценка,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Премия,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия < 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Дисконт,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета) КАК Корректировка
		|ПОМЕСТИТЬ _ПогашенныеНесписанныеОблигации
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Организация = &Организация
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДоверительногоУправления)
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииЦенныхБумаг.Активность
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчетаБаланс
		|	И НАЧАЛОПЕРИОДА(БухПартииЦенныхБумаг.Период, ДЕНЬ) = &Дата
		|	И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|	И ВЫРАЗИТЬ(БухПартииЦенныхБумаг.Регистратор КАК Документ.ПогашениеЦеннойБумаги).ВидПогашения <> ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ЧастичноеПогашение)
		|	И &УчитыватьПогашенныеОблигации
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал
		|ПОМЕСТИТЬ _Номиналы
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(
		|			&Период,
		|			ЦеннаяБумага В
		|				(ВЫБРАТЬ
		|					_ЦенныеБумаги.ЦеннаяБумага
		|				ИЗ
		|					_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК НоминалыЦенныхБумагСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК Сумма,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСумма
		|ПОМЕСТИТЬ _ПогашениеКупонаНеИсполненноеВСрок
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			ПОДСТРОКА(Счет.Код, 1, 3) В (""501"", ""502"", ""503"", ""504""),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ)) КАК Период,
		|	РегистрацияСтоимостиАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ПоследняяСЧА
		|ИЗ
		|	Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
		|ГДЕ
		|	РегистрацияСтоимостиАктивов.Организация = &Организация
		|	И РегистрацияСтоимостиАктивов.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДоверительногоУправления)
		|	И РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки = &ЦельРасчета
		|	И РегистрацияСтоимостиАктивов.Дата <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|	И РегистрацияСтоимостиАктивов.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрацияСтоимостиАктивов.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчета,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДепозитныйВклад,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток - ЕСТЬNULL(ОстаткиРезервов.СуммаОстатокКт, 0) КАК СуммаОстаток,
		|	""Депозит"" КАК Раздел
		|ПОМЕСТИТЬ _ДепозитныеВкладыОстатки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ОстаткиРезервов
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления = ОстаткиРезервов.СчетДоверительногоУправления
		|			И (ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01))
		|			И ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = ОстаткиРезервов.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
		|	""Депозит""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДепозитныеВкладыОстатки.ДепозитныйВклад КАК ДепозитныйВклад
		|ПОМЕСТИТЬ _ДепозитныеВклады
		|ИЗ
		|	_ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Денежные средства на расчетных счетах"" КАК Раздел,
		|	БанковскиеСчета.Ссылка КАК БанковскийСчетДоговорБрок,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт, 0) - ЕСТЬNULL(ОстаткиРезервов.СуммаОстатокКт, 0) КАК Сумма,
		|	""ИТОГО денежные средства на расчетных счетах:"" КАК ВидИтога
		|ПОМЕСТИТЬ _ДенежныеСредства
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета01),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БанковскиеСчета),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО (БанковскиеСчета.Ссылка В (ЕдиныйБухгалтерскийУчетОстатки.Субконто1))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БанковскиеСчета),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ОстаткиРезервов
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления = ОстаткиРезервов.СчетДоверительногоУправления
		|			И ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = ОстаткиРезервов.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства на брокерских счетах"",
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания), ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры)),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт, 0) - ЕСТЬNULL(ОстаткиРезервов.СуммаОстатокКт, 0),
		|	""ИТОГО денежные средства на брокерских счетах:""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ОстаткиРезервов
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления = ОстаткиРезервов.СчетДоверительногоУправления
		|			И ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = ОстаткиРезервов.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства на клиринговых счетах"",
		|	ЕСТЬNULL(НомераСчетовКлиринга.Значение, ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт, 0) - ЕСТЬNULL(ОстаткиРезервов.СуммаОстатокКт, 0),
		|	""ИТОГО денежные средства на клиринговых счетах:""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга24),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НомераСчетовКлиринга
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления = НомераСчетовКлиринга.Объект
		|			И (НомераСчетовКлиринга.Свойство.Ключ = ""НомерСчетаКлирингаВНКО_НКЦ"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ОстаткиРезервов
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления = ОстаткиРезервов.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДоговорСделка,
		|	""Предварительные затраты по сделкам"" КАК ВидЗадолженности,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаКт,
		|	0 КАК СуммаДтРынок
		|ПОМЕСТИТЬ _ОперацииСПриобретеннымиЦеннымиБумагами
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами)),
		|			&СубконтоКонтрагентыОснованиеРасчетов,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|	КОНЕЦ КАК ВидЗадолженности,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|ПОМЕСТИТЬ _ОбъединенныйЗапросЕПС
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела))) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.МНО), ТИП(Документ.СделкаСМО))
		|			ТОГДА ""Проценты по МНО""
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО).РасчетныйСчет
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.СделкаСМО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаСМО).РасчетныйСчет
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|	КОНЕЦ,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт),
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты))
		|				И НЕ Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты25)),
		|			&СубконтоКонтрагентыОснованиеРасчетов,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.МНО), ТИП(Документ.СделкаСМО))
		|			ТОГДА ""Проценты по МНО""
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО).РасчетныйСчет
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.СделкаСМО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаСМО).РасчетныйСчет
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК ДоговорСделка,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаКт,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеСпецдепозитария))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецдепозитария)
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Справочник.Договоры)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДепозитарногоОбслуживания))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецдепозитария)
		|	КОНЕЦ КАК ВидЗадолженности
		|ПОМЕСТИТЬ _Задолженность
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами11), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами12)),
		|			&СубконтоКонтрагентыДоговоры,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47)
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Справочник.Акции)
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции)
		|					КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Справочник.Паи)
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи)
		|					ИНАЧЕ NULL
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами22), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами23), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами24), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РезервыОценочныеОбязательстваНекредитногоХарактера)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ЮрЛицоОрганизации,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего),
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ЮрЛицоОрганизации,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего),
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеСредства.Контрагент,
		|	ПрочиеСредства.Основание,
		|	ПрочиеСредства.СуммаОстатокДт,
		|	ПрочиеСредства.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент КАК Контрагент,
		|		ЕдиныйБухгалтерскийУчетОстатки.Основание КАК Основание,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Основание,
		|			ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ КАК Контрагент,
		|			СУММА(ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17))
		|						ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|				КОНЕЦ) КАК СуммаОстатокДт,
		|			СУММА(ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17))
		|						ТОГДА 0
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|				КОНЕЦ) КАК СуммаОстатокКт
		|		ИЗ
		|			РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|					&Период,
		|					Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства)),
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|							ИЗ
		|								_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|			ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕдиныйБухгалтерскийУчетОстатки.Основание,
		|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент) КАК ПрочиеСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ЮрЛицоОрганизации,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	0,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ЮрЛицоОрганизации,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	0,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|				&СубконтоКонтрагентыОснованиеРасчетов,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.Сделка), ТИП(Документ.СделкаСВалютой))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент КАК Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|				&СубконтоКонтрагентыОснованиеРасчетов,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.СделкаРЕПО)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто2) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт),
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|			&СубконтоКонтрагентыОснованиеРасчетов,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	НЕ ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.Сделка), ТИП(Документ.СделкаРЕПО), ТИП(Документ.СделкаСвалютой))
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЦеннаяБумага,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт),
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ЕдиныйБухгалтерскийУчетОстатки.ВидЗадолженности
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ОбъединенныйЗапросЕПС.Контрагент КАК Контрагент,
		|		_ОбъединенныйЗапросЕПС.ВидЗадолженности КАК ВидЗадолженности,
		|		_ОбъединенныйЗапросЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СУММА(_ОбъединенныйЗапросЕПС.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(_ОбъединенныйЗапросЕПС.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		_ОбъединенныйЗапросЕПС КАК _ОбъединенныйЗапросЕПС
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ОбъединенныйЗапросЕПС.Контрагент,
		|		_ОбъединенныйЗапросЕПС.ВидЗадолженности,
		|		_ОбъединенныйЗапросЕПС.ЦеннаяБумага) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВидЗадолженности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	""Резервы под обесценение"",
		|	СУММА(-1 * ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	СУММА(0),
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты25), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами24)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.Ссылка КАК Сделка
		|ПОМЕСТИТЬ _ЗадолженностьСделкиРЕПО
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка В
		|			(ВЫБРАТЬ
		|				_Задолженность.ДоговорСделка
		|			ИЗ
		|				_Задолженность
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(_Задолженность.ДоговорСделка) = ТИП(Документ.СделкаРЕПО))
		|	И СделкаРЕПОЦенныеБумаги.НомерСтроки = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДефолтыПоОблигациямСрезПоследних.Период КАК Период,
		|	ДефолтыПоОблигациямСрезПоследних.Облигация КАК Облигация,
		|	ДефолтыПоОблигациямСрезПоследних.ТипДефолта КАК ТипДефолта,
		|	ДефолтыПоОблигациямСрезПоследних.СтатусДефолта КАК СтатусДефолта,
		|	ДефолтыПоОблигациямСрезПоследних.Облигация.Эмитент КАК ОблигацияЭмитент
		|ПОМЕСТИТЬ _ДефолтыОблигаций
		|ИЗ
		|	РегистрСведений.ДефолтыПоОблигациям.СрезПоследних(&Дата, ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации)) КАК ДефолтыПоОблигациямСрезПоследних
		|ГДЕ
		|	ДефолтыПоОблигациямСрезПоследних.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ(2011, 9, 7, 0, 0, 0),
		|	&ДефолтнаяМОИА2,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации),
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт),
		|	&ДефолтнаяМОИА2Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДефолтыОблигаций.ОблигацияЭмитент.ЮрФизЛицо КАК Эмитент
		|ПОМЕСТИТЬ _ЭмитентыВДефолте
		|ИЗ
		|	_ДефолтыОблигаций КАК _ДефолтыОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	БухПартииЦенныхБумагОстаткиИОбороты.Период КАК Период,
		|	БухПартииЦенныхБумагОстаткиИОбороты.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ОстаткиЦБПоУчетнымАктивам
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
		|			&Период,
		|			&Период,
		|			ДЕНЬ,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦБПоУчетнымАктивам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ОстаткиЦБПоУчетнымАктивам.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
		|	_ОстаткиЦБПоУчетнымАктивам.Период КАК Период
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
		|ИЗ
		|	_ОстаткиЦБПоУчетнымАктивам КАК _ОстаткиЦБПоУчетнымАктивам
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиЦБПоУчетнымАктивам.ЦеннаяБумага,
		|	_ОстаткиЦБПоУчетнымАктивам.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦБПоУчетнымАктивам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦБПоУчетнымАктивам.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ОстаткиЦБПоУчетнымАктивам.КоличествоНачальныйОстаток / _ОстаткиЦенныхБумаг.КоличествоНачальныйОстаток КАК КоэффициентУчетногоАктиваЕПС
		|ПОМЕСТИТЬ _КоэффициентыУчетныхАктивовЕПСДляПогашенийЦБИКупонов
		|ИЗ
		|	_ОстаткиЦБПоУчетнымАктивам КАК _ОстаткиЦБПоУчетнымАктивам
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ПО _ОстаткиЦБПоУчетнымАктивам.ЦеннаяБумага = _ОстаткиЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК Актив,
		|	ЕСТЬNULL(_ПогашенныеНесписанныеОблигации.БалансоваяСтоимость, ЕСТЬNULL(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД, 0)) + ЕСТЬNULL(_ПогашенныеНесписанныеОблигации.Переоценка, ЕСТЬNULL(_ЦенныеБумаги.Переоценка, 0)) + ЕСТЬNULL(_ПогашенныеНесписанныеОблигации.НКД, ЕСТЬNULL(_ЦенныеБумаги.НКДУплаченныйНачисленный, 0)) + ЕСТЬNULL(_ПогашенныеНесписанныеОблигации.Дисконт, ЕСТЬNULL(_ЦенныеБумаги.Дисконт, 0)) + ЕСТЬNULL(_ПогашенныеНесписанныеОблигации.Премия, ЕСТЬNULL(_ЦенныеБумаги.Премия, 0)) + ЕСТЬNULL(_ПогашенныеНесписанныеОблигации.Корректировка, ЕСТЬNULL(_ЦенныеБумаги.Корректировка, 0)) - ЕСТЬNULL(_ЦенныеБумаги.СуммаРезервовПодОбесценение, 0) + ЕСТЬNULL(_ПогашениеКупонаНеИсполненноеВСрок.Сумма, 0) + ЕСТЬNULL(ЗадолженностьПоЦБКупонамДивидендам.Сумма, 0) КАК БалансоваяСтоимостьВсего,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА 1
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|							И ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Подкатегория <> ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗРФ)
		|						ТОГДА 3
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|							И ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Подкатегория = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗРФ)
		|						ТОГДА 4
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|						ТОГДА 5
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
		|						ТОГДА 6
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
		|						ТОГДА 7
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|							И ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма, """") = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.ГосударственнаяКорпорация)
		|						ТОГДА 8
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|							И ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма, """") = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.ФедеральноеГосударственноеУнитарноеПредприятие)
		|						ТОГДА 9
		|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|						ТОГДА 10
		|					ИНАЧЕ 11
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА 12
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА 13
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ВалютныеПары)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|					И ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс), ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион))
		|			ТОГДА 21
		|		ИНАЧЕ 27
		|	КОНЕЦ КАК НомерБлока,
		|	НЕОПРЕДЕЛЕНО КАК ВидЗадолженности,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	_ЦенныеБумаги.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _Портфель
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Номиналы КАК _Номиналы
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _Номиналы.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДефолтыОблигаций КАК _ДефолтыОблигаций
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ДефолтыОблигаций.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПогашенныеНесписанныеОблигации КАК _ПогашенныеНесписанныеОблигации
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ПогашенныеНесписанныеОблигации.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПогашениеКупонаНеИсполненноеВСрок КАК _ПогашениеКупонаНеИсполненноеВСрок
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ПогашениеКупонаНеИсполненноеВСрок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_Задолженность.ДоговорСделка КАК ЦеннаяБумага,
		|			_Задолженность.СуммаДт * ЕСТЬNULL(_КоэффициентыУчетныхАктивовЕПСДляПогашенийЦБИКупонов.КоэффициентУчетногоАктиваЕПС, 1) КАК Сумма,
		|			_КоэффициентыУчетныхАктивовЕПСДляПогашенийЦБИКупонов.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|		ИЗ
		|			_Задолженность КАК _Задолженность
		|				ЛЕВОЕ СОЕДИНЕНИЕ _КоэффициентыУчетныхАктивовЕПСДляПогашенийЦБИКупонов КАК _КоэффициентыУчетныхАктивовЕПСДляПогашенийЦБИКупонов
		|				ПО _Задолженность.ДоговорСделка = _КоэффициентыУчетныхАктивовЕПСДляПогашенийЦБИКупонов.ЦеннаяБумага
		|		ГДЕ
		|			&ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
		|			И _Задолженность.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки))) КАК ЗадолженностьПоЦБКупонамДивидендам
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = ЗадолженностьПоЦБКупонамДивидендам.ЦеннаяБумага
		|			И _ЦенныеБумаги.УчетныйАктивЕПС = ЗадолженностьПоЦБКупонамДивидендам.УчетныйАктивЕПС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДепозитныеВклады.Ссылка,
		|	ЕСТЬNULL(_ДепозитныеВкладыТело.СуммаОстаток, 0) + ЕСТЬNULL(_ДепозитныеВкладыКорректировка.СуммаОстаток, 0),
		|	19,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_ДепозитныеВклады КАК _ДепозитныеВклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыТело
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _ДепозитныеВкладыТело.ДепозитныйВклад
		|			И (_ДепозитныеВкладыТело.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыКорректировка
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _ДепозитныеВкладыКорректировка.ДепозитныйВклад
		|			И (_ДепозитныеВкладыКорректировка.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО (ДепозитныеВклады.Ссылка = _ДепозитныеВклады.ДепозитныйВклад)
		|ГДЕ
		|	_ДепозитныеВклады.ДепозитныйВклад ССЫЛКА Справочник.ДепозитныеВклады
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДепозитныеВклады.Ссылка,
		|	ЕСТЬNULL(_ДепозитныеВкладыПроценты.СуммаОстаток, 0),
		|	19,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_ДепозитныеВклады КАК _ДепозитныеВклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыПроценты
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _ДепозитныеВкладыПроценты.ДепозитныйВклад
		|			И (_ДепозитныеВкладыПроценты.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО (ДепозитныеВклады.Ссылка = _ДепозитныеВклады.ДепозитныйВклад)
		|ГДЕ
		|	_ДепозитныеВклады.ДепозитныйВклад ССЫЛКА Справочник.ДепозитныеВклады
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументМНО.РасчетныйСчет,
		|	ЕСТЬNULL(_ДепозитныеВкладыОстатки.СуммаОстаток, 0),
		|	16,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокументМНО
		|		ПО (ДокументМНО.Ссылка = _ДепозитныеВкладыОстатки.ДепозитныйВклад)
		|ГДЕ
		|	_ДепозитныеВкладыОстатки.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07))
		|	И _ДепозитныеВкладыОстатки.ДепозитныйВклад ССЫЛКА Документ.МНО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаСМО.РасчетныйСчет,
		|	ЕСТЬNULL(_ДепозитныеВкладыОстатки.СуммаОстаток, 0),
		|	16,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСМО КАК СделкаСМО
		|		ПО (СделкаСМО.Ссылка = _ДепозитныеВкладыОстатки.ДепозитныйВклад)
		|ГДЕ
		|	_ДепозитныеВкладыОстатки.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДенежныеСредства.БанковскийСчетДоговорБрок,
		|	_ДенежныеСредства.Сумма,
		|	16,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_ДенежныеСредства КАК _ДенежныеСредства
		|ГДЕ
		|	_ДенежныеСредства.Раздел = ""Денежные средства на расчетных счетах""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДенежныеСредства.БанковскийСчетДоговорБрок,
		|	_ДенежныеСредства.Сумма,
		|	17,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_ДенежныеСредства КАК _ДенежныеСредства
		|ГДЕ
		|	НЕ _ДенежныеСредства.Раздел В (""Денежные средства на расчетных счетах"", ""Денежные средства на клиринговых счетах"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДенежныеСредства.БанковскийСчетДоговорБрок,
		|	_ДенежныеСредства.Сумма,
		|	18,
		|	НЕОПРЕДЕЛЕНО,
		|	&НКО_НКЦ,
		|	NULL
		|ИЗ
		|	_ДенежныеСредства КАК _ДенежныеСредства
		|ГДЕ
		|	_ДенежныеСредства.Раздел = ""Денежные средства на клиринговых счетах""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьСделкиРЕПО.ЦеннаяБумага,
		|	_ДебиторскаяЗадолженность.СуммаДт,
		|	26,
		|	НЕОПРЕДЕЛЕНО,
		|	_ДебиторскаяЗадолженность.Контрагент,
		|	NULL
		|ИЗ
		|	_Задолженность КАК _ДебиторскаяЗадолженность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностьСделкиРЕПО КАК _ЗадолженностьСделкиРЕПО
		|		ПО _ДебиторскаяЗадолженность.ДоговорСделка = _ЗадолженностьСделкиРЕПО.Сделка
		|ГДЕ
		|	_ДебиторскаяЗадолженность.СуммаДт <> 0
		|	И ТИПЗНАЧЕНИЯ(_ДебиторскаяЗадолженность.ДоговорСделка) = ТИП(Документ.СделкаРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДебиторскаяЗадолженность.Контрагент,
		|	_ДебиторскаяЗадолженность.СуммаДт,
		|	25,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ДебиторскаяЗадолженность.ДоговорСделка) = ТИП(Справочник.ВидыЗадолженности)
		|			ТОГДА _ДебиторскаяЗадолженность.ДоговорСделка
		|		КОГДА ТИПЗНАЧЕНИЯ(_ДебиторскаяЗадолженность.ВидЗадолженности) В (ТИП(Справочник.ВидыЗадолженности), ТИП(СТРОКА))
		|			ТОГДА _ДебиторскаяЗадолженность.ВидЗадолженности
		|		КОГДА _ДебиторскаяЗадолженность.ДоговорСделка = ""Комиссии по сделкам""
		|			ТОГДА _ДебиторскаяЗадолженность.ДоговорСделка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам)
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА _ДебиторскаяЗадолженность.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолевыеПоСправедливой)
		|		ИНАЧЕ NULL
		|	КОНЕЦ
		|ИЗ
		|	_Задолженность КАК _ДебиторскаяЗадолженность
		|ГДЕ
		|	_ДебиторскаяЗадолженность.СуммаДт <> 0
		|	И ТИПЗНАЧЕНИЯ(_ДебиторскаяЗадолженность.ДоговорСделка) <> ТИП(Документ.СделкаРЕПО)
		|	И (НЕ _ДебиторскаяЗадолженность.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ""Проценты по МНО"")
		|			ИЛИ _ДебиторскаяЗадолженность.ВидЗадолженности ЕСТЬ NULL)
		|	И ВЫБОР
		|			КОГДА _ДебиторскаяЗадолженность.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки))
		|				ТОГДА НЕ &ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Задолженность.ДоговорСделка,
		|	_Задолженность.СуммаДт,
		|	16,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_Задолженность КАК _Задолженность
		|ГДЕ
		|	_Задолженность.СуммаДт <> 0
		|	И _Задолженность.ВидЗадолженности = ""Проценты по МНО""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДебиторскаяЗадолженность.ДоговорСделка,
		|	_ДебиторскаяЗадолженность.СуммаДт,
		|	23,
		|	_ДебиторскаяЗадолженность.ВидЗадолженности,
		|	_ДебиторскаяЗадолженность.Контрагент,
		|	NULL
		|ИЗ
		|	_Задолженность КАК _ДебиторскаяЗадолженность
		|ГДЕ
		|	_ДебиторскаяЗадолженность.СуммаДт <> 0
		|	И _ДебиторскаяЗадолженность.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|	И НЕ &ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьСделкиРЕПО.ЦеннаяБумага,
		|	-_КредиторскаяЗадолженность.СуммаКт,
		|	28,
		|	НЕОПРЕДЕЛЕНО,
		|	_КредиторскаяЗадолженность.Контрагент,
		|	NULL
		|ИЗ
		|	_Задолженность КАК _КредиторскаяЗадолженность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностьСделкиРЕПО КАК _ЗадолженностьСделкиРЕПО
		|		ПО _КредиторскаяЗадолженность.ДоговорСделка = _ЗадолженностьСделкиРЕПО.Сделка
		|ГДЕ
		|	_КредиторскаяЗадолженность.СуммаКт <> 0
		|	И ТИПЗНАЧЕНИЯ(_КредиторскаяЗадолженность.ДоговорСделка) = ТИП(Документ.СделкаРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_КредиторскаяЗадолженность.Контрагент,
		|	-_КредиторскаяЗадолженность.СуммаКт,
		|	29,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_КредиторскаяЗадолженность.ДоговорСделка) = ТИП(Справочник.ВидыЗадолженности)
		|			ТОГДА _КредиторскаяЗадолженность.ДоговорСделка
		|		КОГДА ТИПЗНАЧЕНИЯ(_КредиторскаяЗадолженность.ВидЗадолженности) В (ТИП(Справочник.ВидыЗадолженности), ТИП(СТРОКА))
		|			ТОГДА _КредиторскаяЗадолженность.ВидЗадолженности
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходамИРасходам)
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_Задолженность КАК _КредиторскаяЗадолженность
		|ГДЕ
		|	_КредиторскаяЗадолженность.СуммаКт <> 0
		|	И ТИПЗНАЧЕНИЯ(_КредиторскаяЗадолженность.ДоговорСделка) <> ТИП(Документ.СделкаРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОперацииСПриобретеннымиЦеннымиБумагами.ДоговорСделка,
		|	_ОперацииСПриобретеннымиЦеннымиБумагами.СуммаДт,
		|	25,
		|	_ОперацииСПриобретеннымиЦеннымиБумагами.ВидЗадолженности,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_ОперацииСПриобретеннымиЦеннымиБумагами КАК _ОперацииСПриобретеннымиЦеннымиБумагами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Портфель.НомерБлока КАК НомерБлока,
		|	_Портфель.Актив КАК Актив,
		|	СУММА(_Портфель.БалансоваяСтоимостьВсего) КАК БалансоваяСтоимостьВсего,
		|	_Портфель.ВидЗадолженности КАК ВидЗадолженности,
		|	_Портфель.Контрагент КАК Контрагент,
		|	_Портфель.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ПортфельСвернуто
		|ИЗ
		|	_Портфель КАК _Портфель
		|
		|СГРУППИРОВАТЬ ПО
		|	_Портфель.НомерБлока,
		|	_Портфель.Актив,
		|	_Портфель.ВидЗадолженности,
		|	_Портфель.Контрагент,
		|	_Портфель.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВидыАктивов.КлассАктива КАК КлассАктива,
		|	_ПортфельСвернуто.НомерБлока КАК НомерБлока,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПортфельСвернуто.Актив) = ТИП(Справочник.ЮрФизЛица)
		|				И _ПортфельСвернуто.ВидЗадолженности = ""Комиссии по сделкам""
		|			ТОГДА _ПортфельСвернуто.ВидЗадолженности
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПортфельСвернуто.Актив) = ТИП(Справочник.ЮрФизЛица)
		|				И ТИПЗНАЧЕНИЯ(_ПортфельСвернуто.ВидЗадолженности) = ТИП(Справочник.ВидыЗадолженности)
		|				И _ПортфельСвернуто.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.)
		|			ТОГДА _ПортфельСвернуто.ВидЗадолженности
		|		ИНАЧЕ _ПортфельСвернуто.Актив
		|	КОНЕЦ КАК Актив,
		|	_ПортфельСвернуто.БалансоваяСтоимостьВсего КАК БалансоваяСтоимость,
		|	_ПортфельСвернуто.ВидЗадолженности КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПортфельСвернуто.Актив) = ТИП(Справочник.ЮрФизЛица)
		|				И _ПортфельСвернуто.Актив <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА _ПортфельСвернуто.Актив
		|		ИНАЧЕ _ПортфельСвернуто.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	_ПортфельСвернуто.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ИмяТаблицы
		|ИЗ
		|	_ПортфельСвернуто КАК _ПортфельСвернуто
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыАктивов КАК _ВидыАктивов
		|		ПО _ПортфельСвернуто.НомерБлока = _ВидыАктивов.НомерБлока";	
		
	#КонецОбласти
		
	Запрос.УстановитьПараметр("Биржа", 										ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Запрос.УстановитьПараметр("Организация", 								ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации", 							ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Период", 									?(ЭтоНачалоПериода, Новый Граница(Дата - 1, ВидГраницы.Включая), Новый Граница(КонецДня(Дата), ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("Дата", 										НачалоДня(Дата));
	Запрос.УстановитьПараметр("ПоследнийРабочийДень",						ПоследнийРабочийДень);
	Запрос.УстановитьПараметр("ЦельРасчета", 								ЦельРасчета);
	Запрос.УстановитьПараметр("ЦельРасчетаБаланс", 							ЦельРасчетаБаланс);
	Запрос.УстановитьПараметр("ВидУчетаБаланс", 							ВидУчетаБаланс);
	Запрос.УстановитьПараметр("ДефолтнаяМОИА2", 							ОбщегоНазначения.ПолучитьИменованныйОбъект("ДефолтнаяМОИА2"));
	Запрос.УстановитьПараметр("ДефолтнаяМОИА2Эмитент", 						ОбщегоНазначения.ПолучитьИменованныйОбъект("ДефолтнаяМОИА2").Эмитент);
	Запрос.УстановитьПараметр("НачалоГода",									НачалоГода(Дата));
	Запрос.УстановитьПараметр("ПроцентныеДоходыНаСчетахАктивов",			ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов);
	Запрос.УстановитьПараметр("ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ", 	ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ());
	Запрос.УстановитьПараметр("НКО_НКЦ", 									ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	Запрос.УстановитьПараметр("ПереходНаМСФО9",								ЭтотОбъект.Период.ДатаНачала = '20250101');
	
	// сделано для Сафмара т.к. они учитывают ее невзирая на дефолт
	Запрос.УстановитьПараметр("ДефолтнаяОткрытие4",				ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрХолдинг_004"));
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);	
		
	Если НастройкиУчета.УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу = Неопределено Тогда 
		//настройка не задана, или Счет ДУ от другой организации
		УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу = Ложь;
	Иначе 	
		УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу = НастройкиУчета.УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу;
	КонецЕсли;		
		
	Запрос.УстановитьПараметр("УчитыватьПогашенныеОблигации",									Истина);
	Запрос.УстановитьПараметр("УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу", 	УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу);
	
	МассивСубконтоКонтрагентыОснованиеРасчетов = Новый Массив;
	МассивСубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	МассивСубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	
	Запрос.УстановитьПараметр("СубконтоКонтрагентыОснованиеРасчетов", 	МассивСубконтоКонтрагентыОснованиеРасчетов);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговоры", 			СубконтоКонтрагентыДоговоры);
	
	ИмяТаблицыРезультата = ?(ЭтоНачалоПериода, "_ПортфельНаНачалоПериода", "_ПортфельНаКонецПериода");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ИмяТаблицы", ИмяТаблицыРезультата);
	
	Запрос.Выполнить();
		
	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос,, "_СчетаДоверительногоУправления,_ВидыАктивов,_ДоходыРасходы, _УчетныеАктивыЕПСПоСделкам, " + ИмяТаблицыРезультата + ?(ЭтоНачалоПериода, "", ",_ПортфельНаНачалоПериода"));
		
КонецПроцедуры

Процедура ПолучитьСредневзвешенныеВложенияЗаПериод(МенеджерВременныхТаблиц, АдресВХранилищеСДаннымиДляРасшифровки)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СредневзвешенныеВложения_УстановитьПараметры(Запрос);
		
	СоответствиеРезультатовЗапросаДляРасшифровки = ?(АдресВХранилищеСДаннымиДляРасшифровки = Неопределено 
														Или АдресВХранилищеСДаннымиДляРасшифровки = "",
													Неопределено,
													ПолучитьИзВременногоХранилища(АдресВХранилищеСДаннымиДляРасшифровки));
	
	СредневзвешенныеВложения_ОсновнойЗапрос(Запрос, , СоответствиеРезультатовЗапросаДляРасшифровки);
	
	Если СоответствиеРезультатовЗапросаДляРасшифровки <> Неопределено Тогда
		АдресВХранилищеСДаннымиДляРасшифровки = ПоместитьВоВременноеХранилище(СоответствиеРезультатовЗапросаДляРасшифровки);
	КонецЕсли;
	
	Запрос.Текст = 
	
	#Область Текст_запроса

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Средневзвешенные_ДенежныеСредства_Развернуто.Актив КАК Актив,
		|	_Средневзвешенные_ДенежныеСредства_Развернуто.СчетКлиринга КАК СчетКлиринга,
		|	СУММА(_Средневзвешенные_ДенежныеСредства_Развернуто.СредневзвешенныеВложения) КАК СредневзвешенныеВложения
		|ПОМЕСТИТЬ _Средневзвешенные_ДенежныеСредства
		|ИЗ
		|	_Средневзвешенные_ДенежныеСредства_Развернуто КАК _Средневзвешенные_ДенежныеСредства_Развернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_Средневзвешенные_ДенежныеСредства_Развернуто.Актив,
		|	_Средневзвешенные_ДенежныеСредства_Развернуто.СчетКлиринга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Средневзвешенные_СделкиРЕПО_Развернуто.Актив КАК Актив,
		|	СУММА(_Средневзвешенные_СделкиРЕПО_Развернуто.СредневзвешенныеВложения) КАК СредневзвешенныеВложения
		|ПОМЕСТИТЬ _Средневзвешенные_СделкиРЕПО
		|ИЗ
		|	_Средневзвешенные_СделкиРЕПО_Развернуто КАК _Средневзвешенные_СделкиРЕПО_Развернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_Средневзвешенные_СделкиРЕПО_Развернуто.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Средневзвешенные_Депозиты_Развернуто.Актив КАК Актив,
		|	СУММА(_Средневзвешенные_Депозиты_Развернуто.СредневзвешенныеВложения) КАК СредневзвешенныеВложения
		|ПОМЕСТИТЬ _Средневзвешенные_Депозиты
		|ИЗ
		|	_Средневзвешенные_Депозиты_Развернуто КАК _Средневзвешенные_Депозиты_Развернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_Средневзвешенные_Депозиты_Развернуто.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Средневзвешенные_ЦенныеБумаги_Развернуто.Актив КАК Актив,
		|	СУММА(_Средневзвешенные_ЦенныеБумаги_Развернуто.СредневзвешенныеВложения) КАК СредневзвешенныеВложения,
		|	_Средневзвешенные_ЦенныеБумаги_Развернуто.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _Средневзвешенные_ЦенныеБумаги
		|ИЗ
		|	_Средневзвешенные_ЦенныеБумаги_Развернуто КАК _Средневзвешенные_ЦенныеБумаги_Развернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_Средневзвешенные_ЦенныеБумаги_Развернуто.Актив,
		|	_Средневзвешенные_ЦенныеБумаги_Развернуто.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Средневзвешенные_Задолженность_Развернуто.Актив КАК Актив,
		|	СУММА(_Средневзвешенные_Задолженность_Развернуто.СредневзвешенныеВложения) КАК СредневзвешенныеВложения,
		|	_Средневзвешенные_Задолженность_Развернуто.ТипЗадолженности КАК ТипЗадолженности,
		|	_Средневзвешенные_Задолженность_Развернуто.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _Средневзвешенные_Задолженность
		|ИЗ
		|	_Средневзвешенные_Задолженность_Развернуто КАК _Средневзвешенные_Задолженность_Развернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_Средневзвешенные_Задолженность_Развернуто.Актив,
		|	_Средневзвешенные_Задолженность_Развернуто.ТипЗадолженности,
		|	_Средневзвешенные_Задолженность_Развернуто.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Средневзвешенные_ДЗпоНКД_Развернуто.Актив КАК Актив,
		|	СУММА(_Средневзвешенные_ДЗпоНКД_Развернуто.СредневзвешенныеВложения) КАК СредневзвешенныеВложения
		|ПОМЕСТИТЬ _Средневзвешенные_ДЗпоНКД
		|ИЗ
		|	_Средневзвешенные_ДЗпоНКД_Развернуто КАК _Средневзвешенные_ДЗпоНКД_Развернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_Средневзвешенные_ДЗпоНКД_Развернуто.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Денежные средства"" КАК Раздел,
		|	_Средневзвешенные_ДенежныеСредства.Актив КАК Актив,
		|	_Средневзвешенные_ДенежныеСредства.СредневзвешенныеВложения КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	NULL КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _СредневзвешенныеВложения
		|ИЗ
		|	_Средневзвешенные_ДенежныеСредства КАК _Средневзвешенные_ДенежныеСредства
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_Средневзвешенные_ДенежныеСредства.Актив) = ТИП(Справочник.БанковскиеСчета)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства на счетах клиринга"",
		|	_Средневзвешенные_ДенежныеСредства.Актив,
		|	_Средневзвешенные_ДенежныеСредства.СредневзвешенныеВложения,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_Средневзвешенные_ДенежныеСредства КАК _Средневзвешенные_ДенежныеСредства
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_Средневзвешенные_ДенежныеСредства.Актив) <> ТИП(Справочник.БанковскиеСчета)
		|	И _Средневзвешенные_ДенежныеСредства.СчетКлиринга
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства у брокера"",
		|	_Средневзвешенные_ДенежныеСредства.Актив,
		|	_Средневзвешенные_ДенежныеСредства.СредневзвешенныеВложения,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_Средневзвешенные_ДенежныеСредства КАК _Средневзвешенные_ДенежныеСредства
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_Средневзвешенные_ДенежныеСредства.Актив) <> ТИП(Справочник.БанковскиеСчета)
		|	И НЕ _Средневзвешенные_ДенежныеСредства.СчетКлиринга
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Сделки РЕПО"",
		|	_Средневзвешенные_СделкиРЕПО.Актив,
		|	_Средневзвешенные_СделкиРЕПО.СредневзвешенныеВложения,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_Средневзвешенные_СделкиРЕПО КАК _Средневзвешенные_СделкиРЕПО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Депозиты"",
		|	_Средневзвешенные_Депозиты.Актив,
		|	_Средневзвешенные_Депозиты.СредневзвешенныеВложения,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_Средневзвешенные_Депозиты КАК _Средневзвешенные_Депозиты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Ценные бумаги"",
		|	_Средневзвешенные_ЦенныеБумаги.Актив,
		|	_Средневзвешенные_ЦенныеБумаги.СредневзвешенныеВложения,
		|	НЕОПРЕДЕЛЕНО,
		|	_Средневзвешенные_ЦенныеБумаги.УчетныйАктивЕПС
		|ИЗ
		|	_Средневзвешенные_ЦенныеБумаги КАК _Средневзвешенные_ЦенныеБумаги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Дебиторская задолженность по накопленному купонному доходу (НКД)"",
		|	_Средневзвешенные_ДЗпоНКД.Актив,
		|	_Средневзвешенные_ДЗпоНКД.СредневзвешенныеВложения,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL
		|ИЗ
		|	_Средневзвешенные_ДЗпоНКД КАК _Средневзвешенные_ДЗпоНКД
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Прочая дебиторская задолженность"",
		|	_Средневзвешенные_Задолженность.Актив,
		|	_Средневзвешенные_Задолженность.СредневзвешенныеВложения,
		|	_Средневзвешенные_Задолженность.Контрагент,
		|	NULL
		|ИЗ
		|	_Средневзвешенные_Задолженность КАК _Средневзвешенные_Задолженность
		|ГДЕ
		|	_Средневзвешенные_Задолженность.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Прочая кредиторская задолженность"",
		|	_Средневзвешенные_Задолженность.Актив,
		|	_Средневзвешенные_Задолженность.СредневзвешенныеВложения,
		|	_Средневзвешенные_Задолженность.Контрагент,
		|	NULL
		|ИЗ
		|	_Средневзвешенные_Задолженность КАК _Средневзвешенные_Задолженность
		|ГДЕ
		|	_Средневзвешенные_Задолженность.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)";
	
	#КонецОбласти

	Запрос.Выполнить();
	
	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос,, "_СчетаДоверительногоУправления,_ВидыАктивов,_ДоходыРасходы,_ПортфельНаНачалоПериода,_ПортфельНаКонецПериода,_СредневзвешенныеВложения");
	
КонецПроцедуры

Процедура СредневзвешенныеВложения_УстановитьПараметры(Запрос)
	
	Запрос.УстановитьПараметр("НачалоПериода",								ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",								ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("КонецПериодаГраница",						Новый Граница(ЭтотОбъект.Период.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",								Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",				СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ", 	ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ());
    Запрос.УстановитьПараметр("НачалоПериодаСРВЗ", 							?(ЭтотОбъект.Период.ДатаНачала = '20250101', '20250101000002', ЭтотОбъект.Период.ДатаНачала));
	
	МассивСубконтоКонтрагентыОснованиеРасчетов = Новый Массив;
	МассивСубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	МассивСубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);	
	
	Запрос.УстановитьПараметр("СубконтоКонтрагентыОснованиеРасчетов", МассивСубконтоКонтрагентыОснованиеРасчетов);

	СчетаДС = Новый Массив;
	СчетаДС.Добавить(ПланыСчетов.Единый.РасчетныеСчета);
	СчетаДС.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами);
	СчетаДС.Добавить(ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05);
	СчетаДС.Добавить(ПланыСчетов.Единый.Расчеты22);

	Запрос.УстановитьПараметр("СчетаДС", СчетаДС);
	
КонецПроцедуры

Процедура СредневзвешенныеВложения_ОсновнойЗапрос(Запрос, ИмяТаблицы = Неопределено, СоответствиеРезультатовЗапросаДляРасшифровки = Неопределено)
	
	// Процедура используется и для всего отчета, и для расшифровки.
	// Поэтому запрос собирается и выполняется по частям
	
	Если ИмяТаблицы <> Неопределено Тогда
		ПоместитьСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
		ПоместитьСоответствиеУчетныхАктивовЕПСИГФУВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
	КонецЕсли;
	
	#Область Общие_таблицы
	
	// Таблицы курсов и количества дней нужны в любом случае
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ) + 1 КАК ДнейВПериоде
		|ПОМЕСТИТЬ _КоличествоДней
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалют.Период КАК Период,
		|	КурсыВалют.Валюта КАК Валюта,
		|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Курс
		|ПОМЕСТИТЬ _КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1) И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниПериода
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1) И &КонецПериода";
	
	Запрос.Выполнить(); 		
		
	Если ИмяТаблицы = Неопределено 
		Или ИмяТаблицы = "_Средневзвешенные_ДенежныеСредства_Развернуто"
		Или ИмяТаблицы = "_Средневзвешенные_Депозиты_Развернуто" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК ДепозитныйВклад,
			|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет КАК РасчетныйСчет
			|ПОМЕСТИТЬ _СписокДепозитов
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериодаГраница,
			|			,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)
			|				И ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты";
		
		Запрос.Выполнить();
		
	КонецЕсли;	
	
	#КонецОбласти
	
	#Область Денежные_средства
	
	Если ИмяТаблицы = Неопределено 
		Или ИмяТаблицы = "_Средневзвешенные_ДенежныеСредства_Развернуто" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчета,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДепозитныйВклад,
			|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
			|ПОМЕСТИТЬ _ДепозитныеВкладыОстатки_Начало
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&НачалоПериодаСРВЗ,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11)),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
			|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&НачалоПериодаСРВЗ,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13)),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчета,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДепозитныйВклад,
			|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
			|ПОМЕСТИТЬ _ДепозитныеВкладыОстатки_Конец
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&КонецПериодаГраница,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11)),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
			|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&КонецПериодаГраница,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13)),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументМНО.РасчетныйСчет КАК РасчетныйСчет,
			|	ЕСТЬNULL(_ДепозитныеВкладыОстатки.СуммаОстаток, 0) КАК Сумма
			|ПОМЕСТИТЬ _МНО_Начало
			|ИЗ
			|	_ДепозитныеВкладыОстатки_Начало КАК _ДепозитныеВкладыОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокументМНО
			|		ПО (ДокументМНО.Ссылка = _ДепозитныеВкладыОстатки.ДепозитныйВклад)
			|ГДЕ
			|	_ДепозитныеВкладыОстатки.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СделкаСМО.РасчетныйСчет,
			|	ЕСТЬNULL(_ДепозитныеВкладыОстатки.СуммаОстаток, 0)
			|ИЗ
			|	_ДепозитныеВкладыОстатки_Начало КАК _ДепозитныеВкладыОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСМО КАК СделкаСМО
			|		ПО (СделкаСМО.Ссылка = _ДепозитныеВкладыОстатки.ДепозитныйВклад)
			|ГДЕ
			|	_ДепозитныеВкладыОстатки.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументМНО.РасчетныйСчет КАК РасчетныйСчет,
			|	ЕСТЬNULL(_ДепозитныеВкладыОстатки.СуммаОстаток, 0) КАК Сумма
			|ПОМЕСТИТЬ _МНО_Конец
			|ИЗ
			|	_ДепозитныеВкладыОстатки_Конец КАК _ДепозитныеВкладыОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокументМНО
			|		ПО (ДокументМНО.Ссылка = _ДепозитныеВкладыОстатки.ДепозитныйВклад)
			|ГДЕ
			|	_ДепозитныеВкладыОстатки.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СделкаСМО.РасчетныйСчет,
			|	ЕСТЬNULL(_ДепозитныеВкладыОстатки.СуммаОстаток, 0)
			|ИЗ
			|	_ДепозитныеВкладыОстатки_Конец КАК _ДепозитныеВкладыОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСМО КАК СделкаСМО
			|		ПО (СделкаСМО.Ссылка = _ДепозитныеВкладыОстатки.ДепозитныйВклад)
			|ГДЕ
			|	_ДепозитныеВкладыОстатки.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОборотыПроцентыПоДепозитамЛинейно.Период КАК Период,
			|	ОборотыПроцентыПоДепозитамЛинейно.СуммаОборот КАК Сумма,
			|	ОборотыПроцентыПоДепозитамЛинейно.КорСубконто2 КАК РасчетныйСчет
			|ПОМЕСТИТЬ _ПроцентыМНО
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			ДЕНЬ,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета01), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация17)),
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВЫРАЗИТЬ(КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31122"", ""31123"", ""31120"", ""31121"", ""41214""),
			|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций02)),
			|			) КАК ОборотыПроцентыПоДепозитамЛинейно
			|ГДЕ
			|	НЕ ВЫРАЗИТЬ(ОборотыПроцентыПоДепозитамЛинейно.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31122"", ""31123"")
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&НачалоПериодаСРВЗ КАК Период,
			|	ОстаткиПроцентовМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	0 КАК Сумма,
			|	ОстаткиПроцентовМНО.Субконто1 КАК Актив
			|ПОМЕСТИТЬ _ПроцентыМНО_НачалоПериода
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&НачалоПериодаСРВЗ,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07),
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК ОстаткиПроцентовМНО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&НачалоПериодаСРВЗ КАК Период,
			|	ОстаткиПроцентовМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиПроцентовМНО.СуммаОстаток КАК Сумма,
			|	ОстаткиПроцентовМНО.Субконто1 КАК Актив
			|ПОМЕСТИТЬ _ПроцентыМНО_КонецПериода
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&КонецПериодаГраница,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07),
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК ОстаткиПроцентовМНО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Регистратор КАК Документ.НачислениеЗадолженности).РасчетныйСчет КАК Актив,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период КАК Период,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА -1
			|		ИНАЧЕ 1
			|	КОНЕЦ * (ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА -1
			|		ИНАЧЕ 1
			|	КОНЕЦ * (ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))) КАК Поток,
			|	""Начисление комиссии банка"" КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	0 КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _БанковскиеКомиссии
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.БанковскаяКомиссия))) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта = _КурсыВалют.Валюта
			|			И (_ДниПериода.Дата = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиДенежныхСредствОстаткиИОбороты.Период КАК Период,
			|	ВЫБОР
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|			ТОГДА ЕСТЬNULL(НомераСчетовКлиринга.Значение, ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК))
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
			|			ТОГДА ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания, ОстаткиДенежныхСредствОстаткиИОбороты.Брокер)
			|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет
			|	КОНЕЦ КАК Актив,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток + ЕСТЬNULL(_ПроцентыМНО_НачалоПериода.Сумма, 0) + ЕСТЬNULL(ОстаткиРезервов_НачалоПериода.СуммаОстаток, 0) КАК СуммаНачальныйОстаток,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(ОстаткиРезервов_КонецПериода.СуммаОстаток, 0) + ЕСТЬNULL(_ПроцентыМНО_КонецПериода.Сумма, 0) КАК СуммаКонечныйОстаток,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток + ЕСТЬNULL(_ПроцентыМНО_НачалоПериода.Сумма, 0) + ЕСТЬNULL(ОстаткиРезервов_НачалоПериода.СуммаОстаток, 0)
			|			КОГДА КОНЕЦПЕРИОДА(ОстаткиДенежныхСредствОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|				ТОГДА 0
			|			КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход <> 0
			|					ИЛИ ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход <> 0
			|				ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход - ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СредневзвешенныеВложения,
			|	ВЫБОР
			|		КОГДА ВЫБОР
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток + ЕСТЬNULL(_ПроцентыМНО_НачалоПериода.Сумма, 0) + ЕСТЬNULL(ОстаткиРезервов_НачалоПериода.СуммаОстаток, 0)
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период = &КонецПериода
			|					ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(ОстаткиРезервов_КонецПериода.СуммаОстаток, 0) + ЕСТЬNULL(_ПроцентыМНО_КонецПериода.Сумма, 0)
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход <> 0
			|						ИЛИ ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход <> 0
			|					ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход - ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход
			|			КОНЕЦ >= 0
			|			ТОГДА ВЫБОР
			|					КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|						ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток + ЕСТЬNULL(_ПроцентыМНО_НачалоПериода.Сумма, 0) + ЕСТЬNULL(ОстаткиРезервов_НачалоПериода.СуммаОстаток, 0)
			|					КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период = &КонецПериода
			|						ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(ОстаткиРезервов_КонецПериода.СуммаОстаток, 0) + ЕСТЬNULL(_ПроцентыМНО_КонецПериода.Сумма, 0)
			|					КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход <> 0
			|							ИЛИ ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход <> 0
			|						ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход - ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход
			|				КОНЕЦ
			|		ИНАЧЕ -ВЫБОР
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток + ЕСТЬNULL(_ПроцентыМНО_НачалоПериода.Сумма, 0) + ЕСТЬNULL(ОстаткиРезервов_НачалоПериода.СуммаОстаток, 0)
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период = &КонецПериода
			|					ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(ОстаткиРезервов_КонецПериода.СуммаОстаток, 0) + ЕСТЬNULL(_ПроцентыМНО_КонецПериода.Сумма, 0)
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход <> 0
			|						ИЛИ ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход <> 0
			|					ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход - ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход
			|			КОНЕЦ
			|	КОНЕЦ КАК СправедливаяСтоимость,
			|	ВЫБОР
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|			ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток + ЕСТЬNULL(_ПроцентыМНО_НачалоПериода.Сумма, 0) + ЕСТЬNULL(ОстаткиРезервов_НачалоПериода.СуммаОстаток, 0)
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период = &КонецПериода
			|			ТОГДА -(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток + ЕСТЬNULL(ОстаткиРезервов_КонецПериода.СуммаОстаток, 0) + ЕСТЬNULL(_ПроцентыМНО_КонецПериода.Сумма, 0))
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход <> 0
			|				ИЛИ ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход <> 0
			|			ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход - ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход
			|	КОНЕЦ КАК Поток,
			|	ВЫБОР
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|			ТОГДА ""(входящий остаток)""
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период = &КонецПериода
			|			ТОГДА ""(исходящий остаток)""
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход - ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход > 0
			|			ТОГДА ""Поступление""
			|		ИНАЧЕ ""Списание""
			|	КОНЕЦ КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	0 КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ОстаткиДенежныхСредствОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ОстаткиДенежныхСредствОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент,
			|	ВЫБОР
			|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК СчетКлиринга
			|ПОМЕСТИТЬ _Средневзвешенные_ДенежныеСредства_Развернуто
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И НЕ РасчетныйСчет В
			|						(ВЫБРАТЬ
			|							_СписокДепозитов.РасчетныйСчет
			|						ИЗ
			|							_СписокДепозитов)) КАК ОстаткиДенежныхСредствОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НомераСчетовКлиринга
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = НомераСчетовКлиринга.Объект
			|			И (НомераСчетовКлиринга.Свойство.Ключ = ""НомерСчетаКлирингаВНКО_НКЦ"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|				&КонецПериода,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.Брокер = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер
			|			И ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ОстаткиДенежныхСредствОстаткиИОбороты.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредствОстаткиИОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.Валюта = _КурсыВалют.Валюта
			|			И (_ДниПериода.Дата = _КурсыВалют.Период)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&НачалоПериодаСРВЗ,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05), ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07)),
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)) КАК ОстаткиРезервов_НачалоПериода
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.Организация = ОстаткиРезервов_НачалоПериода.Организация
			|			И ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = ОстаткиРезервов_НачалоПериода.СчетДоверительногоУправления
			|			И (ОстаткиДенежныхСредствОстаткиИОбороты.Период = &НачалоПериодаСРВЗ)
			|			И (ВЫБОР
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|					ТОГДА ОстаткиРезервов_НачалоПериода.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
			|					ТОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = ОстаткиРезервов_НачалоПериода.Субконто1
			|				ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = ОстаткиРезервов_НачалоПериода.Субконто1
			|			КОНЕЦ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&КонецПериодаГраница,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05), ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07)),
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)) КАК ОстаткиРезервов_КонецПериода
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.Организация = ОстаткиРезервов_КонецПериода.Организация
			|			И ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = ОстаткиРезервов_КонецПериода.СчетДоверительногоУправления
			|			И (ОстаткиДенежныхСредствОстаткиИОбороты.Период = &КонецПериода)
			|			И (ВЫБОР
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|					ТОГДА ОстаткиРезервов_КонецПериода.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
			|				КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
			|					ТОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = ОстаткиРезервов_КонецПериода.Субконто1
			|				ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = ОстаткиРезервов_КонецПериода.Субконто1
			|			КОНЕЦ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ПроцентыМНО_НачалоПериода КАК _ПроцентыМНО_НачалоПериода
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = _ПроцентыМНО_НачалоПериода.СчетДоверительногоУправления
			|			И ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = _ПроцентыМНО_НачалоПериода.Актив
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ПроцентыМНО_КонецПериода КАК _ПроцентыМНО_КонецПериода
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = _ПроцентыМНО_КонецПериода.СчетДоверительногоУправления
			|			И ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = _ПроцентыМНО_КонецПериода.Актив,
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_БанковскиеКомиссии.Период,
			|	_БанковскиеКомиссии.Актив,
			|	0,
			|	0,
			|	_БанковскиеКомиссии.СуммаПриход,
			|	0,
			|	_БанковскиеКомиссии.СредневзвешенныеВложения,
			|	_БанковскиеКомиссии.СправедливаяСтоимость,
			|	_БанковскиеКомиссии.Поток,
			|	_БанковскиеКомиссии.Действие,
			|	_БанковскиеКомиссии.Дата,
			|	_БанковскиеКомиссии.Количество,
			|	_БанковскиеКомиссии.ДнейВРаботе,
			|	_БанковскиеКомиссии.ДнейВРаботе_Процент,
			|	ЛОЖЬ
			|ИЗ
			|	_БанковскиеКомиссии КАК _БанковскиеКомиссии
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ПроцентыМНО.Период,
			|	_ПроцентыМНО.РасчетныйСчет,
			|	0,
			|	0,
			|	0,
			|	0,
			|	-(ВЫРАЗИТЬ(_ПроцентыМНО.Сумма * РАЗНОСТЬДАТ(_ПроцентыМНО.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2))),
			|	_ПроцентыМНО.Сумма,
			|	-_ПроцентыМНО.Сумма,
			|	""Начисление процентов на остаток"",
			|	НАЧАЛОПЕРИОДА(_ПроцентыМНО.Период, ДЕНЬ),
			|	0,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ПроцентыМНО.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ПроцентыМНО.Период, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ПроцентыМНО.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ПроцентыМНО.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ,
			|	ЛОЖЬ
			|ИЗ
			|	_ПроцентыМНО КАК _ПроцентыМНО,
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЕдиныйБухгалтерскийУчетОбороты.Период,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
			|			ТОГДА ЕСТЬNULL(НомераСчетовКлиринга.Значение, ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК))
			|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.Субконто1
			|	КОНЕЦ,
			|	0,
			|	0,
			|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
			|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0
			|				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2)),
			|	ВЫБОР
			|		КОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0)
			|				И ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт >= 0
			|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
			|		КОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0)
			|				И ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт < 0
			|			ТОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт)
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0
			|			ТОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт > 0
			|			ТОГДА ""Списание резерва""
			|		ИНАЧЕ ""Начисление резерва""
			|	КОНЕЦ,
			|	НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ),
			|	0,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ,
			|	ЛОЖЬ
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, -1),
			|			День,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета05), ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07)),
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления),
			|			,
			|			) КАК ЕдиныйБухгалтерскийУчетОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НомераСчетовКлиринга
			|		ПО ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления = НомераСчетовКлиринга.Объект
			|			И (НомераСчетовКлиринга.Свойство.Ключ = ""НомерСчетаКлирингаВНКО_НКЦ"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|				&КонецПериода,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		ПО ЕдиныйБухгалтерскийУчетОбороты.Субконто1.Контрагент = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер
			|			И ЕдиныйБухгалтерскийУчетОбороты.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления,
			|	_КоличествоДней КАК _КоличествоДней
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДепозитныеВкладыОстатки_Начало
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДепозитныеВкладыОстатки_Конец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _МНО_Начало
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _МНО_Конец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПроцентыМНО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _БанковскиеКомиссии";
		
		Запрос.Выполнить();
		
		ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапросаДляРасшифровки, Запрос.МенеджерВременныхТаблиц, "_Средневзвешенные_ДенежныеСредства_Развернуто");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Сделки_РЕПО
	
	Если ИмяТаблицы = Неопределено 
		Или ИмяТаблицы = "_Средневзвешенные_СделкиРЕПО_Развернуто" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПрочиеСредства.Основание КАК СделкаРЕПО,
			|	ПрочиеСредства.СуммаОстатокДт КАК Сумма,
			|	ПрочиеСредства.СуммаОстатокКт КАК СуммаОстатокКт
			|ПОМЕСТИТЬ _ОстаткиРЕПО_Начало
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент КАК Контрагент,
			|		ЕдиныйБухгалтерскийУчетОстатки.Основание КАК Основание,
			|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
			|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Основание,
			|			ВЫБОР
			|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
			|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
			|				ИНАЧЕ НЕОПРЕДЕЛЕНО
			|			КОНЕЦ КАК Контрагент,
			|			СУММА(ВЫБОР
			|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
			|						ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
			|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
			|				КОНЕЦ) КАК СуммаОстатокДт,
			|			СУММА(ВЫБОР
			|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
			|						ТОГДА 0
			|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
			|				КОНЕЦ) КАК СуммаОстатокКт
			|		ИЗ
			|			РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|					&НачалоПериодаСРВЗ,
			|					Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства)),
			|					,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления В
			|							(ВЫБРАТЬ
			|								_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|							ИЗ
			|								_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
			|			ВЫБОР
			|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
			|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
			|				ИНАЧЕ НЕОПРЕДЕЛЕНО
			|			КОНЕЦ) КАК ЕдиныйБухгалтерскийУчетОстатки
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ЕдиныйБухгалтерскийУчетОстатки.Основание,
			|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент) КАК ПрочиеСредства
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПрочиеСредства.Основание КАК СделкаРЕПО,
			|	ПрочиеСредства.СуммаОстатокДт КАК Сумма,
			|	ПрочиеСредства.СуммаОстатокКт КАК СуммаОстатокКт
			|ПОМЕСТИТЬ _ОстаткиРЕПО_Конец
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент КАК Контрагент,
			|		ЕдиныйБухгалтерскийУчетОстатки.Основание КАК Основание,
			|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
			|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Основание,
			|			ВЫБОР
			|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
			|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
			|				ИНАЧЕ НЕОПРЕДЕЛЕНО
			|			КОНЕЦ КАК Контрагент,
			|			СУММА(ВЫБОР
			|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
			|						ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
			|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
			|				КОНЕЦ) КАК СуммаОстатокДт,
			|			СУММА(ВЫБОР
			|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
			|						ТОГДА 0
			|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
			|				КОНЕЦ) КАК СуммаОстатокКт
			|		ИЗ
			|			РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|					&КонецПериодаГраница,
			|					Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства)),
			|					,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления В
			|							(ВЫБРАТЬ
			|								_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|							ИЗ
			|								_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
			|			ВЫБОР
			|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
			|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
			|				ИНАЧЕ НЕОПРЕДЕЛЕНО
			|			КОНЕЦ) КАК ЕдиныйБухгалтерскийУчетОстатки
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ЕдиныйБухгалтерскийУчетОстатки.Основание,
			|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент) КАК ПрочиеСредства
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокРЕПО1.СделкаРЕПО КАК СделкаРЕПО,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки КАК ВидСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.Дата КАК ДатаСделки,
			|	УсловияСделокРЕПО1.ЦеннаяБумага КАК Актив,
			|	УсловияСделокРЕПО1.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	ВЫРАЗИТЬ((УсловияСделокРЕПО1.Сумма + УсловияСделокРЕПО1.СуммаКупона) * РАЗНОСТЬДАТ(УсловияСделокРЕПО1.ДатаОплаты, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют1Части.Курс КАК ЧИСЛО(19, 2)) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ((УсловияСделокРЕПО1.Сумма + УсловияСделокРЕПО1.СуммаКупона) * _КурсыВалют1Части.Курс КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫРАЗИТЬ((УсловияСделокРЕПО1.Сумма + УсловияСделокРЕПО1.СуммаКупона) * _КурсыВалют1Части.Курс КАК ЧИСЛО(19, 2)) КАК Поток,
			|	""Первая часть сделки РЕПО"" КАК Действие,
			|	УсловияСделокРЕПО1.ДатаОплаты КАК Дата,
			|	УсловияСделокРЕПО1.ДатаОплаты КАК Период,
			|	УсловияСделокРЕПО1.Количество КАК Количество,
			|	РАЗНОСТЬДАТ(УсловияСделокРЕПО1.ДатаОплаты, &КонецПериода, ДЕНЬ) КАК ДнейВРаботе,
			|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(УсловияСделокРЕПО1.ДатаОплаты, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0)) КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _Средневзвешенные_СделкиРЕПО_Сделки
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И ЧастьСделкиРЕПО = 1
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО1
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют1Части
			|		ПО УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки = _КурсыВалют1Части.Валюта
			|			И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО1.ДатаОплаты, ДЕНЬ) = _КурсыВалют1Части.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	УсловияСделокРЕПО1.ДатаОплаты МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ УсловияСделокРЕПО1.Отменено
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	УсловияСделокРЕПО2.СделкаРЕПО,
			|	УсловияСделокРЕПО2.СделкаРЕПО.ВидСделки,
			|	УсловияСделокРЕПО2.СделкаРЕПО.ВалютаСделки,
			|	УсловияСделокРЕПО2.СделкаРЕПО.Дата,
			|	УсловияСделокРЕПО2.ЦеннаяБумага,
			|	УсловияСделокРЕПО2.ОтложенноеИсполнение,
			|	-ЕСТЬNULL(ВЫРАЗИТЬ((УсловияСделокРЕПО2.Сумма + УсловияСделокРЕПО2.СуммаКупона) * РАЗНОСТЬДАТ(УсловияСделокРЕПО2.ДатаОплаты, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют2Части.Курс КАК ЧИСЛО(19, 2)), 0),
			|	ЕСТЬNULL(ВЫРАЗИТЬ((УсловияСделокРЕПО2.Сумма + УсловияСделокРЕПО2.СуммаКупона) * _КурсыВалют2Части.Курс КАК ЧИСЛО(19, 2)), 0),
			|	-ЕСТЬNULL(ВЫРАЗИТЬ((УсловияСделокРЕПО2.Сумма + УсловияСделокРЕПО2.СуммаКупона) * _КурсыВалют2Части.Курс КАК ЧИСЛО(19, 2)), 0),
			|	""Вторая часть сделки РЕПО"",
			|	УсловияСделокРЕПО2.ДатаОплаты,
			|	УсловияСделокРЕПО2.ДатаОплаты,
			|	УсловияСделокРЕПО2.Количество,
			|	РАЗНОСТЬДАТ(УсловияСделокРЕПО2.ДатаОплаты, &КонецПериода, ДЕНЬ),
			|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(УсловияСделокРЕПО2.ДатаОплаты, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И ЧастьСделкиРЕПО = 2
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО2
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют2Части
			|		ПО УсловияСделокРЕПО2.СделкаРЕПО.ВалютаСделки = _КурсыВалют2Части.Валюта
			|			И УсловияСделокРЕПО2.ДатаОплаты = _КурсыВалют2Части.Период,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	УсловияСделокРЕПО2.ДатаОплаты МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ УсловияСделокРЕПО2.Отменено
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	УсловияСделокРЕПО1.СделкаРЕПО,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.Дата,
			|	УсловияСделокРЕПО1.ЦеннаяБумага,
			|	УсловияСделокРЕПО1.ОтложенноеИсполнение,
			|	_ОстаткиРЕПО_Начало.Сумма,
			|	_ОстаткиРЕПО_Начало.Сумма,
			|	_ОстаткиРЕПО_Начало.Сумма,
			|	""(входящий остаток)"",
			|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1),
			|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1),
			|	УсловияСделокРЕПО1.Количество,
			|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1), &КонецПериода, ДЕНЬ),
			|	100
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&НачалоПериода,
			|			Организация = &Организация
			|				И ЧастьСделкиРЕПО = 1
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО1
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиРЕПО_Начало КАК _ОстаткиРЕПО_Начало
			|		ПО УсловияСделокРЕПО1.СделкаРЕПО = _ОстаткиРЕПО_Начало.СделкаРЕПО,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	УсловияСделокРЕПО1.ДатаОплаты < &НачалоПериода
			|	И УсловияСделокРЕПО1.ДатаВторойЧастиРЕПО > &НачалоПериода
			|	И НЕ УсловияСделокРЕПО1.Отменено
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	УсловияСделокРЕПО1.СделкаРЕПО,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.Дата,
			|	УсловияСделокРЕПО1.ЦеннаяБумага,
			|	УсловияСделокРЕПО1.ОтложенноеИсполнение,
			|	0,
			|	_ОстаткиРЕПО_Конец.Сумма,
			|	-_ОстаткиРЕПО_Конец.Сумма,
			|	""(исходящий остаток)"",
			|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ),
			|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ),
			|	УсловияСделокРЕПО1.Количество,
			|	0,
			|	0
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И ЧастьСделкиРЕПО = 1
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО1
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиРЕПО_Конец КАК _ОстаткиРЕПО_Конец
			|		ПО УсловияСделокРЕПО1.СделкаРЕПО = _ОстаткиРЕПО_Конец.СделкаРЕПО,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	УсловияСделокРЕПО1.ДатаОплаты < &КонецПериода
			|	И НЕ УсловияСделокРЕПО1.Отменено
			|	И УсловияСделокРЕПО1.ДатаВторойЧастиРЕПО > &КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДатаСделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОбороты.Период КАК Период,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|				ТОГДА 0
			|			ИНАЧЕ ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК Поток,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|			ТОГДА ""Комиссия биржи""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|			ТОГДА ""Комиссия брокера""
			|	КОНЕЦ КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	0 КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК СделкаРЕПО
			|ПОМЕСТИТЬ _Средневзвешенные_СделкиРЕПО_Комиссии
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.СделкаРЕПО)) КАК ЗадолженностиПоДенежнымСредствамОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.Период = &НачалоПериода
			|					ТОГДА ДОБАВИТЬКДАТЕ(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ, -1)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Валюта = _КурсыВалют.Валюта
			|			И (_ДниПериода.Дата = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Средневзвешенные_СделкиРЕПО_Сделки.СделкаРЕПО КАК СделкаРЕПО,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.Актив КАК Актив,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.СредневзвешенныеВложения КАК СредневзвешенныеВложения,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.СправедливаяСтоимость КАК СправедливаяСтоимость,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.Поток КАК Поток,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.Действие КАК Действие,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.Дата КАК Дата,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.Период КАК Период,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.Количество КАК Количество,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.ДнейВРаботе КАК ДнейВРаботе,
			|	_Средневзвешенные_СделкиРЕПО_Сделки.ДнейВРаботе_Процент КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _Средневзвешенные_СделкиРЕПО_Развернуто
			|ИЗ
			|	_Средневзвешенные_СделкиРЕПО_Сделки КАК _Средневзвешенные_СделкиРЕПО_Сделки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.СделкаРЕПО,
			|	_СделкиРЕПО.Актив,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.СредневзвешенныеВложения,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.СправедливаяСтоимость,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.Поток,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.Действие,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.Дата,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.Период,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.Количество,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.ДнейВРаботе,
			|	_Средневзвешенные_СделкиРЕПО_Комиссии.ДнейВРаботе_Процент
			|ИЗ
			|	_Средневзвешенные_СделкиРЕПО_Комиссии КАК _Средневзвешенные_СделкиРЕПО_Комиссии
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_Средневзвешенные_СделкиРЕПО_Сделки.СделкаРЕПО КАК СделкаРЕПО,
			|			_Средневзвешенные_СделкиРЕПО_Сделки.Актив КАК Актив
			|		ИЗ
			|			_Средневзвешенные_СделкиРЕПО_Сделки КАК _Средневзвешенные_СделкиРЕПО_Сделки) КАК _СделкиРЕПО
			|		ПО _Средневзвешенные_СделкиРЕПО_Комиссии.СделкаРЕПО = _СделкиРЕПО.СделкаРЕПО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиРЕПО_Начало
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиРЕПО_Конец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Средневзвешенные_СделкиРЕПО_Сделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Средневзвешенные_СделкиРЕПО_Комиссии";
		
		Запрос.Выполнить();
		
		ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапросаДляРасшифровки, Запрос.МенеджерВременныхТаблиц, "_Средневзвешенные_СделкиРЕПО_Развернуто");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Депозиты
	
	Если ИмяТаблицы = Неопределено 
		Или ИмяТаблицы = "_Средневзвешенные_Депозиты_Развернуто" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетОбороты.Период КАК Период,
			|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт КАК Сумма,
			|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК ДепозитныйВклад
			|ПОМЕСТИТЬ _КомиссииПоДепозитам
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			ДЕНЬ,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы03)),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31322""),
			|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты05),
			|			) КАК ЕдиныйБухгалтерскийУчетОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КомиссииПоДепозитам.ДепозитныйВклад КАК ДепозитныйВклад,
			|	_КомиссииПоДепозитам.Период КАК Период,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА КОНЕЦПЕРИОДА(_КомиссииПоДепозитам.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|				ТОГДА 0
			|			ИНАЧЕ _КомиссииПоДепозитам.Сумма
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2)) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ(_КомиссииПоДепозитам.Сумма КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫРАЗИТЬ(_КомиссииПоДепозитам.Сумма КАК ЧИСЛО(19, 2)) КАК Поток,
			|	""Комиссия биржи"" КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	0 КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_КомиссииПоДепозитам.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_КомиссииПоДепозитам.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _Средневзвешенные_Депозиты_Комиссии
			|ИЗ
			|	_КомиссииПоДепозитам КАК _КомиссииПоДепозитам
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА _КомиссииПоДепозитам.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(_КомиссииПоДепозитам.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(_КомиссииПоДепозитам.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата),
			|	_КоличествоДней КАК _КоличествоДней
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.ДепозитныйВклад КАК ДепозитныйВклад,
			|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК Сумма
			|ПОМЕСТИТЬ _Депозиты_НачалоПериода
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДепозитныйВклад,
			|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&НачалоПериодаСРВЗ,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)
			//|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ДепозитныеВклады)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|				) КАК ЕдиныйБухгалтерскийУчетОстатки
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
			|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&НачалоПериодаСРВЗ,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)
			|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ДепозитныеВклады)) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ДепозитныйВклад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.ДепозитныйВклад КАК ДепозитныйВклад,
			|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК Сумма
			|ПОМЕСТИТЬ _Депозиты_КонецПериода
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДепозитныйВклад,
			|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&КонецПериодаГраница,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)
			|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ДепозитныеВклады)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
			|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&КонецПериодаГраница,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)
			|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ДепозитныеВклады)) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ДепозитныйВклад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Период КАК Период,
			|	ВложенныйЗапрос.ДепозитныйВклад КАК ДепозитныйВклад,
			|	СУММА(ВложенныйЗапрос.Поступление) КАК Поступление,
			|	СУММА(ВложенныйЗапрос.Списание) КАК Списание
			|ПОМЕСТИТЬ _ВводыВыводыДепозитов
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОбороты.Период КАК Период,
			|		ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ДепозитныйВклад,
			|		ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт КАК Поступление,
			|		ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт КАК Списание
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|				&НачалоПериодаСРВЗ,
			|				&КонецПериода,
			|				Регистратор,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)
			|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ДепозитныеВклады),
			|				,
			|				) КАК ЕдиныйБухгалтерскийУчетОбороты
			|	ГДЕ
			|		ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) В (ТИП(Документ.ВводКредитногоИнструмента), ТИП(Документ.ВыводКредитногоИнструмента))
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОбороты.Период,
			|		ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
			|		ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
			|		ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|				&НачалоПериодаСРВЗ,
			|				&КонецПериода,
			|				Регистратор,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)
			|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ДепозитныеВклады),
			|				,
			|				) КАК ЕдиныйБухгалтерскийУчетОбороты
			|	ГДЕ
			|		ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) В (ТИП(Документ.ВводКредитногоИнструмента), ТИП(Документ.ВыводКредитногоИнструмента))) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Период,
			|	ВложенныйЗапрос.ДепозитныйВклад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период КАК Период,
			|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Актив,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА 0
			|			КОГДА КОНЕЦПЕРИОДА(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|				ТОГДА 0
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход <> 0
			|					ИЛИ ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход <> 0
			|				ТОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход - ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА 0
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период = &КонецПериода
			|				ТОГДА 0
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход - ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход >= 0
			|				ТОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход - ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход
			|			ИНАЧЕ -(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход - ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход)
			|		КОНЕЦ * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА 0
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период = &КонецПериода
			|				ТОГДА 0
			|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход <> 0
			|					ИЛИ ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход <> 0
			|				ТОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход - ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход
			|		КОНЕЦ * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК Поток,
			|	ВЫБОР
			|		КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаПриход - ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаРасход >= 0
			|			ТОГДА ""Поступление""
			|		ИНАЧЕ ""Списание""
			|	КОНЕЦ КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	0 КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _Средневзвешенные_Депозиты_Развернуто
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)
			|				И ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО (ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта = _КурсыВалют.Валюта)
			|			И (_ДниПериода.Дата = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	НЕ ТИПЗНАЧЕНИЯ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Регистратор) В (ТИП(Документ.ВводКредитногоИнструмента), ТИП(Документ.ВыводКредитногоИнструмента))
			|
			
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЕдиныйБухгалтерскийУчетОбороты.Период,
			|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0
			|				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2)),
			|	ВЫБОР
			|		КОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0)
			|				И ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт >= 0
			|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
			|		КОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0)
			|				И ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт < 0
			|			ТОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт)
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт <> 0
			|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт <> 0
			|			ТОГДА (ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт > 0
			|			ТОГДА ""Списание резерва""
			|		ИНАЧЕ ""Начисление резерва""
			|	КОНЕЦ,
			|	НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ),
			|	0,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			День,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15)),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления),
			|			,
			|			) КАК ЕдиныйБухгалтерскийУчетОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата),
			|	_КоличествоДней КАК _КоличествоДней
			|

			
			
			
			
			
			
			
			
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	NULL,
			|	ЕСТЬNULL(_СписокДепозитов.ДепозитныйВклад, ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ПриходПроцентовПоКредитномуИнструменту)
			|				ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ПриходПроцентовПоКредитномуИнструменту).КредитныйИнструмент
			|			КОГДА ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ЗакрытиеКредитногоИнструмента)
			|				ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
			|		КОНЕЦ),
			|	-(ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Сумма * РАЗНОСТЬДАТ(ОстаткиДенежныхСредств.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))),
			|	ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Сумма * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)),
			|	-(ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Сумма * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))),
			|	""Проценты по депозиту"",
			|	НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ),
			|	0,
			|	РАЗНОСТЬДАТ(ОстаткиДенежныхСредств.Период, &КонецПериода, ДЕНЬ),
			|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ОстаткиДенежныхСредств.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СписокДепозитов КАК _СписокДепозитов
			|		ПО ОстаткиДенежныхСредств.РасчетныйСчет = _СписокДепозитов.РасчетныйСчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО ОстаткиДенежныхСредств.Валюта = _КурсыВалют.Валюта
			|			И (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	ОстаткиДенежныхСредств.Организация = &Организация
			|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления В
			|			(ВЫБРАТЬ
			|				_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|			ИЗ
			|				_СчетаДоверительногоУправления)
			|	И ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу)
			|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериодаСРВЗ И &КонецПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&НачалоПериода,
			|	_Депозиты_НачалоПериода.ДепозитныйВклад,
			|	_Депозиты_НачалоПериода.Сумма,
			|	_Депозиты_НачалоПериода.Сумма,
			|	_Депозиты_НачалоПериода.Сумма,
			|	""(входящий остаток)"",
			|	&НачалоПериода,
			|	0,
			|	_КоличествоДней.ДнейВПериоде,
			|	100
			|ИЗ
			|	_Депозиты_НачалоПериода КАК _Депозиты_НачалоПериода,
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&КонецПериода,
			|	_Депозиты_КонецПериода.ДепозитныйВклад,
			|	0,
			|	_Депозиты_КонецПериода.Сумма,
			|	-_Депозиты_КонецПериода.Сумма,
			|	""(исходящий остаток)"",
			|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ),
			|	0,
			|	0,
			|	0
			|ИЗ
			|	_Депозиты_КонецПериода КАК _Депозиты_КонецПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ВводыВыводыДепозитов.Период,
			|	_ВводыВыводыДепозитов.ДепозитныйВклад,
			|	ВЫРАЗИТЬ(_ВводыВыводыДепозитов.Поступление * РАЗНОСТЬДАТ(_ВводыВыводыДепозитов.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2)),
			|	_ВводыВыводыДепозитов.Поступление,
			|	_ВводыВыводыДепозитов.Поступление,
			|	""Поступление"",
			|	НАЧАЛОПЕРИОДА(_ВводыВыводыДепозитов.Период, ДЕНЬ),
			|	0,
			|	РАЗНОСТЬДАТ(_ВводыВыводыДепозитов.Период, &КонецПериода, ДЕНЬ),
			|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ВводыВыводыДепозитов.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|ИЗ
			|	_ВводыВыводыДепозитов КАК _ВводыВыводыДепозитов,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	_ВводыВыводыДепозитов.Поступление <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ВводыВыводыДепозитов.Период,
			|	_ВводыВыводыДепозитов.ДепозитныйВклад,
			|	-(ВЫРАЗИТЬ(_ВводыВыводыДепозитов.Списание * РАЗНОСТЬДАТ(_ВводыВыводыДепозитов.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2))),
			|	_ВводыВыводыДепозитов.Списание,
			|	-_ВводыВыводыДепозитов.Списание,
			|	""Списание"",
			|	НАЧАЛОПЕРИОДА(_ВводыВыводыДепозитов.Период, ДЕНЬ),
			|	0,
			|	РАЗНОСТЬДАТ(_ВводыВыводыДепозитов.Период, &КонецПериода, ДЕНЬ),
			|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ВводыВыводыДепозитов.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|ИЗ
			|	_ВводыВыводыДепозитов КАК _ВводыВыводыДепозитов,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	_ВводыВыводыДепозитов.Списание <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_Средневзвешенные_Депозиты_Комиссии.Период,
			|	_Средневзвешенные_Депозиты_Комиссии.ДепозитныйВклад,
			|	_Средневзвешенные_Депозиты_Комиссии.СредневзвешенныеВложения,
			|	_Средневзвешенные_Депозиты_Комиссии.СправедливаяСтоимость,
			|	_Средневзвешенные_Депозиты_Комиссии.Поток,
			|	_Средневзвешенные_Депозиты_Комиссии.Действие,
			|	_Средневзвешенные_Депозиты_Комиссии.Дата,
			|	_Средневзвешенные_Депозиты_Комиссии.Количество,
			|	_Средневзвешенные_Депозиты_Комиссии.ДнейВРаботе,
			|	_Средневзвешенные_Депозиты_Комиссии.ДнейВРаботе_Процент
			|ИЗ
			|	_Средневзвешенные_Депозиты_Комиссии КАК _Средневзвешенные_Депозиты_Комиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Депозиты_НачалоПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Депозиты_КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ВводыВыводыДепозитов";
		
		Запрос.Выполнить();
		
		ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапросаДляРасшифровки, Запрос.МенеджерВременныхТаблиц, "_Средневзвешенные_Депозиты_Развернуто");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Ценные_бумаги
	
	Если ИмяТаблицы = Неопределено 
		Или ИмяТаблицы = "_Средневзвешенные_ЦенныеБумаги_Развернуто" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетОбороты.Период КАК Период,
			|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Сделка,
			|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот КАК СуммаОборот
			|ПОМЕСТИТЬ _КомиссииПокупкиПоАС
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			Регистратор,
			|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты08)),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВЫРАЗИТЬ(Субконто1 КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка),
			|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05)),
			|			) КАК ЕдиныйБухгалтерскийУчетОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Период КАК Период,
			|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Сделка) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
			|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Сделка КАК Документ.ИсполнениеОбязательствПоСделке).Основание
			|		ИНАЧЕ ВложенныйЗапрос.Сделка
			|	КОНЕЦ КАК Сделка,
			|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
			|ПОМЕСТИТЬ _Комиссии
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОборотыРасходы.Период КАК Период,
			|		ОборотыРасходы.СубконтоДт1 КАК ЦеннаяБумага,
			|		ОборотыРасходы.СубконтоДт2 КАК Сделка,
			|		ЕСТЬNULL(ОборотыРасходы.СуммаОборот, 0) КАК Сумма
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
			|				&НачалоПериодаСРВЗ,
			|				&КонецПериода,
			|				Регистратор,
			|				СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация10),
			|				,
			|				СчетКТ В ИЕРАРХИИ (&СчетаДС),
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)) КАК ОборотыРасходы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОбороты.Период,
			|		ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
			|		ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) = ТИП(Документ.Оплата)
			|				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.Партия
			|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.Регистратор
			|		КОНЕЦ,
			|		ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|				&НачалоПериодаСРВЗ,
			|				&КонецПериода,
			|				Регистратор,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций06)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления),
			|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами)),
			|				) КАК ЕдиныйБухгалтерскийУчетОбороты
			|	ГДЕ
			|		ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) = ТИП(Документ.Оплата)
			|					ТОГДА ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.Партия <> НЕОПРЕДЕЛЕНО
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОбороты.Период,
			|		ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
			|		УчетныеАктивыЕПС.Родитель,
			|		ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|				&НачалоПериодаСРВЗ,
			|				&КонецПериода,
			|				Регистратор,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04)),
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления),
			|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами)),
			|				) КАК ЕдиныйБухгалтерскийУчетОбороты
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
			|			ПО ЕдиныйБухгалтерскийУчетОбороты.Субконто1 = УчетныеАктивыЕПС.АналитикаРасходовОтОпераций
			|	ГДЕ
			|		ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Регистратор) = ТИП(Документ.Оплата)
			|		И ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.Партия = НЕОПРЕДЕЛЕНО
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЕдиныйБухгалтерскийУчетОбороты.Период,
			|		ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
			|		ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1,
			|		ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
			|	ИЗ
			|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|				&НачалоПериодаСРВЗ,
			|				&КонецПериода,
			|				Регистратор,
			|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СчетаДоверительногоУправления)
			|					И ВЫРАЗИТЬ(КорСубконто1 КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка),
			|				КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов)) КАК ЕдиныйБухгалтерскийУчетОбороты
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		_КомиссииПокупкиПоАС.Период,
			|		СделкаЦенныеБумаги.ЦеннаяБумага,
			|		_КомиссииПокупкиПоАС.Сделка,
			|		_КомиссииПокупкиПоАС.СуммаОборот
			|	ИЗ
			|		Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КомиссииПокупкиПоАС КАК _КомиссииПокупкиПоАС
			|			ПО СделкаЦенныеБумаги.Ссылка = _КомиссииПокупкиПоАС.Сделка
			|	ГДЕ
			|		СделкаЦенныеБумаги.НомерСтроки = 1) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Период,
			|	ВложенныйЗапрос.ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Сделка) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
			|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Сделка КАК Документ.ИсполнениеОбязательствПоСделке).Основание
			|		ИНАЧЕ ВложенныйЗапрос.Сделка
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Комиссии.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_Комиссии.Период КАК Период,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА КОНЕЦПЕРИОДА(_Комиссии.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|				ТОГДА 0
			|			ИНАЧЕ _Комиссии.Сумма
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2)) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ(_Комиссии.Сумма КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫРАЗИТЬ(_Комиссии.Сумма КАК ЧИСЛО(19, 2)) КАК Поток,
			|	""Комиссии по сделкам"" КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	0 КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_Комиссии.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_Комиссии.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент,
			|	_Комиссии.Сделка КАК Сделка
			|ПОМЕСТИТЬ _Средневзвешенные_Сделки_Комиссии
			|ИЗ
			|	_Комиссии КАК _Комиссии
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА _Комиссии.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(_Комиссии.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(_Комиссии.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата),
			|	_КоличествоДней КАК _КоличествоДней
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделок.Сделка КАК Сделка,
			|	УсловияСделок.ЦеннаяБумага КАК Актив,
			|	ВЫБОР
			|		КОГДА УсловияСделок.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * (ВЫРАЗИТЬ((УсловияСделок.Сумма + УсловияСделок.СуммаКупона) * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))) КАК Поток,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(УсловияСделок.ДатаОплаты, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		КОГДА УсловияСделок.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * (ВЫРАЗИТЬ((УсловияСделок.Сумма + УсловияСделок.СуммаКупона) * РАЗНОСТЬДАТ(УсловияСделок.ДатаОплаты, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))) КАК СредневзвешенныеВложения,
			|	ВЫБОР
			|		КОГДА УсловияСделок.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|			ТОГДА ""Покупка""
			|		ИНАЧЕ ""Продажа""
			|	КОНЕЦ КАК Действие,
			|	НАЧАЛОПЕРИОДА(УсловияСделок.ДатаОплаты, ДЕНЬ) КАК Дата,
			|	УсловияСделок.Количество КАК Количество,
			|	ВЫРАЗИТЬ((УсловияСделок.Сумма + УсловияСделок.СуммаКупона) * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(УсловияСделок.ДатаОплаты, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(УсловияСделок.ДатаОплаты, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(УсловияСделок.ДатаОплаты, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(УсловияСделок.ДатаОплаты, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _Средневзвешенные_Сделки
			|ИЗ
			|	РегистрСведений.УсловияСделок.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК УсловияСделок
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО УсловияСделок.Сделка.ВалютаСделки = _КурсыВалют.Валюта
			|			И УсловияСделок.ДатаОплаты = _КурсыВалют.Период,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	УсловияСделок.ДатаОплаты МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ УсловияСделок.Отменено
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженостиПоЦБиКупонам.Основание) = ТИП(Документ.ПогашениеКупона)
			|			ТОГДА ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеКупона).Облигация
			|		ИНАЧЕ ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
			|	КОНЕЦ КАК ЦеннаяБумага,
			|	ТИПЗНАЧЕНИЯ(ЗадолженостиПоЦБиКупонам.Основание) КАК ТипОснования,
			|	СУММА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(ЗадолженостиПоЦБиКупонам.Основание) = ТИП(Документ.ПогашениеКупона)
			|				ТОГДА ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеКупона).Количество
			|			ИНАЧЕ ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
			|		КОНЕЦ) КАК Количество,
			|	НАЧАЛОПЕРИОДА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(ЗадолженостиПоЦБиКупонам.Основание) = ТИП(Документ.ПогашениеКупона)
			|				ТОГДА ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеКупона).Дата
			|			ИНАЧЕ ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеЦеннойБумаги).Дата
			|		КОНЕЦ, ДЕНЬ) КАК ДатаОснования,
			|	ЗадолженостиПоЦБиКупонам.Валюта КАК Валюта,
			|	ЗадолженостиПоЦБиКупонам.Период КАК Период,
			|	СУММА(ЗадолженостиПоЦБиКупонам.СуммаПриход) КАК СуммаПриход,
			|	СУММА(ЗадолженостиПоЦБиКупонам.СуммаКупонаПриход) КАК СуммаКупонаПриход,
			|	СУММА(ЗадолженостиПоЦБиКупонам.СуммаРасход) КАК СуммаРасход,
			|	СУММА(ЗадолженостиПоЦБиКупонам.СуммаКупонаРасход) КАК СуммаКупонаРасход
			|ПОМЕСТИТЬ _ОборотыПоПогашениямЦБиКупонов
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			ДЕНЬ,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюИпотечногоСертификатаУчастия))) КАК ЗадолженостиПоЦБиКупонам
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженостиПоЦБиКупонам.Валюта,
			|	ЗадолженостиПоЦБиКупонам.Период,
			|	ТИПЗНАЧЕНИЯ(ЗадолженостиПоЦБиКупонам.Основание),
			|	НАЧАЛОПЕРИОДА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(ЗадолженостиПоЦБиКупонам.Основание) = ТИП(Документ.ПогашениеКупона)
			|				ТОГДА ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеКупона).Дата
			|			ИНАЧЕ ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеЦеннойБумаги).Дата
			|		КОНЕЦ, ДЕНЬ),
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженостиПоЦБиКупонам.Основание) = ТИП(Документ.ПогашениеКупона)
			|			ТОГДА ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеКупона).Облигация
			|		ИНАЧЕ ВЫРАЗИТЬ(ЗадолженостиПоЦБиКупонам.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОборотыПоПогашениямЦБиКупонов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	""Погашение купона"" КАК Действие,
			|	_ОборотыПоПогашениямЦБиКупонов.Количество КАК Количество,
			|	_ОборотыПоПогашениямЦБиКупонов.Валюта КАК Валюта,
			|	_ОборотыПоПогашениямЦБиКупонов.Период КАК Период,
			|	_ОборотыПоПогашениямЦБиКупонов.ДатаОснования КАК ДатаОснования,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаКупонаПриход КАК Сумма,
			|	-_ОборотыПоПогашениямЦБиКупонов.СуммаКупонаПриход КАК Поток
			|ПОМЕСТИТЬ _ПотокПоПогашениямЦБиКупонов
			|ИЗ
			|	_ОборотыПоПогашениямЦБиКупонов КАК _ОборотыПоПогашениямЦБиКупонов
			|ГДЕ
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаКупонаПриход <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОборотыПоПогашениямЦБиКупонов.ЦеннаяБумага,
			|	""Погашение номинала"",
			|	_ОборотыПоПогашениямЦБиКупонов.Количество,
			|	_ОборотыПоПогашениямЦБиКупонов.Валюта,
			|	_ОборотыПоПогашениямЦБиКупонов.Период,
			|	_ОборотыПоПогашениямЦБиКупонов.ДатаОснования,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаПриход,
			|	-_ОборотыПоПогашениямЦБиКупонов.СуммаПриход
			|ИЗ
			|	_ОборотыПоПогашениямЦБиКупонов КАК _ОборотыПоПогашениямЦБиКупонов
			|ГДЕ
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаПриход <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОборотыПоПогашениямЦБиКупонов.ЦеннаяБумага,
			|	""Начисление задолженности по погашению купона"",
			|	_ОборотыПоПогашениямЦБиКупонов.Количество,
			|	_ОборотыПоПогашениямЦБиКупонов.Валюта,
			|	_ОборотыПоПогашениямЦБиКупонов.Период,
			|	_ОборотыПоПогашениямЦБиКупонов.ДатаОснования,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаКупонаПриход,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаКупонаПриход
			|ИЗ
			|	_ОборотыПоПогашениямЦБиКупонов КАК _ОборотыПоПогашениямЦБиКупонов
			|ГДЕ
			|	&ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
			|	И _ОборотыПоПогашениямЦБиКупонов.СуммаКупонаПриход <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОборотыПоПогашениямЦБиКупонов.ЦеннаяБумага,
			|	""Начисление задолженности по погашению номинала"",
			|	_ОборотыПоПогашениямЦБиКупонов.Количество,
			|	_ОборотыПоПогашениямЦБиКупонов.Валюта,
			|	_ОборотыПоПогашениямЦБиКупонов.Период,
			|	_ОборотыПоПогашениямЦБиКупонов.ДатаОснования,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаПриход,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаПриход
			|ИЗ
			|	_ОборотыПоПогашениямЦБиКупонов КАК _ОборотыПоПогашениямЦБиКупонов
			|ГДЕ
			|	&ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
			|	И _ОборотыПоПогашениямЦБиКупонов.СуммаПриход <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОборотыПоПогашениямЦБиКупонов.ЦеннаяБумага,
			|	""Списание задолженности по погашению купона"",
			|	_ОборотыПоПогашениямЦБиКупонов.Количество,
			|	_ОборотыПоПогашениямЦБиКупонов.Валюта,
			|	_ОборотыПоПогашениямЦБиКупонов.Период,
			|	_ОборотыПоПогашениямЦБиКупонов.ДатаОснования,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаКупонаРасход,
			|	-_ОборотыПоПогашениямЦБиКупонов.СуммаКупонаРасход
			|ИЗ
			|	_ОборотыПоПогашениямЦБиКупонов КАК _ОборотыПоПогашениямЦБиКупонов
			|ГДЕ
			|	&ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
			|	И _ОборотыПоПогашениямЦБиКупонов.СуммаКупонаРасход <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОборотыПоПогашениямЦБиКупонов.ЦеннаяБумага,
			|	""Списание задолженности по погашению номинала"",
			|	_ОборотыПоПогашениямЦБиКупонов.Количество,
			|	_ОборотыПоПогашениямЦБиКупонов.Валюта,
			|	_ОборотыПоПогашениямЦБиКупонов.Период,
			|	_ОборотыПоПогашениямЦБиКупонов.ДатаОснования,
			|	_ОборотыПоПогашениямЦБиКупонов.СуммаРасход,
			|	-_ОборотыПоПогашениямЦБиКупонов.СуммаРасход
			|ИЗ
			|	_ОборотыПоПогашениямЦБиКупонов КАК _ОборотыПоПогашениямЦБиКупонов
			|ГДЕ
			|	&ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
			|	И _ОборотыПоПогашениямЦБиКупонов.СуммаРасход <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.НачислениеДивидендов).ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности КАК ВидЗадолженности,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль)
			|				И ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
			|			ТОГДА ""Налог по дивидендам""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
			|			ТОГДА ""Погашение задолженности""
			|		ИНАЧЕ ""Дивиденды""
			|	КОНЕЦ КАК Действие,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК СуммаПриход,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК СуммаРасход,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта КАК Валюта,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Период КАК Период,
			|	СУММА(ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.НачислениеДивидендов).Количество) КАК Количество
			|ПОМЕСТИТЬ _ОборотыПоДивидендам
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			Регистратор,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И (ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|						И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
			|					ИЛИ ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНаЛогуНаПрибыль))
			|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.НачислениеДивидендов)) КАК ЗадолженностиПоДенежнымСредствамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.НачислениеДивидендов).ЦеннаяБумага,
			|	ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности,
			|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Период,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль)
			|				И ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
			|			ТОГДА ""Налог по дивидендам""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
			|			ТОГДА ""Погашение задолженности""
			|		ИНАЧЕ ""Дивиденды""
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОборотыПоДивидендам.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ОборотыПоДивидендам.Действие КАК Действие,
			|	_ОборотыПоДивидендам.СуммаПриход КАК Сумма,
			|	-_ОборотыПоДивидендам.СуммаПриход КАК Поток,
			|	_ОборотыПоДивидендам.Валюта КАК Валюта,
			|	_ОборотыПоДивидендам.Период КАК Период,
			|	_ОборотыПоДивидендам.Количество КАК Количество
			|ПОМЕСТИТЬ _ПотокПоДивидендам
			|ИЗ
			|	_ОборотыПоДивидендам КАК _ОборотыПоДивидендам
			|ГДЕ
			|	_ОборотыПоДивидендам.Действие = ""Дивиденды""
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОборотыПоДивидендам.ЦеннаяБумага,
			|	""Корректировка дивидендов на сумму налога"",
			|	_ОборотыПоДивидендам.СуммаРасход,
			|	_ОборотыПоДивидендам.СуммаРасход,
			|	_ОборотыПоДивидендам.Валюта,
			|	_ОборотыПоДивидендам.Период,
			|	_ОборотыПоДивидендам.Количество
			|ИЗ
			|	_ОборотыПоДивидендам КАК _ОборотыПоДивидендам
			|ГДЕ
			|	&ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
			|	И _ОборотыПоДивидендам.Действие = ""Налог по дивидендам""
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОборотыПоДивидендам.ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА _ОборотыПоДивидендам.Действие = ""Дивиденды""
			|			ТОГДА ""Начисление задолженности по дивидендам""
			|		ИНАЧЕ _ОборотыПоДивидендам.Действие
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА _ОборотыПоДивидендам.Действие = ""Дивиденды""
			|			ТОГДА _ОборотыПоДивидендам.СуммаПриход
			|		ИНАЧЕ _ОборотыПоДивидендам.СуммаРасход
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА _ОборотыПоДивидендам.Действие = ""Дивиденды""
			|			ТОГДА _ОборотыПоДивидендам.СуммаПриход
			|		ИНАЧЕ -_ОборотыПоДивидендам.СуммаРасход
			|	КОНЕЦ,
			|	_ОборотыПоДивидендам.Валюта,
			|	_ОборотыПоДивидендам.Период,
			|	_ОборотыПоДивидендам.Количество
			|ИЗ
			|	_ОборотыПоДивидендам КАК _ОборотыПоДивидендам
			|ГДЕ
			|	&ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагОстаткиИОбороты.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПС,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
			|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
			|		ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.Регистратор
			|	КОНЕЦ КАК Сделка,
			|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК Актив,
			|	МАКСИМУМ(БухПартииЦенныхБумагОстаткиИОбороты.Период) КАК Период
			|ПОМЕСТИТЬ _УчетныеАктивыЕПСПоСделкамДляСРЗВ
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Регистратор,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстаткиИОбороты
			|ГДЕ
			|	(БухПартииЦенныхБумагОстаткиИОбороты.КоличествоРасход > 0
			|			ИЛИ БухПартииЦенныхБумагОстаткиИОбороты.КоличествоПриход > 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииЦенныхБумагОстаткиИОбороты.УчетныйАктивЕПС.Родитель,
			|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
			|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
			|		ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.Регистратор
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Средневзвешенные_Сделки.Актив КАК Актив,
			|	_Средневзвешенные_Сделки.Поток КАК Поток,
			|	_Средневзвешенные_Сделки.СредневзвешенныеВложения КАК СредневзвешенныеВложения,
			|	_Средневзвешенные_Сделки.Действие КАК Действие,
			|	_Средневзвешенные_Сделки.Дата КАК Дата,
			|	_Средневзвешенные_Сделки.Дата КАК Период,
			|	_Средневзвешенные_Сделки.Количество КАК Количество,
			|	_Средневзвешенные_Сделки.СправедливаяСтоимость КАК СправедливаяСтоимость,
			|	_Средневзвешенные_Сделки.ДнейВРаботе КАК ДнейВРаботе,
			|	_Средневзвешенные_Сделки.ДнейВРаботе_Процент КАК ДнейВРаботе_Процент,
			|	_УчетныеАктивыЕПСПоСделкамДляСРЗВ.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	0 КАК СуммыПоКупону
			|ПОМЕСТИТЬ _Средневзвешенные_ЦенныеБумаги_Развернуто
			|ИЗ
			|	_Средневзвешенные_Сделки КАК _Средневзвешенные_Сделки
			|		ЛЕВОЕ СОЕДИНЕНИЕ _УчетныеАктивыЕПСПоСделкамДляСРЗВ КАК _УчетныеАктивыЕПСПоСделкамДляСРЗВ
			|		ПО _Средневзвешенные_Сделки.Сделка = _УчетныеАктивыЕПСПоСделкамДляСРЗВ.Сделка
			|			И _Средневзвешенные_Сделки.Актив = _УчетныеАктивыЕПСПоСделкамДляСРЗВ.Актив
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага,
			|	ВЫРАЗИТЬ(_ДанныеПогашенийЦБиКупонов.Поток * _КурсыВалют.Курс * БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток / _ДанныеПогашенийЦБиКупонов.Количество КАК ЧИСЛО(19, 2)),
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ДанныеПогашенийЦБиКупонов.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(_ДанныеПогашенийЦБиКупонов.Поток * РАЗНОСТЬДАТ(_ДанныеПогашенийЦБиКупонов.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс * БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток / _ДанныеПогашенийЦБиКупонов.Количество КАК ЧИСЛО(19, 2))
			|	КОНЕЦ,
			|	_ДанныеПогашенийЦБиКупонов.Действие,
			|	_ДанныеПогашенийЦБиКупонов.Период,
			|	_ДанныеПогашенийЦБиКупонов.Период,
			|	_ДанныеПогашенийЦБиКупонов.Количество,
			|	ВЫРАЗИТЬ(_ДанныеПогашенийЦБиКупонов.Сумма * БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток / _ДанныеПогашенийЦБиКупонов.Количество КАК ЧИСЛО(19, 2)),
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ДанныеПогашенийЦБиКупонов.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДанныеПогашенийЦБиКупонов.Период, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ДанныеПогашенийЦБиКупонов.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДанныеПогашенийЦБиКупонов.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ,
			|	БухПартииЦенныхБумагОстаткиИОбороты.УчетныйАктивЕПС.Родитель,
			|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаПриход + БухПартииЦенныхБумагОстаткиИОбороты.ЗадолженностьПоПогашениюКупонаПриход + БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаПриход + БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйПриход
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			ДЕНЬ,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстаткиИОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПотокПоПогашениямЦБиКупонов КАК _ДанныеПогашенийЦБиКупонов
			|		ПО БухПартииЦенныхБумагОстаткиИОбороты.Период = _ДанныеПогашенийЦБиКупонов.ДатаОснования
			|			И БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага = _ДанныеПогашенийЦБиКупонов.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО (_ДанныеПогашенийЦБиКупонов.Валюта = _КурсыВалют.Валюта)
			|			И (НАЧАЛОПЕРИОДА(_ДанныеПогашенийЦБиКупонов.Период, ДЕНЬ) = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага,
			|	-БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеОборот - БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеКупонаОборот,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ДанныеПогашенийЦБиКупонов.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ((-БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеОборот - БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеКупонаОборот) * РАЗНОСТЬДАТ(БухПартииЦенныхБумагОстаткиИОбороты.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2))
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеПриход + БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеКупонаПриход - (БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеРасход + БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеКупонаРасход) > 0
			|			ТОГДА ""Начисление резерва""
			|		ИНАЧЕ ""Списание резерва""
			|	КОНЕЦ,
			|	БухПартииЦенныхБумагОстаткиИОбороты.Период,
			|	БухПартииЦенныхБумагОстаткиИОбороты.Период,
			|	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток,
			|	ВЫРАЗИТЬ(-БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеОборот - БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеКупонаОборот КАК ЧИСЛО(19, 2)),
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(БухПартииЦенныхБумагОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(БухПартииЦенныхБумагОстаткиИОбороты.Период, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(БухПартииЦенныхБумагОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(БухПартииЦенныхБумагОстаткиИОбороты.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ,
			|	БухПартииЦенныхБумагОстаткиИОбороты.УчетныйАктивЕПС.Родитель,
			|	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаПриход + БухПартииЦенныхБумагОстаткиИОбороты.ЗадолженностьПоПогашениюКупонаПриход + БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаПриход + БухПартииЦенныхБумагОстаткиИОбороты.ДисконтПремияНачисленныйПриход
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			ДЕНЬ,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ПотокПоПогашениямЦБиКупонов КАК _ДанныеПогашенийЦБиКупонов
			|		ПО БухПартииЦенныхБумагОстаткиИОбороты.Период = _ДанныеПогашенийЦБиКупонов.ДатаОснования
			|			И БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага = _ДанныеПогашенийЦБиКупонов.ЦеннаяБумага,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	_ДанныеПогашенийЦБиКупонов.ЦеннаяБумага ЕСТЬ NULL
			|	И БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеОборот + БухПартииЦенныхБумагОстаткиИОбороты.СуммаРезервовПодОбесценениеКупонаОборот <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ПотокПоДивидендам.ЦеннаяБумага,
			|	ВЫРАЗИТЬ(_ПотокПоДивидендам.Поток * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)),
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ПотокПоДивидендам.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(_ПотокПоДивидендам.Поток * РАЗНОСТЬДАТ(_ПотокПоДивидендам.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))
			|	КОНЕЦ,
			|	_ПотокПоДивидендам.Действие,
			|	НАЧАЛОПЕРИОДА(_ПотокПоДивидендам.Период, ДЕНЬ),
			|	_ПотокПоДивидендам.Период,
			|	_ПотокПоДивидендам.Количество,
			|	ВЫРАЗИТЬ(_ПотокПоДивидендам.Сумма * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)),
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ПотокПоДивидендам.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ПотокПоДивидендам.Период, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(_ПотокПоДивидендам.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ПотокПоДивидендам.Период, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ,
			|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолевыеПоСправедливой),
			|	0
			|ИЗ
			|	_ПотокПоДивидендам КАК _ПотокПоДивидендам
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО _ПотокПоДивидендам.Валюта = _КурсыВалют.Валюта
			|			И (НАЧАЛОПЕРИОДА(_ПотокПоДивидендам.Период, ДЕНЬ) = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага,
			|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток + БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток - БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток,
			|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток + БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток - БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток,
			|	""(входящий остаток)"",
			|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1), ДЕНЬ),
			|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1), ДЕНЬ),
			|	БухПартииЦенныхБумагОстатки.КоличествоОстаток,
			|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток + БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток - БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток,
			|	_КоличествоДней.ДнейВПериоде,
			|	100,
			|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель,
			|	0
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&НачалоПериодаСРВЗ,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки,
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага,
			|	-(БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток + БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток - БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток),
			|	0,
			|	""(исходящий остаток)"",
			|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ),
			|	&КонецПериода,
			|	БухПартииЦенныхБумагОстатки.КоличествоОстаток,
			|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток + БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток - БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток,
			|	0,
			|	0,
			|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель,
			|	0
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&КонецПериодаГраница,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки,
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОбороты.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
			|			ТОГДА БухПартииЦенныхБумагОбороты.СтоимостьВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ИндексацияНоминалаПриход + БухПартииЦенныхБумагОбороты.СтоимостьКупонаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ПереоценкаКупонаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.КорректировкаЭСПВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПриход - БухПартииЦенныхБумагОбороты.СуммаРезервовПодОбесценениеПриход
			|		ИНАЧЕ -(БухПартииЦенныхБумагОбороты.СтоимостьВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ИндексацияНоминалаРасход + БухПартииЦенныхБумагОбороты.СтоимостьКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.КорректировкаЭСПВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаРасход - БухПартииЦенныхБумагОбороты.СуммаРезервовПодОбесценениеРасход)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
			|					КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОбороты.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
			|						ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.СтоимостьВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ИндексацияНоминалаПриход + БухПартииЦенныхБумагОбороты.СтоимостьКупонаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ПереоценкаКупонаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.КорректировкаЭСПВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПриход - БухПартииЦенныхБумагОбороты.СуммаРезервовПодОбесценениеПриход КАК ЧИСЛО(19, 2))
			|					ИНАЧЕ ВЫРАЗИТЬ(-(БухПартииЦенныхБумагОбороты.СтоимостьВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ИндексацияНоминалаРасход + БухПартииЦенныхБумагОбороты.СтоимостьКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.КорректировкаЭСПВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаРасход - БухПартииЦенныхБумагОбороты.СуммаРезервовПодОбесценениеРасход) КАК ЧИСЛО(19, 2))
			|				КОНЕЦ * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ), &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде КАК ЧИСЛО(19, 2))
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОбороты.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
			|			ТОГДА ""Ввод ценных бумаг в ДУ""
			|		ИНАЧЕ ""Вывод ценных бумаг из ДУ""
			|	КОНЕЦ,
			|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ),
			|	БухПартииЦенныхБумагОбороты.Период,
			|	БухПартииЦенныхБумагОбороты.КоличествоПриход - БухПартииЦенныхБумагОбороты.КоличествоРасход,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОбороты.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
			|			ТОГДА БухПартииЦенныхБумагОбороты.СтоимостьВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ИндексацияНоминалаПриход + БухПартииЦенныхБумагОбороты.СтоимостьКупонаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ПереоценкаКупонаВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.КорректировкаЭСПВВалютеУчетаПриход + БухПартииЦенныхБумагОбороты.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПриход - БухПартииЦенныхБумагОбороты.СуммаРезервовПодОбесценениеПриход
			|		ИНАЧЕ БухПартииЦенныхБумагОбороты.СтоимостьВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ИндексацияНоминалаРасход + БухПартииЦенныхБумагОбороты.СтоимостьКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.КорректировкаЭСПВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаРасход - БухПартииЦенныхБумагОбороты.СуммаРезервовПодОбесценениеРасход
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ), &КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ), &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ,
			|	БухПартииЦенныхБумагОбороты.УчетныйАктивЕПС.Родитель,
			|	0
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			Регистратор,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОбороты,
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОбороты.Регистратор) В (ТИП(Документ.ВводЦенныхБумаг), ТИП(Документ.ВыводЦенныхБумаг))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_Средневзвешенные_Сделки_Комиссии.ЦеннаяБумага,
			|	_Средневзвешенные_Сделки_Комиссии.Поток,
			|	_Средневзвешенные_Сделки_Комиссии.СредневзвешенныеВложения,
			|	_Средневзвешенные_Сделки_Комиссии.Действие,
			|	_Средневзвешенные_Сделки_Комиссии.Дата,
			|	_Средневзвешенные_Сделки_Комиссии.Период,
			|	_Средневзвешенные_Сделки_Комиссии.Количество,
			|	_Средневзвешенные_Сделки_Комиссии.СправедливаяСтоимость,
			|	_Средневзвешенные_Сделки_Комиссии.ДнейВРаботе,
			|	_Средневзвешенные_Сделки_Комиссии.ДнейВРаботе_Процент,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_Средневзвешенные_Сделки_Комиссии.Сделка) = ТИП(Справочник.УчетныеАктивыЕПС)
			|			ТОГДА _Средневзвешенные_Сделки_Комиссии.Сделка
			|		ИНАЧЕ _УчетныеАктивыЕПСПоСделкамДляСРЗВ.УчетныйАктивЕПС
			|	КОНЕЦ,
			|	0
			|ИЗ
			|	_Средневзвешенные_Сделки_Комиссии КАК _Средневзвешенные_Сделки_Комиссии
			|		ЛЕВОЕ СОЕДИНЕНИЕ _УчетныеАктивыЕПСПоСделкамДляСРЗВ КАК _УчетныеАктивыЕПСПоСделкамДляСРЗВ
			|		ПО _Средневзвешенные_Сделки_Комиссии.Сделка = _УчетныеАктивыЕПСПоСделкамДляСРЗВ.Сделка
			|			И _Средневзвешенные_Сделки_Комиссии.ЦеннаяБумага = _УчетныеАктивыЕПСПоСделкамДляСРЗВ.Актив
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _КомиссииПокупкиПоАС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Комиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Средневзвешенные_Сделки_Комиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Средневзвешенные_Сделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _УчетныеАктивыЕПСПоСделкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОборотыПоПогашениямЦБиКупонов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПотокПоПогашениямЦБиКупонов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОборотыПоДивидендам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПотокПоДивидендам";		
		
		Запрос.Выполнить();
		
		ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапросаДляРасшифровки, Запрос.МенеджерВременныхТаблиц, "_Средневзвешенные_ЦенныеБумаги_Развернуто");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Задолженность
	
	Если ИмяТаблицы = Неопределено 
		Или ИмяТаблицы = "_Средневзвешенные_Задолженность_Развернуто" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период КАК Период,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности
			|	КОНЕЦ КАК ТипЗадолженности,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|			ТОГДА ""Комиссии по сделкам""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария))
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности
			|	КОНЕЦ КАК Актив,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Контрагент КАК Контрагент,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * (ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток
			|			КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|				ТОГДА 0
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход <> 0
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход <> 0
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &КонецПериода
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход <> 0
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход <> 0
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход
			|		КОНЕЦ * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * (ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &КонецПериода
			|				ТОГДА -ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход <> 0
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход <> 0
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход
			|		КОНЕЦ * _КурсыВалют.Курс КАК ЧИСЛО(19, 2))) КАК Поток,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|			ТОГДА ""(входящий остаток)""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &КонецПериода
			|			ТОГДА ""(исходящий остаток)""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход >= 0
			|			ТОГДА ""Начисление""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход < 0
			|			ТОГДА ""Оплата""
			|	КОНЕЦ КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	0 КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _Средневзвешенные_Задолженность_Развернуто
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И НЕ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
			|				И ВЫБОР
			|					КОГДА &ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ
			|						ТОГДА НЕ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
			|					ИНАЧЕ ИСТИНА
			|				КОНЕЦ) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта = _КурсыВалют.Валюта
			|			И (_ДниПериода.Дата = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Период";
		
		Запрос.Выполнить();
		
		ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапросаДляРасшифровки, Запрос.МенеджерВременныхТаблиц, "_Средневзвешенные_Задолженность_Развернуто");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Дебиторская_задолженность_по_ЦБ
	
	Если ИмяТаблицы = Неопределено 
		Или ИмяТаблицы = "_Средневзвешенные_ДЗпоНКД_Развернуто" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Основание,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание) = ТИП(Документ.ПогашениеКупона)
			|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.ПогашениеКупона).Облигация
			|		ИНАЧЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
			|	КОНЕЦ КАК Актив,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаПриход + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход КАК Сумма,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаНачальныйОстаток
			|			КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|				ТОГДА 0
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход <> 0
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход <> 0
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход
			|		КОНЕЦ * РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СредневзвешенныеВложения,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаНачальныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &КонецПериода
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаКонечныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход <> 0
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход <> 0
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход
			|		КОНЕЦ * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК СправедливаяСтоимость,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаНачальныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &КонецПериода
			|				ТОГДА -ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаКонечныйОстаток
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход <> 0
			|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход <> 0
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход
			|		КОНЕЦ * _КурсыВалют.Курс КАК ЧИСЛО(19, 2)) КАК Поток,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|			ТОГДА ""(входящий остаток)""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &КонецПериода
			|			ТОГДА ""(исходящий остаток)""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход - ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход >= 0
			|			ТОГДА ""Начисление""
			|		ИНАЧЕ ""Списание""
			|	КОНЕЦ КАК Действие,
			|	_ДниПериода.Дата КАК Дата,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период КАК Период,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание) = ТИП(Документ.ПогашениеКупона)
			|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.ПогашениеКупона).Количество
			|		ИНАЧЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
			|	КОНЕЦ КАК Количество,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДнейВРаботе,
			|	ВЫБОР
			|		КОГДА КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(_ДниПериода.Дата, &КонецПериода, ДЕНЬ) / _КоличествоДней.ДнейВПериоде * 100 КАК ЧИСЛО(15, 0))
			|	КОНЕЦ КАК ДнейВРаботе_Процент
			|ПОМЕСТИТЬ _Средневзвешенные_ДЗпоНКД_Развернуто
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
			|			&НачалоПериодаСРВЗ,
			|			&КонецПериода,
			|			Регистратор,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_СчетаДоверительногоУправления)
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниПериода КАК _ДниПериода
			|		ПО (ВЫБОР
			|				КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период В (&НачалоПериода, &НачалоПериодаСРВЗ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ, -1), ДЕНЬ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = _ДниПериода.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
			|		ПО ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта = _КурсыВалют.Валюта
			|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период, ДЕНЬ) = _КурсыВалют.Период),
			|	_КоличествоДней КАК _КоличествоДней
			|ГДЕ
			|	НЕ &ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ";
	
		Запрос.Выполнить();
		
		ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапросаДляРасшифровки, Запрос.МенеджерВременныхТаблиц, "_Средневзвешенные_ДЗпоНКД_Развернуто");
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапроса, МенеджерВременныхТаблиц, ИмяВременнойТаблицы)

	Если СоответствиеРезультатовЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СоответствиеРезультатовЗапроса.Вставить(ИмяВременнойТаблицы, МенеджерВременныхТаблиц.Таблицы[ИмяВременнойТаблицы].ПолучитьДанные());
	
КонецПроцедуры

Процедура ПолучитьДоходыИРасходыЗаПериод(Запрос, АдресВХранилищеСДаннымиДляРасшифровки = "")
	
#Область Текст_запроса

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Раздел КАК Раздел,
		|	ВложенныйЗапрос.Аналитика КАК Аналитика,
		|	ВложенныйЗапрос.ГФУ КАК ГФУ
		|ПОМЕСТИТЬ _ГФУ_Резервы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48201"", ""48202"", ""38201"", ""38202"")
		|				ТОГДА 1
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48301"", ""48302"", ""38301"", ""38302"")
		|				ТОГДА 1
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48501"", ""48502"", ""48503"", ""48504"", ""48505"", ""48506"", ""48507"", ""38501"", ""38502"", ""38503"", ""38504"", ""38505"", ""38506"", ""38507"")
		|				ТОГДА 1
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48601"", ""48602"", ""48603"", ""48604"", ""48605"", ""48606"", ""48607"", ""38601"", ""38602"", ""38603"", ""38604"", ""38605"", ""38606"", ""38607"", ""48901"", ""48902"", ""48903"", ""48904"", ""48905"", ""48906"", ""48907"", ""38901"", ""38902"", ""38903"", ""38904"", ""38905"", ""38906"", ""38907"")
		|				ТОГДА 1
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48401"", ""48402"", ""48403"", ""48404"", ""48405"", ""48406"", ""48407"", ""38401"", ""38402"", ""38403"", ""38404"", ""38405"", ""38406"", ""38407"", ""48701"", ""48702"", ""48703"", ""48704"", ""48705"", ""48706"", ""48707"", ""38701"", ""38702"", ""38703"", ""38704"", ""38705"", ""38706"", ""38707"")
		|				ТОГДА 1
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48110"", ""38110"", ""48114"", ""38114"")
		|				ТОГДА 1
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""53304"", ""52204"")
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Раздел,
		|		ВЫБОР
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48201"", ""48202"", ""38201"", ""38202"")
		|				ТОГДА ""По денежным средствам на счетах""
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48301"", ""48302"", ""38301"", ""38302"")
		|				ТОГДА ""По депозитам, размещенным""
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48501"", ""48502"", ""48503"", ""48504"", ""48505"", ""48506"", ""48507"", ""38501"", ""38502"", ""38503"", ""38504"", ""38505"", ""38506"", ""38507"")
		|				ТОГДА ""По вложениям в долговые ценные бумаги, удерживаемые до погашения (кроме векселей)""
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48601"", ""48602"", ""48603"", ""48604"", ""48605"", ""48606"", ""48607"", ""38601"", ""38602"", ""38603"", ""38604"", ""38605"", ""38606"", ""38607"", ""48901"", ""48902"", ""48903"", ""48904"", ""48905"", ""48906"", ""48907"", ""38901"", ""38902"", ""38903"", ""38904"", ""38905"", ""38906"", ""38907"")
		|				ТОГДА ""По вложениям в долговые ценные бумаги (кроме векселей), оцениваемые по амортизированной стоимости""
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48401"", ""48402"", ""48403"", ""48404"", ""48405"", ""48406"", ""48407"", ""38401"", ""38402"", ""38403"", ""38404"", ""38405"", ""38406"", ""38407"", ""48701"", ""48702"", ""48703"", ""48704"", ""48705"", ""48706"", ""48707"", ""38701"", ""38702"", ""38703"", ""38704"", ""38705"", ""38706"", ""38707"")
		|				ТОГДА ""По вложениям в долговые ценные бумаги Долговые ценные бумаги, оцениваемые по справедливой стоимости через прочий совокупный доход""
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""48110"", ""38110"", ""48114"", ""38114"")
		|				ТОГДА ""По сделкам РЕПО""
		|			КОГДА ГруппыФинансовогоУчетаДоходовРасходов.Код В (""53304"", ""52204"")
		|				ТОГДА ""По прочим активам, не приносящим процентный доход""
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК Аналитика,
		|		ГруппыФинансовогоУчетаДоходовРасходов.Ссылка КАК ГФУ
		|	ИЗ
		|		Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|	ГДЕ
		|		НЕ ГруппыФинансовогоУчетаДоходовРасходов.ЭтоГруппа) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Раздел <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор КАК Регистратор,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт КАК ИтогоДоходы,
		|	ЕдиныйБухгалтерскийУчетОбороты.ЛицевойСчет.ГруппаФинансовогоУчетаДоходовРасходов КАК ГФУ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет
		|ПОМЕСТИТЬ _ОборотыДоходыОтКупоновПриОферте
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций03),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт КАК ИтогоРасходы,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт КАК ИтогоДоходы,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор КАК Регистратор,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет,
		|	ГФУ.Ссылка КАК ГФУ
		|ПОМЕСТИТЬ _ОборотыДоходыОтПогашения
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация10),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела),
		|			КорСчет В ИЕРАРХИИ (&СчетаЦБ),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГФУ
		|		ПО (ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток))
		|					ТОГДА ГФУ.Код = ""33101""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи))
		|					ТОГДА ГФУ.Код = ""33301""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД))
		|					ТОГДА ГФУ.Код = ""33501""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения))
		|					ТОГДА ГФУ.Код = ""33401""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеПоСправедливой))
		|					ТОГДА ГФУ.Код = ""34101""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеДляПродажи))
		|					ТОГДА ГФУ.Код = ""34905""
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт КАК ИтогоДоходы,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор КАК Регистратор,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет
		|ПОМЕСТИТЬ _ОборотыДоходы
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация10),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот) КАК ИтогоРасходы,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ЦеннаяБумага,
		|	ГФУ.Ссылка КАК Аналитика,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ОборотыСтоимостьАктивов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация10),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКор.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела),
		|			КорСчет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги)) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГФУ
		|		ПО (ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток))
		|					ТОГДА ГФУ.Код = ""33101""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи))
		|					ТОГДА ГФУ.Код = ""33301""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД))
		|					ТОГДА ГФУ.Код = ""33501""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения))
		|					ТОГДА ГФУ.Код = ""33401""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеПоСправедливой))
		|					ТОГДА ГФУ.Код = ""34101""
		|				КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеДляПродажи))
		|					ТОГДА ГФУ.Код = ""34905""
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ГФУ.Ссылка,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОборотыСтоимостьАктивов.ИтогоРасходы КАК ИтогоРасходы,
		|	_ОборотыСтоимостьАктивов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОборотыСтоимостьАктивов.Аналитика КАК Аналитика,
		|	_ОборотыСтоимостьАктивов.Регистратор КАК Регистратор,
		|	_ОборотыДоходы.ИтогоДоходы КАК ИтогоДоходы
		|ПОМЕСТИТЬ _ДоходИСтоимостьЦБ
		|ИЗ
		|	_ОборотыСтоимостьАктивов КАК _ОборотыСтоимостьАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОборотыДоходы КАК _ОборотыДоходы
		|		ПО _ОборотыСтоимостьАктивов.Регистратор = _ОборотыДоходы.Регистратор
		|			И _ОборотыСтоимостьАктивов.ЦеннаяБумага = _ОборотыДоходы.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДоходыОтПродажи"" КАК РазделОтчета,
		|	_ДоходИСтоимостьЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	-_ДоходИСтоимостьЦБ.ИтогоРасходы КАК ИтогоРасходы,
		|	_ДоходИСтоимостьЦБ.ИтогоДоходы КАК ИтогоДоходы,
		|	_ДоходИСтоимостьЦБ.Аналитика КАК Аналитика,
		|	_ДоходИСтоимостьЦБ.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ПродажаАктивов
		|ИЗ
		|	_ДоходИСтоимостьЦБ КАК _ДоходИСтоимостьЦБ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходыОтПродажи"",
		|	_ОборотыДоходыОтКупоновПриОферте.ЦеннаяБумага,
		|	0,
		|	_ОборотыДоходыОтКупоновПриОферте.ИтогоДоходы,
		|	_ОборотыДоходыОтКупоновПриОферте.ГФУ,
		|	_ОборотыДоходыОтКупоновПриОферте.Регистратор
		|ИЗ
		|	_ОборотыДоходыОтКупоновПриОферте КАК _ОборотыДоходыОтКупоновПриОферте
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходыОтПродажи"",
		|	_ОборотыДоходыОтПогашения.ЦеннаяБумага,
		|	-_ОборотыДоходыОтПогашения.ИтогоРасходы,
		|	_ОборотыДоходыОтПогашения.ИтогоДоходы,
		|	_ОборотыДоходыОтПогашения.ГФУ,
		|	_ОборотыДоходыОтПогашения.Регистратор
		|ИЗ
		|	_ОборотыДоходыОтПогашения КАК _ОборотыДоходыОтПогашения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходыОтПродажи"",
		|	ОборотыРасходы.СубконтоДт1,
		|	-ЕСТЬNULL(ОборотыРасходы.СуммаОборот, 0),
		|	0,
		|	ВЫБОР
		|		КОГДА ОборотыРасходы.ЛицевойСчетДт.ГруппаФинансовогоУчетаДоходовРасходов = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.)
		|			ТОГДА ОборотыРасходы.СубконтоДт2
		|		ИНАЧЕ ОборотыРасходы.ЛицевойСчетДт.ГруппаФинансовогоУчетаДоходовРасходов
		|	КОНЕЦ,
		|	ОборотыРасходы.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация10),
		|			,
		|			СчетКТ В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ОборотыРасходы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКор.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок)),
		|			КорСчет В ИЕРАРХИИ (&СчетаЦБ),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК СчетУчетаПереоценки
		|ПОМЕСТИТЬ _СчетаПереоценки
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	НЕ УчетныеАктивыЕПС.СчетУчетаПереоценкиА В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроизводныеФинансовыеИнструменты))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	НЕ УчетныеАктивыЕПС.СчетУчетаПереоценкиП В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроизводныеФинансовыеИнструменты))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК СчетУчетаПереоценки
		|ПОМЕСТИТЬ _СчетаПереоценкиСПФИ
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроизводныеФинансовыеИнструменты))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроизводныеФинансовыеИнструменты))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокА КАК СчетУчетаКорректировок
		|ПОМЕСТИТЬ _СчетаКорректировок
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.АналитикаДоходовОтКорректировки КАК АналитикаКорректировки
		|ПОМЕСТИТЬ _АналитикиКорректировок
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.АналитикаРасходовОтКорректировки
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДоходыОтПереоценки"" КАК РазделОтчета,
		|	ЕСТЬNULL(ОборотыРасходы.СубконтоДт2, ОборотыДоходы.СубконтоКт2) КАК ЦеннаяБумага,
		|	0 КАК СтоимостьАктивов,
		|	-ЕСТЬNULL(ОборотыРасходы.СуммаОборот, 0) КАК ИтогоРасходы,
		|	ЕСТЬNULL(ОборотыДоходы.СуммаОборот, 0) КАК ИтогоДоходы,
		|	ЕСТЬNULL(ОборотыРасходы.СубконтоДт1, ОборотыДоходы.СубконтоКт1) КАК ГФУ,
		|	ЕСТЬNULL(ОборотыРасходы.Регистратор, ОборотыДоходы.Регистратор) КАК Регистратор
		|ПОМЕСТИТЬ _КорректировкаФинансовыхВложений
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций))
		|				И СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11)
		|				И СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12),
		|			,
		|			СчетКт В
		|				(ВЫБРАТЬ
		|					_СчетаПереоценки.СчетУчетаПереоценки
		|				ИЗ
		|					_СчетаПереоценки КАК _СчетаПереоценки),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ОборотыРасходы
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				СчетДт В
		|					(ВЫБРАТЬ
		|						_СчетаПереоценки.СчетУчетаПереоценки
		|					ИЗ
		|						_СчетаПереоценки КАК _СчетаПереоценки),
		|				,
		|				СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций))
		|					И СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11)
		|					И СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ОборотыДоходы
		|		ПО ОборотыРасходы.СубконтоДт1 = ОборотыДоходы.СубконтоКт1
		|			И ОборотыРасходы.СубконтоДт2 = ОборотыДоходы.СубконтоКт2
		|			И ОборотыРасходы.Регистратор = ОборотыДоходы.Регистратор
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""ДоходыОтПереоценки"",
		|	ОборотыРасходы.СубконтоДт2,
		|	0,
		|	-ОборотыРасходы.СуммаОборот,
		|	0,
		|	ОборотыРасходы.СубконтоДт1,
		|	ОборотыРасходы.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций10),
		|			,
		|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ОборотыРасходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Производные финансовые инструменты"" КАК РазделОтчета,
		|	""Депозитная маржа"" КАК УчетныйАктив,
		|	ЕСТЬNULL(ОборотыРасходы.СубконтоДт1, ОборотыДоходы.СубконтоКт1) КАК Аналитика,
		|	0 КАК СтоимостьАктивов,
		|	0 КАК Расходы,
		|	ЕСТЬNULL(ОборотыРасходы.СуммаОборот, 0) КАК ПрочиеРасходы,
		|	ЕСТЬNULL(ОборотыРасходы.СуммаОборот, 0) КАК ИтогоРасходы,
		|	0 КАК Доход,
		|	ЕСТЬNULL(ОборотыДоходы.СуммаОборот, 0) КАК ПрочиеДоходы,
		|	ЕСТЬNULL(ОборотыДоходы.СуммаОборот, 0) КАК ИтогоДоходы,
		|	ЕСТЬNULL(ОборотыРасходы.Регистратор, ОборотыДоходы.Регистратор) КАК Регистратор
		|ПОМЕСТИТЬ _ПроизводныеФинансовыеИнструменты
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций))
		|				И СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11)
		|				И СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			СчетКт В
		|				(ВЫБРАТЬ
		|					_СчетаПереоценки.СчетУчетаПереоценки
		|				ИЗ
		|					_СчетаПереоценкиСПФИ КАК _СчетаПереоценки),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ОборотыРасходы
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				СчетДт В
		|					(ВЫБРАТЬ
		|						_СчетаПереоценки.СчетУчетаПереоценки
		|					ИЗ
		|						_СчетаПереоценкиСПФИ КАК _СчетаПереоценки),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций))
		|					И СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11)
		|					И СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ОборотыДоходы
		|		ПО ОборотыРасходы.СубконтоДт1 = ОборотыДоходы.СубконтоКт1
		|			И ОборотыРасходы.Регистратор = ОборотыДоходы.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Производные финансовые инструменты"",
		|	""Исполнение расчетов по сделке"",
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	0,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	0,
		|	0,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций09),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВспомогательныеСчета01),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДоходыОтПереоценки"" КАК РазделОтчета,
		|	ЕСТЬNULL(ОборотыРасходы.СубконтоДт2, ОборотыДоходы.СубконтоКт2) КАК ЦеннаяБумага,
		|	0 КАК СтоимостьАктивов,
		|	-ЕСТЬNULL(ОборотыРасходы.СуммаОборот, 0) КАК ИтогоРасходы,
		|	ЕСТЬNULL(ОборотыДоходы.СуммаОборот, 0) КАК ИтогоДоходы,
		|	ЕСТЬNULL(ОборотыРасходы.СубконтоДт1, ОборотыДоходы.СубконтоКт1) КАК ГФУ,
		|	ЕСТЬNULL(ОборотыРасходы.Регистратор, ОборотыДоходы.Регистратор) КАК Регистратор
		|ПОМЕСТИТЬ _ПереносПереоценки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций))
		|				И СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11)
		|				И СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12),
		|			,
		|			СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДобавочныйКапитал)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ОборотыРасходы
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДобавочныйКапитал)),
		|				,
		|				СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций))
		|					И СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11)
		|					И СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ОборотыДоходы
		|		ПО ОборотыРасходы.СубконтоДт1 = ОборотыДоходы.СубконтоКт1
		|			И ОборотыРасходы.СубконтоДт2 = ОборотыДоходы.СубконтоКт2
		|			И ОборотыРасходы.Регистратор = ОборотыДоходы.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ПроцентныеДоходы"" КАК РазделОтчета,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ОборотыПроцентыПоДепозитамЛинейно.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31122"", ""31123"")
		|			ТОГДА 19
		|		ИНАЧЕ 16
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	0 КАК ИтогоРасходы,
		|	ОборотыПроцентыПоДепозитамЛинейно.СуммаОборот КАК ИтогоДоходы,
		|	ОборотыПроцентыПоДепозитамЛинейно.КорСубконто2 КАК АналитикаПроцентов,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ОборотыПроцентыПоДепозитамЛинейно.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31122"", ""31123"")
		|			ТОГДА 10
		|		ИНАЧЕ 11.5
		|	КОНЕЦ КАК СортировкаРазделов,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	ОборотыПроцентыПоДепозитамЛинейно.КорСубконто1 КАК ГФУ,
		|	ОборотыПроцентыПоДепозитамЛинейно.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ПроцентыКПолучению
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета07), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета08)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31122"", ""31123"", ""31120"", ""31121""),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01),
		|			) КАК ОборотыПроцентыПоДепозитамЛинейно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Ценные бумаги"",
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	13,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания),
		|			КорСчет В ИЕРАРХИИ (&СчетаЦБ),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	19,
		|	-ОборотыКорректировкаДепозитаДоАС.СуммаОборотДт,
		|	ОборотыКорректировкаДепозитаДоАС.СуммаОборотКт,
		|	ОборотыКорректировкаДепозитаДоАС.Субконто2,
		|	11,
		|	НЕОПРЕДЕЛЕНО,
		|	ОборотыКорректировкаДепозитаДоАС.Субконто1,
		|	ОборотыКорректировкаДепозитаДоАС.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы06), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы05)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31520"", ""31521"", ""31620"", ""31621""),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09)),
		|			) КАК ОборотыКорректировкаДепозитаДоАС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Ценные бумаги"",
		|	0,
		|	ЕСТЬNULL(ОборотыДоходы.СуммаОборот, 0),
		|	ОборотыДоходы.СубконтоКт2,
		|	10.5,
		|	НЕОПРЕДЕЛЕНО,
		|	ОборотыДоходы.СубконтоКт1,
		|	ОборотыДоходы.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДт В
		|				(ВЫБРАТЬ
		|					_СчетаКорректировок.СчетУчетаКорректировок
		|				ИЗ
		|					_СчетаКорректировок КАК _СчетаКорректировок),
		|			,
		|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ОборотыДоходы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	19,
		|	-ОборотыКорректировкаДепозитаДоАС.СуммаОборотДт,
		|	ОборотыКорректировкаДепозитаДоАС.СуммаОборотКт,
		|	ОборотыКорректировкаДепозитаДоАС.Субконто2,
		|	11,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	ОборотыКорректировкаДепозитаДоАС.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций01), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""32601"", ""41601""),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09)),
		|			) КАК ОборотыКорректировкаДепозитаДоАС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""доходы от операций с размещенными депозитами"",
		|	-ОборотыДоходыДепозиты.СуммаОборотДт,
		|	ОборотыДоходыДепозиты.СуммаОборотКт,
		|	ОборотыДоходыДепозиты.Субконто2,
		|	11,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	ОборотыДоходыДепозиты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций01), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""32101""),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация17), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты)),
		|			) КАК ОборотыДоходыДепозиты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""сделки репо"",
		|	-ОборотыКорректировкаРЕПОПриПП.СуммаОборотДт,
		|	ОборотыКорректировкаРЕПОПриПП.СуммаОборотКт,
		|	ОборотыКорректировкаРЕПОПриПП.Субконто2,
		|	11.1,
		|	ОборотыКорректировкаРЕПОПриПП.КорСубконто1,
		|	ОборотыКорректировкаРЕПОПриПП.Субконто1,
		|	ОборотыКорректировкаРЕПОПриПП.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций01), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""32606"", ""41606""),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства20), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)),
		|			) КАК ОборотыКорректировкаРЕПОПриПП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	23,
		|	0,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	12,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Ценные бумаги"",
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	13,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Ценные бумаги"",
		|	-ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСчет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1,
		|	13,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы06), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы05)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						ВТ.АналитикаКорректировки
		|					ИЗ
		|						_АналитикиКорректировок КАК ВТ),
		|			,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги)) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Ценные бумаги"",
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	14,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.Дисконт),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Ценные бумаги"",
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	15,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы04),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления),
		|			КорСчет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги)) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""сделки репо"",
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	16,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Документ.СделкаРЕПО).Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31110"", ""31111"", ""31112"", ""31113"", ""31114"", ""31115"", ""31116"", ""31117""),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства11),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходыПрочие"",
		|	""сделки репо"",
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	0,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2,
		|	16,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства18),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31310"", ""31311"", ""31312"", ""31313"", ""31314"", ""31315"", ""31316"", ""31317""),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы03),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""сделки репо"",
		|	0,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	16,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Документ.СделкаРЕПО).Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы05), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы06)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31510"", ""31511"", ""31512"", ""31513"", ""31514"", ""31515"", ""31516"", ""31517"", ""31610"", ""31611"", ""31612"", ""31613"", ""31614"", ""31615"", ""31616"", ""31617""),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства20), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Результат от досрочного выбытия депозита"",
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1,
		|	11.1,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций01), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций02)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""41101"", ""41102"", ""41214""),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация17),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходыПрочие"",
		|	19,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2,
		|	10.5,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы03)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31322""),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты05),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПроцентныеДоходы"",
		|	""Проценты по депозитной марже"",
		|	-ОборотыПроцентыПоДепозитамЛинейно.СуммаОборот,
		|	-ОборотыПроцентыПоДепозитамЛинейно.СуммаОборот,
		|	ОборотыПроцентыПоДепозитамЛинейно.КорСубконто2,
		|	20,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	ОборотыПроцентыПоДепозитамЛинейно.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""44116""),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеРасходы01),
		|			) КАК ОборотыПроцентыПоДепозитамЛинейно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот) КАК ИтогоДоходы,
		|	""ДоходыПрочие"" КАК РазделОтчета,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1 КАК Аналитика,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1 КАК ГФУ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ПрочиеДоходы
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			,
		|			,
		|			СчетКТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы01), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности01)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И НЕ СубконтоКт1.Код В (""54301"", ""52204"", ""53304"")) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДепозитарногоОбслуживания), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОтветственногоХранения), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ВеденияРеестра), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецРегистрационногоОбслуживания))
		|			ТОГДА ""Вознаграждение депозитария""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|				КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|				ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|			КОНЕЦ
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры),
		|			СчетКТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДепозитарногоОбслуживания), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОтветственногоХранения), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ВеденияРеестра), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецРегистрационногоОбслуживания))
		|			ТОГДА ""Вознаграждение депозитария""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|				КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|				КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|					ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|				ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|	КОНЕЦ,
		|	СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			,
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|	КОНЕЦ,
		|	СУММА(ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот, 0)),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			,
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам01),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И НЕ СубконтоКт1 В
		|						(ВЫБРАТЬ
		|							_ГФУ_Резервы.ГФУ КАК ГФУ
		|						ИЗ
		|							_ГФУ_Резервы КАК _ГФУ_Резервы)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций05)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИтогоДоходы,
		|	""ПроцентныеДоходы"" КАК РазделОтчета,
		|	СУММА(-ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций06)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИтогоРасходы,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК АналитикаДивидендов,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ГФУ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ДоходыОтУчастияВДругихОрганизацияхПредварительно
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций05), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций06)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""34501"", ""34502"", ""34503"", ""34504"", ""34601"", ""34602"", ""34603"", ""34604"", ""34701"", ""34702"", ""34703"", ""34704"", ""34801"", ""34802"", ""34803"", ""34804""),
		|			,
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт2,
		|	0,
		|	""ПроцентныеДоходы"",
		|	-ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт2,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций06),
		|			,
		|			СчетКТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыПоНалогуНаПрибыль)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И СубконтоДт1.Код В (""43101"", ""43102"", ""43301"", ""43302"", ""43304"")) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ДоходыОтУчастияВДругихОрганизацияхПредварительно.ИтогоДоходы) КАК ИтогоДоходы,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.РазделОтчета КАК РазделОтчета,
		|	СУММА(_ДоходыОтУчастияВДругихОрганизацияхПредварительно.ИтогоРасходы) КАК ИтогоРасходы,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.АналитикаДивидендов КАК АналитикаДивидендов,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.ГФУ КАК ГФУ,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ДоходыОтУчастияВДругихОрганизациях
		|ИЗ
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно КАК _ДоходыОтУчастияВДругихОрганизацияхПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.ЦеннаяБумага,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.РазделОтчета,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.АналитикаДивидендов,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.ГФУ,
		|	_ДоходыОтУчастияВДругихОрганизацияхПредварительно.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Оценочное обязательство по оплате налога с дивидендов"" КАК Аналитика,
		|	ЕСТЬNULL(Доходы.СуммаОборот, 0) КАК ИтогоДоходы,
		|	""ДоходыПрочие"" КАК РазделОтчета,
		|	0 КАК ИтогоРасходы,
		|	Доходы.ЛицевойСчетДт.Контрагент КАК ЦеннаяБумага,
		|	Доходы.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ОценочноеОбязательствоПоОплатеНалогаСДивидендов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.РезервыОценочныеОбязательстваНекредитногоХарактера),
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности01),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И СубконтоКт1.Код В (""54301"")) КАК Доходы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Оценочное обязательство по оплате налога с дивидендов"",
		|	0,
		|	""ДоходыПрочие"",
		|	-ЕСТЬNULL(Расходы.СуммаОборот, 0),
		|	Расходы.ЛицевойСчетКт.Контрагент,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02),
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.РезервыОценочныеОбязательстваНекредитногоХарактера),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И СубконтоДт1.Код В (""55501"")) КАК Расходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК Аналитика,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""53102"", ""53103"")
		|				И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор) = ТИП(Документ.НачислениеЗадолженности)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор КАК Документ.НачислениеЗадолженности).РасчетныйСчет
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот) КАК ИтогоРасходы,
		|	""ДоходыПрочие"" КАК РазделОтчета,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК ГФУ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ПрочиеРасходы
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|			,
		|			СчетКТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""53102"", ""53103"")
		|				ТОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор) = ТИП(Документ.НачислениеЗадолженности)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""53102"", ""53103"")
		|				И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор) = ТИП(Документ.НачислениеЗадолженности)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор КАК Документ.НачислениеЗадолженности).РасчетныйСчет
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета)),
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""53102"", ""53103"")
		|				ТОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор) = ТИП(Документ.Оплата)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|			,
		|			СчетКТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКт.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|			,
		|			СчетКТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ЛицевойСчетКт.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12),
		|			,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ПроцентныеДоходы"",
		|	NULL,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ТекущийНалогНаПрибыль),
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыПоНалогуНаПрибыль),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02),
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И НЕ ВЫРАЗИТЬ(СубконтоДт1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""53103"", ""53105"", ""53106"")) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02),
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета01),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02),
		|			,
		|			СчетКТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	-СУММА(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот),
		|	""ДоходыПрочие"",
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам02),
		|			,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И НЕ СубконтоДт1 В
		|						(ВЫБРАТЬ
		|							_ГФУ_Резервы.ГФУ КАК ГФУ
		|						ИЗ
		|							_ГФУ_Резервы КАК _ГФУ_Резервы)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО <> ЗНАЧЕНИЕ(Документ.МНО.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.МНО
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад <> ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДепозитныйВклад
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.БанковскийСчет
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания В (ЗНАЧЕНИЕ(Справочник.ДоговорыБрокерскогоОбслуживания.), ЗНАЧЕНИЕ(Справочник.Договоры.), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ДоговорБрокерскогоОбслуживания
		|		КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.Контрагент
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт.ЦеннаяБумага
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор,
		|	ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК ЦеннаяБумага,
		|	""ДоходыПрочие"" КАК РазделОтчета,
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот КАК ИтогоРасходы,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ГФУ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ПокупкаАктивов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций06)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	""ДоходыПрочие"",
		|	-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВЫРАЗИТЬ(КорСубконто1 КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов)) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Аналитика) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Аналитика КАК Документ.МНО).РасчетныйСчет
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Аналитика) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги), ТИП(Документ.НачислениеДивидендов))
		|			ТОГДА ""Ценные бумаги""
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Аналитика) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ""сделки РЕПО""
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Аналитика) В (ТИП(Справочник.Акции), ТИП(Справочник.ВалютныеПары), ТИП(Справочник.Векселя), ТИП(Справочник.ДепозитарныеРасписки), ТИП(Справочник.Доли), ТИП(Справочник.Закладные), ТИП(Справочник.ИпотечныеСертификатыУчастия), ТИП(Справочник.Облигации), ТИП(Справочник.Паи))
		|				ИЛИ ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Аналитика) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|					И ВЫРАЗИТЬ(ВложенныйЗапрос.Аналитика КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс), ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион))
		|			ТОГДА ""Ценные бумаги""
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Аналитика) = ТИП(Справочник.БрокерскиеКомпании)
		|			ТОГДА КодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания
		|		КОГДА ВложенныйЗапрос.Аналитика = &НКО_НКЦ
		|			ТОГДА &НКО_НКЦ
		|		ИНАЧЕ ВложенныйЗапрос.Аналитика
		|	КОНЕЦ КАК Аналитика,
		|	ВложенныйЗапрос.ПрочиеРасходы КАК ПрочиеРасходы,
		|	ВложенныйЗапрос.ПрочиеДоходы КАК ПрочиеДоходы,
		|	ВложенныйЗапрос.ГФУ КАК ГФУ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Документ.МНО).РасчетныйСчет
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Документ.ПогашениеКупона).Облигация
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА СделкаРЕПОЦенныеБумаги.ЦеннаяБумага
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА ВложенныйЗапрос.ЦеннаяБумага.ЦеннаяБумага
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Справочник.БрокерскиеКомпании)
		|			ТОГДА КодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания
		|		КОГДА ВложенныйЗапрос.Аналитика = &НКО_НКЦ
		|			ТОГДА ЕСТЬNULL(НомераСчетовКлиринга.Значение, ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК))
		|		ИНАЧЕ ВложенныйЗапрос.ЦеннаяБумага
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	ВложенныйЗапрос.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ДоходыРасходыРезервы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт2 КАК Аналитика,
		|		-ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот КАК ПрочиеРасходы,
		|		0 КАК ПрочиеДоходы,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт1 КАК ГФУ,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоДт2 КАК ЦеннаяБумага,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор КАК Регистратор
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				СчетДТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02)),
		|				,
		|				,
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)
		|					И СубконтоДт1 В
		|						(ВЫБРАТЬ
		|							_ГФУ_Резервы.ГФУ КАК ГФУ
		|						ИЗ
		|							_ГФУ_Резервы КАК _ГФУ_Резервы
		|						ГДЕ
		|							_ГФУ_Резервы.Раздел = 1)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт2,
		|		0,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт1,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СубконтоКт2,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДоверительногоУправления,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				,
		|				,
		|				СчетКт В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам01), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы01)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)
		|					И СубконтоКт1 В
		|						(ВЫБРАТЬ
		|							_ГФУ_Резервы.ГФУ КАК ГФУ
		|						ИЗ
		|							_ГФУ_Резервы КАК _ГФУ_Резервы
		|						ГДЕ
		|							_ГФУ_Резервы.Раздел = 1)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСубконто2
		|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга))
		|				ТОГДА &НКО_НКЦ
		|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСубконто2
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСубконто1
		|		КОНЕЦ,
		|		-ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот,
		|		0,
		|		NULL,
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСубконто2
		|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга))
		|				ТОГДА &НКО_НКЦ
		|			КОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСубконто2
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОборотыДтКт.КорСубконто1
		|		КОНЕЦ,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДоверительногоУправления,
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.Регистратор
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|				ДАТАВРЕМЯ(2025, 1, 1, 0, 0, 1),
		|				ДАТАВРЕМЯ(2025, 1, 1, 0, 0, 1),
		|				Регистратор,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|				,
		|				&НачалоПериода = ДАТАВРЕМЯ(2025, 1, 1)
		|					И Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления),
		|				,
		|				) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГФУ_Резервы КАК _ГФУ_Резервы
		|		ПО ВложенныйЗапрос.ГФУ = _ГФУ_Резервы.ГФУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = СделкаРЕПОЦенныеБумаги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = ПогашениеЦеннойБумаги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров КАК КодыСчетовДоверительногоУправленияУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления
		|			И (КодыСчетовДоверительногоУправленияУБрокеров.ОсновнойБрокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НомераСчетовКлиринга
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = НомераСчетовКлиринга.Объект
		|			И (НомераСчетовКлиринга.Свойство.Ключ = ""НомерСчетаКлирингаВНКО_НКЦ"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПродажаАктивов.РазделОтчета КАК РазделОтчета,
		|	_ПродажаАктивов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПродажаАктивов.ИтогоРасходы КАК ИтогоРасходы,
		|	_ПродажаАктивов.ИтогоДоходы КАК ИтогоДоходы,
		|	1 КАК СортировкаРазделов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаПроцентов,
		|	"""" КАК Аналитика,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	_ПродажаАктивов.Аналитика КАК ГФУ,
		|	_ПродажаАктивов.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ИтоговаяТаблицаСГФУ
		|ИЗ
		|	_ПродажаАктивов КАК _ПродажаАктивов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_КорректировкаФинансовыхВложений.РазделОтчета,
		|	_КорректировкаФинансовыхВложений.ЦеннаяБумага,
		|	_КорректировкаФинансовыхВложений.ИтогоРасходы,
		|	_КорректировкаФинансовыхВложений.ИтогоДоходы,
		|	2,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	_КорректировкаФинансовыхВложений.ГФУ,
		|	_КорректировкаФинансовыхВложений.Регистратор
		|ИЗ
		|	_КорректировкаФинансовыхВложений КАК _КорректировкаФинансовыхВложений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроизводныеФинансовыеИнструменты.РазделОтчета,
		|	_ПроизводныеФинансовыеИнструменты.УчетныйАктив,
		|	_ПроизводныеФинансовыеИнструменты.ИтогоРасходы,
		|	_ПроизводныеФинансовыеИнструменты.ИтогоДоходы,
		|	3,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПроизводныеФинансовыеИнструменты.Регистратор
		|ИЗ
		|	_ПроизводныеФинансовыеИнструменты КАК _ПроизводныеФинансовыеИнструменты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроцентыКПолучению.РазделОтчета,
		|	_ПроцентыКПолучению.ЦеннаяБумага,
		|	СУММА(_ПроцентыКПолучению.ИтогоРасходы),
		|	СУММА(_ПроцентыКПолучению.ИтогоДоходы),
		|	_ПроцентыКПолучению.СортировкаРазделов,
		|	_ПроцентыКПолучению.АналитикаПроцентов,
		|	"""",
		|	_ПроцентыКПолучению.Контрагент,
		|	_ПроцентыКПолучению.ГФУ,
		|	_ПроцентыКПолучению.Регистратор
		|ИЗ
		|	_ПроцентыКПолучению КАК _ПроцентыКПолучению
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПроцентыКПолучению.АналитикаПроцентов,
		|	_ПроцентыКПолучению.РазделОтчета,
		|	_ПроцентыКПолучению.ЦеннаяБумага,
		|	_ПроцентыКПолучению.СортировкаРазделов,
		|	_ПроцентыКПолучению.Контрагент,
		|	_ПроцентыКПолучению.ГФУ,
		|	_ПроцентыКПолучению.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДоходыОтУчастияВДругихОрганизациях.РазделОтчета,
		|	_ДоходыОтУчастияВДругихОрганизациях.ЦеннаяБумага,
		|	_ДоходыОтУчастияВДругихОрганизациях.ИтогоРасходы,
		|	_ДоходыОтУчастияВДругихОрганизациях.ИтогоДоходы,
		|	40,
		|	_ДоходыОтУчастияВДругихОрганизациях.АналитикаДивидендов,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	_ДоходыОтУчастияВДругихОрганизациях.ГФУ,
		|	_ДоходыОтУчастияВДругихОрганизациях.Регистратор
		|ИЗ
		|	_ДоходыОтУчастияВДругихОрганизациях КАК _ДоходыОтУчастияВДругихОрганизациях
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОценочноеОбязательствоПоОплатеНалогаСДивидендов.РазделОтчета,
		|	_ОценочноеОбязательствоПоОплатеНалогаСДивидендов.ЦеннаяБумага,
		|	_ОценочноеОбязательствоПоОплатеНалогаСДивидендов.ИтогоРасходы,
		|	_ОценочноеОбязательствоПоОплатеНалогаСДивидендов.ИтогоДоходы,
		|	45,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	_ОценочноеОбязательствоПоОплатеНалогаСДивидендов.Регистратор
		|ИЗ
		|	_ОценочноеОбязательствоПоОплатеНалогаСДивидендов КАК _ОценочноеОбязательствоПоОплатеНалогаСДивидендов
		|ГДЕ
		|	_ОценочноеОбязательствоПоОплатеНалогаСДивидендов.ИтогоДоходы + _ОценочноеОбязательствоПоОплатеНалогаСДивидендов.ИтогоРасходы <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПрочиеДоходы.РазделОтчета,
		|	_ПрочиеДоходы.ЦеннаяБумага,
		|	0,
		|	_ПрочиеДоходы.ИтогоДоходы,
		|	50,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПрочиеДоходы.Аналитика,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПрочиеДоходы.ГФУ,
		|	_ПрочиеДоходы.Регистратор
		|ИЗ
		|	_ПрочиеДоходы КАК _ПрочиеДоходы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПрочиеРасходы.РазделОтчета,
		|	_ПрочиеРасходы.ЦеннаяБумага,
		|	_ПрочиеРасходы.ИтогоРасходы,
		|	0,
		|	100,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПрочиеРасходы.Аналитика,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПрочиеРасходы.ГФУ,
		|	_ПрочиеРасходы.Регистратор
		|ИЗ
		|	_ПрочиеРасходы КАК _ПрочиеРасходы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПокупкаАктивов.РазделОтчета,
		|	_ПокупкаАктивов.ЦеннаяБумага,
		|	_ПокупкаАктивов.ИтогоРасходы,
		|	0,
		|	120,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	_ПокупкаАктивов.ГФУ,
		|	_ПокупкаАктивов.Регистратор
		|ИЗ
		|	_ПокупкаАктивов КАК _ПокупкаАктивов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ДоходыПрочие"",
		|	_ДоходыРасходыРезервы.ЦеннаяБумага,
		|	_ДоходыРасходыРезервы.ПрочиеРасходы,
		|	_ДоходыРасходыРезервы.ПрочиеДоходы,
		|	90,
		|	НЕОПРЕДЕЛЕНО,
		|	_ДоходыРасходыРезервы.Аналитика,
		|	ВЫБОР
		|		КОГДА _ДоходыРасходыРезервы.Аналитика = &НКО_НКЦ
		|			ТОГДА &НКО_НКЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыРезервы.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ГруппыФинансовогоУчетаДоходовРасходов.Ссылка
		|		ИНАЧЕ _ДоходыРасходыРезервы.ГФУ
		|	КОНЕЦ,
		|	_ДоходыРасходыРезервы.Регистратор
		|ИЗ
		|	_ДоходыРасходыРезервы КАК _ДоходыРасходыРезервы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|		ПО (ГруппыФинансовогоУчетаДоходовРасходов.Код = ""48601"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПереносПереоценки.РазделОтчета,
		|	_ПереносПереоценки.ЦеннаяБумага,
		|	_ПереносПереоценки.ИтогоРасходы,
		|	_ПереносПереоценки.ИтогоДоходы,
		|	40,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	_ПереносПереоценки.ГФУ,
		|	_ПереносПереоценки.Регистратор
		|ИЗ
		|	_ПереносПереоценки КАК _ПереносПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблицаСГФУ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИсполнениеОбязательствПоСделке.Ссылка КАК ИсполнениеСделки
		|ПОМЕСТИТЬ _ИсполненияСделок
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ИтоговаяТаблицаСГФУ.ЦеннаяБумага КАК ЦеннаяБумага,
		|			_ИтоговаяТаблицаСГФУ.ГФУ КАК Сделка
		|		ИЗ
		|			_ИтоговаяТаблицаСГФУ КАК _ИтоговаяТаблицаСГФУ
		|		ГДЕ
		|			ТИПЗНАЧЕНИЯ(_ИтоговаяТаблицаСГФУ.ГФУ) = ТИП(Документ.Сделка)) КАК _ИтоговаяТаблицаСГФУ
		|		ПО ИсполнениеОбязательствПоСделке.Основание = _ИтоговаяТаблицаСГФУ.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстаткиИОбороты.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПС,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
		|		ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.Регистратор
		|	КОНЕЦ КАК Сделка,
		|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК Актив,
		|	МАКСИМУМ(БухПартииЦенныхБумагОстаткиИОбороты.Период) КАК Период
		|ПОМЕСТИТЬ _УчетныеАктивыЕПСПоСделкам
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстаткиИОбороты
		|ГДЕ
		|	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоРасход > 0
		|	И (БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага, БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ИтоговаяТаблицаСГФУ.ЦеннаяБумага,
		|				ЕСТЬNULL(ИсполнениеОбязательствПоСделке.Ссылка, _ИтоговаяТаблицаСГФУ.ГФУ)
		|			ИЗ
		|				_ИтоговаяТаблицаСГФУ
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|					ПО
		|						_ИтоговаяТаблицаСГФУ.ГФУ = ИсполнениеОбязательствПоСделке.Основание
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ИсполненияСделок.ЦеннаяБумага,
		|				_ИсполненияСделок.ИсполнениеСделки
		|			ИЗ
		|				_ИсполненияСделок)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумагОстаткиИОбороты.УчетныйАктивЕПС.Родитель,
		|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
		|		ИНАЧЕ БухПартииЦенныхБумагОстаткиИОбороты.Регистратор
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.РазделОтчета КАК РазделОтчета,
		|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВложенныйЗапрос.СортировкаРазделов КАК СортировкаРазделов,
		|	ВложенныйЗапрос.АналитикаПроцентов КАК АналитикаПроцентов,
		|	ВложенныйЗапрос.Аналитика КАК Аналитика,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(ВложенныйЗапрос.ИтогоРасходы) КАК ИтогоРасходы,
		|	СУММА(ВложенныйЗапрос.ИтогоДоходы) КАК ИтогоДоходы,
		|	ВложенныйЗапрос.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ИтоговаяТаблицаСГФУ.РазделОтчета КАК РазделОтчета,
		|		_ИтоговаяТаблицаСГФУ.ЦеннаяБумага КАК ЦеннаяБумага,
		|		_ИтоговаяТаблицаСГФУ.ИтогоРасходы КАК ИтогоРасходы,
		|		_ИтоговаяТаблицаСГФУ.ИтогоДоходы КАК ИтогоДоходы,
		|		_ИтоговаяТаблицаСГФУ.СортировкаРазделов КАК СортировкаРазделов,
		|		_ИтоговаяТаблицаСГФУ.АналитикаПроцентов КАК АналитикаПроцентов,
		|		_ИтоговаяТаблицаСГФУ.Аналитика КАК Аналитика,
		|		_ИтоговаяТаблицаСГФУ.Контрагент КАК Контрагент,
		|		ЕСТЬNULL(_УчетныеАктивыЕПСПоГФУ.УчетныйАктивЕПС, _УчетныеАктивыЕПСПоСделкам.УчетныйАктивЕПС) КАК УчетныйАктивЕПС,
		|		_ИтоговаяТаблицаСГФУ.Регистратор КАК Регистратор
		|	ИЗ
		|		_ИтоговаяТаблицаСГФУ КАК _ИтоговаяТаблицаСГФУ
		|			ЛЕВОЕ СОЕДИНЕНИЕ _УчетныеАктивыЕПСПоГФУ КАК _УчетныеАктивыЕПСПоГФУ
		|			ПО _ИтоговаяТаблицаСГФУ.ГФУ = _УчетныеАктивыЕПСПоГФУ.ГФУ
		|				И (ТИПЗНАЧЕНИЯ(_ИтоговаяТаблицаСГФУ.ГФУ) = ТИП(Справочник.ГруппыФинансовогоУчетаДоходовРасходов))
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_УчетныеАктивыЕПСПоСделкамРазвернуто.Актив КАК Актив,
		|				_УчетныеАктивыЕПСПоСделкамРазвернуто.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|				МАКСИМУМ(_УчетныеАктивыЕПСПоСделкамРазвернуто.Период) КАК Период
		|			ИЗ
		|				_УчетныеАктивыЕПСПоСделкам КАК _УчетныеАктивыЕПСПоСделкамРазвернуто
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_УчетныеАктивыЕПСПоСделкамРазвернуто.Актив,
		|				_УчетныеАктивыЕПСПоСделкамРазвернуто.УчетныйАктивЕПС) КАК _УчетныеАктивыЕПСПоСделкам
		|			ПО _ИтоговаяТаблицаСГФУ.ЦеннаяБумага = _УчетныеАктивыЕПСПоСделкам.Актив) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.РазделОтчета,
		|	ВложенныйЗапрос.ЦеннаяБумага,
		|	ВложенныйЗапрос.СортировкаРазделов,
		|	ВложенныйЗапрос.АналитикаПроцентов,
		|	ВложенныйЗапрос.Аналитика,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.УчетныйАктивЕПС,
		|	ВложенныйЗапрос.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Паи), ТИП(Справочник.ИпотечныеСертификатыУчастия))
		|			ТОГДА _ИтоговаяТаблица.ЦеннаяБумага
		|		ИНАЧЕ _ИтоговаяТаблица.АналитикаПроцентов
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА _ИтоговаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА _ИтоговаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент
		|		КОГДА _ИтоговаяТаблица.АналитикаПроцентов ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.АналитикаПроцентов КАК Справочник.Акции).Эмитент
		|		КОГДА _ИтоговаяТаблица.АналитикаПроцентов ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.АналитикаПроцентов КАК Справочник.Облигации).Эмитент
		|		КОГДА _ИтоговаяТаблица.АналитикаПроцентов ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.АналитикаПроцентов КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА _ИтоговаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА _ИтоговаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Паи).УчетныйАктивЦБРФ
		|		КОГДА _ИтоговаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ИСУ)
		|		КОГДА _ИтоговаяТаблица.АналитикаПроцентов ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.АналитикаПроцентов КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА _ИтоговаяТаблица.АналитикаПроцентов ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.АналитикаПроцентов КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА _ИтоговаяТаблица.АналитикаПроцентов ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.АналитикаПроцентов КАК Справочник.Паи).УчетныйАктивЦБРФ
		|		КОГДА _ИтоговаяТаблица.АналитикаПроцентов ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ИСУ)
		|	КОНЕЦ КАК УчетныйАктивЦБРФ
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица,
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Паи), ТИП(Справочник.ИпотечныеСертификатыУчастия))
		|			ИЛИ ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.АналитикаПроцентов) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Паи), ТИП(Справочник.ИпотечныеСертификатыУчастия)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.РазделОтчета КАК РазделОтчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(СТРОКА)
		|				И _ИтоговаяТаблица.Аналитика <> &НКО_НКЦ
		|			ТОГДА _ИтоговаяТаблица.ЦеннаяБумага
		|		ИНАЧЕ _ИтоговаяТаблица.Аналитика
		|	КОНЕЦ КАК Аналитика,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) В (ТИП(СТРОКА), ТИП(ЧИСЛО))
		|				И _ИтоговаяТаблица.Аналитика <> &НКО_НКЦ
		|			ТОГДА _ИтоговаяТаблица.АналитикаПроцентов
		|		ИНАЧЕ _ИтоговаяТаблица.ЦеннаяБумага
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(ЧИСЛО)
		|			ТОГДА _ИтоговаяТаблица.ЦеннаяБумага
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НомерБлока,
		|	_ИтоговаяТаблица.ИтогоРасходы КАК ИтогоРасходы,
		|	_ИтоговаяТаблица.ИтогоДоходы КАК ИтогоДоходы,
		|	_ИтоговаяТаблица.ИтогоДоходы + _ИтоговаяТаблица.ИтогоРасходы КАК ДоходРасход,
		|	_ИтоговаяТаблица.АналитикаПроцентов КАК АналитикаПроцентов,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.ЮрФизЛица)
		|				И _ИтоговаяТаблица.ЦеннаяБумага <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|			ТОГДА _ИтоговаяТаблица.ЦеннаяБумага
		|		ИНАЧЕ _ИтоговаяТаблица.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	_ИтоговаяТаблица.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ИтоговаяТаблица.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ДоходыРасходыДоРаспределенияПоКлассам
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО (_ЦенныеБумаги.ЦеннаяБумага В (_ИтоговаяТаблица.ЦеннаяБумага, _ИтоговаяТаблица.АналитикаПроцентов))
		|			И (НЕ _ИтоговаяТаблица.ЦеннаяБумага В (""Доходы от участия в других организациях""))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДоходыРасходыДоРаспределенияПоКлассам.РазделОтчета КАК РазделОтчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика) = ТИП(Справочник.ГруппыФинансовогоУчетаДоходовРасходов)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""371"", ""372"")
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам)
		|					КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""53105"", ""53106"")
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
		|					КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код = ""538""
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаЗаПереводДС)
		|					КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код = ""531""
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимУслугам)
		|					КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код = ""55703""
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|					КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код = ""55704""
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
		|					КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.Аналитика КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код = ""52401""
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходамИРасходам)
		|				КОНЕЦ
		|		КОГДА _ДоходыРасходыДоРаспределенияПоКлассам.Аналитика = ""Доходы от участия в других организациях""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Аналитика,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.ИтогоРасходы КАК ИтогоРасходы,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.ИтогоДоходы КАК ИтогоДоходы,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.ДоходРасход КАК ДоходРасход,
		|	ВЫБОР
		|		КОГДА _ДоходыРасходыДоРаспределенияПоКлассам.НомерБлока <> 0
		|			ТОГДА _ДоходыРасходыДоРаспределенияПоКлассам.НомерБлока
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ДоходыРасходыДоРаспределенияПоКлассам.Аналитика = ""Ценные бумаги""
		|						ИЛИ _ДоходыРасходыДоРаспределенияПоКлассам.Аналитика = """"
		|							И (ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) В (ТИП(Справочник.Акции), ТИП(Справочник.ВалютныеПары), ТИП(Справочник.Векселя), ТИП(Справочник.ДепозитарныеРасписки), ТИП(Справочник.Доли), ТИП(Справочник.Закладные), ТИП(Справочник.ИпотечныеСертификатыУчастия), ТИП(Справочник.Облигации), ТИП(Справочник.Паи))
		|								ИЛИ ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|									И ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс), ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)))
		|					ТОГДА ВЫБОР
		|							КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|								ТОГДА 1
		|							КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|								ТОГДА ВЫБОР
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|												И ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Подкатегория <> ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗРФ)
		|											ТОГДА 3
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|												И ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Подкатегория = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗРФ)
		|											ТОГДА 4
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|											ТОГДА 5
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
		|											ТОГДА 6
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
		|											ТОГДА 7
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|												И ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма, """") = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.ГосударственнаяКорпорация)
		|											ТОГДА 8
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|												И ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма, """") = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.ФедеральноеГосударственноеУнитарноеПредприятие)
		|											ТОГДА 9
		|										КОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|											ТОГДА 10
		|										ИНАЧЕ 11
		|									КОНЕЦ
		|							КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|								ТОГДА 12
		|							КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|								ТОГДА 13
		|							КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.ВалютныеПары)
		|									ИЛИ ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|										И ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс), ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион))
		|								ТОГДА 21
		|							ИНАЧЕ 27
		|						КОНЕЦ
		|				КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.БанковскиеСчета)
		|					ТОГДА 16
		|				КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|						ИЛИ ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.БрокерскиеКомпании)
		|					ТОГДА 17
		|				КОГДА _ДоходыРасходыДоРаспределенияПоКлассам.Аналитика В (&НКО_НКЦ, ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК))
		|					ТОГДА 18
		|				КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.ДепозитныеВклады)
		|					ТОГДА 19
		|				КОГДА (ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) В (ТИП(Справочник.Акции), ТИП(Справочник.ВалютныеПары), ТИП(Справочник.Векселя), ТИП(Справочник.ДепозитарныеРасписки), ТИП(Справочник.Доли), ТИП(Справочник.Закладные), ТИП(Справочник.ИпотечныеСертификатыУчастия), ТИП(Справочник.Облигации), ТИП(Справочник.Паи))
		|						ИЛИ ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|							И ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс), ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)))
		|						И _ДоходыРасходыДоРаспределенияПоКлассам.Аналитика = ""сделки репо""
		|					ТОГДА ВЫБОР
		|							КОГДА _ДоходыРасходыДоРаспределенияПоКлассам.ИтогоРасходы < 0
		|								ТОГДА 26
		|							ИНАЧЕ 26
		|						КОНЕЦ
		|				ИНАЧЕ 27
		|			КОНЕЦ
		|	КОНЕЦ КАК НомерБлока,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.АналитикаПроцентов КАК АналитикаПроцентов,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.Контрагент КАК Контрагент,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДоходыРасходыДоРаспределенияПоКлассам.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ДоходыИРасходыСКлассами
		|ИЗ
		|	_ДоходыРасходыДоРаспределенияПоКлассам КАК _ДоходыРасходыДоРаспределенияПоКлассам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_ДоходыРасходыДоРаспределенияПоКлассам.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ДоходыИРасходыСКлассами.НомерБлока = 27
		|				И _ДоходыИРасходыСКлассами.Аналитика В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам))
		|			ТОГДА 25
		|		КОГДА _ДоходыИРасходыСКлассами.Аналитика В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаЗаПереводДС), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимУслугам), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецрегистратора), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюОценщика), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюАудитора), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария))
		|			ТОГДА 29
		|		ИНАЧЕ _ДоходыИРасходыСКлассами.НомерБлока
		|	КОНЕЦ КАК НомерБлока,
		|	_ДоходыИРасходыСКлассами.РазделОтчета КАК РазделОтчета,
		|	_ДоходыИРасходыСКлассами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА _ДоходыИРасходыСКлассами.Аналитика В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
		|		ИНАЧЕ _ДоходыИРасходыСКлассами.Аналитика
		|	КОНЕЦ КАК ВидЗадолженности,
		|	_ДоходыИРасходыСКлассами.ДоходРасход КАК ДоходРасход,
		|	ВЫБОР
		|		КОГДА _ДоходыИРасходыСКлассами.Аналитика В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего))
		|			ТОГДА &ЮрЛицоОрганизации
		|		КОГДА _ДоходыИРасходыСКлассами.Аналитика В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария))
		|				И (_ДоходыИРасходыСКлассами.Контрагент = НЕОПРЕДЕЛЕНО
		|					ИЛИ _ДоходыИРасходыСКлассами.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|				И ТИПЗНАЧЕНИЯ(_ДоходыИРасходыСКлассами.ЦеннаяБумага) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|			ТОГДА ВЫРАЗИТЬ(_ДоходыИРасходыСКлассами.ЦеннаяБумага КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА _ДоходыИРасходыСКлассами.НомерБлока = 26
		|			ТОГДА &НКО_НКЦ
		|		ИНАЧЕ _ДоходыИРасходыСКлассами.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА _ДоходыИРасходыСКлассами.НомерБлока = 26
		|			ТОГДА NULL
		|		ИНАЧЕ _ДоходыИРасходыСКлассами.УчетныйАктивЕПС
		|	КОНЕЦ КАК УчетныйАктивЕПС,
		|	_ДоходыИРасходыСКлассами.Регистратор КАК Регистратор,
		|	_ДоходыИРасходыСКлассами.Регистратор.Дата КАК Дата
		|ПОМЕСТИТЬ _ДоходыРасходыДляРасшифровки
		|ИЗ
		|	_ДоходыИРасходыСКлассами КАК _ДоходыИРасходыСКлассами
		|ГДЕ
		|	_ДоходыИРасходыСКлассами.ДоходРасход <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДоходыРасходыДляРасшифровки.НомерБлока КАК НомерБлока,
		|	_ДоходыРасходыДляРасшифровки.РазделОтчета КАК РазделОтчета,
		|	_ДоходыРасходыДляРасшифровки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДоходыРасходыДляРасшифровки.ВидЗадолженности КАК ВидЗадолженности,
		|	СУММА(_ДоходыРасходыДляРасшифровки.ДоходРасход) КАК ДоходРасход,
		|	_ДоходыРасходыДляРасшифровки.Контрагент КАК Контрагент,
		|	_ДоходыРасходыДляРасшифровки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ДоходыРасходыЛинейная
		|ИЗ
		|	_ДоходыРасходыДляРасшифровки КАК _ДоходыРасходыДляРасшифровки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДоходыРасходыДляРасшифровки.НомерБлока,
		|	_ДоходыРасходыДляРасшифровки.РазделОтчета,
		|	_ДоходыРасходыДляРасшифровки.ЦеннаяБумага,
		|	_ДоходыРасходыДляРасшифровки.ВидЗадолженности,
		|	_ДоходыРасходыДляРасшифровки.Контрагент,
		|	_ДоходыРасходыДляРасшифровки.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВидыАктивов.КлассАктива КАК КлассАктива,
		|	ВложенныйЗапросОбщий.НомерБлока КАК НомерБлока,
		|	ВложенныйЗапросОбщий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВложенныйЗапросОбщий.ДоходыОтПродажи КАК ДоходыОтПродажи,
		|	ВложенныйЗапросОбщий.ПроцентныеДоходы КАК ПроцентныеДоходы,
		|	ВложенныйЗапросОбщий.ДоходыОтПереоценки КАК ДоходыОтПереоценки,
		|	ВложенныйЗапросОбщий.ДоходыПрочие КАК ДоходыПрочие,
		|	ВложенныйЗапросОбщий.Контрагент КАК Контрагент,
		|	ВложенныйЗапросОбщий.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ДоходыРасходыРазвернутая
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.НомерБлока КАК НомерБлока,
		|		ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СУММА(ВложенныйЗапрос.ДоходыОтПродажи) КАК ДоходыОтПродажи,
		|		СУММА(ВложенныйЗапрос.ПроцентныеДоходы) КАК ПроцентныеДоходы,
		|		СУММА(ВложенныйЗапрос.ДоходыОтПереоценки) КАК ДоходыОтПереоценки,
		|		СУММА(ВложенныйЗапрос.ДоходыПрочие) КАК ДоходыПрочие,
		|		ВложенныйЗапрос.Контрагент КАК Контрагент,
		|		ВложенныйЗапрос.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_ДоходыРасходыЛинейная.НомерБлока КАК НомерБлока,
		|			ВЫБОР
		|				КОГДА _ДоходыРасходыЛинейная.НомерБлока В (25, 29)
		|					ТОГДА _ДоходыРасходыЛинейная.ВидЗадолженности
		|				ИНАЧЕ _ДоходыРасходыЛинейная.ЦеннаяБумага
		|			КОНЕЦ КАК ЦеннаяБумага,
		|			_ДоходыРасходыЛинейная.ДоходРасход КАК ДоходыОтПродажи,
		|			0 КАК ПроцентныеДоходы,
		|			0 КАК ДоходыОтПереоценки,
		|			0 КАК ДоходыПрочие,
		|			_ДоходыРасходыЛинейная.Контрагент КАК Контрагент,
		|			_ДоходыРасходыЛинейная.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|		ИЗ
		|			_ДоходыРасходыЛинейная КАК _ДоходыРасходыЛинейная
		|		ГДЕ
		|			_ДоходыРасходыЛинейная.РазделОтчета = ""ДоходыОтПродажи""
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ДоходыРасходыЛинейная.НомерБлока,
		|			ВЫБОР
		|				КОГДА _ДоходыРасходыЛинейная.НомерБлока В (25, 29)
		|					ТОГДА _ДоходыРасходыЛинейная.ВидЗадолженности
		|				ИНАЧЕ _ДоходыРасходыЛинейная.ЦеннаяБумага
		|			КОНЕЦ,
		|			0,
		|			_ДоходыРасходыЛинейная.ДоходРасход,
		|			0,
		|			0,
		|			_ДоходыРасходыЛинейная.Контрагент,
		|			_ДоходыРасходыЛинейная.УчетныйАктивЕПС
		|		ИЗ
		|			_ДоходыРасходыЛинейная КАК _ДоходыРасходыЛинейная
		|		ГДЕ
		|			_ДоходыРасходыЛинейная.РазделОтчета = ""ПроцентныеДоходы""
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ДоходыРасходыЛинейная.НомерБлока,
		|			ВЫБОР
		|				КОГДА _ДоходыРасходыЛинейная.НомерБлока В (25, 29)
		|					ТОГДА _ДоходыРасходыЛинейная.ВидЗадолженности
		|				ИНАЧЕ _ДоходыРасходыЛинейная.ЦеннаяБумага
		|			КОНЕЦ,
		|			0,
		|			0,
		|			_ДоходыРасходыЛинейная.ДоходРасход,
		|			0,
		|			_ДоходыРасходыЛинейная.Контрагент,
		|			_ДоходыРасходыЛинейная.УчетныйАктивЕПС
		|		ИЗ
		|			_ДоходыРасходыЛинейная КАК _ДоходыРасходыЛинейная
		|		ГДЕ
		|			_ДоходыРасходыЛинейная.РазделОтчета = ""ДоходыОтПереоценки""
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ДоходыРасходыЛинейная.НомерБлока,
		|			ВЫБОР
		|				КОГДА _ДоходыРасходыЛинейная.НомерБлока В (25, 29)
		|					ТОГДА _ДоходыРасходыЛинейная.ВидЗадолженности
		|				ИНАЧЕ _ДоходыРасходыЛинейная.ЦеннаяБумага
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			_ДоходыРасходыЛинейная.ДоходРасход,
		|			_ДоходыРасходыЛинейная.Контрагент,
		|			_ДоходыРасходыЛинейная.УчетныйАктивЕПС
		|		ИЗ
		|			_ДоходыРасходыЛинейная КАК _ДоходыРасходыЛинейная
		|		ГДЕ
		|			_ДоходыРасходыЛинейная.РазделОтчета = ""ДоходыПрочие"") КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.НомерБлока,
		|		ВложенныйЗапрос.ЦеннаяБумага,
		|		ВложенныйЗапрос.Контрагент,
		|		ВложенныйЗапрос.УчетныйАктивЕПС) КАК ВложенныйЗапросОбщий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыАктивов КАК _ВидыАктивов
		|		ПО ВложенныйЗапросОбщий.НомерБлока = _ВидыАктивов.НомерБлока
		|ГДЕ
		|	(ВложенныйЗапросОбщий.ДоходыОтПродажи <> 0
		|			ИЛИ ВложенныйЗапросОбщий.ПроцентныеДоходы <> 0
		|			ИЛИ ВложенныйЗапросОбщий.ДоходыОтПереоценки <> 0
		|			ИЛИ ВложенныйЗапросОбщий.ДоходыПрочие <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДоходыРасходыРазвернутая.КлассАктива КАК КлассАктива,
		|	_ДоходыРасходыРазвернутая.НомерБлока КАК НомерБлока,
		|	_ДоходыРасходыРазвернутая.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ДоходыРасходыРазвернутая.ДоходыОтПродажи) КАК ДоходыОтПродажи,
		|	СУММА(_ДоходыРасходыРазвернутая.ПроцентныеДоходы) КАК ПроцентныеДоходы,
		|	СУММА(_ДоходыРасходыРазвернутая.ДоходыОтПереоценки) КАК ДоходыОтПереоценки,
		|	СУММА(_ДоходыРасходыРазвернутая.ДоходыПрочие) КАК ДоходыПрочие,
		|	_ДоходыРасходыРазвернутая.Контрагент КАК Контрагент,
		|	_ДоходыРасходыРазвернутая.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ДоходыРасходы
		|ИЗ
		|	_ДоходыРасходыРазвернутая КАК _ДоходыРасходыРазвернутая
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДоходыРасходыРазвернутая.КлассАктива,
		|	_ДоходыРасходыРазвернутая.НомерБлока,
		|	_ДоходыРасходыРазвернутая.ЦеннаяБумага,
		|	_ДоходыРасходыРазвернутая.Контрагент,
		|	_ДоходыРасходыРазвернутая.УчетныйАктивЕПС";
	
#КонецОбласти

	СчетаДС = Новый Массив;
	СчетаДС.Добавить(ПланыСчетов.Единый.РасчетныеСчета);
	СчетаДС.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами);
	СчетаДС.Добавить(ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05);
	СчетаДС.Добавить(ПланыСчетов.Единый.Расчеты22);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.УчастиеВДочернихОбществахИПаевыхФондах);
	
	Запрос.УстановитьПараметр("НачалоПериода", 								ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 								ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", 								ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации", 							ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("СчетаДС", 									СчетаДС);
	Запрос.УстановитьПараметр("СчетаЦБ", 									СчетаЦБ);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",				ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТипыЦБ", 									Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.Типы());
	Запрос.УстановитьПараметр("ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ", 	ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ());
	Запрос.УстановитьПараметр("НКО_НКЦ", 									ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	
	Результат = Запрос.Выполнить();
	
	СоответствиеРезультатовЗапросаДляРасшифровки = ?(АдресВХранилищеСДаннымиДляРасшифровки = Неопределено, Неопределено, Новый Соответствие);
	
	Если СоответствиеРезультатовЗапросаДляРасшифровки <> Неопределено Тогда
		АдресВХранилищеСДаннымиДляРасшифровки = ПоместитьВоВременноеХранилище(СоответствиеРезультатовЗапросаДляРасшифровки);
		ДобавитьРезультатЗапросаДляРасшифровки(СоответствиеРезультатовЗапросаДляРасшифровки, Запрос.МенеджерВременныхТаблиц, "_ДоходыРасходыДляРасшифровки");
	КонецЕсли;
	
	СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос,, "_СчетаДоверительногоУправления,_ВидыАктивов,_УчетныеАктивыЕПСПоСделкам, _ДоходыРасходы");	
    
КонецПроцедуры	

Процедура ПолучитьТаблицуВидовАктивов(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Акции"" КАК КлассАктива,
		|	1 КАК НомерБлока
		|ПОМЕСТИТЬ _ВидыАктивов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Паи (акции, доли) иностранных индексных инвестиционных фондов, размещающих средства в государственные ценные бумаги иностранных государств, облигации и акции иных иностранных эмитентов"",
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Государственные ценные бумаги Российской Федерации, обращающиеся на рынке ценных бумаг, за исключением облигаций внешних облигационных займов Российской Федерации"",
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Облигации внешних облигационных займов Российской Федерации"",
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Государственные ценные бумаги субъектов Российской Федерации"",
		|	5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Ценные бумаги органов местного самоуправления"",
		|	6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Облигации с ипотечным покрытием"",
		|	7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Облигации государственных корпораций"",
		|	8
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Облигации федеральных государственных унитарных предприятий"",
		|	9
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Облигации юридических лиц (за исключением облигаций с ипотечным покрытием, облигаций государственных корпораций, облигаций федеральных государственных унитарных предприятий)"",
		|	10
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Иные облигации"",
		|	11
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Ипотечные сертификаты участия"",
		|	12
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Инвестиционные паи паевых инвестиционных фондов"",
		|	13
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Ценные бумаги международных финансовых организаций"",
		|	14
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Долговые ценные бумаги иностранных государств"",
		|	15
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства на счетах в кредитных организациях"",
		|	16
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства на брокерских счетах"",
		|	17
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Денежные средства, предоставленные в распоряжение клирингового центра в качестве гарантийного обеспечения"",
		|	18
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Депозиты"",
		|	19
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Депозитные сертификаты"",
		|	20
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Производные финансовые инструменты"",
		|	21
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Недвижимое имущество"",
		|	22
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Дебиторская задолженность по накопленному купонному доходу (НКД)"",
		|	23
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Дебиторская задолженность по накопленному процентному доходу (НПД)"",
		|	24
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Прочая дебиторская задолженность"",
		|	25
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Дебиторская задолженность по операциям репо"",
		|	26
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Прочие активы"",
		|	27
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Кредиторская задолженность по операциям репо"",
		|	28
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Прочая кредиторская задолженность"",
		|	29
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Кредиторская задолженность - займы"",
		|	30";
		
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПоместитьСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", 							ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 							ЭтотОбъект.Период.ДатаОкончания);	
	Запрос.УстановитьПараметр("Организация", 							ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления", 	ЭтотОбъект.ВидДоговораДоверительногоУправления);
	Запрос.УстановитьПараметр("Клиент",									ЭтотОбъект.Клиент);		
	
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	    |	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	    |ПОМЕСТИТЬ _СчетаДоверительногоУправления
	    |ИЗ
	    |	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	    |			&КонецПериода,
	    |			Организация = &Организация
	    |				И Клиент = &Клиент
	    |				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
	    |				И (СчетДоверительногоУправления.ДатаРасторжения > &НачалоПериода
	    |					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КлиентыДоверительногоУправленияСрезПоследних";

	Запрос.Выполнить();	

КонецПроцедуры

Процедура ПодготовитьИВывестиРезультатПоДоходностиУК(ДокументРезультат, ДанныеОтчета, АдресВХранилище = "", АдресВХранилищеСДаннымиДляРасшифровки = "", Отказ = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
	ПоместитьСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
	
	ПоместитьСоответствиеУчетныхАктивовЕПСИГФУВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
	
	ПолучитьТаблицуВидовАктивов(Запрос);
	
	ПолучитьДоходыИРасходыЗаПериод(Запрос, АдресВХранилищеСДаннымиДляРасшифровки);	
	
	ПолучитьСостояниеПортфеляНаДату(Запрос, ЭтотОбъект.Период.ДатаНачала, Истина);
	ПолучитьСостояниеПортфеляНаДату(Запрос, ЭтотОбъект.Период.ДатаОкончания, Ложь);
	
	ПолучитьСредневзвешенныеВложенияЗаПериод(Запрос.МенеджерВременныхТаблиц, АдресВХранилищеСДаннымиДляРасшифровки);
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ПортфельНаНачалоПериода.КлассАктива, _ПортфельНаКонецПериода.КлассАктива) КАК КлассАктива,
		|	ЕСТЬNULL(_ПортфельНаНачалоПериода.НомерБлока, _ПортфельНаКонецПериода.НомерБлока) КАК НомерБлока,
		|	ЕСТЬNULL(_ПортфельНаНачалоПериода.Актив, _ПортфельНаКонецПериода.Актив) КАК Актив,
		|	ЕСТЬNULL(_ПортфельНаНачалоПериода.Контрагент, _ПортфельНаКонецПериода.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(_ПортфельНаНачалоПериода.БалансоваяСтоимость, 0) КАК БалансоваяСтоимостьНачало,
		|	ЕСТЬNULL(_ПортфельНаКонецПериода.БалансоваяСтоимость, 0) КАК БалансоваяСтоимостьКонец,
		|	ЕСТЬNULL(_ПортфельНаНачалоПериода.УчетныйАктивЕПС, ЕСТЬNULL(_ПортфельНаКонецПериода.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО)) КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _Портфель
		|ИЗ
		|	_ПортфельНаНачалоПериода КАК _ПортфельНаНачалоПериода
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ПортфельНаКонецПериода КАК _ПортфельНаКонецПериода
		|		ПО _ПортфельНаНачалоПериода.НомерБлока = _ПортфельНаКонецПериода.НомерБлока
		|			И _ПортфельНаНачалоПериода.Актив = _ПортфельНаКонецПериода.Актив
		|			И _ПортфельНаНачалоПериода.Контрагент = _ПортфельНаКонецПериода.Контрагент
		|			И (ЕСТЬNULL(_ПортфельНаНачалоПериода.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО) = ЕСТЬNULL(_ПортфельНаКонецПериода.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА НЕ _СредневзвешенныеВложения.Актив ЕСТЬ NULL
		|			ТОГДА ""Дебиторская задолженность по накопленному купонному доходу (НКД)""
		|		ИНАЧЕ ЕСТЬNULL(_Портфель.КлассАктива, _ДоходыРасходы.КлассАктива)
		|	КОНЕЦ КАК КлассАктива,
		|	ЕСТЬNULL(_Портфель.УчетныйАктивЕПС, ЕСТЬNULL(_ДоходыРасходы.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО)) КАК УчетныйАктивЕПС,
		|	ВЫБОР
		|		КОГДА НЕ _СредневзвешенныеВложения.Актив ЕСТЬ NULL
		|			ТОГДА 23
		|		ИНАЧЕ ЕСТЬNULL(_Портфель.НомерБлока, _ДоходыРасходы.НомерБлока)
		|	КОНЕЦ КАК НомерБлока,
		|	ЕСТЬNULL(_СредневзвешенныеВложения.Актив, ЕСТЬNULL(_Портфель.Актив, _ДоходыРасходы.ЦеннаяБумага)) КАК Актив,
		|	ЕСТЬNULL(_Портфель.Контрагент, _ДоходыРасходы.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(_Портфель.БалансоваяСтоимостьНачало, 0) КАК БалансоваяСтоимостьНачало,
		|	ЕСТЬNULL(_Портфель.БалансоваяСтоимостьКонец, 0) КАК БалансоваяСтоимостьКонец,
		|	ЕСТЬNULL(_ДоходыРасходы.ДоходыОтПродажи, 0) КАК ДоходыОтПродажи,
		|	ЕСТЬNULL(_ДоходыРасходы.ПроцентныеДоходы, 0) КАК ПроцентныеДоходы,
		|	ЕСТЬNULL(_ДоходыРасходы.ДоходыОтПереоценки, 0) КАК ДоходыОтПереоценки,
		|	ЕСТЬNULL(_ДоходыРасходы.ДоходыПрочие, 0) КАК ДоходыПрочие
		|ПОМЕСТИТЬ _Результат_ОсновныеДанные
		|ИЗ
		|	_Портфель КАК _Портфель
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДоходыРасходы КАК _ДоходыРасходы
		|		ПО _Портфель.НомерБлока = _ДоходыРасходы.НомерБлока
		|			И _Портфель.Актив = _ДоходыРасходы.ЦеннаяБумага
		|			И _Портфель.Контрагент = _ДоходыРасходы.Контрагент
		|			И (ЕСТЬNULL(_Портфель.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО) = ЕСТЬNULL(_ДоходыРасходы.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО))
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СредневзвешенныеВложения.Актив КАК Актив
		|		ИЗ
		|			_СредневзвешенныеВложения КАК _СредневзвешенныеВложения
		|		ГДЕ
		|			_СредневзвешенныеВложения.Раздел = ""Дебиторская задолженность по накопленному купонному доходу (НКД)"") КАК _СредневзвешенныеВложения
		|		ПО _Портфель.Актив = _СредневзвешенныеВложения.Актив
		|			И (_Портфель.НомерБлока = 23)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Результат_ОсновныеДанные.Актив КАК Облигация
		|ПОМЕСТИТЬ _Облигации
		|ИЗ
		|	_Результат_ОсновныеДанные КАК _Результат_ОсновныеДанные
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК Актив,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПС,
		|	МАКСИМУМ(БухПартииЦенныхБумаг.Период) КАК Дата
		|ПОМЕСТИТЬ _УчетныеАктивыЕПС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Организация = &Организация
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДоверительногоУправления)
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И БухПартииЦенныхБумаг.Активность
		|	И БухПартииЦенныхБумаг.ЦеннаяБумага В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_Результат_ОсновныеДанные.Актив
		|			ИЗ
		|				_Результат_ОсновныеДанные
		|			ГДЕ
		|				(_Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|					ИЛИ _Результат_ОсновныеДанные.НомерБлока = 21))
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.Родитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Результат_ОсновныеДанные.КлассАктива КАК КлассАктива,
		|	_Результат_ОсновныеДанные.НомерБлока КАК НомерБлока,
		|	_Результат_ОсновныеДанные.Актив КАК Актив,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 21
		|			ТОГДА ВЫБОР
		|					КОГДА _Результат_ОсновныеДанные.УчетныйАктивЕПС = НЕОПРЕДЕЛЕНО
		|						ТОГДА _УчетныеАктивыЕПС.УчетныйАктивЕПС
		|					ИНАЧЕ _Результат_ОсновныеДанные.УчетныйАктивЕПС
		|				КОНЕЦ
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 16
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 17
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДенежныеСредстваУБрокера)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 18
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 19
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 20
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 22
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьФизИЮрЛиц)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 24
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПроцентыНаМНО)
		|				КОНЕЦ
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 25
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьФизИЮрЛиц)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 26
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьФизИЮрЛиц)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 27
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 28
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 29
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации)
		|	КОНЕЦ КАК УчетныйАктивЕПС,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 21
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 26
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 28
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ГосРегНомер,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 21
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 26
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 28
		|			ТОГДА ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихCFI.Код, """")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК CFI,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 21
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 26
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 28
		|			ТОГДА ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, """")
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.БанковскиеСчета)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.БанковскиеСчета).НомерСчета
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитныеВклады).БанковскийСчет.НомерСчета
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДоговорыБрокерскогоОбслуживания).НомерДоговора
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) В (&ТипыЦБ)
		|			ТОГДА ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|		КОГДА _Результат_ОсновныеДанные.Актив В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия))
		|			ТОГДА ""По дивидендам""
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(_Результат_ОсновныеДанные.Актив)
		|	КОНЕЦ КАК ИдентификаторАктива,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДоговорыБрокерскогоОбслуживания).ДатаЗаключения
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ИдентификаторАктиваДата,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|						ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).Эмитент.Наименование)
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Векселя)
		|						ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Векселя).Эмитент.Наименование)
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Доли)
		|						ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Доли).ЮрЛицо.Наименование)
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|						ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).Эмитент.Наименование)
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Закладные)
		|						ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Закладные).Банк.Наименование)
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, """")
		|	КОНЕЦ КАК НаименованиеКонтрагента,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, """") + ""_"" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, """") + ""_"" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ОГРН, """")
		|		ИНАЧЕ ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, """") + ""_"" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, """") + ""_"" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ОГРН, """")
		|	КОНЕЦ КАК ИдентификаторКонтрагента,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, """") КАК ИдентификаторКонтрагента_ИНН,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ОГРН, """") КАК ИдентификаторКонтрагента_ОГРН,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ГосударственныйРегистрационныйНомер,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Паи).ДатаРегистрации
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).ДатаРегистрации
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитарныеРасписки).ДатаРегистрации
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).ДатаРегистрации
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).ДатаРегистрации
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|							И ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс), ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион))
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ПроизводныеФинансовыеИнструменты).Наименование
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ИнойИдентификаторАктива,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Паи).УчетныйАктивЦБРФ.КодЦБРФ
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).УчетныйАктивЦБРФ.КодЦБРФ
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Векселя)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Векселя).УчетныйАктивЦБРФ.КодЦБРФ
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).УчетныйАктивЦБРФ.КодЦБРФ
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).УчетныйАктивЦБРФ.КодЦБРФ
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КодТипаЦеннойБумаги,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации.Код, """")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КодСтраны,
		|	ЕСТЬNULL(КодыВоВнешнихСистемахСрезПоследних.Код, """") КАК КодЭмитента,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).Номинал
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Векселя)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Векселя).Номинал
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).Номинал
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Номинал,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).ВалютаНоминала.Код
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Векселя)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Векселя).ВалютаНоминала.Код
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Код
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Доли)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Доли).ВалютаНоминала.Код
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Код
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).ВалютаНоминала.Код
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Паи).ВалютаНоминала.Код
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КодВалютыНоминала,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				И ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ДефолтыПоОблигациям.Облигация ЕСТЬ NULL
		|						ТОГДА ""SHT""
		|					КОГДА ЕСТЬNULL(УсловияОферт.ДатаВыкупа, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА ""SHT""
		|					КОГДА РАЗНОСТЬДАТ(ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).ДатаРегистрации, ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).ДатаПогашения, ГОД) > 1
		|						ТОГДА ""LNT""
		|					ИНАЧЕ ""SHT""
		|				КОНЕЦ
		|	КОНЕЦ КАК КодСрокаПогашенияЦеннойБумаги,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).Субординированность
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока = 19
		|				И ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитныеВклады).Субординированность
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Субординированность,
		|	_Результат_ОсновныеДанные.БалансоваяСтоимостьНачало КАК СтоимостьНаНачалоПериода,
		|	_Результат_ОсновныеДанные.БалансоваяСтоимостьКонец КАК СтоимостьНаКонецПериода,
		|	_Результат_ОсновныеДанные.ДоходыОтПродажи КАК ДоходыОтПродажи,
		|	_Результат_ОсновныеДанные.ПроцентныеДоходы КАК ПроцентныеДоходы,
		|	_Результат_ОсновныеДанные.ДоходыОтПереоценки КАК ДоходыОтПереоценки,
		|	_Результат_ОсновныеДанные.ДоходыПрочие КАК ДоходыПрочие,
		|	_Результат_ОсновныеДанные.ДоходыОтПродажи + _Результат_ОсновныеДанные.ПроцентныеДоходы + _Результат_ОсновныеДанные.ДоходыОтПереоценки + _Результат_ОсновныеДанные.ДоходыПрочие КАК ДоходыВсего,
		|	""-"" КАК Примечание,
		|	""Нет"" КАК ПризнакИтога,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СредневзвешенныеВложения.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Результат_ОсновныеДанные.ДоходыОтПродажи / _СредневзвешенныеВложения.Сумма * &КоличествоДнейВГоду * 100 / &КоличествоДнейВПериоде КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК ДоходностьОтПродажи,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СредневзвешенныеВложения.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Результат_ОсновныеДанные.ПроцентныеДоходы / _СредневзвешенныеВложения.Сумма * &КоличествоДнейВГоду * 100 / &КоличествоДнейВПериоде КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК ДоходностьОтПроцентныхДоходов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СредневзвешенныеВложения.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Результат_ОсновныеДанные.ДоходыОтПереоценки / _СредневзвешенныеВложения.Сумма * &КоличествоДнейВГоду * 100 / &КоличествоДнейВПериоде КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК ДоходностьОтПереоценки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СредневзвешенныеВложения.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Результат_ОсновныеДанные.ДоходыПрочие / _СредневзвешенныеВложения.Сумма * &КоличествоДнейВГоду * 100 / &КоличествоДнейВПериоде КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК ДоходностьПрочихДоходов,
		|	ЕСТЬNULL(_СредневзвешенныеВложения.Сумма, 0) КАК СредневзвешенныеВложения,
		|	ВЫБОР
		|		КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|				ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Векселя)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Доли)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Доли).ЮрЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Закладные)
		|						ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|					ИНАЧЕ _Результат_ОсновныеДанные.Контрагент
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ЮрФизЛица)
		|			ТОГДА _Результат_ОсновныеДанные.Актив
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.БанковскиеСчета)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Договоры)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Договоры).Контрагент
		|		КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|			ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		ИНАЧЕ _Результат_ОсновныеДанные.Контрагент
		|	КОНЕЦ КАК Контрагент
		|ИЗ
		|	_Результат_ОсновныеДанные КАК _Результат_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СредневзвешенныеВложения КАК _СредневзвешенныеВложения
		|		ПО _Результат_ОсновныеДанные.Актив = _СредневзвешенныеВложения.Актив
		|			И (ВЫБОР
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|						ИЛИ _Результат_ОсновныеДанные.НомерБлока = 21
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Ценные бумаги""
		|							И _Результат_ОсновныеДанные.УчетныйАктивЕПС = ЕСТЬNULL(_СредневзвешенныеВложения.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО)
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 16
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Денежные средства""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 17
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Денежные средства у брокера""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 18
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Денежные средства на счетах клиринга""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 19
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Депозиты""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 23
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Дебиторская задолженность по накопленному купонному доходу (НКД)""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 24
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Дебиторская задолженность по накопленному процентному доходу (НПД)""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 25
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Прочая дебиторская задолженность""
		|							И ВЫБОР
		|								КОГДА _Результат_ОсновныеДанные.Актив = ""Комиссии по сделкам""
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ _Результат_ОсновныеДанные.Контрагент = _СредневзвешенныеВложения.Контрагент
		|							КОНЕЦ
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока В (26, 28)
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Сделки РЕПО""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 27
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Прочие активы""
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока = 29
		|					ТОГДА _СредневзвешенныеВложения.Раздел = ""Прочая кредиторская задолженность""
		|							И _Результат_ОсновныеДанные.Контрагент = _СредневзвешенныеВложения.Контрагент
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УчетныеАктивыЕПС КАК _УчетныеАктивыЕПС
		|		ПО _Результат_ОсновныеДанные.Актив = _УчетныеАктивыЕПС.Актив
		|			И (ЕСТЬNULL(_Результат_ОсновныеДанные.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО) = ЕСТЬNULL(_УчетныеАктивыЕПС.УчетныйАктивЕПС, НЕОПРЕДЕЛЕНО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|						ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|					ТОГДА ВЫБОР
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Векселя)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Паи)
		|								ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитарныеРасписки)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Доли)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Доли).ЮрЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Закладные)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|							ИНАЧЕ _Результат_ОсновныеДанные.Контрагент
		|						КОНЕЦ
		|				КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ЮрФизЛица)
		|					ТОГДА _Результат_ОсновныеДанные.Актив
		|				КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.БанковскиеСчета)
		|					ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|					ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Договоры)
		|					ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Договоры).Контрагент
		|				КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДоговорыБрокерскогоОбслуживания)
		|					ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|				ИНАЧЕ _Результат_ОсновныеДанные.Контрагент
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО _Результат_ОсновныеДанные.Актив = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.CFI)) КАК КодыВТорговыхСистемахСрезПоследнихCFI
		|		ПО _Результат_ОсновныеДанные.Актив = КодыВТорговыхСистемахСрезПоследнихCFI.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО _Результат_ОсновныеДанные.Актив = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонецПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.СектораЭкономики)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА _Результат_ОсновныеДанные.НомерБлока МЕЖДУ 1 И 15
		|						ИЛИ _Результат_ОсновныеДанные.НомерБлока = 23
		|					ТОГДА ВЫБОР
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Акции)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Векселя)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ДепозитарныеРасписки)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Доли)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Доли).ЮрЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Облигации)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|							КОГДА ТИПЗНАЧЕНИЯ(_Результат_ОсновныеДанные.Актив) = ТИП(Справочник.Закладные)
		|								ТОГДА ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|							ИНАЧЕ _Результат_ОсновныеДанные.Контрагент
		|						КОНЕЦ = КодыВоВнешнихСистемахСрезПоследних.Объект
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _Результат_ОсновныеДанные.Актив = УсловияОферт.Облигация
		|			И (УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПродажа))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДефолтыПоОблигациям КАК ДефолтыПоОблигациям
		|		ПО _Результат_ОсновныеДанные.Актив = ДефолтыПоОблигациям.Облигация
		|			И (ДефолтыПоОблигациям.Период >= ВЫРАЗИТЬ(_Результат_ОсновныеДанные.Актив КАК Справочник.Облигации).ДатаПогашения)
		|			И (ДефолтыПоОблигациям.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации))
		|			И (ДефолтыПоОблигациям.СтатусДефолта В (ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.ТехническийДефолт), ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)))
		|ГДЕ
		|	НЕ(ЕСТЬNULL(_Результат_ОсновныеДанные.БалансоваяСтоимостьНачало, 0) = 0
		|				И ЕСТЬNULL(_Результат_ОсновныеДанные.БалансоваяСтоимостьКонец, 0) = 0
		|				И ЕСТЬNULL(_Результат_ОсновныеДанные.ДоходыОтПродажи, 0) = 0
		|				И ЕСТЬNULL(_Результат_ОсновныеДанные.ПроцентныеДоходы, 0) = 0
		|				И ЕСТЬNULL(_Результат_ОсновныеДанные.ДоходыОтПереоценки, 0) = 0
		|				И ЕСТЬNULL(_Результат_ОсновныеДанные.ДоходыПрочие, 0) = 0
		|				И ЕСТЬNULL(_СредневзвешенныеВложения.Сумма, 0) = 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерБлока,
		|	ИдентификаторАктива
		|ИТОГИ
		|	СУММА(СтоимостьНаНачалоПериода),
		|	СУММА(СтоимостьНаКонецПериода),
		|	СУММА(ДоходыВсего),
		|	СУММА(СредневзвешенныеВложения)
		|ПО
		|	ОБЩИЕ";  	
	
	#КонецОбласти
	
	КоличествоДнейВГоду 	= (НачалоДня(КонецГода(ЭтотОбъект.Период.ДатаНачала)) - НачалоГода(ЭтотОбъект.Период.ДатаНачала)) / (60 * 60 * 24) + 1;
	КоличествоДнейВПериоде 	= (НачалоДня(ЭтотОбъект.Период.ДатаОкончания) - ЭтотОбъект.Период.ДатаНачала) / (60 * 60 * 24) + 1;
	
	Запрос.УстановитьПараметр("КоличествоДнейВГоду", 	КоличествоДнейВГоду);
	Запрос.УстановитьПараметр("КоличествоДнейВПериоде", КоличествоДнейВПериоде);
	
	//- Номер расчетного счета для денежных средств на счетах кредитных организаций
	//- Номер и дата договора с брокером для денежных средств на счетах брокера
	//- Номер счета депозита для депозитов         
	//- Код на ММВБ для производных финансовых инструментов
	//- ISIN для дебиторской задолженности по погашению купона
	//- номер расчетного счета для дебиторской задолженности по процентам по депозитам, МНО
	//- ISIN для дебиторской и кредиторской задолженности по сделкам РЕПО
	//- наименование задолженности для прочей дебиторской и кредиторской задолженности
	//- наименование актива для прочих активов
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Заполняем итоги
	Если Не Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для клиента " + СокрЛП(ЭтотОбъект.Клиент) + " отсутствуют данные по виду договора " + СокрЛП(ЭтотОбъект.ВидДоговораДоверительногоУправления),,,, Отказ);		
		Возврат;	
	КонецЕсли;
	
	Макет = ПолучитьМакет("ДоходностьПоУК");
	
	ДопИмяОбласти = ?(ЭтотОбъект.ВывестиКолонкиДляФормы264, "_ППА", "");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка" + ДопИмяОбласти);
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка" + ДопИмяОбласти);
	ОбластьИтоги 	= Макет.ПолучитьОбласть("Итоги" + ДопИмяОбласти);
		
	ОбластьШапка.Параметры.НомерПодраздела = ?(ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями, "255.5.4", "254.8.3");
	
	ДокументРезультат.Вывести(ОбластьШапка);

	ОбластьИтоги.Параметры.Заполнить(Выборка);
	
	Разницы = Новый Структура;
	Если Не ПроверитьИтоги(Запрос.МенеджерВременныхТаблиц, Выборка, Разницы) Тогда
		Возврат;
	КонецЕсли;
	
	Если Разницы.Свойство("ФинРез") Тогда
		ОбластьИтоги.Параметры.ДоходыВсего = ОбластьИтоги.Параметры.ДоходыВсего - Разницы.ФинРез;
	КонецЕсли;
	
	Если Разницы.Свойство("БалансНаНачало") Тогда
		ОбластьИтоги.Параметры.СтоимостьНаНачалоПериода = ОбластьИтоги.Параметры.СтоимостьНаНачалоПериода - Разницы.БалансНаНачало;
	КонецЕсли;
	
	Если Разницы.Свойство("БалансНаКонец") Тогда
		ОбластьИтоги.Параметры.СтоимостьНаКонецПериода = ОбластьИтоги.Параметры.СтоимостьНаКонецПериода - Разницы.БалансНаКонец;
	КонецЕсли;
	
	ТаблицаДюраций = ПолучитьДюрации(Запрос);
	
	СоответствиеУчетныхАктивовЕПСИКлассификацииЦенныхБумагМСФО = Новый Соответствие;
	СоответствиеУчетныхАктивовЕПСИКлассификацииЦенныхБумагМСФО.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД, 								"Долговые ценные бумаги, удерживаемые до погашения");
	СоответствиеУчетныхАктивовЕПСИКлассификацииЦенныхБумагМСФО.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток, 					"Ценные бумаги, оцениваемые по справедливой стоимости через прибыль или убыток");
	СоответствиеУчетныхАктивовЕПСИКлассификацииЦенныхБумагМСФО.Вставить(Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой, 						"Ценные бумаги, оцениваемые по справедливой стоимости через прибыль или убыток");
	СоответствиеУчетныхАктивовЕПСИКлассификацииЦенныхБумагМСФО.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи, 							?(ЭтотОбъект.СтандартМСФО = Перечисления.СтандартыФинансовойОтчетности.МСФО39, "Ценные бумаги, имеющиеся в наличии для продажи", "ценные бумаги, оцениваемые по справедливой стоимости через прочий совокупный доход"));
	СоответствиеУчетныхАктивовЕПСИКлассификацииЦенныхБумагМСФО.Вставить(Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения, 	"Ценные бумаги, оцениваемые по амортизированной стоимости");
	
	МассивАктивовДляРасшифровки = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
				
		Дюрация = "-";
		Если ТипЗнч(Выборка.Актив) = Тип("СправочникСсылка.Облигации") И (Выборка.НомерБлока >= 1 И Выборка.НомерБлока <= 15) Тогда
				
			НайдСтрокиДюрации = ТаблицаДюраций.НайтиСтроки(Новый Структура("ЦеннаяБумага", Выборка.Актив));
			Дюрация = ?(НайдСтрокиДюрации[0].Дюрация <> 0, НайдСтрокиДюрации[0].Дюрация, Дюрация);
					
		КонецЕсли;
				
		ОбластьСтрока.Параметры.Заполнить(ДанныеОтчета);
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		Если (Выборка.НомерБлока >= 1 И Выборка.НомерБлока <= 15) Или Выборка.НомерБлока = 23 Или Выборка.НомерБлока = 26 Или Выборка.НомерБлока = 28 Тогда
			//Составляем идентификатор ценной бумаги
			ГосРегНомер = ?(ПустаяСтрока(Выборка.ГосРегНомер), "000", Выборка.ГосРегНомер); 
			ISIN = ?(ПустаяСтрока(Выборка.ИдентификаторАктива), "000", Выборка.ИдентификаторАктива); 
			CFI = ?(ПустаяСтрока(Выборка.CFI), "000", Выборка.CFI); 
			ОбластьСтрока.Параметры.ИдентификаторАктива = ГосРегНомер + "_" + ISIN + "_" + CFI;
		КонецЕсли;
		
		Если ДопИмяОбласти = "_ППА" Тогда
			// Приводим код ЦБ РФ к стандарту
			ОбластьСтрока.Параметры.КодТипаЦеннойБумаги = ПолучитьКодЦБРФ(Выборка.КодТипаЦеннойБумаги);			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторАктиваДата) Тогда
			ОбластьСтрока.Параметры.ИдентификаторАктива = СокрЛП(Выборка.ИдентификаторАктива) + " от " + Формат(Выборка.ИдентификаторАктиваДата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
				
		ОбластьСтрока.Параметры.СтандартМСФО = ?(ЭтотОбъект.СтандартМСФО = Перечисления.СтандартыФинансовойОтчетности.МСФО39, "IAS 39", "IFRS 9");
		КлассификацияАктива = СоответствиеУчетныхАктивовЕПСИКлассификацииЦенныхБумагМСФО.Получить(Выборка.УчетныйАктивЕПС);
		КлассификацияАктива = ?(КлассификацияАктива = Неопределено, Выборка.УчетныйАктивЕПС, КлассификацияАктива);
		ОбластьСтрока.Параметры.КлассификацияАктива39	= ?(ЭтотОбъект.СтандартМСФО = Перечисления.СтандартыФинансовойОтчетности.МСФО39, 	КлассификацияАктива, "");
		ОбластьСтрока.Параметры.КлассификацияАктива9 	= ?(ЭтотОбъект.СтандартМСФО = Перечисления.СтандартыФинансовойОтчетности.МСФО9,		КлассификацияАктива, "");
					
		ОбластьСтрока.Параметры.Дюрация = Дюрация;
						
		ОбластьСтрока.Параметры.ДоходностьВсего = Выборка.ДоходностьОтПродажи + Выборка.ДоходностьОтПроцентныхДоходов + Выборка.ДоходностьОтПереоценки + Выборка.ДоходностьПрочихДоходов;
		
		СтруктураРасшифровки = Новый Структура("ИмяПоля,Актив,НомерБлока,Контрагент, КлассАктива, КлассификацияАктива, ИдентификаторАктива, ФинансовыйРезультат", "СредневзвешенныеВложения", Выборка.Актив, Выборка.НомерБлока, Выборка.Контрагент, Выборка.КлассАктива, Выборка.УчетныйАктивЕПС, Выборка.ИдентификаторАктива, Выборка.ДоходыВсего);
		ОбластьСтрока.Параметры.РасшифровкаСредневзвешенныеВложения = СтруктураРасшифровки;
		
		СтруктураРасшифровки = Новый Структура("ИмяПоля,Актив,НомерБлока,Контрагент, КлассАктива, КлассификацияАктива, ИдентификаторАктива", "ДоходыОтПродажи", Выборка.Актив, Выборка.НомерБлока, Выборка.Контрагент, Выборка.КлассАктива, Выборка.УчетныйАктивЕПС, Выборка.ИдентификаторАктива);
		ОбластьСтрока.Параметры.РасшифровкаДоходыОтПродажи = СтруктураРасшифровки;
		
		СтруктураРасшифровки = Новый Структура("ИмяПоля,Актив,НомерБлока,Контрагент, КлассАктива, КлассификацияАктива, ИдентификаторАктива", "ПроцентныеДоходы", Выборка.Актив, Выборка.НомерБлока, Выборка.Контрагент, Выборка.КлассАктива, Выборка.УчетныйАктивЕПС, Выборка.ИдентификаторАктива);
		ОбластьСтрока.Параметры.РасшифровкаПроцентныеДоходы = СтруктураРасшифровки;
		
		СтруктураРасшифровки = Новый Структура("ИмяПоля,Актив,НомерБлока,Контрагент, КлассАктива, КлассификацияАктива, ИдентификаторАктива", "ДоходыОтПереоценки", Выборка.Актив, Выборка.НомерБлока, Выборка.Контрагент, Выборка.КлассАктива, Выборка.УчетныйАктивЕПС, Выборка.ИдентификаторАктива);
		ОбластьСтрока.Параметры.РасшифровкаДоходыОтПереоценки = СтруктураРасшифровки;
		
		СтруктураРасшифровки = Новый Структура("ИмяПоля,Актив,НомерБлока,Контрагент, КлассАктива, КлассификацияАктива, ИдентификаторАктива", "ДоходыПрочие", Выборка.Актив, Выборка.НомерБлока, Выборка.Контрагент, Выборка.КлассАктива, Выборка.УчетныйАктивЕПС, Выборка.ИдентификаторАктива);
		ОбластьСтрока.Параметры.РасшифровкаДоходыПрочие = СтруктураРасшифровки;
		
		СтруктураРасшифровки = Новый Структура("ИмяПоля,Актив,НомерБлока,Контрагент, КлассАктива, КлассификацияАктива, ИдентификаторАктива", "ДоходыВсего", Выборка.Актив, Выборка.НомерБлока, Выборка.Контрагент, Выборка.КлассАктива, Выборка.УчетныйАктивЕПС, Выборка.ИдентификаторАктива);
		ОбластьСтрока.Параметры.РасшифровкаДоходыВсего = СтруктураРасшифровки;

		Если ВывестиРасшифровкуСредневзвешенныхВложений Тогда 
			МассивАктивовДляРасшифровки.Добавить(СтруктураРасшифровки);
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;	
	
	Если Разницы.Количество() <> 0 Тогда
		// Добавляем строку с разницей в прочие доходы
		ОбластьСтрока.Параметры.ДоходыОтПродажи 	= 0;
		ОбластьСтрока.Параметры.ПроцентныеДоходы 	= 0;
		ОбластьСтрока.Параметры.ДоходыОтПереоценки 	= 0;
		ОбластьСтрока.Параметры.ДоходыПрочие 		= ?(Разницы.Свойство("ФинРез"), - Разницы.ФинРез, 0);
		ОбластьСтрока.Параметры.ДоходыВсего 		= ?(Разницы.Свойство("ФинРез"), - Разницы.ФинРез, 0);
		
		Если ЭтотОбъект.ВывестиКолонкиДляФормы264 Тогда
			ОбластьСтрока.Параметры.ИдентификаторКонтрагента_ИНН 	= "-";
			ОбластьСтрока.Параметры.ИдентификаторКонтрагента_ОГРН 	= "-";			
		Иначе
			ОбластьСтрока.Параметры.НомерБлока	 					= 27;
			ОбластьСтрока.Параметры.ИдентификаторКонтрагента	 	= "-";		
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КлассАктива 					= "Прочие активы";
		
		ОбластьСтрока.Параметры.ИдентификаторАктива		 		= "-";
		ОбластьСтрока.Параметры.НаименованиеКонтрагента	 		= "-";
		ОбластьСтрока.Параметры.КлассификацияАктива39	 		= "-";
		ОбластьСтрока.Параметры.КлассификацияАктива9	 		= "-";
		ОбластьСтрока.Параметры.СтоимостьНаНачалоПериода	 	= ?(Разницы.Свойство("БалансНаНачало"), - Разницы.БалансНаНачало, 0);
		ОбластьСтрока.Параметры.СтоимостьНаКонецПериода	 		= ?(Разницы.Свойство("БалансНаКонец"), - Разницы.БалансНаКонец, 0);;
		ОбластьСтрока.Параметры.СредневзвешенныеВложения	 	= 0;
		ОбластьСтрока.Параметры.Дюрация 						= "";
		ОбластьСтрока.Параметры.ДоходностьОтПродажи             = 0;
		ОбластьСтрока.Параметры.ДоходностьОтПроцентныхДоходов   = 0;
		ОбластьСтрока.Параметры.ДоходностьОтПереоценки          = 0;
		ОбластьСтрока.Параметры.ДоходностьПрочихДоходов         = 0;
		ОбластьСтрока.Параметры.ДоходностьВсего                 = 0;		
				
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЕсли;		
		
	ДокументРезультат.Вывести(ОбластьИтоги);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ВывестиРасшифровкуСредневзвешенныхВложений Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(МассивАктивовДляРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКодЦБРФ(КодТипаЦеннойБумаги)
	
	Если ПустаяСтрока(КодТипаЦеннойБумаги) Тогда
		Возврат КодТипаЦеннойБумаги;
	КонецЕсли;
	
	ПоследняяТочка = СтрНайти(КодТипаЦеннойБумаги, ".", НаправлениеПоиска.СКонца);
	
	Если ПоследняяТочка = 0 Тогда 
		Возврат КодТипаЦеннойБумаги;
	Иначе
		Возврат Сред(КодТипаЦеннойБумаги, ПоследняяТочка + 1);
	КонецЕсли;
	
КонецФункции

Функция ПроверитьИтоги(МенеджерВременныхТаблиц, СтрокаИтогов, Разницы)
		
	ОбщийФинРез = - ОборотЕПС("Сч 710,712,713,715,717,718,720,725,727,728 КорСч !479",,,, МенеджерВременныхТаблиц) - СуммаРезервовПриПереходеНаМСФО9(МенеджерВременныхТаблиц); 
	ВидыСубконтоГФУ = ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов;
	ВознаграждениеУК = ПолучитьВознаграждениеУК(МенеджерВременныхТаблиц);
	
	ОбщийФинРез 	= ОбщийФинРез - ВознаграждениеУК;	
		
	Если ОбщийФинРез <> СтрокаИтогов.ДоходыВсего Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Общий финансовый результат в отчете " + Формат(СтрокаИтогов.ДоходыВсего, "ЧДЦ=2") + " отличается от финансового результата по ОФР " +  Формат(ОбщийФинРез, "ЧДЦ=2") + ". Возможно, был доработан отчет по ОФР");		
		Разницы.Вставить("ФинРез", СтрокаИтогов.ДоходыВсего - ОбщийФинРез);
	КонецЕсли;  	
	
	СписокСчетов = СписокБалансовыхСчетов();
	БалансНаНачало 	= ОбщаяБалансоваяСтоимость(МенеджерВременныхТаблиц, СписокСчетов, ЭтотОбъект.Период.ДатаНачала - 24 * 60 * 60);
	БалансНаКонец 	= ОбщаяБалансоваяСтоимость(МенеджерВременныхТаблиц, СписокСчетов, ЭтотОбъект.Период.ДатаОкончания);
	
	Если БалансНаНачало <> СтрокаИтогов.СтоимостьНаНачалоПериода Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Общая стоимость на начало периода в отчете " + Формат(СтрокаИтогов.СтоимостьНаНачалоПериода, "ЧДЦ=2") + " отличается от балансовой стоимости по ОСВ " +  Формат(БалансНаНачало, "ЧДЦ=2"));
		Разницы.Вставить("БалансНаНачало",  СтрокаИтогов.СтоимостьНаНачалоПериода - БалансНаНачало);
	КонецЕсли;  	
	
	Если БалансНаКонец <> СтрокаИтогов.СтоимостьНаКонецПериода Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Общая стоимость на конец периода в отчете " + Формат(СтрокаИтогов.СтоимостьНаКонецПериода, "ЧДЦ=2") + " отличается от балансовой стоимости по ОСВ " +  Формат(БалансНаКонец, "ЧДЦ=2"));
		Разницы.Вставить("БалансНаКонец", СтрокаИтогов.СтоимостьНаКонецПериода - БалансНаКонец);
	КонецЕсли;  	
		
	Возврат Истина;
	
КонецФункции

Функция СписокБалансовыхСчетов()
	
	СписокСчетов = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыборкаСчетов = ПланыСчетов.Единый.Выбрать();
	Пока ВыборкаСчетов.Следующий() Цикл
		
		Если СтрДлина(ВыборкаСчетов.Код) <> 3 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаСчетов.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаСчетов.Код = "000" Или ВыборкаСчетов.Код = "479" Тогда
			Продолжить;
		КонецЕсли;
		
		ПервыйСимвол = Лев(ВыборкаСчетов.Код, 1);
		
		Если Число(ПервыйСимвол) >= 7 Тогда
			Продолжить;
		КонецЕсли;
		
		СписокСчетов.Добавить(ВыборкаСчетов.Ссылка);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СписокСчетов;
	
КонецФункции

Функция ОбщаяБалансоваяСтоимость(МенеджерВременныхТаблиц, МассивСчетов, Дата)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.Баланс) КАК Баланс
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК Баланс
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Дата,
		|				Счет В ИЕРАРХИИ (&Счета),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)
		|				ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Дата,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Дата", 			Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Счета", 			МассивСчетов);
	Запрос.УстановитьПараметр("Организация", 	ЭтотОбъект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Возврат ?(Выборка.Следующий(), Выборка.Баланс, 0);
	
КонецФункции 

Функция ПолучитьВознаграждениеУК(МенеджерВременныхТаблиц = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот КАК Сумма
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				,
		|				СчетДТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|				,
		|				СчетКТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЛицевойСчетКт.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				,
		|				СчетДТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|				,
		|				СчетКТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЛицевойСчетКт.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт) КАК ВложенныйЗапрос";
	

	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетДоверительногоУправления = &СчетДоверительногоУправления", "СчетДоверительногоУправления В (ВЫБРАТЬ _СчетаДоверительногоУправления.СчетДоверительногоУправления ИЗ _СчетаДоверительногоУправления)");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Сумма, 0);
	
КонецФункции

Функция СуммаРезервовПриПереходеНаМСФО9(МенеджерВременныхТаблиц = Неопределено)
	
	Если ЭтотОбъект.Период.ДатаНачала <> '20250101' Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт) КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			,
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты";
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетДоверительногоУправления = &СчетДоверительногоУправления", "СчетДоверительногоУправления В (ВЫБРАТЬ _СчетаДоверительногоУправления.СчетДоверительногоУправления ИЗ _СчетаДоверительногоУправления)");
	КонецЕсли;
	
	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Запрос.УстановитьПараметр("НачалоПериода", '20250101000001');
	Запрос.УстановитьПараметр("КонецПериода", '20250101000001');
	
	Выборка = Запрос.Выполнить().Выбрать();
      
	Возврат ?(Выборка.Следующий(), Выборка.Сумма, 0);
	
КонецФункции

Процедура ПоместитьСоответствиеУчетныхАктивовЕПСИГФУВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД) КАК УчетныйАктивЕПС,
		|	ГруппыФинансовогоУчетаДоходовРасходов.Ссылка КАК ГФУ
		|ПОМЕСТИТЬ _УчетныеАктивыЕПСПоГФУ
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|ГДЕ
		|	ГруппыФинансовогоУчетаДоходовРасходов.Код В(&ГФУДолговыхДоПогашения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток),
		|	ГруппыФинансовогоУчетаДоходовРасходов.Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|ГДЕ
		|	ГруппыФинансовогоУчетаДоходовРасходов.Код В(&ГФУДолговыхЧерезПрибыльУбыток)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолевыеПоСправедливой),
		|	ГруппыФинансовогоУчетаДоходовРасходов.Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|ГДЕ
		|	ГруппыФинансовогоУчетаДоходовРасходов.Код В(&ГФУДолевыхЧерезПрибыльУбыток)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажи),
		|	ГруппыФинансовогоУчетаДоходовРасходов.Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|ГДЕ
		|	ГруппыФинансовогоУчетаДоходовРасходов.Код В(&ГФУДолговыхДляПродажи)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения),
		|	ГруппыФинансовогоУчетаДоходовРасходов.Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|ГДЕ
		|	ГруппыФинансовогоУчетаДоходовРасходов.Код В(&ГФУДолговыхПоАмортизированной)";
	
	СтрокаГФУДолговыхДоПогашения = 	"31140,31141,31142,31143,31144,31145,31146,31168,31169,31170,31171,31172,31173,31174,
									|31340,31341,31342,31343,31344,31345,31346,31368,31369,31370,31371,31372,31373,31374,
									|31432,31433,31435,31436,31437,31438,31439,31464,31465,31466,31467,31468,31470,31471,
									|31538,31539,31540,31541,31542,31543,31544,31638,31639,31640,31641,31642,31643,31644,
									|33401,33402,33403,33404,33405,33406,33407,33408,33409,33410,33411,33412,33413,33414,
									|33615,33616,33617,33618,33619,33620,33621,33643,33644,33645,33646,33647,33648,33649,
									|38501,38502,38503,38504,38505,38506,38507,38801,38802,38803,38804,38805,38806,38807,
									|42401,42402,42403,42404,42405,42406,42407,42408,42409,42410,42411,42412,42413,42414,
									|42615,42616,42617,42618,42619,42620,42621,48501,48502,48503,48504,48505,48506,48507";
	
	СтрокаГФУДолговыхЧерезПрибыльУбыток = 	"31126,31127,31128,31129,31130,31131,31132,31326,31327,31328,31329,31330,31331,
											|31332,31416,31417,31419,31420,31421,31422,31423,31524,31525,31526,31527,31528,31529,
											|31530,31624,31625,31626,31627,31628,31629,31630,33101,33102,33103,33104,33105,33106,
											|33107,33201,33202,33203,33204,33205,33206,33207,33601,33602,33603,33604,33605,33606,
											|33607,42101,42102,42103,42104,42105,42106,42107,42201,42202,42203,42204,42205,42206,
											|42207,42601,42602,42603,42604,42605,42606,42607";
	
	СтрокаГФУДолевыхЧерезПрибыльУбыток	= 	"34101,34102,34103,34104,34201,34202,34203,34204,34501,34502,34503,34504,34901,34902,34903,										
											|34904,43101,43102,43103,43104,43201,43202,43203,43204,43501,43502,43503,43504";
	
	СтрокаГФУДолговыхДляПродажи			= 	"31133,31134,31135,31136,31137,31138,31139,31333,31334,31335,31336,31337,31338,31339,
											|31424,31425,31427,31428,31429,31430,31431,31531,31532,31533,31534,31535,31536,31537,
											|31631,31632,31633,31634,31635,31636,31637,33301,33302,33303,33304,33305,33306,33307,
											|33608,33609,33610,33611,33612,33613,33614,38401,38402,38403,38404,38405,38406,38407,
											|42301,42302,42303,42304,42305,42306,42307,42608,42609,42610,42611,42612,42613,42614,
											|48401,48402,48403,48404,48405,48406,48407,81305,81306,81307,81401,81402,81403,81404,
											|81405,81406,81407,81501,81502,81503,81504,81505,81506,81507,85401,85402,85403,85404,
											|85405,85406,85407,85501,85502,85503,85504,85505,85506,85507";   
		
	СтрокаГФУДолговыхПоАмортизированной = 	"31147,31148,31149,31150,31151,31152,31153,31175,31176,31177,31178,31179,31180,31181,
											|31347,31348,31349,31350,31351,31352,31353,31375,31376,31377,31378,31379,31380,31381,
											|31440,31441,31442,31443,31444,31446,31447,31472,31473,31474,31475,31476,31478,31479,
											|31545,31546,31547,31548,31549,31550,31551,31573,31574,31575,31576,31577,31578,31579,
											|31645,31646,31647,31648,31649,31650,31651,31673,31674,31675,31676,31677,31678,31679,
											|32101,32102,32401,32402,32601,32602,32605,32606,33501,33502,33503,33504,33505,33506,
											|33507,33508,33509,33510,33511,33512,33513,33514,33622,33623,33624,33625,33626,33627,
											|33628,33650,33651,33652,33653,33654,33655,33656,38601,38602,38603,38604,38605,38606,
											|38607,38901,38902,38903,38904,38905,38906,38907,41101,41102,41401,41402,41601,41602,
											|41605,41606,42501,42502,42503,42504,42505,42506,42507,42508,42509,42510,42511,42512,
											|42513,42514,42622,42623,42624,42625,42626,42627,42627,42628,42650,42651,42652,42653,
											|42654,42655,42656,48601,48602,48603,48604,48605,48606,48607,48901,48902,48903,48904,
											|48905,48906,48907,83601,83602,83603,83604,83605,83606,83607,83801,83802,83803,83804,
											|83805,83806,83807";
	
	Запрос.УстановитьПараметр("ГФУДолговыхДоПогашения", 		СтрРазделить(СтрЗаменить(СтрокаГФУДолговыхДоПогашения, 			Символы.ПС, ""), 	",", Ложь));
	Запрос.УстановитьПараметр("ГФУДолговыхЧерезПрибыльУбыток", 	СтрРазделить(СтрЗаменить(СтрокаГФУДолговыхЧерезПрибыльУбыток, 	Символы.ПС, ""), 	",", Ложь));
	Запрос.УстановитьПараметр("ГФУДолевыхЧерезПрибыльУбыток", 	СтрРазделить(СтрЗаменить(СтрокаГФУДолевыхЧерезПрибыльУбыток, 	Символы.ПС, ""), 	",", Ложь));
	Запрос.УстановитьПараметр("ГФУДолговыхДляПродажи", 			СтрРазделить(СтрЗаменить(СтрокаГФУДолговыхДляПродажи, 			Символы.ПС, ""), 	",", Ложь));
	Запрос.УстановитьПараметр("ГФУДолговыхПоАмортизированной", 	СтрРазделить(СтрЗаменить(СтрокаГФУДолговыхПоАмортизированной, 	Символы.ПС, ""), 	",", Ложь));
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ДЗПоЦБКупонуИДивидендамВключатьВРазделыЦБ() 
	
	Возврат ЭтотОбъект.Период.ДатаНачала >= '20230101';

КонецФункции

Функция СтандартМСФОИзНастроек(Субъект, Отказ = Ложь) Экспорт
		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов КАК СтандартМСФО
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(&Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|						ТОГДА СчетДоверительногоУправления = &Субъект
		|					ИНАЧЕ СчетДоверительногоУправления.ДатаЗаключения < &Дата
		|							И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|								ИЛИ СчетДоверительногоУправления.ДатаРасторжения > &Дата)
		|							И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговора
		|				КОНЕЦ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкиУчетаОбщиеСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Организация = НастройкиУчетаОбщиеСрезПоследних.Организация
		|			И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(&Субъект) = ТИП(Справочник.ЮрФизЛица)
		|				ТОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Субъект
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов ЕСТЬ НЕ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлиентыДоверительногоУправленияСрезПоследних.Период УБЫВ");
	
	Запрос.УстановитьПараметр("Дата",			ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Субъект", 		Субъект);
	Запрос.УстановитьПараметр("ВидДоговора",	ЭтотОбъект.ВидДоговораДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.СтандартМСФО;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В регистре 'Настройки учета общие' отсутсвтуют настройки по портфелям клиента",,,, Отказ);
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Формирование_расшифровки

Функция ПолучитьВыборкуРасшифровкиЯчейки(ПолеРасшифровки, ДополнительныеДанные, ВариантФормы = Неопределено, МенеджерВременныхТаблиц = Неопределено) Экспорт
				
	// Текст запроса варьируется в зависимости от колонки
		
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено, Новый МенеджерВременныхТаблиц, МенеджерВременныхТаблиц);
	
	Если ПолеРасшифровки = "СредневзвешенныеВложения" Тогда
		
		#Область Средневзвешенные_вложения
		
		// Дополнительные данные: Актив,НомерБлока,Контрагент
						
		// Определяем имя таблицы, из которой брать данные для расшифровки		
		Если ДополнительныеДанные.НомерБлока = 21
				Или (ДополнительныеДанные.НомерБлока >= 1 И ДополнительныеДанные.НомерБлока <= 15) Тогда
				
			ИмяТаблицыРасшифровки = "_Средневзвешенные_ЦенныеБумаги_Развернуто";
				
		ИначеЕсли ДополнительныеДанные.НомерБлока = 16 
				Или ДополнительныеДанные.НомерБлока = 17 
				Или ДополнительныеДанные.НомерБлока = 18 Тогда
			
			ИмяТаблицыРасшифровки = "_Средневзвешенные_ДенежныеСредства_Развернуто";
			
		ИначеЕсли ДополнительныеДанные.НомерБлока = 19 Тогда
						
			ИмяТаблицыРасшифровки = "_Средневзвешенные_Депозиты_Развернуто";
			
		ИначеЕсли ДополнительныеДанные.НомерБлока = 23 Тогда
			
			ИмяТаблицыРасшифровки = "_Средневзвешенные_ДЗпоНКД_Развернуто";
			
		ИначеЕсли ДополнительныеДанные.НомерБлока = 26 
				Или ДополнительныеДанные.НомерБлока = 28 Тогда
			
			ИмяТаблицыРасшифровки = "_Средневзвешенные_СделкиРЕПО_Развернуто";
			
		Иначе
			
			ИмяТаблицыРасшифровки = "_Средневзвешенные_Задолженность_Развернуто";
			
		КонецЕсли;	
				
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&КлассАктива КАК КлассАктива,
			|	&ИдентификаторАктива КАК ИдентификаторАктива,
			|	_ТаблицаРасшифровки.Актив КАК Актив,
			|	_ТаблицаРасшифровки.Дата КАК Дата,
			|	_ТаблицаРасшифровки.Действие КАК Действие,
			|	СУММА(_ТаблицаРасшифровки.СправедливаяСтоимость) КАК СправедливаяСтоимость,
			|	СУММА(_ТаблицаРасшифровки.Поток) КАК Поток,
			|	СУММА(_ТаблицаРасшифровки.Количество) КАК Количество,
			|	_ТаблицаРасшифровки.ДнейВРаботе КАК ДнейВРаботе,
			|	_ТаблицаРасшифровки.ДнейВРаботе_Процент КАК ДнейВРаботе_Процент,
			|	СУММА(_ТаблицаРасшифровки.СредневзвешенныеВложения) КАК СредневзвешенныеВложения,
			|	ВЫБОР
			|		КОГДА _ТаблицаРасшифровки.Действие = ""(входящий остаток)""
			|			ТОГДА 0
			|		КОГДА _ТаблицаРасшифровки.Действие = ""(исходящий остаток)""
			|			ТОГДА 10
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Порядок
			|ИЗ
			|	&ИмяТаблицыРасшифровки КАК _ТаблицаРасшифровки
			|ГДЕ
			|	_ТаблицаРасшифровки.Актив В(&Актив)
			|	И &ДополнительноеУсловие
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаРасшифровки.Актив,
			|	_ТаблицаРасшифровки.Дата,
			|	_ТаблицаРасшифровки.Действие,
			|	_ТаблицаРасшифровки.ДнейВРаботе,
			|	_ТаблицаРасшифровки.ДнейВРаботе_Процент
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата,
			|	Порядок
			|ИТОГИ
			|	СУММА(Поток),
			|	СУММА(СредневзвешенныеВложения)
			|ПО
			|	ОБЩИЕ";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицыРасшифровки", ИмяТаблицыРасшифровки);
		
		// Дополнительные условия в зависимости от актива			
		Если (ДополнительныеДанные.НомерБлока = 25 
			Или ДополнительныеДанные.НомерБлока = 29) И Не ДополнительныеДанные.Актив = "Комиссии по сделкам" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноеУсловие", "_ТаблицаРасшифровки.Контрагент = &Контрагент");

			Запрос.УстановитьПараметр("Контрагент", ДополнительныеДанные.Контрагент);
			
		ИначеЕсли ИмяТаблицыРасшифровки = "_Средневзвешенные_ЦенныеБумаги_Развернуто" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноеУсловие", "_ТаблицаРасшифровки.УчетныйАктивЕПС = &КлассификацияАктива");
			
			Запрос.УстановитьПараметр("КлассификацияАктива", 	ДополнительныеДанные.КлассификацияАктива);
					
		Иначе 
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноеУсловие", "ИСТИНА");
			
		КонецЕсли;	
				
		Запрос.УстановитьПараметр("Актив", 					ДополнительныеДанные.Актив);
		Запрос.УстановитьПараметр("КлассАктива", 			ДополнительныеДанные.КлассАктива);
		Запрос.УстановитьПараметр("ИдентификаторАктива", 	ДополнительныеДанные.ИдентификаторАктива);
				
		Возврат Запрос.Выполнить().Выбрать();  		
		
		#КонецОбласти		
		
	ИначеЕсли ПолеРасшифровки = "ДоходыОтПродажи" 
		Или ПолеРасшифровки = "ПроцентныеДоходы"
		Или ПолеРасшифровки = "ДоходыОтПереоценки"
		Или ПолеРасшифровки = "ДоходыПрочие"
		Или ПолеРасшифровки = "ДоходыВсего" Тогда
		
		#Область Доходы_расходы
				
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&КлассАктива КАК КлассАктива,
			|	&ИдентификаторАктива КАК ИдентификаторАктива,
			|	_ТаблицаРасшифровки.ЦеннаяБумага КАК Актив,
			|	_ТаблицаРасшифровки.ВидЗадолженности КАК ВидЗадолженности,
			|	_ТаблицаРасшифровки.Контрагент КАК Контрагент,
			|	_ТаблицаРасшифровки.Регистратор КАК Регистратор,
			|	_ТаблицаРасшифровки.РазделОтчета КАК РазделОтчета,
			|	_ТаблицаРасшифровки.Дата КАК Дата,
			|	СУММА(_ТаблицаРасшифровки.ДоходРасход) КАК Сумма
			|ИЗ
			|	_ДоходыРасходыДляРасшифровки КАК _ТаблицаРасшифровки
			|ГДЕ
			|	_ТаблицаРасшифровки.ЦеннаяБумага В(&Актив)
			|	И _ТаблицаРасшифровки.НомерБлока = &НомерБлока
			|	И &УсловиеНаКолонку
			|	И &ДополнительноеУсловие
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаРасшифровки.ЦеннаяБумага,
			|	_ТаблицаРасшифровки.Регистратор,
			|	_ТаблицаРасшифровки.ВидЗадолженности,
			|	_ТаблицаРасшифровки.Контрагент,
			|	_ТаблицаРасшифровки.РазделОтчета,
			|	_ТаблицаРасшифровки.Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|ИТОГИ ПО
			|	ОБЩИЕ";		
		
		//// Дополнительные условия в зависимости от актива			
		Если (ДополнительныеДанные.НомерБлока = 25 
			Или ДополнительныеДанные.НомерБлока = 29) И Не ДополнительныеДанные.Актив = "Комиссии по сделкам" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноеУсловие", "_ТаблицаРасшифровки.Контрагент = &Контрагент");

			Запрос.УстановитьПараметр("Контрагент", ДополнительныеДанные.Контрагент);
							
		Иначе 
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноеУсловие", "ИСТИНА");
			
		КонецЕсли;	
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаКолонку", ?(ПолеРасшифровки = "ДоходыВсего", "ИСТИНА", "_ТаблицаРасшифровки.РазделОтчета = &РазделОтчета"));
				
		Запрос.УстановитьПараметр("Актив", 					ДополнительныеДанные.Актив);
		Запрос.УстановитьПараметр("КлассАктива", 			ДополнительныеДанные.КлассАктива);
		Запрос.УстановитьПараметр("ИдентификаторАктива", 	ДополнительныеДанные.ИдентификаторАктива);
		Запрос.УстановитьПараметр("НомерБлока", 			ДополнительныеДанные.НомерБлока);
		Запрос.УстановитьПараметр("РазделОтчета", 			ПолеРасшифровки);
		
		Возврат Запрос.Выполнить().Выбрать();  		
		
		#КонецОбласти	
		
	ИначеЕсли Лев(ПолеРасшифровки, 16) = "ОборотыПоСделкам" Тогда
		
		#Область Обороты_по_сделкам
		
		ТекстЗапроса = ЗаполнитьОборотыПоСделкам_ПолучитьТекстЗапроса();		
		ДополнитьТекстЗапросаТаблицейРасшифровки(ТекстЗапроса, ПолеРасшифровки);
		
		#КонецОбласти		
		
	ИначеЕсли Лев(ПолеРасшифровки, 18) = "ОплатаУслугБрокера" Тогда
		
		#Область Комиссия_брокера
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Отказ = Ложь;
		ДанныеПоКомиссиям(Запрос, Отказ);
		
		Если Отказ Тогда
			Возврат Неопределено;
		КонецЕсли;

		ТекстЗапроса = ЗаполнитьОплатыБрокеру_ПолучитьТекстЗапроса();
		ДополнитьТекстЗапросаТаблицейРасшифровки(ТекстЗапроса, ПолеРасшифровки);
				
		#КонецОбласти		
		
	ИначеЕсли ПолеРасшифровки = "ОплатаУслугБиржи" Тогда
		
		#Область Комиссия_биржи 		
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Отказ = Ложь;
		ДанныеПоКомиссиям(Запрос, Отказ);

		Если Отказ Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТекстЗапроса = ЗаполнитьОплатыБирже_ПолучитьТекстЗапроса(); 		
		ДополнитьТекстЗапросаТаблицейРасшифровки(ТекстЗапроса, ПолеРасшифровки);
			
		#КонецОбласти		
		
	Иначе
		
		#Область Остальные_расходы		
		
		ТекстЗапроса = ЗаполнитьРасходы_ПолучитьТекстЗапроса(ПолеРасшифровки);
		
		ТекстЗапроса = ТекстЗапроса + ";
		|";
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ПолеСуммы КАК Сумма,
		|	_ПрочиеРасходы.Период КАК Дата,
		|	_ПрочиеРасходы.Регистратор КАК Регистратор
		|ИЗ
		|	_ПрочиеРасходы КАК _ПрочиеРасходы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСуммы", "_ПрочиеРасходы." + ПолеРасшифровки);
		
		#КонецОбласти		
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	УстановитьОбщиеПараметрыЗапроса(Запрос);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ДополнитьТекстЗапросаТаблицейРасшифровки(ТекстЗапроса, ПолеРасшифровки) 
	
	СоответствиеКолонок = Новый Соответствие;
	СоответствиеКолонок.Вставить("ОборотыПоСделкам", 				"СуммаОборотДт");
	СоответствиеКолонок.Вставить("ОборотыПоСделкамБиржевым", 		"СуммаБиржевых");
	СоответствиеКолонок.Вставить("ОборотыПоСделкамНебиржевым", 		"СуммаВнебиржевых");
	СоответствиеКолонок.Вставить("ОплатаУслугБрокера", 				"ОплатаУслугБрокера");
	СоответствиеКолонок.Вставить("ОплатаУслугБрокераПоБиржевым", 	"ОплатаУслугБрокераПоБиржевым");
	СоответствиеКолонок.Вставить("ОплатаУслугБрокераПоНебиржевым", 	"ОплатаУслугБрокераПоНебиржевым");
	СоответствиеКолонок.Вставить("ОплатаУслугБиржи", 				"ОплатаУслугБиржи");
			
	НайдКолонка = СоответствиеКолонок.Получить(ПолеРасшифровки);
	Если НайдКолонка = Неопределено Тогда		
		Возврат;
	КонецЕсли;
	
	Если Лев(ПолеРасшифровки, 16) = "ОборотыПоСделкам" Тогда 
		
		// Обороты по сделкам обрабатываем отдельно, т. к. нужна колонка с ценными бумагами				
		ТекстЗапроса = ТекстЗапроса + "; 
		|";
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОборотыПоСделкам.Сделка КАК Регистратор,
		|	СУММА(&ПолеСуммы) КАК Сумма,
		|	_ОборотыПоСделкам.Сделка.Дата КАК Дата,
		|	_ОборотыПоСделкам.ДатаОперации КАК ДатаОперации,
		|	_ЦенныеБумагиСделок.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	_ОборотыПоСделкамРазвернутые КАК _ОборотыПоСделкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумагиСделок КАК _ЦенныеБумагиСделок
		|		ПО _ОборотыПоСделкам.Сделка = _ЦенныеБумагиСделок.Сделка
		|ГДЕ
		|	_ОборотыПоСделкам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И &ПолеСуммы <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОборотыПоСделкам.Сделка,
		|	_ОборотыПоСделкам.Сделка.Дата,
		|	_ОборотыПоСделкам.ДатаОперации,
		|	_ЦенныеБумагиСделок.ЦеннаяБумага
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОперации
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСуммы", "_ОборотыПоСделкам." + НайдКолонка);
		
	ИначеЕсли Лев(ПолеРасшифровки, 18) = "ОплатаУслугБрокера" Тогда 	
		
		ТекстЗапроса = ТекстЗапроса + "; 
		|";

		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(&ПолеСуммы) КАК Сумма,
		|	_Расшифровка.Регистратор КАК Регистратор,
		|	_Расшифровка.Период КАК Дата
		|ИЗ
		|	_ОплатыБрокеру КАК _Расшифровка
		|ГДЕ
		|	&ПолеСуммы <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	_Расшифровка.Регистратор,
		|	_Расшифровка.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСуммы", "_Расшифровка." + НайдКолонка);
		
	Иначе	
		      	
		ТекстЗапроса = ТекстЗапроса + "; 
		|";

		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(&ПолеСуммы) КАК Сумма,
		|	_Расшифровка.Регистратор КАК Регистратор,
		|	_Расшифровка.Период КАК Дата
		|ИЗ
		|	_ОплатыБиржи КАК _Расшифровка
		|ГДЕ
		|	&ПолеСуммы <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	_Расшифровка.Регистратор,
		|	_Расшифровка.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСуммы", "_Расшифровка." + НайдКолонка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

                                               