

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.ДатыЗапретаРедактирования) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует право доступа на редактирование дат запрета",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Организация = Параметры.Организация;
	
	Для каждого ЭлементСписка Из Параметры.СчетаДоверительногоУправления Цикл
		СчетаДоверительногоУправления.Добавить(ЭлементСписка.Значение, , ЭлементСписка.Пометка);
	КонецЦикла; 
	
	ИмяКолонки = Параметры.ИмяКолонки;
	
	Если ЗначениеЗаполнено(ИмяКолонки) Тогда
	
		Если ИмяКолонки = "БэкОфис" Тогда
			ГруппаЗапрета = Перечисления.ГруппыЗапретаРедактирования.БэкОфис;
		ИначеЕсли СтрНачинаетсяС(ИмяКолонки, "Партии") Тогда
			ГруппаЗапрета = Перечисления.ГруппыЗапретаРедактирования.Партии;
		ИначеЕсли СтрНачинаетсяС(ИмяКолонки, "Проводки") Тогда
			ГруппаЗапрета = Перечисления.ГруппыЗапретаРедактирования.Проводки;
		КонецЕсли; 
		
		Если ГруппаЗапрета = Перечисления.ГруппыЗапретаРедактирования.БэкОфис Тогда
			ВидУчета = Перечисления.ВидыУчета.ПустаяСсылка();
			Элементы.ВидУчета.Доступность = Ложь;
		ИначеЕсли СтрЗаканчиваетсяНа(ИмяКолонки, "БУ") Тогда
			ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет;
		ИначеЕсли СтрЗаканчиваетсяНа(ИмяКолонки, "НУ") Тогда
			ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет;
		ИначеЕсли СтрЗаканчиваетсяНа(ИмяКолонки, "ЕПС") Тогда
			ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
		КонецЕсли; 
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаЗапрета) Тогда
	
		ЭтаФорма.ТекущийЭлемент = Элементы.ДатаЗапретаРедактирования;
	
	КонецЕсли; 
	
	ЭтаФорма.Ответственный = РаботаСПользователями.ТекущийПользователь();
	
	ЭтаФорма.КоличествоСчетовДоверительногоУправления = ПолучитьКоличествоСчетовДоверительногоУправления(ЭтаФорма.СчетаДоверительногоУправления);
	
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппаЗапретаПриИзменении(Элемент)
	Если ЭтаФорма.ГруппаЗапрета = ПредопределенноеЗначение("Перечисление.ГруппыЗапретаРедактирования.БэкОфис") Тогда
		ЭтаФорма.ВидУчета = Неопределено;
		Элементы.ВидУчета.Доступность = Ложь;
	Иначе
		Элементы.ВидУчета.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СчетаДоверительногоУправленияПриИзменении(Элемент)
	
	ЭтаФорма.КоличествоСчетовДоверительногоУправления = ПолучитьКоличествоСчетовДоверительногоУправления(ЭтаФорма.СчетаДоверительногоУправления);
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ГруппаЗапрета = ПредопределенноеЗначение("Перечисление.ГруппыЗапретаРедактирования.Партии") Тогда
		
		ДанныеПроверки = Новый Структура("Организация, ВидУчета, ДатаЗапретаРедактирования", 
			ЭтотОбъект.Организация, ЭтотОбъект.ВидУчета, ЭтотОбъект.ДатаЗапретаРедактирования);
		
		Для каждого СчетДоверительногоУправления Из СчетаДоверительногоУправления Цикл
		
			ДанныеПроверки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления.Значение);
		    Если НЕ РаботаСФормамиКлиент.МожноПередвинутьВпередДатаЗапретаПартий(ДанныеПроверки) Тогда
				Возврат;
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	Если ЗаписатьИЗакрытьНаСервере() Тогда
		Оповестить("ОбновленыДатыЗапретаРедактирования"); 
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаписатьИЗакрытьНаСервере()

	ТаблицаДляПроверки = РегистрыСведений.ДатыЗапретаРедактирования.ПолучитьСтруктуруТаблицыЗначенийДляПроверки();
	
	Для Каждого ЭлементСписка Из СчетаДоверительногоУправления Цикл
		
		Если ЭлементСписка.Пометка Тогда
			НоваяСтрока = ТаблицаДляПроверки.Добавить();
			НоваяСтрока.Организация						= ЭтаФорма.Организация;
			НоваяСтрока.СчетДоверительногоУправления	= ЭлементСписка.Значение;
			НоваяСтрока.ВидУчета						= ЭтаФорма.ВидУчета;
			НоваяСтрока.ГруппаЗапрета					= ЭтаФорма.ГруппаЗапрета;
			НоваяСтрока.ДатаЗапретаРедактирования		= ЭтаФорма.ДатаЗапретаРедактирования;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ РегистрыСведений.ДатыЗапретаРедактирования.ПроверитьКорректностьДатЗапретаРедактирования(Организация, ТаблицаДляПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого ЭлементСписка Из ЭтаФорма.СчетаДоверительногоУправления Цикл
		Если ЭлементСписка.Пометка Тогда
			
			НаборЗаписей = РегистрыСведений.ДатыЗапретаРедактирования.СоздатьНаборЗаписей();
			НаборЗаписей.ДополнительныеСвойства.Вставить("ИнтерактивнаяУстановкаДатыЗапрета");
			
			НаборЗаписей.Отбор.Организация.Установить(ЭтаФорма.Организация);
			НаборЗаписей.Отбор.СчетДоверительногоУправления.Установить(ЭлементСписка.Значение);
			НаборЗаписей.Отбор.ГруппаЗапрета.Установить(ЭтаФорма.ГруппаЗапрета);
			НаборЗаписей.Отбор.ВидУчета.Установить(ЭтаФорма.ВидУчета);
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЭтаФорма);
			Запись.СчетДоверительногоУправления = ЭлементСписка.Значение;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать даты запрета редактирования из-за ошибки:" + Символы.ПС + ОписаниеОшибки());
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоСчетовДоверительногоУправления(СчетаДоверительногоУправления)

	КоличествоСчетовДоверительногоУправления = 0;
	Для каждого ЭлементСписка Из СчетаДоверительногоУправления Цикл
		Если ЭлементСписка.Пометка Тогда
			КоличествоСчетовДоверительногоУправления = КоличествоСчетовДоверительногоУправления + 1;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат КоличествоСчетовДоверительногоУправления;

КонецФункции
 

#КонецОбласти 



