
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Очищаем неиспользуемые ресурсы по условиям
	Для Каждого Запись Из ЭтотОбъект Цикл

		Если Запись.ИспользоватьНастройкиУчетнойПолитикиЕПС = Истина Тогда
				
			Если ЗначениеЗаполнено(Запись.ВариантРасчетаПроцентовПоСделкамРЕПО) Тогда
				Запись.ВариантРасчетаПроцентовПоСделкамРЕПО = Неопределено;
			КонецЕсли;
			
			Если Запись.ТочностьРасчетнойСтавкиРЕПО <> 0 Тогда
				Запись.ТочностьРасчетнойСтавкиРЕПО = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Запись.КритерийСущественностиОтклоненияССТПлюс) Тогда
				Запись.КритерийСущественностиОтклоненияССТПлюс = 0;
			КонецЕсли;
			
		КонецЕсли;	 
				
		Если Запись.ВариантРасчетаПроцентовПоСделкамРЕПО <> Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРасчетнойСтавке Тогда
						 
			Если Запись.ТочностьРасчетнойСтавкиРЕПО <> 0 Тогда
				Запись.ТочностьРасчетнойСтавкиРЕПО = 0;
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДатаНачалаИспользованияНастроекУчетнойПолитикиЕПСПриРасчетеПроцентовПоРЕПО = РегистрыСведений.НастройкиФормированияСЧА.ДатаНачалаИспользованияНастроекУчетнойПолитикиЕПСПриРасчетеСЧА();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Период < ДатаНачалаИспользованияНастроекУчетнойПолитикиЕПСПриРасчетеПроцентовПоРЕПО
			Или Запись.ИспользоватьНастройкиУчетнойПолитикиЕПС = Истина Тогда
			
			Если ПроверяемыеРеквизиты.Найти("ВариантРасчетаПроцентовПоСделкамРЕПО") <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВариантРасчетаПроцентовПоСделкамРЕПО"));
			КонецЕсли;
			
		КонецЕсли;	 
			
		Если Запись.ВариантРасчетаПроцентовПоСделкамРЕПО <> Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРасчетнойСтавке Тогда
						 
			Если ПроверяемыеРеквизиты.Найти("ТочностьРасчетнойСтавкиРЕПО") <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТочностьРасчетнойСтавкиРЕПО"));
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
