
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СчетВнутреннегоУчета = ПараметрКоманды;	
	
	СведенияОДоговорах = СформироватьОтчетСведенияОДоговорах(СчетВнутреннегоУчета, ТекущаяДата());
	Если СведенияОДоговорах <> Неопределено Тогда
		СведенияОДоговорах.Показать("Сведения о договорах '" + Строка(СчетВнутреннегоУчета) + "'");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСведенияОДоговорах(СчетВнутреннегоУчета, Период)	
	СхемаКомпоновкиДанных = Справочники.СчетаДоверительногоУправления.ПолучитьМакет("МакетСведенияОДоговорахКлиента");
	
	НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", СчетВнутреннегоУчета);
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	// Заполняем настройки печати по умолчанию
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, "Справочник.СчетаДоверительногоУправления.СведенияОДоговорах", Истина, ОриентацияСтраницы.Ландшафт);		
	
	Возврат ДокументРезультат;	
КонецФункции
