// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, 
		"Оповещение об истечении срока первого ввода активов", 
		"0.06", 
		"", 
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеОбИстеченииСрокаПервогоВводаАктивовРЭМ", "Оповещение об истечении срока первого ввода активов РЭМ",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если Найти(ИдентификаторКоманды, "ОповещениеОбИстеченииСрокаПервогоВводаАктивов") = 1  Тогда
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		Попытка
			Период						= НачалоДня(ТекущаяДата()); 
			Организация					= ПараметрыКоманды.Организация;
			ПолучателиПредупреждения	= ПараметрыКоманды.ПолучателиПредупреждения;
			ПолучателиУведомления		= ПараметрыКоманды.ПолучателиОповещения;
			
			ВыполнитьОповещение(ПолучателиПредупреждения, ПолучателиУведомления, ПараметрыСессии);
		Исключение
			ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ЗарегистрироватьОшибку(ТекстОшибки, ПараметрыСессии = Неопределено)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

Процедура ОтправитьПисьмо(Содержание, Получатели, Тема, УчетнаяЗапись, ПараметрыСессии = Неопределено)
	
	Если Содержание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
	
	Попытка
		Содержание.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
	Исключение
		
		ЗарегистрироватьОшибку("Не удалось сформировать сообщение из-за ошибки:" + Символы.ПС + ОписаниеОшибки(), ПараметрыСессии);
		
		Возврат;
		
	КонецПопытки;
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", Получатели, Тема, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
	
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	
КонецПроцедуры

Процедура ВыполнитьОповещение(ПолучателиПредупреждения, ПолучателиУведомления, ПараметрыСессии = Неопределено) Экспорт
	
	// Письмо о приближении срока в 30.
	ПредупреждениеОПриблеженииСрока	= Неопределено;
	// Письмо об истечении срока в 30 дней.
	УведомлениеОбИстеченииСрока	= Неопределено;
	
	ЗаполнитьОтчет(ПредупреждениеОПриблеженииСрока, УведомлениеОбИстеченииСрока);
	
	УчетнаяЗапись = РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись();
	
	Если ПредупреждениеОПриблеженииСрока <> Неопределено Тогда
		ОтправитьПисьмо(ПредупреждениеОПриблеженииСрока, ПолучателиПредупреждения, "Предупреждение об истечении срока первого ввода активов", УчетнаяЗапись, ПараметрыСессии);
	КонецЕсли;
	
	Если УведомлениеОбИстеченииСрока <> Неопределено Тогда
		ОтправитьПисьмо(УведомлениеОбИстеченииСрока, ПолучателиУведомления, "Истек срок первого ввода активов", УчетнаяЗапись, ПараметрыСессии);
	КонецЕсли;
	
	ОповеститьОбОшибках();
	
КонецПроцедуры	

Процедура ЗаполнитьОтчет(ПредупреждениеОПриблеженииСрока, УведомлениеОбИстеченииСрока) Экспорт
	
	Макет = ПолучитьМакет("Макет");
	//ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	//ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	//ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДУ,
		|	30 - РАЗНОСТЬДАТ(СчетаДоверительногоУправления.ДатаЗаключения, &Период, ДЕНЬ) КАК ОсталосьДней,
		|	СчетаДоверительногоУправления.Представление КАК Представление,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&Период, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	(СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|			ИЛИ СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Стандартная)
		|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
		|	И СчетаДоверительногоУправления.ДатаЗаключения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &Период)
		|	И (РАЗНОСТЬДАТ(СчетаДоверительногоУправления.ДатаЗаключения, &Период, ДЕНЬ) = 16
		|			ИЛИ РАЗНОСТЬДАТ(СчетаДоверительногоУправления.ДатаЗаключения, &Период, ДЕНЬ) = 23
		|			ИЛИ РАЗНОСТЬДАТ(СчетаДоверительногоУправления.ДатаЗаключения, &Период, ДЕНЬ) >= 30)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления КАК СчетДУ
		|ПОМЕСТИТЬ _СчетаДУСОборотами
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|ГДЕ
		|	ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
		|	И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДУ.СчетДУ КАК СчетДУ
		|			ИЗ
		|				_СчетаДУ КАК _СчетаДУ)
		|	И ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУ.СчетДУ КАК СчетДУ,
		|	_СчетаДУ.Представление КАК Представление,
		|	_СчетаДУ.НомерДоговора КАК НомерДоговора,
		|	_СчетаДУ.ОсталосьДней КАК ОсталосьДней
		|ПОМЕСТИТЬ _СчетаДУКРассылке
		|ИЗ
		|	_СчетаДУ КАК _СчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДУСОборотами КАК _СчетаДУСОборотами
		|		ПО _СчетаДУ.СчетДУ = _СчетаДУСОборотами.СчетДУ
		|ГДЕ
		|	_СчетаДУСОборотами.СчетДУ ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсталосьДней
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУКРассылке.СчетДУ КАК СчетДУ,
		|	_СчетаДУКРассылке.Представление КАК Представление,
		|	_СчетаДУКРассылке.НомерДоговора КАК НомерДоговора,
		|	_СчетаДУКРассылке.ОсталосьДней КАК ОсталосьДней
		|ИЗ
		|	_СчетаДУКРассылке КАК _СчетаДУКРассылке
		|ГДЕ
		|	(_СчетаДУКРассылке.ОсталосьДней = 7
		|			ИЛИ _СчетаДУКРассылке.ОсталосьДней = 14)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУКРассылке.СчетДУ КАК СчетДУ,
		|	_СчетаДУКРассылке.Представление КАК Представление,
		|	_СчетаДУКРассылке.НомерДоговора КАК НомерДоговора
		|ИЗ
		|	_СчетаДУКРассылке КАК _СчетаДУКРассылке
		|ГДЕ
		|	_СчетаДУКРассылке.ОсталосьДней <= 0";
	
	Запрос.УстановитьПараметр("Период",			Период);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	МассивРезультатовЗапросов = Запрос.ВыполнитьПакет();
	
	// Формируем предупреждение о приближении срока.
	СчетаДУДляПредупреждения = МассивРезультатовЗапросов[3].Выбрать();
	
	Если СчетаДУДляПредупреждения.Количество() > 0 Тогда
		СформироватьПисьмо(ПредупреждениеОПриблеженииСрока,
							Макет,
							"По следующим ИИС еще не были введены активы:",
							СчетаДУДляПредупреждения,
							Истина);
	КонецЕсли;
	
	// Формируем уведомление об истечении срока.
	СчетаДУДляУведомления = МассивРезультатовЗапросов[4].Выбрать();
	
	Если СчетаДУДляУведомления.Количество() > 0 Тогда
		СформироватьПисьмо(УведомлениеОбИстеченииСрока,
							Макет,
							"По следующим ИИС истек срок первого ввода активов:",
							СчетаДУДляУведомления);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПисьмо(Письмо, Макет, Заголовок, СписокСчетовДУ, ВыводитьОстатокСрока = Ложь)
	
	Письмо = Новый ТабличныйДокумент;
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	
	ОбластьЗаголовок.Параметры.Заголовок = Заголовок;
	Письмо.Вывести(ОбластьЗаголовок);
	
	Пока СписокСчетовДУ.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(СписокСчетовДУ);
		
		Если ВыводитьОстатокСрока Тогда
			ОбластьСтрока.Параметры.ОсталосьДней = "До истечения срока первого ввода активов осталось " + Строка(СписокСчетовДУ.ОсталосьДней) + РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(СписокСчетовДУ.ОсталосьДней, " день.", " дня.", " дней.");
		КонецЕсли;
		
		Письмо.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки) Экспорт

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",       Сессия);
	ПараметрыСессии.Вставить("ДопПараметры", Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",  Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;





