
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ЗначенияЗаполнения") И ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("Владелец") Тогда
		ЭтаФорма.Владелец = ЭтаФорма.Параметры.ЗначенияЗаполнения.Владелец;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДепозитныеВклады = ПолучитьДепозитныеВкладыПоБанковскомуСчету(Объект.БанковскийСчет, Объект.Ссылка);
	
	Если ДепозитныеВклады.Количество() > 0 Тогда
		
		Если Вопрос(СтрШаблон("На банковском счёте %1 ранее уже были размещены депозиты. Показать их?", Объект.БанковскийСчет), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			ОткрытьФормуМодально("Справочник.ДепозитныеВклады.ФормаСписка", Новый Структура("Отбор",  Новый Структура("Ссылка", ДепозитныеВклады)));
			
		КонецЕсли;
		
		Если Вопрос("Записать депозитный вклад?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
	Если НЕ БанковскийСчетДепозитногоВклада(Объект.БанковскийСчет) Тогда
		Результат = Вопрос("Номер банковского счета не соответствует виду 'счёт депозитного вклада'. Отменить ввод?", РежимДиалогаВопрос.ДаНет);
		Если Результат <> КодВозвратаДиалога.Нет Тогда
			Объект.БанковскийСчет = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПриИзменении(Элемент)
	
	Если Не ЭтаФорма.Подтверждение Тогда
		Объект.НомерПодтверждения = Неопределено;
		Объект.ДатаПодтверждения  = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРегистрацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаРегистрации) Тогда
		
		ПланируемаяДатаНачалаНачисленияПроцентов = Объект.ДатаРегистрации + 86400;
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаНачисленияПроцентов) Тогда
			Объект.ДатаНачалаНачисленияПроцентов = ПланируемаяДатаНачалаНачисленияПроцентов;
		ИначеЕсли Объект.ДатаНачалаНачисленияПроцентов <> ПланируемаяДатаНачалаНачисленияПроцентов Тогда
			Если Вопрос("Изменить дату начала начисления процентов на " + Формат(ПланируемаяДатаНачалаНачисленияПроцентов, "ДФ=dd.MM.yyyy") + "?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.ДатаНачалаНачисленияПроцентов = ПланируемаяДатаНачалаНачисленияПроцентов;
			КонецЕсли; 
		КонецЕсли; 
		
		ЭтаФорма.КоличествоДнейВклада = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(ЭтаФорма.ДатаПогашения, Объект.ДатаРегистрации);
		
	Иначе	
		
		ЭтаФорма.КоличествоДнейВклада = Неопределено;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НомерПодтвержденияПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПодтвержденияПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура БиржевойПриИзменении(Элемент)
	
	Объект.МестоХранения = ?(ЭтаФорма.Биржевой, ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК"), Неопределено);
	
	ЭтаФорма.Подтверждение		= Неопределено;
	Объект.НомерПодтверждения	= Неопределено;
	Объект.ДатаПодтверждения	= Неопределено;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура РассчитатьВыплаты(Команда)
	
	Если Объект.ПлановыеВыплаты.Количество() > 0 Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьВыплатыЗавершение", ЭтотОбъект), "Таблица ""Плановые выплаты"" будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет); 
		
	Иначе
		
		РассчитатьВыплатыНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВыплатыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да  Тогда
		
		РассчитатьВыплатыНаСервере();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РассчитатьВыплатыНаСервере()
	
	Объект.ПлановыеВыплаты.Загрузить(Справочники.ДепозитныеВклады.ПолучитьРасчетВыплат(Объект.Ссылка));
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(Объект.Ссылка));
	
	ЭтаФорма.Биржевой				= ЗначениеЗаполнено(Объект.МестоХранения);
	ЭтаФорма.Подтверждение			= ЗначениеЗаполнено(Объект.НомерПодтверждения);
	ЭтаФорма.КоличествоДнейВклада	= ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(ЭтаФорма.ДатаПогашения, Объект.ДатаРегистрации);
	
	ЭтаФорма.Владелец =
		?(ЗначениеЗаполнено(Объект.БанковскийСчет),
			Объект.БанковскийСчет.ЮрФизЛицо,
			?(ЗначениеЗаполнено(ЭтаФорма.Владелец),
				ЭтаФорма.Владелец, ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация").ЮрФизЛицо));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)
	
	Элементы = ЭтаФорма.Элементы;
	Объект	 = ЭтаФорма.Объект;
	
	Элементы.Подтверждение.ТолькоПросмотр = ЭтаФорма.Биржевой;
	
	Элементы.ГруппаРеквизитыПодтверждения.Видимость	= ЭтаФорма.Подтверждение;
	Элементы.МестоХранения.Видимость				= ЭтаФорма.Биржевой;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДепозитныеВкладыПоБанковскомуСчету(БанковскийСчет, ИсключаяДепозитныйВклад)
	
	Возврат Справочники.ДепозитныеВклады.ПолучитьДепозитныеВкладыПоБанковскомуСчету(БанковскийСчет, ИсключаяДепозитныйВклад);
	
КонецФункции

&НаСервереБезКонтекста
Функция БанковскийСчетДепозитногоВклада(БанковскийСчет)
	
	Возврат Справочники.БанковскиеСчета.БанковскийСчетДепозитногоВклада(БанковскийСчет);
	
КонецФункции

#КонецОбласти
