
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, "Запись", "ИсходныйКлючЗаписи", Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ФормулаРасчетаСтавкиНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// Выбор действия
	
	Если ЗначениеЗаполнено(Запись.ФормулаРасчетаСтавки) Тогда
	
		Меню = Новый СписокЗначений;
		Меню.Добавить("Открыть");
		Меню.Добавить("Изменить");
		
		ВыбранныйПункт = ВыбратьИзМеню(Меню, Элемент);
		
		Действие = ?(ВыбранныйПункт = Неопределено, Неопределено, ВыбранныйПункт.Значение);
		
	Иначе
		
		Действие = "Изменить";
		
	КонецЕсли;
	
	// Открытие формулы
	
	Если Действие = "Открыть" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Запись.ФормулаРасчетаСтавки);
		
		ОткрытьФормуМодально("Справочник.НастройкиРасчета.ФормаОбъекта", ПараметрыФормы, Элемент);
	
		ОбновитьПредставлениеФормулыРасчетаСтавки(ЭтаФорма);
		
	ИначеЕсли Действие = "Изменить" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор",		 Новый Структура("Облигация, НомерКупона", Запись.Облигация, Запись.НомерКупона));
		ПараметрыФормы.Вставить("ТекущаяСтрока", ПолучитьКлючЗаписиФормулыРасчетаСтавки(Запись.Облигация, Запись.НомерКупона));
		
		ОписаниеОповещенияОЗакрытииОкнаФормул = Новый ОписаниеОповещения("ПриЗакрытииОкнаФормулРасчетаСтавкиКупона", ЭтаФорма);
		
		ОткрытьФорму("РегистрСведений.ФормулыРасчетаСтавокКупонов.ФормаСписка", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещенияОЗакрытииОкнаФормул, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОбновитьДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ОбновитьПредставлениеФормулыРасчетаСтавки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(НеСообщатьОбИзмененииОбъектов = Неопределено, НеСообщатьОбОтсутствииИзменений = Неопределено)

	РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Запись.Облигация, , , НеСообщатьОбИзмененииОбъектов, НеСообщатьОбОтсутствииИзменений);
		
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

#Область Настройка_формулы_расчета_ставки_купона

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеФормулыРасчетаСтавки(Форма)
	
	Форма.ФормулаРасчетаСтавки = ?(ЗначениеЗаполнено(Форма.Запись.ФормулаРасчетаСтавки), Форма.Запись.ФормулаРасчетаСтавки, "Не задана");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиФормулыРасчетаСтавки(Облигация, НомерКупона)
	
	ЗначенияКлюча = Новый Структура("Облигация, НомерКупона", Облигация, НомерКупона);
	
	ПоследниеЗаписи = РегистрыСведений.ФормулыРасчетаСтавокКупонов.СрезПоследних(ТекущаяДата(), ЗначенияКлюча);
	Если ПоследниеЗаписи.Количество() > 0 Тогда
		ЗначенияКлюча.Вставить("Период", ПоследниеЗаписи[0].Период);
	КонецЕсли;
	
	КлючЗаписи = РегистрыСведений.ФормулыРасчетаСтавокКупонов.СоздатьКлючЗаписи(ЗначенияКлюча); 
	
	Возврат КлючЗаписи;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФормулуРасчетаСтавки(Облигация, НомерКупона)
	
	ДействующаяЗапись = РегистрыСведений.ФормулыРасчетаСтавокКупонов.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Облигация, НомерКупона", Облигация, НомерКупона));

	ФормулаРасчета = ?(ДействующаяЗапись.Действует, ДействующаяЗапись.ФормулаРасчетаСтавки, Справочники.НастройкиРасчета.ПустаяСсылка()); 	
	
	Возврат ФормулаРасчета;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииОкнаФормулРасчетаСтавкиКупона(Результат, Параметры) Экспорт
	
	ДействущееЗначение = ПолучитьФормулуРасчетаСтавки(Запись.Облигация, Запись.НомерКупона); 
	
	Если Запись.ФормулаРасчетаСтавки <> ДействущееЗначение Тогда
		
		Ответ = Вопрос("Формула расчета ставки изменилась. Обновить данные?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОбновитьДанные(Истина, Истина);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 