
Процедура УстановитьНоминалКредитногоИнструмента(ЭтотОбъект) Экспорт
	
	ЭтотОбъект.Движения.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК Период,
		|	&Регистратор КАК Регистратор,
		|	&КредитныйИнструмент КАК КредитныйИнструмент,
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток, 0) КАК Сумма,
		|	&Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(&ГраницаВключая, КредитныйИнструмент = &КредитныйИнструмент) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПоследних(&ГраницаИсключая, КредитныйИнструмент = &КредитныйИнструмент) КАК НоминалыКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = НоминалыКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток, 0) <> ЕСТЬNULL(НоминалыКредитныхИнструментовСрезПоследних.Сумма, 0)";
		
	Запрос.УстановитьПараметр("ГраницаВключая"	, 		Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Включая));	
	Запрос.УстановитьПараметр("ГраницаИсключая"	, 		Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));	
	Запрос.УстановитьПараметр("Период"			, 		ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Регистратор"		, 		ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("КредитныйИнструмент"	, 	РаботаСКредитнымиИнструментами.ПолучитьКредитныйИнструмент(ЭтотОбъект));
	Запрос.УстановитьПараметр("Организация"		, 		ЭтотОбъект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Движения.НоминалыКредитныхИнструментов.Добавить(), Выборка);
	КонецЦикла;
	
	ЭтотОбъект.Движения.НоминалыКредитныхИнструментов.Записывать = Истина;
	
КонецПроцедуры
	
	
	