
Функция ПолучитьЗадействованныеВНаименованииРеквизиты(Ссылка) Экспорт
	Перем ЗадействованныеРеквизиты;
	
	ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка).СформироватьНаименование(, ЗадействованныеРеквизиты);
	
	Возврат ЗадействованныеРеквизиты;
	
КонецФункции // ПолучитьЗадействованныеВНаименованииРеквизиты

Функция СформироватьНаименование(Ссылка, Реквизиты) Экспорт
	
	Возврат ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка).СформироватьНаименование(Реквизиты);
	
КонецФункции // СформироватьНаименование

////////////////////////////////////////////////////////////////////////////////

Функция УстановитьПараметрСеансаТекущаяОрганизация(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ТекущаяОрганизация = Организация;
	
КонецФункции // УстановитьПараметрСеансаТекущаяОрганизация

Процедура УстановитьПараметрСеансаКонтрольДоступаКСчетамДоверительногоУправления(КонтрольДоступа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.КонтрольДоступаКСчетамДоверительногоУправления = КонтрольДоступа;
	
КонецПроцедуры

Процедура УстановитьПараметрСеансаДоступныВсеСчетаДоверительногоУправления(КонтрольДоступа) Экспорт
	
	Если НЕ КонтрольДоступа Тогда
		ПараметрыСеанса.ДоступныВсеСчетаДоверительногоУправления = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	ПараметрыСеанса.ТекущаяОрганизация);
	Запрос.УстановитьПараметр("Пользователь",	ПараметрыСеанса.ТекущийПользователь);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И НЕ СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					ДоступныеСчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					РегистрСведений.ДоступныеСчетаДоверительногоУправления КАК ДоступныеСчетаДоверительногоУправления
		|				ГДЕ
		|					ДоступныеСчетаДоверительногоУправления.Организация = &Организация
		|					И ДоступныеСчетаДоверительногоУправления.Пользователь = &Пользователь)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПараметрыСеанса.ДоступныВсеСчетаДоверительногоУправления = Ложь;
	Иначе
		ПараметрыСеанса.ДоступныВсеСчетаДоверительногоУправления = Истина;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПроверкаНаНаличиеФункциональнойРоли(ФункциональнаяРоль, Отказ) Экспорт
	
	// проверим возможность выбора юр. лица в данной функциональной роли
	Если Не МонопольныйРежим() Тогда
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник." + ФункциональнаяРоль.Метаданные().Имя);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		БлокировкаДанных.Заблокировать();
	КонецЕсли;
	
	ОписаниеПричины = "";
	
	Если Не Справочники.ЮрФизЛица.ФункциональнаяРольДоступна(ФункциональнаяРоль, ОписаниеПричины) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеПричины, ФункциональнаяРоль, "ЮрФизЛицо",, Отказ);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьЮрФизЛицоСчетаДоверительногоУправления(СчетДоверительногоУправления, Период) Экспорт
	                                                                         
	Если Не ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		Возврат Справочники.ЮрФизЛица.ПустаяСсылка();
	КонецЕсли;
	
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период);
	
	Если      ТипЗнч(Клиент) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		Возврат Клиент;
	ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		Возврат Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФНаДату(Период, Клиент);
	КонецЕсли;
	
	Возврат Справочники.ЮрФизЛица.ПустаяСсылка();
	
КонецФункции // ПолучитьЮрФизЛицоСчетаДоверительногоУправления

Функция ПолучитьЮрФизЛицоКлиента(Клиент, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат Справочники.ЮрФизЛица.ПустаяСсылка();
	КонецЕсли;
	
	Если      ТипЗнч(Клиент) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		Возврат Клиент;
	ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		Возврат Клиент;
	ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		Возврат ПолучитьЮрФизЛицоСчетаДоверительногоУправления(Клиент, Период);
	КонецЕсли;
	
	Возврат Справочники.ЮрФизЛица.ПустаяСсылка();
	
КонецФункции // ПолучитьЮрФизЛицоКлиента

Процедура ВывестиРеквизитыЮрФизЛица(ЮрФизЛицо, Форма, ИмяГруппыВладельца, ИспользоватьАнкетныеДанные = Ложь, КонтактныеЛица = Ложь, КонтактнаяИнформация = Ложь, КвалифицированныеИнвесторы = Ложь, Организация = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли;
	
	ИменаГруппДанных = Новый Структура("ПИФ, ЮрЛицо, ФизЛицо",
	"ДанныеКлиентаПИФа", "ДанныеКлиентаЮрЛица", "ДанныеКлиентаФизЛица");
	
	ТипЮрФизЛица = ТипЗнч(ЮрФизЛицо);
	
	// определим набор имен реквизитов (имена элементов формы будут идентичными),
	// которые потребуются для отображения сведений о юр. или  физ. лице или ПИФ-е
	ОписаниеНовыхРеквизитов = Новый Массив();
	
	Если      ТипЮрФизЛица = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		ОписаниеНовыхРеквизитов.Добавить(
			Новый Структура("Имя, Синоним, Тип",
				"ТипПИФа", "Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПифовВЗависимостиОтЛиквидности")));
		
		ОписаниеНовыхРеквизитов.Добавить(
			Новый Структура("Имя, Синоним, Тип",
				"КатегорияПИФа", "Категория", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииПИФовВЗависимостиОтОбъектаИнвестирования")));
		
		ОписаниеНовыхРеквизитов.Добавить(
			Новый Структура("Имя,Синоним,Тип",
				"ПравилаПИФа", "Правила", Новый ОписаниеТипов("Строка")));
		
		Для каждого РесурсРегистра Из Метаданные.РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.Ресурсы Цикл
			ОписаниеНовыхРеквизитов.Добавить(
				Новый Структура("Имя, Синоним, Тип",
					"ПИФ" + РесурсРегистра.Имя, РесурсРегистра.Синоним, РесурсРегистра.Тип));
		КонецЦикла;
		
		ИмяГруппыДанных = ИменаГруппДанных.ПИФ;
		
	ИначеЕсли ТипЮрФизЛица = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		Если      ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
			ИмяГруппыДанных        = ИменаГруппДанных.ЮрЛицо;
			ИмяРегистра            = "РеквизитыЮридическихЛиц" + ?(ИспользоватьАнкетныеДанные, "Анкетные","");
			ПрефиксИмениРеквизитов = "ЮрЛицо";
		ИначеЕсли ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
			ИмяГруппыДанных        = ИменаГруппДанных.ФизЛицо;
			ИмяРегистра            = "РеквизитыФизическихЛицАнкетные";
			ПрефиксИмениРеквизитов = "ФизЛицо";
			
			ОписаниеНовыхРеквизитов.Добавить(
				Новый Структура("Имя,Синоним,Тип",
					"ФизЛицоДатаПолученияДокументовОСмерти", "Дата получения документов", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата))));
			
		Иначе
			Возврат;			
		КонецЕсли;
		
		Для каждого РесурсРегистра Из Метаданные.РегистрыСведений[ИмяРегистра].Ресурсы Цикл
			ОписаниеНовыхРеквизитов.Добавить(
				Новый Структура("Имя, Синоним, Тип",
					ПрефиксИмениРеквизитов + РесурсРегистра.Имя, РесурсРегистра.Синоним, РесурсРегистра.Тип));
		КонецЦикла;
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	// проверим, была ли создана группа, содержащая реквизиты юр./физ. лица или ПИФ-а
	// и создадим её при отсутствии
	ТолькоОбновлениеДанных = Истина;
	
	ГруппаРеквизитов = Форма.Элементы.Найти(ИмяГруппыДанных);
	Если ГруппаРеквизитов = Неопределено Тогда
		ГруппаРеквизитов = Форма.Элементы.Добавить(ИмяГруппыДанных, Тип("ГруппаФормы"), Форма.Элементы[ИмяГруппыВладельца]);
		// Только просмотр настраиваем отдельно для каждой подчиненной страницы
		ГруппаРеквизитов.ТолькоПросмотр = Ложь;
		ГруппаРеквизитов.Вид            = ВидГруппыФормы.Страницы;
		
		ТолькоОбновлениеДанных = Ложь;
	КонецЕсли;
	
	// настроим видимость групп
	Для каждого КлючЗнч Из ИменаГруппДанных Цикл
		ГруппаФормы = Форма.Элементы.Найти(КлючЗнч.Значение);
		Если ГруппаФормы <> Неопределено Тогда
			ГруппаФормы.Видимость = (КлючЗнч.Значение = ИмяГруппыДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТолькоОбновлениеДанных Тогда
		// создадим реквизиты
		ДобавляемыеРеквизиты = Новый Массив();
		
		Для каждого ОписаниеРеквизита Из ОписаниеНовыхРеквизитов Цикл
			НовыйРеквизит = Новый РеквизитФормы(ОписаниеРеквизита.Имя, ОписаниеРеквизита.Тип,, ОписаниеРеквизита.Синоним, Ложь);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		КонецЦикла;
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		// Сначала выводим недоступные для редактирования страницы
		ТолькоПросмотр = Истина;
		// создадим элементы формы (автоматизация минимальна)
		Если      ИмяГруппыДанных = ИменаГруппДанных.ПИФ Тогда
			СтраницаГруппыРеквизитов = СоздатьСтраницу("ПИФОсновныеДанные", "ПИФ", Форма, ГруппаРеквизитов, ТолькоПросмотр);
			
			СоздатьПодчиненныеПоляФормы("ТипПИФа, КатегорияПИФа, ПравилаПИФа", Форма, СтраницаГруппыРеквизитов);
			
			// Теперь доступные для редактирования страницы
			ТолькоПросмотр = Ложь;
			
			// контактные лица
			Если КонтактныеЛица Тогда
				СоздатьДинамическийСписокКонтактныхЛиц("ПИФКонтактныеЛица", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
			КонецЕсли;
			
			СоздатьДинамическийСписокУсловий("ПИФУсловияПравилПаевогоИнвестиционногоФонда", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
			СоздатьДинамическийСписокДополненийПравилПИФ("ПИФДополненияПравилПаевогоИнвестиционногоФонда", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
						
		ИначеЕсли ИмяГруппыДанных = ИменаГруппДанных.ЮрЛицо Тогда
			// Основные
			СтраницаГруппыРеквизитов = СоздатьСтраницу("ЮрЛицоОсновныеДанные", "Основные", Форма, ГруппаРеквизитов, ТолькоПросмотр);
			
			// Группа "Наименования"
			ГруппаНаименованияЮрЛица = Форма.Элементы.Добавить("ГруппаНаименованияЮрЛица", Тип("ГруппаФормы"), СтраницаГруппыРеквизитов);
			ГруппаНаименованияЮрЛица.Вид       = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНаименованияЮрЛица.Заголовок = "Наименования";
			
			СоздатьПодчиненныеПоляФормы("ЮрЛицоСокращенноеНаименование/Сокращенное, ЮрЛицоПолноеНаименованиеПоУставу/Полное по уставу, ЮрЛицоКраткоеНаименованиеПоУставу/Краткое по уставу", Форма, ГруппаНаименованияЮрЛица);
			
			// коды
			СтраницаГруппыРеквизитов = СоздатьСтраницу("ЮрЛицоКоды", "Коды", Форма, ГруппаРеквизитов, ТолькоПросмотр);
			
			// Группа "ИНН, КПП"
			ГруппаИННиКПП = СоздатьГоризонтальнуюГруппуЭлементов("ЮрЛицоИННиКПП", Форма, СтраницаГруппыРеквизитов);
			СоздатьПодчиненныеПоляФормы("ЮрЛицоИНН, ЮрЛицоКПП", Форма, ГруппаИННиКПП);
			
			// Прочие подчиненные поля страницы
			СоздатьПодчиненныеПоляФормы("ЮрЛицоКодПоОКПО, ЮрЛицоКодПоОКВЭД, ЮрЛицоКодПоОКТМО", Форма, СтраницаГруппыРеквизитов);
			
			// документы
			СтраницаГруппыРеквизитов = СоздатьСтраницу("ЮрЛицоДокументы", "Документы", Форма, ГруппаРеквизитов, ТолькоПросмотр);
			
			// Группа "ОГРН"
			ГруппаОГРН = Форма.Элементы.Добавить("ЮрЛицоСведенияОбОГРН", Тип("ГруппаФормы"), СтраницаГруппыРеквизитов);
			ГруппаОГРН.Вид       = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаОГРН.Заголовок = "ОГРН";
			
			// Группа "Номер и дата ОГРН"
			ГруппаНомерДатаОГРН = СоздатьГоризонтальнуюГруппуЭлементов("ЮрЛицоНомерДатаОГРН", Форма, ГруппаОГРН);
			СоздатьПодчиненныеПоляФормы("ЮрЛицоОГРН/Номер, ЮрЛицоДатаВыдачиОГРН/Дата выдачи", Форма, ГруппаНомерДатаОГРН);
			
			// Прочие подчиненные элементы группы "ОГРН"
			СоздатьПодчиненныеПоляФормы("ЮрЛицоОрганВыдавшийОГРН/Выдан", Форма, ГруппаОГРН);
			
			// контактная информация
			Если КонтактнаяИнформация Тогда
				Если ИспользоватьАнкетныеДанные Тогда
					ЗаполнитьКонтактнуюИнформациюИзАнкет(Организация, "ЮрЛицоКонтактнаяИнформация", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
				Иначе
					СоздатьДинамическийСписокКонтактнойИнформации("ЮрЛицоКонтактнаяИнформация", Форма, ГруппаРеквизитов, ЮрФизЛицо, , ТолькоПросмотр);
					Форма.Элементы.ЮрЛицоКонтактнаяИнформацияЗначенияПолей.Видимость = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			// Теперь доступные для редактирования страницы
			ТолькоПросмотр = Ложь;

			// контактные лица
			Если КонтактныеЛица Тогда
				СоздатьДинамическийСписокКонтактныхЛиц("ЮрЛицоКонтактныеЛица", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
			КонецЕсли;
						
			Если КвалифицированныеИнвесторы Тогда
				СоздатьДинамическийСписокКвалифицированныеИнвесторы("ЮрЛицоКвалифицированныеИнвесторы", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
			КонецЕсли;	
			
		ИначеЕсли ИмяГруппыДанных = ИменаГруппДанных.ФизЛицо Тогда
			// основные данные
			СтраницаГруппыРеквизитов = СоздатьСтраницу("ЮрЛицоОсновныеДанные", "Основные", Форма, ГруппаРеквизитов, ТолькоПросмотр);
			
			СоздатьПодчиненныеПоляФормы("ФизЛицоФамилия", Форма, СтраницаГруппыРеквизитов);
			
			// Группа "Имя и Отчество"
			ГруппаИмяИОтчество = СоздатьГоризонтальнуюГруппуЭлементов("ФизЛицоИмяИОтчество", Форма, СтраницаГруппыРеквизитов);
			СоздатьПодчиненныеПоляФормы("ФизЛицоИмя, ФизЛицоОтчество", Форма, ГруппаИмяИОтчество);
			
			// "Пол"	
			СоздатьПодчиненныеПоляФормы("ФизЛицоПол", Форма, СтраницаГруппыРеквизитов);
			
			// Группа "Дата рождения, Дата смерти и дата получения документов о смерти"	
			ГруппаДатаСмертиИДатаПолученияДокументовОСмерти = СоздатьГоризонтальнуюГруппуЭлементов("ФизЛицоДатаСмертиИДатаПолученияДокументовОСмерти", Форма, СтраницаГруппыРеквизитов);
			СоздатьПодчиненныеПоляФормы("ФизЛицоДатаРождения, ФизЛицоДатаСмерти",	Форма, ГруппаДатаСмертиИДатаПолученияДокументовОСмерти);
			СоздатьПодчиненныеПоляФормы("ФизЛицоДатаПолученияДокументовОСмерти",	Форма, ГруппаДатаСмертиИДатаПолученияДокументовОСмерти, ВидПоляФормы.ПолеНадписи);
			
			// Прочие подчиненные элементы страницы
			СоздатьПодчиненныеПоляФормы("ФизЛицоИНН", Форма, СтраницаГруппыРеквизитов);
			
			//Гражданство
			НовыйЭлемент = Форма.Элементы.Добавить("ФизЛицоРезидентРФ", Тип("ПолеФормы"), СтраницаГруппыРеквизитов);
			НовыйЭлемент.ПутьКДанным		= "ФизЛицоРезидентРФ";
			НовыйЭлемент.Вид         		= ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			
			// Группа "Гражданство и Второе гражданство"	
			ГруппаГражданствоИВтороеГражданство = СоздатьГоризонтальнуюГруппуЭлементов("ФизЛицоГражданствоИВтороеГражданство", Форма, СтраницаГруппыРеквизитов);
			СоздатьПодчиненныеПоляФормы("ФизЛицоГражданство, ФизЛицоВтороеГражданство", Форма, ГруппаГражданствоИВтороеГражданство);
			
			// документы
			СтраницаГруппыРеквизитов = СоздатьСтраницу("ФизЛицоДокументы", "Документы", Форма, ГруппаРеквизитов, ТолькоПросмотр);
			
			// Группа "Удостоверение личности"
			ГруппаУдостоверениеЛичности = Форма.Элементы.Добавить("ГруппаНаименованияЮрЛица", Тип("ГруппаФормы"), СтраницаГруппыРеквизитов);
			ГруппаУдостоверениеЛичности.Вид       = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаУдостоверениеЛичности.Заголовок = "Удостоверение личности";
			
			СоздатьПодчиненныеПоляФормы("ФизЛицоВидУдостоверенияЛичности/Документ", Форма, СтраницаГруппыРеквизитов);
			
			// Серия и номер
			ГруппНомерИСерияУдостоверенияЛичности = СоздатьГоризонтальнуюГруппуЭлементов("ФизЛицоНомерИСерияУдостоверенияЛичности", Форма, СтраницаГруппыРеквизитов);
			СоздатьПодчиненныеПоляФормы("ФизЛицоСерияУдостоверенияЛичности/Серия, ФизЛицоНомерУдостоверенияЛичности/Номер", Форма, ГруппНомерИСерияУдостоверенияЛичности);
			
			СоздатьПодчиненныеПоляФормы("ФизЛицоОрганВыдавшийУдостоверениеЛичности/Выдан", Форма, СтраницаГруппыРеквизитов);
			
			ГруппаДатаВыдачиКодОрганаУдостоверенияЛичности = СоздатьГоризонтальнуюГруппуЭлементов("ФизЛицоДатаВыдачиКодОрганаУдостоверенияЛичности", Форма, СтраницаГруппыРеквизитов);
			СоздатьПодчиненныеПоляФормы("ФизЛицоДатаВыдачиУдостоверенияЛичности/Дата выдачи, ФизЛицоКодОрганаВыдавшегоУдостоверениеЛичности/Код подразделения", Форма, ГруппаДатаВыдачиКодОрганаУдостоверенияЛичности);
			
			// контактные лица
			Если КонтактнаяИнформация Тогда
				Если ИспользоватьАнкетныеДанные Тогда
					ЗаполнитьКонтактнуюИнформациюИзАнкет(Организация, "ЮрЛицоКонтактнаяИнформация", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
				Иначе
					СоздатьДинамическийСписокКонтактнойИнформации("ЮрЛицоКонтактнаяИнформация", Форма, ГруппаРеквизитов, ЮрФизЛицо,, ТолькоПросмотр);
					Форма.Элементы.ЮрЛицоКонтактнаяИнформацияЗначенияПолей.Видимость = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			// Теперь доступные для редактирования страницы
			ТолькоПросмотр = Ложь;

			// контактные лица
			Если КонтактныеЛица Тогда
				СоздатьДинамическийСписокКонтактныхЛиц("ФизЛицоКонтактныеЛица", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
			КонецЕсли;
						
			Если КвалифицированныеИнвесторы Тогда
				СоздатьДинамическийСписокКвалифицированныеИнвесторы("ЮрЛицоКвалифицированныеИнвесторы", Форма, ГруппаРеквизитов, ЮрФизЛицо, ТолькоПросмотр);
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	// заполнение общих созданных реквизитов данными
	ЗаполнитьДанныеОЮрФизЛице(Организация, ЮрФизЛицо, Форма, ИспользоватьАнкетныеДанные);
	
	НастроитьВидимостьРеквизитов(Форма);
	
КонецПроцедуры // ВывестиРеквизитыФизЮрЛица

Функция ПолучитьЮрФизЛицаБанкроты(Период) Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДефолтыПоОблигациям.Облигация.Эмитент.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.ДефолтыПоОблигациям.СрезПоследних(&Период, ТипДефолта В (ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации), ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.Банкротство))) КАК ДефолтыПоОблигациям
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДефолтыПоОблигациям.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации)
		|				ТОГДА ДефолтыПоОблигациям.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Эмитенты.ЮрФизЛицо
		|ИЗ
		|	Справочник.Эмитенты КАК Эмитенты
		|ГДЕ
		|	Эмитенты.ДатаБанкротства <> ДАТАВРЕМЯ(1, 1, 1)");
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЮрФизЛицо");	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Функция ЭтоУникальныйДоговор(Договор) Экспорт
	
	// уникальность каждого из 3-х видов договоров контролируется по номеру и дате в рамках
	// организации, которая его заключила, и 2-й стороной (банком, брокером или депозитарием)
	
	ТипДоговора = ТипЗнч(Договор);
	
	Если ТипДоговора = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") Или ТипДоговора = Тип("СправочникОбъект.ДоговорыБрокерскогоОбслуживания") Тогда
		ИмяСправочника            = "ДоговорыБрокерскогоОбслуживания";
		ИмяРеквизитаВторойСтороны = "Контрагент";
		
	ИначеЕсли ТипДоговора = Тип("СправочникСсылка.Договоры") Или ТипДоговора = Тип("СправочникОбъект.Договоры") Тогда
		ИмяСправочника            = "Договоры";
		ИмяРеквизитаВторойСтороны = "Контрагент";	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Договоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Организация = &Организация
		|	И Договоры.Контрагент = &Контрагент
		|	И Договоры.НомерДоговора = &НомерДоговора
		|	И Договоры.ДатаЗаключения = &ДатаЗаключения
		|	И &ОтборПоВидуДоговора
		|	И Договоры.Ссылка <> &Ссылка
		|	И НЕ Договоры.ПометкаУдаления";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Договоры", "Справочник." + ИмяСправочника);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Контрагент", ИмяРеквизитаВторойСтороны);
	
	Если ИмяСправочника <> "Договоры" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуДоговора", "ИСТИНА");
		
	Иначе
		Если Договор.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
			// по доп. соглашениям уникальность нумерации контролируется в разрезе основания
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуДоговора", "Договоры.ВидДоговора = &ВидДоговора И Договоры.Основание = &Основание");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуДоговора", "Договоры.ВидДоговора = &ВидДоговора");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Основание",   Договор.Основание);
		Запрос.УстановитьПараметр("ВидДоговора", Договор.ВидДоговора);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",    Договор.Организация);
	Запрос.УстановитьПараметр("НомерДоговора",  Договор.НомерДоговора);
	Запрос.УстановитьПараметр("ДатаЗаключения", Договор.ДатаЗаключения);
	Запрос.УстановитьПараметр("Ссылка",         Договор.Ссылка);
	
	Запрос.УстановитьПараметр(ИмяРеквизитаВторойСтороны, Договор[ИмяРеквизитаВторойСтороны]);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции // ПроверитьУникальностьДоговора

Функция ПолучитьДатуЗакрытияСчетаПоДоговору(Счет) Экспорт
	
	Если ЗначениеЗаполнено(Счет) Тогда
		Возврат Справочники.Договоры.ПолучитьДатуРасторженияДоговора(Счет.Договор);
	КонецЕсли;
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьДатуЗакрытияСчетаПоДоговору

Функция ПолучитьГоловнуюОрганизацию(ЮридическоеЛицо, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",				?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("ЮридическоеЛицо",	ЮридическоеЛицо);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо КАК РодительскоеЮридическоеЛицо
		|ИЗ
		|	РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|			&Период,
		|			ЮридическоеЛицо = &ЮридическоеЛицо
		|				И ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|ГДЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.Действует";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РодительскоеЮридическоеЛицо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьГлавуХолдинга(ЮридическоеЛицо, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",				?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("ЮридическоеЛицо",	ЮридическоеЛицо);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо КАК РодительскоеЮридическоеЛицо
		|ИЗ
		|	РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|			&Период,
		|			ЮридическоеЛицо = &ЮридическоеЛицо
		|				И ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ВходитВГруппуКомпаний)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|ГДЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.Действует";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РодительскоеЮридическоеЛицо;
	Иначе
		Возврат ЮридическоеЛицо;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРеквизитыДоговора(Договор, Реквизиты, Период = Неопределено) Экспорт
	
	ЗначенияРеквизитов = Новый Структура(Реквизиты);

	Если Не ЗначениеЗаполнено(Договор) Тогда
		//заполнения реквизитов пустыми значениями требуется, чтобы при пустом договоре, в месте вызова исключить ошибки на операции сравнения <>, сравнения на булево и обращения к реквизитам через точку.
		//поэтому перечисления и строки можно не указывать.
		ЗначенияРеквизитовПриОтсутствииДоговора = Новый Структура;
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("ОтветственноеХранение", Ложь);
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("Контрагент"			, Справочники.ЮрФизЛица.ПустаяСсылка());
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("ДатаЗаключения"		, Дата(1,1,1));
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("ДатаРасторжения"		, Дата(1,1,1));
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("СрокОплаты"			, 0);
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("Депозитарий"			, Справочники.ДепозитарныеКомпании.ПустаяСсылка());
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("Брокер"				, Справочники.БрокерскиеКомпании.ПустаяСсылка());
		ЗначенияРеквизитовПриОтсутствииДоговора.Вставить("ВидДоговораАренды"	, Перечисления.ВидыДоговоровАренды.ПустаяСсылка());
		
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ЗначенияРеквизитовПриОтсутствииДоговора);
		
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДоговорыБрокерскогоОбслуживания.Контрагент КАК Контрагент,
			|	ДоговорыБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговора,
			|	ДоговорыБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаЗаключения,
			|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения КАК ДатаРасторжения,
			|	УсловияДоговоровОбщиеСрезПоследних.СрокОплаты КАК СрокОплаты,
			|	УсловияДоговоровОбщиеСрезПоследних.ВариантДлиныСрока КАК ВариантДлиныСрока,
			|	БрокерскиеКомпании.Ссылка КАК Брокер
			|ИЗ
			|	Справочник.ДоговорыБрокерскогоОбслуживания КАК ДоговорыБрокерскогоОбслуживания
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, ) КАК УсловияДоговоровОбщиеСрезПоследних
			|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = ДоговорыБрокерскогоОбслуживания.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БрокерскиеКомпании КАК БрокерскиеКомпании
			|		ПО ДоговорыБрокерскогоОбслуживания.Контрагент = БрокерскиеКомпании.ЮрФизЛицо
			|ГДЕ
			|	ДоговорыБрокерскогоОбслуживания.Ссылка = &Договор";
		
	Иначе
	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Договоры.ВидДоговора КАК ВидДоговора,
			|	Договоры.Контрагент КАК Контрагент,
			|	Договоры.НомерДоговора КАК НомерДоговора,
			|	Договоры.ДатаЗаключения КАК ДатаЗаключения,
			|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения КАК ДатаРасторжения,
			|	УсловияДоговоровОбщиеСрезПоследних.СрокОплаты КАК СрокОплаты,
			|	УсловияДоговоровОбщиеСрезПоследних.ВариантДлиныСрока КАК ВариантДлиныСрока,
			|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОтветственногоХранения)
			|		ИЛИ Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания) КАК ОтветственноеХранение
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, ) КАК УсловияДоговоровОбщиеСрезПоследних
			|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = Договоры.Ссылка)
			|ГДЕ
			|	Договоры.Ссылка = &Договор";
	
	
		Если ЗначенияРеквизитов.Свойство("Депозитарий") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеКомпании КАК ДепозитарныеКомпании
				|		ПО Договоры.Контрагент = ДепозитарныеКомпании.ЮрФизЛицо
				|ГДЕ");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ", 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	ДепозитарныеКомпании.Ссылка КАК Депозитарий,");
		КонецЕсли;
	
		Если ЗначенияРеквизитов.Свойство("Брокер") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БрокерскиеКомпании КАК БрокерскиеКомпании
				|		ПО Договоры.Контрагент = БрокерскиеКомпании.ЮрФизЛицо
				|ГДЕ");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ", 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	БрокерскиеКомпании.Ссылка КАК Брокер,");
		КонецЕсли;
		
		Если ЗначенияРеквизитов.Свойство("ВидДоговораАренды") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровАренды.СрезПоследних(&Период, ) КАК УсловияДоговоровАрендыСрезПоследних
				|		ПО (УсловияДоговоровАрендыСрезПоследних.Договор = Договоры.Ссылка)
				|ГДЕ");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ", 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	УсловияДоговоровАрендыСрезПоследних.ВидДоговораАренды КАК ВидДоговораАренды,");
		КонецЕсли;
		
		Если ЗначенияРеквизитов.Свойство("ПродолжениеГенСоглашения") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийПродолжениеГенСоглашения
				|		ПО Договоры.Ссылка = ЗначенияДополнительныхСведенийПродолжениеГенСоглашения.Значение
				|			И (ЗначенияДополнительныхСведенийПродолжениеГенСоглашения.Свойство.Ключ = ""ПредыдущееГенСоглашение"")
				|ГДЕ");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ", 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	ЕСТЬNULL(ЗначенияДополнительныхСведенийПродолжениеГенСоглашения.Объект, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)) КАК ПродолжениеГенСоглашения,");
		КонецЕсли;
		
		Если ЗначенияРеквизитов.Свойство("ПредыдущееГенСоглашение") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийПредыдущееГенСоглашение
				|		ПО Договоры.Ссылка = ЗначенияДополнительныхСведенийПредыдущееГенСоглашение.Объект
				|			И (ЗначенияДополнительныхСведенийПредыдущееГенСоглашение.Свойство.Ключ = ""ПредыдущееГенСоглашение"")
				|ГДЕ");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ", 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	ЕСТЬNULL(ЗначенияДополнительныхСведенийПредыдущееГенСоглашение.Значение, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)) КАК ПредыдущееГенСоглашение,");
		КонецЕсли;
		
		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Договор"	, Договор);
	Запрос.УстановитьПараметр("Период"	, Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Выборка);
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция ПолучитьЮрФизЛицаОрганизации(Организация, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",			?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Организации.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо
		|ИЗ
		|	РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|			&Период,
		|			ЮридическоеЛицо В
		|					(ВЫБРАТЬ
		|						Организации.ЮрФизЛицо КАК ЮрФизЛицо
		|					ИЗ
		|						Справочник.Организации КАК Организации
		|					ГДЕ
		|						Организации.Ссылка = &Организация)
		|				И ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|ГДЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.Действует";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЮрФизЛицо");
	
КонецФункции

// Проверяет, что контрагент указан выгодоприобретателем в анкете физ. лица, действующей на дату
//
//		Параметры:
//			- Организация	- Организация
//			- Клиент 		- Юр./физ. лицо
//			- Контрагент 	- Юр./физ. лицо
//			- Дата			- Дата проверки
//
Функция КонтрагентЯвляетсяВыгодоприобретателемКлиентаФизическогоЛица(Организация, Клиент, Контрагент, Дата) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &Клиент
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АнкетаФизическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаФизическогоЛицаПредставителиВыгодоприобретатели
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.Ссылка
		|			И (АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо = &Контрагент)
		|			И (АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ВидУчастника = ЗНАЧЕНИЕ(Перечисление.ВидыУчастниковАнкет.Выгодоприобретатель))
		|ГДЕ
		|	НЕ АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Клиент", 		Клиент);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент); 	
	
	ЭтоВыгодоприобретатель = Не Запрос.Выполнить().Пустой();
	
	Если Не ЭтоВыгодоприобретатель Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Контрагент '%1' не является выгодоприобретателем клиента '%2'", Контрагент, Клиент));	
	КонецЕсли;
	
	Возврат ЭтоВыгодоприобретатель;
	
КонецФункции

// Получает таблицу юридических лиц депозитариев, спец. депозитариев, брокеров, банков для действующих счетов доверительного управления
// 	
//	Параметры:
// 		- Дата - дата среза
//
Функция ЮридическиеЛицаИспользуемыеДействующимиСчетамДоверительногоУправления(Дата) Экспорт 
	
	// Необходимо получить все счета ДУ, поэтому в привилегированном режиме
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОрганизаций = Новый Массив;
	МассивОрганизаций.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	МассивОрганизаций.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, Дата, Новый Структура("Организация", МассивОрганизаций), "_СчетаДоверительногоУправления");
	
	Запрос.УстановитьПараметр("Дата", 	Дата);
	Запрос.УстановитьПараметр("ПустаяДата", 	'00010101');
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВложенныйЗапрос.Организация КАК Организация
		|ИЗ
		|	(ВЫБРАТЬ
		|		СчетаДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо КАК ЮрФизЛицо,
		|		СчетаДоверительногоУправления.Организация КАК Организация
		|	ИЗ
		|		Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|	ГДЕ
		|		СчетаДоверительногоУправления.Ссылка В
		|				(ВЫБРАТЬ
		|					_СчетаДоверительногоУправления.Ссылка
		|				ИЗ
		|					_СчетаДоверительногоУправления)
		|		И СчетаДоверительногоУправления.СпециализированныйДепозитарий <> ЗНАЧЕНИЕ(Справочник.ДепозитарныеКомпании.)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсполнителиПоДенежнымСредствамБрокерские.Брокер.ЮрФизЛицо,
		|		ИсполнителиПоДенежнымСредствамБрокерские.Организация
		|	ИЗ
		|		РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
		|	ГДЕ
		|		ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаДоверительногоУправления.Ссылка
		|				ИЗ
		|					_СчетаДоверительногоУправления)
		|		И (ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия = &ПустаяДата
		|				ИЛИ ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия > &Дата)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.ЮрФизЛицо,
		|		ИсполнителиПоДенежнымСредствамСобственные.Организация
		|	ИЗ
		|		РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|	ГДЕ
		|		ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаДоверительногоУправления.Ссылка
		|				ИЗ
		|					_СчетаДоверительногоУправления)
		|		И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = &ПустаяДата
		|				ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &Дата)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо,
		|		ИсполнителиПоЦеннымБумагам.Организация
		|	ИЗ
		|		РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|	ГДЕ
		|		ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаДоверительногоУправления.Ссылка
		|				ИЗ
		|					_СчетаДоверительногоУправления)
		|		И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = &ПустаяДата
		|				ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия > &Дата)) КАК ВложенныйЗапрос";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат; 
	
КонецФункции

// Возвращает реквизиты головной организации
//
// Параметры
//	Организация						- СправочникСсылка.Организации	- Организация для которой необходимо получить реквизиты головной организации
//	Дата							- Дата							- Дата реквизитов
//	Реквизиты						- Строка						- Список реквизитов через запятую
//
// Возвращаемое значение:
//  Структура - реквизиты головной организации
//
Функция ПолучитьРеквизитыГоловнойОрганизации(Организация, Дата, Реквизиты) Экспорт
	
	ИсключаемыеГоловныеОрганизации = Новый Массив;
	ИсключаемыеГоловныеОрганизации.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Траст")); //#ТехДолг Кривоносов
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыеГоловныеОрганизации"	, ИсключаемыеГоловныеОрганизации);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН КАК ОГРН,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КПП КАК КПП,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма КАК ОрганизационноПравоваяФорма,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮридическийАдрес КАК ЮридическийАдрес,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ВебСтраница КАК ВебСтраница
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|				&Дата,
		|				ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)
		|					И НЕ РодительскоеЮридическоеЛицо В (&ИсключаемыеГоловныеОрганизации)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Организации.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|					&Дата,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|			ПО ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ПО (ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Организации.ЮрФизЛицо) = ЮрФизЛица.Ссылка)
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
	Результат = Запрос.Выполнить();
	РеквизитыОрганизации = Новый Структура(Реквизиты);
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыОрганизации, Выборка);
	Иначе
		ВызватьИсключение "Ошибка вычисления реквизитов организации";
		
	КонецЕсли;
	
	Возврат РеквизитыОрганизации;
	
КонецФункции	


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ФУНКЦИИ

Процедура ЗаполнитьДанныеОЮрФизЛице(Организация, ЮрФизЛицо, Форма, ИспользоватьАнкетныеДанные = Ложь)

	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		Форма["ТипПИФа"]       = ЮрФизЛицо.Тип;
		Форма["КатегорияПИФа"] = ЮрФизЛицо.Категория;
		
		НомерПравилПИФа = ЮрФизЛицо.НомерПравил;
		ДатаПравилПИФа  = ЮрФизЛицо.ДатаПравил;
		
		Если ПустаяСтрока(НомерПравилПИФа) и Не ЗначениеЗаполнено(ДатаПравилПИФа) Тогда
			Форма["ПравилаПИФа"] = "не заданы";
		Иначе
			Форма["ПравилаПИФа"] = ?(Не ПустаяСтрока(НомерПравилПИФа), "№ " + НомерПравилПИФа, "");
			
			Если ЗначениеЗаполнено(ДатаПравилПИФа) Тогда
				Форма["ПравилаПИФа"] = Форма["ПравилаПИФа"] + ?(ПустаяСтрока(Форма["ПравилаПИФа"]), "", " от ") + Формат(ДатаПравилПИФа, "ДФ=dd.MM.yyyy")+?(ПустаяСтрока(ЮрФизЛицо.ОрганВыдавшийЛицензию), "", ", выданы ") + ЮрФизЛицо.ОрганВыдавшийЛицензию;
			КонецЕсли;
		КонецЕсли;
		
		НаДату = ТекущаяДата();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	*
			|ИЗ
			|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(
			|			&Период,
			|			ПаевойИнвестиционныйФонд = &ЮрФизЛицо) КАК РеквизитыСрезПоследних
			|";
		
		Запрос.УстановитьПараметр("Период",        НаДату);
		Запрос.УстановитьПараметр("ЮрФизЛицо",     ЮрФизЛицо);
			
		Выборка = Запрос.Выполнить().Выгрузить();
		
		// удалим из выборки те колонки, которые не являются ресурсами регистра сведений
		Для Инд = 1 - Выборка.Колонки.Количество() По 0 Цикл
			Если Метаданные.РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.Ресурсы.Найти(Выборка.Колонки[-Инд].Имя) = Неопределено Тогда
				Выборка.Колонки.Удалить(-Инд);
			КонецЕсли;
		КонецЦикла;
		
		Если Выборка.Количество() = 1 Тогда
			ЗнчРеквизитов = РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(Выборка[0]);
		Иначе
			ЗнчРеквизитов = РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(Выборка.Добавить());
		КонецЕсли;
		
		Для каждого КлючИЗначение Из ЗнчРеквизитов Цикл
			Форма["ПИФ" + КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;

	Иначе	
		Если ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
			ИмяРегистраСРеквизитами = "РеквизитыФизическихЛиц";
			Если НЕ ИспользоватьАнкетныеДанные Тогда
				ВызватьИсключение "У физических лиц присутствуют только анкетные реквизиты.";
			КонецЕсли;
		Иначе
			ИмяРегистраСРеквизитами = "РеквизитыЮридическихЛиц";
		КонецЕсли;
		
		Если ИспользоватьАнкетныеДанные Тогда
			ИмяРегистраСРеквизитами = ИмяРегистраСРеквизитами + "Анкетные";
		КонецЕсли;
		
		ПрефиксИмениРеквизитов  = ?(ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо, "ФизЛицо", "ЮрЛицо");
		
		НаДату = ТекущаяДата();
		
		Запрос = Новый Запрос;
		
		Если ИспользоватьАнкетныеДанные Тогда
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений." + ИмяРегистраСРеквизитами + ".СрезПоследних(
				|			&Период,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Организация = &Организация
				|				И Язык = &Язык) КАК РеквизитыСрезПоследних
				|";
			Запрос.УстановитьПараметр("Организация", Организация);
		Иначе
			Запрос.Текст =
			    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений." + ИмяРегистраСРеквизитами + ".СрезПоследних(
				|			&Период,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Подразделение = &Подразделение
				|				И Язык = &Язык) КАК РеквизитыСрезПоследних
				|";
			Запрос.УстановитьПараметр("Подразделение", Справочники.Подразделения.ГруппаКомпаний);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Язык",		Справочники.Языки.Русский);
		Запрос.УстановитьПараметр("Период",		НаДату);
		Запрос.УстановитьПараметр("ЮрФизЛицо",	ЮрФизЛицо);
			
		Выборка = Запрос.Выполнить().Выгрузить();
		
		// удалим из выборки те колонки, которые не являются ресурсами регистра сведений
		Для Инд = 1 - Выборка.Колонки.Количество() По 0 Цикл
			Если Метаданные.РегистрыСведений[ИмяРегистраСРеквизитами].Ресурсы.Найти(Выборка.Колонки[-Инд].Имя) = Неопределено Тогда
				Выборка.Колонки.Удалить(-Инд);
			КонецЕсли;
		КонецЦикла;
		
		// Если известна дата смерти, заполним ДатаПолученияДокументовОСмерти - это дата первой анкеты с заполненной датой смерти 
		
		Если ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо 
			И ИспользоватьАнкетныеДанные 
			И Выборка.Количество() > 0
			И ЗначениеЗаполнено(Выборка[0].ДатаСмерти)
		Тогда
			
			РаботаСОтчетами.ПоместитьДатыПолученияДокументовОСмертиВМенеджерВременныхТаблиц(Запрос, НаДату, Организация, ЮрФизЛицо, "_ДатыПолученияДокументовОСмерти");
			
			ВыборкаДатаСмерти = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ДатыПолученияДокументовОСмерти").Выбрать();
			Если ВыборкаДатаСмерти.Следующий() Тогда
				Выборка.Колонки.Добавить("ДатаПолученияДокументовОСмерти", Новый ОписаниеТипов("Дата"));
				Выборка[0].ДатаПолученияДокументовОСмерти = ВыборкаДатаСмерти.Дата;
			КонецЕсли;
			
		КонецЕсли;
		
		// Если это юридическое лицо и не используются анкетные данные,
		// то данные по ОГРН получаем из регистра "ДокументыЮридическихЛиц".
		Если ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо
			И НЕ ИспользоватьАнкетныеДанные Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период",		НаДату);
			Запрос.УстановитьПараметр("ЮрФизЛицо",	ЮрФизЛицо);
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ОГРН,
				|	ДокументыЮридическихЛицСрезПоследних.Период КАК ДатаВыдачиОГРН,
				|	ДокументыЮридическихЛицСрезПоследних.КемВыдан КАК ОрганВыдавшийОГРН
				|ИЗ
				|	РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
				|			&Период,
				|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)
				|				И ЮрФизЛицо = &ЮрФизЛицо) КАК ДокументыЮридическихЛицСрезПоследних
				|ГДЕ
				|	(ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
				|			ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &Период)";
			
			ОГРН = Запрос.Выполнить().Выбрать();
			
			Если ОГРН.Следующий() Тогда
				НомерОГРН			= ОГРН.ОГРН;
				ДатаВыдачиОГРН		= ОГРН.ДатаВыдачиОГРН;
				ОрганВыдавшийОГРН	= ОГРН.ОрганВыдавшийОГРН;
			Иначе
				НомерОГРН			= Неопределено;
				ДатаВыдачиОГРН		= Неопределено;
				ОрганВыдавшийОГРН	= Неопределено;
			КонецЕсли;
			
			// Если колонок для данных по ОГРН нет, добавлем новые и заполняем.
			Если Выборка.Колонки.Найти("ОГРН") = Неопределено Тогда
				Выборка.Колонки.Добавить("ОГРН",				Новый ОписаниеТипов("Строка"));
				Выборка.Колонки.Добавить("ДатаВыдачиОГРН",		Новый ОписаниеТипов("Дата"));
				Выборка.Колонки.Добавить("ОрганВыдавшийОГРН",	Новый ОписаниеТипов("Строка"));
			КонецЕсли;
			
			// Данных о юр. лице может и не быть.
			Если Выборка.Количество() = 0 Тогда
				Выборка.Добавить();
			КонецЕсли;
			
			// Устанавливаем значения.
			Выборка[0].ОГРН					= НомерОГРН;
			Выборка[0].ДатаВыдачиОГРН		= ДатаВыдачиОГРН;
			Выборка[0].ОрганВыдавшийОГРН	= ОрганВыдавшийОГРН;
			
		КонецЕсли;
		
		Если Выборка.Количество() = 1 Тогда
			ЗнчРеквизитов = РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(Выборка[0]);
		Иначе
			ЗнчРеквизитов = РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(Выборка.Добавить());
		КонецЕсли;
		
		РеквизитыФормы = Новый Структура;
		Для каждого КлючИЗначение Из ЗнчРеквизитов Цикл
			РеквизитыФормы.Вставить(ПрефиксИмениРеквизитов + КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(Форма, РеквизитыФормы);
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДанныеОЮрФизЛице

Процедура СоздатьПодчиненныеПоляФормы(ОписанияПолей, Форма, ГруппаВладелец, ВидПоля = Неопределено)

	Если ВидПоля = Неопределено Тогда
		ВидПоля = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	ОписанияПолей = СтрЗаменить(ОписанияПолей, ",", Символы.ПС);
	
	Для НомСтр = 1 По СтрЧислоСтрок(ОписанияПолей) Цикл
		ОписаниеПоля = СокрЛП(СтрПолучитьСтроку(ОписанияПолей, НомСтр));
		
		ПозРазделителяИмениИЗаголовка = Найти(ОписаниеПоля, "/");
		Если ПозРазделителяИмениИЗаголовка > 0 Тогда
			ИмяПоля   = СокрЛП(Лев(ОписаниеПоля, ПозРазделителяИмениИЗаголовка - 1));
			Заголовок = СокрЛП(Сред(ОписаниеПоля, ПозРазделителяИмениИЗаголовка + 1));
		Иначе
			ИмяПоля   = ОписаниеПоля;
			Заголовок = "";
		КонецЕсли;
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), ГруппаВладелец);
		НовыйЭлемент.ПутьКДанным = ИмяПоля;
		НовыйЭлемент.Вид         = ВидПоля;
		НовыйЭлемент.Заголовок   = Заголовок;
	КонецЦикла;
	
КонецПроцедуры // СоздатьПодчиненныеПоляФормы

Функция СоздатьГоризонтальнуюГруппуЭлементов(ИмяГруппы, Форма, ГруппаВладелец)
	
	НоваяГруппа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаВладелец);
	НоваяГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	
	Возврат НоваяГруппа
	
КонецФункции // СоздатьГоризонтальнуюГруппуЭлементов

Функция СоздатьСтраницу(ИмяГруппы, Заголовок, Форма, ГруппаСтраницы, ТолькоПросмотр = Ложь)
	
	Страница = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаСтраницы);
	Страница.Вид       		= ВидГруппыФормы.Страница;
	Страница.Заголовок 		= Заголовок;
	Страница.ТолькоПросмотр	= ТолькоПросмотр;
	
	Возврат Страница;
	
КонецФункции // СоздатьСтраницу

Процедура СоздатьДинамическийСписокУсловий(Имя, Форма, ГруппаВладелец, ЮрФизЛицо, ТолькоПросмотр = Ложь)
	
	// нас будут интересовать все измерения, ресурсы и реквизиты данного списка
	ОписаниеПолейУсловий = РаботаСМетаданнымиПовтИсп.ПолучитьОписаниеПолейРегистра("РегистрыСведений", "УсловияПравилПаевогоИнвестиционногоФонда");
	
	// все таблицы контактных лиц на форме будут связаны с одним динамическим списком
	ДобавляемыеРеквизиты = Новый Массив();
	
	ДинамическийСписок = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("ДинамическийСписок"),, "Условия ПИФ", Ложь);
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма[Имя].ОсновнаяТаблица = "РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда";
	
	// создадим на форме соответствующие элементы
	Страница = СоздатьСтраницу("Группа" + Имя, "Условия ПИФ", Форма, ГруппаВладелец, ТолькоПросмотр);
	
	ТаблицаДинамическогоСписка = Форма.Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Страница);
	ТаблицаДинамическогоСписка.ПутьКДанным           = Имя;
	ТаблицаДинамическогоСписка.ВысотаВСтрокахТаблицы = 5;
	
	    // подчиненные поля-колонки
		Для каждого ОписаниеПоля Из ОписаниеПолейУсловий Цикл
			Если ОписаниеПоля.Имя <> "Объект" Тогда
				НовыйЭлемент = Форма.Элементы.Добавить(Имя + ОписаниеПоля.Имя, Тип("ПолеФормы"), ТаблицаДинамическогоСписка);
				НовыйЭлемент.ПутьКДанным = Имя + "." + ОписаниеПоля.Имя;
				НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.Заголовок   = ОписаниеПоля.Синоним;
				
				// длинные строки на общем фоне смотрятся не красиво
				Если Строка(ОписаниеПоля.Тип) = "Строка" Тогда
					Если ОписаниеПоля.Тип.КвалификаторыСтроки.Длина > 25 Тогда
						НовыйЭлемент.Ширина = 25;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Список = Форма[Имя].Отбор;
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(Список, "ПаевойИнвестиционныйФонд",, ВидСравненияКомпоновкиДанных.Равно, ЮрФизЛицо,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	// Теперь эта гиперссылка не требуется	
	// ссылка, которая открывает сведения о клиенте на закладке "Контактные лица"
	//НовыйЭлемент = Форма.Элементы.Добавить(Имя + "Изменить", Тип("ДекорацияФормы"), Страница);
	//НовыйЭлемент.Вид         = ВидДекорацииФормы.Надпись;
	//НовыйЭлемент.Заголовок   = "Изменить";
	//НовыйЭлемент.Гиперссылка = Истина;
	//НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_УсловияИзменитьНажатие");
	
КонецПроцедуры // СоздатьДинамическийСписокУсловий

Процедура СоздатьДинамическийСписокДополненийПравилПИФ(Имя, Форма, ГруппаВладелец, ЮрФизЛицо, ТолькоПросмотр = Ложь)
	
	// нас будут интересовать все измерения, ресурсы и реквизиты данного списка
	ОписаниеПолейДополнений = Новый Массив;
	ОписаниеПолейДополнений.Добавить(Новый Структура("Имя, Тип, Синоним", "Наименование"	, Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(Метаданные.Справочники.Договоры.ДлинаНаименования)), "Наименование"));
	ОписаниеПолейДополнений.Добавить(Новый Структура("Имя, Тип, Синоним", "НомерДоговора"	, Метаданные.Справочники.Договоры.Реквизиты.НомерДоговора.Тип, "Номер договора"));
	ОписаниеПолейДополнений.Добавить(Новый Структура("Имя, Тип, Синоним", "ДатаЗаключения"	, Метаданные.Справочники.Договоры.Реквизиты.ДатаЗаключения.Тип, "Дата заключения"));
	
	// все таблицы контактных лиц на форме будут связаны с одним динамическим списком
	ДобавляемыеРеквизиты = Новый Массив();
	
	ДинамическийСписок = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("ДинамическийСписок"),, "Дополнения правил", Ложь);
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма[Имя].ОсновнаяТаблица = "Справочник.Договоры";
	
	// создадим на форме соответствующие элементы
	Страница = СоздатьСтраницу("Группа" + Имя, "Дополнения правил", Форма, ГруппаВладелец, ТолькоПросмотр);
	
	ТаблицаДинамическогоСписка = Форма.Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Страница);
	ТаблицаДинамическогоСписка.ПутьКДанным           = Имя;
	ТаблицаДинамическогоСписка.ВысотаВСтрокахТаблицы = 5;
	
    // подчиненные поля-колонки
	Для каждого ОписаниеПоля Из ОписаниеПолейДополнений Цикл
		НовыйЭлемент = Форма.Элементы.Добавить(Имя + ОписаниеПоля.Имя, Тип("ПолеФормы"), ТаблицаДинамическогоСписка);
		НовыйЭлемент.ПутьКДанным = Имя + "." + ОписаниеПоля.Имя;
		НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок   = ОписаниеПоля.Синоним;
		
		// длинные строки на общем фоне смотрятся не красиво
		Если Строка(ОписаниеПоля.Тип) = "Строка" Тогда
			Если ОписаниеПоля.Тип.КвалификаторыСтроки.Длина > 25 Тогда
				НовыйЭлемент.Ширина = 25;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Список = Форма[Имя].Отбор;
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(Список, "Основание",, ВидСравненияКомпоновкиДанных.Равно, ЮрФизЛицо,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(Список, "ВидДоговора",, ВидСравненияКомпоновкиДанных.Равно, ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДополнениеПравил"),
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	// ссылка, которая открывает сведения о клиенте на закладке "Контактные лица"
	//НовыйЭлемент = Форма.Элементы.Добавить(Имя + "Изменить", Тип("ДекорацияФормы"), Страница);
	//НовыйЭлемент.Вид         = ВидДекорацииФормы.Надпись;
	//НовыйЭлемент.Заголовок   = "Изменить";
	//НовыйЭлемент.Гиперссылка = Истина;
	//НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_УсловияИзменитьНажатие");
	
КонецПроцедуры // СоздатьДинамическийСписокДополненийПравилПИФ

Процедура СоздатьДинамическийСписокКонтактныхЛиц(Имя, Форма, ГруппаВладелец, ЮрФизЛицо, ТолькоПросмотр = Ложь)
	
	// нас будут интересовать все измерения, ресурсы и реквизиты данного списка
	ОписаниеПолейКонтактныхЛиц = РаботаСМетаданнымиПовтИсп.ПолучитьОписаниеПолейРегистра("РегистрыСведений", "КонтактныеЛица");
	
	// все таблицы контактных лиц на форме будут связаны с одним динамическим списком
	ДобавляемыеРеквизиты = Новый Массив();
	
	ДинамическийСписок = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("ДинамическийСписок"),, "Контактные лица", Ложь);
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма[Имя].ОсновнаяТаблица = "РегистрСведений.КонтактныеЛица";
	
	// создадим на форме соответствующие элементы
	Страница = СоздатьСтраницу("Группа" + Имя, "Контактные лица", Форма, ГруппаВладелец, ТолькоПросмотр);
	
	ТаблицаДинамическогоСписка = Форма.Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Страница);
	ТаблицаДинамическогоСписка.ПутьКДанным           = Имя;
	ТаблицаДинамическогоСписка.ВысотаВСтрокахТаблицы = 5;
	
	    // подчиненные поля-колонки
		Для каждого ОписаниеПоля Из ОписаниеПолейКонтактныхЛиц Цикл
			Если ОписаниеПоля.Имя <> "Объект" Тогда
				НовыйЭлемент = Форма.Элементы.Добавить(Имя + ОписаниеПоля.Имя, Тип("ПолеФормы"), ТаблицаДинамическогоСписка);
				НовыйЭлемент.ПутьКДанным = Имя + "." + ОписаниеПоля.Имя;
				НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.Заголовок   = ОписаниеПоля.Синоним;
				
				// длинные строки на общем фоне смотрятся не красиво
				Если Строка(ОписаниеПоля.Тип) = "Строка" Тогда
					Если ОписаниеПоля.Тип.КвалификаторыСтроки.Длина > 25 Тогда
						НовыйЭлемент.Ширина = 25;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Список = Форма[Имя].Отбор;
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(Список, "Объект",, ВидСравненияКомпоновкиДанных.Равно, ЮрФизЛицо,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры // СоздатьДинамическийСписокКонтактныхЛиц

Процедура СоздатьДинамическийСписокКвалифицированныеИнвесторы(Имя, Форма, ГруппаВладелец, ЮрФизЛицо, ТолькоПросмотр = Ложь)
	
	// нас будут интересовать все измерения, ресурсы и реквизиты данного списка
	ОписаниеПолейКвалифицированныеИнвесторы = РаботаСМетаданнымиПовтИсп.ПолучитьОписаниеПолейРегистра("РегистрыСведений", "КвалифицированныеИнвесторы");
	
	// все таблицы контактных лиц на форме будут связаны с одним динамическим списком
	ДобавляемыеРеквизиты = Новый Массив();
	
	ДинамическийСписок = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("ДинамическийСписок"),, "Квалифицированные инвесторы", Ложь);
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма[Имя].ОсновнаяТаблица = "РегистрСведений.КвалифицированныеИнвесторы";
	
	// создадим на форме соответствующие элементы
	Страница = СоздатьСтраницу("Группа" + Имя, "Квалифицированные инвесторы", Форма, ГруппаВладелец, ТолькоПросмотр);
	
	ТаблицаДинамическогоСписка = Форма.Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Страница);
	ТаблицаДинамическогоСписка.ПутьКДанным           = Имя;
	ТаблицаДинамическогоСписка.ВысотаВСтрокахТаблицы = 5;
	
	    // подчиненные поля-колонки
		Для каждого ОписаниеПоля Из ОписаниеПолейКвалифицированныеИнвесторы Цикл
			Если ОписаниеПоля.Имя <> "ЮрФизЛицо" Тогда
				НовыйЭлемент = Форма.Элементы.Добавить(Имя + ОписаниеПоля.Имя, Тип("ПолеФормы"), ТаблицаДинамическогоСписка);
				НовыйЭлемент.ПутьКДанным = Имя + "." + ОписаниеПоля.Имя;
				НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.Заголовок   = ОписаниеПоля.Синоним;
				
				// длинные строки на общем фоне смотрятся не красиво
				Если Строка(ОписаниеПоля.Тип) = "Строка" Тогда
					Если ОписаниеПоля.Тип.КвалификаторыСтроки.Длина > 25 Тогда
						НовыйЭлемент.Ширина = 25;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Список = Форма[Имя].Отбор;
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(Список, "ЮрФизЛицо",, ВидСравненияКомпоновкиДанных.Равно, ЮрФизЛицо,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
КонецПроцедуры // СоздатьДинамическийСписокКонтактнойИнформации

Процедура СоздатьДинамическийСписокКонтактнойИнформации(Имя, Форма, ГруппаВладелец, ЮрФизЛицо, СоздатьСтраницу = Истина, ТолькоПросмотр = Истина) Экспорт
	
	// нас будут интересовать все измерения, ресурсы и реквизиты данного списка
	ОписаниеПолейКонтактнойИнформации = РаботаСМетаданнымиПовтИсп.ПолучитьОписаниеПолейРегистра("РегистрыСведений", "КонтактнаяИнформация");
	
	// все таблицы контактных лиц на форме будут связаны с одним динамическим списком
	ДобавляемыеРеквизиты = Новый Массив();
	
	ДинамическийСписок = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("ДинамическийСписок"),, "Контактная информация", Ложь);
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма[Имя].ОсновнаяТаблица = "РегистрСведений.КонтактнаяИнформация";
	
	// создадим на форме соответствующие элементы
	Если СоздатьСтраницу Тогда 
		Страница = СоздатьСтраницу("Группа" + Имя, "Контактная информация", Форма, ГруппаВладелец, ТолькоПросмотр);
	Иначе
		Страница = СоздатьГоризонтальнуюГруппуЭлементов("Группа" + Имя, Форма, ГруппаВладелец);  	
	КонецЕсли;
	
	ТаблицаДинамическогоСписка = Форма.Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Страница);
	ТаблицаДинамическогоСписка.ПутьКДанным           = Имя;
	ТаблицаДинамическогоСписка.ВысотаВСтрокахТаблицы = 5;
	
	    // подчиненные поля-колонки
		Для каждого ОписаниеПоля Из ОписаниеПолейКонтактнойИнформации Цикл
			Если ОписаниеПоля.Имя <> "Объект" Тогда
				НовыйЭлемент = Форма.Элементы.Добавить(Имя + ОписаниеПоля.Имя, Тип("ПолеФормы"), ТаблицаДинамическогоСписка);
				НовыйЭлемент.ПутьКДанным = Имя + "." + ОписаниеПоля.Имя;
				НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.Заголовок   = ОписаниеПоля.Синоним;
				
				// длинные строки на общем фоне смотрятся не красиво
				Если Строка(ОписаниеПоля.Тип) = "Строка" Тогда
					Если ОписаниеПоля.Тип.КвалификаторыСтроки.Длина > 25 Тогда
						НовыйЭлемент.Ширина = 25;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Список = Форма[Имя].Отбор;
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(Список, "Объект",, ВидСравненияКомпоновкиДанных.Равно, ЮрФизЛицо,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
КонецПроцедуры // СоздатьДинамическийСписокКонтактнойИнформации

Процедура ЗаполнитьКонтактнуюИнформациюИзАнкет(Организация, Имя, Форма, ГруппаВладелец, ЮрФизЛицо, ТолькоПросмотр = Истина)
		
	// Для анкетных данных список полей известен заранее	
	
	ВидыКонтактнойИнформации = Новый Структура;
	ВидыКонтактнойИнформации.Вставить("EMail", "E-mail");
	ВидыКонтактнойИнформации.Вставить("Телефоны", "Телефоны");
	ВидыКонтактнойИнформации.Вставить("ПочтовыйАдрес", "Почтовый адрес");
	
	Если ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		ВидыКонтактнойИнформации.Вставить("АдресРегистрации", "Адрес регистрации");
		ВидыКонтактнойИнформации.Вставить("АдресМестаЖительства", "Адрес места жительства");
	ИначеЕсли ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		ВидыКонтактнойИнформации.Вставить("ЮридическийАдрес", "Юридический адрес");
		ВидыКонтактнойИнформации.Вставить("ФактическийАдрес", "Фактический адрес");
	КонецЕсли;
	
	// Добавляем реквизиты
	
	ДобавляемыеРеквизиты = Новый Массив();	
	
	Для Каждого ВидКИ Из ВидыКонтактнойИнформации Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Имя + ВидКИ.Ключ, Новый ОписаниеТипов("Строка"), , ВидКИ.Значение, Ложь));	
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
	// Заполняем данными
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СписокПолей
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = &Язык) КАК РеквизитыАнкетныеСрезПоследних
		|");
	Запрос.УстановитьПараметр("Период",			ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо",		ЮрФизЛицо);        
	Запрос.УстановитьПараметр("Язык",			Справочники.Языки.Русский);
	
	Если ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеквизитыФизическихЛицАнкетные", "РеквизитыЮридическихЛицАнкетные");
	КонецЕсли;
	
	СписокПолейСтрокой = "";
	Для Каждого ВидКИ Из ВидыКонтактнойИнформации Цикл
		СписокПолейСтрокой = СписокПолейСтрокой + ВидКИ.Ключ + ", ";	
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СписокПолей", Лев(СписокПолейСтрокой, СтрДлина(СписокПолейСтрокой) - 2));
	
	КонтактнаяИнформация = Запрос.Выполнить().Выбрать();
	Если КонтактнаяИнформация.Следующий() Тогда
		Для Каждого ВидКИ Из ВидыКонтактнойИнформации Цикл
			Форма[Имя + ВидКИ.Ключ] = КонтактнаяИнформация[ВидКИ.Ключ];	
		КонецЦикла;
	КонецЕсли;
	
	// Добавляем элементы 
	
	Страница = СоздатьСтраницу("Группа" + Имя, "Контактная информация", Форма, ГруппаВладелец, ТолькоПросмотр);
	
	Для Каждого ВидКИ Из ВидыКонтактнойИнформации Цикл
		НовыйЭлемент = Форма.Элементы.Добавить(Имя + ВидКИ.Ключ, Тип("ПолеФормы"), Страница);
		НовыйЭлемент.ПутьКДанным			= Имя + ВидКИ.Ключ;
		НовыйЭлемент.Вид					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок				= ВидКИ.Значение;
		НовыйЭлемент.АвтоМаксимальнаяШирина	= Ложь;
	КонецЦикла;

КонецПроцедуры

Процедура НастроитьВидимостьРеквизитов(Форма)
	
	Если Форма.Элементы.Найти("ФизЛицоДатаСмерти") <> Неопределено Тогда
		Форма.Элементы.ФизЛицоДатаСмерти.Видимость						= ЗначениеЗаполнено(Форма.ФизЛицоДатаСмерти);
		Форма.Элементы.ФизЛицоДатаПолученияДокументовОСмерти.Видимость	= ЗначениеЗаполнено(Форма.ФизЛицоДатаСмерти);
	КонецЕсли;
	
КонецПроцедуры
