
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Контроль цены сделок", 
		"0.01", 
		"", 
		Истина,);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета)	Экспорт
	
	Перем Отказ;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Истина);
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);	
	
КонецПроцедуры	

Процедура Сформировать(ДокументРезультат, ТолькоРазницу) Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

		
#Область Запрос

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(УсловияСделок.Период, ДЕНЬ) КАК Дата,
	|	УсловияСделок.Сделка КАК ДокументСделка,
	|	УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
	|	УсловияСделок.Цена КАК Цена,
	|	УсловияСделок.Количество КАК Количество,
	|	УсловияСделок.Сумма КАК Сумма,
	|	СделкаЦенныеБумаги.Ссылка.ВалютаСделки КАК ВалютаСделки,
	|	СделкаЦенныеБумаги.Ссылка.РежимБиржевыхТоргов КАК РежимБиржевыхТоргов,
	|	ЕСТЬNULL(СделкаЦенныеБумаги.Ссылка.РежимБиржевыхТоргов.ОсновнойРежим, ЛОЖЬ) КАК ОсновнойРежим,
	|	ВЫБОР
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|			ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование)
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование)
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Доли
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование)
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование)
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Закладные
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Закладные).Банк.Наименование)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Эмитент,
	|	ВЫБОР
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|				И ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|				И ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|				И ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|				И ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|				И ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Векселя).Номер
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|				И ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
	|		ИНАЧЕ КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код
	|	КОНЕЦ КАК РегистрационныйНомер,
	|	ВЫБОР
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Доли
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
	|		КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|			ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаНоминала,
	|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN,
	|	СделкаЦенныеБумаги.Ссылка.МестоХранения КАК СделкаМестоХранения,
	|	СделкаЦенныеБумаги.Ссылка.НомерСделки КАК НомерСделки,
	|	СделкаЦенныеБумаги.Ссылка.ВидСделки КАК ВидСделки,
	|	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, СделкаЦенныеБумаги.Ссылка.Контрагент) КАК Контрагент,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность
	|ПОМЕСТИТЬ _Сделки
	|ИЗ
	|	РегистрСведений.УсловияСделок КАК УсловияСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних КАК КодыВТорговыхСистемахСрезПоследних
	|		ПО УсловияСделок.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
	|			И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаКонца, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
	|		ПО УсловияСделок.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&ДатаКонца,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Доли
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Закладные
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
	|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаКонца, ) КАК РеквизитыПИФСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
	|		ПО УсловияСделок.Сделка = СделкаЦенныеБумаги.Ссылка
	|			И УсловияСделок.НомерСтроки = СделкаЦенныеБумаги.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (ВЫБОР
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Доли
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
	|				КОГДА УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|					ТОГДА ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
	|				ИНАЧЕ """"
	|			КОНЕЦ = КурсыВалют.Валюта)
	|			И (НАЧАЛОПЕРИОДА(УсловияСделок.Период, ДЕНЬ) = КурсыВалют.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	|		ПО УсловияСделок.Сделка = ЗначенияДополнительныхСведений.Объект
	|			И (ЗначенияДополнительныхСведений.Свойство = &Свойство)
	|ГДЕ
	|	УсловияСделок.Организация = &Организация
	|	И УсловияСделок.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И УсловияСделок.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходыПоСделкеОбороты.Сделка КАК Сделка,
	|	РасходыПоСделкеОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
	|	РасходыПоСделкеОбороты.Валюта КАК Валюта,
	|	СУММА(РасходыПоСделкеОбороты.СуммаОборот) КАК СуммаРасход
	|ПОМЕСТИТЬ _Расходы
	|ИЗ
	|	РегистрНакопления.РасходыПоСделке.Обороты(
	|			&ДатаНачала,
	|			&ДатаКонца,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделкеОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходыПоСделкеОбороты.Сделка,
	|	РасходыПоСделкеОбороты.ЦеннаяБумага,
	|	РасходыПоСделкеОбороты.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	_Сделки.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ _ЦенныеБумаги
	|ИЗ
	|	_Сделки КАК _Сделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыНоминалов.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДатыНоминалов.Дата КАК Дата,
	|	НоминалыЦенныхБумаг.Номинал КАК Номинал
	|ПОМЕСТИТЬ _НоминалыНаДатуСделки
	|ИЗ
	|	(ВЫБРАТЬ
	|		_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
	|		_Сделки.Дата КАК Дата,
	|		МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ДатаНоминала
	|	ИЗ
	|		_Сделки КАК _Сделки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
	|			ПО _Сделки.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
	|	
	|	СГРУППИРОВАТЬ ПО
	|		_Сделки.ЦеннаяБумага,
	|		_Сделки.Дата) КАК ДатыНоминалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
	|		ПО ДатыНоминалов.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
	|			И ДатыНоминалов.ДатаНоминала = НоминалыЦенныхБумаг.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КотировкиТорговыхПлощадокСводные.Период КАК Период,
	|	КотировкиТорговыхПлощадокСводные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КотировкиТорговыхПлощадокСводные.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводные.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводные.ADMITTEDQUOTE
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводные.HIGH
	|	КОНЕЦ КАК HIGH,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводные.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводные.ADMITTEDQUOTE_DATE
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводные.HIGH_DATE
	|	КОНЕЦ КАК HIGH_DATE,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводные.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводные.BID
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводные.LOW
	|	КОНЕЦ КАК LOW,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводные.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводные.BID_DATE
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводные.LOW_DATE
	|	КОНЕЦ КАК LOW_DATE,
	|	КотировкиТорговыхПлощадокСводные.Биржа КАК Биржа,
	|	КотировкиТорговыхПлощадокСводные.РежимТоргов КАК РежимТоргов
	|ПОМЕСТИТЬ _Котировки
	|ИЗ
	|	РегистрСведений.КотировкиТорговыхПлощадокСводные КАК КотировкиТорговыхПлощадокСводные
	|ГДЕ
	|	КотировкиТорговыхПлощадокСводные.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И КотировкиТорговыхПлощадокСводные.ЦеннаяБумага В
	|			(ВЫБРАТЬ
	|				_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
	|			ИЗ
	|				_ЦенныеБумаги КАК _ЦенныеБумаги)
	|	И (КотировкиТорговыхПлощадокСводные.РежимТоргов.ОсновнойРежим
	|			ИЛИ КотировкиТорговыхПлощадокСводные.РежимТоргов = &BloomberBGN)
	|	И НЕ КотировкиТорговыхПлощадокСводные.РежимТоргов.РЕПО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Период,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Валюта,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ADMITTEDQUOTE
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводныеСрезПоследних.HIGH
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ADMITTEDQUOTE_DATE
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводныеСрезПоследних.HIGH_DATE
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.BID
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводныеСрезПоследних.LOW
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов = &BloomberBGN
	|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.BID_DATE
	|		ИНАЧЕ КотировкиТорговыхПлощадокСводныеСрезПоследних.LOW_DATE
	|	КОНЕЦ,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Биржа,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов
	|ИЗ
	|	РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
	|			&ДатаНачала,
	|			ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
	|					ИЗ
	|						_ЦенныеБумаги КАК _ЦенныеБумаги)
	|				И (РежимТоргов.ОсновнойРежим
	|					ИЛИ РежимТоргов = &BloomberBGN)
	|				И НЕ РежимТоргов.РЕПО) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Котировки.Период КАК Период,
	|	_Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Котировки.Валюта КАК Валюта,
	|	МАКСИМУМ(_Котировки.HIGH) КАК HIGH,
	|	_Котировки.HIGH_DATE КАК HIGH_DATE,
	|	МИНИМУМ(_Котировки.LOW) КАК LOW,
	|	_Котировки.LOW_DATE КАК LOW_DATE
	|ПОМЕСТИТЬ _КотировкиОбщие
	|ИЗ
	|	_Котировки КАК _Котировки
	|ГДЕ
	|	_Котировки.LOW > 0
	|	И _Котировки.HIGH > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	_Котировки.Период,
	|	_Котировки.ЦеннаяБумага,
	|	_Котировки.Валюта,
	|	_Котировки.HIGH_DATE,
	|	_Котировки.LOW_DATE
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Сделки.Дата КАК Дата,
	|	_Сделки.ДокументСделка КАК ДокументСделка,
	|	_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Котировки.Валюта КАК Валюта,
	|	_Котировки.РежимТоргов КАК РежимТоргов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА _Котировки.HIGH * _НоминалыНаДатуСделки.Номинал / 100
	|		ИНАЧЕ _Котировки.HIGH
	|	КОНЕЦ КАК МаксимальнаяЦена,
	|	_Котировки.HIGH_DATE КАК ДатаМаксимальнойЦены,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА _Котировки.LOW * _НоминалыНаДатуСделки.Номинал / 100
	|		ИНАЧЕ _Котировки.LOW
	|	КОНЕЦ КАК МинимальнаяЦена,
	|	_Котировки.LOW_DATE КАК ДатаМинимальнойЦены
	|ПОМЕСТИТЬ _КотировкиНаДатыСделок
	|ИЗ
	|	_Сделки КАК _Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Котировки КАК _Котировки
	|		ПО _Сделки.Дата = _Котировки.Период
	|			И _Сделки.ЦеннаяБумага = _Котировки.ЦеннаяБумага
	|			И (_Котировки.Валюта = _Сделки.ВалютаСделки)
	|			И (_Котировки.РежимТоргов = _Сделки.РежимБиржевыхТоргов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НоминалыНаДатуСделки КАК _НоминалыНаДатуСделки
	|		ПО _Сделки.Дата = _НоминалыНаДатуСделки.Дата
	|			И _Сделки.ЦеннаяБумага = _НоминалыНаДатуСделки.ЦеннаяБумага
	|ГДЕ
	|	_Сделки.ОсновнойРежим
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_Сделки.Дата,
	|	_Сделки.ДокументСделка,
	|	_Сделки.ЦеннаяБумага,
	|	_КотировкиОбщие.Валюта,
	|	ЗНАЧЕНИЕ(Справочник.РежимыБиржевыхТоргов.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА _КотировкиОбщие.HIGH * _НоминалыНаДатуСделки.Номинал / 100
	|		ИНАЧЕ _КотировкиОбщие.HIGH
	|	КОНЕЦ,
	|	_КотировкиОбщие.HIGH_DATE,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА _КотировкиОбщие.LOW * _НоминалыНаДатуСделки.Номинал / 100
	|		ИНАЧЕ _КотировкиОбщие.LOW
	|	КОНЕЦ,
	|	_КотировкиОбщие.LOW_DATE
	|ИЗ
	|	_Сделки КАК _Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиОбщие КАК _КотировкиОбщие
	|		ПО _Сделки.Дата = _КотировкиОбщие.Период
	|			И _Сделки.ЦеннаяБумага = _КотировкиОбщие.ЦеннаяБумага
	|			И (_КотировкиОбщие.Валюта = _Сделки.ВалютаСделки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НоминалыНаДатуСделки КАК _НоминалыНаДатуСделки
	|		ПО _Сделки.Дата = _НоминалыНаДатуСделки.Дата
	|			И _Сделки.ЦеннаяБумага = _НоминалыНаДатуСделки.ЦеннаяБумага
	|ГДЕ
	|	НЕ _Сделки.ОсновнойРежим
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_Сделки.Дата КАК Дата,
	|	_Сделки.Эмитент КАК Эмитент,
	|	_Сделки.РегистрационныйНомер КАК РегистрационныйНомер,
	|	_Сделки.ISIN КАК ISIN,
	|	_Сделки.СделкаМестоХранения КАК СделкаМестоХранения,
	|	_Сделки.НомерСделки КАК НомерСделки,
	|	_Сделки.РежимБиржевыхТоргов КАК РежимБиржевыхТоргов,
	|	_Сделки.Контрагент КАК Контрагент,
	|	_Сделки.ВидСделки КАК ВидСделки,
	|	_Сделки.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА _Сделки.ВалютаНоминала = &ВалютаРубль
	|			ТОГДА 0
	|		ИНАЧЕ _Сделки.Цена
	|	КОНЕЦ КАК ЦенаВал,
	|	ВЫБОР
	|		КОГДА _Сделки.ВалютаНоминала = &ВалютаРубль
	|			ТОГДА _Сделки.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(_Сделки.Цена * _Сделки.Курс / _Сделки.Кратность КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК ЦенаРуб,
	|	ВЫБОР
	|		КОГДА _Сделки.ВалютаНоминала = &ВалютаРубль
	|			ТОГДА 0
	|		ИНАЧЕ _Сделки.Сумма
	|	КОНЕЦ КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА _Сделки.ВалютаНоминала = &ВалютаРубль
	|			ТОГДА _Сделки.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(_Сделки.Сумма * _Сделки.Курс / _Сделки.Кратность КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК СуммаРуб,
	|	ЕСТЬNULL(_Расходы.СуммаРасход, 0) КАК СуммаРасход,
	|	ВЫБОР
	|		КОГДА _Сделки.ВалютаНоминала = &ВалютаРубль
	|			ТОГДА _Сделки.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(_Сделки.Сумма * _Сделки.Курс / _Сделки.Кратность КАК ЧИСЛО(19, 2))
	|	КОНЕЦ + ЕСТЬNULL(_Расходы.СуммаРасход, 0) КАК СуммаСУчетомЗатрат,
	|	ВЫБОР
	|		КОГДА _Сделки.ВалютаНоминала = &ВалютаРубль
	|			ТОГДА _КотировкиНаДатыСделок.МинимальнаяЦена
	|		ИНАЧЕ ВЫРАЗИТЬ(_КотировкиНаДатыСделок.МинимальнаяЦена * _Сделки.Курс / _Сделки.Кратность КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК МинимальнаяЦенаРуб,
	|	ВЫБОР
	|		КОГДА _Сделки.ВалютаНоминала = &ВалютаРубль
	|			ТОГДА _КотировкиНаДатыСделок.МаксимальнаяЦена
	|		ИНАЧЕ ВЫРАЗИТЬ(_КотировкиНаДатыСделок.МаксимальнаяЦена * _Сделки.Курс / _Сделки.Кратность КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК МаксимальнаяЦенаРуб,
	|	ВЫБОР
	|		КОГДА _Сделки.Дата = _КотировкиНаДатыСделок.ДатаМинимальнойЦены
	|				И _Сделки.Дата = _КотировкиНаДатыСделок.ДатаМаксимальнойЦены
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		КОГДА _Сделки.Дата <> _КотировкиНаДатыСделок.ДатаМинимальнойЦены
	|			ТОГДА _КотировкиНаДатыСделок.ДатаМинимальнойЦены
	|		КОГДА _Сделки.Дата <> _КотировкиНаДатыСделок.ДатаМаксимальнойЦены
	|			ТОГДА _КотировкиНаДатыСделок.ДатаМаксимальнойЦены
	|	КОНЕЦ КАК ДатаЦены,
	|	_КотировкиНаДатыСделок.ДатаМинимальнойЦены КАК ДатаМинимальнойЦены,
	|	_КотировкиНаДатыСделок.ДатаМаксимальнойЦены КАК ДатаМаксимальнойЦены,
	|	_КотировкиНаДатыСделок.МинимальнаяЦена КАК МинимальнаяЦена,
	|	_КотировкиНаДатыСделок.МаксимальнаяЦена КАК МаксимальнаяЦена,
	|	ВЫБОР
	|		КОГДА _Сделки.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	|			ТОГДА ВЫБОР
	|					КОГДА _Сделки.Цена <= _КотировкиНаДатыСделок.МаксимальнаяЦена
	|						ТОГДА 0
	|					ИНАЧЕ _Сделки.Цена - _КотировкиНаДатыСделок.МаксимальнаяЦена
	|				КОНЕЦ
	|		КОГДА _Сделки.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	|			ТОГДА ВЫБОР
	|					КОГДА _Сделки.Цена >= _КотировкиНаДатыСделок.МинимальнаяЦена
	|						ТОГДА 0
	|					ИНАЧЕ _Сделки.Цена - _КотировкиНаДатыСделок.МинимальнаяЦена
	|				КОНЕЦ
	|	КОНЕЦ КАК Отклонение,
	|	ВЫБОР
	|		КОГДА _Сделки.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	|			ТОГДА ВЫБОР
	|					КОГДА _Сделки.Цена <= _КотировкиНаДатыСделок.МаксимальнаяЦена
	|						ТОГДА 0
	|					ИНАЧЕ (_Сделки.Цена - _КотировкиНаДатыСделок.МаксимальнаяЦена) * _Сделки.Количество
	|				КОНЕЦ
	|		КОГДА _Сделки.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	|			ТОГДА ВЫБОР
	|					КОГДА _Сделки.Цена >= _КотировкиНаДатыСделок.МинимальнаяЦена
	|						ТОГДА 0
	|					ИНАЧЕ (_Сделки.Цена - _КотировкиНаДатыСделок.МинимальнаяЦена) * _Сделки.Количество
	|				КОНЕЦ
	|	КОНЕЦ КАК Корректировка
	|ИЗ
	|	_Сделки КАК _Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиНаДатыСделок КАК _КотировкиНаДатыСделок
	|		ПО _Сделки.ДокументСделка = _КотировкиНаДатыСделок.ДокументСделка
	|			И _Сделки.ЦеннаяБумага = _КотировкиНаДатыСделок.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Расходы КАК _Расходы
	|		ПО _Сделки.ДокументСделка = _Расходы.Сделка
	|			И _Сделки.ЦеннаяБумага = _Расходы.ЦеннаяБумага
	|ГДЕ
	|	(&ТолькоРазницу
	|				И ВЫБОР
	|					КОГДА _Сделки.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	|						ТОГДА ВЫБОР
	|								КОГДА _Сделки.Цена <= _КотировкиНаДатыСделок.МаксимальнаяЦена
	|									ТОГДА 0
	|								ИНАЧЕ _Сделки.Цена - _КотировкиНаДатыСделок.МаксимальнаяЦена
	|							КОНЕЦ
	|					КОГДА _Сделки.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
	|						ТОГДА ВЫБОР
	|								КОГДА _Сделки.Цена >= _КотировкиНаДатыСделок.МинимальнаяЦена
	|									ТОГДА 0
	|								ИНАЧЕ _Сделки.Цена - _КотировкиНаДатыСделок.МинимальнаяЦена
	|							КОНЕЦ
	|				КОНЕЦ <> 0
	|			ИЛИ НЕ &ТолькоРазницу)";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачала", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("BloomberBGN", ОбщегоНазначения.ПолучитьИменованныйОбъект("Bloomberg_BGN"));
	Запрос.УстановитьПараметр("ВалютаРубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Запрос.УстановитьПараметр("ТолькоРазницу", ТолькоРазницу);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "_РаскрытыйКонтрагент"));
	
#КонецОбласти
		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);


	ДокументРезультат.Очистить();
	Макет = ПолучитьМакет("Отчет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ЭтотОбъект.Период.ДатаОкончания, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);	
	ОбластьШапка.Параметры.ДатаДоговора		= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодОтчета 	= ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, "ФП=Истина");
	
	ДокументРезультат.Вывести(ОбластьШапка); 
	
	//данные 
	Пока Выборка.Следующий() Цикл 
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;	
		
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры	