
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого СтрокаЗакрытиеПериода Из Параметры.ЗакрытиеПериода Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма.ЗакрытиеПериода.Добавить(), СтрокаЗакрытиеПериода);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	СтрокиКПерезаполнению = ЭтаФорма.ЗакрытиеПериода.НайтиСтроки(Новый Структура("Перезаполнить", Истина));
	Результат = Новый Массив;
	Для каждого СтрокаСтрокиКПерезаполнению Из СтрокиКПерезаполнению Цикл
		Результат.Добавить(СтрокаСтрокиКПерезаполнению.РегистрацияСтоимостиАктивов);
	КонецЦикла; 
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	УстановитьФлаги(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	УстановитьФлаги(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Значение)

	Для каждого Элемент Из ЭтаФорма.ЗакрытиеПериода Цикл
		Элемент.Перезаполнить = Значение;
	КонецЦикла; 

КонецПроцедуры
 
