
// Получает значение реквизита формы
//
// Параметры:
//   Форма         -
//   ПутьРеквизита - строка, путь к данным, например: "Объект.МесяцНачисления"
//
Функция ПолучитьРеквизитФормыПоПути(Форма, ПутьРеквизита) Экспорт
	
	МассивИмен = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьРеквизита, ".");
	
	Объект        = Форма;
	ПоследнееПоле = МассивИмен[МассивИмен.Количество()-1];
	
	Для Сч = 0 По МассивИмен.Количество()-2 Цикл
		Объект = Объект[МассивИмен[Сч]]
	КонецЦикла;
	
	Возврат Объект[ПоследнееПоле];
	
КонецФункции

// Устанавливает значение реквизиту формы
//
// Параметры:
//   Форма                -
//   ПутьРеквизита        - строка, путь к данным, например: "Объект.МесяцНачисления"
//   Значение             -
//   ТолькоЕслиНеЗаполнен - 
//
Процедура УстановитьРеквизитФормыПоПути(Форма, ПутьРеквизита, Значение, ТолькоЕслиНеЗаполнен = Ложь) Экспорт
	
	МассивИмен = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьРеквизита, ".");
	
	Объект        = Форма;
	ПоследнееПоле = МассивИмен[МассивИмен.Количество()-1];
	
	Для Сч = 0 По МассивИмен.Количество()-2 Цикл
		Объект = Объект[МассивИмен[Сч]]
	КонецЦикла;
	
	Если ТипЗнч(Объект) = Тип("ДанныеФормыКоллекция") Тогда
		
		Для Сч = 0 По Объект.Количество() - 1 Цикл
			
			Если НЕ ТолькоЕслиНеЗаполнен ИЛИ НЕ ЗначениеЗаполнено(Объект[Сч][ПоследнееПоле]) Тогда
				Объект[Сч][ПоследнееПоле] = Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
	
		Если НЕ ТолькоЕслиНеЗаполнен ИЛИ НЕ ЗначениеЗаполнено(Объект[ПоследнееПоле]) Тогда
			Объект[ПоследнееПоле] = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует шаблон результата выполнения
//
// Возвращаемое значение: 
//   Результат (Структура) - См. РаботаСФормамиКлиент.ПоказатьРезультатВыполнения()
//
Функция НовыйРезультатВыполнения(Результат = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Результат = Новый Структура;
	КонецЕсли;
	
	Результат.Вставить("ВыводОповещения",     Новый Структура("Использование, Заголовок, Ссылка, Текст, Картинка", Ложь));
	Результат.Вставить("ВыводСообщения",      Новый Структура("Использование, Текст, ПутьКРеквизитуФормы", Ложь));
	Результат.Вставить("ВыводПредупреждения", Новый Структура("Использование, Текст, ПутьКРеквизитуФормы, ТекстОшибок", Ложь));
	
	Результат.Вставить("ОповещениеФорм",                Новый Структура("Использование, ИмяСобытия, Параметр, Источник", Ложь));
	Результат.Вставить("ОповещениеДинамическихСписков", Новый Структура("Использование, СсылкаИлиТип", Ложь));
	
	Возврат Результат;
	
КонецФункции

// Добавляет в оповещение для динамических списков типы из массива измененных объектов
//
// Параметры:
//   ИзмененныеОбъекты (Массив) - Ссылки измененных объектов программы
//   Результат (Структура)      - РаботаСФормамиКлиент.ПоказатьРезультатВыполнения()
//
Процедура ПодготовитьОповещениеДинамическихСписков(Знач ИзмененныеОбъекты, Результат) Экспорт
	
	Если ТипЗнч(ИзмененныеОбъекты) <> Тип("Массив") Или ИзмененныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Результат.ОповещениеДинамическихСписков;
	Оповещение.Использование = Истина;
	
	ЗначениеОповещения = Оповещение.СсылкаИлиТип;
	ЗначениеОповещенияЗаполнено = ЗначениеЗаполнено(ЗначениеОповещения);
	
	Если ИзмененныеОбъекты.Количество() = 1 И Не ЗначениеОповещенияЗаполнено Тогда
		Оповещение.СсылкаИлиТип = ИзмененныеОбъекты[0];
	Иначе
		// Преобразование оповещения в массив
		ЗначениеОповещенияТип = ТипЗнч(ЗначениеОповещения);
		Если ЗначениеОповещенияТип <> Тип("Массив") Тогда
			Оповещение.СсылкаИлиТип = Новый Массив;
			Если ЗначениеОповещенияЗаполнено Тогда
				Оповещение.СсылкаИлиТип.Добавить(?(ЗначениеОповещенияТип = Тип("Тип"), ЗначениеОповещения, ЗначениеОповещенияТип));
			КонецЕсли;
		КонецЕсли;
		
		// Добавление типов измененных объектов
		Для Каждого ИзмененныйОбъект Из ИзмененныеОбъекты Цикл
			ТипИзмененногоОбъекта = ТипЗнч(ИзмененныйОбъект);
			Если Оповещение.СсылкаИлиТип.Найти(ТипИзмененногоОбъекта) = Неопределено Тогда
				Оповещение.СсылкаИлиТип.Добавить(ТипИзмененногоОбъекта);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


// Процедура управляет состояние поля табличного документа
//
// Параметры:
//     ПолеТабличногоДокумента (ПолеФормы) - поле формы с видом ПолеТабличногоДокумента
//     Состояние (Строка) - задает вид состояния
//     Текст (Строка) - текст в отображении состояния
//
Процедура УстановитьСостояниеПоляТабличногоДокумента(ПолеТабличногоДокумента, Состояние = "НеИспользовать", Текст = "") Экспорт
	
	Если ТипЗнч(ПолеТабличногоДокумента) = Тип("ПолеФормы") 
		И ПолеТабличногоДокумента.Вид = ВидПоляФормы.ПолеТабличногоДокумента
	Тогда
		ОтображениеСостояния = ПолеТабличногоДокумента.ОтображениеСостояния;
		Если      ВРег(Состояние) = "НЕИСПОЛЬЗОВАТЬ" Тогда
			ОтображениеСостояния.Видимость                      = Ложь;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = Текст;
		ИначеЕсли ВРег(Состояние) = "НЕАКТУАЛЬНОСТЬ" Тогда
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = ?(ПустаяСтрока(Текст), НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.'"), Текст);
		ИначеЕсли ВРег(Состояние) = "ФОРМИРОВАНИЕОТЧЕТА" Тогда  
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
			ОтображениеСостояния.Текст                          = ?(ПустаяСтрока(Текст), НСтр("ru = 'Отчет формируется...'"), Текст);
		Иначе
			ВызватьИсключение(НСтр("ru = 'Недопустимое значение параметра (параметр номер ''2'')'"));
		КонецЕсли;
	Иначе
		ВызватьИсключение(НСтр("ru = 'Недопустимое значение параметра (параметр номер ''1'')'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаголовокФормыСписка(Форма, Знач Заголовок, Период) Экспорт

	Если Форма.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Если Форма.Период.ДатаНачала = Дата(1, 1, 1) И Форма.Период.ДатаОкончания = Дата(1, 1, 1) Тогда
			Заголовок = Заголовок + " (Без ограничения)";
		Иначе
			Заголовок = Заголовок + " (с " + Форма.Период.ДатаНачала + " по " + Форма.Период.ДатаОкончания + ")";
		КонецЕсли;
	Иначе
		Заголовок = Заголовок + " (" + Форма.Период.Вариант + ")";
	КонецЕсли;
	
	Форма.Заголовок = Заголовок;
	
КонецПроцедуры // УстановитьЗаголовокФормыСписка

Процедура УстановитьТекущуюСтрокуТаблицы(Форма, ИмяТаблицы, ДанныеТекущейСтроки) Экспорт
	
	Если Форма.Параметры.Свойство("ТекущиеДанные") И ТипЗнч(ДанныеТекущейСтроки) = Тип("Структура") Тогда
		Для НомСтр = 0 По Форма[ИмяТаблицы].Количество() - 1 Цикл
			СтрокаТаблицы = Форма[ИмяТаблицы][НомСтр];
			
			НайденоПолноеСоответствие = Истина;
			
			Для каждого КлючЗнч Из ДанныеТекущейСтроки Цикл
				Если СтрокаТаблицы[КлючЗнч.Ключ] <> КлючЗнч.Значение Тогда
					НайденоПолноеСоответствие = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденоПолноеСоответствие Тогда
				Форма.Элементы[ИмяТаблицы].ТекущаяСтрока = НомСтр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // НайденоПолноеСоответствие

//Процедура очистки значений скрываемых и/или зависимых реквизитов по свойству "видимость"
//
//Параметры:
//	Форма                                  - форма клиентского приложения.
//	ПутьКДаннымСкрываемыхПолей (Структура) - ключ (имя скрываемого элемента формы), значение (строка/массив строк, путь к реквизиту, который нужно очистить).
//
Процедура ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей) Экспорт
	
	Элементы = Форма.Элементы;
	
	Для Каждого СкрытоеПоле Из ПутьКДаннымСкрываемыхПолей Цикл
		
		Если Не Элементы[СкрытоеПоле.Ключ].Видимость Тогда
			
			Если ТипЗнч(СкрытоеПоле.Значение) = Тип("Массив") Тогда
				
				Для Каждого ПутьКРеквизиту Из СкрытоеПоле.Значение Цикл
					
					УстановитьРеквизитФормыПоПути(Форма, ПутьКРеквизиту, Неопределено);
					
				КонецЦикла;
				
			Иначе
			
				УстановитьРеквизитФормыПоПути(Форма, СкрытоеПоле.Значение, Неопределено);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;	
		
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, объект которой нужно записать
//
// Возвращаемое значение:
//   Булево   - Истина - успешно записан; Ложь - в противном случае.
//
Функция ЗаписатьФорму(Форма) Экспорт
	
	Попытка
		ЗаписанУспешно = Форма.Записать();
	Исключение
	    ЗаписанУспешно = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось выполнить запись.%1Система сообщает: %2", Символы.ПС, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	
	Возврат ЗаписанУспешно;
	
КонецФункции