
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	// Параметры по умолчанию
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтаФорма.СвойстваОбработки = Новый Структура("ОбработкаИзСправочника, ИмяОбработки, Ссылка");
	ЭтаФорма.СвойстваОбработки.ОбработкаИзСправочника	= СтрНачинаетсяС(ОбработкаОбъект.ИспользуемоеИмяФайла, "e1cib\tempstorage\");
	ЭтаФорма.СвойстваОбработки.ИмяОбработки				= ?(ЭтаФорма.СвойстваОбработки.ОбработкаИзСправочника, ОбработкаОбъект.Метаданные().Имя, ОбработкаОбъект.ИспользуемоеИмяФайла);
	ЭтаФорма.СвойстваОбработки.Ссылка					= РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта(ЭтаФорма.СвойстваОбработки.ИмяОбработки);
	
	Объект.Организация										= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период.ДатаОкончания								= НачалоДня(ТекущаяДата()) - 1;
	Объект.Период.ДатаНачала								= НачалоМесяца(Объект.Период.ДатаОкончания);
	Объект.ПроверитьЗаписиЖурналаСверокПоВнутреннемуУчету	= Ложь;
	Объект.ПроверитьЗаписиЖурналаПодтверждений				= Ложь;
	
	ЭтаФорма.ОперацииВнутреннегоУчета	= ОбщегоНазначения.ПолучитьИменованныйОбъект("ОперацииВнутреннегоУчета");
	ЭтаФорма.МаксимумАктивныхЗаданий	= 5;
	ЭтаФорма.ПериодОбновления			= 1;
	
	// Доступность реквизитов и команд в зависимости от прав
	
	ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Элементы.Организация.Видимость						= ЭтоПолноправныйПользователь;
	Элементы.ОрганизацияНадпись.Видимость				= Не Элементы.Организация.Видимость;
	
	Элементы.МаксимумАктивныхЗаданий.Видимость			= ЭтоПолноправныйПользователь;
	Элементы.ПериодОбновления.Видимость					= ЭтоПолноправныйПользователь;
	
	Элементы.ФормаКомандаПолучитьТекстЗапроса.Видимость = ЭтоПолноправныйПользователь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы ИЛИ Не ЭтаФорма.ВыполняетсяЗаполнение Тогда
		Возврат;
	КонецЕсли;
		
	Ответ = Вопрос("Прекратить заполнение ответственных и закрыть форму?", РежимДиалогаВопрос.ОКОтмена);
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ЗавершитьФоновыеЗадания();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаВидовОперацийПриИзменении(Элемент)
	
	Объект.ПроверитьЗаписиЖурналаСверокПоВнутреннемуУчету	= (Объект.ГруппаВидовОпераций = ЭтаФорма.ОперацииВнутреннегоУчета);	
	Объект.ПроверитьЗаписиЖурналаПодтверждений				= (Объект.ГруппаВидовОпераций = ЭтаФорма.ОперацииВнутреннегоУчета);	
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗаданияРасшифровкаСтатуса" Тогда
		
		СписокОшибок = Элементы.Задания.ТекущиеДанные["Ошибки"];
		
		Если ТипЗнч(СписокОшибок) = Тип("СписокЗначений") Тогда
			
			ПоказатьОтчетОбОшибках(Элементы.Задания.ТекущиеДанные["СубъектУчета"]);
			
		ИначеЕсли ЗначениеЗаполнено(СписокОшибок) Тогда
			
			ОткрытьЗначение(СписокОшибок);
			
		Иначе
			
			ПредупреждениеАсинх("Нет данных для отображения");
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ЗаданияСубъектУчета" Тогда 	
		
		ОткрытьЗначение(Элементы.Задания.ТекущиеДанные["СубъектУчета"]);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗаполнитьОтветственного(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессиюНаСервере("КомандаЗаполнитьОтветственного");
	ВыполнитьЗаполнениеОтветственного(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеОтветственного(ПараметрыСессии)
	
	Если Не ПроверитьЗаполнение() Тогда
		ТекстОшибки = "Проверка заполнения не прошла";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ПредупреждениеАсинх(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПроверитьКорректностьЗаполненияГруппыВидовОпераций(Объект.ГруппаВидовОпераций);
	
	ЭтаФорма.Задания.Очистить();	
	ЭтаФорма.ВремяЗапуска = ТекущаяДата();	
	
	СубъектыУчета = ПолучитьСубъектыУчетаСНесоотвествиями();
	
	Если Не ЗначениеЗаполнено(СубъектыУчета) Тогда
		ВывестиСтатистикуРаботы();
		ТекстОшибки = "Несоответствия не обнаружены";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ПредупреждениеАсинх(ТекстОшибки);
		Возврат;	
	КонецЕсли;
	
	ЭтаФорма.ВыполняетсяЗаполнение = Истина;
	Элементы.ФормаКомандаЗаполнитьОтветственного.Доступность = Ложь;
	Элементы.Шапка.Доступность = Ложь;
	
	Для Каждого СубъектУчета Из СубъектыУчета Цикл
		Задание = ЭтаФорма.Задания.Добавить();
		Задание.СубъектУчета	= СубъектУчета;
		Задание.Выполнено		= -1;
	КонецЦикла;
	
	ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьСостояниеЗаданий", 0.1, Истина);			
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчетПоОшибкам(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессиюНаСервере("КомандаОтчетПоОшибкам");
	ПоказатьОтчетОбОшибках();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьТекстЗапроса(Команда)

	ПараметрыСессии = ЗарегистрироватьНовуюСессиюНаСервере("КомандаПолучитьТекстЗапроса");
	ВыполнитьПолучениеТекстаЗапроса();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолучениеТекстаЗапроса()

	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(ПолучитьТекстЗапроса());
	Текст.Показать("Текст запроса");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьСубъектыУчетаСНесоотвествиями()

	СубъектыУчета = Новый Массив;	
	
	Несоответствия = РеквизитФормыВЗначение("Объект").ПолучитьНесоответствия(Объект.Организация, Объект.ГруппаВидовОпераций, Объект.СчетДоверительногоУправления, Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
	ВыборкаПоКлиенту = Несоответствия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоКлиенту.Следующий() Цикл
		СубъектыУчета.Добавить(ВыборкаПоКлиенту.СубъектУчета);
	КонецЦикла;
	
	Если Объект.ПроверитьЗаписиЖурналаСверокПоВнутреннемуУчету Тогда
		СубъектыУчета.Добавить("Журнал сверок по внутреннему учету");
	КонецЕсли;
	
	Если Объект.ПроверитьЗаписиЖурналаПодтверждений Тогда
		СубъектыУчета.Добавить("Журнал подтверждений");
	КонецЕсли;
	
	Возврат СубъектыУчета;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСостояниеЗаданий()
	
	НезапущенныеЗадания	= Задания.НайтиСтроки(Новый Структура("Статус", ""));
	НезапущенныхЗаданий	= НезапущенныеЗадания.Количество();
	
	АктивныеЗадания = Задания.НайтиСтроки(Новый Структура("Статус", "Задание выполняется"));  
	АктивныхЗаданий = АктивныеЗадания.Количество(); 
	
	Если АктивныхЗаданий > 0 Тогда
		Для Каждого СтрокаЗадания Из АктивныеЗадания Цикл
			ЗаполнитьСтрокуЗадания(СтрокаЗадания);
		КонецЦикла;
	КонецЕсли;
	
	ВывестиСтатистикуРаботы();	

	// Запускаем новые задания, если не превышен максимум активных
	
	Если НезапущенныхЗаданий > 0 И АктивныхЗаданий < ЭтаФорма.МаксимумАктивныхЗаданий Тогда
		
		СтрокаЗадания = НезапущенныеЗадания[0]; 
		
		Если СтрокаЗадания.СубъектУчета = "Журнал сверок по внутреннему учету" Тогда
			НовоеЗадание = ЗаполнитьОтветственногоЖурналаСверокПоВнутреннемуУчетуВФоне(
				ЭтаФорма.УникальныйИдентификатор,
				ЭтаФорма.СвойстваОбработки,
				Объект.Организация,
				Объект.Период.ДатаНачала,
				Объект.Период.ДатаОкончания
			);			
		ИначеЕсли СтрокаЗадания.СубъектУчета = "Журнал подтверждений" Тогда
			НовоеЗадание = ЗаполнитьОтветственногоПодтвержденийОперацийВФоне(
				ЭтаФорма.УникальныйИдентификатор,
				ЭтаФорма.СвойстваОбработки,
				Объект.Организация,
				Объект.Период.ДатаНачала,
				Объект.Период.ДатаОкончания
			);			
		Иначе
			НовоеЗадание = ЗаполнитьОтветственногоВФоне(
				ЭтаФорма.УникальныйИдентификатор,
				ЭтаФорма.СвойстваОбработки,
				Объект.Организация,
				Объект.ГруппаВидовОпераций,
				СтрокаЗадания.СубъектУчета,
				Объект.Период.ДатаНачала,
				Объект.Период.ДатаОкончания
			);
		КонецЕсли;
		
		СтрокаЗадания.ИдентификаторЗадания	= НовоеЗадание.ИдентификаторЗадания;
		СтрокаЗадания.АдресХранилища		= НовоеЗадание.АдресХранилища;
		
		ЗаполнитьСтрокуЗадания(СтрокаЗадания);
		ВывестиСтатистикуРаботы();	
		
		// Т.к. при запуске задания выполняется ожидание его выполнения, то еще ждать не будем
		ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьСостояниеЗаданий", 0.1, Истина);
		Возврат;
		
	КонецЕсли;	
	
	Если НезапущенныхЗаданий = 0 И АктивныхЗаданий = 0 Тогда 
		ЭтаФорма.ВыполняетсяЗаполнение = Ложь;
		Элементы.ФормаКомандаЗаполнитьОтветственного.Доступность = Истина;
		Элементы.Шапка.Доступность = Истина;
		ПредупреждениеАсинх("Заполнение ответственных завершено" + ?(ЗаданияВыполненыСОшибками(ЭтаФорма.Задания), " с ошибками", "") + "!");
	Иначе
		ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьСостояниеЗаданий", ЭтаФорма.ПериодОбновления, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьОтветственногоВФоне(УникальныйИдентификатор, СвойстваОбработки, Организация, ГруппаВидовОпераций, СубъектУчета, ДатаНачала, ДатаОкончания)
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ИдентификаторФормы",			УникальныйИдентификатор);
	ПараметрыФоновогоЗадания.Вставить("Пользователь",				РаботаСПользователями.ТекущийПользователь(РаботаСПользователями.ДоступныеПользователи(), Организация));
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Организация",						Организация);
	ПараметрыВыполнения.Вставить("ГруппаВидовОпераций",				ГруппаВидовОпераций);
	ПараметрыВыполнения.Вставить("СубъектУчета",					СубъектУчета);
	ПараметрыВыполнения.Вставить("ДатаНачала",						ДатаНачала);
	ПараметрыВыполнения.Вставить("ДатаОкончания",					ДатаОкончания);
	ПараметрыВыполнения.Вставить("Пользователь",					ДатаОкончания);
	ПараметрыВыполнения.Вставить("ПараметрыФоновогоЗадания",		ПараметрыФоновогоЗадания);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ЭтоВнешняяОбработка",				Истина);
	ПараметрыПроцедуры.Вставить("ДополнительнаяОбработкаСсылка",	СвойстваОбработки.Ссылка);
	ПараметрыПроцедуры.Вставить("ИмяОбработки",						СвойстваОбработки.ИмяОбработки);
	ПараметрыПроцедуры.Вставить("ИмяМетода",						"ЗаполнитьОтветственногоВФоне");
	ПараметрыПроцедуры.Вставить("ПараметрыВыполнения",				ПараметрыВыполнения);
			
	РезультатЗапуска = РаботаСДлительнымиОперациями.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"РаботаСДлительнымиОперациями.ВыполнитьПроцедуруМодуляОбъектаОбработки",
		ПараметрыПроцедуры,
		"Заполнение ответственного",
		Ложь,
		Ложь
	);
	
	Возврат РезультатЗапуска;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьОтветственногоЖурналаСверокПоВнутреннемуУчетуВФоне(УникальныйИдентификатор, СвойстваОбработки, Организация, ДатаНачала, ДатаОкончания)
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ИдентификаторФормы",			УникальныйИдентификатор);
	ПараметрыФоновогоЗадания.Вставить("Пользователь",				РаботаСПользователями.ТекущийПользователь(РаботаСПользователями.ДоступныеПользователи(), Организация));
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Организация",						Организация);
	ПараметрыВыполнения.Вставить("ДатаНачала",						ДатаНачала);
	ПараметрыВыполнения.Вставить("ДатаОкончания",					ДатаОкончания);
	ПараметрыВыполнения.Вставить("Пользователь",					ДатаОкончания);
	ПараметрыВыполнения.Вставить("ПараметрыФоновогоЗадания",		ПараметрыФоновогоЗадания);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ЭтоВнешняяОбработка",				Истина);
	ПараметрыПроцедуры.Вставить("ДополнительнаяОбработкаСсылка",	СвойстваОбработки.Ссылка);
	ПараметрыПроцедуры.Вставить("ИмяОбработки",						СвойстваОбработки.ИмяОбработки);
	ПараметрыПроцедуры.Вставить("ИмяМетода",						"ЗаполнитьОтветственногоЖурналаСверокПоВнутреннемуУчетуВФоне");
	ПараметрыПроцедуры.Вставить("ПараметрыВыполнения",				ПараметрыВыполнения);
			
	РезультатЗапуска = РаботаСДлительнымиОперациями.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"РаботаСДлительнымиОперациями.ВыполнитьПроцедуруМодуляОбъектаОбработки",
		ПараметрыПроцедуры,
		"Заполнение ответственного журнала сверок по внутреннему учету",
		Ложь,
		Ложь
	);
	
	Возврат РезультатЗапуска;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьОтветственногоПодтвержденийОперацийВФоне(УникальныйИдентификатор, СвойстваОбработки, Организация, ДатаНачала, ДатаОкончания)
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ИдентификаторФормы",			УникальныйИдентификатор);
	ПараметрыФоновогоЗадания.Вставить("Пользователь",				РаботаСПользователями.ТекущийПользователь(РаботаСПользователями.ДоступныеПользователи(), Организация));
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Организация",						Организация);
	ПараметрыВыполнения.Вставить("ДатаНачала",						ДатаНачала);
	ПараметрыВыполнения.Вставить("ДатаОкончания",					ДатаОкончания);
	ПараметрыВыполнения.Вставить("Пользователь",					ДатаОкончания);
	ПараметрыВыполнения.Вставить("ПараметрыФоновогоЗадания",		ПараметрыФоновогоЗадания);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ЭтоВнешняяОбработка",				Истина);
	ПараметрыПроцедуры.Вставить("ДополнительнаяОбработкаСсылка",	СвойстваОбработки.Ссылка);
	ПараметрыПроцедуры.Вставить("ИмяОбработки",						СвойстваОбработки.ИмяОбработки);
	ПараметрыПроцедуры.Вставить("ИмяМетода",						"ЗаполнитьОтветственногоПодтвержденийОперацийВФоне");
	ПараметрыПроцедуры.Вставить("ПараметрыВыполнения",				ПараметрыВыполнения);
			
	РезультатЗапуска = РаботаСДлительнымиОперациями.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"РаботаСДлительнымиОперациями.ВыполнитьПроцедуруМодуляОбъектаОбработки",
		ПараметрыПроцедуры,
		"Заполнение ответственного журнала подтверждений",
		Ложь,
		Ложь
	);
	
	Возврат РезультатЗапуска;
	
КонецФункции

#Область Формирование_отчета_об_ошибках

&НаКлиенте
Процедура ПоказатьОтчетОбОшибках(СубъектУчета = Неопределено)
	
	РасшифровкаОшибок = СформироватьОтчетОбОшибках(ЭтаФорма.Задания, СубъектУчета);
	
	Если РасшифровкаОшибок = Неопределено Тогда
		ПредупреждениеАсинх("Ошибки не обнаружены!");
		Возврат;
	КонецЕсли;
	
	РасшифровкаОшибок.ТолькоПросмотр = Истина;
	РасшифровкаОшибок.ОтображатьЗаголовки = Ложь;
	РасшифровкаОшибок.ОтображатьСетку = Ложь;
	
	РасшифровкаОшибок.Показать("Ошибки " + ?(ЗначениеЗаполнено(СубъектУчета), Строка(СубъектУчета), "заполнения ответственных")); 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданияВыполненыСОшибками(Знач Задания, СубъектУчета = Неопределено)
	
	ЗаданияСОшибками = ПолучитьЗаданияСОшибками(Задания, СубъектУчета);
	
	Возврат (ЗаданияСОшибками.Количество() > 0);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗаданияСОшибками(Знач Задания, СубъектУчета = Неопределено)
	
	ЗаданияСОшибками = Новый Массив;
	
	Для Каждого СтрокаЗадания Из Задания Цикл
		Если СтрокаЗадания.СубъектУчета = СубъектУчета ИЛИ СубъектУчета = Неопределено Тогда
			Если ТипЗнч(СтрокаЗадания.Ошибки) = Тип("СписокЗначений")
				ИЛИ СтрокаЗадания.Статус = "Задание завершено с ошибками"
			Тогда
				ЗаданияСОшибками.Добавить(СтрокаЗадания);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗаданияСОшибками;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьОтчетОбОшибках(Знач Задания, СубъектУчета = Неопределено)
	
	ЗаданияСОшибками = ПолучитьЗаданияСОшибками(Задания, СубъектУчета);
	
	Если ЗаданияСОшибками.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Формируем отчет
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(); //(, , Макет);
	ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
	Для Каждого СтрокаЗадания Из ЗаданияСОшибками Цикл	

		ОписаниеОшибки = ?(
			ТипЗнч(СтрокаЗадания.Ошибки) = Тип("СписокЗначений"),
			СтрокаЗадания.Ошибки.ВыгрузитьЗначения(),
			РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("ТекстОшибки", "Неизвестная ошибка")));
		
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода,
			ОписаниеОшибки,
			Новый Структура("Документ, ТекстОшибки", "Документ", "Текст ошибки"),
			?(ЗначениеЗаполнено(СтрокаЗадания.СубъектУчета), СтрокаЗадания.СубъектУчета, "Субъект учета не определен"),
			Ложь,
			Истина);
		
	КонецЦикла;
	
	Возврат ПараметрыВывода.ДокументРезультат;
	
КонецФункции

#КонецОбласти

#Область Служебные_и_вспомогательные_функции

&НаСервере
Функция ПолучитьТекстЗапроса()
	
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекстЗапросаЗаменОтветственных();	
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСтрокуЗадания(СтрокаЗадания)
	
	ОписаниеЗадания = ПолучитьОписаниеЗадания(ЭтаФорма.УникальныйИдентификатор, СтрокаЗадания.ИдентификаторЗадания, СтрокаЗадания.АдресХранилища);
	Если ОписаниеЗадания = Неопределено Тогда
		СтрокаЗадания.Статус	= "Состояние не определено";
		СтрокаЗадания.Выполнено	= 1;
		Возврат;
	ИначеЕсли ОписаниеЗадания.Свойство("ВыполненныеЗамены") Тогда
		ОписаниеЗадания.ВыполненныеЗамены.Показать(СтрШаблон("%1 (замены за %2)", СтрокаЗадания.СубъектУчета, ПредставлениеПериода(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания)));
	КонецЕсли;

	Если СтрокаЗадания.Проверено = 0 ИЛИ ОписаниеЗадания.Свойство("Проверено") И ОписаниеЗадания.Проверено > СтрокаЗадания.Проверено Тогда
		ЗаполнитьЗначенияСвойств(СтрокаЗадания, ОписаниеЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеЗадания(ИдентификаторФормы, ИндентификаторЗадания, АдресХранилища)
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИндентификаторЗадания);
	Если Задание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеЗадания = Новый Структура;
	ОписаниеЗадания.Вставить("Статус", Строка(Задание.Состояние));
	ОписаниеЗадания.Вставить("РасшифровкаСтатуса", Строка(Задание.Состояние));
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		ОписаниеЗадания.Вставить("Выполнено", 0);
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		ОписаниеЗадания.Вставить("Выполнено", 1);
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		ОписаниеЗадания.Вставить("Выполнено", 2);
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		ОписаниеЗадания.Вставить("Выполнено", 3);
	КонецЕсли;
	
	РезультатЗадания = Неопределено;	
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		РезультатЗадания = ПолучитьИзВременногоХранилища(АдресХранилища);
	Иначе
		СлужебныеСообщения = Задание.ПолучитьСообщенияПользователю(Истина);
		ПоследнееСообщение = Неопределено;
		
		Для Каждого Сообщение Из СлужебныеСообщения Цикл
			Если Сообщение.ИдентификаторНазначения = ИдентификаторФормы Тогда
				ПоследнееСообщение = Сообщение;	
			КонецЕсли;
		КонецЦикла;
		
		Если ПоследнееСообщение <> Неопределено Тогда
			РезультатЗадания = ЗначениеИзСтрокиВнутр(ПоследнееСообщение.Текст);
		КонецЕсли;
	КонецЕсли;

	Если РезультатЗадания <> Неопределено Тогда	
		ОписаниеЗадания.РасшифровкаСтатуса = ОписаниеЗадания.РасшифровкаСтатуса
			+ " (изменено " + Формат(РезультатЗадания.Изменено, "ЧН=; ЧГ=")
			+ " из " + Формат(РезультатЗадания.Всего, "ЧН=; ЧГ=")
			+ ", ошибок: " + Формат(РезультатЗадания.Ошибок, "ЧН=; ЧГ=")
			+ ")";
			
		ОписаниеЗадания.Вставить("Изменено",	РезультатЗадания.Изменено);
		ОписаниеЗадания.Вставить("Проверено",	РезультатЗадания.Проверено);

		Если РезультатЗадания.Свойство("ВыполненныеЗамены") Тогда
			ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();
			ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
			
			РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, РезультатЗадания.ВыполненныеЗамены, , , , Истина);
			
			ОписаниеЗадания.Вставить("ВыполненныеЗамены", ПараметрыВывода.ДокументРезультат);
		КонецЕсли;
		
		Если РезультатЗадания.Ошибок > 0 Тогда
			ОписаниеЗадания.Выполнено = 2;
			
			СписокОшибок = Новый СписокЗначений;
			СписокОшибок.ЗагрузитьЗначения(РезультатЗадания.Ошибки);
			
			ОписаниеЗадания.Вставить("Ошибки", СписокОшибок);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОписаниеЗадания; 
	
КонецФункции

&НаКлиенте
Процедура ВывестиСтатистикуРаботы()
	
	ВремяВыполненияВСекундах = ТекущаяДата() - ЭтаФорма.ВремяЗапуска;
	
	ЭтаФорма.ВремяВыполнения = ?(ВремяВыполненияВСекундах > 86400, Формат(Дата(1, 1, 1) + ВремяВыполненияВСекундах, "ДФ='dd ''д.'' '"), "") + Формат(Дата(1, 1, 1) + ВремяВыполненияВСекундах, "ДФ=HH:mm:ss");
	
	ЭтаФорма.Изменено = ЭтаФорма.Задания.Итог("Изменено");
	
	Элементы.Изменено.Формат = "ЧН=";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьФоновыеЗадания()
	
	ИдентификаторыЗаданий = Новый Массив;
	
	АктивныеЗадания = Задания.НайтиСтроки(Новый Структура("Статус", "Задание выполняется"));	
	Для Каждого СтрокаЗадания Из АктивныеЗадания Цикл
		ИдентификаторыЗаданий.Добавить(СтрокаЗадания.ИдентификаторЗадания);	
	КонецЦикла;
	
	ЗавершитьФоновыеЗаданияНаСервере(ИдентификаторыЗаданий);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗавершитьФоновыеЗаданияНаСервере(ИдентификаторыЗаданий)
	
	Для Каждого ИдентификаторЗадания Из ИдентификаторыЗаданий Цикл
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если ФоновоеЗадание <> Неопределено И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФоновоеЗадание.Отменить();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьКорректностьЗаполненияГруппыВидовОпераций(ГруппаВидовОпераций)
	
	// В группе не должно быть операций со значением Неопределено
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВидыОперацийГруппы.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ВидыОперацийГруппы
		|ГДЕ
		|	ВидыОперацийГруппы.Ссылка = &ГруппаВидовОпераций
		|	И ВидыОперацийГруппы.ВидОперации = НЕОПРЕДЕЛЕНО");
	
	Запрос.УстановитьПараметр("ГруппаВидовОпераций", ГруппаВидовОпераций);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение СтрШаблон("В группе операций '%1' обнаружен неопределенный вид операции!", ГруппаВидовОпераций);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)
	
	ЭтаФорма.Элементы.ГруппаПараметровОперацийВнутреннегоУчета.Видимость = (ЭтаФорма.Объект.ГруппаВидовОпераций = ЭтаФорма.ОперацииВнутреннегоУчета);
	
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервереБезКонтекста
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)  
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, 
		ПараметрыСессии.Сессия, 
		Новый Структура("ТекстОшибки", ТекстОшибки));
		
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессиюНаСервере(ИмяКоманды)
	
	Возврат
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(
			РеквизитФормыВЗначение("Объект"), ИмяКоманды);

КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия);
	
КонецПроцедуры

#КонецОбласти
