
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		// пока отключил запись по интерактивным (ФБУ) до того момента как научимся делить ошибки на "пользовательские" и "программистские"
		Если Запись.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Ошибка И НЕ Запись.ИнтерактивныйЗапуск Тогда 
			ЗаписьЖурналаРегистрации("Отложенные задания.Ошибка", 
									УровеньЖурналаРегистрации.Ошибка,
									ЭтотОбъект.Метаданные(),
									Запись.Команда,
									Запись.Комментарий + Символы.ПС + "Описание параметров" + Символы.ПС + Запись.ОписаниеПараметров);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
