
#Область Регистрация_отчета

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Периодический отчет управляющего",
		"1.23",
		"",
		Истина
	);
	
	// Команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
КонецФункции

#КонецОбласти

#Область Обработчики_событий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (ЭтотОбъект.ВыводитьБалансовуюСтоимость ИЛИ ЭтотОбъект.ВыводитьРыночнуюСтоимость) Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран вариант отчета",, "Отчет.ВыводитьБалансовуюСтоимость",, Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Автоматическое_формирование

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("РежимВыводаДвиженийИОстатков");
	Настройки.Добавить("РежимВыводаСтоимости");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("АвтоматическаяОтправка");
	Настройки.Добавить("АдресЭлектроннойПочты");
	Настройки.Добавить("АдресОтправителя");
	
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.НачалоПериода = НастройкиОтчета.Период.ДатаНачала; 
	ЭтотОбъект.КонецПериода = НастройкиОтчета.Период.ДатаОкончания; 
	
	РежимВыводаСтоимости = Неопределено;
	РежимВыводаСтоимости = ?(НастройкиОтчета.Свойство("РежимВыводаСтоимости", РежимВыводаСтоимости), РежимВыводаСтоимости, "0");
	
	ЭтотОбъект.ВыводитьБалансовуюСтоимость = (РежимВыводаСтоимости = "0");
	ЭтотОбъект.ВыводитьРыночнуюСтоимость   = (РежимВыводаСтоимости = "1");
	
	ДокументРезультат = Новый ТабличныйДокумент;
	СформироватьОтчет(ДокументРезультат);
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область Формирование_отчета

Функция ПолучитьОстаткиДС(Период, УБрокера = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		|	СУММА(ОстаткиДенежныхСредствОстатки.СуммаОстаток) КАК СуммаОстаток
		|ПОМЕСТИТЬ ОстаткиДС
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &БрокерРС) КАК ОстаткиДенежныхСредствОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредствОстатки.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДС.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	ОстаткиДС.СуммаОстаток КАК СуммаВалюта,
		|	ОстаткиДС.СуммаОстаток * КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность КАК СуммаРубли
		|ИЗ
		|	ОстаткиДС КАК ОстаткиДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|		ПО ОстаткиДС.Валюта = КурсыВалютСрезПоследних.Валюта";
		
	Если УБрокера Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&БрокерРС", "НЕ Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&БрокерРС", "Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)");
	КонецЕсли;		
		
	Запрос.УстановитьПараметр("Период", 						Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьЗадолженностиДС(Период)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ &ВыводитьРыночнуюСтоимость
		|							И ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.НачислениеДивидендов)
		|						ТОГДА ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток, 0)
		|					ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДСОжидаемые,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДСБлокированные,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.ВводЦенныхБумаг)
		|				ИЛИ ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|				ИЛИ ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.НачислениеЗадолженности)
		|				ИЛИ ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.Сделка)
		|				ИЛИ ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.СделкаРЕПО)
		|				ИЛИ ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.СделкаСВалютой)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА ""Дивиденды "" + ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага.Эмитент.Наименование + "", "" + ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|						ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|						ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага.РегистрационныйНомер
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ""Купон "" + ЗадолженностиПоДенежнымСредствамОстатки.Основание.Облигация.Эмитент.Наименование + "", "" + ЗадолженностиПоДенежнымСредствамОстатки.Основание.Облигация.ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ""Облигация "" + ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага.Эмитент.Наименование
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДСОписание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание
		|ПОМЕСТИТЬ ЗадолженностиДС
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&Период,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|						И ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии)
		|						И НЕ ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия))
		|					ИЛИ ВЫРАЗИТЬ(Основание КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|					ИЛИ ВЫРАЗИТЬ(Основание КАК Документ.НачислениеЗадолженности).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|				И ВЫБОР
		|					КОГДА &ВыводитьРыночнуюСтоимость = ИСТИНА
		|						ТОГДА ТИПЗНАЧЕНИЯ(Основание) <> ТИП(Документ.НачислениеДивидендов)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ПО (ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = ЗадолженностиПоДенежнымСредствамОстатки.Контрагент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЗадолженностиДС.ДСОжидаемые) КАК ДСОжидаемые,
		|	СУММА(ЗадолженностиДС.ДСБлокированные) КАК ДСБлокированные,
		|	ЗадолженностиДС.ДСОписание КАК ДСОписание
		|ИЗ
		|	ЗадолженностиДС КАК ЗадолженностиДС
		|ГДЕ
		|	(ЗадолженностиДС.ДСОжидаемые <> 0
		|			ИЛИ ЗадолженностиДС.ДСБлокированные <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиДС.ДСОписание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	СУММА(0),
		|	""% по банковским вкладам "" + ЕдиныйБухгалтерскийУчетОстатки.Субконто1.Наименование
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.МНО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	НЕ &ВыводитьРыночнуюСтоимость
		|	И ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	""% по банковским вкладам "" + ЕдиныйБухгалтерскийУчетОстатки.Субконто1.Наименование";

	#КонецОбласти
	
	Запрос.УстановитьПараметр("Период", 						Период);
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВыводитьРыночнуюСтоимость", 		ЭтотОбъект.ВыводитьРыночнуюСтоимость);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьОстаткиАкции(Период, ПериодДата)
	ТЗРезультат = Новый ТаблицаЗначений;
	КЧ = Новый КвалификаторыЧисла(15, 2);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ТЗРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов(МассивТипов, , КЧ));
	ТЗРезультат.Колонки.Добавить("СуммаРынок", Новый ОписаниеТипов(МассивТипов, , КЧ));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерГосРегистрации,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Номинал,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.СтоимостьОстаток / БухПартииЦенныхБумагОстатки.КоличествоОстаток
		|	КОНЕЦ КАК БалансоваяЦена,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК БалансоваяСтоимостьБезНКД,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК НКДУплаченныйНачисленный,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Дисконт,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток > 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК Корректировка,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид,
		|	ЛОЖЬ КАК МакетПрочее,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии
		|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Рынок,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Партия,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтрокаПартии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)) КАК БухПартииЦенныхБумагКПолучениюОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Рынок КАК Рынок,
		|	_ЦенныеБумаги.Эмитент КАК Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации КАК НомерГосРегистрации,
		|	_ЦенныеБумаги.Номинал КАК Номинал,
		|	СУММА(_ЦенныеБумаги.Количество) КАК Количество,
		|	ВЫБОР
		|		КОГДА СУММА(_ЦенныеБумаги.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) / СУММА(_ЦенныеБумаги.Количество)
		|	КОНЕЦ КАК БалансоваяЦена,
		|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
		|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
		|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
		|	СУММА(_ЦенныеБумаги.Дисконт) КАК Дисконт,
		|	СУММА(_ЦенныеБумаги.Премия) КАК Премия,
		|	СУММА(_ЦенныеБумаги.Корректировка) КАК Корректировка,
		|	_ЦенныеБумаги.Вид КАК Вид,
		|	_ЦенныеБумаги.МакетПрочее КАК МакетПрочее,
		|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ЦенныеБумагиСПартиями КАК _ЦенныеБумаги
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага,
		|	_ЦенныеБумаги.Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации,
		|	_ЦенныеБумаги.Вид,
		|	_ЦенныеБумаги.МакетПрочее,
		|	_ЦенныеБумаги.Номинал,
		|	_ЦенныеБумаги.Рынок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Период КАК Период,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок КАК Рынок,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов КАК РежимТоргов,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.Валюта
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.ВалютаНоминала
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.БазоваяЦБ.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT КАК ACCINT,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT_DATE КАК ACCINT_DATE,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE2 КАК MARKETPRICE2,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ПоследниеКотировки
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
		|				&Период,
		|				РежимТоргов.ОсновнойРежим
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ЦенныеБумаги.ЦеннаяБумага
		|						ИЗ
		|							_ЦенныеБумаги КАК _ЦенныеБумаги)
		|					И Биржа = &Биржа) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.MARKETPRICE2_DATE) КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ДатыПоследнихЗначенийКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.Период) КАК МаксимальныйПериод,
		|	МАКСИМУМ(ДатыПоследнихЗначенийMARKETPRICE2.MARKETPRICE2_DATE) КАК MARKETPRICE2_DATE,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|					И _ПоследниеКотировки.MARKETPRICE2 <> 0)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|								И _ПоследниеКотировки.MARKETPRICE2 <> 0
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|							И _ПоследниеКотировки.MARKETPRICE2 <> 0
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляMARKETPRICE2
		|ПОМЕСТИТЬ _РежимыТорговПоследнихКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийACCINT
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийACCINT.ЦеннаяБумага
		|			И (_ПоследниеКотировки.Период = &Период)
		|			И (_ПоследниеКотировки.ACCINT_DATE = &Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийMARKETPRICE2
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага
		|			И _ПоследниеКотировки.MARKETPRICE2_DATE = ДатыПоследнихЗначенийMARKETPRICE2.MARKETPRICE2_DATE
		|ГДЕ
		|	(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|			ИЛИ НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыПоследнихЗначенийКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(КупоныВыходногоДня.Период, _РежимыТорговПоследнихКотировок.МаксимальныйПериод) КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ КупоныВыходногоДня.Период ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ПоследниеКотировкиДляACCINT.РежимТоргов
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ПоследниеКотировкиДляMARKETPRICE2.РежимТоргов КАК РежимТорговДляMARKETPRICE2,
		|	ЕСТЬNULL(КупоныВыходногоДня.ACCINT * (КурсыВалютКупоновВыходногоДня.Курс / КурсыВалютКупоновВыходногоДня.Кратность), ПоследниеКотировкиДляACCINT.ACCINT * (КурсыВалютДляACCINT.Курс / КурсыВалютДляACCINT.Кратность)) КАК ACCINT,
		|	ВЫБОР
		|		КОГДА ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2
		|		ИНАЧЕ ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2 * (КурсыВалютДляMARKETPRICE2.Курс / КурсыВалютДляMARKETPRICE2.Кратность)
		|	КОНЕЦ КАК MARKETPRICE2,
		|	ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE,
		|	&ПериодДата > НАЧАЛОПЕРИОДА(ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2_DATE, ДЕНЬ) КАК ТребуетсяРасчетЦены
		|ПОМЕСТИТЬ _КотировкиЦенныхБумаг
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыТорговПоследнихКотировок КАК _РежимыТорговПоследнихКотировок
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляACCINT
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляACCINT.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляACCINT = ПоследниеКотировкиДляACCINT.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляMARKETPRICE2
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляMARKETPRICE2 = ПоследниеКотировкиДляMARKETPRICE2.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупоныВыходногоДня КАК КупоныВыходногоДня
		|		ПО (КупоныВыходногоДня.Период = &Период)
		|			И (_ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации)
		|			И _ЦенныеБумаги.ЦеннаяБумага = КупоныВыходногоДня.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДляACCINT
		|		ПО (КурсыВалютДляACCINT.Период = &Период)
		|			И (НЕ ПоследниеКотировкиДляACCINT.ЦеннаяБумага ЕСТЬ NULL)
		|			И (КурсыВалютДляACCINT.Валюта = ПоследниеКотировкиДляACCINT.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДляMARKETPRICE2
		|		ПО (КурсыВалютДляMARKETPRICE2.Период = &Период)
		|			И (НЕ ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL)
		|			И (КурсыВалютДляMARKETPRICE2.Валюта = ПоследниеКотировкиДляMARKETPRICE2.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютКупоновВыходногоДня
		|		ПО (КурсыВалютКупоновВыходногоДня.Период = &Период)
		|			И (НЕ КупоныВыходногоДня.Облигация ЕСТЬ NULL)
		|			И (КурсыВалютКупоновВыходногоДня.Валюта = ЕСТЬNULL(ПоследниеКотировкиДляACCINT.ВалютаНоминала, КупоныВыходногоДня.Облигация.ВалютаНоминала))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ПоследниеКотировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РежимыТорговПоследнихКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	ЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ЦенныеБумаги.Количество КАК Количество,
		|	ЦенныеБумаги.Количество * ЕСТЬNULL(КотировкиЦенныхБумаг.ACCINT, 0) КАК КупонРынок,
		|	ЦенныеБумаги.Количество * (ЦенныеБумаги.Номинал / 100 * ВЫБОР
		|		КОГДА КотировкиЦенныхБумаг.ТребуетсяРасчетЦены
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(КотировкиЦенныхБумаг.MARKETPRICE2, 0)
		|	КОНЕЦ + ЕСТЬNULL(КотировкиЦенныхБумаг.ACCINT, 0)) КАК СуммаРынок,
		|	ЦенныеБумаги.БалансоваяСтоимостьБезНКД + ЦенныеБумаги.Переоценка + ЦенныеБумаги.НКДУплаченныйНачисленный + ЦенныеБумаги.Дисконт + ЦенныеБумаги.Премия + ЦенныеБумаги.Корректировка КАК Сумма,
		|	ЦенныеБумаги.НКДУплаченныйНачисленный КАК Купон,
		|	ЦенныеБумаги.Номинал КАК Номинал,
		|	ЦенныеБумаги.ЦеннаяБумага.ДатаРегистрации КАК ДатаРегистрации,
		|	ЦенныеБумаги.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОстаткиЦБ
		|ИЗ
		|	_ЦенныеБумаги КАК ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЦенныеБумаги.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК КотировкиЦенныхБумаг
		|		ПО ЦенныеБумаги.ЦеннаяБумага = КотировкиЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦБ.Эмитент КАК Эмитент,
		|	_ОстаткиЦБ.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	_ОстаткиЦБ.Количество КАК Количество,
		|	_ОстаткиЦБ.Сумма КАК Сумма,
		|	_ОстаткиЦБ.Купон КАК Купон,
		|	_ОстаткиЦБ.СуммаРынок КАК СуммаРынок,
		|	_ОстаткиЦБ.КупонРынок КАК КупонРынок,
		|	_ОстаткиЦБ.Номинал КАК Номинал,
		|	_ОстаткиЦБ.ДатаРегистрации КАК ДатаРегистрации,
		|	_ОстаткиЦБ.ДатаПогашения КАК ДатаПогашения,
		|	_ОстаткиЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦБ.ЦеннаяБумага.Тип КАК Тип
		|ПОМЕСТИТЬ _РезультатОстаткиЦБ
		|ИЗ
		|	_ОстаткиЦБ КАК _ОстаткиЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиЦБ.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _РезультатЦенныеБумаги
		|ИЗ
		|	_ОстаткиЦБ КАК _ОстаткиЦБ";
	#КонецОбласти
	
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
		Или ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний
	Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "MARKETPRICE3", "MARKETPRICE2");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("ПериодДата",						ПериодДата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Биржа",							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Запрос.УстановитьПараметр("ВалютаУчета",					ПараметрыСеанса.ТекущаяОрганизация.ВалютаУчета);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	РезультатОстаткиЦБ = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатОстаткиЦБ",,,, "Эмитент");
	Если РезультатОстаткиЦБ.Пустой() Тогда
		Возврат ТЗРезультат;
	КонецЕсли;
	
	ТаблицаАкций = РезультатОстаткиЦБ.Выгрузить();
	// Для рыночной стоимости требуется доп. обработка результата
	РезультатЦенныеБумаги = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатЦенныеБумаги");
	ЦенныеБумаги = РезультатЦенныеБумаги.Выгрузить();
	
	Объект = Новый Структура;
	Объект.Вставить("СчетДоверительногоУправления",		ЭтотОбъект.СчетДоверительногоУправления);
	Объект.Вставить("ВариантРасчетаОценочнойСтоимости",	Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхНакоплений);
	Объект.Вставить("Организация",						ЭтотОбъект.Организация);
	Объект.Вставить("ВидУчета",							Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Объект.Вставить("Дата",								НачалоДня(ПериодДата));
	Объект.Вставить("ЦенныеБумаги",						ЦенныеБумаги);
	Объект.Вставить("ЦельРасчета",						Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Отказ = Ложь;
	РаботаСПереоценкой.ЗаполнитьКотировки(Объект,,, Отказ);
	
	ТаблицаЦен = Объект.ЦенныеБумаги;
	ТаблицаЦен.Свернуть("ЦеннаяБумага, ИсточникЦены, ОценочнаяЦена");
	
	Для Каждого СтрокаАкции Из ТаблицаАкций Цикл
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Новый Структура("ЦеннаяБумага", СтрокаАкции.ЦеннаяБумага));
		Если НайденныеСтроки.Количество() = 1 Тогда
			Котировка = НайденныеСтроки[0].ОценочнаяЦена;
			РыночнаяБезНКД = Окр(СтрокаАкции.Количество * Котировка, 2);
			СтрокаАкции.СуммаРынок = РыночнаяБезНКД;
			
			НКД = ?(ЗначениеЗаполнено(СтрокаАкции.КупонРынок),
				СтрокаАкции.КупонРынок,
				СтрокаАкции.Количество * РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(СтрокаАкции.ЦеннаяБумага, ПериодДата, ЭтотОбъект.СчетДоверительногоУправления));
			СтрокаАкции.КупонРынок = НКД;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаАкций;
КонецФункции

Функция ПолучитьОстаткиПаи(Период, ПериодДата)
	ТЗРезультат = Новый ТаблицаЗначений;
	КЧ = Новый КвалификаторыЧисла(15, 2);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ТЗРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов(МассивТипов, , КЧ));
	ТЗРезультат.Колонки.Добавить("СуммаРынок", Новый ОписаниеТипов(МассивТипов, , КЧ));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерГосРегистрации,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Номинал,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.СтоимостьОстаток / БухПартииЦенныхБумагОстатки.КоличествоОстаток
		|	КОНЕЦ КАК БалансоваяЦена,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК БалансоваяСтоимостьБезНКД,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК НКДУплаченныйНачисленный,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Дисконт,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток > 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК Корректировка,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид,
		|	ЛОЖЬ КАК МакетПрочее,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии
		|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Рынок,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Партия,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтрокаПартии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)) КАК БухПартииЦенныхБумагКПолучениюОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Рынок КАК Рынок,
		|	_ЦенныеБумаги.Эмитент КАК Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации КАК НомерГосРегистрации,
		|	_ЦенныеБумаги.Номинал КАК Номинал,
		|	СУММА(_ЦенныеБумаги.Количество) КАК Количество,
		|	ВЫБОР
		|		КОГДА СУММА(_ЦенныеБумаги.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) / СУММА(_ЦенныеБумаги.Количество)
		|	КОНЕЦ КАК БалансоваяЦена,
		|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
		|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
		|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
		|	СУММА(_ЦенныеБумаги.Дисконт) КАК Дисконт,
		|	СУММА(_ЦенныеБумаги.Премия) КАК Премия,
		|	СУММА(_ЦенныеБумаги.Корректировка) КАК Корректировка,
		|	_ЦенныеБумаги.Вид КАК Вид,
		|	_ЦенныеБумаги.МакетПрочее КАК МакетПрочее,
		|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ЦенныеБумагиСПартиями КАК _ЦенныеБумаги
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага,
		|	_ЦенныеБумаги.Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации,
		|	_ЦенныеБумаги.Вид,
		|	_ЦенныеБумаги.МакетПрочее,
		|	_ЦенныеБумаги.Номинал,
		|	_ЦенныеБумаги.Рынок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Период КАК Период,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок КАК Рынок,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов КАК РежимТоргов,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.Валюта
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.ВалютаНоминала
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.БазоваяЦБ.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT КАК ACCINT,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT_DATE КАК ACCINT_DATE,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE2 КАК MARKETPRICE2,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ПоследниеКотировки
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
		|				&Период,
		|				РежимТоргов.ОсновнойРежим
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ЦенныеБумаги.ЦеннаяБумага
		|						ИЗ
		|							_ЦенныеБумаги КАК _ЦенныеБумаги)
		|					И Биржа = &Биржа) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.MARKETPRICE2_DATE) КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ДатыПоследнихЗначенийКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.Период) КАК МаксимальныйПериод,
		|	МАКСИМУМ(ДатыПоследнихЗначенийMARKETPRICE2.MARKETPRICE2_DATE) КАК MARKETPRICE2_DATE,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|					И _ПоследниеКотировки.MARKETPRICE2 <> 0)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|								И _ПоследниеКотировки.MARKETPRICE2 <> 0
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|							И _ПоследниеКотировки.MARKETPRICE2 <> 0
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляMARKETPRICE2
		|ПОМЕСТИТЬ _РежимыТорговПоследнихКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийACCINT
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийACCINT.ЦеннаяБумага
		|			И (_ПоследниеКотировки.Период = &Период)
		|			И (_ПоследниеКотировки.ACCINT_DATE = &Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийMARKETPRICE2
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага
		|			И _ПоследниеКотировки.MARKETPRICE2_DATE = ДатыПоследнихЗначенийMARKETPRICE2.MARKETPRICE2_DATE
		|ГДЕ
		|	(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|			ИЛИ НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыПоследнихЗначенийКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(КупоныВыходногоДня.Период, _РежимыТорговПоследнихКотировок.МаксимальныйПериод) КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ КупоныВыходногоДня.Период ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ПоследниеКотировкиДляACCINT.РежимТоргов
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ПоследниеКотировкиДляMARKETPRICE2.РежимТоргов КАК РежимТорговДляMARKETPRICE2,
		|	ЕСТЬNULL(КупоныВыходногоДня.ACCINT * (КурсыВалютКупоновВыходногоДня.Курс / КурсыВалютКупоновВыходногоДня.Кратность), ПоследниеКотировкиДляACCINT.ACCINT * (КурсыВалютДляACCINT.Курс / КурсыВалютДляACCINT.Кратность)) КАК ACCINT,
		|	ВЫБОР
		|		КОГДА ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2
		|		ИНАЧЕ ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2 * (КурсыВалютДляMARKETPRICE2.Курс / КурсыВалютДляMARKETPRICE2.Кратность)
		|	КОНЕЦ КАК MARKETPRICE2,
		|	ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE,
		|	&ПериодДата > НАЧАЛОПЕРИОДА(ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2_DATE, ДЕНЬ) КАК ТребуетсяРасчетЦены
		|ПОМЕСТИТЬ _КотировкиЦенныхБумаг
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыТорговПоследнихКотировок КАК _РежимыТорговПоследнихКотировок
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляACCINT
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляACCINT.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляACCINT = ПоследниеКотировкиДляACCINT.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляMARKETPRICE2
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляMARKETPRICE2 = ПоследниеКотировкиДляMARKETPRICE2.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупоныВыходногоДня КАК КупоныВыходногоДня
		|		ПО (КупоныВыходногоДня.Период = &Период)
		|			И (_ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации)
		|			И _ЦенныеБумаги.ЦеннаяБумага = КупоныВыходногоДня.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДляACCINT
		|		ПО (КурсыВалютДляACCINT.Период = &Период)
		|			И (НЕ ПоследниеКотировкиДляACCINT.ЦеннаяБумага ЕСТЬ NULL)
		|			И (КурсыВалютДляACCINT.Валюта = ПоследниеКотировкиДляACCINT.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДляMARKETPRICE2
		|		ПО (КурсыВалютДляMARKETPRICE2.Период = &Период)
		|			И (НЕ ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL)
		|			И (КурсыВалютДляMARKETPRICE2.Валюта = ПоследниеКотировкиДляMARKETPRICE2.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютКупоновВыходногоДня
		|		ПО (КурсыВалютКупоновВыходногоДня.Период = &Период)
		|			И (НЕ КупоныВыходногоДня.Облигация ЕСТЬ NULL)
		|			И (КурсыВалютКупоновВыходногоДня.Валюта = ЕСТЬNULL(ПоследниеКотировкиДляACCINT.ВалютаНоминала, КупоныВыходногоДня.Облигация.ВалютаНоминала))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ПоследниеКотировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РежимыТорговПоследнихКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	_ЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	_ЦенныеБумаги.Количество КАК Количество,
		|	_ЦенныеБумаги.Количество * ЕСТЬNULL(_КотировкиЦенныхБумаг.ACCINT, 0) КАК КупонРынок,
		|	_ЦенныеБумаги.Количество * (ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, _ЦенныеБумаги.Номинал) / 100 * ВЫБОР
		|		КОГДА _КотировкиЦенныхБумаг.ТребуетсяРасчетЦены
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(_КотировкиЦенныхБумаг.MARKETPRICE2, 0)
		|	КОНЕЦ + ЕСТЬNULL(_КотировкиЦенныхБумаг.ACCINT, 0)) КАК СуммаРынок,
		|	_ЦенныеБумаги.БалансоваяСтоимостьБезНКД + _ЦенныеБумаги.Переоценка + _ЦенныеБумаги.НКДУплаченныйНачисленный + _ЦенныеБумаги.Дисконт + _ЦенныеБумаги.Премия + _ЦенныеБумаги.Корректировка КАК Сумма,
		|	_ЦенныеБумаги.НКДУплаченныйНачисленный КАК Купон,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал,
		|	_ЦенныеБумаги.ЦеннаяБумага.ДатаРегистрации КАК ДатаРегистрации,
		|	_ЦенныеБумаги.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОстаткиЦБ
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ЦенныеБумаги.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК _КотировкиЦенныхБумаг
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _КотировкиЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦБ.Эмитент КАК Эмитент,
		|	_ОстаткиЦБ.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	_ОстаткиЦБ.Количество КАК Количество,
		|	_ОстаткиЦБ.Сумма КАК Сумма,
		|	_ОстаткиЦБ.Купон КАК Купон,
		|	_ОстаткиЦБ.СуммаРынок КАК СуммаРынок,
		|	_ОстаткиЦБ.КупонРынок КАК КупонРынок,
		|	_ОстаткиЦБ.Номинал КАК Номинал,
		|	_ОстаткиЦБ.ДатаРегистрации КАК ДатаРегистрации,
		|	_ОстаткиЦБ.ДатаПогашения КАК ДатаПогашения,
		|	_ОстаткиЦБ.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _РезультатОстаткиЦБ
		|ИЗ
		|	_ОстаткиЦБ КАК _ОстаткиЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиЦБ.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _РезультатЦенныеБумаги
		|ИЗ
		|	_ОстаткиЦБ КАК _ОстаткиЦБ";
	#КонецОбласти
	
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
		Или ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний
	Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "MARKETPRICE3", "MARKETPRICE2");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("ПериодДата",						ПериодДата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Биржа",							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Запрос.УстановитьПараметр("ВалютаУчета",					ПараметрыСеанса.ТекущаяОрганизация.ВалютаУчета);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	РезультатОстаткиЦБ = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатОстаткиЦБ",,,, "Эмитент");
	Если РезультатОстаткиЦБ.Пустой() Тогда
		Возврат ТЗРезультат;
	КонецЕсли;
	
	ТаблицаПаев = РезультатОстаткиЦБ.Выгрузить();
	// Для рыночной стоимости требуется доп. обработка результата
	РезультатЦенныеБумаги = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатЦенныеБумаги");
	ЦенныеБумаги = РезультатЦенныеБумаги.Выгрузить();
	
	Объект = Новый Структура;
	Объект.Вставить("СчетДоверительногоУправления",		ЭтотОбъект.СчетДоверительногоУправления);
	Объект.Вставить("ВариантРасчетаОценочнойСтоимости",	Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхНакоплений);
	Объект.Вставить("Организация",						ЭтотОбъект.Организация);
	Объект.Вставить("ВидУчета",							Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Объект.Вставить("Дата",								НачалоДня(ПериодДата));
	Объект.Вставить("ЦенныеБумаги",						ЦенныеБумаги);
	Объект.Вставить("ЦельРасчета",						Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Отказ = Ложь;
	РаботаСПереоценкой.ЗаполнитьКотировки(Объект,,, Отказ);
	
	ТаблицаЦен = Объект.ЦенныеБумаги;
	ТаблицаЦен.Свернуть("ЦеннаяБумага, ИсточникЦены, ОценочнаяЦена");
	
	Для Каждого СтрокаПая Из ТаблицаПаев Цикл
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Новый Структура("ЦеннаяБумага", СтрокаПая.ЦеннаяБумага));
		Если НайденныеСтроки.Количество() = 1 Тогда
			Котировка = НайденныеСтроки[0].ОценочнаяЦена;
			РыночнаяБезНКД = Окр(СтрокаПая.Количество * Котировка, 2);
			СтрокаПая.СуммаРынок = РыночнаяБезНКД;
			
			НКД = ?(ЗначениеЗаполнено(СтрокаПая.КупонРынок),
				СтрокаПая.КупонРынок,
				СтрокаПая.Количество * РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(СтрокаПая.ЦеннаяБумага, ПериодДата, ЭтотОбъект.СчетДоверительногоУправления));
			СтрокаПая.КупонРынок = НКД;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПаев;
КонецФункции

Функция ПолучитьОстаткиДоли(Период, ПериодДата)

	//т.к. доли по партиям не учитываются, и по НПФам их не бывает, то вернем пустую таблицу
	
	ТЗРезультат = Новый ТаблицаЗначений;

	КЧ = Новый КвалификаторыЧисла(15,2);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ТЗРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов(МассивТипов, , КЧ));
	ТЗРезультат.Колонки.Добавить("СуммаРынок", Новый ОписаниеТипов(МассивТипов, , КЧ));
	
	Возврат ТЗРезультат;
	
КонецФункции

Функция ПолучитьОстаткиОблигации(Период, ПериодДата)
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерГосРегистрации,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Номинал,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумагОстатки.СтоимостьОстаток / БухПартииЦенныхБумагОстатки.КоличествоОстаток
		|	КОНЕЦ КАК БалансоваяЦена,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК БалансоваяСтоимостьБезНКД,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК НКДУплаченныйНачисленный,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Дисконт,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток > 0
		|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК Корректировка,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид,
		|	ЛОЖЬ КАК МакетПрочее,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии
		|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Рынок,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
		|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	0,
		|	БухПартииЦенныхБумагКПолучениюОстатки.Партия,
		|	БухПартииЦенныхБумагКПолучениюОстатки.СтрокаПартии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК БухПартииЦенныхБумагКПолучениюОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Рынок КАК Рынок,
		|	_ЦенныеБумаги.Эмитент КАК Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации КАК НомерГосРегистрации,
		|	_ЦенныеБумаги.Номинал КАК Номинал,
		|	СУММА(_ЦенныеБумаги.Количество) КАК Количество,
		|	ВЫБОР
		|		КОГДА СУММА(_ЦенныеБумаги.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) / СУММА(_ЦенныеБумаги.Количество)
		|	КОНЕЦ КАК БалансоваяЦена,
		|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
		|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
		|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
		|	СУММА(_ЦенныеБумаги.Дисконт) КАК Дисконт,
		|	СУММА(_ЦенныеБумаги.Премия) КАК Премия,
		|	СУММА(_ЦенныеБумаги.Корректировка) КАК Корректировка,
		|	_ЦенныеБумаги.Вид КАК Вид,
		|	_ЦенныеБумаги.МакетПрочее КАК МакетПрочее,
		|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ЦенныеБумагиСПартиями КАК _ЦенныеБумаги
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага,
		|	_ЦенныеБумаги.Эмитент,
		|	_ЦенныеБумаги.НомерГосРегистрации,
		|	_ЦенныеБумаги.Вид,
		|	_ЦенныеБумаги.МакетПрочее,
		|	_ЦенныеБумаги.Номинал,
		|	_ЦенныеБумаги.Рынок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Период КАК Период,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок КАК Рынок,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов КАК РежимТоргов,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.Валюта
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.ВалютаНоминала
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.БазоваяЦБ.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT КАК ACCINT,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT_DATE КАК ACCINT_DATE,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE2 КАК MARKETPRICE2,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ПоследниеКотировки
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
		|				&Период,
		|				РежимТоргов.ОсновнойРежим
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ЦенныеБумаги.ЦеннаяБумага
		|						ИЗ
		|							_ЦенныеБумаги КАК _ЦенныеБумаги)
		|					И Биржа = &Биржа) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.MARKETPRICE2_DATE) КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ДатыПоследнихЗначенийКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.Период) КАК МаксимальныйПериод,
		|	МАКСИМУМ(ДатыПоследнихЗначенийMARKETPRICE2.MARKETPRICE2_DATE) КАК MARKETPRICE2_DATE,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|					И _ПоследниеКотировки.MARKETPRICE2 <> 0)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|								И _ПоследниеКотировки.MARKETPRICE2 <> 0
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL
		|							И _ПоследниеКотировки.MARKETPRICE2 <> 0
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляMARKETPRICE2
		|ПОМЕСТИТЬ _РежимыТорговПоследнихКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийACCINT
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийACCINT.ЦеннаяБумага
		|			И (_ПоследниеКотировки.Период = &Период)
		|			И (_ПоследниеКотировки.ACCINT_DATE = &Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийMARKETPRICE2
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага
		|			И _ПоследниеКотировки.MARKETPRICE2_DATE = ДатыПоследнихЗначенийMARKETPRICE2.MARKETPRICE2_DATE
		|ГДЕ
		|	(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|			ИЛИ НЕ ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыПоследнихЗначенийКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(КупоныВыходногоДня.Период, _РежимыТорговПоследнихКотировок.МаксимальныйПериод) КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ КупоныВыходногоДня.Период ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ПоследниеКотировкиДляACCINT.РежимТоргов
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ПоследниеКотировкиДляMARKETPRICE2.РежимТоргов КАК РежимТорговДляMARKETPRICE2,
		|	ЕСТЬNULL(КупоныВыходногоДня.ACCINT * (КурсыВалютКупоновВыходногоДня.Курс / КурсыВалютКупоновВыходногоДня.Кратность), ПоследниеКотировкиДляACCINT.ACCINT * (КурсыВалютДляACCINT.Курс / КурсыВалютДляACCINT.Кратность)) КАК ACCINT,
		|	ВЫБОР
		|		КОГДА ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2
		|		ИНАЧЕ ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2 * (КурсыВалютДляMARKETPRICE2.Курс / КурсыВалютДляMARKETPRICE2.Кратность)
		|	КОНЕЦ КАК MARKETPRICE2,
		|	ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE,
		|	&ПериодДата > НАЧАЛОПЕРИОДА(ПоследниеКотировкиДляMARKETPRICE2.MARKETPRICE2_DATE, ДЕНЬ) КАК ТребуетсяРасчетЦены
		|ПОМЕСТИТЬ _КотировкиЦенныхБумаг
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыТорговПоследнихКотировок КАК _РежимыТорговПоследнихКотировок
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляACCINT
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляACCINT.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляACCINT = ПоследниеКотировкиДляACCINT.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляMARKETPRICE2
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляMARKETPRICE2 = ПоследниеКотировкиДляMARKETPRICE2.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупоныВыходногоДня КАК КупоныВыходногоДня
		|		ПО (КупоныВыходногоДня.Период = &Период)
		|			И (_ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации)
		|			И _ЦенныеБумаги.ЦеннаяБумага = КупоныВыходногоДня.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДляACCINT
		|		ПО (КурсыВалютДляACCINT.Период = &Период)
		|			И (НЕ ПоследниеКотировкиДляACCINT.ЦеннаяБумага ЕСТЬ NULL)
		|			И (КурсыВалютДляACCINT.Валюта = ПоследниеКотировкиДляACCINT.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДляMARKETPRICE2
		|		ПО (КурсыВалютДляMARKETPRICE2.Период = &Период)
		|			И (НЕ ПоследниеКотировкиДляMARKETPRICE2.ЦеннаяБумага ЕСТЬ NULL)
		|			И (КурсыВалютДляMARKETPRICE2.Валюта = ПоследниеКотировкиДляMARKETPRICE2.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютКупоновВыходногоДня
		|		ПО (КурсыВалютКупоновВыходногоДня.Период = &Период)
		|			И (НЕ КупоныВыходногоДня.Облигация ЕСТЬ NULL)
		|			И (КурсыВалютКупоновВыходногоДня.Валюта = ЕСТЬNULL(ПоследниеКотировкиДляACCINT.ВалютаНоминала, КупоныВыходногоДня.Облигация.ВалютаНоминала))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ПоследниеКотировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РежимыТорговПоследнихКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	ЦенныеБумаги.ЦеннаяБумага.Категория КАК Категория,
		|	ЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ЦенныеБумаги.Количество КАК Количество,
		|	ЦенныеБумаги.Количество * ЕСТЬNULL(КотировкиЦенныхБумаг.ACCINT, 0) КАК КупонРынок,
		|	ЦенныеБумаги.Количество * (ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, ЦенныеБумаги.Номинал) / 100 * ВЫБОР
		|		КОГДА КотировкиЦенныхБумаг.ТребуетсяРасчетЦены
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(КотировкиЦенныхБумаг.MARKETPRICE2, 0)
		|	КОНЕЦ + ЕСТЬNULL(КотировкиЦенныхБумаг.ACCINT, 0)) КАК СуммаРынок,
		|	ЦенныеБумаги.БалансоваяСтоимостьБезНКД + ЦенныеБумаги.Переоценка + ЦенныеБумаги.НКДУплаченныйНачисленный + ЦенныеБумаги.Дисконт + ЦенныеБумаги.Премия + ЦенныеБумаги.Корректировка КАК Сумма,
		|	ЦенныеБумаги.НКДУплаченныйНачисленный КАК Купон,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал,
		|	ЦенныеБумаги.ЦеннаяБумага.ДатаРегистрации КАК ДатаРегистрации,
		|	ЦенныеБумаги.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ ОстаткиОблигаций
		|ИЗ
		|	_ЦенныеБумаги КАК ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО ЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЦенныеБумаги.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК КотировкиЦенныхБумаг
		|		ПО ЦенныеБумаги.ЦеннаяБумага = КотировкиЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиОблигаций.Категория КАК Категория,
		|	СУММА(ОстаткиОблигаций.Сумма) КАК Сумма,
		|	СУММА(ОстаткиОблигаций.Купон) КАК Купон,
		|	СУММА(ОстаткиОблигаций.СуммаРынок) КАК СуммаРынок,
		|	СУММА(ОстаткиОблигаций.КупонРынок) КАК КупонРынок
		|ПОМЕСТИТЬ _РезультатОстаткиОблигацийИтог
		|ИЗ
		|	ОстаткиОблигаций КАК ОстаткиОблигаций
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиОблигаций.Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиОблигаций.Эмитент КАК Эмитент,
		|	ОстаткиОблигаций.Категория КАК Категория,
		|	ОстаткиОблигаций.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ОстаткиОблигаций.Количество КАК Количество,
		|	ОстаткиОблигаций.Сумма КАК Сумма,
		|	ОстаткиОблигаций.Купон КАК Купон,
		|	ОстаткиОблигаций.СуммаРынок КАК СуммаРынок,
		|	ОстаткиОблигаций.КупонРынок КАК КупонРынок,
		|	ОстаткиОблигаций.Номинал КАК Номинал,
		|	ОстаткиОблигаций.ДатаРегистрации КАК ДатаРегистрации,
		|	ОстаткиОблигаций.ДатаПогашения КАК ДатаПогашения,
		|	ОстаткиОблигаций.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _РезультатОстаткиОблигаций
		|ИЗ
		|	ОстаткиОблигаций КАК ОстаткиОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиОблигаций.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _РезультатЦенныеБумаги
		|ИЗ
		|	ОстаткиОблигаций КАК ОстаткиОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДефолтыПоОблигациямСрезПоследних.Период КАК Период,
		|	ДефолтыПоОблигациямСрезПоследних.Облигация КАК Облигация,
		|	ДефолтыПоОблигациямСрезПоследних.ТипДефолта КАК ТипДефолта,
		|	ДефолтыПоОблигациямСрезПоследних.СтатусДефолта КАК СтатусДефолта,
		|	ДефолтыПоОблигациямСрезПоследних.Облигация.Эмитент КАК ОблигацияЭмитент
		|ПОМЕСТИТЬ _РезультатДефолтыПоОблигациям
		|ИЗ
		|	РегистрСведений.ДефолтыПоОблигациям.СрезПоследних(
		|			&Период,
		|			ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации)
		|				И СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)) КАК ДефолтыПоОблигациямСрезПоследних";
	#КонецОбласти
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "MARKETPRICE3", "MARKETPRICE2");
	
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("ПериодДата",						НачалоДня(ПериодДата));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Биржа",							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Запрос.УстановитьПараметр("ВалютаУчета",					ПараметрыСеанса.ТекущаяОрганизация.ВалютаУчета);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	РезультатОстаткиЦБ = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатОстаткиОблигаций",,,, "Эмитент");
	ТаблицаОблигаций = РезультатОстаткиЦБ.Выгрузить();
	РезультатОстаткиОблигацийИтог = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатОстаткиОблигацийИтог");
	ТаблицаГрупп = РезультатОстаткиОблигацийИтог.Выгрузить();
	
	Если ВыводитьБалансовуюСтоимость Или ТаблицаОблигаций.Количество() = 0 Тогда
		Возврат Новый Структура("Облигации, ГруппыОблигаций", ТаблицаОблигаций, ТаблицаГрупп);
	КонецЕсли;
	
	// Для рыночной стоимости требуется доп. обработка результата
	РезультатДефолтыПоОблигациям = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатДефолтыПоОблигациям");
	ТаблицаДефолтов = РезультатДефолтыПоОблигациям.Выгрузить();
	РезультатЦенныеБумаги = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос.МенеджерВременныхТаблиц, "_РезультатЦенныеБумаги");
	ЦенныеБумаги = РезультатЦенныеБумаги.Выгрузить();
	
	Объект = Новый Структура;
	Объект.Вставить("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Объект.Вставить("ВариантРасчетаОценочнойСтоимости", Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхНакоплений);
	Объект.Вставить("Организация", 						ЭтотОбъект.Организация);
	Объект.Вставить("ВидУчета",							Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Объект.Вставить("Дата", 							НачалоДня(ПериодДата));
	Объект.Вставить("ЦенныеБумаги",						ЦенныеБумаги);
	Объект.Вставить("ЦельРасчета",						Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Отказ = Ложь;
	РаботаСПереоценкой.ЗаполнитьКотировки(Объект,,, Отказ);
	
	ТаблицаЦен = Объект.ЦенныеБумаги;
	ТаблицаОблигаций.Сортировать("Категория");
	ТаблицаЦен.Свернуть("ЦеннаяБумага, ИсточникЦены, ОценочнаяЦена");
	
	СуммаПоКатегории = 0;
	СуммаНКДПоКатегории = 0;
	ТекКатегория = ТаблицаОблигаций[0].Категория;
	Для Каждого СтрокаОблигации Из ТаблицаОблигаций Цикл
		Если ТекКатегория <> СтрокаОблигации.Категория Тогда
			НайдСтрокиКатегории = ТаблицаГрупп.НайтиСтроки(Новый Структура("Категория", ТекКатегория));
			Для Каждого СтрокаКатегории Из НайдСтрокиКатегории Цикл
				СтрокаКатегории.СуммаРынок = СуммаПоКатегории;
				СтрокаКатегории.КупонРынок = СуммаНКДПоКатегории;
			КонецЦикла;
			ТекКатегория        = СтрокаОблигации.Категория;
			СуммаПоКатегории    = 0;
			СуммаНКДПоКатегории = 0;
		КонецЕсли;
		
		// Сначала проверим дефолты
		НайденныеСтроки = ТаблицаДефолтов.НайтиСтроки(Новый Структура("Облигация", СтрокаОблигации.ЦеннаяБумага));
		Если НайденныеСтроки.Количество() >= 1 Тогда // Облигация в дефолте, рыночную стоимость и НКД считаем равными 0
			СтрокаОблигации.СуммаРынок = 0;
			СтрокаОблигации.КупонРынок = 0;
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Новый Структура("ЦеннаяБумага", СтрокаОблигации.ЦеннаяБумага));
		Если НайденныеСтроки.Количество() = 1 Тогда
			Котировка = НайденныеСтроки[0].ОценочнаяЦена;
			РыночнаяБезНКД = Окр(СтрокаОблигации.Количество * Котировка, 2);
			СтрокаОблигации.СуммаРынок = РыночнаяБезНКД;
			СуммаПоКатегории = СуммаПоКатегории + СтрокаОблигации.СуммаРынок;
			
			НКД = ?(ЗначениеЗаполнено(СтрокаОблигации.КупонРынок),
				СтрокаОблигации.КупонРынок,
				СтрокаОблигации.Количество * РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(СтрокаОблигации.ЦеннаяБумага, ПериодДата, ЭтотОбъект.СчетДоверительногоУправления));
			СтрокаОблигации.КупонРынок = НКД;
			СуммаНКДПоКатегории = СуммаНКДПоКатегории + НКД;
		КонецЕсли;
	КонецЦикла;
	
	НайдСтрокиКатегории = ТаблицаГрупп.НайтиСтроки(Новый Структура("Категория", ТекКатегория));
	Для Каждого СтрокаКатегории Из НайдСтрокиКатегории Цикл
		СтрокаКатегории.СуммаРынок = СуммаПоКатегории;
		СтрокаКатегории.КупонРынок = СуммаНКДПоКатегории;
	КонецЦикла;
	
	Возврат Новый Структура("Облигации, ГруппыОблигаций", ТаблицаОблигаций, ТаблицаГрупп);
КонецФункции

Функция ПолучитьОстаткиЦБКупленныхПоРЕПО(Период, ПериодДата)
	
	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период КАК Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Регистратор КАК Регистратор,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.НомерСтроки КАК НомерСтроки,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность КАК Активность,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация КАК Организация,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент КАК Контрагент,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Основание,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынок КАК СуммаРынок,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ДатаРегистрации КАК ДатаРегистрации,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ТИПЗНАЧЕНИЯ(НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ""Облигация""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ
		|ПОМЕСТИТЬ _СтоимостьАктивов
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|ГДЕ
		|	(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|			ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги))
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &Период
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(СделкаРЕПОЦенныеБумаги.Количество) КАК Количество,
		|	СделкаРЕПОЦенныеБумаги.Цена КАК Цена,
		|	СделкаРЕПОЦенныеБумаги.Ссылка КАК Ссылка,
		|	СУММА(СделкаРЕПОЦенныеБумаги.СуммаКупона) КАК СуммаКупона
		|ПОМЕСТИТЬ _КоличествоЦБ
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_СтоимостьАктивов.Основание
		|			ИЗ
		|				_СтоимостьАктивов КАК _СтоимостьАктивов)
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.Цена,
		|	СделкаРЕПОЦенныеБумаги.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьОстаток, 0)) КАК Сумма
		|ПОМЕСТИТЬ _ПроверкаПоРегистру
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
		|			&ПериодГраница,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииЦенныхБумагКупленныеПоРЕПООстатки
		|;
		|	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтоимостьАктивов.СубъектАналитики КАК СубъектАналитики,
		|	_СтоимостьАктивов.Валюта КАК Валюта,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги)
		|				ТОГДА _СтоимостьАктивов.СуммаРынокВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРынок,
		|	_СтоимостьАктивов.Номинал КАК Номинал,
		|	_СтоимостьАктивов.ДатаПогашения КАК ДатаПогашения,
		|	_СтоимостьАктивов.ДатаРегистрации КАК ДатаРегистрации,
		|	_СтоимостьАктивов.Эмитент КАК Эмитент,
		|	_СтоимостьАктивов.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	_СтоимостьАктивов.ТипЦБ КАК ТипЦБ,
		|	_КоличествоЦБ.Количество КАК Количество,
		|	_КоличествоЦБ.Цена КАК Цена,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеЭмитента,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				ТОГДА _СтоимостьАктивов.СуммаРынокВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Купон,
		|	_ПроверкаПоРегистру.Сумма КАК Проверка
		|ИЗ
		|	_СтоимостьАктивов КАК _СтоимостьАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КоличествоЦБ КАК _КоличествоЦБ
		|		ПО _СтоимостьАктивов.СубъектАналитики = _КоличествоЦБ.ЦеннаяБумага
		|			И _СтоимостьАктивов.Основание = _КоличествоЦБ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _СтоимостьАктивов.Эмитент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо,
		|	_ПроверкаПоРегистру КАК _ПроверкаПоРегистру
		|ГДЕ
		|	_ПроверкаПоРегистру.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтоимостьАктивов.СубъектАналитики,
		|	_СтоимостьАктивов.Валюта,
		|	_СтоимостьАктивов.Номинал,
		|	_СтоимостьАктивов.ДатаПогашения,
		|	_СтоимостьАктивов.ДатаРегистрации,
		|	_СтоимостьАктивов.Эмитент,
		|	_СтоимостьАктивов.ГосударственныйРегистрационныйНомер,
		|	_СтоимостьАктивов.ТипЦБ,
		|	_КоличествоЦБ.Количество,
		|	_КоличествоЦБ.Цена,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
		|	_ПроверкаПоРегистру.Сумма
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипЦБ";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Период", 					  НачалоДня(ПериодДата));
	Запрос.УстановитьПараметр("ПериодГраница", 				  Период);
	Запрос.УстановитьПараметр("Организация", 	 			  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
				
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции // ПолучитьОстаткиЦБКупленныхПоРЕПО

Функция ПолучитьАкцииВПути(Период,ТипЗадолженности)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.Тип КАК Тип,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК Количество,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.Номинал КАК Номинал,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Период,
		|			ТипЗадолженности = &ТипЗадолженности
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|				И (ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|					ИЛИ ВЫРАЗИТЬ(Основание КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	Эмитент";

	Запрос.УстановитьПараметр("ТипЗадолженности", 				ТипЗадолженности);
	Запрос.УстановитьПараметр("Период", 						Период);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьПаиВПути(Период,ТипЗадолженности)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.ПаевойИнвестиционныйФонд КАК Эмитент,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК Количество,
		|	"""" КАК Номинал,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Период,
		|			ТипЗадолженности = &ТипЗадолженности
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|				И (ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|					ИЛИ ВЫРАЗИТЬ(Основание КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Эмитент";

	Запрос.УстановитьПараметр("ТипЗадолженности", 				ТипЗадолженности);
	Запрос.УстановитьПараметр("Период", 						Период);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьОблигацииВПути(Период,ТипЗадолженности)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.Категория КАК Категория,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК Количество,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток КАК Сумма,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток КАК Купон,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.ДатаРегистрации КАК ДатаРегистрации,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения
		|ПОМЕСТИТЬ ОстаткиОблигаций
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Период,
		|			ТипЗадолженности = &ТипЗадолженности
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И (ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|					ИЛИ ВЫРАЗИТЬ(Основание КАК Документ.Сделка).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиОблигаций.Категория,
		|	СУММА(ОстаткиОблигаций.Сумма) КАК Сумма,
		|	СУММА(ОстаткиОблигаций.Купон) КАК Купон
		|ИЗ
		|	ОстаткиОблигаций КАК ОстаткиОблигаций
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиОблигаций.Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиОблигаций.Эмитент КАК Эмитент,
		|	ОстаткиОблигаций.Категория,
		|	ОстаткиОблигаций.ГосударственныйРегистрационныйНомер,
		|	ОстаткиОблигаций.Количество,
		|	ОстаткиОблигаций.Сумма,
		|	ОстаткиОблигаций.Купон,
		|	ОстаткиОблигаций.Номинал,
		|	ОстаткиОблигаций.ДатаРегистрации,
		|	ОстаткиОблигаций.ДатаПогашения
		|ИЗ
		|	ОстаткиОблигаций КАК ОстаткиОблигаций
		|
		|УПОРЯДОЧИТЬ ПО
		|	Эмитент";

	#КонецОбласти
	
	Запрос.УстановитьПараметр("ТипЗадолженности", 				ТипЗадолженности);
	Запрос.УстановитьПараметр("Период", 						Период);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Возврат Новый Структура("Облигации,ГруппыОблигаций", Запрос.ВыполнитьПакет()[2].Выгрузить(), Запрос.ВыполнитьПакет()[1].Выгрузить());

КонецФункции

Процедура ВывестиСделки(ТабДок, МакетПодраздел, ТипСделок = "Сделки") // также "РЕПОАдресные", "РЕПОБезадресные", "РПС", "Тикеты"

	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.НачалоПериода, ЭтотОбъект.КонецПериода);
	
	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|				ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КомиссияБиржи,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|				ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КомиссияБрокера,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание
		|ПОМЕСТИТЬ _ЗадолженностиПоКомиссиям
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА РеквизитыЭмитента.ПолноеНаименованиеПоУставу
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА РеквизитыЭмитента.ПолноеНаименованиеПоУставу
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА РеквизитыЭмитента.ПолноеНаименованиеПоУставу
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ДатаРегистрации
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).ДатаСоставления
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ДатаРегистрации
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ДатаРегистрации
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаВыпуска,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ДатаАннулирования
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).ДатаПогашения
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА """"
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ""акция""
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ""вексель""
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ""облигация""
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ""пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.Тип
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.Тип
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.ТипВекселя
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК РегНомер,
		|	СделкаДокумент.Дата КАК ДатаСделки,
		|	СделкаДокумент.ВидСделки КАК ВидСделки,
		|	СделкаДокумент.МестоХранения КАК МестоЗаключения,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номинал
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА НоминалыЦенныхБумагСрезПоследних.Номинал
		|		КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА """"
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Номинал,
		|	СделкаЦенныеБумаги.Цена КАК Цена,
		|	СделкаЦенныеБумаги.Сумма КАК Сумма,
		|	СделкаЦенныеБумаги.СуммаКупона КАК НКД,
		|	_ЗадолженностиПоКомиссиям.КомиссияБиржи КАК КомиссияБиржи,
		|	_ЗадолженностиПоКомиссиям.КомиссияБрокера КАК КомиссияБрокера,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплатыПлан,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставкиПлан,
		|	ПлановыеДатыОплатПоТорговойКомиссии.ДатаОплаты КАК ДатаОплатыКомиссииБиржи,
		|	ПлановыеДатыОплатПоБрокерскойКомиссии.ДатаОплаты КАК ДатаОплатыКомиссииБрокера,
		|	СделкаДокумент.Контрагент КАК Контрагент,
		|	СделкаДокумент.НомерСделки КАК НомерСделки,
		|	&ПоляРЕПО КАК ПоляРЕПО,
		|	&ПоляРПС КАК ПоляРПС
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|		ПО СделкаЦенныеБумаги.Ссылка = СделкаДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ), ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериодаДата, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ),
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЭмитента
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(СделкаЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|					ТОГДА """"
		|			КОНЕЦ = РеквизитыЭмитента.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО СделкаЦенныеБумаги.Ссылка = УсловияСделокСрезПоследних.Сделка
		|			И СделкаЦенныеБумаги.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|			И (&УсловиеРЕПО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК ПлановыеДатыОплатПоТорговойКомиссии
		|		ПО (УсловияСделокСрезПоследних.Сделка = ПлановыеДатыОплатПоТорговойКомиссии.Основание)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК ПлановыеДатыОплатПоБрокерскойКомиссии
		|		ПО (УсловияСделокСрезПоследних.Сделка = ПлановыеДатыОплатПоБрокерскойКомиссии.Основание)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностиПоКомиссиям КАК _ЗадолженностиПоКомиссиям
		|		ПО СделкаЦенныеБумаги.Ссылка = _ЗадолженностиПоКомиссиям.Основание
		|			И (&БумагиРЕПО)
		|ГДЕ
		|	СделкаДокумент.Проведен = ИСТИНА
		|	И СделкаДокумент.Организация = &Организация
		|	И СделкаДокумент.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаДокумент.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериодаДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ)
		|	И &УсловиеМестоХранения
		|	И &УсловиеВидСделки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСделки";
	
	#КонецОбласти
	
	Если ТипСделок = "Сделки" Тогда
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМестоХранения", 	"НЕ СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидСделки", 		"НЕ СделкаДокумент.РежимБиржевыхТоргов.РежимПереговорныхСделок");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРЕПО", 				"NULL");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРПС", 				"NULL");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (&БумагиРЕПО)", 		"");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРЕПО", 			"ИСТИНА");
	
	ИначеЕсли ТипСделок = "РЕПО" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМестоХранения", 				"НЕ СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидСделки", 					"СделкаДокумент.ЧастьСделкиРЕПО = 1");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделка", 								"СделкаРЕПО");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СделкаРЕПОСЦентральнымКонтрагентом", 	"СделкаСЦентральнымКонтрагентом");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделок", "СделокРЕПО");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРЕПО КАК ПоляРЕПО",
			"СделкаРЕПОДокумент.ДатаПоставкиВторойЧасти КАК ДатаПоставкиЧ2План
			|,СделкаРЕПОДокумент.ДатаОплатыВторойЧасти КАК ДатаОплатыЧ2План
			|,СделкаРЕПОДокумент.СтавкаРЕПО КАК СтавкаРЕПО
			|,СделкаРЕПОЦенныеБумагиВторойЧасти.Цена КАК ЦенаЧ2
			|,СделкаРЕПОЦенныеБумагиВторойЧасти.Сумма КАК СуммаЧ2
			|,СделкаРЕПОЦенныеБумагиВторойЧасти.СуммаКупона КАК НКДЧ2
			|,УсловияСделокРЕПОСрезПоследнихЧ2.ДатаОплаты КАК ДатаОплатыЧ2
			|,УсловияСделокРЕПОСрезПоследнихЧ2.ДатаПоставки КАК ДатаПоставкиЧ2");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (&БумагиРЕПО)",
			"ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумагиВторойЧасти КАК СделкаРЕПОЦенныеБумагиВторойЧасти 
			|ПО СделкаРЕПОЦенныеБумаги.Ссылка = СделкаРЕПОЦенныеБумагиВторойЧасти.Ссылка
			|	И СделкаРЕПОЦенныеБумаги.ЦеннаяБумага = СделкаРЕПОЦенныеБумагиВторойЧасти.ЦеннаяБумага
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследнихЧ2
			|ПО СделкаРЕПОЦенныеБумаги.Ссылка = УсловияСделокРЕПОСрезПоследнихЧ2.СделкаРЕПО
			|	И СделкаРЕПОЦенныеБумаги.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследнихЧ2.ЦеннаяБумага
			|	И УсловияСделокРЕПОСрезПоследнихЧ2.ЧастьСделкиРЕПО = 2");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРПС", 		"NULL");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРЕПО", 	"УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 1");
		
	ИначеЕсли ТипСделок = "РПС" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМестоХранения", 	"НЕ СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидСделки", 		"СделкаДокумент.РежимБиржевыхТоргов.РежимПереговорныхСделок");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРЕПО", 				"NULL");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРПС КАК ПоляРПС", 	"ВЫБОР КОГДА СделкаДокумент.РежимБиржевыхТоргов.ПервичноеРазмещение ТОГДА ""V"" ИНАЧЕ """" КОНЕЦ КАК ПервичноеРазмещение");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (&БумагиРЕПО)", 		"");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРЕПО", 			"ИСТИНА");
		
	ИначеЕсли ТипСделок = "Тикеты" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМестоХранения", 	"СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидСделки", 		"ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРЕПО", 				"NULL");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляРПС", 				"NULL");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (&БумагиРЕПО)", 		"");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРЕПО", 			"ИСТИНА");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", 					Новый Граница(НачалоДня(ЭтотОбъект.НачалоПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", 					Новый Граница(КонецДня(ЭтотОбъект.КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериодаДата", 				ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериодаДата", 				ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);

	Сделки = Запрос.Выполнить().Выгрузить();

	Если Сделки.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ТабДок.Вывести(МакетПодраздел);
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка 	= Макет.ПолучитьОбласть("Шапка" + ТипСделок);
	МакетСтрока = Макет.ПолучитьОбласть("Строка" + ТипСделок);
	
	ТабДок.Вывести(МакетШапка);
	Если Сделки.Количество() > 0 Тогда	
		Для каждого СтрокаСделки Из Сделки Цикл
			
			ЗаполнитьЗначенияСвойств(МакетСтрока.Параметры, СтрокаСделки);
			МакетСтрока.Параметры.ДатаВыпуска	= Формат(СтрокаСделки.ДатаВыпуска, "ДФ=dd.MM.yy");
			МакетСтрока.Параметры.ДатаПогашения	= Формат(СтрокаСделки.ДатаПогашения, "ДФ=dd.MM.yy");
			
			ТабДок.Вывести(МакетСтрока);
						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиВводыВыводыДС(ТабДок, МакетПодраздел, Прочие = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводДенежныхСредств.Дата КАК ДатаОперации,
		|	ВводДенежныхСредств.Сумма КАК СуммаОперации,
		|	ВводДенежныхСредств.Сумма КАК СуммаЗнак,
		|	""Приход"" КАК ОписаниеОперации
		|ИЗ
		|	Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
		|ГДЕ
		|	ВводДенежныхСредств.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериодаДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ)
		|	И ВводДенежныхСредств.Проведен = ИСТИНА
		|	И ВводДенежныхСредств.Организация = &Организация
		|	И ВводДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И &УсловияВидОперацииВвод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыводДенежныхСредств.Дата,
		|	ВыводДенежныхСредств.Сумма,
		|	-ВыводДенежныхСредств.Сумма,
		|	""Расход""
		|ИЗ
		|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
		|ГДЕ
		|	ВыводДенежныхСредств.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериодаДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ)
		|	И ВыводДенежныхСредств.Проведен = ИСТИНА
		|	И ВыводДенежныхСредств.Организация = &Организация
		|	И ВыводДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И &УсловияВидОперацииВывод";

	Запрос.УстановитьПараметр("НачалоПериодаДата", 				ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериодаДата", 				ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);

	Если НЕ Прочие Тогда
		
		СтрокаЗаменыВвод = "
		|  (ВводДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление)
		|	ИЛИ ВводДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР)
		|	ИЛИ ВводДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии))";
		
		СтрокаЗаменыВывод = "
		|  (ВыводДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДляОбеспеченияИОУД)
		|	ИЛИ ВыводДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР)
		|	ИЛИ ВыводДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению))";
		
	Иначе
		
		СтрокаЗаменыВвод = "
		|  (ВводДенежныхСредств.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление)
		|	И ВводДенежныхСредств.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР)
		|	И ВводДенежныхСредств.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии))";
		
		СтрокаЗаменыВывод = "
		|  (ВыводДенежныхСредств.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДляОбеспеченияИОУД)
		|	И ВыводДенежныхСредств.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР)
		|	И ВыводДенежныхСредств.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению))";
		
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияВидОперацииВвод",		СтрокаЗаменыВвод);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияВидОперацииВывод", 	СтрокаЗаменыВывод);
	
	ВводыВыводыДС = Запрос.Выполнить().Выгрузить();

	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка 	= Макет.ПолучитьОбласть("ШапкаВводВыводДС");
	МакетСтрока = Макет.ПолучитьОбласть("СтрокаВводВыводДС");
	МакетПодвал = Макет.ПолучитьОбласть("ПодвалВводВыводДС");
	
	ТабДок.Вывести(МакетШапка);
	
	Если ВводыВыводыДС.Количество() > 0 Тогда
		ТабДок.Вывести(МакетПодраздел);
		Для каждого СтрокаВводыВыводыДС Из ВводыВыводыДС Цикл
			ЗаполнитьЗначенияСвойств(МакетСтрока.Параметры, СтрокаВводыВыводыДС);
			МакетСтрока.Параметры.ДатаВводаВывода 	= Формат(СтрокаВводыВыводыДС.ДатаОперации, "ДФ=dd.MM.yyyy");
			МакетСтрока.Параметры.ВремяВводаВывода 	= Формат(СтрокаВводыВыводыДС.ДатаОперации, "ДЛФ=T");
			ТабДок.Вывести(МакетСтрока);
		КонецЦикла;
		МакетПодвал.Параметры.ИтогСуммаОперации = ВводыВыводыДС.Итог("СуммаЗнак");
	КонецЕсли;
	
	ТабДок.Вывести(МакетПодвал);

КонецПроцедуры

Процедура ВывестиВводыВыводыЦБ(ТабДок, МакетПодраздел, Ввод = Истина)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда
		|		ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""акция""
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ""облигация""
		|		ИНАЧЕ ""пай""
		|	КОНЕЦ КАК ВидЦБ,
		|	ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Тип
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Тип
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.ДатаРегистрации
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.ДатаРегистрации
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаВыпуска,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА """"
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.ДатаПогашения
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаПогашения,
		|	ВводЦенныхБумагЦенныеБумаги.Количество,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Номинал
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА НоминалыЦенныхБумагСрезПоследних.Номинал
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Номинал,
		|	ВводЦенныхБумагЦенныеБумаги.Сумма,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаКупона,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаРынок,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок,
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок
		|ПОМЕСТИТЬ ВводыВыводы
		|ИЗ
		|	Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериодаДата,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&КонецПериодаДата, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериодаДата, ) КАК РеквизитыПИФСрезПоследних
	    |		ПО ВЫРАЗИТЬ(ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|ГДЕ
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериодаДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ)
		|	И ВводЦенныхБумагЦенныеБумаги.Ссылка.Проведен = ИСТИНА
		|	И ВводЦенныхБумагЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводы.Дата КАК ДатаВремя,
		|	ВводыВыводы.Эмитент,
		|	ВводыВыводы.ВидЦБ,
		|	ВводыВыводы.ТипЦБ,
		|	ВводыВыводы.ГосударственныйРегистрационныйНомер,
		|	ВводыВыводы.ДатаВыпуска,
		|	ВводыВыводы.ДатаПогашения,
		|	ВводыВыводы.Количество,
		|	ВводыВыводы.Номинал,
		|	ВводыВыводы.Сумма,
		|	ВводыВыводы.СуммаКупона,
		|	ВводыВыводы.СуммаРынок,
		|	ВводыВыводы.СуммаКупонаРынок,
		|	ВводыВыводы.Рынок КАК Рынок
		|ИЗ
		|	ВводыВыводы КАК ВводыВыводы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рынок,
		|	ДатаВремя";

	#КонецОбласти
	
	Если НЕ Ввод Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВводЦенныхБумагЦенныеБумаги.Сумма", "ВводЦенныхБумагЦенныеБумаги.СуммаБУ КАК Сумма");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВводЦенныхБумагЦенныеБумаги.СуммаКупона", "ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок КАК СуммаКупона");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Ввод", "Вывод");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериодаДата", 				ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериодаДата", 				ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Активы = РезультатЗапроса[1].Выгрузить();

	Если Активы.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ТабДок.Вывести(МакетПодраздел);
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаВводВыводЦенныеБумаги"));
	
	Для каждого СтрокаАктив Из Активы Цикл
		МакетСтрокаВводВыводЦенныеБумаги = Макет.ПолучитьОбласть("СтрокаВводВыводЦенныеБумаги");
		ЗаполнитьЗначенияСвойств(МакетСтрокаВводВыводЦенныеБумаги.Параметры, СтрокаАктив, , "ДатаВыпуска,ДатаПогашения");
		МакетСтрокаВводВыводЦенныеБумаги.Параметры.ДатаВыпуска		= Формат(СтрокаАктив.ДатаВыпуска, "ДФ=dd.MM.yy");
		МакетСтрокаВводВыводЦенныеБумаги.Параметры.ДатаПогашения	= Формат(СтрокаАктив.ДатаПогашения, "ДФ=dd.MM.yy");
		
		ТабДок.Вывести(МакетСтрокаВводВыводЦенныеБумаги);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДвижениеДС(ТабДок, МакетПодраздел)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.Сумма КАК Сумма,
		|	ОстаткиДенежныхСредств.Период КАК Период,
		|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.ВидДвижения КАК ВидДвижения,
		|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности
		|ПОМЕСТИТЬ _ОбщаяТаблица
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО ОстаткиДенежныхСредств.Регистратор = ЗадолженностиПоДенежнымСредствам.Регистратор
		|ГДЕ
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|	И (ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ПриходПроцентовПоКредитномуИнструменту)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ЗакрытиеКредитногоИнструмента)
		|				И ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ВыводДенежныхСредств)
		|				И ОстаткиДенежныхСредств.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратОшибочноЗачисленных)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
		|				И (ОстаткиДенежныхСредств.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваДоходПоПаямЗПИФ)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами))
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ПриходПроцентовМНО)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.Оплата)
		|				И (ОстаткиДенежныхСредств.Регистратор.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи)
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции)))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА -(ЗадолженностиПоДенежнымСредствам.Сумма + ЗадолженностиПоДенежнымСредствам.СуммаКупона)
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствам.Сумма + ЗадолженностиПоДенежнымСредствам.СуммаКупона
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствам.Период,
		|	ЗадолженностиПоДенежнымСредствам.Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.ВидДвижения,
		|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.ВидЗадолженности
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|	И ЗадолженностиПоДенежнымСредствам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|	И ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствам.Регистратор) = ТИП(Документ.Оплата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбщаяТаблица.Сумма КАК Сумма,
		|	_ОбщаяТаблица.Период КАК Период,
		|	_ОбщаяТаблица.Регистратор КАК Регистратор,
		|	_ОбщаяТаблица.ВидДвижения КАК ВидДвижения,
		|	_ОбщаяТаблица.ТипЗадолженности КАК ТипЗадолженности,
		|	_ОбщаяТаблица.ВидЗадолженности КАК ВидЗадолженности
		|ИЗ
		|	_ОбщаяТаблица КАК _ОбщаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";

	#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода", 					ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 					ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", 					Организация);

	ПриходыДС = Запрос.Выполнить().Выгрузить();

	Если ПриходыДС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок.Вывести(МакетПодраздел);

	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка 	= Макет.ПолучитьОбласть("ШапкаДвижениеДС");
	МакетСтрока = Макет.ПолучитьОбласть("СтрокаДвижениеДС");
	
	Если ПриходыДС.Количество() > 0 Тогда
		ТабДок.Вывести(МакетШапка);
				
		Для каждого СтрокаПриходыДС Из ПриходыДС Цикл
			
			МакетСтрока.Параметры.ДатаОперации 	= Формат(СтрокаПриходыДС.Период, "ДФ=dd.MM.yyyy");
			МакетСтрока.Параметры.ВремяОперации = Формат(СтрокаПриходыДС.Период, "ДЛФ=T");
			МакетСтрока.Параметры.СуммаОперации = СтрокаПриходыДС.Сумма;
			
			Если ТипЗнч(СтрокаПриходыДС.Регистратор) = Тип("ДокументСсылка.ПриходПроцентовПоКредитномуИнструменту") 
				ИЛИ  ТипЗнч(СтрокаПриходыДС.Регистратор) = Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента") И ТипЗнч(СтрокаПриходыДС.Регистратор.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
				МакетСтрока.Параметры.ОписаниеОперации = "Поступление ДС. Приход % по банковскому депозитному вкладу " + СтрокаПриходыДС.Регистратор.КредитныйИнструмент.Наименование;
			ИначеЕсли ТипЗнч(СтрокаПриходыДС.Регистратор) = Тип("ДокументСсылка.ПриходПроцентовМНО") Тогда
				МакетСтрока.Параметры.ОписаниеОперации = "Поступление ДС. Приход % по МНО";
			ИначеЕсли ТипЗнч(СтрокаПриходыДС.Регистратор) = Тип("ДокументСсылка.ВводДенежныхСредств") Тогда
				МакетСтрока.Параметры.ОписаниеОперации = СтрокаПриходыДС.Регистратор.ВидОперации.Наименование;
			ИначеЕсли ТипЗнч(СтрокаПриходыДС.Регистратор) = Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда
				МакетСтрока.Параметры.ОписаниеОперации = СтрокаПриходыДС.Регистратор.ВидОперации.Наименование;
			ИначеЕсли ТипЗнч(СтрокаПриходыДС.Регистратор) = Тип("ДокументСсылка.Оплата") Тогда
				
				Если СтрокаПриходыДС.Регистратор.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюКупона Тогда
					МакетСтрока.Параметры.ОписаниеОперации = "Поступление ДС. Погашение купона " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.Облигация;
				ИначеЕсли СтрокаПриходыДС.Регистратор.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона Тогда
					МакетСтрока.Параметры.ОписаниеОперации = "Поступление ДС. Погашение купона " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.ЦеннаяБумага;	
				ИначеЕсли СтрокаПриходыДС.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВозвратуКупонногоДохода И СтрокаПриходыДС.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
					Если ТипЗнч(СтрокаПриходыДС.Регистратор.Основания[0].Основание) = Тип("ДокументСсылка.ПогашениеКупона") Тогда
						МакетСтрока.Параметры.ОписаниеОперации = "Возврат суммы погашения купона " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.Облигация + ", купленных в рамкам РЕПО";
					Иначе	
						МакетСтрока.Параметры.ОписаниеОперации = "Возврат суммы погашения купона " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.ЦенныеБумаги[0].ЦеннаяБумага + ", купленных в рамкам РЕПО";	
					КонецЕсли;
				ИначеЕсли СтрокаПриходыДС.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВозвратуКупонногоДохода И СтрокаПриходыДС.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
					МакетСтрока.Параметры.ОписаниеОперации = "Получение суммы погашения купона " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.ЦенныеБумаги[0].ЦеннаяБумага + ", проданных в рамкам РЕПО";		
				ИначеЕсли СтрокаПриходыДС.Регистратор.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюОблигации Тогда
					МакетСтрока.Параметры.ОписаниеОперации = "Поступление ДС. Погашение облигации " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.ЦеннаяБумага;
				ИначеЕсли СтрокаПриходыДС.Регистратор.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюПая Тогда
					МакетСтрока.Параметры.ОписаниеОперации = "Поступление ДС. Погашение пая " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.ЦеннаяБумага;	
				ИначеЕсли СтрокаПриходыДС.Регистратор.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовАкции
				ИЛИ СтрокаПриходыДС.Регистратор.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки
				ИЛИ СтрокаПриходыДС.Регистратор.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовПаи Тогда
					МакетСтрока.Параметры.ОписаниеОперации = "Поступление ДС. Начисление дивидендов " + СтрокаПриходыДС.Регистратор.Основания[0].Основание.ЦеннаяБумага;
				КонецЕсли;
				
			КонецЕсли;
			
			ТабДок.Вывести(МакетСтрока);
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ВывестиОперацииСДепозитами(ТабДок, МакетПодраздел)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.Организация КАК Организация,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент КАК ДепозитныйВклад,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СуммаПриход КАК СуммаРазмещения,
		|	ДепозитныеВклады.БанковскийСчет.Банк КАК Банк,
		|	ДепозитныеВклады.БанковскийСчет.НомерСчета КАК НомерСчета,
		|	ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо КАК ЮрФизЛицоБанка,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	ДепозитныеВклады.БанковскийСчет.Валюта.Код КАК КодВалюты,
		|	ДепозитныеВклады.БанковскийСчет.Валюта КАК Валюта,
		|	ДепозитныеВклады.БанковскийСчет.Договор.НомерДоговора КАК НомерДоговораРазмещения,
		|	ДепозитныеВклады.ДатаРегистрации КАК ДатаРегистрации,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.Период КАК Период
		|ПОМЕСТИТЬ _ДействующиеДепозитныеВклады
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Запись,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент = ДепозитныеВклады.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗакрытиеКредитногоИнструмента.Дата КАК Дата,
		|	ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации КАК ДепозитныйВкладДатаРегистрации,
		|	ВЫБОР
		|		КОГДА ЗакрытиеКредитногоИнструмента.РежимЗакрытия = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияКредитногоИнструмента.Досрочное)
		|			ТОГДА ЗакрытиеКредитногоИнструмента.Дата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ КАК ДатаПогашения,
		|	ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Договор.НомерДоговора КАК ДепозитныйВкладБанковскийСчетДоговорНомерДоговора,
		|	ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады) КАК ДепозитныйВклад,
		|	ЗакрытиеКредитногоИнструмента.Сумма КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _ЗакрытияДепозитныхВкладов
		|ИЗ
		|	Документ.ЗакрытиеКредитногоИнструмента КАК ЗакрытиеКредитногоИнструмента
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ЗакрытиеКредитногоИнструмента.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	ЗакрытиеКредитногоИнструмента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеКредитногоИнструмента.Проведен
		|	И ЗакрытиеКредитногоИнструмента.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЗакрытиеКредитногоИнструмента.КредитныйИнструмент ССЫЛКА Справочник.ДепозитныеВклады
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментов.КредитныйИнструмент КАК ДепозитныйВклад,
		|	УсловияКредитныхИнструментов.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	УсловияКредитныхИнструментов.Процент КАК Процент,
		|	УсловияКредитныхИнструментов.Реинвестировать КАК Реинвестировать,
		|	УсловияКредитныхИнструментов.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ _НачальныеУсловияДепозитногоВклада
		|ИЗ
		|	(ВЫБРАТЬ
		|		УсловияКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|		МИНИМУМ(УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК Период
		|	ИЗ
		|		РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&КонецПериода,
		|				КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						_ДействующиеДепозитныеВклады.ДепозитныйВклад
		|					ИЗ
		|						_ДействующиеДепозитныеВклады
		|				
		|					ОБЪЕДИНИТЬ
		|				
		|					ВЫБРАТЬ
		|						_ЗакрытияДепозитныхВкладов.ДепозитныйВклад
		|					ИЗ
		|						_ЗакрытияДепозитныхВкладов КАК _ЗакрытияДепозитныхВкладов)) КАК УсловияКредитныхИнструментов
		|	ГДЕ
		|		УсловияКредитныхИнструментов.Действует
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УсловияКредитныхИнструментов.КредитныйИнструмент) КАК _НачальныеПериодыУсловийДепозитногоВклада
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|		ПО _НачальныеПериодыУсловийДепозитногоВклада.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И _НачальныеПериодыУсловийДепозитногоВклада.Период = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДействующиеДепозитныеВклады.Период КАК Период,
		|	""Размещение"" КАК НаименованиеОперации,
		|	РеквизитыКонтрагентов.ПолноеНаименованиеПоУставу КАК НаименованиеБанка,
		|	_НачальныеУсловияДепозитногоВклада.Процент КАК Процент,
		|	_ДействующиеДепозитныеВклады.Валюта КАК Валюта,
		|	_ДействующиеДепозитныеВклады.СуммаРазмещения КАК СуммаОперации,
		|	_НачальныеУсловияДепозитногоВклада.ДатаПогашения КАК ДатаПогашения,
		|	_ДействующиеДепозитныеВклады.НомерДоговораРазмещения КАК НомерДоговора
		|ПОМЕСТИТЬ _ОбщаяТаблица
		|ИЗ
		|	_ДействующиеДепозитныеВклады КАК _ДействующиеДепозитныеВклады
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НачальныеУсловияДепозитногоВклада КАК _НачальныеУсловияДепозитногоВклада
		|		ПО _ДействующиеДепозитныеВклады.ДепозитныйВклад = _НачальныеУсловияДепозитногоВклада.ДепозитныйВклад
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКонтрагентов
		|		ПО _ДействующиеДепозитныеВклады.ЮрФизЛицоБанка = РеквизитыКонтрагентов.ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗакрытияДепозитныхВкладов.Дата,
		|	""Закрытие"",
		|	_ЗакрытияДепозитныхВкладов.ПолноеНаименованиеПоУставу,
		|	_НачальныеУсловияДепозитногоВклада.Процент,
		|	ЕСТЬNULL(_ДействующиеДепозитныеВклады.Валюта, _ЗакрытияДепозитныхВкладов.ДепозитныйВклад.БанковскийСчет.Валюта),
		|	_ЗакрытияДепозитныхВкладов.Сумма,
		|	_ЗакрытияДепозитныхВкладов.ДатаПогашения,
		|	_ЗакрытияДепозитныхВкладов.ДепозитныйВкладБанковскийСчетДоговорНомерДоговора
		|ИЗ
		|	_ЗакрытияДепозитныхВкладов КАК _ЗакрытияДепозитныхВкладов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НачальныеУсловияДепозитногоВклада КАК _НачальныеУсловияДепозитногоВклада
		|		ПО _ЗакрытияДепозитныхВкладов.ДепозитныйВклад = _НачальныеУсловияДепозитногоВклада.ДепозитныйВклад
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДействующиеДепозитныеВклады КАК _ДействующиеДепозитныеВклады
		|		ПО _ЗакрытияДепозитныхВкладов.ДепозитныйВклад = _ДействующиеДепозитныеВклады.ДепозитныйВклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбщаяТаблица.Период КАК Период,
		|	_ОбщаяТаблица.НаименованиеОперации КАК НаименованиеОперации,
		|	_ОбщаяТаблица.НаименованиеБанка КАК НаименованиеБанка,
		|	_ОбщаяТаблица.Процент КАК Процент,
		|	_ОбщаяТаблица.Валюта КАК Валюта,
		|	_ОбщаяТаблица.СуммаОперации КАК СуммаОперации,
		|	_ОбщаяТаблица.ДатаПогашения КАК ДатаПогашения,
		|	_ОбщаяТаблица.НомерДоговора КАК НомерДоговора
		|ИЗ
		|	_ОбщаяТаблица КАК _ОбщаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	НаименованиеБанка";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода", 					ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 					КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);

	ОперацииСДепозитами = Запрос.Выполнить().Выгрузить();

	Если ОперацииСДепозитами.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок.Вывести(МакетПодраздел);
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка = Макет.ПолучитьОбласть("ШапкаОперацииСДепозитами");
	МакетСтрока = Макет.ПолучитьОбласть("СтрокаОперацииСДепозитами");
	
	Если ОперацииСДепозитами.Количество() > 0 Тогда
		ТабДок.Вывести(МакетШапка);
		Для каждого СтрокаДепозиты Из ОперацииСДепозитами Цикл
			
			МакетСтрока.Параметры.Заполнить(СтрокаДепозиты);
			МакетСтрока.Параметры.ДатаОперации 	= Формат(СтрокаДепозиты.Период, "ДФ=dd.MM.yyyy");
			МакетСтрока.Параметры.СуммаОперации = СтрокаДепозиты.СуммаОперации;			
					
			ТабДок.Вывести(МакетСтрока);
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ВывестиОперацииСДепозитами

Процедура ВывестиПогашения(ТабДок, МакетПодраздел, ВыводДепозитов = Ложь)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПогашениеЦеннойБумаги.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага.ДатаСоставления
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага.ДатаРегистрации
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага.ДатаРегистрации
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаВыпуска,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага.ДатаПогашения
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага.ДатаПогашения
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА """"
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ""вексель""
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ""облигация""
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ""пай""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидЦБ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага.Тип
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ПогашениеЦеннойБумаги.ЦеннаяБумага.ТипВекселя
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(ПогашениеЦеннойБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(ПогашениеЦеннойБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(ПогашениеЦеннойБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ВЫРАЗИТЬ(ПогашениеЦеннойБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК РегНомер,
		|	ПогашениеЦеннойБумаги.ЦеннаяБумага КАК Актив,
		|	ПогашениеЦеннойБумаги.Количество КАК Количество,
		|	ПогашениеЦеннойБумаги.Сумма КАК Сумма,
		|	ПогашениеЦеннойБумаги.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	ПогашениеЦеннойБумаги.ДатаПоступленияДС КАК ДатаПоступленияДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПогашениеЦеннойБумаги.Дата КАК Дата,
		|		ПогашениеЦеннойБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ПогашениеЦеннойБумаги.Количество КАК Количество,
		|		ПогашениеЦеннойБумаги.Сумма КАК Сумма,
		|		РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|		МИНИМУМ(ОплатаОснования.Ссылка.Дата) КАК ДатаПоступленияДС
		|	ИЗ
		|		Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&КонецПериода,
		|					Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО ПогашениеЦеннойБумаги.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ПО ПогашениеЦеннойБумаги.Ссылка = ОплатаОснования.Основание
		|	ГДЕ
		|		ПогашениеЦеннойБумаги.Проведен
		|		И ПогашениеЦеннойБумаги.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|		И ПогашениеЦеннойБумаги.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПогашениеЦеннойБумаги.ЦеннаяБумага,
		|		ПогашениеЦеннойБумаги.Дата,
		|		ПогашениеЦеннойБумаги.Количество,
		|		ПогашениеЦеннойБумаги.Сумма,
		|		РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу) КАК ПогашениеЦеннойБумаги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗакрытиеКредитногоИнструмента.Дата,
		|	ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА ЗакрытиеКредитногоИнструмента.РежимЗакрытия = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияКредитногоИнструмента.Досрочное)
		|			ТОГДА ЗакрытиеКредитногоИнструмента.Дата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ,
		|	""депозитный вклад"",
		|	NULL,
		|	ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Договор.НомерДоговора,
		|	ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады),
		|	1,
		|	ЗакрытиеКредитногоИнструмента.Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
		|	ЗакрытиеКредитногоИнструмента.Дата
		|ИЗ
		|	Документ.ЗакрытиеКредитногоИнструмента КАК ЗакрытиеКредитногоИнструмента
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ЗакрытиеКредитногоИнструмента.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	ЗакрытиеКредитногоИнструмента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеКредитногоИнструмента.Проведен
		|	И ЗакрытиеКредитногоИнструмента.КредитныйИнструмент ССЫЛКА Справочник.ДепозитныеВклады
		|	И ЗакрытиеКредитногоИнструмента.СчетДоверительногоУправления = &СчетДоверительногоУправления";

	#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода",                ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",                 ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);

	Погашения = Запрос.Выполнить().Выгрузить();
	ОбщееКоличествоСтрок = Погашения.Количество();
	Если ОбщееКоличествоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайдСтроки = Погашения.НайтиСтроки(Новый Структура("ВидЦБ", "депозитный вклад"));
	КоличествоСтрокДепозитов = НайдСтроки.Количество();
	Если ВыводДепозитов И КоличествоСтрокДепозитов = 0 Тогда
		Возврат;
	ИначеЕсли (Не ВыводДепозитов) И (ОбщееКоличествоСтрок - КоличествоСтрокДепозитов) = 0 Тогда
		Возврат;
	КонецЕсли;  	
			
	ТабДок.Вывести(МакетПодраздел);

	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка 	= Макет.ПолучитьОбласть("ШапкаПогашения");
	МакетСтрока = Макет.ПолучитьОбласть("СтрокаПогашения");
		
	ТабДок.Вывести(МакетШапка);
	Если Погашения.Количество() > 0 Тогда
		
		Для каждого СтрокаПогашения Из Погашения Цикл
			
			Если ВыводДепозитов И ТипЗнч(СтрокаПогашения.Актив) <> Тип("СправочникСсылка.ДепозитныеВклады") Тогда 
				Продолжить;
			КонецЕсли;
			
			Если (Не ВыводДепозитов) И ТипЗнч(СтрокаПогашения.Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда 
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(МакетСтрока.Параметры, СтрокаПогашения);
			
			Если ТипЗнч(СтрокаПогашения.Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
				
				ДанныеДепозита = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(СтрокаПогашения.Актив, СтрокаПогашения.Дата - 1);
				
				МакетСтрока.Параметры.ВидЦБ 	= "депозит, " + ДанныеДепозита.НомерДоговора + "," + Формат(ДанныеДепозита.ДатаОткрытия, "ДФ=dd.MM.yyyy") + "/" + Формат(ДанныеДепозита.ДатаПогашения, "ДФ=dd.MM.yyyy; ДП=Неопределено");
				МакетСтрока.Параметры.Номинал 	= ДанныеДепозита.Номинал;				
				МакетСтрока.Параметры.Цена 		= СтрокаПогашения.Сумма / СтрокаПогашения.Количество;
				
			ИначеЕсли ТипЗнч(СтрокаПогашения.Актив) = Тип("СправочникСсылка.Облигации") Тогда
				
				ДанныеОблигации = РаботаСЦеннымиБумагами.ПолучитьНоминалИВалютуЦеннойБумаги(СтрокаПогашения.Актив, СтрокаПогашения.Дата - 1); 
				
				МакетСтрока.Параметры.ВидЦБ 	= "облигация, " + СтрокаПогашения.Актив.ГосударственныйРегистрационныйНомер + ", погаш. " + Формат(СтрокаПогашения.Актив.ДатаПогашения, "ДФ=dd.MM.yyyy");
				МакетСтрока.Параметры.Номинал 	= ДанныеОблигации.Номинал; 				
				МакетСтрока.Параметры.Цена 		= СтрокаПогашения.Сумма / СтрокаПогашения.Количество;
				
			КонецЕсли;
			
			ТабДок.Вывести(МакетСтрока);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ВывестиКонвертации(ТабДок, МакетПодраздел)

	// Здесь пока ничего нет
	//ТабДок.Вывести(МакетПодраздел);
	//Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	//
	//МакетШапка = Макет.ПолучитьОбласть("ШапкаКонвертации");
	//ТабДок.Вывести(МакетШапка);

КонецПроцедуры

Процедура ВывестиРасходыУправляющего(ТабДок, МакетРаздел)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|			ТОГДА ""комиссия биржи""
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|			ТОГДА ""комиссия брокера""
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии)
		|				ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия))
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ &ЭтоПИФ
		|						ТОГДА ""услуги депозитария""
		|					КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария))
		|						ТОГДА ""услуги спецдепозитария""
		|					ИНАЧЕ ""услуги депозитария""
		|				КОНЕЦ
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|				ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего)
		|			ТОГДА ВЫБОР
		|					КОГДА &ЭтоПИФ
		|						ТОГДА ""вознаграждение УК""
		|					ИНАЧЕ ""вознаграждение ДУ""
		|				КОНЕЦ
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.БанковскаяКомиссия))
		|			ТОГДА ""комиссия банка""		
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецрегистратора)
		|			ТОГДА ""вознаграждение спецрегистратора""
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюОценщика)
		|			ТОГДА ""вознаграждение оценщика""
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности
		|	КОНЕЦ КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия))
		|			ТОГДА ЗадолженностиПоДенежнымСредствам.Регистратор.СтрокаБанковскойВыписки
		|		ИНАЧЕ ""Убрать""
		|	КОНЕЦ КАК Основание
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЗадолженностиПоДенежнымСредствам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия))
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимУслугам)
		|			ИЛИ  &ЭтоПИФ И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюОценщика)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаБанкКлиентИРКО)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаОткрытиеИВедениеСчета)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаЗаПереводДС)
		|			ИЛИ ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецрегистратора))
		|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидЗадолженности,
		|	Основание
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	ВидЗадолженности";

	#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода", 					ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 					ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЭтоПИФ", 						ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);

	Расходы = Запрос.Выполнить().Выгрузить();

	Если Расходы.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ТабДок.Вывести(МакетРаздел);
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка = Макет.ПолучитьОбласть("ШапкаРасходы");
	МакетСтрока = Макет.ПолучитьОбласть("СтрокаРасходы");
	
	Если Расходы.Количество() > 0 Тогда
		
		Для каждого СтрокаРасходы Из Расходы Цикл
			
			Если СтрокаРасходы.Основание = "Убрать" Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаРасходы.ВидЗадолженности) Тогда
				МакетШапка.Параметры.ИтогРасходы = СтрокаРасходы.Сумма;
				ТабДок.Вывести(МакетШапка);
			Иначе
				Если НЕ ЗначениеЗаполнено(СтрокаРасходы.Основание) Тогда
					МакетСтрока.Параметры.ВидРасходов = СтрокаРасходы.ВидЗадолженности;
				Иначе
					МакетСтрока.Параметры.ВидРасходов = Формат(СтрокаРасходы.Основание.Дата, "ДФ=dd.MM.yyyy");
					МакетСтрока.Параметры.ОснованиеРасходов = СтрокаРасходы.Основание.НазначениеПлатежа;
				КонецЕсли;
				
				МакетСтрока.Параметры.СуммаРасходов = СтрокаРасходы.Сумма;
				
				ТабДок.Вывести(МакетСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 

КонецПроцедуры

Процедура ВывестиСделкиСВалютой(ТабДок, МакетПодраздел)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаСВалютой.Дата,
		|	СделкаСВалютой.ВидСделки,
		|	СделкаСВалютой.Валюта,
		|	СделкаСВалютой.Курс,
		|	ВЫБОР
		|		КОГДА СделкаСВалютой.ОтложенноеИсполнение
		|			ТОГДА СделкаСВалютой.ДатаИсполнения
		|		ИНАЧЕ СделкаСВалютой.Дата
		|	КОНЕЦ КАК ДатаИсполнения,
		|	СделкаСВалютой.Сумма,
		|	СделкаСВалютой.Контрвалюта,
		|	СделкаСВалютой.СуммаКонтрвалюты
		|ИЗ
		|	Документ.СделкаСВалютой КАК СделкаСВалютой
		|ГДЕ
		|	СделкаСВалютой.Проведен
		|	И СделкаСВалютой.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|	И СделкаСВалютой.СчетДоверительногоУправления = &СчетДоверительногоУправления";

	Запрос.УстановитьПараметр("НачалоПериода", 					ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 					ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);

	ОперацииСВалютой = Запрос.Выполнить().Выгрузить();

	Если ОперацииСВалютой.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ТабДок.Вывести(МакетПодраздел);
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка = Макет.ПолучитьОбласть("ШапкаОперацииСВалютой");
	МакетСтрока = Макет.ПолучитьОбласть("СтрокаОперацииСВалютой");
	
	ТабДок.Вывести(МакетШапка);
	
	Если ОперацииСВалютой.Количество() > 0 Тогда
		Для каждого СтрокаОперацииСВалютой Из ОперацииСВалютой Цикл
			ЗаполнитьЗначенияСвойств(МакетСтрока.Параметры, СтрокаОперацииСВалютой);
			ТабДок.Вывести(МакетСтрока);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьОстаткиДепозитов(Период, ПериодДата)

	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчета,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДепозитныйВклад,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _ДепозитныеВкладыОстатки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДепозитныеВкладыОстатки.ДепозитныйВклад
		|ПОМЕСТИТЬ _ДепозитныеВклады
		|ИЗ
		|	_ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДепозитныеВклады.ДепозитныйВклад,
		|	ЕСТЬNULL(_ДепозитныеВкладыТело.СуммаОстаток, 0) КАК Номинал,
		|	ЕСТЬNULL(_ДепозитныеВкладыПроценты.СуммаОстаток, 0) + ЕСТЬNULL(_ДепозитныеВкладыКорректировка.СуммаОстаток, 0) КАК Проценты,
		|	ЕСТЬNULL(_ДепозитныеВкладыКорректировка.СуммаОстаток, 0) КАК Корректировка,
		|	ЕСТЬNULL(_ДепозитныеВкладыТело.СуммаОстаток, 0) КАК СуммаРынок,
		|	ЕСТЬNULL(_ДепозитныеВкладыПроценты.СуммаОстаток, 0) КАК КупонРынок
		|ИЗ
		|	_ДепозитныеВклады КАК _ДепозитныеВклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыТело
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _ДепозитныеВкладыТело.ДепозитныйВклад
		|			И (_ДепозитныеВкладыТело.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыКорректировка
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _ДепозитныеВкладыКорректировка.ДепозитныйВклад
		|			И (_ДепозитныеВкладыКорректировка.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты09), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты11)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитныеВкладыОстатки КАК _ДепозитныеВкладыПроценты
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _ДепозитныеВкладыПроценты.ДепозитныйВклад
		|			И (_ДепозитныеВкладыПроценты.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03))
		|ГДЕ
		|	_ДепозитныеВклады.ДепозитныйВклад ССЫЛКА Справочник.ДепозитныеВклады";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Период", 					  Период);
	Запрос.УстановитьПараметр("ПериодДата", 				  НачалоДня(ПериодДата));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", 				  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Биржа", 						  ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьЗадолженностьБУ(Период, ПериодДата)
	
	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ДоговорСделка,
		|	""Предварительные затраты по сделкам"" КАК ВидЗадолженности,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаКт
		|ПОМЕСТИТЬ _ОперацииСПриобретеннымиЦеннымиБумагами
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами)),
		|			&СубконтоКонтрагентыОснованиеРасчетов,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|	КОНЕЦ КАК ВидЗадолженности,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|ПОМЕСТИТЬ _ОбъединенныйЗапросЕПС
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела))) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.МНО), ТИП(Документ.СделкаСМО))
		|			ТОГДА ""Проценты по МНО""
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО).РасчетныйСчет
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.СделкаСМО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаСМО).РасчетныйСчет
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|	КОНЕЦ,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт),
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты))
		|				И НЕ Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты25)),
		|			&СубконтоКонтрагентыОснованиеРасчетов,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.МНО), ТИП(Документ.СделкаСМО))
		|			ТОГДА ""Проценты по МНО""
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО).РасчетныйСчет
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.СделкаСМО)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаСМО).РасчетныйСчет
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК ДоговорСделка,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК ДСОжидаемые,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК ДСБлокированные,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеСпецдепозитария))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецдепозитария)
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Справочник.Договоры)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДепозитарногоОбслуживания))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецдепозитария)
		|	КОНЕЦ КАК ВидЗадолженности
		|ПОМЕСТИТЬ _ЗадолженностьБУ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами11), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами12)),
		|			&СубконтоКонтрагентыДоговоры,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	NULL,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами22), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами23), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами24)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	""По начислению дивидендов""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РезервыОценочныеОбязательстваНекредитногоХарактера)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего),
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего),
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеСредства.Контрагент,
		|	ПрочиеСредства.Основание,
		|	ПрочиеСредства.СуммаОстатокДт,
		|	ПрочиеСредства.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент КАК Контрагент,
		|		ЕдиныйБухгалтерскийУчетОстатки.Основание КАК Основание,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Основание,
		|			ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ КАК Контрагент,
		|			СУММА(ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
		|						ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|				КОНЕЦ) КАК СуммаОстатокДт,
		|			СУММА(ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
		|						ТОГДА 0
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|				КОНЕЦ) КАК СуммаОстатокКт
		|		ИЗ
		|			РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|					&Период,
		|					Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства)),
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ТИПЗНАЧЕНИЯ(Субконто2) <> ТИП(Документ.СделкаРЕПО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|			ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕдиныйБухгалтерскийУчетОстатки.Основание,
		|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент) КАК ПрочиеСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент КАК Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|				&СубконтоКонтрагентыОснованиеРасчетов,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.СделкаРЕПО)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто2) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	0,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	0,
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке),
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|				&СубконтоКонтрагентыОснованиеРасчетов,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.Сделка), ТИП(Документ.СделкаСВалютой))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт),
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22),
		|			&СубконтоКонтрагентыОснованиеРасчетов,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	НЕ ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) В (ТИП(Документ.Сделка), ТИП(Документ.СделкаРЕПО), ТИП(Документ.СделкаСвалютой))
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЦеннаяБумага,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт),
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ЕдиныйБухгалтерскийУчетОстатки.ВидЗадолженности
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ОбъединенныйЗапросЕПС.Контрагент КАК Контрагент,
		|		_ОбъединенныйЗапросЕПС.ВидЗадолженности КАК ВидЗадолженности,
		|		_ОбъединенныйЗапросЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СУММА(_ОбъединенныйЗапросЕПС.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(_ОбъединенныйЗапросЕПС.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		_ОбъединенныйЗапросЕПС КАК _ОбъединенныйЗапросЕПС
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ОбъединенныйЗапросЕПС.Контрагент,
		|		_ОбъединенныйЗапросЕПС.ВидЗадолженности,
		|		_ОбъединенныйЗапросЕПС.ЦеннаяБумага) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВидЗадолженности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	""Резервы под обесценение"",
		|	СУММА(-1 * ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	СУММА(0),
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты25), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами24)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОперацииСПриобретеннымиЦеннымиБумагами.ДоговорСделка,
		|	_ОперацииСПриобретеннымиЦеннымиБумагами.ВидЗадолженности,
		|	_ОперацииСПриобретеннымиЦеннымиБумагами.СуммаДт,
		|	0,
		|	NULL
		|ИЗ
		|	_ОперацииСПриобретеннымиЦеннымиБумагами КАК _ОперацииСПриобретеннымиЦеннымиБумагами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""АкцииНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""АкцииМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ПаиНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ПаиМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОстаткиОблигацийНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОстаткиОблигацийМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОблигацииНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОблигацииМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ГруппыОблигацииНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ГруппыОблигацииМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ЗадолженностьБУ.ДСОжидаемые КАК ДСОжидаемые,
		|	_ЗадолженностьБУ.ДСБлокированные КАК ДСБлокированные,
		|	_ЗадолженностьБУ.Контрагент КАК Контрагент,
		|	_ЗадолженностьБУ.ДоговорСделка КАК ДоговорСделка,
		|	_ЗадолженностьБУ.ВидЗадолженности КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА _ЗадолженностьБУ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|			ТОГДА ""По сделке Т+ № "" + ВЫРАЗИТЬ(_ЗадолженностьБУ.ДоговорСделка КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Документ.ВводЦенныхБумаг)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Документ.НачислениеЗадолженности)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Документ.Сделка)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Документ.СделкаРЕПО)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Документ.СделкаСВалютой)
		|			ТОГДА _ЗадолженностьБУ.ВидЗадолженности
		|		КОГДА _ЗадолженностьБУ.ВидЗадолженности = ""По начислению дивидендов""
		|			ТОГДА ""Дивиденды "" + _ЗадолженностьБУ.ДоговорСделка.Эмитент.Наименование + "", "" + ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Справочник.Акции)
		|						ТОГДА _ЗадолженностьБУ.ДоговорСделка.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Справочник.Паи)
		|						ТОГДА _ЗадолженностьБУ.ДоговорСделка.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА _ЗадолженностьБУ.ДоговорСделка.РегистрационныйНомер
		|				КОНЕЦ
		|		КОГДА _ЗадолженностьБУ.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|			ТОГДА ""Купон "" + _ЗадолженностьБУ.ДоговорСделка.Эмитент.Наименование + "", "" + _ЗадолженностьБУ.ДоговорСделка.ГосударственныйРегистрационныйНомер
		|		КОГДА _ЗадолженностьБУ.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
		|			ТОГДА ""Облигация "" + _ЗадолженностьБУ.ДоговорСделка.Эмитент.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(Справочник.ВидыЗадолженности)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ЗадолженностьБУ.ДоговорСделка) = ТИП(СТРОКА)
		|			ТОГДА _ЗадолженностьБУ.ДоговорСделка
		|		ИНАЧЕ _ЗадолженностьБУ.ВидЗадолженности
		|	КОНЕЦ КАК ДСОписание
		|ИЗ
		|	_ЗадолженностьБУ КАК _ЗадолженностьБУ
		|ГДЕ
		|	(_ЗадолженностьБУ.ДСОжидаемые <> 0
		|			ИЛИ _ЗадолженностьБУ.ДСБлокированные <> 0)";
		
	#КонецОбласти
		
	Запрос.УстановитьПараметр("Период", 						Период);
	Запрос.УстановитьПараметр("Организация", 	 			  	Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	
	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	
	СубконтоКонтрагентыОснованиеРасчетов = Новый Массив;
	СубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	СубконтоКонтрагентыОснованиеРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговоры",	 		СубконтоКонтрагентыДоговоры);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыОснованиеРасчетов", 	СубконтоКонтрагентыОснованиеРасчетов);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Функция ПолучитьОстаткиЦБКупленныхПоРЕПО_БУ(Период, ПериодДата)
	
	Запрос = Новый Запрос;
	
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочиеСредства.Контрагент КАК Контрагент,
		|	ПрочиеСредства.Основание КАК Основание,
		|	ПрочиеСредства.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ПрочиеСредства.СуммаОстатокКт КАК СуммаОстатокКт
		|ПОМЕСТИТЬ _Задолженность
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент КАК Контрагент,
		|		ЕдиныйБухгалтерскийУчетОстатки.Основание КАК Основание,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|		СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Основание,
		|			ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ КАК Контрагент,
		|			СУММА(ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
		|						ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|				КОНЕЦ) КАК СуммаОстатокДт,
		|			СУММА(ВЫБОР
		|					КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства21)
		|						ТОГДА 0
		|					ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|				КОНЕЦ) КАК СуммаОстатокКт
		|		ИЗ
		|			РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|					&Период,
		|					Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства)),
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.СделкаРЕПО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|			ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).Контрагент
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕдиныйБухгалтерскийУчетОстатки.Основание,
		|		ЕдиныйБухгалтерскийУчетОстатки.Контрагент) КАК ПрочиеСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.Ссылка КАК Сделка,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ДатаРегистрации КАК ДатаРегистрации,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ТИПЗНАЧЕНИЯ(НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ""Облигация""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	УсловияСделокРЕПОСрезПоследних.Количество КАК Количество,
		|	УсловияСделокРЕПОСрезПоследних.Цена КАК Цена,
		|	УсловияСделокРЕПОСрезПоследних.СуммаКупона КАК СуммаКупона
		|ПОМЕСТИТЬ _ЦенныеБумагиСделкиРЕПО
		|ИЗ
		|	(ВЫБРАТЬ
		|		СделкаРЕПОЦБ.Ссылка КАК Ссылка,
		|		СделкаРЕПОЦБ.ЦеннаяБумага КАК ЦеннаяБумага
		|	ИЗ
		|		Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦБ
		|	ГДЕ
		|		СделкаРЕПОЦБ.Ссылка В
		|				(ВЫБРАТЬ
		|					_Задолженность.Основание
		|				ИЗ
		|					_Задолженность
		|				ГДЕ
		|					ТИПЗНАЧЕНИЯ(_Задолженность.Основание) = ТИП(Документ.СделкаРЕПО))
		|		И СделкаРЕПОЦБ.НомерСтроки = 1) КАК СделкаРЕПОЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО СделкаРЕПОЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО СделкаРЕПОЦенныеБумаги.Ссылка = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И СделкаРЕПОЦенныеБумаги.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумагиСделкиРЕПО.ЦеннаяБумага КАК СубъектАналитики,
		|	_Задолженность.СуммаОстатокДт КАК СуммаБаланс,
		|	_ЦенныеБумагиСделкиРЕПО.Номинал КАК Номинал,
		|	_ЦенныеБумагиСделкиРЕПО.ДатаПогашения КАК ДатаПогашения,
		|	_ЦенныеБумагиСделкиРЕПО.ДатаРегистрации КАК ДатаРегистрации,
		|	_ЦенныеБумагиСделкиРЕПО.Эмитент КАК Эмитент,
		|	_ЦенныеБумагиСделкиРЕПО.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	_ЦенныеБумагиСделкиРЕПО.ТипЦБ КАК ТипЦБ,
		|	_ЦенныеБумагиСделкиРЕПО.Количество КАК Количество,
		|	_ЦенныеБумагиСделкиРЕПО.Цена КАК Цена,
		|	_ЦенныеБумагиСделкиРЕПО.СуммаКупона КАК Купон,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеЭмитента
		|ИЗ
		|	_Задолженность КАК _Задолженность
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумагиСделкиРЕПО КАК _ЦенныеБумагиСделкиРЕПО
		|		ПО _Задолженность.Основание = _ЦенныеБумагиСделкиРЕПО.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (_ЦенныеБумагиСделкиРЕПО.Эмитент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипЦБ";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Период", 					  	Период);
	Запрос.УстановитьПараметр("Организация", 	 			  	Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
				
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Процедура ВывестиОстаткиАктивов(ТабДок, НаНачало = Ложь)
	
	Перем НоваяМетодикаРасчетаОценочнойСтоимости;
	
	Если Не (ЭтотОбъект.ВыводитьБалансовуюСтоимость Или ЭтотОбъект.ВыводитьРыночнуюСтоимость) Тогда
		Возврат;
	КонецЕсли;
	
	Если НаНачало Тогда
		Период = Новый Граница(НачалоДня(ЭтотОбъект.НачалоПериода), ВидГраницы.Включая);
		ПериодДата = ЭтотОбъект.НачалоПериода;
	Иначе
		Период = Новый Граница(КонецДня(ЭтотОбъект.КонецПериода), ВидГраницы.Включая);
		ПериодДата = ЭтотОбъект.КонецПериода;
	КонецЕсли;
	
	// Определяем методику расчета рыночной стоимости
	НоваяМетодикаРасчетаОценочнойСтоимости = Ложь;	
	Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
		ЦельРасчета		= Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении; 
		НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПериодДата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЦельРасчета);
		ВидУчета		= НастройкиОценки.ВидУчетаДляОстатковПартий;
		
		НоваяМетодикаРасчетаОценочнойСтоимости = Истина;
		Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
			ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами
		Тогда
			Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхНакоплений
			ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхРезервов Тогда
				НоваяМетодикаРасчетаОценочнойСтоимости = Ложь;
			КонецЕсли;	
		КонецЕсли;
	
		// Проверка на наличие рассчитанного СЧА
		Если НоваяМетодикаРасчетаОценочнойСтоимости Тогда
			Если Не РаботаСОтчетами.ПроверитьРегистрациюСЧА(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ПериодДата) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На " + Формат(ПериодДата, "ДФ=dd.MM.yyyy") + " не выполнена регистрация стоимости активов. Данные об остатках выведены не будут.");		
				Возврат;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Получаем макет и области
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетПустаяСтрока 			= Макет.ПолучитьОбласть("ПустаяСтрока");
	МакетШапка 					= Макет.ПолучитьОбласть("Шапка");
	МакетРаздел 				= Макет.ПолучитьОбласть("Раздел");
	МакетПодраздел 				= Макет.ПолучитьОбласть("Подраздел");
	МакетДС 					= Макет.ПолучитьОбласть("ДС");
	МакетДСШапка 				= Макет.ПолучитьОбласть("ДСШапка");
	МакетДССтрока 				= Макет.ПолучитьОбласть("ДССтрока");
	МакетДСДолгШапка 			= Макет.ПолучитьОбласть("ДСДолгШапка");
	МакетДСДолгСтрока 			= Макет.ПолучитьОбласть("ДСДолгСтрока");
	МакетДСДолгИтог 			= Макет.ПолучитьОбласть("ДСДолгИтог");
	МакетАкцииИПаи 				= Макет.ПолучитьОбласть("ГруппаАктивовАкцииИПаи|Главная");
	МакетАкцииИПаиБаланс 		= Макет.ПолучитьОбласть("ГруппаАктивовАкцииИПаи|Баланс");
	МакетАкцииИПаиРынок 		= Макет.ПолучитьОбласть("ГруппаАктивовАкцииИПаи|Рынок");
	МакетШапкаАкцииИПаи 		= Макет.ПолучитьОбласть("ШапкаАкцииИПаи|Главная");
	МакетШапкаАкцииИПаиБаланс 	= Макет.ПолучитьОбласть("ШапкаАкцииИПаи|Баланс");
	МакетШапкаАкцииИПаиРынок 	= Макет.ПолучитьОбласть("ШапкаАкцииИПаи|Рынок");
	МакетСтрокаАкцииИПаи 		= Макет.ПолучитьОбласть("СтрокаАкцииИПаи|Главная");
	МакетСтрокаАкцииИПаиБаланс 	= Макет.ПолучитьОбласть("СтрокаАкцииИПаи|Баланс");
	МакетСтрокаАкцииИПаиРынок 	= Макет.ПолучитьОбласть("СтрокаАкцииИПаи|Рынок");
	МакетДоли 					= Макет.ПолучитьОбласть("ГруппаАктивовДоли|Главная");
	МакетДолиБаланс 			= Макет.ПолучитьОбласть("ГруппаАктивовДоли|Баланс");
	МакетДолиРынок 				= Макет.ПолучитьОбласть("ГруппаАктивовДоли|Рынок");
	МакетШапкаДоли 				= Макет.ПолучитьОбласть("ШапкаДоли|Главная");
	МакетШапкаДолиБаланс 		= Макет.ПолучитьОбласть("ШапкаДоли|Баланс");
	МакетШапкаДолиРынок 		= Макет.ПолучитьОбласть("ШапкаДоли|Рынок");
	МакетСтрокаДоли 			= Макет.ПолучитьОбласть("СтрокаДоли|Главная");
	МакетСтрокаДолиБаланс 		= Макет.ПолучитьОбласть("СтрокаДоли|Баланс");
	МакетСтрокаДолиРынок 		= Макет.ПолучитьОбласть("СтрокаДоли|Рынок");
	МакетОблигации 				= Макет.ПолучитьОбласть("ГруппаАктивовОблигации|Главная");
	МакетОблигацииБаланс 		= Макет.ПолучитьОбласть("ГруппаАктивовОблигации|Баланс");
	МакетОблигацииРынок 		= Макет.ПолучитьОбласть("ГруппаАктивовОблигации|Рынок");
	МакетШапкаОблигации 		= Макет.ПолучитьОбласть("ШапкаОблигации|Главная");
	МакетШапкаОблигацииБаланс 	= Макет.ПолучитьОбласть("ШапкаОблигации|Баланс");
	МакетШапкаОблигацииРынок 	= Макет.ПолучитьОбласть("ШапкаОблигации|Рынок");
	МакетСтрокаОблигации 		= Макет.ПолучитьОбласть("СтрокаОблигации|Главная");
	МакетСтрокаОблигацииБаланс 	= Макет.ПолучитьОбласть("СтрокаОблигации|Баланс");
	МакетСтрокаОблигацииРынок 	= Макет.ПолучитьОбласть("СтрокаОблигации|Рынок");
	МакетГруппаОблигации 		= Макет.ПолучитьОбласть("ГруппаОблигаций|Главная");
	МакетГруппаОблигацииБаланс 	= Макет.ПолучитьОбласть("ГруппаОблигаций|Баланс");
	МакетГруппаОблигацииРынок 	= Макет.ПолучитьОбласть("ГруппаОблигаций|Рынок");
	МакетДепозиты 				= Макет.ПолучитьОбласть("ГруппаАктивовДепозиты");
	МакетШапкаДепозиты 			= Макет.ПолучитьОбласть("ШапкаДепозиты");
	МакетСтрокаДепозиты 		= Макет.ПолучитьОбласть("СтрокаДепозиты");
	МакетПодвалБумаги 			= Макет.ПолучитьОбласть("ПодвалБумаги|Главная");
	МакетПодвалБумагиБаланс 	= Макет.ПолучитьОбласть("ПодвалБумаги|Баланс");
	МакетПодвалБумагиРынок 		= Макет.ПолучитьОбласть("ПодвалБумаги|Рынок");	
	МакетГруппаРЕПО				= Макет.ПолучитьОбласть("ГруппаАктивовРЕПО|" + ?(НоваяМетодикаРасчетаОценочнойСтоимости, "ДепозитыНачало", "Главная"));
	МакетГруппаРЕПОРынок		= Макет.ПолучитьОбласть("ГруппаАктивовРЕПО|" + ?(НоваяМетодикаРасчетаОценочнойСтоимости, "РынокРЕПО", "Рынок"));
	МакетГруппаРЕПОБаланс		= Макет.ПолучитьОбласть("ГруппаАктивовРЕПО|Баланс");
	МакетШапкаРЕПО				= Макет.ПолучитьОбласть("ШапкаАктивовРЕПО|" + ?(НоваяМетодикаРасчетаОценочнойСтоимости, "ДепозитыНачало", "Главная"));
	МакетШапкаРЕПОРынок			= Макет.ПолучитьОбласть("ШапкаАктивовРЕПО|" + ?(НоваяМетодикаРасчетаОценочнойСтоимости, "РынокРЕПО", "Рынок"));
	МакетШапкаРЕПОБаланс		= Макет.ПолучитьОбласть("ШапкаАктивовРЕПО|Баланс");
	МакетСтрокаРЕПО				= Макет.ПолучитьОбласть("СтрокаАктивовРЕПО|" + ?(НоваяМетодикаРасчетаОценочнойСтоимости, "ДепозитыНачало", "Главная"));
	МакетСтрокаРЕПОРынок		= Макет.ПолучитьОбласть("СтрокаАктивовРЕПО|" + ?(НоваяМетодикаРасчетаОценочнойСтоимости, "РынокРЕПО", "Рынок"));
	МакетСтрокаРЕПОБаланс		= Макет.ПолучитьОбласть("СтрокаАктивовРЕПО|Баланс");	
		
	// По новой методике рычночную стоимость активов берем из СЧА
	Если ЭтотОбъект.ВыводитьРыночнуюСтоимость И НоваяМетодикаРасчетаОценочнойСтоимости Тогда
		
		РСА = ОпределитьРыночнуюСтоимостьАктивов(ПериодДата, ЦельРасчета, ВидУчета);
		
		ДСРС				= РСА[2].Выгрузить();
		ДСБрокер			= РСА[3].Выгрузить();
		ЗадолженностиДС		= РСА[4].Выгрузить();
		Акции				= РСА[5].Выгрузить();
		Паи					= РСА[6].Выгрузить();
		Доли				= РСА[7].Выгрузить();
		Облигации			= РСА[9].Выгрузить();
		ГруппыОблигации		= РСА[10].Выгрузить();
		Депозиты			= РСА[11].Выгрузить();
		АкцииНам			= РСА[12].Выгрузить();
		АкцииМы				= РСА[13].Выгрузить();
		ПаиНам 				= РСА[14].Выгрузить();
		ПаиМы				= РСА[15].Выгрузить();
		ОблигацииНам		= РСА[18].Выгрузить();
		ОблигацииМы			= РСА[19].Выгрузить();
		ГруппыОблигацииНам	= РСА[20].Выгрузить();
		ГруппыОблигацииМы	= РСА[21].Выгрузить();
		ЦБКупленныеПоРЕПО	= РСА[24].Выгрузить();
		Резервы				= РСА[25].Выгрузить();
		
	Иначе
		
		// Старая методика определения стоимости активов
		
		ДСРС 				= ПолучитьОстаткиДС(Период);
		ДСБрокер 			= ПолучитьОстаткиДС(Период, Истина);
		ЗадолженностиДС 	= ПолучитьЗадолженностиДС(Период);
		Акции 				= ПолучитьОстаткиАкции(Период, ПериодДата);
		Паи 				= ПолучитьОстаткиПаи(Период, ПериодДата);
		Доли 				= ПолучитьОстаткиДоли(Период, ПериодДата);
		ОстаткиОблигаций 	= ПолучитьОстаткиОблигации(Период, ПериодДата);
		Облигации 			= ОстаткиОблигаций.Облигации;
		ГруппыОблигации 	= ОстаткиОблигаций.ГруппыОблигаций;
		Депозиты			= ПолучитьОстаткиДепозитов(Период, ПериодДата);
		
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			
			АкцииНам 			= ПолучитьАкцииВПути(Период, Перечисления.ТипыЗадолженности.Дебиторская);
			АкцииМы 			= ПолучитьАкцииВПути(Период, Перечисления.ТипыЗадолженности.Кредиторская);
			ПаиНам 				= ПолучитьПаиВПути(Период, Перечисления.ТипыЗадолженности.Дебиторская);
			ПаиМы 				= ПолучитьПаиВПути(Период, Перечисления.ТипыЗадолженности.Кредиторская);
			ОстаткиОблигацийНам = ПолучитьОблигацииВПути(Период, Перечисления.ТипыЗадолженности.Дебиторская);
			ОстаткиОблигацийМы 	= ПолучитьОблигацииВПути(Период, Перечисления.ТипыЗадолженности.Кредиторская);
			ОблигацииНам 		= ОстаткиОблигацийНам.Облигации;
			ОблигацииМы 		= ОстаткиОблигацийМы.Облигации;
			ГруппыОблигацииНам 	= ОстаткиОблигацийНам.ГруппыОблигаций;
			ГруппыОблигацииМы  	= ОстаткиОблигацийМы.ГруппыОблигаций;
			ЦБКупленныеПоРЕПО  	= ПолучитьОстаткиЦБКупленныхПоРЕПО(Период, ПериодДата);
			
		Иначе
			
			ПакетЗапросаБУ = ПолучитьЗадолженностьБУ(Период, ПериодДата); 
			
			ЗадолженностиДС		= ПакетЗапросаБУ[13].Выгрузить();
			АкцииНам			= ПакетЗапросаБУ[3].Выгрузить();
			АкцииМы				= ПакетЗапросаБУ[4].Выгрузить();
			ПаиНам 				= ПакетЗапросаБУ[5].Выгрузить();
			ПаиМы				= ПакетЗапросаБУ[6].Выгрузить();
			ОстаткиОблигацийНам	= ПакетЗапросаБУ[7].Выгрузить();
			ОстаткиОблигацийМы	= ПакетЗапросаБУ[8].Выгрузить();
			ОблигацииНам		= ПакетЗапросаБУ[9].Выгрузить();
			ОблигацииМы			= ПакетЗапросаБУ[10].Выгрузить();
			ГруппыОблигацииНам	= ПакетЗапросаБУ[11].Выгрузить();
			ГруппыОблигацииМы	= ПакетЗапросаБУ[12].Выгрузить();  			
			ЦБКупленныеПоРЕПО  	= ПолучитьОстаткиЦБКупленныхПоРЕПО_БУ(Период, ПериодДата);
			
		КонецЕсли; 
			
		Резервы				= Неопределено;//Пока необходимости для НПФ не было 
		
	КонецЕсли;
	
	Если ЦБКупленныеПоРЕПО = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	ИтогДСРС 			= ДСРС.Итог("СуммаРубли");
	ИтогДСБрокер 		= ДСБрокер.Итог("СуммаРубли");
	ИтогДС 				= ИтогДСРС + ИтогДСБрокер; 
	ИтогДСОжидаемые 	= ЗадолженностиДС.Итог("ДСОжидаемые");
	ИтогДСБлокированные = ЗадолженностиДС.Итог("ДСБлокированные"); 	
	
	МакетШапкаОстатков = Макет.ПолучитьОбласть("ШапкаОстатков");
	
	МакетШапкаОстатков.Параметры.НачалоКонецПериода = ?(НаНачало, "начало", "конец");
	ИтогоСуммаАктивов = ИтогДС + ИтогДСОжидаемые - ИтогДСБлокированные;
	
	ТабДок.Вывести(МакетПустаяСтрока);

	Если ВыводитьБалансовуюСтоимость Тогда
		ИтогоСуммаАктивов = ИтогоСуммаАктивов + Депозиты.Итог("Номинал") + Депозиты.Итог("Проценты") 
					+ Акции.Итог("Сумма") 
					+ Паи.Итог("Сумма") 
					+ Доли.Итог("Сумма") 
					+ Облигации.Итог("Сумма") 
					+ АкцииНам.Итог("Сумма")
					+ ПаиНам.Итог("Сумма")
					+ ОблигацииНам.Итог("Сумма")
					+ ЦБКупленныеПоРЕПО.Итог("СуммаБаланс")
					- АкцииМы.Итог("Сумма")
					- ПаиМы.Итог("Сумма")
					- ОблигацииМы.Итог("Сумма");	
	Иначе
		ИтогоСуммаАктивов = ИтогоСуммаАктивов + Депозиты.Итог("СуммаРынок") + Депозиты.Итог("КупонРынок")
					+ Акции.Итог("СуммаРынок") 
					+ Паи.Итог("СуммаРынок") 
					+ Доли.Итог("СуммаРынок") 
					+ Облигации.Итог("СуммаРынок") + Облигации.Итог("КупонРынок")
					+ АкцииНам.Итог("Сумма")
					+ ПаиНам.Итог("Сумма")
					+ ОблигацииНам.Итог("Сумма")
					+ ЦБКупленныеПоРЕПО.Итог("СуммаРынок") + ЦБКупленныеПоРЕПО.Итог("Купон")
					- АкцииМы.Итог("Сумма")
					- ПаиМы.Итог("Сумма")
					- ОблигацииМы.Итог("Сумма");
		Если Резервы <> Неопределено Тогда
			ИтогоСуммаАктивов = ИтогоСуммаАктивов - Резервы.Итог("СуммаРезерва");			
		КонецЕсли;				
	КонецЕсли;	
	
	МакетШапкаОстатков.Параметры.ИтогоСтоимостьАктивов 	= Формат(ИтогоСуммаАктивов, "ЧДЦ=2; ЧРГ=' '; ЧН=0");
	МакетШапкаОстатков.Параметры.ВидСтоимости 			= ?(ВыводитьБалансовуюСтоимость, "балансовая", "рыночная");
	
	МакетШапкаОстатков.Параметры.СноскаПроРезервыВОценочнойСтоимости = ?(ВыводитьБалансовуюСтоимость, "", "Оценочная стоимость финансовых вложений отображается с учетом резерва на возможные потери(обесценение) в случае его наличия");
	
	ТабДок.Вывести(МакетШапкаОстатков);
		
	МакетПодраздел.Параметры.Подраздел = "Денежные средства: ";
	ТабДок.Вывести(МакетПодраздел);
		
	МакетДС.Параметры.ДенежныеСредстваСтрока = Формат(ИтогДС, "ЧЦ=19; ЧДЦ=2; ЧРГ=' '") + "(" + ЧислоПрописью(ИтогДС, , ЭтотОбъект.Организация.ВалютаУчета.ПараметрыПрописиНаРусском) + ")";
	ТабДок.Вывести(МакетДС);
	
	Если ДСРС.Количество() > 0 Тогда
		МакетДСШапка.Параметры.ДСМестоУчета = "В т.ч. на расчетных счетах: " + Формат(ИтогДСРС, "ЧЦ=19; ЧДЦ=2; ЧРГ=' '") + "(" + ЧислоПрописью(ИтогДСРС, , ЭтотОбъект.Организация.ВалютаУчета.ПараметрыПрописиНаРусском) + ")";
		ТабДок.Вывести(МакетДСШапка);
				
		Для каждого СтрокаДС Из ДСРС Цикл
			ЗаполнитьЗначенияСвойств(МакетДССтрока.Параметры, СтрокаДС);
			ТабДок.Вывести(МакетДССтрока);
		КонецЦикла;
	КонецЕсли;	
	
	Если ДСБрокер.Количество() > 0 Тогда
		МакетДСШапка.Параметры.ДСМестоУчета = "          на брокерских счетах: " + Формат(ИтогДСБрокер, "ЧЦ=19; ЧДЦ=2; ЧРГ=' '") + "(" + ЧислоПрописью(ИтогДСБрокер, , ЭтотОбъект.Организация.ВалютаУчета.ПараметрыПрописиНаРусском) + ")";
		ТабДок.Вывести(МакетДСШапка);
	          	
		Для каждого СтрокаДС Из ДСБрокер Цикл
			ЗаполнитьЗначенияСвойств(МакетДССтрока.Параметры, СтрокаДС);
			ТабДок.Вывести(МакетДССтрока);
		КонецЦикла;
	КонецЕсли;	
		
	Если ЗадолженностиДС.Количество() > 0 Тогда
		МакетПодраздел.Параметры.Подраздел = "Задолженности: ";
		ТабДок.Вывести(МакетПодраздел);
			
		ТабДок.Вывести(МакетДСДолгШапка);
		
		Для каждого СтрокаДС Из ЗадолженностиДС Цикл
			ЗаполнитьЗначенияСвойств(МакетДСДолгСтрока.Параметры, СтрокаДС);
			ТабДок.Вывести(МакетДСДолгСтрока);
		КонецЦикла;
			
		МакетДСДолгИтог.Параметры.ДСОжидаемыеИтог 		= ИтогДСОжидаемые; 
		МакетДСДолгИтог.Параметры.ДСБлокированныеИтог 	= ИтогДСБлокированные; 
		ТабДок.Вывести(МакетДСДолгИтог);
	КонецЕсли;	
	
	Если Резервы <> Неопределено Тогда
		ИтогРезервы = Резервы.Итог("СуммаРезерва");
		МакетПодраздел.Параметры.Подраздел = "Резервы: " + Формат(ИтогРезервы, "ЧЦ=19; ЧДЦ=2; ЧРГ=' '") + "(" + ЧислоПрописью(ИтогРезервы, , ЭтотОбъект.Организация.ВалютаУчета.ПараметрыПрописиНаРусском) + ")";
		ТабДок.Вывести(МакетПодраздел);
	КонецЕсли;
	
	МакетПодраздел.Параметры.Подраздел = "Финансовые вложения:";
	ТабДок.Вывести(МакетПодраздел);
	
	Если Депозиты.Количество() > 0 Тогда
				
		МакетШапкаДепозитыНачало 		= Макет.ПолучитьОбласть("ШапкаДепозитыОстатки|ДепозитыНачало");
		МакетШапкаДепозитыСтоимость 	= ?(ВыводитьБалансовуюСтоимость, Макет.ПолучитьОбласть("ШапкаДепозитыОстатки|ДепозитыБалансоваяСтоимость"), Макет.ПолучитьОбласть("ШапкаДепозитыОстатки|ДепозитыОценочнаяСтоимость"));
		МакетШапкаДепозитыПроценты 		= Макет.ПолучитьОбласть("ШапкаДепозитыОстатки|ДепозитыПроценты");
		МакетСтрокаДепозитыНачало 		= Макет.ПолучитьОбласть("СтрокаДепозитыОстатки|ДепозитыНачало");
		МакетСтрокаДепозитыСтоимость 	= ?(ВыводитьБалансовуюСтоимость, Макет.ПолучитьОбласть("СтрокаДепозитыОстатки|ДепозитыБалансоваяСтоимость"), Макет.ПолучитьОбласть("СтрокаДепозитыОстатки|ДепозитыОценочнаяСтоимость"));
		МакетСтрокаДепозитыПроценты 	= Макет.ПолучитьОбласть("СтрокаДепозитыОстатки|ДепозитыПроценты"); 	                             
	
		ТабДок.Вывести(МакетПустаяСтрока);
		
		ТабДок.Вывести(МакетШапкаДепозитыНачало);
		
		МакетШапкаДепозитыСтоимость.Параметры.Стоимость = ?(ВыводитьБалансовуюСтоимость, Депозиты.Итог("Номинал"), Депозиты.Итог("СуммаРынок"));
		ТабДок.Присоединить(МакетШапкаДепозитыСтоимость);
		
		МакетШапкаДепозитыПроценты.Параметры.Проценты   = ?(ВыводитьБалансовуюСтоимость, Депозиты.Итог("Проценты"), Депозиты.Итог("КупонРынок"));
		ТабДок.Присоединить(МакетШапкаДепозитыПроценты);
				
		Для каждого СтрокаДепозиты Из Депозиты Цикл
			
			ДанныеДепозита = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(СтрокаДепозиты.ДепозитныйВклад);
						
			МакетСтрокаДепозитыНачало.Параметры.НаименованиеБанка 		= Строка(ДанныеДепозита.НаименованиеБанка) + ", " + Формат(ДанныеДепозита.ДатаОткрытия, "ДФ=dd.MM.yyyy") + "/" + Формат(ДанныеДепозита.ДатаПогашения, "ДФ=dd.MM.yyyy; ДП=Неопределено") + "," + Строка(ДанныеДепозита.Процент) + "%";
			МакетСтрокаДепозитыНачало.Параметры.НаименованиеДоговора 	= "депозит, " + ДанныеДепозита.НомерДоговора + "," + Формат(ДанныеДепозита.ДатаОткрытия, "ДФ=dd.MM.yyyy") + "/" + Формат(ДанныеДепозита.ДатаПогашения, "ДФ=dd.MM.yyyy; ДП=Неопределено");
			
			МакетСтрокаДепозитыНачало.Параметры.Номинал = СтрокаДепозиты.Номинал; //Формат(СтрокаДепозиты.Номинал, "ЧЦ=19; ЧДЦ=2; ЧРГ=' '");
			ТабДок.Вывести(МакетСтрокаДепозитыНачало);
			
			МакетСтрокаДепозитыСтоимость.Параметры.Стоимость = ?(ВыводитьБалансовуюСтоимость, СтрокаДепозиты.Номинал, СтрокаДепозиты.СуммаРынок); //Формат(СтрокаДепозиты.Номинал, "ЧЦ=19; ЧДЦ=2; ЧРГ=' '");
			ТабДок.Присоединить(МакетСтрокаДепозитыСтоимость);
			
			МакетСтрокаДепозитыПроценты.Параметры.Проценты = ?(ВыводитьБалансовуюСтоимость, СтрокаДепозиты.Проценты, СтрокаДепозиты.КупонРынок); //Формат(СтрокаДепозиты.Проценты, "ЧЦ=19; ЧДЦ=2; ЧРГ=' '");
			ТабДок.Присоединить(МакетСтрокаДепозитыПроценты);   			
			
		КонецЦикла;
		
		ТабДок.Вывести(МакетПустаяСтрока);

	КонецЕсли;
	
	Если Акции.Количество() > 0 Тогда
		
		МакетАкцииИПаи.Параметры.ГруппаАктивов = "АКЦИИ";
		ТабДок.Вывести(МакетАкцииИПаи);
		Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
			МакетАкцииИПаиБаланс.Параметры.ИтогБаланс = Акции.Итог("Сумма");
			ТабДок.Присоединить(МакетАкцииИПаиБаланс);
		КонецЕсли;
		
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			МакетАкцииИПаиРынок.Параметры.ИтогРынок = Акции.Итог("СуммаРынок");
			ТабДок.Присоединить(МакетАкцииИПаиРынок);
		КонецЕсли;
		
		ТабДок.Вывести(МакетШапкаАкцииИПаи);
		Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
			ТабДок.Присоединить(МакетШапкаАкцииИПаиБаланс);
		КонецЕсли;
		
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			ТабДок.Присоединить(МакетШапкаАкцииИПаиРынок);
		КонецЕсли;
		
		Для каждого СтрокаАкции Из Акции Цикл
			
			МакетСтрокаАкцииИПаи.Параметры.ОписаниеЦБ 	= СтрокаАкции.Эмитент;
			МакетСтрокаАкцииИПаи.Параметры.СерияНомерЦБ = "акция " + НРег(Строка(СтрокаАкции.Тип)) + ", " + СтрокаАкции.ГосударственныйРегистрационныйНомер;
			МакетСтрокаАкцииИПаи.Параметры.Количество 	= СтрокаАкции.Количество;
			МакетСтрокаАкцииИПаи.Параметры.Номинал 		= СтрокаАкции.Номинал;
			ТабДок.Вывести(МакетСтрокаАкцииИПаи);
			
			Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
				МакетСтрокаАкцииИПаиБаланс.Параметры.Цена 	= ?(СтрокаАкции.Количество > 0, СтрокаАкции.Сумма / СтрокаАкции.Количество, 0);
				МакетСтрокаАкцииИПаиБаланс.Параметры.Баланс = СтрокаАкции.Сумма;
				ТабДок.Присоединить(МакетСтрокаАкцииИПаиБаланс);
			КонецЕсли;
			Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
				МакетСтрокаАкцииИПаиРынок.Параметры.Цена 	= ?(СтрокаАкции.Количество > 0, СтрокаАкции.СуммаРынок / СтрокаАкции.Количество, 0);
				МакетСтрокаАкцииИПаиРынок.Параметры.Баланс 	= СтрокаАкции.СуммаРынок;
				ТабДок.Присоединить(МакетСтрокаАкцииИПаиРынок);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
		
	Если Паи.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		МакетАкцииИПаи.Параметры.ГруппаАктивов = "ПАИ";
		ТабДок.Вывести(МакетАкцииИПаи);
		Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
			МакетАкцииИПаиБаланс.Параметры.ИтогБаланс = Паи.Итог("Сумма");
			ТабДок.Присоединить(МакетАкцииИПаиБаланс);
		КонецЕсли;
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			МакетАкцииИПаиРынок.Параметры.ИтогРынок = Паи.Итог("СуммаРынок");
			ТабДок.Присоединить(МакетАкцииИПаиРынок);
		КонецЕсли;
		
		ТабДок.Вывести(МакетШапкаАкцииИПаи);
		Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
			ТабДок.Присоединить(МакетШапкаАкцииИПаиБаланс);
		КонецЕсли;
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			ТабДок.Присоединить(МакетШапкаАкцииИПаиРынок);
		КонецЕсли;
		
		Для каждого СтрокаПаи Из Паи Цикл
			
			МакетСтрокаАкцииИПаи.Параметры.ОписаниеЦБ 	= СтрокаПаи.Эмитент;
			МакетСтрокаАкцииИПаи.Параметры.СерияНомерЦБ = СтрокаПаи.ГосударственныйРегистрационныйНомер;
			МакетСтрокаАкцииИПаи.Параметры.Количество 	= СтрокаПаи.Количество;
			МакетСтрокаАкцииИПаи.Параметры.Номинал 		= СтрокаПаи.Номинал;
			ТабДок.Вывести(МакетСтрокаАкцииИПаи);
			
			Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
				МакетСтрокаАкцииИПаиБаланс.Параметры.Цена 	= ?(СтрокаПаи.Количество > 0, СтрокаПаи.Сумма / СтрокаПаи.Количество, 0);
				МакетСтрокаАкцииИПаиБаланс.Параметры.Баланс = СтрокаПаи.Сумма;
				ТабДок.Присоединить(МакетСтрокаАкцииИПаиБаланс);
			КонецЕсли;
			Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
				МакетСтрокаАкцииИПаиРынок.Параметры.Цена 	= ?(СтрокаПаи.Количество > 0, СтрокаПаи.СуммаРынок / СтрокаПаи.Количество, 0);
				МакетСтрокаАкцииИПаиРынок.Параметры.Баланс 	= СтрокаПаи.СуммаРынок;
				ТабДок.Присоединить(МакетСтрокаАкцииИПаиРынок);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Доли.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		ТабДок.Вывести(МакетДоли);
		Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
			МакетДолиБаланс.Параметры.ИтогБаланс = Доли.Итог("Сумма");
			ТабДок.Присоединить(МакетДолиБаланс);
		КонецЕсли;
		
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			МакетДолиРынок.Параметры.ИтогРынок = Доли.Итог("СуммаРынок");
			ТабДок.Присоединить(МакетДолиРынок);
		КонецЕсли;
		
		ТабДок.Вывести(МакетШапкаДоли);
		Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
			ТабДок.Присоединить(МакетШапкаДолиБаланс);
		КонецЕсли;
		
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			ТабДок.Присоединить(МакетШапкаДолиРынок);
		КонецЕсли;
		
		Для каждого СтрокаДоли Из Доли Цикл
			
			МакетСтрокаДоли.Параметры.ОписаниеЦБ 	= СтрокаДоли.Эмитент;
			МакетСтрокаДоли.Параметры.Количество 	= СтрокаДоли.Количество;
			МакетСтрокаДоли.Параметры.Номинал 		= СтрокаДоли.УставныйКапитал;
			ТабДок.Вывести(МакетСтрокаДоли);
			
			Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
				МакетСтрокаДолиБаланс.Параметры.Баланс = СтрокаДоли.Сумма;
				ТабДок.Присоединить(МакетСтрокаДолиБаланс);
			КонецЕсли;
			
			Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
				МакетСтрокаДолиРынок.Параметры.Баланс = СтрокаДоли.СуммаРынок;
				ТабДок.Присоединить(МакетСтрокаДолиРынок);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
			
	Если Облигации.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		ТабДок.Вывести(МакетОблигации);
		Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
			МакетОблигацииБаланс.Параметры.ИтогБаланс 	= Облигации.Итог("Сумма");  //  + Облигации.Итог("Купон")
			МакетОблигацииБаланс.Параметры.ИтогНКД 		= Облигации.Итог("Купон");
			ТабДок.Присоединить(МакетОблигацииБаланс);
		КонецЕсли;
		
		Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
			МакетОблигацииРынок.Параметры.ИтогРынок 	= Облигации.Итог("СуммаРынок") + Облигации.Итог("КупонРынок");   // + Облигации.Итог("КупонРынок")    + Облигации.Итог("КупонРынок")
			МакетОблигацииРынок.Параметры.ИтогНКДРынок 	= Облигации.Итог("КупонРынок");
			ТабДок.Присоединить(МакетОблигацииРынок);
		КонецЕсли;
		
		Для каждого СтрокаГруппаОблигации Из ГруппыОблигации Цикл
			
			Если СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "Корпоративные облигации";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "ОМЗ";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Субфедеральная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "Облиг. субъект. РФ";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "ОФЗ";
			КонецЕсли;
		    	
			ТабДок.Вывести(МакетГруппаОблигации);
			Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
				МакетГруппаОблигацииБаланс.Параметры.ИтогБаланс = СтрокаГруппаОблигации.Сумма; // + СтрокаГруппаОблигации.Купон;
				МакетГруппаОблигацииБаланс.Параметры.ИтогНКД 	= СтрокаГруппаОблигации.Купон;
				ТабДок.Присоединить(МакетГруппаОблигацииБаланс);
			КонецЕсли;
			
			Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда				
				МакетГруппаОблигацииРынок.Параметры.ИтогБаланс 	= СтрокаГруппаОблигации.СуммаРынок  + СтрокаГруппаОблигации.КупонРынок; //;
				МакетГруппаОблигацииРынок.Параметры.ИтогНКД 	= СтрокаГруппаОблигации.КупонРынок;
				ТабДок.Присоединить(МакетГруппаОблигацииРынок);
			КонецЕсли;
			
			ТабДок.Вывести(МакетШапкаОблигации);
			Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
				ТабДок.Присоединить(МакетШапкаОблигацииБаланс);
			КонецЕсли;
			
			Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
				ТабДок.Присоединить(МакетШапкаОблигацииРынок);
			КонецЕсли;
			
			Для каждого СтрокаОблигации Из Облигации Цикл
				
				Если СтрокаОблигации.Категория <> СтрокаГруппаОблигации.Категория Тогда
					Продолжить;
				КонецЕсли;
				
				МакетСтрокаОблигации.Параметры.ОписаниеЦБ 	= СтрокаОблигации.Эмитент + ", " + Формат(СтрокаОблигации.ДатаРегистрации, "ДФ=dd.MM.yyyy") + "/" + Формат(СтрокаОблигации.ДатаПогашения, "ДФ=dd.MM.yyyy");
				МакетСтрокаОблигации.Параметры.СерияНомерЦБ = "облигация, " + СтрокаОблигации.ГосударственныйРегистрационныйНомер + ", погаш. " + Формат(СтрокаОблигации.ДатаПогашения, "ДФ=dd.MM.yyyy");
				МакетСтрокаОблигации.Параметры.Количество 	= СтрокаОблигации.Количество;
				МакетСтрокаОблигации.Параметры.Номинал 		= СтрокаОблигации.Номинал;
				ТабДок.Вывести(МакетСтрокаОблигации);
				
				Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
					МакетСтрокаОблигацииБаланс.Параметры.Цена 	= ?(СтрокаОблигации.Количество > 0, СтрокаОблигации.Сумма / СтрокаОблигации.Количество, 0);
					МакетСтрокаОблигацииБаланс.Параметры.Баланс = СтрокаОблигации.Сумма; // + СтрокаОблигации.Купон;
					МакетСтрокаОблигацииБаланс.Параметры.НКД 	= СтрокаОблигации.Купон;
					ТабДок.Присоединить(МакетСтрокаОблигацииБаланс);
				КонецЕсли;
				Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
					МакетСтрокаОблигацииРынок.Параметры.Цена 	= ?(СтрокаОблигации.Количество > 0, СтрокаОблигации.СуммаРынок / СтрокаОблигации.Количество, 0);
					МакетСтрокаОблигацииРынок.Параметры.Баланс 	= СтрокаОблигации.СуммаРынок  + СтрокаОблигации.КупонРынок; // + СтрокаОблигации.КупонРынок;
					МакетСтрокаОблигацииРынок.Параметры.НКД 	= СтрокаОблигации.КупонРынок;
					ТабДок.Присоединить(МакетСтрокаОблигацииРынок);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТабДок.Вывести(МакетПодвалБумаги);
	Если ЭтотОбъект.ВыводитьБалансовуюСтоимость Тогда
		МакетПодвалБумагиБаланс.Параметры.ИтогБаланс = Акции.Итог("Сумма") + Паи.Итог("Сумма") + Доли.Итог("Сумма") + Депозиты.Итог("Номинал") + Депозиты.Итог("Проценты") + Облигации.Итог("Сумма"); // Депозиты.Итог("Проценты") + Облигации.Итог("Купон")
		ТабДок.Присоединить(МакетПодвалБумагиБаланс);
	КонецЕсли;
	
	Если ЭтотОбъект.ВыводитьРыночнуюСтоимость Тогда
		МакетПодвалБумагиРынок.Параметры.ИтогРынок = Акции.Итог("СуммаРынок") + Паи.Итог("СуммаРынок") + Доли.Итог("СуммаРынок") + Депозиты.Итог("СуммаРынок") + Депозиты.Итог("КупонРынок") + Облигации.Итог("СуммаРынок") + Облигации.Итог("КупонРынок"); // + Облигации.Итог("КупонРынок");
		ТабДок.Присоединить(МакетПодвалБумагиРынок);
	КонецЕсли;
	
	Если АкцииНам.Количество() > 0 ИЛИ ПаиНам.Количество() > 0 ИЛИ ОблигацииНам.Количество() > 0 Тогда
		
		МакетПодраздел.Параметры.Подраздел = "Задолженности по ценным бумагам:";
		ТабДок.Вывести(МакетПодраздел);
		
		МакетПодраздел.Параметры.Подраздел = "          Ценные бумаги, ожидаемые к поступлению";
		ТабДок.Вывести(МакетПодраздел);
		
	КонецЕсли;	
	
	Если АкцииНам.Количество() > 0 Тогда
		
		МакетАкцииИПаи.Параметры.ГруппаАктивов = "АКЦИИ";
		ТабДок.Вывести(МакетАкцииИПаи);
		МакетАкцииИПаиБаланс.Параметры.ИтогБаланс = АкцииНам.Итог("Сумма");
		ТабДок.Присоединить(МакетАкцииИПаиБаланс);
		
		ТабДок.Вывести(МакетШапкаАкцииИПаи);
		ТабДок.Присоединить(МакетШапкаАкцииИПаиБаланс);
		
		Для каждого СтрокаАкции Из АкцииНам Цикл
			МакетСтрокаАкцииИПаи.Параметры.ОписаниеЦБ 	= СтрокаАкции.Эмитент;
			МакетСтрокаАкцииИПаи.Параметры.СерияНомерЦБ = "акция " + НРег(Строка(СтрокаАкции.Тип)) + ", " + СтрокаАкции.ГосударственныйРегистрационныйНомер;
			МакетСтрокаАкцииИПаи.Параметры.Количество 	= СтрокаАкции.Количество;
			МакетСтрокаАкцииИПаи.Параметры.Номинал 		= СтрокаАкции.Номинал;
			ТабДок.Вывести(МакетСтрокаАкцииИПаи);
			

			МакетСтрокаАкцииИПаиБаланс.Параметры.Цена 	= ?(СтрокаАкции.Количество > 0, СтрокаАкции.Сумма / СтрокаАкции.Количество, 0);
			МакетСтрокаАкцииИПаиБаланс.Параметры.Баланс = СтрокаАкции.Сумма;
			ТабДок.Присоединить(МакетСтрокаАкцииИПаиБаланс);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПаиНам.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		МакетАкцииИПаи.Параметры.ГруппаАктивов = "ПАИ";
		ТабДок.Вывести(МакетАкцииИПаи);

		МакетАкцииИПаиБаланс.Параметры.ИтогБаланс = ПаиНам.Итог("Сумма");
		ТабДок.Присоединить(МакетАкцииИПаиБаланс);
		
		ТабДок.Вывести(МакетШапкаАкцииИПаи);

		ТабДок.Присоединить(МакетШапкаАкцииИПаиБаланс);
		
		Для каждого СтрокаПаи Из ПаиНам Цикл
			
			МакетСтрокаАкцииИПаи.Параметры.ОписаниеЦБ 	= СтрокаПаи.Эмитент;
			МакетСтрокаАкцииИПаи.Параметры.СерияНомерЦБ = СтрокаПаи.ГосударственныйРегистрационныйНомер;
			МакетСтрокаАкцииИПаи.Параметры.Количество 	= СтрокаПаи.Количество;
			МакетСтрокаАкцииИПаи.Параметры.Номинал 		= СтрокаПаи.Номинал;
			ТабДок.Вывести(МакетСтрокаАкцииИПаи);
			

			МакетСтрокаАкцииИПаиБаланс.Параметры.Цена 	= ?(СтрокаПаи.Количество > 0, СтрокаПаи.Сумма / СтрокаПаи.Количество, 0);
			МакетСтрокаАкцииИПаиБаланс.Параметры.Баланс = СтрокаПаи.Сумма;
			ТабДок.Присоединить(МакетСтрокаАкцииИПаиБаланс);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОблигацииНам.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		ТабДок.Вывести(МакетОблигации);

		МакетОблигацииБаланс.Параметры.ИтогБаланс 	= ОблигацииНам.Итог("Сумма");
		МакетОблигацииБаланс.Параметры.ИтогНКД 		= ОблигацииНам.Итог("Купон");
		ТабДок.Присоединить(МакетОблигацииБаланс);
		
		Для каждого СтрокаГруппаОблигации Из ГруппыОблигацииНам Цикл
			Если СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "Корпоративные облигации";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "ОМЗ";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Субфедеральная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "Облиг. субъект. РФ";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "ОФЗ";
			КонецЕсли;
		    	
			ТабДок.Вывести(МакетГруппаОблигации);

			МакетГруппаОблигацииБаланс.Параметры.ИтогБаланс = СтрокаГруппаОблигации.Сумма;
			МакетГруппаОблигацииБаланс.Параметры.ИтогНКД 	= СтрокаГруппаОблигации.Купон;
			ТабДок.Присоединить(МакетГруппаОблигацииБаланс);
			
			ТабДок.Вывести(МакетШапкаОблигации);
			ТабДок.Присоединить(МакетШапкаОблигацииБаланс);
			
			Для каждого СтрокаОблигации Из ОблигацииНам Цикл
				Если СтрокаОблигации.Категория <> СтрокаГруппаОблигации.Категория Тогда
					Продолжить;
				КонецЕсли;
				
				МакетСтрокаОблигации.Параметры.ОписаниеЦБ 	= СтрокаОблигации.Эмитент + ", " + Формат(СтрокаОблигации.ДатаРегистрации, "ДФ=dd.MM.yyyy") + "/" + Формат(СтрокаОблигации.ДатаПогашения, "ДФ=dd.MM.yyyy");
				МакетСтрокаОблигации.Параметры.СерияНомерЦБ = "облигация, " + СтрокаОблигации.ГосударственныйРегистрационныйНомер + ", погаш. " + Формат(СтрокаОблигации.ДатаПогашения, "ДФ=dd.MM.yyyy");
				МакетСтрокаОблигации.Параметры.Количество 	= СтрокаОблигации.Количество;
				МакетСтрокаОблигации.Параметры.Номинал 		= СтрокаОблигации.Номинал;
				ТабДок.Вывести(МакетСтрокаОблигации);

				МакетСтрокаОблигацииБаланс.Параметры.Цена 	= ?(СтрокаОблигации.Количество > 0, СтрокаОблигации.Сумма / СтрокаОблигации.Количество, 0);
				МакетСтрокаОблигацииБаланс.Параметры.Баланс = СтрокаОблигации.Сумма + СтрокаОблигации.Купон;
				МакетСтрокаОблигацииБаланс.Параметры.НКД 	= СтрокаОблигации.Купон;
				ТабДок.Присоединить(МакетСтрокаОблигацииБаланс);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если АкцииМы.Количество() > 0 ИЛИ ПаиМы.Количество() > 0 ИЛИ ОблигацииМы.Количество() > 0 Тогда
		МакетПодраздел.Параметры.Подраздел = "          Ценные бумаги, блокированные Для исполнения обязательств По сделкам";
		ТабДок.Вывести(МакетПодраздел);
	КонецЕсли;	
	
	Если АкцииМы.Количество() > 0 Тогда
		
		МакетАкцииИПаи.Параметры.ГруппаАктивов = "АКЦИИ";
		ТабДок.Вывести(МакетАкцииИПаи);

		МакетАкцииИПаиБаланс.Параметры.ИтогБаланс = АкцииМы.Итог("Сумма");
		ТабДок.Присоединить(МакетАкцииИПаиБаланс);
		
		ТабДок.Вывести(МакетШапкаАкцииИПаи);

		ТабДок.Присоединить(МакетШапкаАкцииИПаиБаланс);
		
		Для каждого СтрокаАкции Из АкцииМы Цикл
			
			МакетСтрокаАкцииИПаи.Параметры.ОписаниеЦБ 	= СтрокаАкции.Эмитент;
			МакетСтрокаАкцииИПаи.Параметры.СерияНомерЦБ = "акция " + НРег(Строка(СтрокаАкции.Тип)) + ", " + СтрокаАкции.ГосударственныйРегистрационныйНомер;
			МакетСтрокаАкцииИПаи.Параметры.Количество 	= СтрокаАкции.Количество;
			МакетСтрокаАкцииИПаи.Параметры.Номинал 		= СтрокаАкции.Номинал;
			ТабДок.Вывести(МакетСтрокаАкцииИПаи);

			МакетСтрокаАкцииИПаиБаланс.Параметры.Цена 	= ?(СтрокаАкции.Количество > 0, СтрокаАкции.Сумма / СтрокаАкции.Количество, 0);
			МакетСтрокаАкцииИПаиБаланс.Параметры.Баланс = СтрокаАкции.Сумма;
			ТабДок.Присоединить(МакетСтрокаАкцииИПаиБаланс);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПаиМы.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		МакетАкцииИПаи.Параметры.ГруппаАктивов = "ПАИ";
		ТабДок.Вывести(МакетАкцииИПаи);

		МакетАкцииИПаиБаланс.Параметры.ИтогБаланс = ПаиМы.Итог("Сумма");
		ТабДок.Присоединить(МакетАкцииИПаиБаланс);
		
		ТабДок.Вывести(МакетШапкаАкцииИПаи);
		ТабДок.Присоединить(МакетШапкаАкцииИПаиБаланс);
		
		Для каждого СтрокаПаи Из ПаиМы Цикл
			
			МакетСтрокаАкцииИПаи.Параметры.ОписаниеЦБ 	= СтрокаПаи.Эмитент;
			МакетСтрокаАкцииИПаи.Параметры.СерияНомерЦБ = СтрокаПаи.ГосударственныйРегистрационныйНомер;
			МакетСтрокаАкцииИПаи.Параметры.Количество 	= СтрокаПаи.Количество;
			МакетСтрокаАкцииИПаи.Параметры.Номинал 		= СтрокаПаи.Номинал;
			ТабДок.Вывести(МакетСтрокаАкцииИПаи);

			МакетСтрокаАкцииИПаиБаланс.Параметры.Цена 	= ?(СтрокаПаи.Количество > 0, СтрокаПаи.Сумма / СтрокаПаи.Количество, 0);
			МакетСтрокаАкцииИПаиБаланс.Параметры.Баланс = СтрокаПаи.Сумма;
			ТабДок.Присоединить(МакетСтрокаАкцииИПаиБаланс);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОблигацииМы.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		ТабДок.Вывести(МакетОблигации);

		МакетОблигацииБаланс.Параметры.ИтогБаланс 	= ОблигацииМы.Итог("Сумма");
		МакетОблигацииБаланс.Параметры.ИтогНКД 		= ОблигацииМы.Итог("Купон");
		ТабДок.Присоединить(МакетОблигацииБаланс);
		
		Для каждого СтрокаГруппаОблигации Из ГруппыОблигацииМы Цикл
			
			Если СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "Корпоративные облигации";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "ОМЗ";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Субфедеральная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "Облиг. субъект. РФ";
			ИначеЕсли СтрокаГруппаОблигации.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
				МакетГруппаОблигации.Параметры.ГруппаОблигаций = "ОФЗ";
			КонецЕсли;
		    	
			ТабДок.Вывести(МакетГруппаОблигации);
			МакетГруппаОблигацииБаланс.Параметры.ИтогБаланс = СтрокаГруппаОблигации.Сумма;
			МакетГруппаОблигацииБаланс.Параметры.ИтогНКД 	= СтрокаГруппаОблигации.Купон;
			ТабДок.Присоединить(МакетГруппаОблигацииБаланс);
			
			ТабДок.Вывести(МакетШапкаОблигации);

			ТабДок.Присоединить(МакетШапкаОблигацииБаланс);
			
			Для каждого СтрокаОблигации Из ОблигацииМы Цикл
				
				Если СтрокаОблигации.Категория <> СтрокаГруппаОблигации.Категория Тогда
					Продолжить;
				КонецЕсли;
				
				МакетСтрокаОблигации.Параметры.ОписаниеЦБ 	= СтрокаОблигации.Эмитент + ", " + Формат(СтрокаОблигации.ДатаРегистрации, "ДФ=dd.MM.yyyy") + "/" + Формат(СтрокаОблигации.ДатаПогашения, "ДФ=dd.MM.yyyy");
				МакетСтрокаОблигации.Параметры.СерияНомерЦБ = "облигация, " + СтрокаОблигации.ГосударственныйРегистрационныйНомер + ", погаш. " + Формат(СтрокаОблигации.ДатаПогашения, "ДФ=dd.MM.yyyy");
				МакетСтрокаОблигации.Параметры.Количество 	= СтрокаОблигации.Количество;
				МакетСтрокаОблигации.Параметры.Номинал 		= СтрокаОблигации.Номинал;
				ТабДок.Вывести(МакетСтрокаОблигации);
				

				МакетСтрокаОблигацииБаланс.Параметры.Цена 	= ?(СтрокаОблигации.Количество > 0, СтрокаОблигации.Сумма / СтрокаОблигации.Количество, 0);
				МакетСтрокаОблигацииБаланс.Параметры.Баланс = СтрокаОблигации.Сумма + СтрокаОблигации.Купон;
				МакетСтрокаОблигацииБаланс.Параметры.НКД 	= СтрокаОблигации.Купон;
				ТабДок.Присоединить(МакетСтрокаОблигацииБаланс);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЦБКупленныеПоРЕПО.Количество() > 0 Тогда
		
		ТабДок.Вывести(МакетПустаяСтрока);
		
		ТабДок.Вывести(МакетГруппаРЕПО);
					
		Если ВыводитьРыночнуюСтоимость Тогда
			
			МакетГруппаРЕПОРынок.Параметры.ИтогРынок = ЦБКупленныеПоРЕПО.Итог("СуммаРынок");
			Если Не НоваяМетодикаРасчетаОценочнойСтоимости Тогда
				МакетГруппаРЕПОРынок.Параметры.ИтогНКД = ЦБКупленныеПоРЕПО.Итог("Купон");
			КонецЕсли;
			ТабДок.Присоединить(МакетГруппаРЕПОРынок);
			
			ТабДок.Вывести(МакетШапкаРЕПО);
			ТабДок.Присоединить(МакетШапкаРЕПОРынок);
			
		Иначе
			
			МакетГруппаРЕПОБаланс.Параметры.ИтогБаланс = ЦБКупленныеПоРЕПО.Итог("СуммаБаланс");
			МакетГруппаРЕПОБаланс.Параметры.ИтогНКД    = ЦБКупленныеПоРЕПО.Итог("Купон");
			ТабДок.Присоединить(МакетГруппаРЕПОБаланс);
			
			ТабДок.Вывести(МакетШапкаРЕПО);
			ТабДок.Присоединить(МакетШапкаРЕПОБаланс);
			
		КонецЕсли;
		
		Для каждого СтрокаЦБКупленныеПоРЕПО Из ЦБКупленныеПоРЕПО Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаЦБКупленныеПоРЕПО.Количество) Тогда
				Продолжить;
			КонецЕсли;
						
			МакетСтрокаРЕПО.Параметры.ОписаниеЦБ   = СокрЛП(СтрокаЦБКупленныеПоРЕПО.НаименованиеЭмитента) + ", " + Формат(СтрокаЦБКупленныеПоРЕПО.ДатаРегистрации, "ДФ=dd.MM.yyyy") + ?(СтрокаЦБКупленныеПоРЕПО.ТипЦБ = "Облигация", "/" + Формат(СтрокаЦБКупленныеПоРЕПО.ДатаПогашения, "ДФ=dd.MM.yyyy"), "");
			МакетСтрокаРЕПО.Параметры.СерияНомерЦБ = СтрокаЦБКупленныеПоРЕПО.ТипЦБ + " " + СтрокаЦБКупленныеПоРЕПО.ГосударственныйРегистрационныйНомер + ?(СтрокаЦБКупленныеПоРЕПО.ТипЦБ = "Облигация", ", погаш. " + Формат(СтрокаЦБКупленныеПоРЕПО.ДатаПогашения, "ДФ=dd.MM.yyyy"), "");
			МакетСтрокаРЕПО.Параметры.Количество   = СтрокаЦБКупленныеПоРЕПО.Количество;
			Если Не НоваяМетодикаРасчетаОценочнойСтоимости Тогда
				МакетСтрокаРЕПО.Параметры.Номинал = СтрокаЦБКупленныеПоРЕПО.Номинал;
			КонецЕсли;
			ТабДок.Вывести(МакетСтрокаРЕПО);       			
			
			Если ВыводитьРыночнуюСтоимость Тогда
				
				МакетСтрокаРЕПОРынок.Параметры.Рынок	= СтрокаЦБКупленныеПоРЕПО.СуммаРынок;
				Если Не НоваяМетодикаРасчетаОценочнойСтоимости Тогда
					МакетСтрокаРЕПОРынок.Параметры.Цена	= ?(СтрокаЦБКупленныеПоРЕПО.Количество > 0, СтрокаЦБКупленныеПоРЕПО.Цена, 0);
					МакетСтрокаРЕПОРынок.Параметры.НКД	= СтрокаЦБКупленныеПоРЕПО.Купон;
				КонецЕсли;
				ТабДок.Присоединить(МакетСтрокаРЕПОРынок);
				
			Иначе	
				
				МакетСтрокаРЕПОБаланс.Параметры.Баланс	= СтрокаЦБКупленныеПоРЕПО.СуммаБаланс;
				Если Не НоваяМетодикаРасчетаОценочнойСтоимости Тогда
					МакетСтрокаРЕПОБаланс.Параметры.Цена	= ?(СтрокаЦБКупленныеПоРЕПО.Количество > 0, СтрокаЦБКупленныеПоРЕПО.Цена, 0);
					МакетСтрокаРЕПОБаланс.Параметры.НКД		= СтрокаЦБКупленныеПоРЕПО.Купон;
				КонецЕсли;
				ТабДок.Присоединить(МакетСтрокаРЕПОБаланс);
				
			КонецЕсли;
				
		КонецЦикла;		
		
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьОтчет(ТабДок) Экспорт
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, 
												"НачалоПериода,КонецПериода,Организация,СчетДоверительногоУправления,ВыводитьБалансовуюСтоимость,ВыводитьРыночнуюСтоимость,РежимВыводаДвиженийИОстатков"); 
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ТабДок.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	МакетШапка 		= Макет.ПолучитьОбласть("Шапка");
	МакетРаздел 	= Макет.ПолучитьОбласть("Раздел");
	МакетПодраздел 	= Макет.ПолучитьОбласть("Подраздел");
	МакетПодвал 	= Макет.ПолучитьОбласть("Подвал");
	              	
	СведенияОКлиенте = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.КонецПериода);
	
	МакетШапка.Параметры.Организация   = СведенияОКлиенте.ПолноеНаименованиеОрганизации;
	МакетШапка.Параметры.СчетДУ        = СведенияОКлиенте.ПолноеНаименование;
	МакетШапка.Параметры.КодДУ         = ЭтотОбъект.СчетДоверительногоУправления.КодСчета;
	
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
		МакетШапка.Параметры.ДоговорИлиПравила 	= "Правила №";
		ПИФ 									= Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ЭтотОбъект.КонецПериода);
		МакетШапка.Параметры.ДоговорДУ     		= ПИФ.НомерПравил + " от " + Формат(ПИФ.ДатаПравил, "ДФ=dd.MM.yyyy");
	Иначе
		МакетШапка.Параметры.ДоговорИлиПравила 	= "Договор №";
		МакетШапка.Параметры.ДоговорДУ     		= ЭтотОбъект.СчетДоверительногоУправления.НомерДоговора + " от " + Формат(ЭтотОбъект.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");	
	КонецЕсли;
	
	МакетШапка.Параметры.ПериодОтчета  = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(ЭтотОбъект.НачалоПериода, ЭтотОбъект.КонецПериода);
	МакетШапка.Параметры.ДатаОтчета    = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(МакетШапка);
	
	Если ЭтотОбъект.РежимВыводаДвиженийИОстатков = 1 Тогда // Движения и остатки
		ВывестиОстаткиАктивов(ТабДок);
	ИначеЕсли ЭтотОбъект.РежимВыводаДвиженийИОстатков = 2 Тогда
		ВывестиОстаткиАктивов(ТабДок, Истина);
		ВывестиОстаткиАктивов(ТабДок);
	КонецЕсли;
	
	МакетРаздел.Параметры.Раздел = "Операции по передаче и изъятию  имущества";
	ТабДок.Вывести(МакетРаздел);

	МакетПодраздел.Параметры.Подраздел = "Передано(изъято)денежных средств:";
		
	ВывестиВводыВыводыДС(ТабДок, МакетПодраздел);
	
	МакетПодраздел.Параметры.Подраздел = "Передано ЦБ:";
	ВывестиВводыВыводыЦБ(ТабДок, МакетПодраздел);
	
	МакетПодраздел.Параметры.Подраздел = "Изъято ЦБ:";	
	ВывестиВводыВыводыЦБ(ТабДок, МакетПодраздел, Ложь);
	
	МакетРаздел.Параметры.Раздел = "Сведения о проведенных сделках";
	ТабДок.Вывести(МакетРаздел);

	МакетПодраздел.Параметры.Подраздел = "Биржевые сделки";
	ВывестиСделки(ТабДок, МакетПодраздел);
		
	МакетПодраздел.Параметры.Подраздел = "Сделки РЕПО";
	ВывестиСделки(ТабДок, МакетПодраздел, "РЕПО");
	
	МакетПодраздел.Параметры.Подраздел = "Биржевые переговорные сделки(заключенные на основании адресных заявок)";
	ВывестиСделки(ТабДок, МакетПодраздел, "РПС");
	
	МакетПодраздел.Параметры.Подраздел = "Внебиржевые сделки";
	ВывестиСделки(ТабДок, МакетПодраздел, "Тикеты");
	
	МакетПодраздел.Параметры.Подраздел = "Операции по депозитным вкладам";
	ВывестиОперацииСДепозитами(ТабДок, МакетПодраздел);
		
	МакетПодраздел.Параметры.Подраздел = "Поступившие купоны, дивиденды, % по депозитам, % на остаток по счету";
	ВывестиДвижениеДС(ТабДок, МакетПодраздел);
		
	МакетПодраздел.Параметры.Подраздел = "Погашение ценных бумаг";
	ВывестиПогашения(ТабДок, МакетПодраздел);
	
	МакетПодраздел.Параметры.Подраздел = "Конвертация ЦБ";
	ВывестиКонвертации(ТабДок, МакетПодраздел);
	
	МакетПодраздел.Параметры.Подраздел = "Операции с валютой.";
	ВывестиСделкиСВалютой(ТабДок, МакетПодраздел);
	
	МакетРаздел.Параметры.Раздел = "Расходы Управляющего.";
	ВывестиРасходыУправляющего(ТабДок, МакетРаздел);
	
	МакетПодвал.Параметры.Подписант = ЭтотОбъект.Подписант.КонтактноеЛицо;
	МакетПодвал.Параметры.ДолжностьПодписанта = ЭтотОбъект.Подписант.Должность;
	ТабДок.Вывести(МакетПодвал); 	
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ТабДок, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецФункции

Функция СформироватьОтчетПоСпискуСчетовДУ(МассивСчетовДоверительногоУправления, Выгрузить, КаталогВыгрузки) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	Для Каждого ТекСчетДоверительногоУправления Из МассивСчетовДоверительногоУправления Цикл
		
		Если Не ЗначениеЗаполнено(ТекСчетДоверительногоУправления) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекРезультат = Новый ТабличныйДокумент;
		ЭтотОбъект.СчетДоверительногоУправления = ТекСчетДоверительногоУправления;
		
		СформироватьОтчет(ТекРезультат);
		
		Если Выгрузить Тогда  			
			ИмяФайла = КаталогВыгрузки + "\" + ПолучитьИмяФайла(ТекСчетДоверительногоУправления);	
			Попытка
				ТекРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		Результат.Вывести(ТекРезультат);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Вспомогательные_функции

Функция ОпределитьРыночнуюСтоимостьАктивов(Период, ЦельРасчета, ВидУчета)
	
	#Область Текст_запроса
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
		|	СтоимостьПереоценки.Цена КАК СправедливаяЦена,
		|	СтоимостьПереоценки.Источник КАК ИсточникЦены,
		|	СтоимостьПереоценки.УровеньОценки КАК УровеньОпределенияЦены,
		|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
		|	СУММА(СтоимостьПереоценки.Сумма) КАК Сумма,
		|	СУММА(СтоимостьПереоценки.СуммаКупона) КАК СуммаКупона,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) КАК СуммаВВалютеУчета,
		|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК СуммаКупонаВВалютеУчета
		|ПОМЕСТИТЬ _СтоимостьЦБ
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.Период = &Дата
		|	И СтоимостьПереоценки.ЦельРасчета = &ЦельРасчета
		|	И СтоимостьПереоценки.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.ДатаЦены,
		|	СтоимостьПереоценки.Цена,
		|	СтоимостьПереоценки.Источник,
		|	СтоимостьПереоценки.УровеньОценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеЦБ.Период КАК Период,
		|	СтоимостьАктивовНеЦБ.Регистратор КАК Регистратор,
		|	СтоимостьАктивовНеЦБ.НомерСтроки КАК НомерСтроки,
		|	СтоимостьАктивовНеЦБ.Активность КАК Активность,
		|	СтоимостьАктивовНеЦБ.Организация КАК Организация,
		|	СтоимостьАктивовНеЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьАктивовНеЦБ.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеЦБ.СубъектАналитики КАК СубъектАналитики,
		|	СтоимостьАктивовНеЦБ.Контрагент КАК Контрагент,
		|	СтоимостьАктивовНеЦБ.Основание КАК Основание,
		|	СтоимостьАктивовНеЦБ.ВидЗадолженности КАК ВидЗадолженности,
		|	СтоимостьАктивовНеЦБ.Валюта КАК Валюта,
		|	СтоимостьАктивовНеЦБ.СуммаРынок КАК СуммаРынок,
		|	СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета
		|ПОМЕСТИТЬ _СтоимостьАктивовНеЦБ
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеЦБ
		|ГДЕ
		|	СтоимостьАктивовНеЦБ.Организация = &Организация
		|	И СтоимостьАктивовНеЦБ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеЦБ.Период = &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДСРС"" КАК ВидАктива,
		|	_СтоимостьАктивовНеЦБ.Валюта КАК Валюта,
		|	КурсыВалют.Курс КАК Курс,
		|	СУММА(_СтоимостьАктивовНеЦБ.СуммаРынок) КАК СуммаВалюта,
		|	СУММА(_СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета) КАК СуммаРубли
		|ИЗ
		|	_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Валюта = _СтоимостьАктивовНеЦБ.Валюта)
		|			И (КурсыВалют.Период = &Дата)
		|ГДЕ
		|	_СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтоимостьАктивовНеЦБ.Валюта,
		|	КурсыВалют.Курс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДСБрокер"" КАК ВидАктива,
		|	_СтоимостьАктивовНеЦБ.Валюта КАК Валюта,
		|	КурсыВалют.Курс КАК Курс,
		|	СУММА(_СтоимостьАктивовНеЦБ.СуммаРынок) КАК СуммаВалюта,
		|	СУММА(_СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета) КАК СуммаРубли
		|ИЗ
		|	_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Валюта = _СтоимостьАктивовНеЦБ.Валюта)
		|			И (КурсыВалют.Период = &Дата)
		|ГДЕ
		|	_СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И _СтоимостьАктивовНеЦБ.СубъектАналитики ССЫЛКА Справочник.БрокерскиеКомпании
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтоимостьАктивовНеЦБ.Валюта,
		|	КурсыВалют.Курс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ЗадолженностиДС"" КАК ВидАктива,
		|	ВЫБОР
		|		КОГДА _СтоимостьАктивовНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|			ТОГДА ""По сделке Т+ № "" + ВЫРАЗИТЬ(_СтоимостьАктивовНеЦБ.Основание КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ВводЦенныхБумаг)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.НачислениеЗадолженности)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.Сделка)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.СделкаРЕПО)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.СделкаСВалютой)
		|			ТОГДА _СтоимостьАктивовНеЦБ.ВидЗадолженности
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА ""Дивиденды "" + _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.Эмитент.Наименование + "", "" + ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|						ТОГДА _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|						ТОГДА _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.РегистрационныйНомер
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ""Купон "" + _СтоимостьАктивовНеЦБ.Основание.Облигация.Эмитент.Наименование + "", "" + _СтоимостьАктивовНеЦБ.Основание.Облигация.ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ""Облигация "" + _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.Эмитент.Наименование
		|		ИНАЧЕ _СтоимостьАктивовНеЦБ.ВидЗадолженности
		|	КОНЕЦ КАК ДСОписание,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				ТОГДА _СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДСОжидаемые,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|				ТОГДА -_СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДСБлокированные
		|ИЗ
		|	_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ
		|ГДЕ
		|	_СтоимостьАктивовНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность))
		|	И НЕ(_СтоимостьАктивовНеЦБ.СубъектАналитики ССЫЛКА Справочник.БрокерскиеКомпании
		|				И _СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность))
		|	И НЕ(_СтоимостьАктивовНеЦБ.СубъектАналитики ССЫЛКА Документ.МНО
		|				И _СтоимостьАктивовНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам))
		|	И НЕ(_СтоимостьАктивовНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги))
		|				И _СтоимостьАктивовНеЦБ.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)))
		|	И НЕ(_СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|				И _СтоимостьАктивовНеЦБ.Основание = НЕОПРЕДЕЛЕНО
		|				И _СтоимостьАктивовНеЦБ.ВидЗадолженности ССЫЛКА Справочник.Резервы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА _СтоимостьАктивовНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|			ТОГДА ""По сделке Т+ № "" + ВЫРАЗИТЬ(_СтоимостьАктивовНеЦБ.Основание КАК Документ.Сделка).НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ВводЦенныхБумаг)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.НачислениеЗадолженности)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.Сделка)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.СделкаРЕПО)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.СделкаСВалютой)
		|			ТОГДА _СтоимостьАктивовНеЦБ.ВидЗадолженности
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА ""Дивиденды "" + _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.Эмитент.Наименование + "", "" + ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|						ТОГДА _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|						ТОГДА _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|					КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|						ТОГДА _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.РегистрационныйНомер
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ""Купон "" + _СтоимостьАктивовНеЦБ.Основание.Облигация.Эмитент.Наименование + "", "" + _СтоимостьАктивовНеЦБ.Основание.Облигация.ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ""Облигация "" + _СтоимостьАктивовНеЦБ.Основание.ЦеннаяБумага.Эмитент.Наименование
		|		ИНАЧЕ _СтоимостьАктивовНеЦБ.ВидЗадолженности
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	"""",
		|	""% по МНО "" + ВЫРАЗИТЬ(_СтоимостьАктивовНеЦБ.СубъектАналитики КАК Документ.МНО).РасчетныйСчет.Банк.ЮрФизЛицо.Наименование,
		|	СУММА(_СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета),
		|	0
		|ИЗ
		|	_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ
		|ГДЕ
		|	_СтоимостьАктивовНеЦБ.СубъектАналитики ССЫЛКА Документ.МНО
		|	И _СтоимостьАктивовНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам)
		|
		|СГРУППИРОВАТЬ ПО
		|	""% по МНО "" + ВЫРАЗИТЬ(_СтоимостьАктивовНеЦБ.СубъектАналитики КАК Документ.МНО).РасчетныйСчет.Банк.ЮрФизЛицо.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Акции"" КАК ВидАктива,
		|	Акции.Ссылка КАК ЦеннаяБумага,
		|	Акции.Тип КАК Тип,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	Акции.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	Акции.Номинал КАК Номинал,
		|	_СтоимостьЦБ.СправедливаяЦена КАК Цена,
		|	СУММА(_СтоимостьЦБ.Количество) КАК Количество,
		|	СУММА(_СтоимостьЦБ.СуммаВВалютеУчета) КАК СуммаРынок
		|ИЗ
		|	_СтоимостьЦБ КАК _СтоимостьЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&Дата,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						И ЮрФизЛицо В
		|							(ВЫБРАТЬ
		|								_СтоимостьЦБ.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|							ИЗ
		|								_СтоимостьЦБ КАК _СтоимостьЦБ
		|							ГДЕ
		|								_СтоимостьЦБ.ЦеннаяБумага ССЫЛКА Справочник.Акции)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО Акции.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО (Акции.Ссылка = _СтоимостьЦБ.ЦеннаяБумага)
		|
		|СГРУППИРОВАТЬ ПО
		|	Акции.Ссылка,
		|	_СтоимостьЦБ.СправедливаяЦена,
		|	Акции.Тип,
		|	Акции.ГосударственныйРегистрационныйНомер,
		|	Акции.Номинал,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Паи"" КАК ВидАктива,
		|	Паи.Ссылка КАК ЦеннаяБумага,
		|	"""" КАК Тип,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Эмитент,
		|	Паи.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	0 КАК Номинал,
		|	_СтоимостьЦБ.СправедливаяЦена КАК Цена,
		|	СУММА(_СтоимостьЦБ.Количество) КАК Количество,
		|	СУММА(_СтоимостьЦБ.СуммаВВалютеУчета) КАК СуммаРынок
		|ИЗ
		|	_СтоимостьЦБ КАК _СтоимостьЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Дата, ) КАК РеквизитыПИФСрезПоследних
		|			ПО Паи.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&Дата,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО (РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ПО (Паи.Ссылка = _СтоимостьЦБ.ЦеннаяБумага)
		|
		|СГРУППИРОВАТЬ ПО
		|	Паи.Ссылка,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу,
		|	_СтоимостьЦБ.СправедливаяЦена,
		|	Паи.ГосударственныйРегистрационныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Доли"" КАК ВидАктива,
		|	Доли.Ссылка КАК ЦеннаяБумага,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	УставнойКапиталСрезПоследних.РазмерУставногоКапитала КАК УставныйКапитал,
		|	СУММА(_СтоимостьЦБ.Количество) КАК Количество,
		|	СУММА(_СтоимостьЦБ.СуммаВВалютеУчета) КАК СуммаРынок
		|ИЗ
		|	_СтоимостьЦБ КАК _СтоимостьЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Доли КАК Доли
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&Дата,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						И ЮрФизЛицо В
		|							(ВЫБРАТЬ
		|								_СтоимостьЦБ.ЦеннаяБумага.ЮрЛицо
		|							ИЗ
		|								_СтоимостьЦБ КАК _СтоимостьЦБ
		|							ГДЕ
		|								_СтоимостьЦБ.ЦеннаяБумага ССЫЛКА Справочник.Доли)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО Доли.ЮрЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УставнойКапитал.СрезПоследних(
		|					&Дата,
		|					ЮрЛицо В
		|						(ВЫБРАТЬ
		|							_СтоимостьЦБ.ЦеннаяБумага.ЮрЛицо
		|						ИЗ
		|							_СтоимостьЦБ КАК _СтоимостьЦБ
		|						ГДЕ
		|							_СтоимостьЦБ.ЦеннаяБумага ССЫЛКА Справочник.Доли)) КАК УставнойКапиталСрезПоследних
		|			ПО Доли.ЮрЛицо = УставнойКапиталСрезПоследних.ЮрЛицо
		|		ПО (Доли.Ссылка = _СтоимостьЦБ.ЦеннаяБумага)
		|
		|СГРУППИРОВАТЬ ПО
		|	Доли.Ссылка,
		|	_СтоимостьЦБ.СправедливаяЦена,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
		|	УставнойКапиталСрезПоследних.РазмерУставногоКапитала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ОстаткиОблигаций"" КАК ВидАктива,
		|	Облигации.Ссылка КАК ЦеннаяБумага,
		|	Облигации.Категория КАК Категория,
		|	РеквизитыЭмитента.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	Облигации.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	Облигации.ДатаРегистрации КАК ДатаРегистрации,
		|	Облигации.ДатаПогашения КАК ДатаПогашения,
		|	ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, Облигации.Номинал) КАК Номинал,
		|	_СтоимостьЦБ.СправедливаяЦена КАК Цена,
		|	СУММА(_СтоимостьЦБ.Количество) КАК Количество,
		|	СУММА(_СтоимостьЦБ.СуммаВВалютеУчета) КАК СуммаРынок,
		|	СУММА(_СтоимостьЦБ.СуммаКупонаВВалютеУчета) КАК КупонРынок
		|ПОМЕСТИТЬ _ОстаткиОблигаций
		|ИЗ
		|	_СтоимостьЦБ КАК _СтоимостьЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО (Облигации.Ссылка = _СтоимостьЦБ.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Дата, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО (НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага = Облигации.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Дата,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЭмитента
		|		ПО (РеквизитыЭмитента.ЮрФизЛицо = Облигации.Эмитент.ЮрФизЛицо)
		|
		|СГРУППИРОВАТЬ ПО
		|	Облигации.Ссылка,
		|	РеквизитыЭмитента.ПолноеНаименованиеПоУставу,
		|	ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, Облигации.Номинал),
		|	_СтоимостьЦБ.СправедливаяЦена,
		|	Облигации.Категория,
		|	Облигации.ГосударственныйРегистрационныйНомер,
		|	Облигации.ДатаРегистрации,
		|	Облигации.ДатаПогашения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Облигации"" КАК ВидАктива,
		|	ОстаткиОблигаций.Эмитент КАК Эмитент,
		|	ОстаткиОблигаций.Категория КАК Категория,
		|	ОстаткиОблигаций.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	ОстаткиОблигаций.Количество КАК Количество,
		|	ОстаткиОблигаций.СуммаРынок КАК СуммаРынок,
		|	ОстаткиОблигаций.КупонРынок КАК КупонРынок,
		|	ОстаткиОблигаций.Номинал КАК Номинал,
		|	ОстаткиОблигаций.ДатаРегистрации КАК ДатаРегистрации,
		|	ОстаткиОблигаций.ДатаПогашения КАК ДатаПогашения,
		|	ОстаткиОблигаций.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	_ОстаткиОблигаций КАК ОстаткиОблигаций
		|
		|УПОРЯДОЧИТЬ ПО
		|	Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ГруппыОблигации"" КАК ВидАктива,
		|	ОстаткиОблигаций.Категория КАК Категория,
		|	СУММА(ОстаткиОблигаций.СуммаРынок) КАК СуммаРынок,
		|	СУММА(ОстаткиОблигаций.КупонРынок) КАК КупонРынок
		|ИЗ
		|	_ОстаткиОблигаций КАК ОстаткиОблигаций
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиОблигаций.Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Депозиты"" КАК ВидАктива,
		|	_СтоимостьАктивовНеЦБ.СубъектАналитики КАК ДепозитныйВклад,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивовНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу)
		|				ТОГДА _СтоимостьАктивовНеЦБ.СуммаРынок
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Номинал,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивовНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу)
		|				ТОГДА _СтоимостьАктивовНеЦБ.СуммаРынок
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРынок,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивовНеЦБ.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты)
		|				ТОГДА _СтоимостьАктивовНеЦБ.СуммаРынок
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КупонРынок
		|ИЗ
		|	_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ
		|ГДЕ
		|	_СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтоимостьАктивовНеЦБ.СубъектАналитики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""АкцииНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""АкцииМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ПаиНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ПаиМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОстаткиОблигацийНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОстаткиОблигацийМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОблигацииНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ОблигацииМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ГруппыОблигацииНам Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	""ГруппыОблигацииМы Заглушка"" КАК ВидАктива,
		|	0 КАК Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтоимостьАктивовНеЦБ.ВидАктива КАК ВидАктива,
		|	_СтоимостьАктивовНеЦБ.ВидЗадолженности КАК ВидЗадолженности,
		|	_СтоимостьАктивовНеЦБ.СубъектАналитики КАК СубъектАналитики,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.СубъектАналитики) = ТИП(Справочник.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦБ.СубъектАналитики) = ТИП(Справочник.Облигации)
		|			ТОГДА ""Облигация""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	_СтоимостьАктивовНеЦБ.Основание КАК Основание,
		|	_СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ДатаРегистрации КАК ДатаРегистрации,
		|	РеквизитыЭмитента.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер
		|ПОМЕСТИТЬ _ЦБКупленныеПоРЕПО
		|ИЗ
		|	_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Дата, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО (НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага = _СтоимостьАктивовНеЦБ.СубъектАналитики)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Дата,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЭмитента
		|		ПО (РеквизитыЭмитента.ЮрФизЛицо = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.Эмитент.ЮрФизЛицо)
		|ГДЕ
		|	_СтоимостьАктивовНеЦБ.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ЦенныеБумаги))
		|	И _СтоимостьАктивовНеЦБ.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка КАК Ссылка,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(СделкаРЕПОЦенныеБумаги.Количество) КАК Количество
		|ПОМЕСТИТЬ _КоличествоЦБКупленныхПоРЕПО
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ЦБКупленныеПоРЕПО.Основание
		|			ИЗ
		|				_ЦБКупленныеПоРЕПО КАК _ЦБКупленныеПоРЕПО)
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкаРЕПОЦенныеБумаги.Ссылка,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ЦБКупленныеПоРЕПО"" КАК ВидАктива,
		|	_ЦБКупленныеПоРЕПО.СубъектАналитики КАК СубъектАналитики,
		|	_ЦБКупленныеПоРЕПО.ДатаПогашения КАК ДатаПогашения,
		|	_ЦБКупленныеПоРЕПО.ДатаРегистрации КАК ДатаРегистрации,
		|	_ЦБКупленныеПоРЕПО.Эмитент КАК Эмитент,
		|	_ЦБКупленныеПоРЕПО.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	_ЦБКупленныеПоРЕПО.ТипЦБ КАК ТипЦБ,
		|	_КоличествоЦБКупленныхПоРЕПО.Количество КАК Количество,
		|	_ЦБКупленныеПоРЕПО.Эмитент КАК НаименованиеЭмитента,
		|	СУММА(_ЦБКупленныеПоРЕПО.СуммаРынокВВалютеУчета) КАК СуммаРынок,
		|	0 КАК Купон
		|ИЗ
		|	_ЦБКупленныеПоРЕПО КАК _ЦБКупленныеПоРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КоличествоЦБКупленныхПоРЕПО КАК _КоличествоЦБКупленныхПоРЕПО
		|		ПО _ЦБКупленныеПоРЕПО.СубъектАналитики = _КоличествоЦБКупленныхПоРЕПО.ЦеннаяБумага
		|			И _ЦБКупленныеПоРЕПО.Основание = _КоличествоЦБКупленныхПоРЕПО.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЦБКупленныеПоРЕПО.СубъектАналитики,
		|	_ЦБКупленныеПоРЕПО.ДатаПогашения,
		|	_ЦБКупленныеПоРЕПО.ДатаРегистрации,
		|	_ЦБКупленныеПоРЕПО.Эмитент,
		|	_ЦБКупленныеПоРЕПО.ГосударственныйРегистрационныйНомер,
		|	_ЦБКупленныеПоРЕПО.ТипЦБ,
		|	_КоличествоЦБКупленныхПоРЕПО.Количество,
		|	_ЦБКупленныеПоРЕПО.Эмитент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Резервы"" КАК ВидАктива,
		|	_СтоимостьАктивовНеЦБ.ВидЗадолженности КАК ДСОписание,
		|	СУММА(ВЫБОР
		|			КОГДА _СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|				ТОГДА -_СтоимостьАктивовНеЦБ.СуммаРынокВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРезерва
		|ИЗ
		|	_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ
		|ГДЕ
		|	_СтоимостьАктивовНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|	И _СтоимостьАктивовНеЦБ.ВидЗадолженности ССЫЛКА Справочник.Резервы
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтоимостьАктивовНеЦБ.ВидЗадолженности");
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Дата",							Период);
	Запрос.УстановитьПараметр("ЦельРасчета",					ЦельРасчета);	
	Запрос.УстановитьПараметр("ВидУчета",						ВидУчета);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Функция ПолучитьИмяФайла(ТекСчетДоверительногоУправления)
	
	ТекОтчет = ОбщегоНазначения.ПолучитьИменованныйОбъект("_Отчет_ПериодическийОтчетУправляющего");
	
	НастройкиОтчета = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(ЭтотОбъект.КонецПериода, ТекСчетДоверительногоУправления, ТекОтчет);
		
	Если ЗначениеЗаполнено(НастройкиОтчета.ПутьКФайлу) Тогда
		
		ДанныеОтчета = Новый Структура;
		
		ДанныеОтчета.Вставить("Субъект",		ТекСчетДоверительногоУправления);
		ДанныеОтчета.Вставить("Отчет",			ТекОтчет);
		ДанныеОтчета.Вставить("Периодичность",	Неопределено);
		ДанныеОтчета.Вставить("ДатаНачала",		ЭтотОбъект.НачалоПериода);
		ДанныеОтчета.Вставить("ДатаОкончания",	ЭтотОбъект.КонецПериода);
		
		ИмяФайла = РегистрыСведений.СоставИНастройкиОтчетов.ОбработатьПутьКФайлу(НастройкиОтчета.ПутьКФайлу, ДанныеОтчета);
		ИмяФайла = Сред(ИмяФайла, СтрНайти(ИмяФайла, "\", НаправлениеПоиска.СКонца) + 1);
		
	Иначе

		ИмяФайла = "Периодический отчет управляющего ";
			
		ИмяФайла = ИмяФайла + СокрЛП(ТекСчетДоверительногоУправления);
			
		ИмяФайла = ИмяФайла + " c " + Формат(ЭтотОбъект.НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(ЭтотОбъект.КонецПериода, "ДФ=dd.MM.yyyy") + ".xlsx";	
		
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

#КонецОбласти
