#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация 	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период  		= ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	СформироватьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)

	СформироватьНаСервере();

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СформироватьНаСервере()

	//Начало сессии
	ОтчетОбъект	= РеквизитФормыВЗначение("Отчет");
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация");
	Механизм = ОтчетОбъект.Метаданные().ПолноеИмя();
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполненияДляСбораСтатистики.Хранилище, ПараметрыВыполненияДляСбораСтатистики.Описание);

	Отчет.Результат = ОтчетОбъект.СформироватьГипертекст();

	//Закрываем сессию
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	СформироватьНаСервере();

КонецПроцедуры
