
Процедура ПроверкаДатыДокументаНаСоответствиеГрафикуНачисленияПроцентов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.Период
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона = &Период";

	Запрос.УстановитьПараметр("Период", 	НачалоДня(Дата));
	Запрос.УстановитьПараметр("Облигация", 	Облигация);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В графике погашения купонов нет записи на " + Формат(Дата, "ДФ=dd.MM.yyyy") + "'"), ЭтотОбъект, "Дата",, Отказ);			
	КонецЕсли;
	
КонецПроцедуры // ПроверкаДатыДокументаНаСоответствиеГрафикуНачисленияПроцентов

Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоЦеннымБумагам");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        Перечисления.РынкиЦенныхБумаг.Облигации);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",                 ЭтотОбъект.Облигация);
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        Перечисления.РынкиЦенныхБумаг.Облигации);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",                 ЭтотОбъект.Облигация);
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        Перечисления.РынкиЦенныхБумаг.Облигации);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",                 ЭтотОбъект.Облигация);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать         = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностиПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&ДатаФиксации,
		|			(ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|				ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер.ЮрФизЛицо
		|		ИНАЧЕ _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	0 КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоВРЕПО,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПоРЕПО
		|ПОМЕСТИТЬ _КоличествоРЕПО
		|ИЗ
		|	_ЗадолженностиПоЦеннымБумагамОстатки КАК _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностиПоЦеннымБумагамОстатки КАК _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО
		|		ПО _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание = _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.Основание
		|			И (_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|ГДЕ
		|	_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер.ЮрФизЛицо
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Основание,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КоличествоРЕПО.Основание,
		|	_КоличествоРЕПО.Контрагент,
		|	_КоличествоРЕПО.КоличествоОстаток,
		|	_КоличествоРЕПО.КоличествоВРЕПО,
		|	_КоличествоРЕПО.КоличествоПоРЕПО
		|ИЗ
		|	_КоличествоРЕПО КАК _КоличествоРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КоличествоРЕПО.Контрагент,
		|	СУММА(_КоличествоРЕПО.КоличествоПоРЕПО) КАК КоличествоПоРЕПО
		|ИЗ
		|	_КоличествоРЕПО КАК _КоличествоРЕПО
		|
		|СГРУППИРОВАТЬ ПО
		|	_КоличествоРЕПО.Контрагент
		|
		|ИМЕЮЩИЕ
		|	СУММА(_КоличествоРЕПО.КоличествоПоРЕПО) > 0";
		
	Запрос.УстановитьПараметр("Основание"					, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Рынок"						, Перечисления.РынкиЦенныхБумаг.Облигации);
	Запрос.УстановитьПараметр("ЦеннаяБумага"				, ЭтотОбъект.Облигация);
	Запрос.УстановитьПараметр("ДатаФиксации"				, ?(ЭтотОбъект.ДатаФиксации = НачалоДня(ЭтотОбъект.Дата), НачалоДня(ЭтотОбъект.ДатаФиксации), КонецДня(ЭтотОбъект.ДатаФиксации)));
	Запрос.УстановитьПараметр("НКЦпоРЕПОсЦК"				, Документы.ПогашениеКупона.НКЦпоРЕПОсЦК(ЭтотОбъект.Дата));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ОстаткиЦенныхБумаг = ПакетЗапросов[2].Выгрузить();
	РепоПоКонтрагентам = ПакетЗапросов[3].Выгрузить();
	
	//контроль остатков ценных бумаг
	Если ЭтотОбъект.Количество < ОстаткиЦенныхБумаг.Итог("КоличествоОстаток") + ОстаткиЦенныхБумаг.Итог("КоличествоВРЕПО") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество облигаций в документе меньше чем требуется: остаток (в т.ч. купленных по РЕПО) - "  + 
															Строка(ОстаткиЦенныхБумаг.Итог("КоличествоОстаток")) + " (" + Строка(ОстаткиЦенныхБумаг.Итог("КоличествоПОРЕПО")) + 
															"), проданно в РЕПО - " + Строка(ОстаткиЦенныхБумаг.Итог("КоличествоВРЕПО")),,,, Отказ);
		Возврат;
	КонецЕсли;

	// задолженность по д/с
	Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
	
	Движение.Период                       = ЭтотОбъект.Дата;
	Движение.Основание                    = ЭтотОбъект.Ссылка;
	Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
	Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоПогашениюКупона;
	Движение.Организация                  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.Контрагент                   = ЭтотОбъект.Облигация.Эмитент.ЮрФизЛицо;
	Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
	Движение.СуммаКупона                  = ЭтотОбъект.Количество * ЭтотОбъект.СуммаНаОднуОблигацию;
	
	СуммаВРЕПО = 0;
	
	Если ОстаткиЦенныхБумаг.Итог("КоличествоВРЕПО") > 0 Тогда
		
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
		
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
		Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоПогашениюКупона;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Контрагент                   = ЭтотОбъект.Облигация.Эмитент.ЮрФизЛицо;
		Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
		Движение.СуммаКупона                  = ОстаткиЦенныхБумаг.Итог("КоличествоВРЕПО") * ЭтотОбъект.СуммаНаОднуОблигацию;
		
		СуммаВРЕПО = Движение.СуммаКупона;
		
	КонецЕсли;	
	
	Для Каждого СтрокаОстатков Из ОстаткиЦенныхБумаг Цикл
		Если СтрокаОстатков.КоличествоВРЕПО > 0 Тогда
			Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Основание                    = СтрокаОстатков.Основание;
			Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоВозвратуКупонногоДохода;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Контрагент                   = СтрокаОстатков.Контрагент;
			Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
			Движение.СуммаКупона                  = СтрокаОстатков.КоличествоВРЕПО * ЭтотОбъект.СуммаНаОднуОблигацию;
			
			СуммаВРЕПО = СуммаВРЕПО - Движение.СуммаКупона;
		КонецЕсли;
	КонецЦикла;	
	
	Движение.СуммаКупона = Движение.СуммаКупона + СуммаВРЕПО;
	
	
	Для Каждого СтрокаРепоПоКонтрагентам Из РепоПоКонтрагентам Цикл
		СуммаПоРепоПоКонтрагенту = СтрокаРепоПоКонтрагентам.КоличествоПоРЕПО * ЭтотОбъект.СуммаНаОднуОблигацию;
		
		ПараметрыПоиска = Новый Структура("Контрагент", СтрокаРепоПоКонтрагентам.Контрагент);
		НайденныеСтроки = ОстаткиЦенныхБумаг.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого СтрокаОстатков Из НайденныеСтроки Цикл
			Если СтрокаОстатков.КоличествоПоРЕПО > 0 Тогда
				Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
				
				Движение.Период                       = ЭтотОбъект.Дата;
				Движение.Основание                    = СтрокаОстатков.Основание;
				Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
				Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоВозвратуКупонногоДохода;
				Движение.Организация                  = ЭтотОбъект.Организация;
				Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
				Движение.Контрагент                   = СтрокаОстатков.Контрагент;
				Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
				Движение.СуммаКупона                  = СтрокаОстатков.КоличествоПоРЕПО * ЭтотОбъект.СуммаНаОднуОблигацию;
				
				СуммаПоРепоПоКонтрагенту = СуммаПоРепоПоКонтрагенту - Движение.СуммаКупона;
				
			КонецЕсли;

		КонецЦикла;
		
		Движение.СуммаКупона = Движение.СуммаКупона + СуммаПоРепоПоКонтрагенту;
		
	КонецЦикла;
	
	// операции с ц/б
	Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
	
	Движение.Операция                     = ЭтотОбъект.Ссылка;
	Движение.ВидДвижения                  = Перечисления.ВидыДвижений.Расход;
	Движение.Организация                  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.Рынок                        = Перечисления.РынкиЦенныхБумаг.Облигации;
	Движение.ЦеннаяБумага                 = ЭтотОбъект.Облигация;
	Движение.Количество                   = ЭтотОбъект.Количество;
	Движение.СуммаКупона                  = ЭтотОбъект.Количество * ЭтотОбъект.СуммаНаОднуОблигацию;
	Движение.ДатаОперации                 = ЭтотОбъект.Дата;
	Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;

КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Функция ОпределитьСуммуКупонаВВалютеНоминала()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.СуммаКупона КАК СуммаКупона
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона = &Период";

	Запрос.УстановитьПараметр("Период", 	НачалоДня(Дата));
	Запрос.УстановитьПараметр("Облигация", 	Облигация);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.СуммаКупона;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции 

Процедура СформироватьПроводкуСписанияКупонаЕПС(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки)

	Если ПараметрыПроводки.Сумма = 0 И ПараметрыПроводки.СуммаВВалютеУчета = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
	
	// дебет
	Если ПараметрыПроводки.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
		
		Проводка.СчетДт = ПараметрыПроводки.УчетныйАктив.СчетУчетаКупона;
		
		Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.Облигация;
		
		Проводка.ВалютаДт = ПараметрыПроводки.ВалютаОплаты;
		Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаОплаты;
		
		Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
		
	Иначе
		
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
		
		Проводка.СубконтоДт.Контрагенты = ПараметрыПроводки.Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыПроводки.Ссылка;
		
		Проводка.ВалютаДт  = ПараметрыПроводки.ВалютаОплаты;
		Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаОплаты;
					
		Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	КонецЕсли;
	
	// кредит
	Проводка.СчетКт = ПараметрыПроводки.УчетныйАктив.СчетУчетаКупона;
	
	Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.Облигация;
	
	Проводка.ВалютаКт = ПараметрыПроводки.ВалютаНоминала;
	Проводка.ВалютнаяСуммаКт = ПараметрыПроводки.Сумма;
	
	Проводка.ДополнительнаяАналитикаКт = ПараметрыПроводки.Аналитика;

	Проводка.Партия = ПараметрыПроводки.Партия;
	Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, КоличествоПоРЕПО, Отказ)

	АналитикаТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаДебиторкиПоКупону = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Погашение.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Погашение.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	Погашение.Партия КАК Партия,
		|	Погашение.СтрокаПартии КАК СтрокаПартии,
		|	Погашение.СтоимостьКупона КАК СтоимостьКупонаПартииРасход,
		|	Погашение.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчетаПартииРасход,
		|	Погашение.ПереоценкаКупона КАК ПереоценкаКупонаПартииРасход,
		|	Погашение.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчетаПартииРасход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ПереоценкаКупона, 0) КАК ПереоценкаКупонаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ПереоценкаКупонаВВалютеУчета, 0) КАК ПереоценкаКупонаВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ДисконтПремияНачисленный, 0) КАК ДисконтПремияНачисленныйПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ДисконтПремияНачисленныйВВалютеУчета, 0) КАК ДисконтПремияНачисленныйВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.КорректировкаЭСП, 0) КАК КорректировкаЭСППартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.КорректировкаЭСПВВалютеУчета, 0) КАК КорректировкаЭСПВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьВВалютеУчета, 0) КАК СтоимостьПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьКупонаВВалютеУчета, 0) КАК СтоимостьКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаВВалютеУчета, 0) КАК ПереоценкаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаКупонаВВалютеУчета, 0) КАК ПереоценкаКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ДисконтПремияНачисленныйВВалютеУчета, 0) КАК ДисконтПремияНачисленныйПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.КорректировкаЭСПВВалютеУчета, 0) КАК КорректировкаЭСППерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка,
		|	Остатки.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупки,
		|	Остатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	Остатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчетаОстаток,
		|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
		|	Остатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	Остатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГодаОстаток,
		|	Остатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
		|	Остатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГодаОстаток,
		|	Погашение.УчетныйАктивЕПС.СчетУчета КАК УчетныйАктивЕПССчетУчета,
		|	Погашение.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК УчетныйАктивЕПССчетУчетаПереоценкиА,
		|	Погашение.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК УчетныйАктивЕПССчетУчетаПереоценкиП,
		|	Погашение.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций КАК УчетныйАктивЕПССчетУчетаДоходовОтОпераций,
		|	Погашение.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций КАК УчетныйАктивЕПССчетУчетаРасходовОтОпераций,
		|	Погашение.УчетныйАктивЕПС.АналитикаДоходовОтОпераций КАК УчетныйАктивЕПСАналитикаДоходовОтОпераций,
		|	Погашение.УчетныйАктивЕПС.АналитикаРасходовОтОпераций КАК УчетныйАктивЕПСАналитикаРасходовОтОпераций,
		|	Погашение.УчетныйАктивЕПС.АналитикаПроцентныхДоходов КАК УчетныйАктивЕПСАналитикаПроцентныхДоходов,
		|	Погашение.УчетныйАктивЕПС.АналитикаСписанияПремии КАК УчетныйАктивЕПСАналитикаСписанияПремии,
		|	Погашение.УчетныйАктивЕПС.АналитикаДоходовОтПереоценки КАК УчетныйАктивЕПСАналитикаДоходовОтПереоценки,
		|	Погашение.УчетныйАктивЕПС.АналитикаРасходовОтПереоценки КАК УчетныйАктивЕПСАналитикаРасходовОтПереоценки,
		|	Погашение.УчетныйАктивЕПС.СчетУчетаКорректировокА КАК УчетныйАктивЕПССчетУчетаКорректировокА,
		|	Погашение.УчетныйАктивЕПС.СчетУчетаКорректировокП КАК УчетныйАктивЕПССчетУчетаКорректировокП,
		|	Погашение.УчетныйАктивЕПС.АналитикаДоходовОтКорректировки КАК УчетныйАктивЕПСАналитикаДоходовОтКорректировки,
		|	Погашение.УчетныйАктивЕПС.АналитикаРасходовОтКорректировки КАК УчетныйАктивЕПСАналитикаРасходовОтКорректировки,
		|	Погашение.УчетныйАктивЕПС.АналитикаДоходовПервоначальногоПризнания КАК УчетныйАктивЕПСАналитикаДоходовПервоначальногоПризнания,
		|	Погашение.УчетныйАктивЕПС.АналитикаРасходовПервоначальногоПризнания КАК УчетныйАктивЕПСАналитикаРасходовПервоначальногоПризнания
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК Погашение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК ПереоценкаНачисление
		|		ПО Погашение.Регистратор = ПереоценкаНачисление.Регистратор
		|			И Погашение.ВидУчета = ПереоценкаНачисление.ВидУчета
		|			И Погашение.ЦеннаяБумага = ПереоценкаНачисление.ЦеннаяБумага
		|			И Погашение.Партия = ПереоценкаНачисление.Партия
		|			И Погашение.СтрокаПартии = ПереоценкаНачисление.СтрокаПартии
		|			И (ПереоценкаНачисление.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (ПереоценкаНачисление.ПереоценкаКупона <> 0
		|				ИЛИ ПереоценкаНачисление.ДисконтПремияНачисленный <> 0
		|				ИЛИ ПереоценкаНачисление.КорректировкаЭСП <> 0
		|				ИЛИ ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные <> 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК Перекурсовка
		|		ПО Погашение.Регистратор = Перекурсовка.Регистратор
		|			И Погашение.ВидУчета = Перекурсовка.ВидУчета
		|			И Погашение.ЦеннаяБумага = Перекурсовка.ЦеннаяБумага
		|			И Погашение.Партия = Перекурсовка.Партия
		|			И Погашение.СтрокаПартии = Перекурсовка.СтрокаПартии
		|			И (Перекурсовка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (Перекурсовка.ПереоценкаКупона = 0)
		|			И (Перекурсовка.ДисконтПремияНачисленный = 0)
		|			И (Перекурсовка.КорректировкаЭСП = 0)
		|			И (Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0)
		|			И (Перекурсовка.ЗадолженностьПоПогашениюКупона = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|					И Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЦеннаяБумага = &ЦеннаяБумага) КАК Остатки
		|		ПО Погашение.Партия = Остатки.Партия
		|			И Погашение.СтрокаПартии = Остатки.СтрокаПартии
		|ГДЕ
		|	Погашение.Регистратор = &Ссылка
		|	И Погашение.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И Погашение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.Облигация);
	
	
	РаспределяемЗадолженность = Ложь;
	СуммаЗадолженности = 0;
	КоличествоЗадолженности = 0;
	
	Если ЭтотОбъект.ВалютаОплаты <> ЭтотОбъект.Облигация.ВалютаНоминала Тогда
		// тут рассматривается только ситуация рублевой оплаты по валютным облигациям
		// вероятность обратной ситуации пренебрежимо мала
		Если ЭтотОбъект.СуммаНаОднуОблигацию - Окр(ЭтотОбъект.СуммаНаОднуОблигацию, 2) <> 0 Тогда
			
			РаспределяемЗадолженность = Истина;
			КоличествоЗадолженности = ЭтотОбъект.Количество - КоличествоПоРЕПО;
			СуммаЗадолженности = ЭтотОбъект.СуммаНаОднуОблигацию * КоличествоЗадолженности;
		
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыНачисления = Новый Структура;
	
	ПараметрыНачисления.Вставить("НастройкиУчета",	НастройкиУчета);
	
	ПараметрыНачисления.Вставить("ЦеннаяБумага",	ЭтотОбъект.Облигация);
	ПараметрыНачисления.Вставить("ВалютаНоминала",	ЭтотОбъект.Облигация.ВалютаНоминала);
	
	ПараметрыСписания = Новый Структура;
	ПараметрыСписания.Вставить("Облигация",			ЭтотОбъект.Облигация);
	ПараметрыСписания.Вставить("Контрагент",		ЭтотОбъект.Облигация.Эмитент.ЮрФизЛицо);
	ПараметрыСписания.Вставить("Ссылка",			ЭтотОбъект.Ссылка);
	ПараметрыСписания.Вставить("ВалютаОплаты",		ЭтотОбъект.ВалютаОплаты);
	ПараметрыСписания.Вставить("ВалютаНоминала",	ЭтотОбъект.Облигация.ВалютаНоминала);
	ПараметрыСписания.Вставить("ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов",			НастройкиУчета.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если РаспределяемЗадолженность Тогда
		
			СуммаЗадолженностиПоПартии = Окр(СуммаЗадолженности / КоличествоЗадолженности * ВыборкаДетальныеЗаписи.КоличествоОстаток, 2);
			
			СуммаЗадолженности = СуммаЗадолженности - СуммаЗадолженностиПоПартии;
			КоличествоЗадолженности = КоличествоЗадолженности - ВыборкаДетальныеЗаписи.КоличествоОстаток;
			
		Иначе
			
			СуммаЗадолженности = ЭтотОбъект.СуммаНаОднуОблигацию * ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
		КонецЕсли;
		
		ОбщаяСумма = ВыборкаДетальныеЗаписи.СтоимостьКупонаПартииРасход + ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииРасход;
		
		СуммаЗадолженностиУНКД = Окр(СуммаЗадолженности / ОбщаяСумма * ВыборкаДетальныеЗаписи.СтоимостьКупонаПартииРасход, 2);
		СуммаЗадолженностиННКД = СуммаЗадолженности - СуммаЗадолженностиУНКД;
		
		// 3 Спишем УНКД и ННКД 
		ПараметрыСписания.Вставить("УчетныйАктив",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС);
		ПараметрыСписания.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
		ПараметрыСписания.Вставить("СтрокаПартии",		ВыборкаДетальныеЗаписи.СтрокаПартии);
		// УНКД
		ПараметрыСписания.Вставить("Аналитика",			АналитикаКупонПриобретенный);
		ПараметрыСписания.Вставить("Содержание",		"Погашение купона (приобретенный)");
		ПараметрыСписания.Вставить("Сумма",				ВыборкаДетальныеЗаписи.СтоимостьКупонаПартииРасход);
		ПараметрыСписания.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчетаПартииРасход);
		ПараметрыСписания.Вставить("СуммаОплаты",		СуммаЗадолженностиУНКД);
		
		СформироватьПроводкуСписанияКупонаЕПС(ЭтотОбъект, УчетныйРегистр, ПараметрыСписания);
		
		// ННКД
		ПараметрыСписания.Вставить("Аналитика",			АналитикаКупонНачисленный);
		ПараметрыСписания.Вставить("Содержание",		"Погашение купона (начисленный)");
		ПараметрыСписания.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииРасход);
		ПараметрыСписания.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииРасход);
		ПараметрыСписания.Вставить("СуммаОплаты",		СуммаЗадолженностиННКД);
		
		СформироватьПроводкуСписанияКупонаЕПС(ЭтотОбъект, УчетныйРегистр, ПараметрыСписания);
		
		
		// 1 Начислим %ные доходы
		ПараметрыНачисления.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
		ПараметрыНачисления.Вставить("СтрокаПартии",	ВыборкаДетальныеЗаписи.СтрокаПартии);
		ПараметрыНачисления.Вставить("Количество",		0);
		ПараметрыНачисления.Вставить("ПроверитьПарные",	"");
		
		// дисконт-премия	
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
			ПараметрыНачисления.Вставить("Содержание",			"Списание премии");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы04);
			ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаСписанияПремии);
		Иначе
			ПараметрыНачисления.Вставить("Содержание",			"Начисление дисконта");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы01);
			ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаПроцентныхДоходов);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// ННКД	
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Переоценка купона");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
		ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы01);
		ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаПроцентныхДоходов);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// корректировка ЭСП
		БалансоваяКорректировкаЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСПОстаток;
		БалансоваяКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаОстаток;
		
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаСНачалаГода",	ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГодаОстаток + ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяКорректировкаЭСП);
		ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяКорректировкаЭСПВВалютеУчета);
		
		ПараметрыНачисления.Вставить("Содержание",			"КорректировкаЭСП");
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
		
		ПараметрыНачисления.Вставить("ПроверитьПарные",		"КорректировкаЭСП");
		
		Если (БалансоваяКорректировкаЭСПВВалютеУчета > 0)ИЛИ(БалансоваяКорректировкаЭСПВВалютеУчета = 0 И ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход > 0) Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокА);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокП);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокП);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокА);
		КонецЕсли;
		
		Если (ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГодаОстаток > 0)ИЛИ(ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГодаОстаток = 0 И ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход > 0) Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы05);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтКорректировки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	ПланыСчетов.Единый.ПроцентныеДоходы06);
			ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтКорректировки);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы06);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтКорректировки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", ПланыСчетов.Единый.ПроцентныеДоходы05);
			ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтКорректировки);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		ПараметрыНачисления.Удалить("ПроверитьПарныеДоходыРасходы");
		
		// разница п/п
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("Содержание",			"Разница первоначального признания");
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияСНачалаГодаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовПервоначальногоПризнания);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовПервоначальногоПризнания);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		
		// 2 Начислим курсовую разницу
		ПараметрыНачисления.Удалить("ПроверитьПарные"); // не нужно проверять парные для курсовой - их просто нет
		
		СчетДоходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
		ГФУДоходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетДоходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
		СчетРасходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
		ГФУРасходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетРасходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
		
		ПараметрыНачисления.Вставить("Сумма",				0);
		
		// тело
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница стоимость");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаТела);
		
		Если ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// УНКД
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон приобретенный");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонПриобретенный);
		
		Если ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// переоценка
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
		КонецЕсли;
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница переоценка");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаПереоценкиТела);
		
		Если НастройкиУчета.ОтражатьДоходыРасходыОтПерекурсовкиПереоценкиКакПереоценку Тогда
			Если ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаОстаток > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС));
				ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтПереоценки);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, Ложь));
				ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтПереоценки);
			КонецЕсли;
		Иначе
			Если ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
			КонецЕсли;
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// ННКД
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон начисленный");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// дисконт-премия
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		
		Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница премии");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
		Иначе
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница дисконта");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// корректировка ЭСП
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка);
		
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокА);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокП);
		КонецЕсли;
		
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница корректировка ЭСП");
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// разница п/п
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка);
		
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница п/п");
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
	КонецЦикла;

	// глава Г
	Если НастройкиУчета.ДействияПриПогашенииКупонаНаСчетахГлавыГ <> "НеНачислять_И_НеСписывать" Тогда
		
		ВалютаНоминала = Облигация.ВалютаНоминала;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Партия КАК Партия,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупона КАК ПереоценкаКупона,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупона КАК СтоимостьКупона,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО КАК БухПартииЦенныхБумагКупленныеПоРЕПО
			|ГДЕ
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.ВидДвижения В(&ВидыДвижений)
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.Активность";
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		
		ВидыДвижений = Новый Массив();
		ВидыДвижений.Добавить(ВидДвиженияНакопления.Приход);
		Если НастройкиУчета.ДействияПриПогашенииКупонаНаСчетахГлавыГ = "Начислять_И_СписыватьПриПогашенииКупона" Тогда // при погашении еще и списываем
			ВидыДвижений.Добавить(ВидДвиженияНакопления.Расход);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидыДвижений", ВидыДвижений);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			    // начисляем ННКД
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета, "Переоценка/доначисление купона по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
				Проводка.ДополнительнаяАналитикаДт = АналитикаКупонНачисленный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ЦенныеБумагиПоРЕПО;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Партия;
				
				Проводка.ВалютаКт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = ВыборкаДетальныеЗаписи.ПереоценкаКупона;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
				
			Иначе
				// списываем УНКД
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета, "Погашение купона по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ЦенныеБумагиПоРЕПО;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Партия;
				
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.СтоимостьКупона;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаКупонПриобретенный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонПриобретенный;
				
				// списываем ННКД
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета, "Погашение купона по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ЦенныеБумагиПоРЕПО;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Партия;
				
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.ПереоценкаКупона;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаКупонНачисленный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	// #414504 - пришел купон а бумаги по Т+ ушли
	Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ПФР_РЭМ")
		И НачалоДня(Дата) = '20220110' Тогда
	
		Возврат; // не делаем проводок
	
	КонецЕсли;

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);	
		
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
		
	//это,конечно, костыль. НО! тут нужно продумать-продумать
	//с одной стороны, нужно будет брать движение по БухПартииЦенныхБумагКупленныеПоРЕПО
	//но вот в этой самой ситуации, когда это делается купон как раз с БухПартииЦенныхБумагКупленныеПоРЕПО не уходил!
	//и как тут быть непонятно пока
	
	// КоличествоПоРЕПО считаем в любом случае, в Движения даем заполнять только если не стоит настройка ОтражатьЗадолженностьПоПогашениюКупонаДляБумагКупленныхПоРЕПОПоФактуОплаты
	КоличествоПоРЕПО = Документы.ПогашениеКупона.ПроводкиПоКупленнымПоРЕПОЕПС(ЭтотОбъект.Ссылка, ?(НастройкиУчета.ОтражатьЗадолженностьПоПогашениюКупонаДляБумагКупленныхПоРЕПОПоФактуОплаты, Неопределено, Движения.ЕдиныйБухгалтерскийУчет));
	
	АналитикаТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаДебиторкиПоКупону = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	
	ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов = БухгалтерскийУчет.ОпределитьНастройкуУчета(
															ЭтотОбъект.Дата,
															ЭтотОбъект.Организация,
															ЭтотОбъект.СчетДоверительногоУправления,
															"ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов");
	
	Если НастройкиУчета.ОтражатьПартииНаЛицевыхСчетах Тогда
	
		ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, КоличествоПоРЕПО, Отказ);
		Возврат;
	
	КонецЕсли;
	
	// #Технический долг - нужно это правильно сделать
	ЭтоБанкрот = Ложь;
	Если ЭтотОбъект.Облигация.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Прайм")	И ЭтотОбъект.Дата >= '20190913' Тогда
		ЭтоБанкрот = Истина;
	КонецЕсли;
	
	//читаем движения партий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумаг.КорректировкаЭСП = 0
		|				И БухПартииЦенныхБумаг.ДисконтПремияНачисленный = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияПокупкиОстаток < 0 КАК Дисконт
		|ПОМЕСТИТЬ _ОстаткиПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДоДокумента,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Организация = &Организация
		|				И ВидУчета = &ВидУчета
		|				И (ЦеннаяБумага, УчетныйАктивЕПС, Партия, СтрокаПартии) В
		|					(ВЫБРАТЬ
		|						_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|						_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|						_ДвиженияПартий.Партия КАК Партия,
		|						_ДвиженияПартий.СтрокаПартии КАК СтрокаПартии
		|					ИЗ
		|						_ДвиженияПартий КАК _ДвиженияПартий)) КАК БухПартииЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(_ОстаткиПартий.ПереоценкаКупонаОстаток) КАК ПереоценкаКупонаОстаток,
		|	СУММА(_ОстаткиПартий.КорректировкаЭСПОстаток) КАК КорректировкаЭСПОстаток,
		|	СУММА(_ОстаткиПартий.ДисконтПремияНачисленныйОстаток) КАК ДисконтПремияНачисленныйОстаток,
		|	СУММА(_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток,
		|	СУММА(_ОстаткиПартий.ПереоценкаОстаток) КАК ПереоценкаОстаток,
		|	СУММА(_ОстаткиПартий.СтоимостьКупонаОстаток) КАК СтоимостьКупонаОстаток
		|ПОМЕСТИТЬ _ОстаткиПартийСГруппировкойПоБумагеИАктиву
		|ИЗ
		|	_ОстаткиПартий КАК _ОстаткиПартий
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиПартий.ЦеннаяБумага,
		|	_ОстаткиПартий.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДвиженияПартий.Перекурсовка КАК Перекурсовка,
		|	_ОстаткиПартий.Дисконт КАК Дисконт,
		|	СУММА(_ДвиженияПартий.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(_ДвиженияПартий.КорректировкаЭСП) КАК КорректировкаЭСП,
		|	СУММА(_ДвиженияПартий.ДисконтПремияНачисленный) КАК ДисконтПремияНачисленный,
		|	СУММА(_ДвиженияПартий.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.КорректировкаЭСПВВалютеУчета) КАК КорректировкаЭСПВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ДисконтПремияНачисленныйВВалютеУчета) КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	СУММА(_ОстаткиПартийСГруппировкойПоБумагеИАктиву.ПереоценкаКупонаОстаток) КАК ПереоценкаКупонаОстаток,
		|	СУММА(_ОстаткиПартийСГруппировкойПоБумагеИАктиву.КорректировкаЭСПОстаток) КАК КорректировкаЭСПОстаток,
		|	СУММА(_ОстаткиПартий.ДисконтПремияНачисленныйОстаток) КАК ДисконтПремияНачисленныйОстаток,
		|	СУММА(_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	СУММА(_ОстаткиПартийСГруппировкойПоБумагеИАктиву.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток,
		|	СУММА(_ДвиженияПартий.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(_ДвиженияПартий.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(_ОстаткиПартийСГруппировкойПоБумагеИАктиву.ПереоценкаОстаток) КАК ПереоценкаОстаток,
		|	СУММА(_ОстаткиПартийСГруппировкойПоБумагеИАктиву.СтоимостьКупонаОстаток) КАК СтоимостьКупонаОстаток
		|ИЗ
		|	_ДвиженияПартий КАК _ДвиженияПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПартийСГруппировкойПоБумагеИАктиву КАК _ОстаткиПартийСГруппировкойПоБумагеИАктиву
		|		ПО _ДвиженияПартий.УчетныйАктивЕПС = _ОстаткиПартийСГруппировкойПоБумагеИАктиву.УчетныйАктивЕПС
		|			И _ДвиженияПартий.ЦеннаяБумага = _ОстаткиПартийСГруппировкойПоБумагеИАктиву.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПартий КАК _ОстаткиПартий
		|		ПО _ДвиженияПартий.УчетныйАктивЕПС = _ОстаткиПартий.УчетныйАктивЕПС
		|			И _ДвиженияПартий.ЦеннаяБумага = _ОстаткиПартий.ЦеннаяБумага
		|			И _ДвиженияПартий.Партия = _ОстаткиПартий.Партия
		|			И _ДвиженияПартий.СтрокаПартии = _ОстаткиПартий.СтрокаПартии
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДвиженияПартий.УчетныйАктивЕПС,
		|	_ДвиженияПартий.ЦеннаяБумага,
		|	_ДвиженияПартий.Перекурсовка,
		|	_ОстаткиПартий.Дисконт";

	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("ДоДокумента",    Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",    ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",    ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
	БухПартииЦенныхБумаг = РезультатЗапроса.Выгрузить();
	ВалютаНоминала = Облигация.ВалютаНоминала;
	
	МассивУчетныхАктивов = Новый Массив;
	
	Для Каждого СтрокаПартии Из БухПартииЦенныхБумаг Цикл
		УчетныйАктив = СтрокаПартии.УчетныйАктивЕПС;
		
		Если МассивУчетныхАктивов.Найти(УчетныйАктив) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(УчетныйАктив);
		КонецЕсли;
		
		Если СтрокаПартии.Перекурсовка Тогда
			
			ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, "
				+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета, "
				+ "ДисконтПремияНачисленныйВВалютеУчета, КорректировкаЭСПВВалютеУчета, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, "
				+ "ДисконтПремияНачисленныйОстаток, ПереоценкаОстаток, КорректировкаЭСПОстаток, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток",
				СтрокаПартии.ЦеннаяБумага, УчетныйАктив,
				СтрокаПартии.СтоимостьВВалютеУчета, СтрокаПартии.СтоимостьКупонаВВалютеУчета, СтрокаПартии.ПереоценкаВВалютеУчета, СтрокаПартии.ПереоценкаКупонаВВалютеУчета,
				СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета, СтрокаПартии.КорректировкаЭСПВВалютеУчета, СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
				?(СтрокаПартии.Дисконт, -1, 1),СтрокаПартии.ПереоценкаОстаток,СтрокаПартии.КорректировкаЭСПОстаток,СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток);
				
			БухгалтерскийУчетЕПС.ДвижениеПерекурсовки(ЭтотОбъект, ПараметрыПерекурсовки, Отказ);	
			
		Иначе
		
			// Дооцениваем купон
			Если СтрокаПартии.ПереоценкаКупона<>0 Тогда
				ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Аналитика",
					СтрокаПартии.ПереоценкаКупонаВВалютеУчета, СтрокаПартии.ПереоценкаКупона, ВалютаУчета, УчетныйАктив, Облигация, ВалютаНоминала, АналитикаКупонНачисленный);
				БухгалтерскийУчетЕПС.НачислитьНКД(ЭтотОбъект, ПараметрыНачисления, Отказ);
			КонецЕсли;
			//дооценки перед расходом купона, дисконта и т.п.
			Если СтрокаПартии.ДисконтПремияНачисленный<>0 Тогда
				ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала",
					СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета, СтрокаПартии.ДисконтПремияНачисленный, ВалютаУчета, УчетныйАктив, Облигация, ВалютаНоминала);
				ПараметрыНачисления.Вставить("Аналитика", ?(СтрокаПартии.ДисконтПремияНачисленный<0, АналитикаПремии, АналитикаДисконта));
				БухгалтерскийУчетЕПС.НачислитьДисконтПремию(ЭтотОбъект, ПараметрыНачисления, Отказ);
			КонецЕсли;
			
			Если СтрокаПартии.КорректировкаЭСП<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"КорректировкаЭСП", СтрокаПартии.КорректировкаЭСП, СтрокаПартии.КорректировкаЭСПВВалютеУчета,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, Облигация, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
				
			КонецЕсли;
			
			Если СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"РазницаПервоначальногоПризнания", СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, Облигация, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Ложь, Истина, ЭтотОбъект.Облигация, Отказ);
	
	//читаем движения погашений

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС
		|ИТОГИ ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтоги.Следующий() Тогда
	
		Если Облигация.ВалютаНоминала = ЭтотОбъект.Организация.ВалютаУчета Тогда // рублевые облигации
		
			СуммаКупонаНаОднуОблигацию = ЭтотОбъект.СуммаНаОднуОблигацию;
			
		Иначе // а вот эта затыка сделана для валютных облигаций, которые гасятся в рублях и сумму в валюте номинила только в регистре можно узнать
			
			СуммаКупонаНаОднуОблигацию = ОпределитьСуммуКупонаВВалютеНоминала();
		
		КонецЕсли;
		
		БазаКупонаКРаспределению = ВыборкаИтоги.СтоимостьКупона + ВыборкаИтоги.ПереоценкаКупона;
		ЗадолженностьКРаспределению = (ЭтотОбъект.Количество - КоличествоПоРЕПО) * СуммаКупонаНаОднуОблигацию;
		Если ЭтотОбъект.ВалютаОплаты = ЭтотОбъект.Организация.ВалютаУчета Тогда
			ЗадолженностьКРаспределениюВВалютеУчета = (ЭтотОбъект.Количество - КоличествоПоРЕПО) * ЭтотОбъект.СуммаНаОднуОблигацию;
		Иначе
			ЗадолженностьКРаспределениюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЗадолженностьКРаспределению, ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
		КонецЕсли;
		
		Если ЭтоБанкрот Тогда
			Если БазаКупонаКРаспределению = 0 Тогда // купона уже нет и ничего делать не нужно, вообще ничего
				Возврат; 
			КонецЕсли;
			ЗадолженностьКРаспределению = БазаКупонаКРаспределению;
			Если ЭтотОбъект.ВалютаОплаты = ЭтотОбъект.Организация.ВалютаУчета Тогда
				ЗадолженностьКРаспределениюВВалютеУчета = ЗадолженностьКРаспределению;
			Иначе
				ЗадолженностьКРаспределениюВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЗадолженностьКРаспределению, ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаИтоги.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			УчетныйАктив = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
			
			СтоимостьКупона = ВыборкаДетальныеЗаписи.СтоимостьКупона;
			ПереоценкаКупона = ВыборкаДетальныеЗаписи.ПереоценкаКупона;
			
			//сумму задолженности разделим пропорционально. Допускаем, что одна бумага на разный видах актива висеть не может
			КоэффициентРаспределения = СтоимостьКупона / БазаКупонаКРаспределению;
			ЗадолженностьПоСтоимостиКупона = Окр(ЗадолженностьКРаспределению * КоэффициентРаспределения, 2);
			ЗадолженностьПоСтоимостиКупонаВВалютеУчета = Окр(ЗадолженностьКРаспределениюВВалютеУчета * КоэффициентРаспределения, 2);
			КурсоваяРазницаСтоимостиКупона = ЗадолженностьПоСтоимостиКупонаВВалютеУчета - ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета;
			
			БазаКупонаКРаспределению = БазаКупонаКРаспределению - СтоимостьКупона;
			ЗадолженностьКРаспределению = ЗадолженностьКРаспределению - ЗадолженностьПоСтоимостиКупона;
			ЗадолженностьКРаспределениюВВалютеУчета = ЗадолженностьКРаспределениюВВалютеУчета - ЗадолженностьПоСтоимостиКупонаВВалютеУчета;
			
			//конец распределения задолженности
			
			
			Облигация = ЭтотОбъект.Облигация;
			
			ВалютаНоминала = Облигация.ВалютаНоминала;
			
			Контрагент = Облигация.Эмитент.ЮрФизЛицо;
		
			// ***** купон *****
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ЗадолженностьПоСтоимостиКупонаВВалютеУчета, "Погашение купона");
			
			// дебет
			Если ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
				
				Проводка.СчетДт = УчетныйАктив.СчетУчетаКупона;
				
				Проводка.СубконтоДт.ЦенныеБумаги = Облигация;
				
				Проводка.ВалютаДт = ЭтотОбъект.ВалютаОплаты;
				Проводка.ВалютнаяСуммаДт = ЗадолженностьПоСтоимостиКупона;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
			Иначе
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
				
				Проводка.ВалютаДт  = ЭтотОбъект.ВалютаОплаты;
				Проводка.ВалютнаяСуммаДт = ЗадолженностьПоСтоимостиКупона;
							
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
			КонецЕсли;
			
			Если ЭтотОбъект.ВалютаОплаты = ЭтотОбъект.Организация.ВалютаУчета Тогда
				Проводка.ВалютнаяСуммаДт = ЗадолженностьПоСтоимостиКупонаВВалютеУчета;	
			КонецЕсли;
			
			
			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчетаКупона;
			
			Проводка.СубконтоКт.ЦенныеБумаги = Облигация;
			
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = ЗадолженностьПоСтоимостиКупона;
			
			Проводка.ДополнительнаяАналитикаКт = АналитикаКупонПриобретенный;
			
				
			// ***** переоценка купона *****
			Если БазаКупонаКРаспределению = 0 Тогда
				
				КурсоваяРазницаПереоценкиКупона = 0;
				
			Иначе
				
				КоэффициентРаспределения = ПереоценкаКупона / БазаКупонаКРаспределению;
				ЗадолженностьПоПереоценкеКупона = Окр(ЗадолженностьКРаспределению * КоэффициентРаспределения, 2);
				ЗадолженностьПоПереоценкеКупонаВВалютеУчета = Окр(ЗадолженностьКРаспределениюВВалютеУчета * КоэффициентРаспределения, 2);
				КурсоваяРазницаПереоценкиКупона = ЗадолженностьПоПереоценкеКупонаВВалютеУчета - ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета;
				
				БазаКупонаКРаспределению = БазаКупонаКРаспределению - ПереоценкаКупона;
				ЗадолженностьКРаспределению = ЗадолженностьКРаспределению - ЗадолженностьПоПереоценкеКупона;
				ЗадолженностьКРаспределениюВВалютеУчета = ЗадолженностьКРаспределениюВВалютеУчета - ЗадолженностьПоПереоценкеКупонаВВалютеУчета;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ЗадолженностьПоПереоценкеКупонаВВалютеУчета, "Погашение купона");
				
				// дебет
				Если ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
					
					Проводка.СчетДт = УчетныйАктив.СчетУчетаКупона;
					
					Проводка.СубконтоДт.ЦенныеБумаги = Облигация;
					
					Проводка.ВалютаДт = ЭтотОбъект.ВалютаОплаты;
					Проводка.ВалютнаяСуммаДт = ЗадолженностьПоПереоценкеКупона;
					
					Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
					
				Иначе
					
					Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
					
					Проводка.СубконтоДт.Контрагенты = Контрагент;
					Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;			
					
					Проводка.ВалютаДт  = ЭтотОбъект.ВалютаОплаты;
					Проводка.ВалютнаяСуммаДт = ЗадолженностьПоПереоценкеКупона;
								
					Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
					
				КонецЕсли;

				Если ЭтотОбъект.ВалютаОплаты = ЭтотОбъект.Организация.ВалютаУчета Тогда
					Проводка.ВалютнаяСуммаДт = ЗадолженностьПоПереоценкеКупонаВВалютеУчета;	
				КонецЕсли;
				
				// кредит
				Проводка.СчетКт = УчетныйАктив.СчетУчетаКупона;
				
				Проводка.СубконтоКт.ЦенныеБумаги = Облигация;
				
				Проводка.ВалютаКт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = ЗадолженностьПоПереоценкеКупона;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
				
			КонецЕсли;
			
			Если КурсоваяРазницаСтоимостиКупона <> 0 ИЛИ КурсоваяРазницаПереоценкиКупона <> 0 Тогда
				ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, "
					+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета, "
					+ "ДисконтПремияНачисленныйВВалютеУчета, КорректировкаЭСПВВалютеУчета, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,"
					+ "ДисконтПремияНачисленныйОстаток, ПереоценкаОстаток, КорректировкаЭСПОстаток, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток",
					ЭтотОбъект.Облигация, УчетныйАктив,
					0, КурсоваяРазницаСтоимостиКупона, 0, КурсоваяРазницаПереоценкиКупона,
					0, 0, 0,
					0,0,0,0);
				
				БухгалтерскийУчетЕПС.ДвижениеПерекурсовки(ЭтотОбъект, ПараметрыПерекурсовки, Отказ);	
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	// глава Г
	Если НастройкиУчета.ДействияПриПогашенииКупонаНаСчетахГлавыГ <> "НеНачислять_И_НеСписывать" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Партия КАК Партия,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупона КАК ПереоценкаКупона,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупона КАК СтоимостьКупона,
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО КАК БухПартииЦенныхБумагКупленныеПоРЕПО
			|ГДЕ
			|	БухПартииЦенныхБумагКупленныеПоРЕПО.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.ВидДвижения В(&ВидыДвижений)
			|	И БухПартииЦенныхБумагКупленныеПоРЕПО.Активность";
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		
		ВидыДвижений = Новый Массив();
		ВидыДвижений.Добавить(ВидДвиженияНакопления.Приход);
		Если НастройкиУчета.ДействияПриПогашенииКупонаНаСчетахГлавыГ = "Начислять_И_СписыватьПриПогашенииКупона" Тогда // при погашении еще и списываем
			ВидыДвижений.Добавить(ВидДвиженияНакопления.Расход);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидыДвижений", ВидыДвижений);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			    // начисляем ННКД
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета, "Переоценка/доначисление купона по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
				Проводка.ДополнительнаяАналитикаДт = АналитикаКупонНачисленный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ЦенныеБумагиПоРЕПО;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Партия;
				
				Проводка.ВалютаКт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = ВыборкаДетальныеЗаписи.ПереоценкаКупона;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
				
			Иначе
				// списываем УНКД
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета, "Погашение купона по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ЦенныеБумагиПоРЕПО;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Партия;
				
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.СтоимостьКупона;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаКупонПриобретенный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонПриобретенный;
				
				// списываем ННКД
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета, "Погашение купона по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ЦенныеБумагиПоРЕПО;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Партия;
				
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.ПереоценкаКупона;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаКупонНачисленный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	БухгалтерскийУчетЕПС.ПереоценитьВалютныеАктивы(ЭтотОбъект, Отказ);
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
	
КонецПроцедуры
 	
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	// Получение списка проводок вынесено в модуль менеджера
	НаборПроводок = Документы.ПогашениеКупона.ПодготовитьНаборПроводок(
		ЭтотОбъект.Ссылка, 
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		,
		УчетныйРегистр, 
		Отказ, Истина);
				
	Если Отказ ИЛИ НаборПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗПроводок = НаборПроводок.Выгрузить();
	ТЗПроводок.ЗаполнитьЗначения(ЭтотОбъект.Ссылка, "Регистратор");
	Движения[УчетныйРегистр].Загрузить(ТЗПроводок);  
		
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Количество, КоличествоПоРЕПО, СуммаКупона");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Облигация, "ВалютаНоминала");
		
		Если (НачалоДня(ЭтотОбъект.Дата) < ЭтотОбъект.Облигация.ДатаПогашения) Тогда
			ПроверкаДатыДокументаНаСоответствиеГрафикуНачисленияПроцентов(Отказ);
		ИначеЕсли (НачалоДня(ЭтотОбъект.ДатаФиксации) = ЭтотОбъект.Облигация.ДатаФиксацииДляПогашения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Последнее погашение купона вводится с помощью документа ""Погашение облигации"".'"), ЭтотОбъект, "Облигация",, Отказ);
		КонецЕсли;

		Если ЭтотОбъект.Дата < ЭтотОбъект.ДатаФиксации Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа не может быть меньше даты фиксации.'"), ЭтотОбъект, "ДатаФиксации",, Отказ);
		КонецЕсли;

		СообщитьОРазныхВалютах = Ложь;//типа проведение бэкофиса все отрабатывает
		Если ЭтотОбъект.ВалютаОплаты <> ВалютаНоминала Тогда 
			ВидыУчетаДляПроведения = Неопределено;
			Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ВидыУчетаДляПроведения", ВидыУчетаДляПроведения) Тогда
				Для каждого видУчета из ВидыУчетаДляПроведения Цикл
					Если видУчета <> Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
						СообщитьОРазныхВалютах = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если СообщитьОРазныхВалютах Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Валюта оплаты отличается от валюты номинала облигации.'"), ЭтотОбъект, "ВалютаОплаты",,);
			КонецЕсли;
		КонецЕсли;

		ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(ЭтотОбъект);
		
		Если ДетализацияПоРасчетномуСчету Тогда
			Если НЕ ЗначениеЗаполнено(РасчетныйСчет) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""Расчетный счёт"" не заполнено'"), ЭтотОбъект, "РасчетныйСчет",, );			
			Иначе
				Если ЭтотОбъект.РасчетныйСчет.Валюта <> ВалютаНоминала Тогда 
					Если СообщитьОРазныхВалютах Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Валюта расчетного счета отличается от валюты номинала облигации!'"), ЭтотОбъект, "РасчетныйСчет",, );
					КонецЕсли;
				КонецЕсли;
				Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.ВалютаОплаты Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Валюта расчетного счета отличается от валюты оплаты!'"), ЭтотОбъект, "РасчетныйСчет",, );
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Для документов с определенной даты при расхождении валюты оплаты и валюты номинала
		// требуется обязательное заполнение полей "Сумма на одну облигацию в валюте оплаты"
		// и "Сумма купона в валюте оплаты".
		ДатаОграничения = Дата(2026, 4, 1);

		//Если НачалоДня(ЭтотОбъект.Дата) >= ДатаОграничения И ЭтотОбъект.ВалютаОплаты <> ВалютаНоминала Тогда
			
			Если ЭтотОбъект.СуммаНаОднуОблигациюВВалютеОплаты = 0 Тогда
				ТекстСообщения = НСтр("ru='Не заполнено поле ""Сумма на одну облигацию в валюте оплаты"". Ограничение действует для документов с %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Формат(ДатаОграничения, "ДФ=dd.MM.yyyy"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"СуммаНаОднуОблигациюВВалютеОплаты",
					,
					Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.СуммаКупонаВВалютеОплаты = 0 Тогда
				ТекстСообщения = НСтр("ru='Не заполнено поле ""Сумма купона в валюте оплаты"". Ограничение действует для документов с %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Формат(ДатаОграничения, "ДФ=dd.MM.yyyy"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"СуммаКупонаВВалютеОплаты",
					,
					Отказ);
			КонецЕсли;
			
		//КонецЕсли;
		
		Если ВалютаНоминала = ЭтотОбъект.ВалютаОплаты Тогда
			ЭтотОбъект.СуммаКупонаВВалютеОплаты = ЭтотОбъект.СуммаКупона;
			ЭтотОбъект.СуммаНаОднуОблигациюВВалютеОплаты = ЭтотОбъект.СуммаНаОднуОблигацию;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
