Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Показатель = Перечисления.ВидыПроцентныхПоказателей.ИПЦкКонцуПредыдущегоМесяца
		 ИЛИ Запись.Показатель = Перечисления.ВидыПроцентныхПоказателей.ИПЦкДекабрюПредыдущегоГода
		 ИЛИ Запись.Показатель = Перечисления.ВидыПроцентныхПоказателей.ИПЦкСоответствующемуМесяцуПредыдущегоГода Тогда
			Если Запись.ДатаЗначения <> НачалоДня(КонецМесяца(Запись.ДатаЗначения)) Тогда 
		 		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон(		
						"Дата значения [%1] индекса потребительских цен должна быть концом месяца [%2]",
						Формат(Запись.ДатаЗначения, "ДФ=dd.MM.yyyy"), 
						Формат(НачалоДня(КонецМесяца(Запись.ДатаЗначения)), "ДФ=dd.MM.yyyy")),,,, Отказ);
		 	КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Фиксируем результаты проверки
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры


