
Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ВидАктива <> Перечисления.ВидыАктивовДляПорученийНаПереоценку.ЦенныеБумаги
			И  (Запись.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ПустаяСсылка")	
				ИЛИ Запись.ЦеннаяБумага <> Неопределено) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рынок и ценная бумага заполняются только для поручения на переоценку ценных бумаг.",,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
