
&НаСервере
Процедура СконвертироватьНаСервере()
	РеквизитФормыВЗначение("Объект").СконвертироватьФайлы(ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.КонвертироватьTXT, ЭтаФорма.КонвертироватьXLSX);
КонецПроцедуры

&НаКлиенте
Процедура Сконвертировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Сконвертировать");
	Попытка
		ВыполнитьКонвертацию(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонвертацию(ПараметрыСессии)
	СконвертироватьНаСервере();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Закончено");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.Дата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата() - 24*60*60));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
		
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьTXTПриИзменении(Элемент)
    Если КонвертироватьTXT Тогда
        КонвертироватьXLSX = Ложь; // Включен TXT, выключаем XLSX
    Иначе
        КонвертироватьXLSX = Истина; // Выключен TXT, включаем XLSX
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьXLSXПриИзменении(Элемент)
    Если КонвертироватьXLSX Тогда
        КонвертироватьTXT = Ложь; // Включен XLSX, выключаем TXT
    Иначе
        КонвертироватьTXT = Истина; // Выключен XLSX, включаем TXT
    КонецЕсли;
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти