
#Область Сверка_с_террористами

// Функция - Выполняет сверку юр./физ. лиц со списком террористов
// Результат сверки фиксируется в журнале
// 
// Параметры:
//	ПроверяемыеЛица	 - Массив - (Необязательный) Содержит массив проверяемых юр./физ. лиц
//	ОшибкиСверки	 - Структура - (Необязательный, Выходной) В случае ошибок сверки возвращает структуру с описанием ошибок
//						(см. РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомТеррористовВMatrix) 
//	ОтчетОСверке	 - ТабличныйДокумент - (Необязательный, Выходной) Отчет о результатах сверки
//						Если указан табличный документ, то в него выводится отчет
// 
// Возвращаемое значение:
//	ТаблицаЗначений, Неопределено - таблица успешно прошедших проверку лиц, Неопределено - в случае ошибки
//									(см. возвращаемое значение РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомТеррористовВMatrix)
//
//
Функция ВыполнитьСверкуСоСпискомТеррористовВMatrix(ПроверяемыеЛица = Неопределено, ОшибкиСверки = Неопределено, ОтчетОСверке = Неопределено, ДополнительныеСвойстваЗаписи = Неопределено) Экспорт
	ПроверенныеЛица = РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомТеррористовВMatrix(ПроверяемыеЛица, ОшибкиСверки);
	
	Если ПроверенныеЛица <> Неопределено Тогда	
		ЗаписатьРезультатыСверкиВРегистр(ТекущаяДата(),, Справочники.ВидыПеречнейОбъектов.СписокТеррористов, ПроверенныеЛица, ДополнительныеСвойстваЗаписи);
		
		// Формируем отчет при необходимости
		Если ОтчетОСверке <> Неопределено Тогда
			СформироватьОтчетОСверкеСоСпискомТеррористов(ОтчетОСверке, ПроверенныеЛица, ОшибкиСверки);		
		КонецЕсли;
		
	// Произошли ошибки
	Иначе
		ОтчетОСверке = Неопределено;	
	КонецЕсли;
	
	Возврат ПроверенныеЛица;
КонецФункции

Функция СформироватьОтчетОСверкеСоСпискомТеррористов(ТаблДок, ПроверенныеЛица, ОшибкиСверки)
	// Параметры макета
	Макет = РегистрыСведений.ЖурналСверкиСоСписками.ПолучитьМакет("МакетОтчета");
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(,, Макет, ТаблДок);
	// Найденные совпадения
	НайденныеСовпадения = ПроверенныеЛица.НайтиСтроки(Новый Структура("Пройдена", Ложь));
	Если НайденныеСовпадения.Количество() > 0 Тогда
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода, 
			НайденныеСовпадения, 
			Новый Структура("НомерСтроки, ЮрФизЛицо, Комментарий", "№ п/п", "Юр. / физ. лицо", "Комментарий"), 
			"Лица, имеющие совпадения со списком террористов");
	КонецЕсли;
	
	// Ошибки поиска кода в системе Матрих
	ОшибкиПоискаКодаВоВнешнейСистеме = Неопределено;	
	Если ОшибкиСверки <> Неопределено И ОшибкиСверки.Свойство("ОшибкиПоискаКодаВоВнешнейСистеме", ОшибкиПоискаКодаВоВнешнейСистеме) Тогда
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода,
			ОшибкиПоискаКодаВоВнешнейСистеме,
			Новый Структура("НомерСтроки, Ссылка", "№ п/п", "Юр. / физ. лицо"),
			"Ошибки поиска внешнего кода в системе Матрих"
		);
	КонецЕсли;
	
	// Непроверенные лица
	НеПроверенныеЛица = Неопределено;
	Если ОшибкиСверки <> Неопределено И ОшибкиСверки.Свойство("НеПроверенныеЛица", НеПроверенныеЛица) Тогда
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода,
			НеПроверенныеЛица,
			Новый Структура("НомерСтроки, Ссылка, Комментарий", "№ п/п", "Юр. / физ. лицо", "Комментарий"),
			"Непроверенные лица"
		);
	КонецЕсли;

	// Успешно прошедшие проверки
	ПрошедшиеПроверку = ПроверенныеЛица.НайтиСтроки(Новый Структура("Пройдена", Истина));
	Если ПрошедшиеПроверку.Количество() > 0 Тогда
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода,
			ПрошедшиеПроверку,
			Новый Структура("НомерСтроки, ЮрФизЛицо, Комментарий", "№ п/п", "Юр. / физ. лицо", "Комментарий"),
			"Лица, прошедшие проверку"
		);
	КонецЕсли;	
	
	// Автоширина колонок
	РаботаСОтчетами.ПодобратьШиринуКолонокТаблицыОтчета(ТаблДок, 1, 2, ТаблДок.ВысотаТаблицы, ТаблДок.ШиринаТаблицы, 60);
	
	// Заполняем настройки печати по умочанию
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ТаблДок, "РезультатСверкиСоСпискомТеррористовВMatrix", Истина, ОриентацияСтраницы.Портрет);	
	
	Возврат ТаблДок;	
КонецФункции

#КонецОбласти

#Область Сверка_с_лицами_с_замороженными_счетами

// Функция - Выполняет сверку юр./физ. лиц со списком лиц с замороженными счетами
// Результат сверки фиксируется в журнале
// 
// Параметры:
//	ПроверяемыеЛица	 - Массив - (Необязательный) Содержит массив проверяемых юр./физ. лиц
//	ОшибкиСверки	 - Структура - (Необязательный, Выходной) В случае ошибок сверки возвращает структуру с описанием ошибок
//						(см. РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомЛицСЗамороженнымиСчетамиВMatrix) 
//	ОтчетОСверке	 - ТабличныйДокумент - (Необязательный, Выходной) Отчет о результатах сверки
//						Если указан табличный документ, то в него выводится отчет
// 
// Возвращаемое значение:
//	ТаблицаЗначений, Неопределено - таблица успешно прошедших проверку лиц, Неопределено - в случае ошибки
//									(см. возвращаемое значение РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомЛицСЗамороженнымиСчетамиВMatrix)
//
//
Функция ВыполнитьСверкуСоСпискомЛицСЗамороженнымиСчетамиВMatrix(ПроверяемыеЛица = Неопределено, ОшибкиСверки = Неопределено, ОтчетОСверке = Неопределено, ДополнительныеСвойстваЗаписи = Неопределено) Экспорт
	ПроверенныеЛица = РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомЛицСЗамороженнымиСчетамиВMatrix(ПроверяемыеЛица, ОшибкиСверки);
	
	Если ПроверенныеЛица <> Неопределено Тогда	
		ЗаписатьРезультатыСверкиВРегистр(ТекущаяДата(),, Справочники.ВидыПеречнейОбъектов.СписокЛицСЗамороженнымиСчетами, ПроверенныеЛица, ДополнительныеСвойстваЗаписи);
		
		// Формируем отчет при необходимости
		Если ОтчетОСверке <> Неопределено Тогда
			СформироватьОтчетОСверкеСоСписком(ОтчетОСверке, ПроверенныеЛица, ОшибкиСверки, "Лица, имеющие совпадения со списком лиц с замороженными счетами");
		КонецЕсли;
		
	// Произошли ошибки
	Иначе
		ОтчетОСверке = Неопределено;	
	КонецЕсли;
	
	Возврат ПроверенныеЛица;
КонецФункции

#КонецОбласти

#Область Сверка_со_списком_отказников

// Функция - Выполняет сверку юр./физ. лиц со списком отказников
// Результат сверки фиксируется в журнале
// 
// Параметры:
//  Организация - список лиц приходит через ЛК, а значит загружается с отбором по организации
//	ПроверяемыеЛица	 - Массив - (Необязательный) Содержит массив проверяемых юр./физ. лиц
//  ИдентификаторСписка - Число - при запуске сверки пользователь выбирает перечень, при загрузке анкеты юр/физ лица необходимо проверить по всем перечням
//	ОшибкиСверки	 - Структура - (Необязательный, Выходной) В случае ошибок сверки возвращает структуру с описанием ошибок
//						(см. РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомЛицСЗамороженнымиСчетамиВMatrix) 
//	ОтчетОСверке	 - ТабличныйДокумент - (Необязательный, Выходной) Отчет о результатах сверки
//						Если указан табличный документ, то в него выводится отчет
// 
// Возвращаемое значение:
//	ТаблицаЗначений, Неопределено - таблица успешно прошедших проверку лиц, Неопределено - в случае ошибки
//									(см. возвращаемое значение РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомЛицСЗамороженнымиСчетамиВMatrix)
//
//
Функция ВыполнитьСверкуСоСпискомОтказников(Организация, ПроверяемыеЛица = Неопределено, ИдентификаторСписка = 0, ДатаСверки = Неопределено,  ОшибкиСверки = Неопределено, ОтчетОСверке = Неопределено, ДополнительныеСвойстваЗаписи = Неопределено) Экспорт
	
	Если ДатаСверки = Неопределено Тогда
		ДатаСверки = ТекущаяДата();
	КонецЕсли;
	
	ПроверенныеЛица = РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомОтказников(Организация, ДатаСверки, ПроверяемыеЛица, ИдентификаторСписка, ОшибкиСверки);
	
	Если ПроверенныеЛица <> Неопределено Тогда	
		ЗаписатьРезультатыСверкиВРегистр(ДатаСверки, Организация, Справочники.ВидыПеречнейОбъектов.СписокОтказников, ПроверенныеЛица, ДополнительныеСвойстваЗаписи);
		
		// Формируем отчет при необходимости
		Если ОтчетОСверке <> Неопределено Тогда
			СформироватьОтчетОСверкеСоСписком(ОтчетОСверке, ПроверенныеЛица, ОшибкиСверки, "Лица, имеющие совпадения со списоком лиц, которым отказано в операции с ДС, открытии или закрытии депозитного вклада");
		КонецЕсли;
		
	// Произошли ошибки
	Иначе
		ОтчетОСверке = Неопределено;	
	КонецЕсли;
	
	Возврат ПроверенныеЛица;
КонецФункции

Функция ПоказателиСверкиСоСпискомОтказников(ВидЮрФизЛица) Экспорт
	
	Показатели = Новый Массив;
	
	Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		Показатели.Добавить("Фамилия");
		Показатели.Добавить("Имя");
		Показатели.Добавить("Отчество");
		Показатели.Добавить("ДатаРождения");
		Показатели.Добавить("ИНН");
		Показатели.Добавить("СерияУдостоверенияЛичности");
		Показатели.Добавить("НомерУдостоверенияЛичности");
		
	ИначеЕсли ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		
		Показатели.Добавить("ПолноеНаименованиеПоУставу");
		Показатели.Добавить("КраткоеНаименованиеПоУставу");
		Показатели.Добавить("ИНН");
		Показатели.Добавить("ОГРН");
		Показатели.Добавить("TIN");
		
	КонецЕсли;
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти

#Область Сверка_со_списком_недействительных_паспортов

Функция ВыполнитьСверкуСоСпискомНедействительныхПаспортов(Организация, ПроверяемыеЛица = Неопределено, ОшибкиСверки = Неопределено, ОтчетОСверке = Неопределено, ДополнительныеСвойстваЗаписи = Неопределено) Экспорт
	
	ПроверенныеЛица = РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомНедействительныхПаспортов(Организация, ТекущаяДата(), ПроверяемыеЛица, ОшибкиСверки);
	
	Если ПроверенныеЛица <> Неопределено Тогда	
		// Обновляем данные
		ЗаписатьРезультатыСверкиВРегистр(НачалоДня(ТекущаяДата()), Организация, Справочники.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов, ПроверенныеЛица, ДополнительныеСвойстваЗаписи);
		
		// Формируем отчет при необходимости
		Если ОтчетОСверке <> Неопределено Тогда
			ОтчетОСверке = РезультатыСверкиСоСпискомНедействительныхПаспортов(Организация, Справочники.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов, НачалоДня(ТекущаяДата()), ПроверенныеЛица.ВыгрузитьКолонку("ЮрФизЛицо"));
		КонецЕсли;
		
	// Произошли ошибки
	Иначе
		ОтчетОСверке = Неопределено;	
	КонецЕсли;
	
	Возврат ПроверенныеЛица;
	
КонецФункции

Функция ПоказателиСверкиСоСпискомНедействительныхПаспортов(ВидЮрФизЛица) Экспорт
	
	Показатели = Новый Массив;
	
	Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		Показатели.Добавить("СерияУдостоверенияЛичности");
		Показатели.Добавить("НомерУдостоверенияЛичности");

	КонецЕсли;
	
	Возврат Показатели;
	
КонецФункции

Функция ВыполнитьСверкуСоСпискомНедействительныхПаспортовОтложенно(Организация, Субъект) Экспорт

	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ФормированиеДвиженийПоРегистрамБэкОфиса") Тогда
		
		Если ТипЗнч(Субъект) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
			ФизЛицо = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Субъект, ТекущаяДата());
		ИначеЕсли ТипЗнч(Субъект) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
			ФизЛицо = Субъект;
		Иначе
			ВызватьИсключение "Параметр 'Субъект' может быть либо счетом доверительного управления, либо юр./физ. лицом";
		КонецЕсли;
		
		Если ФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
			Параметры = Новый Структура;
			
			Параметры.Вставить("Организация",	Организация);
			Параметры.Вставить("ЮрФизЛицо",		ФизЛицо);
			
			РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание("РегистрыСведений.ЖурналСверкиСоСписками", "ВыполнитьСверкуСоСпискомНедействительныхПаспортов", Параметры, 15, Истина);
		
		КонецЕсли; 
		
	КонецЕсли;

КонецФункции 

Процедура ПроверитьРезультатОтложеннойСверкиСоСпискомНедействительныхПаспортов(Организация, Субъект, ДатаАктуальности, ДатаЗапускаСверки, Отказ) Экспорт

	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ФормированиеДвиженийПоРегистрамБэкОфиса") Тогда
		
		Если ТипЗнч(Субъект) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
			ФизЛицо = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Субъект, ТекущаяДата());
		ИначеЕсли ТипЗнч(Субъект) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
			ФизЛицо = Субъект;
		Иначе
			ВызватьИсключение "Параметр 'Субъект' может быть либо счетом доверительного управления, либо юр./физ. лицом";
		КонецЕсли;  		
		
		Если ФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
			ТекстЗапроса = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЖурналСверкиСоСпискамиСрезПоследних.Период КАК Период,
				|	ЖурналСверкиСоСпискамиСрезПоследних.Пройдена КАК Пройдена
				|ИЗ
				|	РегистрСведений.ЖурналСверкиСоСписками.СрезПоследних(
				|			&ДатаАктуальности,
				|			Организация = &Организация
				|				И ВидПеречня = &ВидПеречня
				|				И ЮрФизЛицо = &ЮрФизЛицо) КАК ЖурналСверкиСоСпискамиСрезПоследних
				|ГДЕ
				|	ЖурналСверкиСоСпискамиСрезПоследних.Пройдена
				|	И ЖурналСверкиСоСпискамиСрезПоследних.Период >= &ДатаЗапускаСверки";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("ДатаАктуальности", 	ДатаАктуальности);
			Запрос.УстановитьПараметр("ДатаЗапускаСверки", 	ДатаЗапускаСверки);
			Запрос.УстановитьПараметр("Организация", 		Организация);
			Запрос.УстановитьПараметр("ВидПеречня", 		Справочники.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов);
			Запрос.УстановитьПараметр("ЮрФизЛицо", 			ФизЛицо);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				
				ТекстСообщения = СтрШаблон("Паспорт физического лица '%1' недействителен. Необходимо обновить данные физического лица", ФизЛицо);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
			
			КонецЕсли; 
		
		КонецЕсли;
	
	КонецЕсли; 

КонецПроцедуры 

#КонецОбласти

#Область Сверка_со_списком_дисквалифицированных_лиц

Функция ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц(Организация, ПроверяемыеЛица = Неопределено, ДатаСверки = Неопределено,  ОшибкиСверки = Неопределено, ОтчетОСверке = Неопределено, ДополнительныеСвойстваЗаписи = Неопределено) Экспорт
	
	Если ДатаСверки = Неопределено Тогда
		ДатаСверки = ТекущаяДата();
	КонецЕсли;
	
	ПроверенныеЛица = РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомДисквалифицированныхЛиц(Организация, ДатаСверки, ПроверяемыеЛица);
	
	Если ПроверенныеЛица <> Неопределено Тогда	
		// Обновляем данные
		ЗаписатьРезультатыСверкиВРегистр(ДатаСверки, Организация, Справочники.ВидыПеречнейОбъектов.СписокДисквалифицированныхЛиц, ПроверенныеЛица, ДополнительныеСвойстваЗаписи);
		
		// Формируем отчет при необходимости
		Если ОтчетОСверке <> Неопределено Тогда
			ОтчетОСверке = РезультатыСверкиСоСпискомДисквалифицированныхЛиц(Организация, Справочники.ВидыПеречнейОбъектов.СписокДисквалифицированныхЛиц, НачалоДня(ТекущаяДата()), ПроверенныеЛица.ВыгрузитьКолонку("ЮрФизЛицо")); 
		КонецЕсли;
		
	// Произошли ошибки
	Иначе
		ОтчетОСверке = Неопределено;	
	КонецЕсли;
	
	Возврат ПроверенныеЛица;
	
КонецФункции

Функция ПоказателиСверкиСоСпискомДисквалифицированныхЛиц(ВидЮрФизЛица) Экспорт
	
	Показатели = Новый Массив;
	
	Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		Показатели.Добавить("Фамилия");
		Показатели.Добавить("Имя");
		Показатели.Добавить("Отчество");

	КонецЕсли;
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти

#Область Сверка_с_произвольным_списком

// Функция - Выполняет сверку юр./физ. лиц со списком отказников
// Результат сверки фиксируется в журнале
// 
// Параметры:
//	ПроверяемыеЛица	 - Массив - (Необязательный) Содержит массив проверяемых юр./физ. лиц
//	ОшибкиСверки	 - Структура - (Необязательный, Выходной) В случае ошибок сверки возвращает структуру с описанием ошибок
//						(см. РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомЛицСЗамороженнымиСчетамиВMatrix) 
//	ОтчетОСверке	 - ТабличныйДокумент - (Необязательный, Выходной) Отчет о результатах сверки
//						Если указан табличный документ, то в него выводится отчет
// 
// Возвращаемое значение:
//	ТаблицаЗначений, Неопределено - таблица успешно прошедших проверку лиц, Неопределено - в случае ошибки
//									(см. возвращаемое значение РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиСоСпискомЛицСЗамороженнымиСчетамиВMatrix)
//
//
Функция ВыполнитьСверкуСоСписком(Организация, ПроверяемыеЛица = Неопределено, ОшибкиСверки = Неопределено, ОтчетОСверке = Неопределено, ВидСписка, ДополнительныеСвойстваЗаписи = Неопределено) Экспорт
	
	ПараметрыСписка = ПолучитьПараметрыСписка(ВидСписка);
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(Организация, ВидСписка, ПроверяемыеЛица);
	Механизм = "РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСписком()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПроверенныеЛица = РаботаСВнешнимиСистемами.ПолучитьРезультатСверкиССанкционнымСписком(Организация, ТекущаяДата(), ПараметрыСписка.КодСписка, ПараметрыСписка.ПредставлениеСписка, ПроверяемыеЛица, ОшибкиСверки);
	
	Если ПроверенныеЛица <> Неопределено Тогда	
		ЗаписатьРезультатыСверкиВРегистр(НачалоДня(ТекущаяДата()), Организация, ВидСписка, ПроверенныеЛица, ДополнительныеСвойстваЗаписи);
		
		// Формируем отчет при необходимости
		Если ОтчетОСверке <> Неопределено Тогда
			СформироватьОтчетОСверкеСоСписком(ОтчетОСверке, ПроверенныеЛица, ОшибкиСверки, ПараметрыСписка.ЗаголовокОтчета);		
		КонецЕсли;
		
	// Произошли ошибки
	Иначе
		ОтчетОСверке = Неопределено;	
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат ПроверенныеЛица;
	
КонецФункции

Функция СформироватьОтчетОСверкеСоСписком(ТаблДок, ПроверенныеЛица, ОшибкиСверки, ЗаголовокОтчета)
	// Параметры макета
	Макет = РегистрыСведений.ЖурналСверкиСоСписками.ПолучитьМакет("МакетОтчета");
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(,, Макет, ТаблДок);
	// Найденные совпадения
	НайденныеСовпадения = ПроверенныеЛица.НайтиСтроки(Новый Структура("Пройдена", Ложь));
	Если НайденныеСовпадения.Количество() > 0 Тогда
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода,
			НайденныеСовпадения,
			Новый Структура("НомерСтроки, ЮрФизЛицо, Комментарий", "№ п/п", "Юр. / физ. лицо", "Комментарий"),
			ЗаголовокОтчета
		);
	КонецЕсли;

	// Непроверенные лица
	НеПроверенныеЛица = Неопределено;
	Если ОшибкиСверки <> Неопределено И ОшибкиСверки.Свойство("НеПроверенныеЛица", НеПроверенныеЛица) Тогда
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода,
			НеПроверенныеЛица,
			Новый Структура("НомерСтроки, Ссылка, Комментарий", "№ п/п", "Юр. / физ. лицо", "Комментарий"),
			"Непроверенные лица"
		);
	КонецЕсли;
	
	// Успешно прошедшие проверки
	ПрошедшиеПроверку = ПроверенныеЛица.НайтиСтроки(Новый Структура("Пройдена", Истина));
	Если ПрошедшиеПроверку.Количество() > 0 Тогда
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыВывода,
			ПрошедшиеПроверку,
			Новый Структура("НомерСтроки, ЮрФизЛицо, Комментарий", "№ п/п", "Юр. / физ. лицо", "Комментарий"),
			"Лица, прошедшие проверку"
		);
	КонецЕсли;	
	
	// Автоширина колонок
	РаботаСОтчетами.ПодобратьШиринуКолонокТаблицыОтчета(ТаблДок, 1, 2, ТаблДок.ВысотаТаблицы, ТаблДок.ШиринаТаблицы, 60);
	
	// Заполняем настройки печати по умочанию
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ТаблДок, "РезультатСверкиСоСписком", Истина, ОриентацияСтраницы.Портрет);	
	
	Возврат ТаблДок;
	
КонецФункции

Функция ПолучитьПараметрыСписка(ВидСписка) Экспорт

	СтруктураПараметров = Новый Структура;
	Если ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокОтказников Тогда
		СтруктураПараметров.Вставить("КодСписка", 6);
		СтруктураПараметров.Вставить("ЗаголовокОтчета", "Результат сверки со списком лиц, которым отказано в операции с ДС, открытии или закрытии депозитного вклада");
		СтруктураПараметров.Вставить("ПредставлениеСписка", "Список отказников от ");
		
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокРешенийМВК Тогда
		СтруктураПараметров.Вставить("КодСписка", 8);
		СтруктураПараметров.Вставить("ЗаголовокОтчета", "Лица, имеющие совпадения со списком лиц, в отношении которых приняты решения МВК");
		СтруктураПараметров.Вставить("ПредставлениеСписка", "Решение МВК от ");
		
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокФРОМУ Тогда
		СтруктураПараметров.Вставить("КодСписка", 9);
		СтруктураПараметров.Вставить("ЗаголовокОтчета", "Лица, имеющие совпадения со списком лиц, причастных к распространению ОМУ");
		СтруктураПараметров.Вставить("ПредставлениеСписка", "Перечень ФРОМУ от ");
		
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокТеррористов Тогда
		СтруктураПараметров.Вставить("КодСписка", 10);
		СтруктураПараметров.Вставить("ЗаголовокОтчета", "Лица, имеющие совпадения со списком террористов");
		СтруктураПараметров.Вставить("ПредставлениеСписка", "Список террористов от ");
		
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СанкционныйСписок Тогда
		СтруктураПараметров.Вставить("КодСписка", 7);
		СтруктураПараметров.Вставить("ЗаголовокОтчета", "Лица, имеющие совпадения со списком лиц, в отношении которых вводятся специальные экономические меры");
		СтруктураПараметров.Вставить("ПредставлениеСписка", "Санкционный список от ");
		
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СводныйПереченьСоветаБезопасностиООН Тогда
		СтруктураПараметров.Вставить("КодСписка", 32);
		СтруктураПараметров.Вставить("ЗаголовокОтчета", "Лица, имеющие совпадения со сводным перечнем Совета Безопасности ООН");
		СтруктураПараметров.Вставить("ПредставлениеСписка", "Сводный перечень СБ ООН от ");
		
	ИначеЕсли ВидСписка = Справочники.ВидыПеречнейОбъектов.СанкционныйСписокНедружественныхГосударств Тогда
		СтруктураПараметров.Вставить("КодСписка", 41);
		СтруктураПараметров.Вставить("ЗаголовокОтчета", "Лица, имеющие совпадения с санкционным списком недружественных государств");
		СтруктураПараметров.Вставить("ПредставлениеСписка", "Санкционный список недружественных государств от ");
		
	КонецЕсли; 
	
	Возврат СтруктураПараметров;

КонецФункции
 
Функция ПоказателиСверкиСоСпискомОбщие(ВидЮрФизЛица) Экспорт
	
	Показатели = Новый Массив;
	
	Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		Показатели.Добавить("Фамилия");
		Показатели.Добавить("Имя");
		Показатели.Добавить("Отчество");
		Показатели.Добавить("ДатаРождения");
		
	ИначеЕсли ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		
		Показатели.Добавить("ПолноеНаименованиеПоУставу");
		Показатели.Добавить("КраткоеНаименованиеПоУставу");
		Показатели.Добавить("ИНН");
		Показатели.Добавить("TIN");
		
	КонецЕсли;
	
	Возврат Показатели;
	
КонецФункции

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(Организация, ВидСписка, ПроверяемыеЛица)
	
	СтрСохраняемыеДанные = "Организация,ВидСписка,ПроверяемыеЛица";
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные, Организация, ВидСписка, ПроверяемыеЛица);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции

Функция ПолучитьСписокДляСверки(Дата)
	//В Externals c 01.12.2022 доступен перечень совета безапасности ООН.
	//Перечень совбеза ООН пришел на смену списку ФРОМУ, который не обновляется с 15.09.2022 
	Возврат ?(Дата > Дата(2022,12,01), Справочники.ВидыПеречнейОбъектов.СводныйПереченьСоветаБезопасностиООН, Справочники.ВидыПеречнейОбъектов.СписокФРОМУ);		
		
КонецФункции

Процедура ВыполнитьПроверкиЮрФизЛицаПриПроведенииАнкеты(Дата, Организация, ЮрФизЛицо, ДопСвойстваАнкеты) Экспорт
	
	Если ДопСвойстваАнкеты.Свойство("СверитьССанкционнымСписком") Тогда
		ВыполнитьСверкуСоСписком(Организация, ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СанкционныйСписок, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЮрФизЛицо));
	КонецЕсли;
	
	Если ДопСвойстваАнкеты.Свойство("СверитьСоСпискомОтказников") Тогда
		ВыполнитьСверкуСоСпискомОтказников(Организация, ЮрФизЛицо,, Дата,,, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты, ДатаПоследнейСверки", ЮрФизЛицо, Дата));
	КонецЕсли;
	
	Если ДопСвойстваАнкеты.Свойство("СверитьСоСпискомТеррористов") Тогда
		ВыполнитьСверкуСоСписком(Организация, ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СписокТеррористов, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЮрФизЛицо));
	КонецЕсли;
	
	Если ДопСвойстваАнкеты.Свойство("СверитьСоСпискомРешенийМВК") Тогда
		ВыполнитьСверкуСоСписком(Организация, ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СписокРешенийМВК, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЮрФизЛицо));
	КонецЕсли;
		
	Если ДопСвойстваАнкеты.Свойство("СверитьССанкционнымСпискомНедружественныхГосударств") Тогда
		ВыполнитьСверкуСоСписком(Организация, ЮрФизЛицо,,, Справочники.ВидыПеречнейОбъектов.СанкционныйСписокНедружественныхГосударств, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЮрФизЛицо));
	КонецЕсли; 
		
	Если ДопСвойстваАнкеты.Свойство("СверитьСоСпискомНедействительныхПаспортов") Тогда
		СверитьПоСМЭВ(Организация, ЮрФизЛицо);
	КонецЕсли;
			
	Если ДопСвойстваАнкеты.Свойство("СверитьСоСпискомДисквалифицированныхЛиц") Тогда
		ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц(Организация, ЮрФизЛицо, Дата,,, Новый Структура("ЮрФизЛицоПриИзмененииАнкеты, ДатаПоследнейСверки", ЮрФизЛицо, Дата));
	КонецЕсли;
	
	Если ДопСвойстваАнкеты.Свойство("СверитьСоСводнымПеречнемСоветаБезопасностиООН") Тогда
		ВыполнитьСверкуСоСписком(Организация, ЮрФизЛицо,,, ПолучитьСписокДляСверки(Дата), Новый Структура("ЮрФизЛицоПриИзмененииАнкеты", ЮрФизЛицо));	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
	
	Если Метод = "ВыполнитьСверкуСоСпискомНедействительныхПаспортов" Тогда
		
		Для Каждого ТекЭкземпляр Из Экземпляры Цикл
			
			ВыполнитьСверкуСоСпискомНедействительныхПаспортов(ТекЭкземпляр.Параметры.Организация, ТекЭкземпляр.Параметры.ЮрФизЛицо,,, Новый Структура("ПриПорученииНаВывод", ТекЭкземпляр.Параметры.ЮрФизЛицо));
			РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(ТекЭкземпляр.Идентификатор);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьРезультатыСверкиВРегистр(Период, Организация, ВидПеречня, ПроверенныеЛица, ДополнительныеСвойстваЗаписи)
	
	Если ДополнительныеСвойстваЗаписи = Неопределено Тогда
		ДополнительныеСвойстваЗаписи = Новый Структура;
	КонецЕсли;
	
	ДатаПоследнейСверки = Неопределено; 
	
	Если НЕ ДополнительныеСвойстваЗаписи.Свойство("ДатаПоследнейСверки", ДатаПоследнейСверки) Тогда
		ДатаПоследнейСверки = ТекущаяДата();
	КонецЕсли;
	
	ОбщиеПараметрыЗаписи = Новый Структура("ВидПеречня, ДатаПоследнейСверки, Ответственный, Период", ВидПеречня, ДатаПоследнейСверки, РаботаСПользователями.ТекущийПользователь(), Период);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ЖурналСверкиСоСписками.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.ВидПеречня.Установить(ВидПеречня);
	
	ЮрФизЛицо = Неопределено;
	
	Если ДополнительныеСвойстваЗаписи.Свойство("ЮрФизЛицоПриИзмененииАнкеты", ЮрФизЛицо) 
		Или ДополнительныеСвойстваЗаписи.Свойство("ДолжностноеЛицо", ЮрФизЛицо)
		Или ДополнительныеСвойстваЗаписи.Свойство("ПриПорученииНаВывод", ЮрФизЛицо) Тогда
		
		НаборЗаписей.Отбор.ЮрФизЛицо.Установить(ЮрФизЛицо);
		
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	ТекущийНабор = НаборЗаписей.Выгрузить();
	
	Для Каждого НоваяЗапись Из ПроверенныеЛица Цикл
		
		ЗаписьВЖурналСверки = ТекущийНабор.Найти(НоваяЗапись.ЮрФизЛицо, "ЮрФизЛицо");
		
		Если ЗаписьВЖурналСверки = Неопределено Тогда
			ЗаписьВЖурналСверки = ТекущийНабор.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЗаписьВЖурналСверки, НоваяЗапись); 
		ЗаполнитьЗначенияСвойств(ЗаписьВЖурналСверки, ОбщиеПараметрыЗаписи); 
		
	КонецЦикла;
	
	Если ДополнительныеСвойстваЗаписи <> Неопределено Тогда  
		
		Для Каждого СвойствоЗаписи Из ДополнительныеСвойстваЗаписи Цикл
			НаборЗаписей.ДополнительныеСвойства.Вставить(СвойствоЗаписи.Ключ, СвойствоЗаписи.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	НаборЗаписей.Загрузить(ТекущийНабор);
	НаборЗаписей.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

Функция СформироватьОтчет(Организация, ВидПеречня, ЗаголовокОтчета = Неопределено) Экспорт
	
	
	Если ВидПеречня = Справочники.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов Тогда
		ДокументРезультат = РезультатыСверкиСоСпискомНедействительныхПаспортов(Организация, ВидПеречня);
		
	ИначеЕсли ВидПеречня = Справочники.ВидыПеречнейОбъектов.СМЭВ Тогда
		ДокументРезультат = РезультатыСверкиПоСМЭВНедействительныеПаспорта(Организация);
		
	ИначеЕсли ВидПеречня = Справочники.ВидыПеречнейОбъектов.СписокДисквалифицированныхЛиц Тогда
		ДокументРезультат = РезультатыСверкиСоСпискомДисквалифицированныхЛиц(Организация, ВидПеречня);
		
	Иначе
	
		СхемаКомпоновкиДанных = ПолучитьМакет("ОтчетПоКлиентам");
		
		НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Организация);
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидПеречня", ВидПеречня);
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата", КонецДня(ТекущаяДата()));
		
		Если ЗначениеЗаполнено(ЗаголовокОтчета) Тогда
			НастройкиКомпоновки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ЗаголовокОтчета);
		КонецЕсли;

		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
		
		ДокументРезультат = Новый ТабличныйДокумент;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	КонецЕсли;
	
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	// Заполняем настройки печати по умочанию
	КлючПараметровПечати = "КлиентыСверенныеСоСписком" + ИмяКлючаПараметровПечати(ВидПеречня);
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, КлючПараметровПечати, Истина, ОриентацияСтраницы.Портрет);		
	
	Возврат ДокументРезультат;	
КонецФункции

Функция ИмяКлючаПараметровПечати(ВидПеречня) Экспорт
	
	Если ВидПеречня = Справочники.ВидыПеречнейОбъектов.СМЭВ Тогда
		Возврат "SMEV";
	КонецЕсли;
	
	Если ВидПеречня.Предопределенный Тогда
		Возврат ВидПеречня.ИмяПредопределенныхДанных;
	КонецЕсли;
	
	Возврат ВидПеречня.Код;
	
КонецФункции

Функция РезультатыСверкиСоСпискомНедействительныхПаспортов(Организация, ВидПеречня, Период = Неопределено, ПроверенныеЛица = Неопределено, СтатусыСверки = Неопределено) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ФиксацияСверху = 7;
	
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	Запрос = Новый Запрос;
	
	Справочники.ЮрФизЛица.ПоместитьКлиентовВМенеджерВременныхТаблиц(Запрос, Организация, ?(Период = Неопределено, КонецДня(ТекущаяДата()), КонецДня(Период)));
	
	#Область ТекстЗапроса	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена = ЛОЖЬ
		|			ТОГДА 1
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена ЕСТЬ NULL
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПорядокСтатусаПроверки,
		|	ВЫБОР
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена = ЛОЖЬ
		|			ТОГДА ""Паспорт недействителен""
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена ЕСТЬ NULL
		|			ТОГДА ""Проверка не проводилась""
		|		ИНАЧЕ ""Паспорт действителен""
		|	КОНЕЦ КАК ПаспортДействителен,
		|	ЖурналСверкиСоСпискамиСрезПоследних.Пройдена КАК Пройдена,
		|	ЖурналСверкиСоСпискамиСрезПоследних.ДатаПоследнейСверки КАК ДатаПоследнейСверки,
		|	ЖурналСверкиСоСпискамиСрезПоследних.Комментарий КАК Комментарий,
		|	ЖурналСверкиСоСпискамиСрезПоследних.Ответственный КАК Ответственный,
		|	ЖурналСверкиСоСпискамиСрезПоследних.РеквизитыСверки КАК РеквизитыСверки,
		|	ЮрФизЛица.Наименование КАК Наименование,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _Клиенты.ЮрФизЛицо = ЮрФизЛица.Ссылка
		|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСверкиСоСписками.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ВидПеречня = &ВидПеречня
		|					И &ПроверкаНаТекущуюДату) КАК ЖурналСверкиСоСпискамиСрезПоследних
		|		ПО _Клиенты.ЮрФизЛицо = ЖурналСверкиСоСпискамиСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _Клиенты.ЮрФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	&СтатусыСверки
		|	И &ФильтрПроверенныхЛиц
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСтатусаПроверки,
		|	Наименование
		|ИТОГИ ПО
		|	ПорядокСтатусаПроверки";
#КонецОбласти

	Запрос.УстановитьПараметр("Организация"				, Организация);
	Запрос.УстановитьПараметр("ВидПеречня"				, ВидПеречня);
	
	Если Период = Неопределено Тогда
		Запрос.УстановитьПараметр("ПроверкаНаТекущуюДату"	, Истина);
		Запрос.УстановитьПараметр("Период"					, КонецДня(ТекущаяДата()));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст	, "&ПроверкаНаТекущуюДату", "Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)");
		Запрос.УстановитьПараметр("Период", КонецДня(Период));
	КонецЕсли;
	
	Если СтатусыСверки = Неопределено Тогда
		Запрос.УстановитьПараметр("СтатусыСверки", Истина);
	Иначе
		Запрос.УстановитьПараметр("СтатусыСверки", СтатусыСверки);
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"&СтатусыСверки",	
			"	ВЫБОР
			|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена = ЛОЖЬ
			|			ТОГДА 1
			|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена ЕСТЬ NULL
			|			ТОГДА 2
			|		ИНАЧЕ 3
			|	КОНЕЦ В (&СтатусыСверки)");
	КонецЕсли;
	
	Если ПроверенныеЛица = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПроверенныхЛиц", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("ПроверенныеЛица",	ПроверенныеЛица);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПроверенныхЛиц", "ЮрФизЛица.Ссылка В (&ПроверенныеЛица)");
	КонецЕсли;	
	
	Макет = РегистрыСведений.ЖурналСверкиСоСписками.ПолучитьМакет("МакетСверкиСоСпискомНедействительныхПаспортов");
	
	ПараметрыОтчета = Новый Массив;
	ПараметрыОтчета.Добавить("Организация: " + Организация);
	ПараметрыОтчета.Добавить("Вид перечня: " + ВидПеречня);
	ПараметрыОтчета.Добавить("Период: " 	 + Формат(Запрос.Параметры.Период, "ДФ=dd.MM.yyyy"));
	
	Если ПроверенныеЛица <> Неопределено Тогда
		ПараметрыОтчета.Добавить("Проверяемые лица: " + СтрСоединить(ПроверенныеЛица, ", "));
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПараметрыОтчета	= СтрСоединить(ПараметрыОтчета, Символы.ПС);
		
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ДокументРезультат.Вывести(Макет.ПолучитьОбласть("Статус" + Выборка.ПорядокСтатусаПроверки));
		ДокументРезультат.НачатьГруппуСтрок();
		
		ОбластьСтрока.Параметры.НП = 0;
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаДетальныеЗаписи);
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РеквизитыСверки) Тогда
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаДетальныеЗаписи.РеквизитыСверки.Получить());
			КонецЕсли;
			ОбластьСтрока.Параметры.НП = ОбластьСтрока.Параметры.НП + 1;
			
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ДокументРезультат.ЗакончитьГруппуСтрок();
	
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция РезультатыСверкиПоСМЭВНедействительныеПаспорта(Организация, Период = Неопределено) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ФиксацияСверху		= 6;
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	ПериодОтчета = КонецДня(?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	
	Запрос = Новый Запрос;
	Справочники.ЮрФизЛица.ПоместитьКлиентовВМенеджерВременныхТаблиц(Запрос, Организация, ПериодОтчета);
	
	#Область ТекстЗапроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	ЖурналСверкиСоСпискамиСрезПоследних.ДатаПоследнейСверки КАК ДатаПоследнейСверки,
		|	ВЫБОР
		|		КОГДА ПервыеВыявления.ПервыйПериод < ЖурналСверкиСоСпискамиСрезПоследних.Период
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПорядокГруппы
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _Клиенты.ЮрФизЛицо = ЮрФизЛица.Ссылка
		|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСверкиСоСписками.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СМЭВ)) КАК ЖурналСверкиСоСпискамиСрезПоследних
		|		ПО _Клиенты.ЮрФизЛицо = ЖурналСверкиСоСпискамиСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _Клиенты.ЮрФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЖурналСверкиСоСписками.ЮрФизЛицо КАК ЮрФизЛицо,
		|			МИНИМУМ(ЖурналСверкиСоСписками.Период) КАК ПервыйПериод
		|		ИЗ
		|			РегистрСведений.ЖурналСверкиСоСписками КАК ЖурналСверкиСоСписками
		|		ГДЕ
		|			ЖурналСверкиСоСписками.Организация = &Организация
		|			И (ЖурналСверкиСоСписками.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СМЭВ)
		|						И ЖурналСверкиСоСписками.Статус = ""INVALID""
		|					ИЛИ ЖурналСверкиСоСписками.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов)
		|						И ЖурналСверкиСоСписками.Пройдена = ЛОЖЬ)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЖурналСверкиСоСписками.ЮрФизЛицо) КАК ПервыеВыявления
		|		ПО _Клиенты.ЮрФизЛицо = ПервыеВыявления.ЮрФизЛицо
		|ГДЕ
		|	ЖурналСверкиСоСпискамиСрезПоследних.Статус = ""INVALID""
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокГруппы,
		|	Фамилия,
		|	Имя,
		|	Отчество";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Период",			ПериодОтчета);
	
	Макет = ПолучитьМакет("МакетСверкиПоСМЭВНедействительныеПаспорта");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПараметрыОтчета = СтрШаблон(
		НСтр("ru = 'Организация: %1
			|Источник сведений: СМЭВ
			|Период: %2'"),
		Организация,
		Формат(ПериодОтчета, "ДФ=dd.MM.yyyy"));
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.СостояниеПаспорта	= НСтр("ru = 'Паспорт недействителен'");
	ОбластьСтрока.Параметры.ИсточникСведений	= НСтр("ru = 'СМЭВ'");
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	НомерСтроки = 0;
	
	Для НомерГруппы = 1 По 2 Цикл
		
		ДокументРезультат.Вывести(Макет.ПолучитьОбласть("Статус" + НомерГруппы));
		
		Для Каждого СтрокаРезультата Из ТаблицаРезультата.НайтиСтроки(Новый Структура("ПорядокГруппы", НомерГруппы)) Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаРезультата);
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрока.Параметры.НП = НомерСтроки;
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция РезультатыСверкиСоСпискомДисквалифицированныхЛиц(Организация, ВидПеречня, ЗНАЧ Период = Неопределено, ПроверенныеЛица = Неопределено, СтатусыСверки = Неопределено, ВыводитьПустойОтчет = Истина) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ФиксацияСверху = 7;
	
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТекстЗапроса	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДолжностныеЛица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена = ЛОЖЬ
		|			ТОГДА 1
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена ЕСТЬ NULL
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПорядокСтатусаПроверки,
		|	ВЫБОР
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена = ЛОЖЬ
		|			ТОГДА ""Обнаружено совпадение со списком""
		|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена ЕСТЬ NULL
		|			ТОГДА ""Проверка не проводилась""
		|		ИНАЧЕ ""Лицо не входит в список""
		|	КОНЕЦ КАК РезультатСверки,
		|	ЖурналСверкиСоСпискамиСрезПоследних.Пройдена КАК Пройдена,
		|	ЖурналСверкиСоСпискамиСрезПоследних.ДатаПоследнейСверки КАК ДатаПоследнейСверки,
		|	ЖурналСверкиСоСпискамиСрезПоследних.Комментарий КАК Комментарий,
		|	ЖурналСверкиСоСпискамиСрезПоследних.Ответственный КАК Ответственный,
		|	ЖурналСверкиСоСпискамиСрезПоследних.РеквизитыСверки КАК РеквизитыСверки,
		|	ЮрФизЛица.Наименование КАК Наименование,
		|	_ДолжностныеЛица.Фамилия КАК Фамилия,
		|	_ДолжностныеЛица.Имя КАК Имя,
		|	_ДолжностныеЛица.Отчество КАК Отчество,
		|	_ДолжностныеЛица.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	_ДолжностныеЛица КАК _ДолжностныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСверкиСоСписками.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ВидПеречня = &ВидПеречня
		|					И &ПроверкаНаТекущуюДату) КАК ЖурналСверкиСоСпискамиСрезПоследних
		|		ПО _ДолжностныеЛица.ЮрФизЛицо = ЖурналСверкиСоСпискамиСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _ДолжностныеЛица.ЮрФизЛицо = ЮрФизЛица.Ссылка
		|ГДЕ
		|	&СтатусыСверки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСтатусаПроверки,
		|	Наименование
		|ИТОГИ ПО
		|	ПорядокСтатусаПроверки";
#КонецОбласти

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидПеречня" , ВидПеречня);
	
	Если Период = Неопределено Тогда
		Запрос.УстановитьПараметр("ПроверкаНаТекущуюДату",	Истина);
		Запрос.УстановитьПараметр("Период",					КонецДня(ТекущаяДата()));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст	,	 "&ПроверкаНаТекущуюДату", "Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)");
		Запрос.УстановитьПараметр("Период",			 КонецДня(Период));
	КонецЕсли;
	
	РегистрыСведений.ВнутренниеПеречни.ЗаполнитьДолжностныеЛица(Запрос.МенеджерВременныхТаблиц, Организация, Запрос.Параметры.Период, ПроверенныеЛица);
	
	Если СтатусыСверки = Неопределено Тогда
		Запрос.УстановитьПараметр("СтатусыСверки", Истина);
	Иначе
		Запрос.УстановитьПараметр("СтатусыСверки", СтатусыСверки);
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"&СтатусыСверки",	
			"	ВЫБОР
			|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена = ЛОЖЬ
			|			ТОГДА 1
			|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена ЕСТЬ NULL
			|			ТОГДА 2
			|		ИНАЧЕ 3
			|	КОНЕЦ В (&СтатусыСверки)");
	КонецЕсли;
	
	Макет = РегистрыСведений.ЖурналСверкиСоСписками.ПолучитьМакет("МакетСверкиСоСпискомДисквалифицированныхЛиц");
	
	ПараметрыОтчета = Новый Массив;
	ПараметрыОтчета.Добавить("Организация: " + Организация);
	ПараметрыОтчета.Добавить("Вид перечня: " + ВидПеречня);
	ПараметрыОтчета.Добавить("Период: " 	 + Формат(Запрос.Параметры.Период, "ДФ=dd.MM.yyyy"));
	
	Запрос.УстановитьПараметр("ПроверенныеЛица",	  ПроверенныеЛица);
	Запрос.УстановитьПараметр("ОтборПроверенныеЛица", ПроверенныеЛица <> Неопределено);
	
	Если ПроверенныеЛица <> Неопределено Тогда
		ПараметрыОтчета.Добавить("Проверяемые лица: " + СтрСоединить(ПроверенныеЛица, ", "));
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПараметрыОтчета	= СтрСоединить(ПараметрыОтчета, Символы.ПС);
		
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не ВыводитьПустойОтчет И РезультатЗапроса.Пустой() Тогда
		Возврат ДокументРезультат;
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ДокументРезультат.Вывести(Макет.ПолучитьОбласть("Статус" + Выборка.ПорядокСтатусаПроверки));
		ДокументРезультат.НачатьГруппуСтрок();
		
		ОбластьСтрока.Параметры.НП = 0;
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаДетальныеЗаписи);
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РеквизитыСверки) Тогда
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаДетальныеЗаписи.РеквизитыСверки.Получить());
			КонецЕсли;
			ОбластьСтрока.Параметры.НП = ОбластьСтрока.Параметры.НП + 1;
			
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ДокументРезультат.ЗакончитьГруппуСтрок();
	
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") И Параметры.Ключ.ВидПеречня = Справочники.ВидыПеречнейОбъектов.СМЭВ Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаЗаписиСМЭВ";
	КонецЕсли; 
	
КонецПроцедуры

#Область Взаимодействие_со_СМЭВ

#Область Работа_с_сервисом

Функция ВыполнитьЗапросКСМЭВ(ТелоЗапроса)
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("СоединениеHTTP",	СоединениеHTTP());
	ПараметрыПодключения.Вставить("ЗаголовкиHTTP",	ЗаголовкиHTTP());
		
	ТекстСообщения = "Ошибка выполнения запроса к СМЭВ";
	ТекстЗапроса =  "/regulated-query?async=false";
	
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса, ТелоЗапроса, ТекстСообщения);
		
	ИдентификаторПакета = "";
	Если HTTPОтвет.КодСостояния = 200 Тогда
		
		// ответ получен
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
		Результат = ПрочитатьJSON(ЧтениеJSON);
		
		Результат.Свойство("query_id", ИдентификаторПакета);
		Результат.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
		
	Иначе
		
		// ошибка при выполнении запроса, возвращаем данные по ошибке
		Результат = Новый Структура;
		Результат.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
		Результат.Вставить("Тело", HTTPОтвет.ПолучитьТелоКакСтроку());
		
	КонецЕсли;
		
	Возврат Результат;

КонецФункции
 
Функция ПараметрыПодключения()

	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("АдресСервера", 	"172.16.65.37");
	ПараметрыПодключения.Вставить("Порт", 			8192);
		
	Возврат ПараметрыПодключения;

КонецФункции

Функция СоединениеHTTP()

	ПараметрыПодключения = ПараметрыПодключения();
	HTTPСоединение	= Новый HTTPСоединение(ПараметрыПодключения.АдресСервера, ПараметрыПодключения.Порт);
	
	Возврат HTTPСоединение;

КонецФункции

Функция ЗаголовкиHTTP()

	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Accept-Version", "1");
			
	Возврат ЗаголовкиHTTP;

КонецФункции

#КонецОбласти   

#Область Экспортные_процедуры_и_функции

Функция СверитьПоСМЭВ(Организация, ФизЛицо = Неопределено) Экспорт

	МассивДанных = ПолучитьМассивДанныхДляПроверки(Организация, ФизЛицо);
	ОписаниеОшибки = "";
	
	Для каждого ПроверяемыеДанные Из МассивДанных Цикл
	    
		Результат = ВыполнитьЗапросКСМЭВ(ПроверяемыеДанные.ТелоHTTPЗапроса);
		
		ИдентификаторПакета = "";
		
		Запись = РегистрыСведений.ЖурналСверкиСоСписками.СоздатьМенеджерЗаписи();
		Запись.Организация			= Организация;
		Запись.ЮрФизЛицо 			= ПроверяемыеДанные.ФизическоеЛицо;
		Запись.ВидПеречня 			= Справочники.ВидыПеречнейОбъектов.СМЭВ;
		Запись.Период 				= ТекущаяДатаСеанса();
		Запись.ДатаПоследнейСверки 	= ТекущаяДатаСеанса();
		Запись.Ответственный 		= РаботаСПользователями.ТекущийПользователь();
		
		Результат.Свойство("query_id", ИдентификаторПакета);
		
		Если Результат.КодСостояния = 200 Тогда
			Запись.ИдентификаторПакета 	= ИдентификаторПакета;
			Запись.Пройдена 			= Истина;
						
			Если Результат.rows[0].Количество() > 0 Тогда
				Запись.Статус				= ?(Результат.rows[0][0] = "Действительный", "VALID", "INVALID");
				Запись.Комментарий 			= "";
			Иначе 
				Запись.Статус				= "INVALID";
				Запись.Комментарий			= "Данные некорректны"
			КонецЕсли;
			
		Иначе
			Запись.ИдентификаторПакета 	= ИдентификаторПакета;
			Запись.Пройдена 			= Ложь;
			Запись.Комментарий 			= Результат.error;
		КонецЕсли;
				
		Запись.Записать();
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОписаниеОшибки = Сред(ОписаниеОшибки, 2);
	КонецЕсли; 
	
	Возврат ОписаниеОшибки;

КонецФункции

#КонецОбласти  

#Область Служебные_процедуры_и_функции

// формирует строку авторизации в соответствии с технологией HTTP Basic access authentication 
Функция ПолучитьСтрокуАвторизации()

	ПараметрыПодключения = ПараметрыПодключения();
	УчетныеДанные = ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль;
	
	ПотокДанных = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных(ПотокДанных);
	ЗаписьДанных.ЗаписатьСимволы(УчетныеДанные);
	ЗаписьДанных.Закрыть();

	ДвоичныеДанные = ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();

	СтрокаАвторизации = "basic " + Base64Строка(ДвоичныеДанные);
	
	Возврат СтрокаАвторизации;

КонецФункции

Функция ОставитьТолькоЦифрыВСтроке(РазбираемаяСтрока)

	Цифры = "1234567890";
	ЦифроваяЧасть = "";
	Для НомерСимвола = 1 По СтрДлина(РазбираемаяСтрока) Цикл
		ТекущийСимвол = Сред(РазбираемаяСтрока, НомерСимвола, 1);
		Если Найти(Цифры, ТекущийСимвол) Тогда
			ЦифроваяЧасть = ЦифроваяЧасть + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЦифроваяЧасть;
	
КонецФункции

Функция ПолучитьТекстОшибки(ОписаниеОшибки)

	ТекстОшибки = "";
	Если ТипЗнч(ОписаниеОшибки) = Тип("Структура") Тогда
		Для каждого КлючИЗначение Из ОписаниеОшибки Цикл
			ТекстОшибки = Символы.ПС + КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение;
		КонецЦикла; 
		ТекстОшибки = Сред(ТекстОшибки, 2);
	Иначе
		ТекстОшибки = ОписаниеОшибки;	
	КонецЕсли; 
	
	Возврат ТекстОшибки;

КонецФункции

#КонецОбласти

#КонецОбласти 

#Область КонтрольИзмененияРеквизитов

Процедура ДобавитьДанныеДляПроверкиРеквизитовЛицПодлежащихСверкеСоСписками(Источник) Экспорт

	Если Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("ПроверкаРеквизитовЛицПодлежащихСверкеСоСписками") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеДанные = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Организация    = Неопределено;
	СписокЮрФизЛиц = Неопределено;
	
	Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		Если ЭлементОтбора.Имя = "Организация" И ЭлементОтбора.Использование Тогда
			Организация = ЭлементОтбора.Значение;
		КонецЕсли;
		
		Если ЭлементОтбора.Имя = "ЮрФизЛицо" И ЭлементОтбора.Использование Тогда
			СписокЮрФизЛиц = ЭлементОтбора.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрыСведений.ВнутренниеПеречни.ЗаполнитьДолжностныеЛица(Запрос.МенеджерВременныхТаблиц, Организация, ТекущаяДата(), СписокЮрФизЛиц);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДолжностныеЛица.Организация КАК Организация,
		|	_ДолжностныеЛица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) КАК Подразделение
		|ПОМЕСТИТЬ _Отборы
		|ИЗ
		|	_ДолжностныеЛица КАК _ДолжностныеЛица";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыполнитьЗапросКДаннымДляПроверкиРеквизитовЛицПодлежащихСверкеСоСписками(Источник, Запрос);
		
		ДополнительныеДанные.Вставить("Отборы",			Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_Отборы").ПолучитьДанные().Выгрузить());
		ДополнительныеДанные.Вставить("ДанныеДоЗаписи", Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_ДанныеРегистра").ПолучитьДанные().Выгрузить());
		
		Источник.ЗаписьИсторииДанных.ДобавитьДополнительныеДанные("ПроверкаРеквизитовЛицПодлежащихСверкеСоСписками", ДополнительныеДанные, "ПроверкаРеквизитовЛицПодлежащихСверкеСоСписками"); 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокЛицПодлежащихСверкеСоСписками(Источник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Источник.ЗаписьИсторииДанных.ДополнительныеДанные.ПроверкаРеквизитовЛицПодлежащихСверкеСоСписками.Отборы, "_Отборы", Запрос);
	
	ВыполнитьЗапросКДаннымДляПроверкиРеквизитовЛицПодлежащихСверкеСоСписками(Источник, Запрос);
	
	ДанныеРегистра = Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_ДанныеРегистра").ПолучитьДанные().Выгрузить();
	
	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из ДанныеРегистра.Колонки Цикл
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ДанныеРегистра.Колонки.Вставить(0, "ВидИзменения");
	ДанныеРегистра.ЗаполнитьЗначения(1, "ВидИзменения");
	
	Для Каждого СтрокаДанныхРегистраДоЗаписи Из Источник.ЗаписьИсторииДанных.ДополнительныеДанные.ПроверкаРеквизитовЛицПодлежащихСверкеСоСписками.ДанныеДоЗаписи Цикл
		СтрокаДанныхРегистра = ДанныеРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанныхРегистра, СтрокаДанныхРегистраДоЗаписи); 
		СтрокаДанныхРегистра.ВидИзменения = -1;
	КонецЦикла;
	
	ДанныеРегистра.Свернуть(СтрСоединить(МассивКолонок, ","), "ВидИзменения");
	
	МассивСтрокДляУдаления = Новый Массив;
	МассивОрганизаций = Новый Массив;
	
	Для Каждого СтрокаДанныхРегистра Из ДанныеРегистра Цикл
		Если СтрокаДанныхРегистра.ВидИзменения = 0 Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаДанныхРегистра);
		Иначе
			Если МассивОрганизаций.Найти(СтрокаДанныхРегистра.Организация) = Неопределено Тогда
				МассивОрганизаций.Добавить(СтрокаДанныхРегистра.Организация);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого СтрокаДанныхРегистра Из МассивСтрокДляУдаления Цикл
		ДанныеРегистра.Удалить(СтрокаДанныхРегистра);
	КонецЦикла;	
	
	РезультатПроверки = Новый Массив;
	
	Если ДанныеРегистра.Количество() > 0 Тогда
		
		Для Каждого Организация Из МассивОрганизаций Цикл
			ПроверяемыеЛица = Новый Массив;
			
			Для Каждого СтрокаДанныхРегистра Из ДанныеРегистра.НайтиСтроки(Новый Структура("Организация", Организация)) Цикл
				Если ПроверяемыеЛица.Найти(СтрокаДанныхРегистра.ЮрФизЛицо) = Неопределено Тогда
					ПроверяемыеЛица.Добавить(СтрокаДанныхРегистра.ЮрФизЛицо);
				КонецЕсли;
			КонецЦикла;
			
			РезультатПроверкиПоОрганизации = Новый Структура;
			РезультатПроверкиПоОрганизации.Вставить("Организация",		Организация);
			РезультатПроверкиПоОрганизации.Вставить("ПроверяемыеЛица",	ПроверяемыеЛица);
			
			РезультатПроверки.Добавить(РезультатПроверкиПоОрганизации);
		КонецЦикла;
		
	КонецЕсли;
	
	Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Удалить("ПроверкаРеквизитовЛицПодлежащихСверкеСоСписками");

	Возврат РезультатПроверки;
	
КонецФункции

Процедура ВыполнитьЗапросКДаннымДляПроверкиРеквизитовЛицПодлежащихСверкеСоСписками(Источник, Запрос)
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыФизическихЛицАнкетные") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеРегистра.Период КАК Период,
			|	_Отборы.Организация КАК Организация,
			|	_ДанныеРегистра.Язык КАК Язык,
			|	_ДанныеРегистра.ЮрФизЛицо КАК ЮрФизЛицо,
			|	_ДанныеРегистра.Фамилия КАК Фамилия,
			|	_ДанныеРегистра.Имя КАК Имя,
			|	_ДанныеРегистра.Отчество КАК Отчество
			|ПОМЕСТИТЬ _ДанныеРегистра
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные КАК _ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Отборы КАК _Отборы
			|		ПО _ДанныеРегистра.ЮрФизЛицо = _Отборы.ЮрФизЛицо
			|			И _ДанныеРегистра.Организация = _Отборы.Организация";
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РеквизитыСотрудниковОрганизации") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеРегистра.Период КАК Период,
			|	_ДанныеРегистра.Организация КАК Организация,
			|	_ДанныеРегистра.ЮрФизЛицо КАК ЮрФизЛицо,
			|	_ДанныеРегистра.Язык КАК Язык,
			|	_ДанныеРегистра.Фамилия КАК Фамилия,
			|	_ДанныеРегистра.Имя КАК Имя,
			|	_ДанныеРегистра.Отчество КАК Отчество
			|ПОМЕСТИТЬ _ДанныеРегистра
			|ИЗ
			|	РегистрСведений.РеквизитыСотрудниковОрганизации КАК _ДанныеРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Отборы КАК _Отборы
			|		ПО _ДанныеРегистра.ЮрФизЛицо = _Отборы.ЮрФизЛицо
			|			И _ДанныеРегистра.Организация = _Отборы.Организация";
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область Обработка_данных

Процедура ЗаполнитьТаблицуФизическихЛиц(МенеджерВременныхТаблиц, Период, Организация, ФизЛицо = Неопределено)

	Если МенеджерВременныхТаблиц.Таблицы.Найти("_ФизическиеЛица") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Справочники.ЮрФизЛица.ПоместитьКлиентовВМенеджерВременныхТаблиц(Запрос, Организация, Период);
		
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ФизЛицо", 		ФизЛицо);
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _КлиентыДоверительногоУправления
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _Клиенты.ЮрФизЛицо = ЮрФизЛица.Ссылка
		|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|			И (&ФизЛицо = НЕОПРЕДЕЛЕНО
		|				ИЛИ _Клиенты.ЮрФизЛицо В (&ФизЛицо))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЮрФизЛица.Ссылка
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица
		|ГДЕ
		|	НЕ &ФизЛицо = НЕОПРЕДЕЛЕНО
		|	И ЮрФизЛица.Ссылка В(&ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ _ФизическиеЛицаКандидаты
		|ИЗ
		|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаЮридическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели
		|			ПО РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка
		|		ПО _КлиентыДоверительногоУправления.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо
		|ИЗ
		|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаФизическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаФизическогоЛицаПредставителиВыгодоприобретатели
		|			ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо
		|		ПО _КлиентыДоверительногоУправления.ЮрФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_КлиентыДоверительногоУправления.ЮрФизЛицо
		|ИЗ
		|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _КлиентыДоверительногоУправления.ЮрФизЛицо = ЮрФизЛица.Ссылка
		|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ФизическиеЛицаКандидаты.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ _ФизическиеЛица
		|ИЗ
		|	_ФизическиеЛицаКандидаты КАК _ФизическиеЛицаКандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _ФизическиеЛицаКандидаты.ФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаСмерти, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КлиентыДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ФизическиеЛицаКандидаты";
	
	Запрос.Выполнить();

КонецПроцедуры
 
Функция ПолучитьМассивДанныхДляПроверки(Организация, ФизЛицо)

	Запрос = Новый Запрос;
	
	Период = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗаполнитьТаблицуФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Период, Организация, ФизЛицо);
	
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ФизическиеЛица.ФизЛицо КАК ФизЛицо,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности, """") КАК Серия,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности, """") КАК Номер,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя, """") КАК Имя,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия, """") КАК Фамилия
		|ИЗ
		|	_ФизическиеЛица КАК _ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _ФизическиеЛица.ФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности В (ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортСССР))";
		
	#КонецОбласти 
			
	РеквизитыФизЛиц = Запрос.Выполнить().Выгрузить();
	
	МассивДанныхДляПроверки = Новый Массив;
	
	// В макете ШаблонТелаHTTPЗапросаКСМЭВ закодированны данные
	//		'priority=NORMAL' 					(приоритет)
	//		'datamart=rfp_check' 				(витрина данных)
	//		'mnemonic=rfp_check_dm_nsud_rfp' 	(мнемоника)
	//		'params={"type": "STRING", "value": "Серия", "name": "dm_nsud_rfp_doc_series_no"},{"type": "STRING", "value": "Номер", "name": "dm_nsud_rfp_doc_no"},{"type": "STRING", "value": "ИМЯ", "name": "dm_nsud_rfp_person_first_name"},{"type": "STRING", "value": "ФАМИЛИЯ", "name": "dm_nsud_rfp_person_last_name"}'

	ШаблонHTTPЗапроса = РегистрыСведений.ЖурналСверкиСоСписками.ПолучитьМакет("ШаблонТелаHTTPЗапросаКСМЭВ").ПолучитьТекст();
	
	Для каждого ТекСтрока Из РеквизитыФизЛиц Цикл
		
		ТелоHTTPЗапроса = СоздатьЗапросДокументооборота(ТекСтрока, ШаблонHTTPЗапроса);
		МассивДанныхДляПроверки.Добавить(Новый Структура("ФизическоеЛицо, ТелоHTTPЗапроса", ТекСтрока.ФизЛицо, ТелоHTTPЗапроса));
	
	КонецЦикла; 
	
	Возврат МассивДанныхДляПроверки;

КонецФункции

Функция СоздатьЗапросДокументооборота(ДанныеФизЛица, ШаблонHTTPЗапроса)
	
	СтрокаURLEncoded = ШаблонHTTPЗапроса;
	МассивПолей = СтрРазделить("Серия,Номер,Имя,Фамилия", ",", Ложь);
	Для каждого ИмяПоля Из МассивПолей Цикл
		
		СтрокаURLEncoded = СтрЗаменить(СтрокаURLEncoded, ИмяПоля, КодироватьСтроку(ВРег(ДанныеФизЛица[ИмяПоля]), СпособКодированияСтроки.КодировкаURL));
				
	КонецЦикла; 
		
	Возврат СтрокаURLEncoded;

КонецФункции
 
#КонецОбласти 
