
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьПрекращенные", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСкрытьПрекращенные(Команда)
	
	Элементы.ФормаКомандаПоказатьСкрытьПрекращенные.Пометка = Не Элементы.ФормаКомандаПоказатьСкрытьПрекращенные.Пометка;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьПрекращенные",
		Элементы.ФормаКомандаПоказатьСкрытьПрекращенные.Пометка);
	
КонецПроцедуры
