
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
		
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	            	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_Формы

&НаКлиенте
Процедура КомандаОтправитьУведомления(Команда)
		
	КомандаОтправитьУведомленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаОтправитьУведомленияНаСервере()
	
	Отказ = Ложь;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтправитьУведомления(Отказ);
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(Отказ, "Нет новых платежных поручений", "Уведомление сформировано"));
			
КонецПроцедуры

#КонецОбласти

#Область Экспортные_Процедуры_и_Функции

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
			
КонецПроцедуры

#КонецОбласти