
Функция ПолучитьСоответствиеДвоичныхДанных(Параметры) Экспорт
	
	ДанныеДляВыгрузки = ПолучитьДанныеДляВыгрузки(Параметры);
	Если Не ДанныеДляВыгрузки = Неопределено Тогда
		
		СоответствиеДвоичныхДанных = Новый Соответствие;   
		
		Для каждого СтрокаКлиенты Из ДанныеДляВыгрузки.Клиенты Цикл
			
			ИмяФайла = "BrokerReport_" + Формат(СтрокаКлиенты.ДатаНачала, "ДФ=dd.MM.yy") + "_-_" + Формат(СтрокаКлиенты.ДатаОкончания, "ДФ=dd.MM.yy") + "_";
			
			СтруктураОтбора = Новый Структура("СчетДоверительногоУправления", СтрокаКлиенты.СчетДоверительногоУправления); 
			ОбъектыИнвестирования = ДанныеДляВыгрузки.ОбъектыИнвестирования.НайтиСтроки(СтруктураОтбора);
			Сделки = ДанныеДляВыгрузки.Сделки.НайтиСтроки(СтруктураОтбора);
			
			Если ОбъектыИнвестирования.Количество() + Сделки.Количество() > 0 Тогда
			
				СоответствиеДвоичныхДанных.Вставить(
					ИмяФайла + РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(СтрокаКлиенты.КодСчета), 
					ПолучитьДвоичныеДанные(Параметры, СтрокаКлиенты.Наименование, ОбъектыИнвестирования, Сделки));
				
			КонецЕсли; 
		
		КонецЦикла; 
		
		Возврат СоответствиеДвоичныхДанных;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеДляВыгрузки(Параметры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = ""_ЖурналКонфликтаИнтересов""
		|	И ДополнительныеОтчетыИОбработки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет)
		|	И НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Обработка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки(Выборка.Ссылка);
		Обработка.Период = Параметры.ВыгружаемыйПериод;
		Обработка.Организация = Параметры.Организация;
		Обработка.ВыводитьСделкиРЕПО = Параметры.ВыгружатьСделкиРЕПО;
		Обработка.ТаблицаКлиентов.Загрузить(Параметры.Клиенты);
		Результат = Обработка.ПолучитьДанныеДляВыгрузки(Параметры.ДатаПредоставленияИнформации);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена обработка ""Журнал конфликта интересов""");
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьДвоичныеДанные(Параметры, СчетДоверительногоУправления, ОбъектыИнвестирования, Сделки)

	ПотокДанных = Новый ПотокВПамяти;
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.ОткрытьПоток(ПотокДанных);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтчетУправляющего");
	
	ЗаписьXML.ЗаписатьАтрибут("ДатаПредоставленияИнформации", 	Формат(Параметры.ДатаПредоставленияИнформации, "ДФ=yyyyMMdd"));
	ЗаписьXML.ЗаписатьАтрибут("НачалоПериода", 					Формат(Параметры.ВыгружаемыйПериод.ДатаНачала, "ДФ=yyyyMMdd"));
	ЗаписьXML.ЗаписатьАтрибут("ОкончаниеПериода",				Формат(Параметры.ВыгружаемыйПериод.ДатаОкончания, "ДФ=yyyyMMdd"));
	ЗаписьXML.ЗаписатьАтрибут("Клиент", 						СчетДоверительногоУправления);
	
	Если ОбъектыИнвестирования.Количество() > 0 Тогда
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъектыИнвестирования"); 
		
		Для каждого СтрокаОбъектыИнвестирования Из ОбъектыИнвестирования Цикл
		
			ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаОбъектыИнвестирования");
			
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.Рынок, 						"Рынок", 						НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.ЦеннаяБумага, 				"ЦеннаяБумага", 				НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.СерияНомер, 					"ИдентификаторЦеннойБумаги", 	НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.Эмитент, 					"ЮрФизЛицо", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоНачальныйОстаток, 	"НачальныйОстаток", 			НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоПриход, 			"Приход", 						НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоРасход, 			"Расход", 						НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоКонечныйОстаток, 	"КонечныйОстаток", 				НазначениеТипаXML.Явное);
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаОбъектыИнвестирования
			
		КонецЦикла; 
	
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ОбъектыИнвестирования
	
	КонецЕсли; 
	
	Если Сделки.Количество() > 0 Тогда
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Сделки"); 
		
		Для каждого СтрокаСделки Из Сделки Цикл
		
			ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаСделки");
			
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.ДатаОперации, 	"ДатаСделки", 					НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Операция, 		"ВидСделки", 					НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Рынок, 			"Рынок", 						НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.ЦеннаяБумага, 	"ЦеннаяБумага", 				НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СерияНомер, 	"ИдентификаторЦеннойБумаги", 	НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Эмитент, 		"ЮрФизЛицо", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Количество, 	"Количество", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Цена, 			"Цена", 						НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Сумма, 			"СуммаБезНКД", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СуммаКупона, 	"НКД", 							НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СрокРЕПО, 		"СрокРЕПО", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СтавкаРЕПО, 	"СтавкаРЕПО", 					НазначениеТипаXML.Явное);
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаСделки
			
		КонецЦикла; 
	
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сделки
	
	КонецЕсли; 
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ОтчетУправляющего
	ЗаписьXML.Закрыть();
	
	Возврат ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();

КонецФункции

Процедура ЗаписатьИнформациюОФайлеВДополнительныеСведения(Ссылка, ПутьКФайлу, ХешСумма) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Объект КАК Объект,
		|	ДополнительныеСведения.Ссылка КАК Свойство,
		|	&ПутьКФайлу КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""Документ.СведенияПредоставляемыеЮрФизЛицами.ПутьКФайлуОтчетаБрокера""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Объект,
		|	ДополнительныеСведения.Ссылка,
		|	&ХешСумма
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""Документ.СведенияПредоставляемыеЮрФизЛицами.ХешСуммаФайла""";
	
	Запрос.УстановитьПараметр("Объект", 	Ссылка);
	Запрос.УстановитьПараметр("ПутьКФайлу", ПутьКФайлу);
	Запрос.УстановитьПараметр("ХешСумма", 	ХешСумма);
		                                                   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Запись = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();
	
	КонецЦикла;
	
КонецПроцедуры
 