#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Дата выгрузки
	Если Не ЗначениеЗаполнено(Объект.ДатаВыгрузки) Тогда
		Объект.ДатаВыгрузки = ТекущаяДата();
	КонецЕсли;
	// Организация
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	// Имя сервера
	ЭтаФорма.ИмяСервера = ЭтаФорма.Параметры.ИмяСервера;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ДатаВыгрузки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ЭтаФорма.Заголовок = "Экспорт в Егар " + ЭтаФорма.ИмяСервера;
	
	ПользовательскаяДатаВыгрузкиПриИзменении();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭкспортСделокПриИзменении(Элемент)
	Объект.ЭкспортСделок = Истина;
	Объект.ЭкспортОстатков = Ложь;
	Объект.ЭкспортСправочника = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортОстатковПриИзменении(Элемент)
	Объект.ЭкспортСделок = Ложь;
	Объект.ЭкспортОстатков = Истина;
	Объект.ЭкспортСправочника = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортСправочникаПриИзменении(Элемент)
	Объект.ЭкспортСделок = Ложь;
	Объект.ЭкспортОстатков = Ложь;
	Объект.ЭкспортСправочника = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскаяДатаВыгрузкиПриИзменении(Элемент = Неопределено)
	Элементы.ДатаВыгрузки.ТолькоПросмотр = Не ПользовательскаяДатаВыгрузки;
	Если Не ПользовательскаяДатаВыгрузки Тогда
		Объект.ДатаВыгрузки = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаУдалитьДанные(Команда)
	КомандаУдалитьДанныеНаСервере(ЭтаФорма.ИмяСервера);
КонецПроцедуры

&НаСервере
Процедура КомандаУдалитьДанныеНаСервере(НомерСервера)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.УдалитьДанные(НомерСервера,,);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьДанные(Команда)
	Если Не (Объект.ЭкспортСделок Или Объект.ЭкспортОстатков Или Объект.ЭкспортСправочника) Тогда
		Сообщить("Необходимо указать данные для выгрузки!");
	Иначе
		КомандаЗагрузитьНаСервере(ЭтаФорма.ИмяСервера);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьНаСервере(НомерСервера)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.Загрузить(НомерСервера);
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьЛимитыНаСервере(Сервер)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.ОбновитьЛимиты(Сервер);
	//ОбновитьЛимиты(Сервер);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьЛимиты(Команда)
	КомандаОбновитьЛимитыНаСервере(ЭтаФорма.ИмяСервера);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьБумагиДоПогашения(Команда)
	Объект.ЭкспортБумагУдерживаемыхДоПогашения = Истина;
	КомандаЗагрузитьНаСервере(ЭтаФорма.ИмяСервера);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьСоединение(Команда)
	КомандаПроверитьСоединениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПроверитьСоединениеНаСервере()
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.ПроверитьСоединение(ИмяСервера);
КонецПроцедуры

#КонецОбласти
