// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Справка о краткосрочных вложениях",
		"0.31",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Период = НастройкиОтчета.Период.ДатаОкончания;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДанныеШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	СчетаДоверительногоУправления.НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения
		|ПОМЕСТИТЬ _КлиентДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентДУ.НомерДоговора,
		|	_КлиентДУ.ДатаЗаключения КАК ДатаДоговора,
		|	РеквизитыКлиентаСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеСчетаДУ,
		|	РеквизитыОрганизацийСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации
		|ИЗ
		|	_КлиентДУ КАК _КлиентДУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиентаСрезПоследних
		|		ПО _КлиентДУ.Клиент = РеквизитыКлиентаСрезПоследних.ЮрФизЛицо,
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ЮрФизЛицоОрганизации) КАК РеквизитыОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации", ЭтотОбъект.Организация.ЮрФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи;
		
	КонецЕсли;
	
КонецФункции
 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	СтандартнаяОбработка = Ложь;
	ВнешниеНаборыДанных = ПолучитьВнешниеНаборыДанных();
	
	Настройки = КомпоновщикНастроек.Настройки;	
	
	ДанныеШапки = ПолучитьДанныеШапки();
	Если НЕ ДанныеШапки = Неопределено Тогда
	
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеОрганизации", 	ДанныеШапки.НаименованиеОрганизации);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеСчетаДУ", 		ДанныеШапки.НаименованиеСчетаДУ);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаДоговора", 				Формат(ДанныеШапки.ДатаДоговора, "ДФ=dd.MM.yyyy"));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 				ДанныеШапки.НомерДоговора);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", 				Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"));
			
	КонецЕсли; 
		
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры

Функция ПолучитьВнешниеНаборыДанных()

	//перечень финансовых организаций
	// заимствовано из баланса
	ДатаПеречня = КонсолидированнаяОтчетность.ПолучитьДатуПеречняФинансовыхОрганизаций(ЭтотОбъект.Период);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПеречниОбъектов.Объект
	|ИЗ
	|	РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
	|ГДЕ
	|	ПеречниОбъектов.Включен
	|	И ПеречниОбъектов.Период = &ДатаПеречняТП
	|	И ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
	|	И ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора)";
	Запрос.УстановитьПараметр("ДатаПеречняТП", ДатаПеречня);
	ТаблицаФинансовыхОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫРАЗИТЬ(ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЗначениеНастройки КАК БУЛЕВО) КАК ПризнатьВыпускДефолтным
		|ПОМЕСТИТЬ _ДефолтныеОблигации
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг.СрезПоследних(
		|			&грКонецПериода,
		|			Организация = &Организация
		|				И Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ПризнатьДефолтной)
		|				И Клиент В
		|					(ВЫБРАТЬ
		|						КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|					ИЗ
		|						РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, Организация = &Организация
		|							И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК ЗначенияНастроекУчетаЦенныхБумагСрезПоследних
		|ГДЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЗначениеНастройки = ИСТИНА
		|	И НЕ ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Отключить
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.ЦеннаяБумага,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.ОценкиСтоимостиЦенныхБумаг.СрезПоследних(
		|			&грКонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОценкиСтоимостиЦенныхБумагСрезПоследних
		|ГДЕ
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.ДатаОкончанияДействия >= &КонецПериода
		|	И ОценкиСтоимостиЦенныхБумагСрезПоследних.Стоимость = 0
		|	И ОценкиСтоимостиЦенныхБумагСрезПоследних.СтоимостьКупона = 0
		|	И ОценкиСтоимостиЦенныхБумагСрезПоследних.ПовышенныйПриоритет
		|	И ОценкиСтоимостиЦенныхБумагСрезПоследних.ОценкаКупона
		|	И ОценкиСтоимостиЦенныхБумагСрезПоследних.ОценкаЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Единый.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаУчетаЦБ
		|ИЗ
		|	ПланСчетов.Единый КАК Единый
		|ГДЕ
		|	Единый.Родитель.Код В (""501"", ""502"", ""503"", ""504"", ""506"", ""507"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаУчетаЦБ.Ссылка КАК Ссылка,
		|	_СчетаУчетаЦБ.Ссылка.Наименование КАК Имя
		|ПОМЕСТИТЬ _СчетаРезервов
		|ИЗ
		|	_СчетаУчетаЦБ КАК _СчетаУчетаЦБ
		|ГДЕ
		|	_СчетаУчетаЦБ.Ссылка.Наименование ПОДОБНО ""Резервы под обесценение%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС)
		|			ТОГДА ""Депозитные вклады по амортизированной стоимости""
		|		ИНАЧЕ ""МНО и Депозитные вклады по справедливой стоимости через прибыль или убыток""
		|	КОНЕЦ КАК Группа,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) ССЫЛКА Справочник.ДепозитныеВклады
		|			ТОГДА ""Депозитные вклады""
		|		ИНАЧЕ ""МНО""
		|	КОНЕЦ КАК НомерСтроки,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15)
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.Дата
		|		ИНАЧЕ ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации
		|	КОНЕЦ КАК ДатаРазмещения,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ КАК АнализируемаяДата,
		|	ЕСТЬNULL(МНО.Ссылка, УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты15)
		|				ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Резерв,
		|	ВЫБОР
		|		КОГДА МНО.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Договор.НомерДоговора
		|		ИНАЧЕ МНО.РасчетныйСчет.ДоговорМНО.НомерДоговора
		|	КОНЕЦ КАК НомерЦБ,
		|	ВЫБОР
		|		КОГДА МНО.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк
		|		ИНАЧЕ МНО.РасчетныйСчет.Банк
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _Раздел2
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20601"", ""20603"", ""20609"", ""20611"", ""20613"", ""20615""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент,
		|			УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив КАК УчетныйАктив
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК МНО
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = МНО.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС)
		|			ТОГДА ""Депозитные вклады по амортизированной стоимости""
		|		ИНАЧЕ ""МНО и Депозитные вклады по справедливой стоимости через прибыль или убыток""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.Дата
		|		ИНАЧЕ ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ,
		|	ЕСТЬNULL(МНО.Ссылка, УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) ССЫЛКА Справочник.ДепозитныеВклады
		|			ТОГДА ""Депозитные вклады""
		|		ИНАЧЕ ""МНО""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА МНО.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Договор.НомерДоговора
		|		ИНАЧЕ МНО.РасчетныйСчет.ДоговорМНО.НомерДоговора
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА МНО.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк
		|		ИНАЧЕ МНО.РасчетныйСчет.Банк
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеПоСправедливой), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеДляПродажи))
		|			ТОГДА ""Ценные бумаги по справедливой стоимости через прибыль или убыток""
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД))
		|			ТОГДА ""Ценные бумаги, удерживаемые до погашения""
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения))
		|			ТОГДА ""Ценные бумаги по амортизированной стоимости""
		|	КОНЕЦ КАК Группа,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации""
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акции""
		|		ИНАЧЕ ""Паи""
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ДефолтныеОблигации.ПризнатьВыпускДефолтным
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В
		|						(ВЫБРАТЬ
		|							_СчетаРезервов.Ссылка
		|						ИЗ
		|							_СчетаРезервов КАК _СчетаРезервов)
		|					ТОГДА 0
		|				ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|			КОНЕЦ
		|	КОНЕЦ КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ВЫБОР
		|		КОГДА _ДефолтныеОблигации.ПризнатьВыпускДефолтным
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В
		|						(ВЫБРАТЬ
		|							_СчетаРезервов.Ссылка
		|						ИЗ
		|							_СчетаРезервов КАК _СчетаРезервов)
		|					ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Резерв,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК НомерЦБ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент
		|		ИНАЧЕ РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _Раздел3
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В
		|				(ВЫБРАТЬ
		|					_СчетаУчетаЦБ.Ссылка
		|				ИЗ
		|					_СчетаУчетаЦБ КАК _СчетаУчетаЦБ),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&грКонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДефолтныеОблигации КАК _ДефолтныеОблигации
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ДефолтныеОблигации.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Раздел2.Группа КАК Группа,
		|	_Раздел2.НомерСтроки КАК НомерСтроки,
		|	"""" КАК НомерКолонки,
		|	_Раздел2.ДатаРазмещения КАК ДатаРазмещения,
		|	_Раздел2.АнализируемаяДата КАК АнализируемаяДата,
		|	_Раздел2.ЦеннаяБумага КАК ЦеннаяБумага,
		|	НЕОПРЕДЕЛЕНО КАК ДополнительнаяАналитика,
		|	СУММА(_Раздел2.Сумма) КАК Сумма,
		|	СУММА(_Раздел2.Резерв) КАК Резерв,
		|	_Раздел2.НомерЦБ КАК НомерЦБ,
		|	_Раздел2.Эмитент КАК Эмитент
		|ИЗ
		|	_Раздел2 КАК _Раздел2
		|
		|СГРУППИРОВАТЬ ПО
		|	_Раздел2.Группа,
		|	_Раздел2.НомерСтроки,
		|	_Раздел2.ДатаРазмещения,
		|	_Раздел2.АнализируемаяДата,
		|	_Раздел2.ЦеннаяБумага,
		|	_Раздел2.НомерЦБ,
		|	_Раздел2.Эмитент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел3.Группа,
		|	_Раздел3.НомерСтроки,
		|	"""",
		|	"""",
		|	_Раздел3.АнализируемаяДата,
		|	_Раздел3.ЦеннаяБумага,
		|	_Раздел3.ДополнительнаяАналитика,
		|	СУММА(_Раздел3.Сумма),
		|	СУММА(_Раздел3.Резерв),
		|	_Раздел3.НомерЦБ,
		|	_Раздел3.Эмитент
		|ИЗ
		|	_Раздел3 КАК _Раздел3
		|
		|СГРУППИРОВАТЬ ПО
		|	_Раздел3.Группа,
		|	_Раздел3.НомерСтроки,
		|	_Раздел3.АнализируемаяДата,
		|	_Раздел3.ДополнительнаяАналитика,
		|	_Раздел3.ЦеннаяБумага,
		|	_Раздел3.НомерЦБ,
		|	_Раздел3.Эмитент";
		
	Запрос.УстановитьПараметр("грКонецПериода", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.Период));	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("УчетныйАктив", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивы"));
	
	МассивДопАналитикКупонов = Новый Массив;
	МассивДопАналитикКупонов.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	МассивДопАналитикКупонов.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	
	Для каждого ТекСтрока Из Результат Цикл
	
		Если ЗначениеЗаполнено(ТекСтрока.АнализируемаяДата)
			ИЛИ Не ЗначениеЗаполнено(ТекСтрока.ЦеннаяБумага) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(ТекСтрока.ЦеннаяБумага) = Тип("ДокументСсылка.МНО") Тогда
			ТекСтрока.УчетныйАктив = Справочники.УчетныеАктивы.ПроцентыНаМНО;
		ИначеЕсли ТипЗнч(ТекСтрока.ЦеннаяБумага) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
			ТекСтрока.УчетныйАктив = Справочники.УчетныеАктивы.ДепозитныеВклады;
		Иначе
			Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ТекСтрока.ЦеннаяБумага);
			ЭтоКупон = МассивДопАналитикКупонов.Найти(ТекСтрока.ДополнительнаяАналитика) <> Неопределено;
			ТекСтрока.УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Период, Рынок, ТекСтрока.ЦеннаяБумага, ЭтоКупон);
		//	ТекСтрока.УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ЭтотОбъект.Период, Рынок, ТекСтрока.ЦеннаяБумага, СчетДоверительногоУправления);
		КонецЕсли; 
		
	КонецЦикла;      
	
	Если Год(ЭтотОбъект.Период) < 2025 Тогда
		#Область ЗапросДо2025
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&КонецПериода КАК ОтчетнаяДата,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1)
		|	КОНЕЦ КАК Год,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3)
		|	КОНЕЦ КАК ТриМесяца
		|ПОМЕСТИТЬ _Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИсточник.Группа КАК Группа,
		|	ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	ТаблицаИсточник.Сумма КАК Сумма,
		|	ТаблицаИсточник.Резерв КАК Резерв,
		|	ТаблицаИсточник.ДатаРазмещения КАК ДатаРазмещения,
		|	ТаблицаИсточник.АнализируемаяДата КАК АнализируемаяДата,
		|	ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаИсточник.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ТаблицаИсточник.УчетныйАктив КАК УчетныйАктив,
		|	ТаблицаИсточник.НомерЦБ КАК НомерЦБ,
		|	ТаблицаИсточник.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ТаблицаИсточник
		|ИЗ
		|	&ТаблицаИсточник КАК ТаблицаИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ _ПереопределенныеАктивы
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&КонецПериода, Организация = &Организация) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаИсточник.Группа КАК Группа,
		|	_ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""менее 3 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""от 3 до 12 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеГода)
		|			ТОГДА ""свыше 12 месяцев""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НомерКолонки,
		|	_ТаблицаИсточник.Сумма КАК Сумма,
		|	_ТаблицаИсточник.Резерв КАК Резерв,
		|	_ТаблицаИсточник.ДатаРазмещения КАК ДатаРазмещения,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияКупона)
		|			ТОГДА КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияТела)
		|				ИЛИ НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты)
		|						ТОГДА ЕСТЬNULL(МИНИМУМ(УсловияОферт.ДатаВыкупа), Облигации.ДатаПогашения)
		|					ИНАЧЕ Облигации.ДатаПогашения
		|				КОНЕЦ
		|		ИНАЧЕ _ТаблицаИсточник.АнализируемаяДата
		|	КОНЕЦ КАК АнализируемаяДата,
		|	_ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаИсточник.УчетныйАктив КАК УчетныйАктив,
		|	_ТаблицаИсточник.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ВЫБОР
		|		КОГДА НЕ _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ ЕСТЬ NULL
		|			ТОГДА _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции).УчетныйАктивЦБРФ
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|			КОНЕЦ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	Облигации.Категория КАК КатегорияОблигации,
		|	_ТаблицаИсточник.НомерЦБ КАК НомерЦБ,
		|	_ТаблицаИсточник.Эмитент КАК Эмитент,
		|	Эмитенты.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ТаблицаИсточник КАК _ТаблицаИсточник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК НастройкиУчетаАктивовСрезПоследних
		|		ПО _ТаблицаИсточник.УчетныйАктив = НастройкиУчетаАктивовСрезПоследних.УчетныйАктив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(
		|				&КонецПериода,
		|				Облигация В
		|					(ВЫБРАТЬ
		|						_ТаблицаИсточник.ЦеннаяБумага
		|					ИЗ
		|						_ТаблицаИсточник КАК _ТаблицаИсточник)) КАК КупонныйДоходПоОблигациямСрезПоследних
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = КупонныйДоходПоОблигациямСрезПоследних.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = УсловияОферт.Облигация
		|			И (&КонецПериода < УсловияОферт.ДатаВыкупа)
		|			И (НЕ УсловияОферт.ТолькоДляФизическихЛиц)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереопределенныеАктивы КАК _ПереопределенныеАктивы
		|		ПО _ТаблицаИсточник.Эмитент = _ПереопределенныеАктивы.Эмитент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО _ТаблицаИсточник.Эмитент = Эмитенты.Ссылка,
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаИсточник.ДополнительнаяАналитика,
		|	_ТаблицаИсточник.УчетныйАктив,
		|	_ТаблицаИсточник.ЦеннаяБумага,
		|	_ТаблицаИсточник.Резерв,
		|	_ТаблицаИсточник.НомерСтроки,
		|	_ТаблицаИсточник.ДатаРазмещения,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""менее 3 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""от 3 до 12 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеГода)
		|			ТОГДА ""свыше 12 месяцев""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	_ТаблицаИсточник.Сумма,
		|	Облигации.Категория,
		|	_ТаблицаИсточник.НомерЦБ,
		|	_ТаблицаИсточник.Эмитент,
		|	_ТаблицаИсточник.АнализируемаяДата,
		|	НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона,
		|	КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона,
		|	Облигации.ДатаПогашения,
		|	НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо,
		|	ВЫБОР
		|		КОГДА НЕ _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ ЕСТЬ NULL
		|			ТОГДА _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции).УчетныйАктивЦБРФ
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	Эмитенты.ЮрФизЛицо,
		|	_ТаблицаИсточник.Группа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.Группа КАК Группа,
		|	_ИтоговаяТаблица.НомерСтроки КАК Раздел,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""свыше 12 месяцев""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""от 3 до 12 месяцев""
		|		ИНАЧЕ ""менее 3 месяцев""
		|	КОНЕЦ КАК СрокРазмещения,
		|	СУММА(_ИтоговаяТаблица.Сумма) КАК Стоимость,
		|	СУММА(_ИтоговаяТаблица.Резерв) КАК РезервПодОбесценение,
		|	СУММА(_ИтоговаяТаблица.Сумма - _ИтоговаяТаблица.Резерв) КАК БалансоваяСтоимость,
		|	_ИтоговаяТаблица.ЦеннаяБумага КАК Актив,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|				ИЛИ _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ""Купон""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	_ИтоговаяТаблица.ДатаРазмещения КАК ДатаРазмещения,
		|	_ИтоговаяТаблица.АнализируемаяДата КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА ""Правительства Российской Федерации""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА ""Субъектов Российской Федерации и органов местного самоуправления""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА ""Иностранных государств""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА ""Кредитных организаций и банков-нерезидентов""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Некредитных финансовых организаций""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Нефинансовых организаций""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидЦБ,
		|	_ИтоговаяТаблица.НомерЦБ КАК НомерЦБ,
		|	_ИтоговаяТаблица.Эмитент КАК Эмитент,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА 1
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА 2
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА 3
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА 4
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 5
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 6
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПорядокВидовЦБ,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Акции""
		|			ТОГДА 1
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Облигации""
		|			ТОГДА 2
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Паи""
		|			ТОГДА 3
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Депозитные вклдаы""
		|			ТОГДА 4
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""МНО""
		|			ТОГДА 5
		|		ИНАЧЕ 6
		|	КОНЕЦ КАК ПорядокРазделов
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица,
		|	_Периоды КАК _Периоды
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	_ИтоговаяТаблица.ЦеннаяБумага,
		|	_ИтоговаяТаблица.ДатаРазмещения,
		|	_ИтоговаяТаблица.АнализируемаяДата,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|				ИЛИ _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ""Купон""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	_ИтоговаяТаблица.НомерЦБ,
		|	_ИтоговаяТаблица.Эмитент,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""свыше 12 месяцев""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""от 3 до 12 месяцев""
		|		ИНАЧЕ ""менее 3 месяцев""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА ""Правительства Российской Федерации""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА ""Субъектов Российской Федерации и органов местного самоуправления""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА ""Иностранных государств""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА ""Кредитных организаций и банков-нерезидентов""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Некредитных финансовых организаций""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Нефинансовых организаций""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА 1
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА 2
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА 3
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА 4
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 5
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 6
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	_ИтоговаяТаблица.Группа";
		
		#КонецОбласти  
	Иначе
		#Область Запрос2025
		//деление на периодыв стало более детальным
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&КонецПериода КАК ОтчетнаяДата,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 5), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 5)
		|	КОНЕЦ КАК ПятьЛет,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 4), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 4)
		|	КОНЕЦ КАК ЧетыреГода,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 3)
		|	КОНЕЦ КАК ТриГода,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 2), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 2)
		|	КОНЕЦ КАК ДваГода,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1)
		|	КОНЕЦ КАК Год,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3)
		|	КОНЕЦ КАК ТриМесяца
		|ПОМЕСТИТЬ _Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИсточник.Группа КАК Группа,
		|	ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	ТаблицаИсточник.Сумма КАК Сумма,
		|	ТаблицаИсточник.Резерв КАК Резерв,
		|	ТаблицаИсточник.ДатаРазмещения КАК ДатаРазмещения,
		|	ТаблицаИсточник.АнализируемаяДата КАК АнализируемаяДата,
		|	ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаИсточник.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ТаблицаИсточник.УчетныйАктив КАК УчетныйАктив,
		|	ТаблицаИсточник.НомерЦБ КАК НомерЦБ,
		|	ТаблицаИсточник.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ТаблицаИсточник
		|ИЗ
		|	&ТаблицаИсточник КАК ТаблицаИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ _ПереопределенныеАктивы
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&КонецПериода, Организация = &Организация) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаИсточник.Группа КАК Группа,
		|	_ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""(1) менее 3 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""(2) от 3 до 12 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтГодаДоДвух)
		|			ТОГДА ""(3) от года до 2 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтДвухДоТрехЛет)
		|			ТОГДА ""(4) от 2 до 3 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехДоЧетырехЛет)
		|			ТОГДА ""(5) от 3 до 4 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтЧетырехДоПятиЛет)
		|			ТОГДА ""(6) от 4 до 5 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеПятиЛет)
		|			ТОГДА ""(7) свыше 5 лет""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НомерКолонки,
		|	_ТаблицаИсточник.Сумма КАК Сумма,
		|	_ТаблицаИсточник.Резерв КАК Резерв,
		|	_ТаблицаИсточник.ДатаРазмещения КАК ДатаРазмещения,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияКупона)
		|			ТОГДА КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияТела)
		|				ИЛИ НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты)
		|						ТОГДА ЕСТЬNULL(МИНИМУМ(УсловияОферт.ДатаВыкупа), Облигации.ДатаПогашения)
		|					ИНАЧЕ Облигации.ДатаПогашения
		|				КОНЕЦ
		|		ИНАЧЕ _ТаблицаИсточник.АнализируемаяДата
		|	КОНЕЦ КАК АнализируемаяДата,
		|	_ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаИсточник.УчетныйАктив КАК УчетныйАктив,
		|	_ТаблицаИсточник.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ВЫБОР
		|		КОГДА НЕ _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ ЕСТЬ NULL
		|			ТОГДА _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции).УчетныйАктивЦБРФ
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|			КОНЕЦ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	Облигации.Категория КАК КатегорияОблигации,
		|	_ТаблицаИсточник.НомерЦБ КАК НомерЦБ,
		|	_ТаблицаИсточник.Эмитент КАК Эмитент,
		|	Эмитенты.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ТаблицаИсточник КАК _ТаблицаИсточник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК НастройкиУчетаАктивовСрезПоследних
		|		ПО _ТаблицаИсточник.УчетныйАктив = НастройкиУчетаАктивовСрезПоследних.УчетныйАктив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(
		|				&КонецПериода,
		|				Облигация В
		|					(ВЫБРАТЬ
		|						_ТаблицаИсточник.ЦеннаяБумага
		|					ИЗ
		|						_ТаблицаИсточник КАК _ТаблицаИсточник)) КАК КупонныйДоходПоОблигациямСрезПоследних
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = КупонныйДоходПоОблигациямСрезПоследних.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = УсловияОферт.Облигация
		|			И (&КонецПериода < УсловияОферт.ДатаВыкупа)
		|			И (НЕ УсловияОферт.ТолькоДляФизическихЛиц)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереопределенныеАктивы КАК _ПереопределенныеАктивы
		|		ПО _ТаблицаИсточник.Эмитент = _ПереопределенныеАктивы.Эмитент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО _ТаблицаИсточник.Эмитент = Эмитенты.Ссылка,
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаИсточник.ДополнительнаяАналитика,
		|	_ТаблицаИсточник.УчетныйАктив,
		|	_ТаблицаИсточник.ЦеннаяБумага,
		|	_ТаблицаИсточник.Резерв,
		|	_ТаблицаИсточник.НомерСтроки,
		|	_ТаблицаИсточник.ДатаРазмещения,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""(1) менее 3 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""(2) от 3 до 12 месяцев""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтГодаДоДвух)
		|			ТОГДА ""(3) от года до 2 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтДвухДоТрехЛет)
		|			ТОГДА ""(4) от 2 до 3 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехДоЧетырехЛет)
		|			ТОГДА ""(5) от 3 до 4 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтЧетырехДоПятиЛет)
		|			ТОГДА ""(6) от 4 до 5 лет""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеПятиЛет)
		|			ТОГДА ""(7) свыше 5 лет""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	_ТаблицаИсточник.Сумма,
		|	Облигации.Категория,
		|	_ТаблицаИсточник.НомерЦБ,
		|	_ТаблицаИсточник.Эмитент,
		|	_ТаблицаИсточник.АнализируемаяДата,
		|	НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона,
		|	КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона,
		|	Облигации.ДатаПогашения,
		|	НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо,
		|	ВЫБОР
		|		КОГДА НЕ _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ ЕСТЬ NULL
		|			ТОГДА _ПереопределенныеАктивы.НовыйУчетныйАктивЦБ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Акции).УчетныйАктивЦБРФ
		|				КОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаИсточник.ЦеннаяБумага КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	Эмитенты.ЮрФизЛицо,
		|	_ТаблицаИсточник.Группа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.Группа КАК Группа,
		|	_ИтоговаяТаблица.НомерСтроки КАК Раздел,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятьЛет
		|			ТОГДА ""(7) свыше 5 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ЧетыреГода
		|			ТОГДА ""(6) от 4 до 5 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриГода
		|			ТОГДА ""(5) от 3 до 4 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ДваГода
		|			ТОГДА ""(4) от 2 до 3 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""(3) от года до 2 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""(2) от 3 до 12 месяцев""
		|		ИНАЧЕ ""(1) менее 3 месяцев""
		|	КОНЕЦ КАК СрокРазмещения,
		|	СУММА(_ИтоговаяТаблица.Сумма) КАК Стоимость,
		|	СУММА(_ИтоговаяТаблица.Резерв) КАК РезервПодОбесценение,
		|	СУММА(_ИтоговаяТаблица.Сумма - _ИтоговаяТаблица.Резерв) КАК БалансоваяСтоимость,
		|	_ИтоговаяТаблица.ЦеннаяБумага КАК Актив,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|				ИЛИ _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ""Купон""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	_ИтоговаяТаблица.ДатаРазмещения КАК ДатаРазмещения,
		|	_ИтоговаяТаблица.АнализируемаяДата КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА ""Правительства Российской Федерации""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА ""Субъектов Российской Федерации и органов местного самоуправления""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА ""Иностранных государств""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА ""Кредитных организаций и банков-нерезидентов""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Некредитных финансовых организаций""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Нефинансовых организаций""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидЦБ,
		|	_ИтоговаяТаблица.НомерЦБ КАК НомерЦБ,
		|	_ИтоговаяТаблица.Эмитент КАК Эмитент,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА 1
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА 2
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА 3
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА 4
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 5
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 6
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПорядокВидовЦБ,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Акции""
		|			ТОГДА 1
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Облигации""
		|			ТОГДА 2
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Паи""
		|			ТОГДА 3
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""Депозитные вклдаы""
		|			ТОГДА 4
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""МНО""
		|			ТОГДА 5
		|		ИНАЧЕ 6
		|	КОНЕЦ КАК ПорядокРазделов
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица,
		|	_Периоды КАК _Периоды
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	_ИтоговаяТаблица.ЦеннаяБумага,
		|	_ИтоговаяТаблица.ДатаРазмещения,
		|	_ИтоговаяТаблица.АнализируемаяДата,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
		|				ИЛИ _ИтоговаяТаблица.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный)
		|			ТОГДА ""Купон""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	_ИтоговаяТаблица.НомерЦБ,
		|	_ИтоговаяТаблица.Эмитент,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятьЛет
		|			ТОГДА ""(7) свыше 5 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ЧетыреГода
		|			ТОГДА ""(6) от 4 до 5 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриГода
		|			ТОГДА ""(5) от 3 до 4 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ДваГода
		|			ТОГДА ""(4) от 2 до 3 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""(3) от года до 2 лет""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""(2) от 3 до 12 месяцев""
		|		ИНАЧЕ ""(1) менее 3 месяцев""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА ""Правительства Российской Федерации""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА ""Субъектов Российской Федерации и органов местного самоуправления""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА ""Иностранных государств""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА ""Кредитных организаций и банков-нерезидентов""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Некредитных финансовых организаций""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА ""Нефинансовых организаций""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки В (""Акции"", ""Облигации"", ""Паи"")
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
		|						ТОГДА 1
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные)
		|						ТОГДА 2
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств)
		|						ТОГДА 3
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыКредитныхОрганизаций)
		|						ТОГДА 4
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 5
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (&АктивыНефинансовыхОрганизаций)
		|							И НЕ _ИтоговаяТаблица.ЮрФизЛицо В (&ТаблицаФинансовыхОрганизаций)
		|						ТОГДА 6
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	_ИтоговаяТаблица.Группа";
	КонецЕсли;
	#КонецОбласти
	Запрос.УстановитьПараметр("ТаблицаИсточник", Результат);
	
	АктивыКредитныхОрганизаций = Новый Массив;
	АктивыКредитныхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов);
	АктивыКредитныхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги);
	АктивыКредитныхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков);
	АктивыКредитныхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков);
	АктивыКредитныхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов);
	АктивыКредитныхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги);
	АктивыКредитныхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов);
	
	АктивыНефинансовыхОрганизаций = Новый Массив;
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.Иное);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка());
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.Иное);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов);
	АктивыНефинансовыхОрганизаций.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("АктивыКредитныхОрганизаций", АктивыКредитныхОрганизаций);
	Запрос.УстановитьПараметр("АктивыНефинансовыхОрганизаций", АктивыНефинансовыхОрганизаций);
	
	//перечень фин организаций
	Запрос.УстановитьПараметр("ТаблицаФинансовыхОрганизаций", ТаблицаФинансовыхОрганизаций);
	
	
	Возврат Новый Структура("ТаблицаИсточник", Запрос.Выполнить().Выгрузить());

КонецФункции // ПолучитьВнешниеНаборыДанных()

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции
 
