
&НаСервере
Процедура СкопироватьНастройкиНаСервере(Отчет = Неопределено, ПараметрыСессии = Неопределено)

	Расшифровка = Неопределено;	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СкопироватьНастройки(Расшифровка, ПараметрыСессии);
	
	Если Расшифровка <> Неопределено Тогда
		Отчет = ОбработкаОбъект.СформироватьОтчетОПроделанныхОперациях(Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРегистрНастроекНаСервере(РегистрМД)

	ЭтаФорма.РегистрыНастроек.Добавить(РегистрМД.Имя, РегистрМД.Синоним, Истина);
	
КонецПроцедуры

#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиЦелейРасчета);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧА);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧАПоВидамЗадолженности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаБенчмарков);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаПлановойДоходности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.СоставИНастройкиОтчетов);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.ЗначенияДополнительныхСведений);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаСкопироватьНастройки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСкопироватьНастройки");
	ВыполнитьКопированиеНастроек(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКопированиеНастроек(ПараметрыСессии)
	
	Объект.КопируемыеРегистры.Очистить();
	
	Для Каждого РегистрНастроек Из ЭтаФорма.РегистрыНастроек Цикл
		Если РегистрНастроек.Пометка Тогда
			Объект.КопируемыеРегистры.Добавить(РегистрНастроек.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.КопируемыеРегистры.Количество() = 0 Тогда
		ТекстОшибки = "Не выбран ни один регистр с настройками";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "РегистрыНастроек");
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		Возврат;
	ИначеЕсли Не ПроверитьЗаполнение() Тогда
		ТекстОшибки = "Не заполнены обязательные поля";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;	
	
	Отчет = Неопределено;
	
	СкопироватьНастройкиНаСервере(Отчет, ПараметрыСессии);
	
	Если Отчет <> Неопределено Тогда		
		Отчет.Показать("Отчет о скопированных настройках");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьОтметкиВсехНастроек(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаУстановитьОтметкиВсехНастроек");
	ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Истина);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьОтметкиВсехНастроек(Команда)

	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСнятьОтметкиВсехНастроек");
	ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Ложь);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
