
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",        КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые", Ложь);
	
КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
Процедура КомандаПоказатьСкрытьЗакрытые(Команда)
	
	Элементы.КомандаПоказатьСкрытьЗакрытые.Пометка = Не Элементы.КомандаПоказатьСкрытьЗакрытые.Пометка;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые",
		Элементы.КомандаПоказатьСкрытьЗакрытые.Пометка);
	
КонецПроцедуры
