
// Возвращает абсолютную величину числа
//
// Параметры:
//  Число - Число - Число, абсолютную величину которого необходимо получить
// 
// Возвращаемое значение:
//  Число - Абсолютная величина аргумента
//
Функция МодульЧисла(Значение) Экспорт
	Возврат ?(Значение < 0, -Значение, Значение);
КонецФункции

// Возвращает знак числа
//
// Параметры:
//  Число - Число - Число, знак которого необходимо получить
// 
// Возвращаемое значение:
//  Число - Возвращаемые значения: -1 - если число отрицательное; 1 - если число положительное; 0 - если ноль
//
Функция ЗнакЧисла(Значение) Экспорт

	Если Значение > 0 Тогда
	
		Возврат 1;
		
	ИначеЕсли Значение < 0 Тогда
		
		Возврат -1;
		
	Иначе
		
		Возврат 0;
	
	КонецЕсли; 

КонецФункции

Функция ЛинейнаяИнтерполяция(Точка, ДискретныеЗначения, ПолеТочек = "Параметр", ПолеЗначений = "Значение", РасшифровкаРасчета = Неопределено) Экспорт
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаОперации = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Линейная интерполяция значения в точке " + Точка, "Дискретные значения", ДискретныеЗначения, Истина);
		РезультатРасчета	= Новый Структура("Точка", Точка);
	КонецЕсли;
	
	НайденноеЗначение = ДискретныеЗначения.Найти(Точка, ПолеТочек);
	
	Если НайденноеЗначение <> Неопределено Тогда
		
		// Если точка совпадает с узловой, то возвращаем соответствующее ей значение 

		Результат = НайденноеЗначение[ПолеЗначений];
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РезультатРасчета.Вставить("Описание", "Точка совпадает с узловой");
		КонецЕсли;
		
	Иначе
	
		// Найдем ближайшие точки и границы
		
		МинимальнаяТочка			= Неопределено;
		ЗначениеМинимальнойТочки	= Неопределено;
		
		МаксимальнаяТочка			= Неопределено;
		ЗначениеМаксимальнойТочки	= Неопределено;
		
		ЛеваяТочка					= Неопределено;
		ЗначениеЛевойТочки			= Неопределено;
		
		ПраваяТочка					= Неопределено;
		ЗначениеПравойТочки			= Неопределено;
		
		Для Каждого СтрокаУзла Из ДискретныеЗначения Цикл
			
			Узел		= СтрокаУзла[ПолеТочек];
			Значение	= СтрокаУзла[ПолеЗначений];
				
			Если Точка < Узел И (ПраваяТочка = Неопределено ИЛИ Узел < ПраваяТочка) Тогда
				ПраваяТочка			= Узел;
				ЗначениеПравойТочки	= Значение;
			ИначеЕсли Точка > Узел И (ЛеваяТочка = Неопределено ИЛИ Узел > ЛеваяТочка) Тогда
				ЛеваяТочка			= Узел;
				ЗначениеЛевойТочки	= Значение;
			КонецЕсли;
			
			Если МинимальнаяТочка = Неопределено ИЛИ МинимальнаяТочка > Узел Тогда
				МинимальнаяТочка			= Узел;
				ЗначениеМинимальнойТочки	= Значение;
			КонецЕсли;
				
			Если МаксимальнаяТочка = Неопределено ИЛИ МаксимальнаяТочка < Узел Тогда
				МаксимальнаяТочка			= Узел;
				ЗначениеМаксимальнойТочки	= Значение;
			КонецЕсли;
			
		КонецЦикла;

		// Интерполяция
		
		Если Точка > МаксимальнаяТочка Тогда
			
			Результат = ЗначениеМаксимальнойТочки;
					
			Если РасшифровкаРасчета <> Неопределено Тогда
				РезультатРасчета.Вставить("МаксимальнаяТочка", МаксимальнаяТочка);
				РезультатРасчета.Вставить("Описание",		   "Точка больше максимальной узловой");
			КонецЕсли;

		ИначеЕсли Точка < МинимальнаяТочка Тогда
			
			Результат = ЗначениеМинимальнойТочки;
			
			Если РасшифровкаРасчета <> Неопределено Тогда
				РезультатРасчета.Вставить("МинимальнаяТочка", МинимальнаяТочка);
				РезультатРасчета.Вставить("Описание",		  "Точка меньше минимальной узловой");
			КонецЕсли;
			
		Иначе
			
			Результат = ЗначениеЛевойТочки + (ЗначениеПравойТочки - ЗначениеЛевойТочки) / (ПраваяТочка - ЛеваяТочка) * (Точка - ЛеваяТочка);
			
			Если РасшифровкаРасчета <> Неопределено Тогда
				РезультатРасчета.Вставить("ЛеваяТочка",			 ЛеваяТочка);
				РезультатРасчета.Вставить("ПраваяТочка",		 ПраваяТочка);
				РезультатРасчета.Вставить("ЗначениеЛевойТочки",	 ЗначениеЛевойТочки);
				РезультатРасчета.Вставить("ЗначениеПравойТочки", ЗначениеПравойТочки);
				РезультатРасчета.Вставить("Описание",			 "Точка между узловыми");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РезультатРасчета.Вставить("Значение", Результат);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Результат интерполяции", РезультатРасчета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОкрВверхДоЦелого(ИсходноеЧисло) Экспорт
	
	Возврат ?(Цел(ИсходноеЧисло) = ИсходноеЧисло, ИсходноеЧисло, Цел(ИсходноеЧисло) + 1);
	
КонецФункции

