&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

	// начальное заполнение формы
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
	Объект.Дата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
	Объект.ДатаРезультатовОтИнвестирования = Объект.Дата;
	
	ОбновитьАктуальностьИПЦНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;	
	
	ОбновитьАктуальностьИПЦНаСервере();
	
	ОбновитьВидимостьАктуальностиИнфляции();
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАктуальностьИПЦНаСервере()
	
	Объект.ДатаРезультатовОтИнвестирования = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Объект.Дата);
	
	ЗначениеИнфляции = РегистрыСведений.ПроцентныеПоказатели.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Показатель,Прогноз,Источник,ДатаЗначения", Перечисления.ВидыПроцентныхПоказателей.ИПЦкКонцуПредыдущегоМесяца, Ложь, ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Росстат"), НачалоДня(КонецМесяца(Объект.Дата)))).ЗначениеПоказателя;
	
	ДанныеПоИнфляцииНеАктуальны = ЗначениеИнфляции = 0;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьАктуальностиИнфляции()
	
	Этаформа.Элементы.ДекорацияАктуальность.Видимость = ДанныеПоИнфляцииНеАктуальны;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьАктуальностиИнфляции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры

&НаКлиенте
Процедура ПаевойИнвестиционныйФондПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры
