
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.ЗначениеХарактеристики <> 0 И Не ЗначениеЗаполнено(СтрокаНабора.Характеристика) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта " + СтрокаНабора.ОбъектНедвижимости + " не указана характеристика",,,, Отказ);
		ИначеЕсли СтрокаНабора.ЗначениеХарактеристики <> 0 Тогда
			Если СтрокаНабора.ОбъектНедвижимости.ВидОбъектаНедвижимости <> Перечисления.ВидыОбъектовНедвижимости.Сооружение
				И СтрокаНабора.Характеристика <> Справочники.ХарактеристикиОбъектовНедвижимости.Площадь Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта " + СтрокаНабора.ОбъектНедвижимости + " в качестве характеристики может быть выбрана только площадь",,,, Отказ);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрокаНабора.Характеристика) И СтрокаНабора.ЗначениеХарактеристики = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта " + СтрокаНабора.ОбъектНедвижимости + " не указано значение характеристики",,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
