
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЭтоВыводПоОбменуПаев = ТипЗнч(Данные.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;
			
	Если Данные.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику Тогда
		Представление = "Вывод д/с при погашении паев ";
	ИначеЕсли ЭтоВыводПоОбменуПаев Тогда
		Представление = "Вывод д/с по обмену паев ";	
	Иначе
		Представление = "Вывод денежных средств ";
	КонецЕсли;

	Представление = Представление + СокрЛП(Данные.Номер) + " от " + Данные.Дата;
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВидОперации");
	Поля.Добавить("Основание");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
