
Процедура ОбработатьЗадачи() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
		|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
		|	ЗадачаИсполнителя.Основание КАК Основание,
		|	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) В (ТИП(БизнесПроцесс.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев), ТИП(БизнесПроцесс.ЗачислениеПаев), ТИП(БизнесПроцесс.ПогашениеПаев), ТИП(БизнесПроцесс.ОбменПаев))
		|	И ЗадачаИсполнителя.ГруппаИсполнителей = &СистемныеПользователи
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("СистемныеПользователи",
		Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(
				ОбщегоНазначения.ПолучитьИменованныйОбъект("СистемныеПользователи"),
				ЭтотОбъект.Организация));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			ЗадачаОбъект.ВыполнитьЗадачу();
		Исключение
			//##Возможно, сформировать оповещение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры