
#Область Обработчики_событий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);	
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	// установим активность движений
	Если Не ЭтотОбъект.ЭтоНовый() И ЭтотОбъект.Ссылка.ПометкаУдаления <> ЭтотОбъект.ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(Не ПометкаУдаления);
	КонецЕсли;   
	
	ЭтотОбъект.Движения.СведенияОбОценкеИнвестиционныхРисков.Записывать = Истина;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

Процедура УстановитьАктивностьДвижений(ФлагАктивности)
	
	ЭтотОбъект.Движения.СведенияОбОценкеИнвестиционныхРисков.Прочитать();	
	ЭтотОбъект.Движения.СведенияОбОценкеИнвестиционныхРисков.УстановитьАктивность(ФлагАктивности);
		
КонецПроцедуры

#КонецОбласти
