&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая() Тогда
		Объект.Ключ = Неопределено;		
	КонецЕсли; 
	
	Если ТипЗнч(Объект.Ключ) = Тип("Строка") Тогда
		ЭтаФорма.ВидОтчета = 0;
	ИначеЕсли ТипЗнч(Объект.Ключ) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		ЭтаФорма.ВидОтчета = 1;
	Иначе
		ЭтаФорма.ВидОтчета = 2;
	КонецЕсли;
	
	ПривестиТипКлюча(ЭтаФорма);
	
	НастроитьВидимостьДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	Объект.Ключ = Неопределено;
	
	ПривестиТипКлюча(ЭтаФорма);
	
	НастроитьВидимостьДоступность(ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура КлючПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ключ) Тогда
		
		ПараметрыФормы = ПолучитьПараметрыФормы(Объект.Ключ);
		
		Если ЗначениеЗаполнено(ПараметрыФормы.ОписаниеОшибки) Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПараметрыФормы.ОписаниеОшибки);
			Возврат;
		
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ПараметрыФормы.ИмяФормы) Тогда
		
			ОткрытьФорму(ПараметрыФормы.ИмяФормы, ПараметрыФормы.Параметры);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить имя формы по заданному ключу");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступныеНастройки(Команда)
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для обновления настроек отчет необходимо записать");
	Иначе
		Если Вопрос("Установить стандартные доступные настройки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
			ОбновитьДоступныеНастройкиНаСервере(Объект.Ссылка);
		КонецЕсли; 		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормы(Ключ)

	Возврат Справочники.Отчеты.ПолучитьПараметрыФормыОтчета(Ключ);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПривестиТипКлюча(ЭтаФорма)
	
	ЭлементКлюч = ЭтаФорма.Элементы.Ключ;
	
	Если ЭтаФорма.ВидОтчета = 0 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255));
	ИначеЕсли ЭтаФорма.ВидОтчета = 1 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
	Иначе
		ОписаниеТипов = Новый ОписаниеТипов("Неопределено");
	КонецЕсли; 
	
	ЭлементКлюч.ОграничениеТипа = ОписаниеТипов;
	
	// Определим список отчетов
	
	ЭлементКлюч.РежимВыбораИзСписка = Ложь;
	ЭлементКлюч.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);	
	ЭлементКлюч.СписокВыбора.Очистить();
	
	Если ЭтаФорма.ВидОтчета = 2 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();	
	
	Если ЭтаФорма.ВидОтчета = 0 ИЛИ Не ЭтоПолноправныйПользователь Тогда
		
		СписокОтчетов = ПолучитьСписокОтчетов(ЭтаФорма.ВидОтчета, Не ЭтоПолноправныйПользователь); 
		
		Если ЭтаФорма.ВидОтчета = 1 И Не ЭтоПолноправныйПользователь Тогда
			
			ПараметрыВыбора = Новый Массив();
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", СписокОтчетов.ВыгрузитьЗначения()));
			
			ЭлементКлюч.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
			
		Иначе
			
			ЭлементКлюч.РежимВыбораИзСписка = Истина;
			
			Для Каждого Отчет Из СписокОтчетов Цикл
				ЗаполнитьЗначенияСвойств(ЭлементКлюч.СписокВыбора.Добавить(), Отчет);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокОтчетов(ВидОтчета, ТолькоИспользуемыеОтчеты)

	Если ТолькоИспользуемыеОтчеты Тогда	
		ИсточникОтчетов = ПолучитьИспользуемыеОтчеты(ВидОтчета);	
	Иначе
		ИсточникОтчетов = Метаданные.Отчеты;	
	КонецЕсли;
	
	СписокОтчетов = Новый СписокЗначений;
	
	Для Каждого Отчет Из ИсточникОтчетов Цикл
		СписокОтчетов.Добавить(Отчет.Имя, Отчет.Синоним);
	КонецЦикла;
		
	СписокОтчетов.СортироватьПоПредставлению();
	
	Возврат СписокОтчетов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИспользуемыеОтчеты(ВидОтчета)
	
	СписокОтчетов = Новый СписокЗначений;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Отчеты.Ключ КАК Имя,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Синоним
		|ИЗ
		|	Справочник.Отчеты КАК Отчеты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВидОтчета = 0
		|				ТОГДА ТИПЗНАЧЕНИЯ(Отчеты.Ключ) = ТИП(СТРОКА)
		|			КОГДА &ВидОтчета = 1
		|				ТОГДА ТИПЗНАЧЕНИЯ(Отчеты.Ключ) = ТИП(Справочник.ДополнительныеОтчетыИОбработки)
		|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);
	
	ИспользуемыеОтчеты = Запрос.Выполнить().Выгрузить();		
	
	Если ВидОтчета = 0 Тогда
		Для Каждого Отчет Из ИспользуемыеОтчеты Цикл
			МетаОтчет = Метаданные.Отчеты.Найти(Отчет.Имя);
			Если МетаОтчет <> Неопределено Тогда
				Отчет.Синоним = МетаОтчет.Синоним;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИспользуемыеОтчеты;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(ЭтаФорма)
	
	Объект		= ЭтаФорма.Объект;
	Элементы	= ЭтаФорма.Элементы;
	
	Элементы.ФормаОткрытьОтчет.Доступность = ЗначениеЗаполнено(Объект.Ключ);	
	
	Элементы.Ключ.Видимость = (ЭтаФорма.ВидОтчета <> 2);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДоступныеНастройкиНаСервере(Отчет)
	
	Справочники.Отчеты.УстановитьСтандартныеДоступныеНастройки(Отчет);	
	
КонецПроцедуры