
&НаСервере
Процедура КонтрольРасчетногоНКДНаСервере()
	
	Если РольДоступна("ПолныеПрава") Тогда
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания, ЭтаФорма.Результат, ЭтаФорма.ОрганизацияВыбор);
	Иначе
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания,  ЭтаФорма.Результат, ПараметрыСеанса.ТекущаяОрганизация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольРасчетногоНКД(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КонтрольРасчетногоНКД");
	КонтрольРасчетногоНКДНаСервере();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ОрганизацияВыбор = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Дата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Константы.ОсновнойКалендарьКотировок.Получить(), НачалоДня(НачалоДня(ТекущаяДата()) - 1));
	
	ЭтаФорма.Элементы.Организация.Видимость = НЕ РольДоступна("ПолныеПрава");
	ЭтаФорма.Элементы.ОрганизацияВыбор.Видимость = РольДоступна("ПолныеПрава");
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПисьмаНаСервере()
	РеквизитФормыВЗначение("Объект").ПроверитьРасчетныйНКД(Новый Структура("ДатаНачала, ДатаОкончания, Биржа, ПроверятьКотировкиЦенныхБумаг", Период.ДатаНачала, Период.ДатаОкончания, ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"), Ложь));
КонецПроцедуры

&НаКлиенте
Процедура Письма(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Письма");
	ПисьмаНаСервере();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
	
КонецПроцедуры

#КонецОбласти
