
&НаСервере
Процедура КонтрольРасчетногоНКДНаСервере()
	
	Если РольДоступна("ПолныеПрава") Тогда
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания, ЭтаФорма.Результат, ЭтаФорма.ОрганизацияВыбор);
	Иначе
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания,  ЭтаФорма.Результат, ПараметрыСеанса.ТекущаяОрганизация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольРасчетногоНКД(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КонтрольРасчетногоНКД");
	Попытка
		КонтрольРасчетногоНКДНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ОрганизацияВыбор = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Дата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Константы.ОсновнойКалендарьКотировок.Получить(), НачалоДня(НачалоДня(ТекущаяДата()) - 1));
	
	ЭтаФорма.Элементы.Организация.Видимость = НЕ РольДоступна("ПолныеПрава");
	ЭтаФорма.Элементы.ОрганизацияВыбор.Видимость = РольДоступна("ПолныеПрава");
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПисьмаНаСервере()
	РеквизитФормыВЗначение("Объект").ПроверитьРасчетныйНКД(Новый Структура("ДатаНачала, ДатаОкончания, Биржа, ПроверятьКотировкиЦенныхБумаг", Период.ДатаНачала, Период.ДатаОкончания, ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"), Ложь));
КонецПроцедуры

&НаКлиенте
Процедура Письма(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Письма");
	Попытка
		ПисьмаНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
