&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Организация", ЭтаФорма.Организация);
	Параметры.Свойство("Договор",     ЭтаФорма.Договор);
	Параметры.Свойство("Период",      ЭтаФорма.Период);
	
	ЭтаФорма.ПериодПриОткрытии = ЭтаФорма.Период;
	
	ПрочитатьДанныеЗаписей();
	
	// Пытаемся заблокировать данные, т.к. система не устанавливает блокировку автоматически
	Если Не ВыполнитьБлокировкуДанных() Тогда

		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьБлокировкуДанных()
	
	ЗаблокированныеЗаписи = Новый СписокЗначений;
	Попытка

		Для Каждого СтрокаДанных Из ДанныеЗаписей Цикл

			Отбор = Новый Структура("Организация, Договор, ВидОтчетности");
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаДанных);
			
			КлючЗаписи = РегистрыСведений.УсловияДоговоровОказанияАудиторскихУслуг.СоздатьКлючЗаписи(Отбор);
			ЗаблокироватьДанныеДляРедактирования(КлючЗаписи, , ЭтаФорма.УникальныйИдентификатор);
			ЗаблокированныеЗаписи.Добавить(КлючЗаписи);
			
		КонецЦикла;	
		
		Возврат Истина;
		
	Исключение                  
		
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
		РазблокироватьДанные();
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура РазблокироватьДанные()

	Для Каждого ЭлементСписка Из ЗаблокированныеЗаписи Цикл
		
		РазблокироватьДанныеДляРедактирования(ЭлементСписка.Значение, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ПрочитатьДанныеЗаписей()
	
	ДанныеЗаписей.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",  ЭтаФорма.Период);
	Запрос.УстановитьПараметр("Договор", ЭтаФорма.Договор);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияДоговоровОказанияАудиторскихУслуг.ВидОтчетности КАК ВидОтчетности,
		|	УсловияДоговоровОказанияАудиторскихУслуг.ДатаНачалаПредоставленияУслуг КАК ДатаНачалаПредоставленияУслуг,
		|	УсловияДоговоровОказанияАудиторскихУслуг.ДатаОкончанияПредоставленияУслуг КАК ДатаОкончанияПредоставленияУслуг,
		|	УсловияДоговоровОказанияАудиторскихУслуг.Стоимость КАК Стоимость
		|ИЗ
		|	РегистрСведений.УсловияДоговоровОказанияАудиторскихУслуг КАК УсловияДоговоровОказанияАудиторскихУслуг
		|ГДЕ
		|	УсловияДоговоровОказанияАудиторскихУслуг.Период = &Период
		|	И УсловияДоговоровОказанияАудиторскихУслуг.Договор = &Договор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДанныеЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция ЗаписатьДанные()
	
	РазблокироватьДанные();
	
	НачатьТранзакцию();
	
	Попытка
		
		// Очистка существующих записей в случае изменения периода
		Если ЗначениеЗаполнено(ЭтаФорма.ПериодПриОткрытии) Тогда
			
			НовыйНаборЗаписей = РегистрыСведений.УсловияДоговоровОказанияАудиторскихУслуг.СоздатьНаборЗаписей();
			НовыйНаборЗаписей.Отбор.Период.Установить(ЭтаФорма.ПериодПриОткрытии);
			НовыйНаборЗаписей.Отбор.Договор.Установить(ЭтаФорма.Договор);
			НовыйНаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
		НовыйНаборЗаписей = РегистрыСведений.УсловияДоговоровОказанияАудиторскихУслуг.СоздатьНаборЗаписей();
		НовыйНаборЗаписей.Отбор.Период.Установить(ЭтаФорма.Период);
		НовыйНаборЗаписей.Отбор.Договор.Установить(ЭтаФорма.Договор);
		
		Для Каждого СтрокаЗаписей Из ДанныеЗаписей Цикл
			
			НоваяЗапись = НовыйНаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаЗаписей);
			НоваяЗапись.Период      = ЭтаФорма.Период;
			НоваяЗапись.Организация = ЭтаФорма.Организация;
			НоваяЗапись.Договор     = ЭтаФорма.Договор;
			НоваяЗапись.Активность  = Истина;
			
		КонецЦикла;	
		
		НовыйНаборЗаписей.Записать(Ложь);
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.ПериодПриОткрытии  = ЭтаФорма.Период;
		
		ЗафиксироватьТранзакцию();
		
		ВыполнитьБлокировкуДанных();
		
		Возврат Истина;
		
	Исключение

		ТекстОшибки = "Не удалось записать условия оказания аудиторских услуг. Система сообщает:" + Символы.ПС;
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки + ОписаниеОшибки);

		ОтменитьТранзакцию();
		
		Возврат Ложь;
		
	КонецПопытки;	
	
КонецФункции

&НаКлиенте
Процедура Записать(Команда)
	
	Если ЗаписатьНаСервере() Тогда
		
		Оповестить("ИзменениеУсловийДоговоровОказанияАудиторскихУслуг");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЗаписатьНаСервере(Истина) Тогда
		
		Оповестить("ИзменениеУсловийДоговоровОказанияАудиторскихУслуг");
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере(Закрыть = Ложь)

	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;

	Результат = ЗаписатьДанные();

	СчетВнутреннегоУчета = Справочники.Договоры.СчетВнутреннегоУчетаПоДоговору(ЭтаФорма.Организация, ЭтаФорма.Договор);
	Если СчетВнутреннегоУчета <> Неопределено Тогда
		
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетВнутреннегоУчета, "ВидДоговораДоверительногоУправления");
		
	Иначе
		
		ВидДоговора = Неопределено;
		
	КонецЕсли;	

	Если Результат И Закрыть И ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный Тогда
		
        // Для вида договора доверительного управления Собственный нет запрета на запись, если виды отчетности не проходят контроль.
		// Если выполнить команду ЗаписатьИЗакрыть, то сообщения выводятся на закрывающуюся форму и пользователь их не увидит.
		// Поэтому запоминаем сообщения пользователю, чтобы вывести после закрытия формы, но только когда запись прошла (Результат = Истина)
		СообщенияПользователюПриЗакрытииФормы.Очистить();
		Сообщения = ПолучитьСообщенияПользователю(Ложь);
		Для Каждого Сообщение Из Сообщения Цикл
			СообщенияПользователюПриЗакрытииФормы.Добавить(Сообщение);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если ЗавершениеРаботы Тогда
			
			ТекстПредупреждения = "Данные были изменены. Чтобы сохранить данные, необходимо выбрать ""Продолжить работу"" и выполнить запись.";
			Отказ = Истина;
			
		ИначеЕсли Не ЭтаФорма.ЗакрытиеРазрешено Тогда
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), 
							"Данные были изменены. Выполнить запись данных перед закрытием?", 
							РежимДиалогаВопрос.ДаНет);
			Отказ = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если ЗаписатьНаСервере(Истина) Тогда
			
			ЭтаФорма.ЗакрытиеРазрешено = Истина;
			Закрыть();			
			
		КонецЕсли;	
		
	Иначе	
		
		ЗакрытиеРазрешено = Истина;
		Закрыть();			
		
	КонецЕсли;	
 	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЗавершениеРаботы Тогда
		
		РазблокироватьДанные();

        Для Каждого Элемент Из СообщенияПользователюПриЗакрытииФормы Цикл
            Сообщение = Элемент.Значение;
			//Сообщение.ИдентификаторНазначения = Новый УникальныйИдентификатор;
            Сообщение.Сообщить();
        КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры
