
Процедура ПриЗаписи(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПоследовательностьСтатусов(Отказ);
	 
КонецПроцедуры

Функция ПроверитьПоследовательностьСтатусов(Отказ)

	КолонкиИзмерений = "Организация, Объект, ВидПеречня";
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		
		Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
		
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, КолонкиИзмерений);
		
		ТаблицаОтбора = ЭтотОбъект.ВыгрузитьКолонки(КолонкиИзмерений);
		ЗаполнитьЗначенияСвойств(ТаблицаОтбора.Добавить(), ЗначенияРеквизитов);
		
	Иначе
		
		ТаблицаОтбора = ЭтотОбъект.Выгрузить(, КолонкиИзмерений);
		ТаблицаОтбора.Свернуть(КолонкиИзмерений);
		
	КонецЕсли; 
		
	#Область Текст_запроса_контроля_последовательности_статусов
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтбора.Организация КАК Организация,
		|	ТаблицаОтбора.Объект КАК Объект,
		|	ТаблицаОтбора.ВидПеречня КАК ВидПеречня
		|ПОМЕСТИТЬ _ТаблицаОтбора
		|ИЗ
		|	&ТаблицаОтбора КАК ТаблицаОтбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнутренниеПеречни.Период КАК Период,
		|	ВнутренниеПеречни.Организация КАК Организация,
		|	ВнутренниеПеречни.Объект КАК Объект,
		|	ВнутренниеПеречни.ВидПеречня КАК ВидПеречня,
		|	ВнутренниеПеречни.Действует КАК Действует
		|ПОМЕСТИТЬ _ВнутренниеПеречни
		|ИЗ
		|	РегистрСведений.ВнутренниеПеречни КАК ВнутренниеПеречни
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаОтбора КАК _ТаблицаОтбора
		|		ПО ВнутренниеПеречни.Организация = _ТаблицаОтбора.Организация
		|			И ВнутренниеПеречни.Объект = _ТаблицаОтбора.Объект
		|			И ВнутренниеПеречни.ВидПеречня = _ТаблицаОтбора.ВидПеречня
		|			И (ВнутренниеПеречни.Активность)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнутренниеПеречни.Организация КАК Организация,
		|	_ВнутренниеПеречни.Объект КАК Объект,
		|	_ВнутренниеПеречни.ВидПеречня КАК ВидПеречня,
		|	_ВнутренниеПеречни.Период КАК Дата,
		|	МАКСИМУМ(_ВнутренниеПеречниПредыдущий.Период) КАК ПредыдущаяДата
		|ПОМЕСТИТЬ _Периоды
		|ИЗ
		|	_ВнутренниеПеречни КАК _ВнутренниеПеречни
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнутренниеПеречни КАК _ВнутренниеПеречниПредыдущий
		|		ПО _ВнутренниеПеречни.Период > _ВнутренниеПеречниПредыдущий.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВнутренниеПеречни.Период,
		|	_ВнутренниеПеречни.Организация,
		|	_ВнутренниеПеречни.Объект,
		|	_ВнутренниеПеречни.ВидПеречня
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущийПериод.Период КАК Дата,
		|	ТекущийПериод.Организация КАК Организация,
		|	ТекущийПериод.Объект КАК Объект,
		|	ТекущийПериод.ВидПеречня КАК ВидПеречня,
		|	ТекущийПериод.Действует КАК ТекущийСтатус,
		|	ПредыдующийПериод.Период КАК ПредыдущаяДата,
		|	ПредыдующийПериод.Действует КАК ПредыдущийСтатус
		|ИЗ
		|	_Периоды КАК _Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнутренниеПеречни КАК ТекущийПериод
		|		ПО _Периоды.Дата = ТекущийПериод.Период
		|			И _Периоды.Организация = ТекущийПериод.Организация
		|			И _Периоды.Объект = ТекущийПериод.Объект
		|			И _Периоды.ВидПеречня = ТекущийПериод.ВидПеречня
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнутренниеПеречни КАК ПредыдующийПериод
		|		ПО _Периоды.ПредыдущаяДата = ПредыдующийПериод.Период
		|			И _Периоды.Организация = ПредыдующийПериод.Организация
		|			И _Периоды.Объект = ПредыдующийПериод.Объект
		|			И _Периоды.ВидПеречня = ПредыдующийПериод.ВидПеречня
		|ГДЕ
		|	(НЕ ТекущийПериод.Действует
		|				И ПредыдующийПериод.Действует ЕСТЬ NULL
		|			ИЛИ ТекущийПериод.Действует = ПредыдующийПериод.Действует)";
	#КонецОбласти 	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаОтбора", ТаблицаОтбора);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщение = "Нарушена последовательность ввода документов: ";
		
		Если Выборка.ПредыдущийСтатус = Null Тогда
			// Первый статус - Исключен
			Сообщение = Сообщение + "'%1' не включен в перечень '%2' по организации '%3' на " 
				+ Формат(Выборка.Дата, "");
		ИначеЕсли Выборка.ТекущийСтатус Тогда
			// Два включения подряд
			Сообщение = Сообщение + "'%1' включен в перечень '%2' по организации '%3' " 
				+ Формат(Выборка.ПредыдущаяДата, "") + " и "
				+ Формат(Выборка.Дата, "");
		Иначе
			// Два исключения подряд
			Сообщение = Сообщение + "'%1' исключен из перечня '%2' по организации '%3' " 
				+ Формат(Выборка.ПредыдущаяДата, "") + " и "
				+ Формат(Выборка.Дата, "");
		КонецЕсли;
		
		Сообщение = СтрШаблон(Сообщение, Выборка.Объект, Выборка.ВидПеречня, Выборка.Организация);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, Регистратор,,, Отказ); 
	
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции
