

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчетность 4777-У: Приложение 8",
		"0.09",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
		
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрДата = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период").Значение;
	ПараметрОрганизация = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Организация").Значение;

	Если Не ЗначениеЗаполнено(ПараметрДата) или Не ЗначениеЗаполнено(ПараметрОрганизация) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены исходные параметры.",,,, );
		Возврат;
		
	КонецЕсли;
	
	//старт сессии
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация,Дата");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ПараметрПериод = КонецДня(ПараметрДата.Дата);
	
	Запрос = ПодготовитьЗапрос(ПараметрПериод, ПараметрОрганизация);
	
	ПакетныйРезультатЗапроса  = Запрос.ВыполнитьПакет();
	ПредоставляемыеПоказатели = ПакетныйРезультатЗапроса[ПакетныйРезультатЗапроса.Количество() - 1].Выгрузить();
	АктивыСраховойКомпании	  = ПакетныйРезультатЗапроса[ПакетныйРезультатЗапроса.Количество() - 2].Выгрузить();

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
	
	ВнешниеНаборыДанных = Новый Структура();
	
	ВнешниеНаборыДанных.Вставить("АктивыСтраховойКомпанииПодробно", АктивыСраховойКомпании);
	ВнешниеНаборыДанных.Вставить("ПредоставляемыеПоказателиСтраховыхКомпаний", ПредоставляемыеПоказатели);	
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ДокументРезультат.Очистить();

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

Функция ПодготовитьЗапрос(Период, Организация) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетаДоверительногоУправления.Ссылка КАК СчетУчета
	|ПОМЕСТИТЬ _ДействующиеСчетаУчета
	|ИЗ
	|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
	|ГДЕ
	|	СчетаДоверительногоУправления.Организация = &Организация
	|	И СчетаДоверительногоУправления.ВидСчетаДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовДоверительногоУправления.Договор)
	|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.КонтрольСтраховыхКомпаний)
	|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ &Период МЕЖДУ СчетаДоверительногоУправления.ДатаЗаключения И СчетаДоверительногоУправления.ДатаРасторжения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияДополнительныхСведений.Значение КАК ВидПортфеляСтраховойКомпании,
	|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
	|	СчетаУчета.Ссылка КАК СчетУчета
	|ПОМЕСТИТЬ _РазделыПортфелейСтраховыхКомпаний
	|ИЗ
	|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
	|			ПО ЗначенияДополнительныхСведений.Свойство = ДополнительныеСведения.Ссылка
	|		ПО СчетаДоверительногоУправления.Ссылка = ЗначенияДополнительныхСведений.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаУчета
	|		ПО СчетаДоверительногоУправления.Родитель = СчетаУчета.Ссылка
	|ГДЕ
	|	СчетаДоверительногоУправления.Организация = &Организация
	|	И ДополнительныеСведения.Ключ = ""СчетаДоверительногоУправления.КонтрольСтраховыхКомпаний.ВидПортфеляСтраховойКомпании""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	""Денежная наличность в кассе"" КАК КлассАктива,
	|	"""" КАК ИдентификаторАктива,
	|	"""" КАК НаименованиеАктива,
	|	"""" КАК ИНН_TIN,
	|	ОстаткиПрочихАктивовОстатки.Валюта КАК Валюта,
	|	СУММА(ОстаткиПрочихАктивовОстатки.КоличествоОстаток) КАК Количество,
	|	СУММА(ОстаткиПрочихАктивовОстатки.СуммаОстаток) КАК Сумма,
	|	ОстаткиПрочихАктивовОстатки.Актив КАК Актив,
	|	ОстаткиПрочихАктивовОстатки.Субъект КАК СубъектПрочегоАктива,
	|	NULL * 7 КАК ГосударственныйРегистрационныйНомер,
	|	NULL * 8 КАК СтранаРегистрации,
	|	NULL * 9 КАК Субординированность,
	|	NULL КАК ПроцентДепозита,
	|	NULL КАК ДатаРазмещенияДепозитногоВклада,
	|	NULL КАК ДатаПогашенияДепозита
	|ПОМЕСТИТЬ _ВсеАктивыСтраховыхКомпаний
	|ИЗ
	|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
	|			&Период,
	|			Актив.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.Кассы)
	|				И Организация = &Организация) КАК ОстаткиПрочихАктивовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК ДействующиеСчетаУчета
	|		ПО ((ВЫРАЗИТЬ(ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)) = ДействующиеСчетаУчета.СчетУчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПрочихАктивовОстатки.Валюта,
	|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
	|	ОстаткиПрочихАктивовОстатки.Актив,
	|	ОстаткиПрочихАктивовОстатки.Субъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления,
	|	""Денежные средства на счетах в кредитных организациях"",
	|	БанковскиеСчета.НомерСчета,
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, РеквизитыЮридическихЛицСрезПоследних.TIN),
	|	ОстаткиДенежныхСредствОстатки.Валюта,
	|	0,
	|	ОстаткиДенежныхСредствОстатки.СуммаОстаток,
	|	БанковскиеСчета.Ссылка,
	|	NULL,
	|	NULL,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&Период, Организация = &Организация) КАК ОстаткиДенежныхСредствОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО ОстаткиДенежныхСредствОстатки.РасчетныйСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК ДействующиеСчетаУчета
	|		ПО ((ВЫРАЗИТЬ(ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)) = ДействующиеСчетаУчета.СчетУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО ОстаткиДенежныхСредствОстатки.РасчетныйСчет = БанковскиеСчета.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления,
	|	""Депозиты"",
	|	ДепозитныеВклады.БанковскийСчет.Договор.НомерДоговора,
	|	ДепозитныеВклады.БанковскийСчет.Банк,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.TIN, РеквизитыЮридическихЛицСрезПоследних.ИНН),
	|	ДепозитныеВклады.БанковскийСчет.Валюта,
	|	0,
	|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток,
	|	ДепозитныеВклады.Ссылка,
	|	NULL,
	|	NULL,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	ДепозитныеВклады.Субординированность,
	|	УсловияКредитныхИнструментовСрезПоследних.Процент,
	|	ДепозитныеВклады.ДатаРегистрации,
	|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(&Период, Организация = &Организация И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК ДействующиеСчетаУчета
	|		ПО ((ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)) = ДействующиеСчетаУчета.СчетУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
	|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
	|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
	|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
	|		ИЗ
	|			(ВЫБРАТЬ
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
	|			ИЗ
	|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
	|			ГДЕ
	|				УсловияКредитныхИнструментовСрезПоследних.Действует
	|			
	|			СГРУППИРОВАТЬ ПО
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
	|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
	|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
	|			ПО ДепозитныеВклады.Ссылка = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
	|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = ДепозитныеВклады.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления,
	|	""Акции"",
	|	КодыВТорговыхСистемахСрезПоследних.Код,
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, РеквизитыЮридическихЛицСрезПоследних.TIN),
	|	Акции.ВалютаНоминала,
	|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток,
	|	Акции.Ссылка,
	|	NULL,
	|	Акции.ГосударственныйРегистрационныйНомер,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ЦеннаяБумага ССЫЛКА Справочник.Акции
	|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)) КАК ОстаткиЦенныхБумагОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК ДействующиеСчетаУчета
	|		ПО (ДействующиеСчетаУчета.СчетУчета = (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
	|				&Период,
	|				Объект ССЫЛКА Справочник.Акции
	|					И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = Акции.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И ЦеннаяБумага ССЫЛКА Справочник.Акции
	|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
	|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (Акции.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления,
	|	ВЫБОР
	|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
	|			ТОГДА ""Государственные ценные бумаги Российской Федерации""
	|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
	|			ТОГДА ""Государственные ценные бумаги субъектов Российской Федерации""
	|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
	|			ТОГДА ""Муниципальные ценные бумаги""
	|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
	|			ТОГДА ""Облигации с ипотечным покрытием""
	|		ИНАЧЕ ""Иные облигации""
	|	КОНЕЦ,
	|	КодыВТорговыхСистемахСрезПоследних.Код,
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, РеквизитыЮридическихЛицСрезПоследних.TIN),
	|	Облигации.ВалютаНоминала,
	|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток,
	|	Облигации.Ссылка,
	|	NULL,
	|	Облигации.ГосударственныйРегистрационныйНомер,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	Облигации.Субординированность,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК ОстаткиЦенныхБумагОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК ДействующиеСчетаУчета
	|		ПО (ДействующиеСчетаУчета.СчетУчета = (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
	|				&Период,
	|				Объект ССЫЛКА Справочник.Облигации
	|					И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = Облигации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления,
	|	""Ипотечные сертификаты участия"",
	|	КодыВТорговыхСистемахСрезПоследних.Код,
	|	ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер + "", "" + РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, РеквизитыЮридическихЛицСрезПоследних.TIN),
	|	ИпотечныеСертификатыУчастия.ВалютаНоминала,
	|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток,
	|	ИпотечныеСертификатыУчастия.Ссылка,
	|	NULL,
	|	ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)) КАК ОстаткиЦенныхБумагОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК ДействующиеСчетаУчета
	|		ПО (ДействующиеСчетаУчета.СчетУчета = (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
	|				&Период,
	|				Объект ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|					И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = ИпотечныеСертификатыУчастия.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
	|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления,
	|	""Инвестиционные паи паевых инвестиционных фондов"",
	|	КодыВТорговыхСистемахСрезПоследних.Код,
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, РеквизитыЮридическихЛицСрезПоследних.TIN),
	|	Паи.ВалютаНоминала,
	|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток,
	|	Паи.Ссылка,
	|	NULL,
	|	Паи.ГосударственныйРегистрационныйНомер,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ЦеннаяБумага ССЫЛКА Справочник.Паи
	|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)) КАК ОстаткиЦенныхБумагОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК ДействующиеСчетаУчета
	|		ПО (ДействующиеСчетаУчета.СчетУчета = (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд.УправляющаяКомпания.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
	|				&Период,
	|				Объект ССЫЛКА Справочник.Паи
	|					И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = Паи.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И ЦеннаяБумага ССЫЛКА Справочник.Паи
	|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
	|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
	|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
	|	""Недвижимое имущество"",
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПрочиеАктивы.Обозначение4777 КАК СТРОКА(500))) <> """"
	|			ТОГДА ПрочиеАктивы.Обозначение4777
	|		ИНАЧЕ ПрочиеАктивы.Наименование
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ПрочиеАктивы.Описание КАК СТРОКА(500)),
	|	"""",
	|	ОстаткиПрочихАктивовОстатки.Валюта,
	|	ОстаткиПрочихАктивовОстатки.КоличествоОстаток,
	|	ОстаткиПрочихАктивовОстатки.СуммаОстаток,
	|	ПрочиеАктивы.Ссылка,
	|	ОстаткиПрочихАктивовОстатки.Субъект,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
	|			&Период,
	|			Актив.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.НедвижимоеИмущество)
	|				И Организация = &Организация) КАК ОстаткиПрочихАктивовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК _ДействующиеСчетаУчета
	|		ПО ((ВЫРАЗИТЬ(ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)) = _ДействующиеСчетаУчета.СчетУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрочиеАктивы КАК ПрочиеАктивы
	|		ПО ОстаткиПрочихАктивовОстатки.Актив = ПрочиеАктивы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
	|	""Доля перестраховщиков в страховых резервах, сформированных в соответствии с регуляторными требованиями"",
	|	"""",
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПрочиеАктивы.Обозначение4777 КАК СТРОКА(500))) <> """"
	|			ТОГДА ПрочиеАктивы.Обозначение4777
	|		ИНАЧЕ ПрочиеАктивы.Наименование
	|	КОНЕЦ,
	|	"""",
	|	ОстаткиПрочихАктивовОстатки.Валюта,
	|	ОстаткиПрочихАктивовОстатки.КоличествоОстаток,
	|	ОстаткиПрочихАктивовОстатки.СуммаОстаток,
	|	ПрочиеАктивы.Ссылка,
	|	ОстаткиПрочихАктивовОстатки.Субъект,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
	|			&Период,
	|			Актив.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.ДолиПерестраховщиков)
	|				И Организация = &Организация) КАК ОстаткиПрочихАктивовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК _ДействующиеСчетаУчета
	|		ПО ((ВЫРАЗИТЬ(ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)) = _ДействующиеСчетаУчета.СчетУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрочиеАктивы КАК ПрочиеАктивы
	|		ПО ОстаткиПрочихАктивовОстатки.Актив = ПрочиеАктивы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
	|	""Вклады в уставные (складочные) капиталы"",
	|	"""",
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.TIN, РеквизитыЮридическихЛицСрезПоследних.ИНН),
	|	ОстаткиПрочихАктивовОстатки.Валюта,
	|	ОстаткиПрочихАктивовОстатки.КоличествоОстаток,
	|	ОстаткиПрочихАктивовОстатки.СуммаОстаток,
	|	ПрочиеАктивы.Ссылка,
	|	ОстаткиПрочихАктивовОстатки.Субъект,
	|	NULL,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
	|			&Период,
	|			Актив.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.ВкладыВУставныеКапиталы)
	|				И Организация = &Организация) КАК ОстаткиПрочихАктивовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК _ДействующиеСчетаУчета
	|		ПО ((ВЫРАЗИТЬ(ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)) = _ДействующиеСчетаУчета.СчетУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрочиеАктивы КАК ПрочиеАктивы
	|		ПО ОстаткиПрочихАктивовОстатки.Актив = ПрочиеАктивы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, ) КАК РеквизитыЮридическихЛицСрезПоследних
	|			ПО ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|		ПО ОстаткиПрочихАктивовОстатки.Субъект = ЮрФизЛица.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
	|	ВЫБОР
	|		КОГДА ПрочиеАктивы.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.ЗадолженностиСтрахованияИПерестрахования)
	|			ТОГДА ""Дебиторская задолженность по операциям страхования, сострахования и перестрахования""
	|		КОГДА ПрочиеАктивы.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.Задолженности)
	|			ТОГДА ""Прочая дебиторская задолженность""
	|		КОГДА ПрочиеАктивы.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.Займы)
	|			ТОГДА ВЫБОР
	|					КОГДА ПрочиеАктивы.Код = ""000000418""
	|						ТОГДА ""Займы страхователям по договорам страхования жизни""
	|					ИНАЧЕ ""Прочие предоставленные займы""
	|				КОНЕЦ
	|		ИНАЧЕ ""Прочие активы""
	|	КОНЕЦ,
	|	"""",
	|	ВЫБОР
	|		КОГДА ПрочиеАктивы.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.Займы)
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, """")
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(ПрочиеАктивы.Обозначение4777 КАК СТРОКА(500))) <> """"
	|					ТОГДА ПрочиеАктивы.Обозначение4777
	|				ИНАЧЕ ПрочиеАктивы.Наименование
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПрочиеАктивы.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.Займы)
	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.TIN, РеквизитыЮридическихЛицСрезПоследних.ИНН)
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОстаткиПрочихАктивовОстатки.Валюта,
	|	ОстаткиПрочихАктивовОстатки.КоличествоОстаток,
	|	ОстаткиПрочихАктивовОстатки.СуммаОстаток,
	|	ПрочиеАктивы.Ссылка,
	|	ОстаткиПрочихАктивовОстатки.Субъект,
	|	NULL,
	|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
	|			&Период,
	|			Актив.ВидПрочегоАктива В (ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.ЗадолженностиСтрахованияИПерестрахования), ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.Задолженности), ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.Займы), ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.ИныеАктивы))
	|				И Организация = &Организация) КАК ОстаткиПрочихАктивовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДействующиеСчетаУчета КАК _ДействующиеСчетаУчета
	|		ПО ((ВЫРАЗИТЬ(ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления.Родитель КАК Справочник.СчетаДоверительногоУправления)) = _ДействующиеСчетаУчета.СчетУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрочиеАктивы КАК ПрочиеАктивы
	|		ПО ОстаткиПрочихАктивовОстатки.Актив = ПрочиеАктивы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, ) КАК РеквизитыЮридическихЛицСрезПоследних
	|			ПО ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|		ПО ОстаткиПрочихАктивовОстатки.Субъект = ЮрФизЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Организация КАК Организация,
	|	_ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ВсеАктивыСтраховыхКомпаний.КлассАктива КАК КлассАктива,
	|	_ВсеАктивыСтраховыхКомпаний.ИдентификаторАктива КАК ИдентификаторАктива,
	|	_ВсеАктивыСтраховыхКомпаний.НаименованиеАктива КАК НаименованиеАктива,
	|	_ВсеАктивыСтраховыхКомпаний.ИНН_TIN КАК ИНН_TIN,
	|	_ВсеАктивыСтраховыхКомпаний.Валюта КАК Валюта,
	|	_ВсеАктивыСтраховыхКомпаний.Количество КАК Количество,
	|	_ВсеАктивыСтраховыхКомпаний.Актив КАК Актив,
	|	_ВсеАктивыСтраховыхКомпаний.Сумма КАК Сумма,
	|	_ВсеАктивыСтраховыхКомпаний.СубъектПрочегоАктива КАК СубъектПрочегоАктива,
	|	_ВсеАктивыСтраховыхКомпаний.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
	|	_ВсеАктивыСтраховыхКомпаний.СтранаРегистрации КАК СтранаРегистрации,
	|	_ВсеАктивыСтраховыхКомпаний.Субординированность КАК Субординированность,
	|	_ВсеАктивыСтраховыхКомпаний.ПроцентДепозита КАК ПроцентДепозита,
	|	_ВсеАктивыСтраховыхКомпаний.ДатаРазмещенияДепозитногоВклада КАК ДатаРазмещенияДепозитногоВклада,
	|	_ВсеАктивыСтраховыхКомпаний.ДатаПогашенияДепозита КАК ДатаПогашенияДепозита,
	|	NULL КАК ДатаКурсаВалют
	|ИЗ
	|	_ВсеАктивыСтраховыхКомпаний КАК _ВсеАктивыСтраховыхКомпаний";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);   	
	
	АктивыСтраховойКомпании = Запрос.Выполнить().Выгрузить();
	
	Для Каждого АктивСтраховойКомпании из  АктивыСтраховойКомпании Цикл
		
		КомпонентыСтоимости = Документы.РаспределениеАктивовСтраховыхКомпаний.ПолучитьБалансовуюСтоимостьАктиваСтраховойКомпанииВВалютеУчета(
		    	АктивСтраховойКомпании.СчетДоверительногоУправления, Организация, Период,
				АктивСтраховойКомпании.Актив, АктивСтраховойКомпании.Валюта, АктивСтраховойКомпании.СубъектПрочегоАктива);
				АктивСтраховойКомпании.Сумма = КомпонентыСтоимости.БалансоваяСтоимость;
				Если КомпонентыСтоимости.ЭтоВалютныйАктив Тогда
		        	АктивСтраховойКомпании.ДатаКурсаВалют = КомпонентыСтоимости.ДатаКурсаВалют;
				КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеАктивыСтраховыхКомпаний.Организация КАК Организация,
	|	ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ВсеАктивыСтраховыхКомпаний.КлассАктива КАК КлассАктива,
	|	ВсеАктивыСтраховыхКомпаний.ИдентификаторАктива КАК ИдентификаторАктива,
	|	ВсеАктивыСтраховыхКомпаний.НаименованиеАктива КАК НаименованиеАктива,
	|	ВсеАктивыСтраховыхКомпаний.ИНН_TIN КАК ИНН_TIN,
	|	ВсеАктивыСтраховыхКомпаний.Валюта КАК Валюта,
	|	ВсеАктивыСтраховыхКомпаний.Количество КАК Количество,
	|	ВсеАктивыСтраховыхКомпаний.Актив КАК Актив,
	|	ВсеАктивыСтраховыхКомпаний.Сумма КАК Сумма,
	|	ВсеАктивыСтраховыхКомпаний.СубъектПрочегоАктива КАК СубъектПрочегоАктива,
	|	ВсеАктивыСтраховыхКомпаний.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
	|	ВсеАктивыСтраховыхКомпаний.СтранаРегистрации КАК СтранаРегистрации,
	|	ВсеАктивыСтраховыхКомпаний.Субординированность КАК Субординированность,
	|	ВсеАктивыСтраховыхКомпаний.ПроцентДепозита КАК ПроцентДепозита,
	|	ВсеАктивыСтраховыхКомпаний.ДатаРазмещенияДепозитногоВклада КАК ДатаРазмещенияДепозитногоВклада,
	|	ВсеАктивыСтраховыхКомпаний.ДатаПогашенияДепозита КАК ДатаПогашенияДепозита,
	|	ВсеАктивыСтраховыхКомпаний.ДатаПогашенияДепозита КАК ДатаКурсаВалют
	|ПОМЕСТИТЬ _ВсеАктивыСтраховыхКомпаний
	|ИЗ
	|	&ВсеАктивыСтраховыхКомпаний КАК ВсеАктивыСтраховыхКомпаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияДополнительныхСведений.Значение КАК ВидПортфеляСтраховойКомпании,
	|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
	|	СчетаУчета.Ссылка КАК СчетУчета
	|ПОМЕСТИТЬ _ПортфелиСтраховыхКомпаний
	|ИЗ
	|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
	|			ПО ЗначенияДополнительныхСведений.Свойство = ДополнительныеСведения.Ссылка
	|		ПО СчетаДоверительногоУправления.Ссылка = ЗначенияДополнительныхСведений.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаУчета
	|		ПО СчетаДоверительногоУправления.Родитель = СчетаУчета.Ссылка
	|ГДЕ
	|	СчетаДоверительногоУправления.Организация = &Организация
	|	И ДополнительныеСведения.Ключ = ""СчетаДоверительногоУправления.КонтрольСтраховыхКомпаний.ВидПортфеляСтраховойКомпании""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеСтраховщика,
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННСтраховщика,
	|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ОГРНСтраховщика,
	|	РеквизитыУправляющихКомпанийСрезПоследних1.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеУправляющейКомпании,
	|	РеквизитыУправляющихКомпанийСрезПоследних1.ИНН КАК ИННУправляющейКомпании,
	|	ДокументыЮридическихЛицСрезПоследнихУправляющиеКомпании.Номер КАК ОГРНУправляющейКомпании,
	|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор.НомерДоговора КАК НомерДоговораДУ,
	|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор.ДатаЗаключения КАК ДатаЗаключенияДоговораДУ,
	|	_ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _РеквизитыСтраховыхКомпаний
	|ИЗ
	|	_ВсеАктивыСтраховыхКомпаний КАК _ВсеАктивыСтраховыхКомпаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|				ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
	|						&Период,
	|						Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|							И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|							И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)) КАК ДокументыЮридическихЛицСрезПоследних
	|				ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = ДокументыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|						И (ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
	|							ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &Период))
	|			ПО СчетаУчета.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|		ПО (ВЫРАЗИТЬ(_ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).Родитель = СчетаУчета.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Активный = ИСТИНА) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних КАК РеквизитыУправляющихКомпанийСрезПоследних1
	|			ПО ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор.Контрагент = РеквизитыУправляющихКомпанийСрезПоследних1.ЮрФизЛицо
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
	|					&Период,
	|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|						И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)) КАК ДокументыЮридическихЛицСрезПоследнихУправляющиеКомпании
	|			ПО (ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор.Контрагент = ДокументыЮридическихЛицСрезПоследнихУправляющиеКомпании.ЮрФизЛицо
	|					И (ДокументыЮридическихЛицСрезПоследнихУправляющиеКомпании.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ ДокументыЮридическихЛицСрезПоследнихУправляющиеКомпании.ДействуетПо > &Период))
	|		ПО _ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления = ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_РеквизитыСтраховыхКомпаний.ПолноеНаименованиеСтраховщика КАК ПолноеНаименованиеСтраховщика,
	|	_РеквизитыСтраховыхКомпаний.ИННСтраховщика КАК ИННСтраховщика,
	|	_РеквизитыСтраховыхКомпаний.ОГРНСтраховщика КАК ОГРНСтраховщика,
	|	_РеквизитыСтраховыхКомпаний.ПолноеНаименованиеУправляющейКомпании КАК ПолноеНаименованиеУправляющейКомпании,
	|	_РеквизитыСтраховыхКомпаний.ИННУправляющейКомпании КАК ИННУправляющейКомпании,
	|	_РеквизитыСтраховыхКомпаний.ОГРНУправляющейКомпании КАК ОГРНУправляющейКомпании,
	|	_РеквизитыСтраховыхКомпаний.НомерДоговораДУ КАК НомерДоговораДУ,
	|	_РеквизитыСтраховыхКомпаний.ДатаЗаключенияДоговораДУ КАК ДатаЗаключенияДоговораДУ,
	|	_ВсеАктивыСтраховыхКомпаний.КлассАктива КАК КлассАктива,
	|	_ВсеАктивыСтраховыхКомпаний.ИдентификаторАктива КАК ИдентификаторАктива,
	|	_ВсеАктивыСтраховыхКомпаний.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
	|	_ВсеАктивыСтраховыхКомпаний.НаименованиеАктива КАК НаименованиеАктива,
	|	_ВсеАктивыСтраховыхКомпаний.ИНН_TIN КАК ИНН_TIN,
	|	СтраныМира.Код КАК КодСтраны,
	|	Валюты.Код КАК КодВалюты,
	|	1 КАК КодОбъектаСделкиРепо,
	|	ВЫБОР
	|		КОГДА _ВсеАктивыСтраховыхКомпаний.Субординированность = ИСТИНА
	|			ТОГДА ""ДА""
	|		КОГДА _ВсеАктивыСтраховыхКомпаний.Субординированность = ЛОЖЬ
	|			ТОГДА ""НЕТ""
	|	КОНЕЦ КАК Субординированность,
	|	_ВсеАктивыСтраховыхКомпаний.Количество КАК Количество,
	|	_ВсеАктивыСтраховыхКомпаний.Сумма КАК БалансоваяСтоимость,
	|	_СтоимостьРезервовПоСтрахованиюЖизни.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СтоимостьРезервовПоСтрахованиюЖизни,
	|	_СтоимостьРезервовПоСтрахованиюНЕЖизни.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СтоимостьРезервовПоСтрахованиюИномуЧемЖизни,
	|	_СтоимостьСС.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СтоимостьСС,
	|	_СтоимостьССН.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СтоимостьССН,
	|	_ВсеАктивыСтраховыхКомпаний.ПроцентДепозита КАК ПроцентДепозита,
	|	_ВсеАктивыСтраховыхКомпаний.ДатаРазмещенияДепозитногоВклада КАК ДатаРазмещенияДепозитногоВклада,
	|	_ВсеАктивыСтраховыхКомпаний.ДатаПогашенияДепозита КАК ДатаПогашенияДепозита
	|ПОМЕСТИТЬ _АктивыСтраховыхКомпанийПодробно
	|ИЗ
	|	_ВсеАктивыСтраховыхКомпаний КАК _ВсеАктивыСтраховыхКомпаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РеквизитыСтраховыхКомпаний КАК _РеквизитыСтраховыхКомпаний
	|		ПО _ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления = _РеквизитыСтраховыхКомпаний.СчетДоверительногоУправления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО _ВсеАктивыСтраховыхКомпаний.СтранаРегистрации = СтраныМира.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО _ВсеАктивыСтраховыхКомпаний.Валюта = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (Валюты.Ссылка = КурсыВалют.Валюта)
	|			И _ВсеАктивыСтраховыхКомпаний.ДатаКурсаВалют = КурсыВалют.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПортфелиСтраховыхКомпаний КАК _ПортфелиРСЖ
	|		ПО (ВЫРАЗИТЬ(_ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).Родитель = _ПортфелиРСЖ.СчетУчета)
	|			И (_ПортфелиРСЖ.ВидПортфеляСтраховойКомпании = ЗНАЧЕНИЕ(Перечисление.ВидыПортфелейСтраховыхКомпаний.РезервыПоСтрахованиюЖизни))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовСтраховыхКомпаний.СрезПоследних КАК _СтоимостьРезервовПоСтрахованиюЖизни
	|		ПО (_ПортфелиРСЖ.СчетДоверительногоУправления = _СтоимостьРезервовПоСтрахованиюЖизни.СчетДоверительногоУправления)
	|			И (_СтоимостьРезервовПоСтрахованиюЖизни.СчетДоверительногоУправленияИсходный = _ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления)
	|			И (_СтоимостьРезервовПоСтрахованиюЖизни.Актив = _ВсеАктивыСтраховыхКомпаний.Актив)
	|			И _ВсеАктивыСтраховыхКомпаний.Валюта = _СтоимостьРезервовПоСтрахованиюЖизни.Валюта
	|			И (ЕСТЬNULL(_СтоимостьРезервовПоСтрахованиюЖизни.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(_ВсеАктивыСтраховыхКомпаний.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПортфелиСтраховыхКомпаний КАК _ПортфелиНРСЖ
	|		ПО (ВЫРАЗИТЬ(_ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).Родитель = _ПортфелиНРСЖ.СчетУчета)
	|			И (_ПортфелиНРСЖ.ВидПортфеляСтраховойКомпании = ЗНАЧЕНИЕ(Перечисление.ВидыПортфелейСтраховыхКомпаний.РезервыПоСтрахованиюИномуЧемЖизни))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовСтраховыхКомпаний.СрезПоследних КАК _СтоимостьРезервовПоСтрахованиюНЕЖизни
	|		ПО (_ПортфелиНРСЖ.СчетДоверительногоУправления = _СтоимостьРезервовПоСтрахованиюНЕЖизни.СчетДоверительногоУправления)
	|			И (_СтоимостьРезервовПоСтрахованиюНЕЖизни.СчетДоверительногоУправленияИсходный = _ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления)
	|			И (_СтоимостьРезервовПоСтрахованиюНЕЖизни.Актив = _ВсеАктивыСтраховыхКомпаний.Актив)
	|			И _ВсеАктивыСтраховыхКомпаний.Валюта = _СтоимостьРезервовПоСтрахованиюНЕЖизни.Валюта
	|			И (ЕСТЬNULL(_СтоимостьРезервовПоСтрахованиюНЕЖизни.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(_ВсеАктивыСтраховыхКомпаний.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПортфелиСтраховыхКомпаний КАК _ПортфелиСС
	|		ПО (ВЫРАЗИТЬ(_ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).Родитель = _ПортфелиСС.СчетУчета)
	|			И (_ПортфелиСС.ВидПортфеляСтраховойКомпании = ЗНАЧЕНИЕ(Перечисление.ВидыПортфелейСтраховыхКомпаний.СобственныеСредстваВРазмереНорматива))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовСтраховыхКомпаний.СрезПоследних КАК _СтоимостьСС
	|		ПО (_ПортфелиСС.СчетДоверительногоУправления = _СтоимостьСС.СчетДоверительногоУправления)
	|			И (_СтоимостьСС.СчетДоверительногоУправленияИсходный = _ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления)
	|			И (_СтоимостьСС.Актив = _ВсеАктивыСтраховыхКомпаний.Актив)
	|			И _ВсеАктивыСтраховыхКомпаний.Валюта = _СтоимостьСС.Валюта
	|			И (ЕСТЬNULL(_СтоимостьСС.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(_ВсеАктивыСтраховыхКомпаний.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПортфелиСтраховыхКомпаний КАК _ПортфелиССН
	|		ПО (ВЫРАЗИТЬ(_ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).Родитель = _ПортфелиССН.СчетУчета)
	|			И (_ПортфелиССН.ВидПортфеляСтраховойКомпании = ЗНАЧЕНИЕ(Перечисление.ВидыПортфелейСтраховыхКомпаний.СобственныеСредстваСверхНорматива))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовСтраховыхКомпаний.СрезПоследних КАК _СтоимостьССН
	|		ПО (_ПортфелиССН.СчетДоверительногоУправления = _СтоимостьССН.СчетДоверительногоУправления)
	|			И (_СтоимостьССН.СчетДоверительногоУправленияИсходный = _ВсеАктивыСтраховыхКомпаний.СчетДоверительногоУправления)
	|			И (_СтоимостьССН.Актив = _ВсеАктивыСтраховыхКомпаний.Актив)
	|			И _ВсеАктивыСтраховыхКомпаний.Валюта = _СтоимостьССН.Валюта
	|			И (ЕСТЬNULL(_СтоимостьССН.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(_ВсеАктивыСтраховыхКомпаний.СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_РеквизитыСтраховыхКомпаний.ПолноеНаименованиеСтраховщика КАК ПолноеНаименованиеСтраховщика,
	|	_РеквизитыСтраховыхКомпаний.ИННСтраховщика КАК ИННСтраховщика,
	|	_РеквизитыСтраховыхКомпаний.ОГРНСтраховщика КАК ОГРНСтраховщика,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.ВидПоказателя В (ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюЖизни), ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюИномуЧемСтрахованиеЖизни))
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ * Показатели.ЗначениеПоказателя) КАК СтраховыеРезервыВсего,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюЖизни)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ * Показатели.ЗначениеПоказателя) КАК СтраховыеРезервыПоСтрахованиюЖизни,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюИномуЧемСтрахованиеЖизни)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ * Показатели.ЗначениеПоказателя) КАК СтраховыеРезервыПоСтрахованиюИномуЧемЖизни,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.ВидПоказателя В (ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.НормативныйРазмерМаржиПлатежеспособности), ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.ПревышенияРазмераСобственныхСредствНадНаибольшимПоказателем))
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ * Показатели.ЗначениеПоказателя) КАК СобственныеСредства,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.МинимальныйРазмерУставногоКапитала)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ * Показатели.ЗначениеПоказателя) КАК МинРазмерУставногоКапитала,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.НормативныйРазмерМаржиПлатежеспособности)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ * Показатели.ЗначениеПоказателя) КАК НормативныйРазмерМаржиПлатежеспособности,
	|	0 КАК АктивыРепо,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСтраховыхКомпаний.ПревышенияРазмераСобственныхСредствНадНаибольшимПоказателем)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ * Показатели.ЗначениеПоказателя) КАК ПревышениеСобственныхСредств
	|ПОМЕСТИТЬ _ПредоставляемыеПоказателиСтраховыхКомпаний
	|ИЗ
	|	_РеквизитыСтраховыхКомпаний КАК _РеквизитыСтраховыхКомпаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредоставляемыеПоказателиСтраховыхКомпаний.СрезПоследних(&Период, Организация = &Организация) КАК Показатели
	|		ПО _РеквизитыСтраховыхКомпаний.СчетДоверительногоУправления = Показатели.СчетДоверительногоУправления
	|
	|СГРУППИРОВАТЬ ПО
	|	_РеквизитыСтраховыхКомпаний.ПолноеНаименованиеСтраховщика,
	|	_РеквизитыСтраховыхКомпаний.ОГРНСтраховщика,
	|	_РеквизитыСтраховыхКомпаний.ИННСтраховщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_АктивыСтраховыхКомпанийПодробно.ПолноеНаименованиеСтраховщика КАК ПолноеНаименованиеСтраховщика,
	|	_АктивыСтраховыхКомпанийПодробно.ИННСтраховщика КАК ИННСтраховщика,
	|	_АктивыСтраховыхКомпанийПодробно.ОГРНСтраховщика КАК ОГРНСтраховщика,
	|	_АктивыСтраховыхКомпанийПодробно.ПолноеНаименованиеУправляющейКомпании КАК ПолноеНаименованиеУправляющейКомпании,
	|	_АктивыСтраховыхКомпанийПодробно.ИННУправляющейКомпании КАК ИННУправляющейКомпании,
	|	_АктивыСтраховыхКомпанийПодробно.ОГРНУправляющейКомпании КАК ОГРНУправляющейКомпании,
	|	_АктивыСтраховыхКомпанийПодробно.НомерДоговораДУ КАК НомерДоговораДУ,
	|	_АктивыСтраховыхКомпанийПодробно.ДатаЗаключенияДоговораДУ КАК ДатаЗаключенияДоговораДУ,
	|	_АктивыСтраховыхКомпанийПодробно.КлассАктива КАК КлассАктива,
	|	_АктивыСтраховыхКомпанийПодробно.ИдентификаторАктива КАК ИдентификаторАктива,
	|	_АктивыСтраховыхКомпанийПодробно.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
	|	_АктивыСтраховыхКомпанийПодробно.НаименованиеАктива КАК НаименованиеАктива,
	|	_АктивыСтраховыхКомпанийПодробно.ИНН_TIN КАК Поле1ИНН_TIN,
	|	_АктивыСтраховыхКомпанийПодробно.КодСтраны КАК КодСтраны,
	|	_АктивыСтраховыхКомпанийПодробно.КодВалюты КАК КодВалюты,
	|	_АктивыСтраховыхКомпанийПодробно.КодОбъектаСделкиРепо КАК КодОбъектаСделкиРепо,
	|	_АктивыСтраховыхКомпанийПодробно.Субординированность КАК Субординированность,
	|	_АктивыСтраховыхКомпанийПодробно.Количество КАК Количество,
	|	_АктивыСтраховыхКомпанийПодробно.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	_АктивыСтраховыхКомпанийПодробно.СтоимостьРезервовПоСтрахованиюЖизни КАК СтоимостьРезервовПоСтрахованиюЖизни,
	|	_АктивыСтраховыхКомпанийПодробно.СтоимостьРезервовПоСтрахованиюИномуЧемЖизни КАК СтоимостьРезервовПоСтрахованиюИномуЧемЖизни,
	|	_АктивыСтраховыхКомпанийПодробно.СтоимостьСС КАК СтоимостьСС,
	|	_АктивыСтраховыхКомпанийПодробно.СтоимостьССН КАК СтоимостьССН,
	|	ЕСТЬNULL(_АктивыСтраховыхКомпанийПодробно.БалансоваяСтоимость, 0) - ЕСТЬNULL(_АктивыСтраховыхКомпанийПодробно.СтоимостьРезервовПоСтрахованиюЖизни, 0) - ЕСТЬNULL(_АктивыСтраховыхКомпанийПодробно.СтоимостьРезервовПоСтрахованиюИномуЧемЖизни, 0) - ЕСТЬNULL(_АктивыСтраховыхКомпанийПодробно.СтоимостьСС, 0) - ЕСТЬNULL(_АктивыСтраховыхКомпанийПодробно.СтоимостьССН, 0) КАК СвободныйОстаток,
	|	_АктивыСтраховыхКомпанийПодробно.ПроцентДепозита КАК ПроцентДепозита,
	|	_АктивыСтраховыхКомпанийПодробно.ДатаРазмещенияДепозитногоВклада КАК ДатаРазмещенияДепозитногоВклада,
	|	_АктивыСтраховыхКомпанийПодробно.ДатаПогашенияДепозита КАК ДатаПогашенияДепозита
	|ИЗ
	|	_АктивыСтраховыхКомпанийПодробно КАК _АктивыСтраховыхКомпанийПодробно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.ПолноеНаименованиеСтраховщика КАК ПП_ПолноеНаименованиеСтраховщика,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.ИННСтраховщика КАК ПП_ИННСтраховщика,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.ОГРНСтраховщика КАК ПП_ОГРНСтраховщика,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.СтраховыеРезервыВсего КАК ПП_СтраховыеРезервыВсего,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюЖизни КАК ПП_СтраховыеРезервыПоСтрахованиюЖизни,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.СтраховыеРезервыПоСтрахованиюИномуЧемЖизни КАК ПП_СтраховыеРезервыПоСтрахованиюИномуЧемЖизни,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.СобственныеСредства КАК ПП_СобственныеСредства,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.МинРазмерУставногоКапитала КАК ПП_МинРазмерУставногоКапитала,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.НормативныйРазмерМаржиПлатежеспособности КАК ПП_НормативныйРазмерМаржиПлатежеспособности,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.АктивыРепо КАК ПП_АктивыРепо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_ПредоставляемыеПоказателиСтраховыхКомпаний.МинРазмерУставногоКапитала, 0) > ЕСТЬNULL(_ПредоставляемыеПоказателиСтраховыхКомпаний.НормативныйРазмерМаржиПлатежеспособности, 0)
	|			ТОГДА _ПредоставляемыеПоказателиСтраховыхКомпаний.МинРазмерУставногоКапитала
	|		ИНАЧЕ _ПредоставляемыеПоказателиСтраховыхКомпаний.НормативныйРазмерМаржиПлатежеспособности
	|	КОНЕЦ КАК ПП_НаибольшийПоказатель,
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний.ПревышениеСобственныхСредств КАК ПП_ПревышениеСобственныхСредств
	|ИЗ
	|	_ПредоставляемыеПоказателиСтраховыхКомпаний КАК _ПредоставляемыеПоказателиСтраховыхКомпаний";
	
	Запрос.УстановитьПараметр("ВсеАктивыСтраховыхКомпаний", АктивыСтраховойКомпании);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация); 
	                                                                                                
	Возврат Запрос;
	
КонецФункции