
&НаСервере
Процедура ПроверитьСтавкуНаСервере()
	
	Если РольДоступна("ПолныеПрава") Тогда
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период, ЭтаФорма.Результат, ЭтаФорма.ОрганизацияВыбор);
	Иначе
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период, ЭтаФорма.Результат, ПараметрыСеанса.ТекущаяОрганизация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтавку(Команда)
	
	ПроверитьСтавкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ОрганизацияВыбор = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.Элементы.Организация.Видимость = НЕ РольДоступна("ПолныеПрава");
	ЭтаФорма.Элементы.ОрганизацияВыбор.Видимость = РольДоступна("ПолныеПрава");
	
	ЭтаФорма.Элементы.ФормаПисьма.Видимость = ЭтаФорма.Элементы.ОрганизацияВыбор.Видимость;
	ЭтаФорма.Элементы.ФормаПисьма.Доступность = ЭтаФорма.Элементы.ОрганизацияВыбор.Видимость;
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = НачалоДня(ТекущаяДата());
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПисьмаНаСервере()
	РеквизитФормыВЗначение("Объект").ПроверитьСтавку(ЭтаФорма.Период);
КонецПроцедуры

&НаКлиенте
Процедура Письма(Команда)
	ПисьмаНаСервере();
КонецПроцедуры
