
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если      ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		ЭтаФорма.ТипОбъекта = 1;
	ИначеЕсли ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		ЭтаФорма.ТипОбъекта = 2;
	КонецЕсли;
	
	Если      ТипЗнч(Запись.КонтактноеЛицо) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		ЭтаФорма.ТипКонтактногоЛица = 1;
	ИначеЕсли ТипЗнч(Запись.КонтактноеЛицо) = Тип("Строка") Тогда
		ЭтаФорма.ТипКонтактногоЛица = 2;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	Если      ЭтаФорма.ТипОбъекта = 1 Тогда
		Запись.Объект = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
	ИначеЕсли ЭтаФорма.ТипОбъекта = 2 Тогда
		Запись.Объект = ПредопределенноеЗначение("Справочник.ПаевыеИнвестиционныеФонды.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтактногоЛицаПриИзменении(Элемент)
	
	Если      ЭтаФорма.ТипКонтактногоЛица = 1 Тогда
		Запись.КонтактноеЛицо = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
	ИначеЕсли ЭтаФорма.ТипКонтактногоЛица = 2 Тогда
		Запись.КонтактноеЛицо = "";
	КонецЕсли;
	
КонецПроцедуры

