
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Период") Тогда
		Запись.Период = Параметры.ЗначенияЗаполнения.Период;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТипЗнч(Запись.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") 
		И Запись.КредитныйИнструмент.ДоВостребования И НЕ ЗначениеЗаполнено(Запись.ДатаПогашения) Тогда
		//Для депозитов "до востребования" дата погашения не контролируется
	ИначеЕсли ТипЗнч(Запись.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") 
		И Запись.ДатаПогашения < ТекущаяДата() Тогда
		//Для просроченных займов допустимо изменение условий
	ИначеЕсли Запись.Период > Запись.ДатаПогашения  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата периода, на которую устанавливаются данные кредитного инструмента, не должна быть больше даты погашения",,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьДатуПогашения(Команда)
	
	КоличествоДней = 0;
	Если ВвестиЧисло(КоличествоДней, "Укажите количество дней", 5)  Тогда
		Запись.ДатаПогашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.КредитныйИнструмент, "ДатаРегистрации") + КоличествоДней*86400;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Перем ДатаПоследнихДанных, ДатаНачалаДействияПоследнихДанных;
	
	Если ЕстьИзмененияУсловийДепозитаНаДату(ДатаПоследнихДанных, ДатаНачалаДействияПоследнихДанных) Тогда
		Если Вопрос("Заполнить данные условиями кредитного инструмента на " + Формат(ДатаПоследнихДанных, "ДФ=dd.MM.yyyy") + " с датой начала действия " + Формат(ДатаНачалаДействияПоследнихДанных, "ДФ=dd.MM.yyyy") + " ?", РежимДиалогаВопрос.ДаНет, 60) = КодВозвратаДиалога.Да Тогда
			ПериодПриИзмененииНаСервере(ДатаНачалаДействияПоследнихДанных);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере(ДатаНачалаДействияПоследнихДанных)
	
	СрезПоследних = РегистрыСведений.УсловияКредитныхИнструментов.СрезПоследних(Запись.Период, Новый Структура("КредитныйИнструмент", Запись.КредитныйИнструмент));
	Для Каждого ДанныеСреза ИЗ СрезПоследних Цикл
		Если ДанныеСреза.ДатаНачалаДействияУсловий <> ДатаНачалаДействияПоследнихДанных Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись, ДанныеСреза,, "Период,ДатаНачалаДействияУсловий,КредитныйИнструмент,Комментарий");
		Запись.ДатаНачалаДействияУсловий = Запись.Период;
		Прервать;
	КонецЦикла;	
	
КонецПроцедуры
	
&НаСервере
Функция ЕстьИзмененияУсловийДепозитаНаДату(ДатаПоследнихДанных, ДатаНачалаДействияПоследнихДанных)
	
	Результат = Ложь;
	
	СрезПоследних = РегистрыСведений.УсловияКредитныхИнструментов.СрезПоследних(Запись.Период, Новый Структура("КредитныйИнструмент", Запись.КредитныйИнструмент));
	СрезПоследних.Сортировать("ДатаНачалаДействияУсловий Убыв");
	Для Каждого ДанныеСреза Из СрезПоследних Цикл
		Если НЕ ДанныеСреза.Действует Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Колонка Из СрезПоследних.Колонки Цикл
			Если Колонка.Имя = "КредитныйИнструмент" ИЛИ Колонка.Имя = "Комментарий" Тогда Продолжить; КонецЕсли;
			Если Колонка.Имя = "Период"	Тогда
				ДатаПоследнихДанных = ДанныеСреза[Колонка.Имя];
				Продолжить; 
			КонецЕсли;
			Если Колонка.Имя = "ДатаНачалаДействияУсловий"	Тогда
				ДатаНачалаДействияПоследнихДанных = ДанныеСреза[Колонка.Имя];
				Продолжить; 
			КонецЕсли;
			
			Если Запись[Колонка.Имя] <> ДанныеСреза[Колонка.Имя] Тогда 
				Результат = Истина; 
			КонецЕсли;
		КонецЦикла;
		Прервать;
	КонецЦикла;	

	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)
	
	ЭтаФорма.Элементы.Контрагент.Доступность = (ТипЗнч(ЭтаФорма.Запись.КредитныйИнструмент) = Тип("СправочникСсылка.Займы"));
	
	ТребуетсяЗаполнениеРасчетногоСчетаВозвратаДенежныхСредств =
	    РаботаСКредитнымиИнструментами.НеобходимоЗаполнениеЗначенияРасчетногоСчетаВозвратаДенежныхСредств(ЭтаФорма.Запись.Организация, ЭтаФорма.Запись.КредитныйИнструмент);
	
	ЭтаФорма.Элементы.РасчетныйСчетВозвратаДенежныхСредств.ОтметкаНезаполненного	 = Ложь;
	ЭтаФорма.Элементы.РасчетныйСчетВозвратаДенежныхСредств.АвтоОтметкаНезаполненного = ТребуетсяЗаполнениеРасчетногоСчетаВозвратаДенежныхСредств;
	
КонецПроцедуры

&НаКлиенте
Процедура КредитныйИнструментПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.КредитныйИнструмент) Тогда
		Запись.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.КредитныйИнструмент, "Организация");
	Иначе
		Запись.Организация = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Запись.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		Запись.Контрагент = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетВозвратаДенежныхСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура();
	
	СчетДоверительногоУправления = ПолучитьЗначениеСчетаДоверительногоУправления(Запись.Период, Запись.Организация, Запись.КредитныйИнструмент);
	
	Если ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		ПараметрыФормыВыбора.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);	
	КонецЕсли;
	 
	РасчетныйСчет = ОткрытьФормуМодально("Справочник.БанковскиеСчета.Форма.ФормаВыбораИзИсполнителей", ПараметрыФормыВыбора);
		
	Если ЗначениеЗаполнено(РасчетныйСчет) Тогда
		
		Если ТипЗнч(Запись.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
			ВалютаКредитногоИнструмента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.КредитныйИнструмент, "БанковскийСчет"), "Валюта");
		ИначеЕсли ТипЗнч(Запись.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
            ВалютаКредитногоИнструмента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.КредитныйИнструмент, "Валюта");
		КонецЕсли;

		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчет, "Валюта");	
			
		Если ЗначениеЗаполнено(ВалютаРасчетногоСчета) И ВалютаРасчетногоСчета <> ВалютаКредитногоИнструмента Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета [" + РасчетныйСчет + "] не соответствует валюте кредитного инструмента [" + ВалютаКредитногоИнструмента + "]",,, "Запись.РасчетныйСчетВозвратаДенежныхСредств");	
			Возврат;	
		КонецЕсли;
				
		Запись.РасчетныйСчетВозвратаДенежныхСредств = РасчетныйСчет;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСчетаДоверительногоУправления(Период, Организация, КредитныйИнструмент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И КредитныйИнструмент = &КредитныйИнструмент) КАК ДенежныеСредстваВКредитныхИнструментахОстатки";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КредитныйИнструмент", КредитныйИнструмент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СчетДоверительногоУправления;	
	КонецЦикла;
	
КонецФункции
