&НаСервере
Функция ЗаполнитьПартииНаСервере()

	Если НЕ ЗначениеЗаполнено(Объект.Актив) ИЛИ НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните актив и счет д/у!");
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросДатыЗапрета = Новый Запрос;
	ЗапросДатыЗапрета.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ИЗ
		|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|ГДЕ
		|	ДатыЗапретаРедактирования.Организация = &Организация
		|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
		|	И ДатыЗапретаРедактирования.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)";

	ЗапросДатыЗапрета.УстановитьПараметр("Организация",                  Объект.Организация);
	ЗапросДатыЗапрета.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);

	Выборка = ЗапросДатыЗапрета.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		ДатаЗапретаРедактированияПартий = Выборка.ДатаЗапретаРедактирования;
	Иначе
		ДатаЗапретаРедактированияПартий = Дата(1, 1, 1);
	КонецЕсли;

	Если КонецДня(ДатаЗапретаРедактированияПартий) < КонецДня(Объект.Дата) Тогда 
		
		Отказ = Ложь;
		
		РасчетПартий = Обработки.РасчетПартий.Создать();
		
		РасчетПартий.Организация                  = Объект.Организация;
		РасчетПартий.СчетДоверительногоУправления = Объект.СчетДоверительногоУправления;
		РасчетПартий.ВидУчета                     = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
		РасчетПартий.НачалоПериода                = НачалоДня(ДатаЗапретаРедактированияПартий) + 86400;
		РасчетПартий.КонецПериода                 = КонецДня(Объект.Дата);
		РасчетПартий.ТаблицаПлановыхОпераций	  = Неопределено;
		РасчетПартий.ВариантРасчета				  = Перечисления.ВариантыРасчетаПартий.РасчетКоличестваДляБумагПоАССуммы;
		
		РасчетПартий.РассчитатьПартии(Отказ, Истина);
		
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось динамически рассчитать партий по '" + Объект.СчетДоверительногоУправления + "' за период с " + РасчетПартий.НачалоПериода + " по " + РасчетПартий.КонецПериода);
			Возврат Ложь;
		КонецЕсли;
		
		НужныеСтроки = РасчетПартий.КонечныеОстаткиПартий.НайтиСтроки(Новый Структура("ЦеннаяБумага", Объект.Актив));
		
		Объект.Партии.Загрузить(РасчетПартий.КонечныеОстаткиПартий.Выгрузить(НужныеСтроки, "Партия,СтрокаПартии,Количество"));
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
			|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&Период,
			|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|				И Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ЦеннаяБумага = &Актив) КАК БухПартииЦенныхБумагОстатки";
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Запрос.УстановитьПараметр("Период",							Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
		Иначе
			Запрос.УстановитьПараметр("Период",							Новый Граница(Объект.Дата, ВидГраницы.Исключая));
		КонецЕсли;
		Запрос.УстановитьПараметр("Организация",					Объект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	Объект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Актив",							Объект.Актив);
		
		Объект.Партии.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТекущиеДанныеНаСервере()

	Если Не Объект.ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Период = Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	Иначе
		Период = Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеСписаниеРезервовПартии.НомерСтроки КАК НомерСтроки,
		|	НачислениеСписаниеРезервовПартии.Партия КАК Партия,
		|	НачислениеСписаниеРезервовПартии.СтрокаПартии КАК СтрокаПартии,
		|	НачислениеСписаниеРезервовПартии.СуммаРезерваПартии КАК СуммаРезерваПартии,
		|	НачислениеСписаниеРезервовПартии.Количество КАК Количество,
		|	НачислениеСписаниеРезервовПартии.Актив КАК Актив,
		|	НачислениеСписаниеРезервовПартии.АналитикаРезерва КАК АналитикаРезерва,
		|	НачислениеСписаниеРезервовПартии.СтадияОбесценения КАК СтадияОбесценения,
		|	СУММА(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(НачислениеСписаниеРезервовПартии.Актив) <> ТИП(Справочник.Облигации)
		|					ИЛИ &ОтражатьПартииНаЛицевыхСчетах
		|				ТОГДА ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт, 0)
		|			ИНАЧЕ ЕСТЬNULL(БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток, 0)
		|		КОНЕЦ) КАК СтараяСуммаРезерва,
		|	ВЫБОР
		|		КОГДА ЕдиныйВидыСубконто.НомерСтроки = 1
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйВидыСубконто.НомерСтроки = 2
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|		КОГДА ЕдиныйВидыСубконто.НомерСтроки = 3
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СтараяАналитикаРезерва
		|ИЗ
		|	Документ.НачислениеСписаниеРезервов.Партии КАК НачислениеСписаниеРезервовПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						УчетныеАктивыЕПС.СчетУчетаРезервов КАК СчетУчетаРезервов
		|					ИЗ
		|						Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|				
		|					ОБЪЕДИНИТЬ
		|				
		|					ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Единый.ВидыСубконто КАК ЕдиныйВидыСубконто
		|			ПО ЕдиныйБухгалтерскийУчетОстатки.Счет = ЕдиныйВидыСубконто.Ссылка
		|				И (ЕдиныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Резервы))
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Единый.ВидыСубконто КАК ЕдиныйВидыСубконтоУсловияЗаймовКредитовИДепозитов
		|			ПО ЕдиныйБухгалтерскийУчетОстатки.Счет = ЕдиныйВидыСубконтоУсловияЗаймовКредитовИДепозитов.Ссылка
		|				И (ЕдиныйВидыСубконтоУсловияЗаймовКредитовИДепозитов.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов))
		|		ПО (ТИПЗНАЧЕНИЯ(НачислениеСписаниеРезервовПартии.Актив) = ТИП(Справочник.Биржи)
		|					И ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга10)
		|				ИЛИ ТИПЗНАЧЕНИЯ(НачислениеСписаниеРезервовПартии.Актив) = ТИП(Справочник.БрокерскиеКомпании)
		|					И ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07)
		|					И ВЫРАЗИТЬ(НачислениеСписаниеРезервовПартии.Актив КАК Справочник.БрокерскиеКомпании).ЮрФизЛицо = ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|				ИЛИ НачислениеСписаниеРезервовПартии.Актив = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1) <> ТИП(Справочник.БанковскиеСчета)
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1) <> ТИП(Справочник.Облигации)
		|				ИЛИ НачислениеСписаниеРезервовПартии.Актив = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1) = ТИП(Справочник.БанковскиеСчета)
		|					И (ЕдиныйВидыСубконтоУсловияЗаймовКредитовИДепозитов.НомерСтроки = 2
		|							И ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = НЕОПРЕДЕЛЕНО
		|						ИЛИ ЕдиныйВидыСубконтоУсловияЗаймовКредитовИДепозитов.НомерСтроки = 3
		|							И ЕдиныйБухгалтерскийУчетОстатки.Субконто3 = НЕОПРЕДЕЛЕНО)
		|				ИЛИ НачислениеСписаниеРезервовПартии.Актив = ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) <> ТИП(Справочник.Облигации)
		|				ИЛИ НачислениеСписаниеРезервовПартии.Актив = ЕдиныйБухгалтерскийУчетОстатки.Субконто3
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто3) <> ТИП(Справочник.Облигации)
		|				ИЛИ НачислениеСписаниеРезервовПартии.Актив = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1) = ТИП(Справочник.Облигации)
		|					И (НЕ &ОтражатьПартииНаЛицевыхСчетах
		|						ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.Партия = НачислениеСписаниеРезервовПартии.Партия
		|							И ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.СтрокаПартии = НачислениеСписаниеРезервовПартии.СтрокаПартии)
		|				ИЛИ НачислениеСписаниеРезервовПартии.Актив = ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Справочник.Облигации)
		|					И (НЕ &ОтражатьПартииНаЛицевыхСчетах
		|						ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.Партия = НачислениеСписаниеРезервовПартии.Партия
		|							И ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.СтрокаПартии = НачислениеСписаниеРезервовПартии.СтрокаПартии)
		|				ИЛИ НачислениеСписаниеРезервовПартии.Актив = ЕдиныйБухгалтерскийУчетОстатки.Субконто3
		|					И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто3) = ТИП(Справочник.Облигации)
		|					И (НЕ &ОтражатьПартииНаЛицевыхСчетах
		|						ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.Партия = НачислениеСписаниеРезервовПартии.Партия
		|							И ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.СтрокаПартии = НачислениеСписаниеРезервовПартии.СтрокаПартии))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|					И НЕ &ОтражатьПартииНаЛицевыхСчетах
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ
		|							НачислениеСписаниеРезервовПартии.Актив КАК Актив
		|						ИЗ
		|							Документ.НачислениеСписаниеРезервов.Партии КАК НачислениеСписаниеРезервовПартии
		|						ГДЕ
		|							НачислениеСписаниеРезервовПартии.Ссылка = &Регистратор)) КАК БухПартииЦенныхБумагОстатки
		|		ПО НачислениеСписаниеРезервовПартии.Партия = БухПартииЦенныхБумагОстатки.Партия
		|			И (БухПартииЦенныхБумагОстатки.СтрокаПартии = НачислениеСписаниеРезервовПартии.СтрокаПартии)
		|ГДЕ
		|	НачислениеСписаниеРезервовПартии.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеСписаниеРезервовПартии.НомерСтроки,
		|	НачислениеСписаниеРезервовПартии.Партия,
		|	НачислениеСписаниеРезервовПартии.СтрокаПартии,
		|	НачислениеСписаниеРезервовПартии.СуммаРезерваПартии,
		|	НачислениеСписаниеРезервовПартии.Количество,
		|	НачислениеСписаниеРезервовПартии.Актив,
		|	НачислениеСписаниеРезервовПартии.АналитикаРезерва,
		|	НачислениеСписаниеРезервовПартии.СтадияОбесценения,
		|	ВЫБОР
		|		КОГДА ЕдиныйВидыСубконто.НомерСтроки = 1
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйВидыСубконто.НомерСтроки = 2
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|		КОГДА ЕдиныйВидыСубконто.НомерСтроки = 3
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("ОтражатьПартииНаЛицевыхСчетах", БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ОтражатьПартииНаЛицевыхСчетах"));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокиПартий = Объект.Партии.НайтиСтроки(Новый Структура("НомерСтроки", ВыборкаДетальныеЗаписи.НомерСтроки));
		
		СтрокиПартий[0].СтараяСуммаРезерва = ВыборкаДетальныеЗаписи.СтараяСуммаРезерва;
		СтрокиПартий[0].СтараяАналитикаРезерва = ВыборкаДетальныеЗаписи.СтараяАналитикаРезерва;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	
	ЭтаФорма.Элементы.ПартииАктив.ОграничениеТипа = Новый ОписаниеТипов(Документы.НачислениеСписаниеРезервов.ДопустимыеТипыАктивов());
	
	УправлениеФормой(ЭтаФорма);
	
	ЗаполнитьLGDПредставление(ЭтаФорма);
	
	ЗаполнитьТекущиеДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИРаспределить(ДанныеЗаполнения)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Период = Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	Иначе
		Период = Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Актив,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезерваПартии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ДанныеЗаполнения.Облигация);
	
	ДанныеПартий = Запрос.Выполнить().Выгрузить();
	
	СуммаРаспределения = ДанныеЗаполнения.СуммаРезерва;
	КоличествоРаспределения = ДанныеПартий.Итог("Количество");
	
	Для каждого СтрокаДанныеПартий Из ДанныеПартий Цикл
		
		СтрокаДанныеПартий.СуммаРезерваПартии = СуммаРаспределения / КоличествоРаспределения * СтрокаДанныеПартий.Количество;
		
		СуммаРаспределения = СуммаРаспределения - СтрокаДанныеПартий.СуммаРезерваПартии;
		КоличествоРаспределения = КоличествоРаспределения - СтрокаДанныеПартий.Количество;
		
		
		НоваяСтрокаПартий = Объект.Партии.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПартий, СтрокаДанныеПартий);
		НоваяСтрокаПартий.АналитикаРезерва = ДанныеЗаполнения.Аналитика;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПартии(Команда)
	
	ДанныеЗаполнения = ОткрытьФормуМодально("Документ.НачислениеСписаниеРезервов.Форма.ФормаВыбораОблигации");
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ЗаполнитьИРаспределить(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьРезервыНаСервере(Отказ = Ложь)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ДанныеРасчета = Неопределено;
	
	ТекущийОбъект.ЗаполнитьРезервы(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРезервы(Команда)
	
	КомандаЗаполнитьРезервыНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	ЗаполнитьLGDПредставление(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция РасшифровкаРасчетаНаСервере(Отказ = Ложь)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ДанныеРасчета = Новый ТаблицаЗначений();
	
	ТекущийОбъект.ЗаполнитьРезервы(Отказ, ДанныеРасчета);
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();
	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, ДанныеРасчета, , , , Истина);    
	РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);
	
	Возврат ПараметрыВывода.ДокументРезультат;       
	
КонецФункции

&НаКлиенте
Процедура РасшифровкаРасчета(Команда)
	
	Расшифровка = РасшифровкаРасчетаНаСервере();
	Если ТипЗнч(Расшифровка) = Тип("ТабличныйДокумент") Тогда
		Расшифровка.ТолькоПросмотр = Истина;
		Расшифровка.ОтображатьСетку = Ложь;
		Расшифровка.Показать("Расшифровка расчета резервов " + Объект.СчетДоверительногоУправления + " за " + Формат(Объект.Дата, "ДФ='dd.MM.yyyy'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасшифровкуРасчетаРезервов(ОбъектСсылка)
	
	Попытка
		ОбработкаВыгрузки = Обработки.ПечатьИВыгрузка_СЧА_РСА.Создать();	
		МассивРасшифровок = ОбработкаВыгрузки.ПолучитьРасшифровкуРасчетаРезервов(РаботаСКоллекциями.ЗначениеВМассив(ОбъектСсылка));
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;
		
	Если МассивРасшифровок = Неопределено Или МассивРасшифровок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать расшифровку расчета резервов табличной части документа.");
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат МассивРасшифровок;
	
КонецФункции

&НаКлиенте
Процедура СохранитьРасшифровкуРасчета(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для сохранения расшифровки расчета резервов в файл Excel необходимо записать документ.");
		Возврат;
	КонецЕсли;
	
	Если Объект.Партии.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В табличной части документа отсутствуют данные для сохранения расшифровки расчета резервов в файл Excel.");
		Возврат;	
	КонецЕсли;
	
	МассивРасшифровок = ПолучитьРасшифровкуРасчетаРезервов(Объект.Ссылка);
	
	Если МассивРасшифровок = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Сохранение";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПолноеИмяФайла = РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(СтрЗаменить(Строка(МассивРасшифровок[0].СчетДоверительногоУправления), " ", "_") + "_" + Формат(Объект.Дата, "ДФ=dd.MM.yyyy")) + ".xlsx";	 
	Диалог.Фильтр = "Книга Excel (*.xlsx)| *.xlsx";
		
	Если Диалог.Выбрать() Тогда
		
		ИмяФайла = Диалог.ПолноеИмяФайла;
			
		Попытка
			МассивРасшифровок[0].ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + ИмяФайла + " успешно сохранен.");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка сохранения файла" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЦельРасчетаПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
	Форма.ВариантРасчетаОжидаемыхКредитныхУбытков = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВариантРасчетаОжидаемыхКредитныхУбытков");	
	
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков = Новый СписокЗначений;
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Аквилон"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.ВолгаКапитал"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Национальный"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Транснефть"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Эволюция2025"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.ХантыМансийский"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Югория"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Национальный2025"));
	СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.Добавить(ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Гефест2025"));
	
	ДокументНеПерерасчитываетсяИзФормы = (СписокРедактируемыхВариантовРасчетаОжидаемыхКредитныхУбытков.НайтиПоЗначению(Форма.ВариантРасчетаОжидаемыхКредитныхУбытков) = Неопределено);
	
	Форма.Элементы.ПартииEAD.ТолькоПросмотр = ДокументНеПерерасчитываетсяИзФормы;
	Форма.Элементы.ПартииPD.ТолькоПросмотр = ДокументНеПерерасчитываетсяИзФормы;
	Форма.Элементы.ПартииДнейДоПогашения.ТолькоПросмотр = ДокументНеПерерасчитываетсяИзФормы;
	Форма.Элементы.ГруппаPDLGD.ТолькоПросмотр = ДокументНеПерерасчитываетсяИзФормы;
	Форма.Элементы.ПартииLGDПредставление.ТолькоПросмотр = ДокументНеПерерасчитываетсяИзФормы;

	ЭтоОценкаОбъектовВУправлении = (Объект.ЦельРасчета = ПредопределенноеЗначение("Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении"));
	Форма.Элементы.ПартииСтараяСуммаРезерва.Видимость = Не ЭтоОценкаОбъектовВУправлении;	
	Форма.Элементы.ПартииСтараяАналитикаРезерва.Видимость = Не ЭтоОценкаОбъектовВУправлении;
	
КонецПроцедуры	

&НаКлиенте
Асинх Процедура ВыполнитьПерерасчетПриИзмененииДанных()
	Если ЭтаФорма.Элементы.Партии.ТекущиеДанные <> Неопределено Тогда	
		Если Ждать ВопросАсинх("Выполнить перерасчет суммы резерва?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ВыполнитьПерерасчетПриИзмененииДанныхНаСервере();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПерерасчетПриИзмененииДанныхНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ИдентификаторСтроки = Элементы.Партии.ТекущаяСтрока;
	Если ИдентификаторСтроки <> Неопределено Тогда
		
		ТекущиеДанные = Объект.Партии.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.РучнаяКорректировка = Истина;
			ТекущийОбъект.ПересчитатьСтроку(ТекущиеДанные);
		КонецЕсли; 
		
	КонецЕсли; 
	
	ТекущийОбъект = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартииДнейДоПогашенияПриИзменении(Элемент)
	ВыполнитьПерерасчетПриИзмененииДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПартииLGDПриИзменении(Элемент)
	ВыполнитьПерерасчетПриИзмененииДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПартииPDПриИзменении(Элемент)
	ВыполнитьПерерасчетПриИзмененииДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПартииEADПриИзменении(Элемент)
	ВыполнитьПерерасчетПриИзмененииДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПартииСтадияОбесцененияПриИзменении(Элемент)
	ВыполнитьПерерасчетПриИзмененииДанных();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПартииРучнаяКорректировкаПриИзменении(Элемент)
	Если Не Элементы.Партии.ТекущиеДанные.РучнаяКорректировка Тогда
		Если Ждать ВопросАсинх("Восстановить сумму и показатели резерва?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЭтаФорма.Элементы.ГруппаДекорация.Видимость = Истина;
			
			ЭтаФорма.ОбновитьОтображениеДанных();
			
			ПодключитьОбработчикОжидания("ПартииРучнаяКорректировкаПриИзмененииОбработчикОжидания", 1, Истина); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПартииРучнаяКорректировкаПриИзмененииОбработчикОжидания()
	
	Отказ = Ложь;
	
	Ждать ПартииРучнаяКорректировкаОтменаРучногоИзменения(Отказ);
	
	Если Отказ Тогда
		Элементы.Партии.ТекущиеДанные.РучнаяКорректировка = Истина;	
	КонецЕсли;	
	
	ЗаполнитьLGDПредставление(ЭтаФорма);
	
	ЭтаФорма.Элементы.ГруппаДекорация.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ПартииРучнаяКорректировкаОтменаРучногоИзменения(Отказ)
	ПартииРучнаяКорректировкаОтменаРучногоИзмененияСервер(Отказ);
КонецФункции	

&НаСервере
Функция ПартииРучнаяКорректировкаОтменаРучногоИзмененияСервер(Отказ)
	
	ИдентификаторСтроки = Элементы.Партии.ТекущаяСтрока;
	Если ИдентификаторСтроки <> Неопределено Тогда
		
		ТекущиеДанные = Объект.Партии.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ТекущиеДанные <> Неопределено Тогда
			
			ДокументНачисленияРезервов = Документы.НачислениеСписаниеРезервов.СоздатьДокумент();
			ДокументНачисленияРезервов.Дата = КонецДня(Объект.Дата);
			ДокументНачисленияРезервов.Организация = Объект.Организация;
			ДокументНачисленияРезервов.СчетДоверительногоУправления = Объект.СчетДоверительногоУправления;
			ДокументНачисленияРезервов.ЦельРасчета = Объект.ЦельРасчета;
			
			ДокументНачисленияРезервов.ЗаполнитьРезервы(Отказ);
			
			Если Не Отказ Тогда
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Партия", ТекущиеДанные.Партия);
				СтруктураПоиска.Вставить("СтрокаПартии", ТекущиеДанные.СтрокаПартии);
				СтруктураПоиска.Вставить("Актив", ТекущиеДанные.Актив);
				
				НайденныеСтроки = ДокументНачисленияРезервов.Партии.НайтиСтроки(СтруктураПоиска);		
				
				Если НайденныеСтроки.Количество() = 1 Тогда
					ЗаполнитьЗначенияСвойств(ТекущиеДанные, НайденныеСтроки[0]);	
				Иначе
					ТекущиеДанные.РучнаяКорректировка = Истина;
				КонецЕсли;	
				
			КонецЕсли;	
			
		Иначе	
			Отказ = Истина;
		КонецЕсли;
		
	Иначе	
		Отказ = Истина;
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ПартииLGDПредставлениеПриИзменении(Элемент)
	Элементы.Партии.ТекущиеДанные.LGD  = Элементы.Партии.ТекущиеДанные.LGDПредставление/100;
	ВыполнитьПерерасчетПриИзмененииДанных();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьLGDПредставление(Форма)
	
	Объект = Форма.Объект;
	
	//Ростех особенный, у него LGD хранится не в коэффициенте а уже в процентах. Его не умножаем на 100. 
	Если Форма.ВариантРасчетаОжидаемыхКредитныхУбытков = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОжидаемыхКредитныхУбытков.Ростех") Тогда 
		
		Для Каждого СтрокаПартии Из Объект.Партии Цикл
			СтрокаПартии.LGDПредставление = СтрокаПартии.LGD;	
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаПартии Из Объект.Партии Цикл
			СтрокаПартии.LGDПредставление = СтрокаПартии.LGD * 100;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПартииСуммаРезерваПартииПриИзменении(Элемент)
	Если ЭтаФорма.Элементы.Партии.ТекущиеДанные <> Неопределено Тогда	
		ЭтаФорма.Элементы.Партии.ТекущиеДанные.РучнаяКорректировка = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеФормой(ЭтаФорма);
	
	ЗаполнитьLGDПредставление(ЭтаФорма);
	
	ЗаполнитьТекущиеДанныеНаСервере();
	
КонецПроцедуры


