&НаКлиенте
Перем ИмяТекущейСтраницы;

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	УстановитьПараметрыСпискаЦенПереоценки();
	
	Если Не Объект.Ссылка.Пустая() Тогда
	
		ЗаполнитьТаблицуЦенныхБумаг();
	
	КонецЕсли; 
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ЗаполнитьТаблицуЦенныхБумаг()
	
	НайденныеСтроки = Объект.ЦенныеБумаги.НайтиСтроки(Новый Структура("РучнаяКорректировка", Ложь));
	
	// проверяем есть ли в документе строки без ручной корректировки
	Если НайденныеСтроки.Количество() > 0 Или Не Объект.Проведен Тогда
		// это не обработанный документ, грузим в таблицу значений целиком данные объекта, добавляя "виртуальные" поля
		ЭтаФорма.ЦенныеБумаги.Загрузить(Документы.ПереоценкаЦенныхБумаг.ПолучитьТаблицуЦенныхБумаг(Объект));
		
	Иначе
		// после окончания переходного периода останется только эта ветка
		ПроверитьЗаполнениеПереоценок();
		
		Если Объект.Проведен Тогда
			ЭтаФорма.ЦенныеБумаги.Загрузить(Документы.ПереоценкаЦенныхБумаг.ПолучитьТаблицуЦенныхБумагПоДвижениямДокумента(Объект,,, Истина));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание, документ не проведен! Необходимо заполнить таблицу ценных бумаг для просмотра состава документа");
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры 

// Процедура - Проверить заполнение переоценок
// Выводит сообщения пользователю в случае, если проведены не все переоценки в даты переоценок
// анализируются переоценки за период до текущей переоценки с последней из 3х дат:
//	- дата заключения договора
//	- дата начала ведения учета по виду учета из документа
//	- дата запрета редактирования + 1 день
&НаСервере
Процедура ПроверитьЗаполнениеПереоценок()

	#Область Текст_запроса_получения_даты_начала_периода
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(Объединение.ДатаНачала) КАК ДатаНачала
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДОБАВИТЬКДАТЕ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования, ДЕНЬ, 1) КАК ДатаНачала
		|	ИЗ
		|		РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|	ГДЕ
		|		ДатыЗапретаРедактирования.Организация = &Организация
		|		И ДатыЗапретаРедактирования.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
		|		И ДатыЗапретаРедактирования.ВидУчета = &ВидУчета
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НастройкиУчетаОбщиеСрезПервых.Период
		|	ИЗ
		|		РегистрСведений.НастройкиУчетаОбщие.СрезПервых(
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И &ВестиУчетПоВиду) КАК НастройкиУчетаОбщиеСрезПервых
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СчетаДоверительногоУправления.ДатаЗаключения
		|	ИЗ
		|		Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|	ГДЕ
		|		СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления) КАК Объединение";		
	#КонецОбласти 
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВестиУчетПоВиду", "Вести" + РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(Объект.ВидУчета));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета", Объект.ВидУчета);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НачалоПериода = Выборка.ДатаНачала;
		
		Если НачалоПериода > Объект.Дата Тогда
			
			// это переоценка в закрытом периоде, ничего проверять не нужно
			Возврат;
		
		КонецЕсли; 
		
		ДатаОкончания = Объект.Дата;
		ДатыПереоценок = РаботаСПереоценкой.ОпределитьДатыПереоценокЗаПериод(Объект.СчетДоверительногоУправления, Объект.ВидУчета, НачалоПериода, ДатаОкончания); 
		
		Запрос.УстановитьПараметр("ДатыПереоценок", ДатыПереоценок);
		#Область Текст_запроса_проверки_наличия_переоценок
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДатыПереоценок.Дата КАК ДатаПереоценки
			|ПОМЕСТИТЬ _ДатыПереоценок
			|ИЗ
			|	&ДатыПереоценок КАК ДатыПереоценок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДатыПереоценок.ДатаПереоценки КАК ДатаПереоценки
			|ИЗ
			|	_ДатыПереоценок КАК _ДатыПереоценок
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
			|		ПО (ПереоценкаЦенныхБумаг.Организация = &Организация)
			|			И (ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|			И (ПереоценкаЦенныхБумаг.ВидУчета = &ВидУчета)
			|			И (ПереоценкаЦенныхБумаг.Проведен)
			|			И (_ДатыПереоценок.ДатаПереоценки = НАЧАЛОПЕРИОДА(ПереоценкаЦенныхБумаг.Дата, ДЕНЬ))
			|ГДЕ
			|	ПереоценкаЦенныхБумаг.Ссылка ЕСТЬ NULL
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПереоценки";			
		#КонецОбласти 
		РезультатЗапроса = Запрос.Выполнить();
		
		МассивДат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
		ТекстСообщения = "";
		Если МассивДат.Количество() > 10 Тогда
			ТекстСообщения = "период с " + МассивДат[0];
		ИначеЕсли МассивДат.Количество() > 0 Тогда
			ТекстСообщения = "следующие даты: " + СтрСоединить(МассивДат, "; ");
		КонецЕсли; 
		
		Если ТекстСообщения <> "" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для корректного отображения таблицы ценных бумаг необходимо проверсти переоценки за " + ТекстСообщения, Объект.Ссылка); 
		КонецЕсли; 		
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить дату начала периода переоценки", Объект.Ссылка); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	УдалитьДвижения = Объект.Проведен;
	
	Если УдалитьДвижения Тогда
		// удалим движения документа для продолжения
		НачатьТранзакцию();
		
		#Область Очистка_дат_запрета
		
		ДатыЗапретаРедактирования = РегистрыСведений.ДатыЗапретаРедактирования.СоздатьНаборЗаписей();
		
		ДатыЗапретаРедактирования.Отбор.Организация.Установить(ТекущийОбъект.Организация);
		ДатыЗапретаРедактирования.Отбор.СчетДоверительногоУправления.Установить(ТекущийОбъект.СчетДоверительногоУправления);
		ДатыЗапретаРедактирования.Отбор.ВидУчета.Установить(ТекущийОбъект.ВидУчета);
		
		ДатыЗапретаРедактирования.Записать();
		
		#КонецОбласти 
		
		ТекущийОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
	КонецЕсли; 
	
	Отказ = Ложь;
	Попытка
		РаботаСПереоценкой.ПолучитьТабличнуюЧастьПереоценки(ТекущийОбъект, , Отказ);
	Исключение
		ОписаниеОшибки = "Не удалось заполнить документ. Система сообщает:" + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки, Объект.Ссылка,,, Отказ); 
	КонецПопытки;
	
	Если УдалитьДвижения Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Если Не Отказ Тогда
		ЭтаФорма.ЦенныеБумаги.Загрузить(Документы.ПереоценкаЦенныхБумаг.ПолучитьТаблицуЦенныхБумаг(ТекущийОбъект));
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = НЕ Документы.ПереоценкаЦенныхБумаг.РазрешенаИнтерактивнаяРаботаСДокументом(ЭтаФорма.Объект);
	
	Элементы.ЦенныеБумаги.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	Элементы.ЦенныеБумаги1.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	Элементы.ЦенныеБумаги2.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	
	ПриЧтенииСозданииНаСервере();
	ВидУчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУчетаПриИзменении(Элемент)
	ВидУчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидУчетаПриИзмененииНаСервере()
	
	ЭтаФорма.Элементы.ВариантРасчетаОценочнойСтоимости.Видимость = (НЕ Объект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет);
	
	Если Объект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
	
		Объект.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ПустаяСсылка();
		Возврат;	
	
	КонецЕсли;
	
	Элементы.ВариантРасчетаОценочнойСтоимости.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыРасчетаОценочнойСтоимости.Ссылка
		|ИЗ
		|	Справочник.ВариантыРасчетаОценочнойСтоимости КАК ВариантыРасчетаОценочнойСтоимости
		|ГДЕ
		|	НЕ ВариантыРасчетаОценочнойСтоимости.ПометкаУдаления
		|	И НЕ ВариантыРасчетаОценочнойСтоимости.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВариантыРасчетаОценочнойСтоимости.Родитель";
	//	|	И ВариантыРасчетаОценочнойСтоимости.Родитель = &Родитель
		
	//Если Объект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
	//	Родитель = Справочники.ВариантыРасчетаОценочнойСтоимости.ЕПС;
	//Иначе	
	//	Родитель = Справочники.ВариантыРасчетаОценочнойСтоимости.Бухгалтерия;
	//КонецЕсли;	
	//Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.ВариантРасчетаОценочнойСтоимости.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Элементы.ЦеныПереоценки.Видимость = (Объект.ВидУчета <> Перечисления.ВидыУчета.НалоговыйУчет);
	УстановитьПараметрыСпискаЦенПереоценки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостьПереоценки(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Вопрос("Заполнение стоимости возможно только после записи документа. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЭтотОбъект.Записать();
		Иначе
			Возврат;		
		КонецЕсли; 
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура("Период, Организация, СчетДоверительногоУправления, ВидУчета", 
		НачалоДня(Объект.Дата),
		Объект.Организация,
		Объект.СчетДоверительногоУправления, 
		Объект.ВидУчета);
		
	ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
	
	Ключ = ПолучитьРегистрациюСтоимостиПереоценки(ПараметрыЗапроса);
	Если ЗначениеЗаполнено(Ключ) Тогда
		ПараметрыФормы.Вставить("Ключ", Ключ);
	КонецЕсли; 
	
	ОткрытьФорму("Документ.РегистрацияСтоимостиПереоценки.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРегистрациюСтоимостиПереоценки(ПараметрыЗапроса)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СтоимостьПереоценки.Регистратор
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Период = &Период
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ВидУчета = &ВидУчета";
		
	Запрос.УстановитьПараметр("Период", 						ПараметрыЗапроса.Период);
	Запрос.УстановитьПараметр("Организация", 					ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ПараметрыЗапроса.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета", 						ПараметрыЗапроса.ВидУчета);
	Запрос.УстановитьПараметр("ЦельРасчета", 					БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ПараметрыЗапроса.ВидУчета));
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.Регистратор;
	
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура РасшифровкаРасчета(Команда)
	
	СтрокаЦенныеБумаги = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	Если СтрокаЦенныеБумаги = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(СтрокаЦенныеБумаги.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета доступна только для облигаций");
		Возврат;
	
	КонецЕсли; 
	
	Если Объект.ВидУчета <> ПредопределенноеЗначение("Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета доступна только для единого бухгалтерского учета");
		Возврат;
	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ДатаПереоценки, Организация, СчетДоверительногоУправления, 
		|Количество, ОценочнаяСуммаКупона, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС, БалансовыйДисконт, НачальнаяРазницаППНеНаблюдаемыеДанные, БалансоваяРазницаППНеНаблюдаемыеДанные, Стоимость", 
		КонецДня(Объект.Дата), 
		Объект.Организация, 
		Объект.СчетДоверительногоУправления, 
		СтрокаЦенныеБумаги.Количество, 
		СтрокаЦенныеБумаги.ОценочнаяСуммаКупона, 
		СтрокаЦенныеБумаги.ЦеннаяБумага, 
		СтрокаЦенныеБумаги.Партия, 
		СтрокаЦенныеБумаги.СтрокаПартии,
		СтрокаЦенныеБумаги.УчетныйАктивЕПС,
		СтрокаЦенныеБумаги.БалансовыеДисконтПремия,
		СтрокаЦенныеБумаги.НачальнаяРазницаППНеНаблюдаемыеДанные,
		СтрокаЦенныеБумаги.БалансоваяРазницаППНеНаблюдаемыеДанные,
		СтрокаЦенныеБумаги.БалансоваяСумма);
	ОткрытьФорму("Отчет.РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП.Форма.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаЦенПереоценки()

	ЭтаФорма.ЦеныПереоценкиСписок.Параметры.УстановитьЗначениеПараметра("Период", НачалоДня(Объект.Дата));
	ЭтаФорма.ЦеныПереоценкиСписок.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	ЭтаФорма.ЦеныПереоценкиСписок.Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	ЭтаФорма.ЦеныПереоценкиСписок.Параметры.УстановитьЗначениеПараметра("ВидУчета", Объект.ВидУчета);
	ЭтаФорма.ЦеныПереоценкиСписок.Параметры.УстановитьЗначениеПараметра("ЦельРасчета", БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(Объект.ВидУчета));

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияПриИзменении(Объект.СчетДоверительногоУправления, ЭтаФорма);

	УстановитьПараметрыСпискаЦенПереоценки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПереоценкиПриИзменении(Элемент)
	УстановитьПараметрыСпискаЦенПереоценки();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПереоценкиСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элемент.ТекущиеДанные.Регистратор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьНастройкиФормыВоВременноеХранилищеНаСервере(КлючОбъекта, Адрес)
	
	НастройкиФормы = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта);
	
	Возврат ПоместитьВоВременноеХранилище(НастройкиФормы, Адрес);
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройкиФормы(Команда)
	
	КлючОбъекта = ЭтаФорма.ИмяФормы + "/НастройкиФормы";
	
	АдресНастроекФормы = ПоместитьНастройкиФормыВоВременноеХранилищеНаСервере(КлючОбъекта, ЭтаФорма.УникальныйИдентификатор);
	
	РаботаСФормамиКлиент.СохранитьНастройкиИзВременногоХранилищаВХранилищеВариантовИНастроекОтчетов(КлючОбъекта, ЭтаФорма.КлючТекущихНастроек, АдресНастроекФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиФормыНаСервере(КлючОбъекта, АдресНастроек)
	
	НастройкиФормы = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, , НастройкиФормы); 
	
	УдалитьИзВременногоХранилища(АдресНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиФормы(Команда)
	
	КлючОбъекта = ЭтаФорма.ИмяФормы + "/НастройкиФормы";
		
	ОписаниеНастроек = РаботаСФормамиКлиент.ПоместитьНастройкиИзХранилищаВариантовИНастроекОтчетовВоВременноеХранилище(КлючОбъекта, ЭтаФорма.КлючТекущихНастроек, ЭтаФорма.УникальныйИдентификатор);
	
	Если ОписаниеНастроек <> Неопределено Тогда
		
		ЗагрузитьНастройкиФормыНаСервере(КлючОбъекта, ОписаниеНастроек.АдресНастроекВоВременномХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ИмяТекущейСтраницы = "Переоценка" Тогда
		ЭтаФорма.Элементы.ЦенныеБумаги1.ТекущаяСтрока = ЭтаФорма.Элементы.ЦенныеБумаги.ТекущаяСтрока;
		ЭтаФорма.Элементы.ЦенныеБумаги2.ТекущаяСтрока = ЭтаФорма.Элементы.ЦенныеБумаги.ТекущаяСтрока;
	ИначеЕсли ИмяТекущейСтраницы = "ПереоценкаВВалютеУчета" Тогда
		ЭтаФорма.Элементы.ЦенныеБумаги.ТекущаяСтрока = ЭтаФорма.Элементы.ЦенныеБумаги1.ТекущаяСтрока;
		ЭтаФорма.Элементы.ЦенныеБумаги2.ТекущаяСтрока = ЭтаФорма.Элементы.ЦенныеБумаги1.ТекущаяСтрока;
	ИначеЕсли ИмяТекущейСтраницы = "Котировки" Тогда
		ЭтаФорма.Элементы.ЦенныеБумаги.ТекущаяСтрока = ЭтаФорма.Элементы.ЦенныеБумаги2.ТекущаяСтрока;
		ЭтаФорма.Элементы.ЦенныеБумаги1.ТекущаяСтрока = ЭтаФорма.Элементы.ЦенныеБумаги2.ТекущаяСтрока;
	Иначе
		ИмяТекущейСтраницы = ТекущаяСтраница.Имя;
		Возврат;
	КонецЕсли;
	
	ИмяТекущейСтраницы = ТекущаяСтраница.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяТекущейСтраницы = "Переоценка";
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЗаполнения(Команда)
	РезультатКонтроля = КонтрольЗаполненияНаСервере();
	Если ТипЗнч(РезультатКонтроля) = Тип("ТабличныйДокумент") Тогда
		Если РезультатКонтроля.ВысотаТаблицы = 0 Тогда
			ПоказатьПредупреждение(, "Расхождений не обнаружено",, "Контроль заполнения переоценки");
		Иначе
			РезультатКонтроля.ТолькоПросмотр = Истина;
			РезультатКонтроля.ОтображатьСетку = Ложь;
			РезультатКонтроля.Показать("Контроль заполнения переоценки " + Объект.СчетДоверительногоУправления + " за " + Формат(Объект.Дата, "ДФ='dd.MM.yyyy'"));
		КонецЕсли; 
	Иначе
		ОписаниеОшибки = "";
		Если ТипЗнч(РезультатКонтроля) = Тип("Строка") И ЗначениеЗаполнено(РезультатКонтроля) Тогда
			ОписаниеОшибки = ". Система сообщает:" + Символы.ПС + РезультатКонтроля;
		КонецЕсли; 
		ПоказатьПредупреждение(, "Не удалось выполнить контроль" + ОписаниеОшибки
		,, "Контроль заполнения переоценки");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КонтрольЗаполненияНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ТекущийОбъект.КонтрольЗаполнения(ЭтаФорма.ЦенныеБумаги.Выгрузить());
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЦенныеБумаги", ЭтаФорма.ЦенныеБумаги.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьРасчет(Команда)
	
	ТекущиеДанные = Элементы.ЦеныПереоценкиСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для расшифровки", , , "ЦеныПереоценкиСписок");
		Возврат;
	КонецЕсли;
	
	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом
	
	Отказ						= Ложь;
 	ДанныеЕПС					= Истина;
	НастройкиОценки				= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, ПредопределенноеЗначение("Справочник.ЦелиРасчета.ЕдиныйПланСчетов"), Истина);
	ВыполнятьРасчетПоУказаниюЦБ	= НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316;
	АдресТаблицыСтоимостей		= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели 'Единый план счетов'", , , , Отказ);
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ПоместитьФайлОценочнойСтоимостиПредоставленнойКлиентомВоВременноеХранилище(
			Объект.СчетДоверительногоУправления, Объект.Дата, ДанныеЕПС, ЭтаФорма.УникальныйИдентификатор, Отказ);
		Отказ = Отказ И Не ВыполнятьРасчетПоУказаниюЦБ; // Если оценка "заморожена", то актуальные цены от клиента не нужны
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем расшифровку расчета
	
	Ошибки				= Неопределено;
	РасшифровкаРасчета	= Неопределено;
	
	ПараметрыПереоценки	= Новый Структура("Организация, СчетДоверительногоУправления, ВидУчета, Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыПереоценки, Объект);
	ПараметрыПереоценки.Вставить("ЦельРасчета", ПредопределенноеЗначение("Справочник.ЦелиРасчета.ЕдиныйПланСчетов")); 
	
	Если РаботаСДокументами.СформироватьРасшифровкуРасчетаСтоимостиЦеннойБумаги(РасшифровкаРасчета, ПараметрыПереоценки, ТекущиеДанные.ЦеннаяБумага, НастройкиОценки.ВариантРасчетаОценочнойСтоимости, АдресТаблицыСтоимостей, Ошибки) Тогда
		РасшифровкаРасчета.Показать("Расчет стоимости '" + Строка(ТекущиеДанные.ЦеннаяБумага) + "'");		
	ИначеЕсли Ошибки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета стоимости для варианта '" + НастройкиОценки.ВариантРасчетаОценочнойСтоимости + "' не реализована");	
	Иначе
		ТекстОшибки = "Ошибка получения расшифровки расчета:" + Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
