
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
	
		ЗаполненоАналитик = 0;
		Если НЕ Сделка = Документы.Сделка.ПустаяСсылка() Тогда
			ЗаполненоАналитик = ЗаполненоАналитик + 1;
		КонецЕсли;
		Если НЕ СделкаРЕПО = Документы.СделкаРЕПО.ПустаяСсылка() Тогда
			ЗаполненоАналитик = ЗаполненоАналитик + 1;
		КонецЕсли;
		Если НЕ ВидЗадолженности = Справочники.ВидыЗадолженности.ПустаяСсылка() Тогда
			ЗаполненоАналитик = ЗаполненоАналитик + 1;
		КонецЕсли;
		
		Наименование = "";
		Если НЕ Сделка = Документы.Сделка.ПустаяСсылка() Тогда
			Если ЗаполненоАналитик = 1 Тогда
				Наименование = Наименование + "Сделка " + Лев(Сделка.Номер, 23);
			ИначеЕсли ЗаполненоАналитик = 2 Тогда
				Наименование = Наименование + "Сд. " + Лев(Сделка.Номер, 11);
			ИначеЕсли ЗаполненоАналитик = 3 Тогда
				Наименование = Наименование + "С. " + Лев(Сделка.Номер, 7);
			КонецЕсли;
		КонецЕсли;
		Если НЕ СделкаРЕПО = Документы.СделкаРЕПО.ПустаяСсылка() Тогда
			Если ЗаполненоАналитик = 1 Тогда
				Наименование = Наименование + "Сделка РЕПО " + Лев(СделкаРЕПО.Номер, 18);
			ИначеЕсли ЗаполненоАналитик = 2 Тогда
				Наименование = Наименование + " РЕПО " + Лев(СделкаРЕПО.Номер, 6);
			ИначеЕсли ЗаполненоАналитик = 3 Тогда
				Наименование = Наименование + " № " + Лев(СделкаРЕПО.Номер, 7);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВидЗадолженности = Справочники.ВидыЗадолженности.ПустаяСсылка() Тогда
			Если ЗаполненоАналитик = 1 Тогда
				Наименование = Наименование + Лев(ВидЗадолженности.Наименование, 30);
			ИначеЕсли ЗаполненоАналитик = 2 Тогда
				Наименование = Наименование + " " + Лев(ВидЗадолженности.Наименование, 14);
			ИначеЕсли ЗаполненоАналитик = 3 Тогда
				Наименование = Наименование + " " + Лев(ВидЗадолженности.Наименование, 9);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
