Функция ПолучитьПараметрыФормыОтчета(Ключ, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("ИмяФормы, ОписаниеОшибки, Параметры", "", "", Новый Структура);
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Для каждого ДопПараметр Из ДополнительныеПараметры Цикл
			ПараметрыФормы.Параметры.Вставить(ДопПараметр.Ключ, ДопПараметр.Значение);
		КонецЦикла; 
	КонецЕсли; 
		
	Если ТипЗнч(Ключ) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
	
		ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(Ключ);

		Если Ключ.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
			ПараметрыФормы.ИмяФормы = "ВнешнийОтчет." + ИмяПодключенногоОбъекта + ".Форма";
		Иначе
			ПараметрыФормы.ИмяФормы = "ВнешняяОбработка." + ИмяПодключенногоОбъекта + ".Форма";
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(Ключ) = Тип("Строка") Тогда
		
		Если Метаданные.Отчеты.Найти(Ключ) = Неопределено Тогда
			ПараметрыФормы.ОписаниеОшибки = "Отчет по заданному ключу не найден";
		Иначе
			ПараметрыФормы.ИмяФормы = "Отчет." + Ключ + ".Форма";
			ПараметрыФормы.Параметры.Вставить("Организация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
			ПараметрыФормы.Параметры.Вставить("СчетДоверительногоУправления");
		КонецЕсли; 
		
	Иначе
		
		ПараметрыФормы.ОписаниеОшибки = "По заданному ключу открытие формы отчета не реализовано";
	
	КонецЕсли; 
	
	Возврат ПараметрыФормы;
		
КонецФункции

Функция ПолучитьОбъектПоКлючу(Ключ) Экспорт

	ОбъектОтчета = Неопределено;	
	
	Если ТипЗнч(Ключ) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		
		ИмяОбработки = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(Ключ);
	
		// Проверка корректности переданных параметров
		Если ИмяОбработки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Получение экземпляра объекта
		Если Ключ.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
			Менеджер = ВнешниеОтчеты;
		Иначе
			Менеджер = ВнешниеОбработки;
		КонецЕсли;
		
		ОбъектОтчета = Менеджер.Создать(ИмяОбработки, Ложь);
		
	ИначеЕсли ТипЗнч(Ключ) = Тип("Строка") И ЗначениеЗаполнено(Ключ) Тогда
		
		ОбъектОтчета = Отчеты[Ключ].Создать();
		
	КонецЕсли;
	
	Возврат ОбъектОтчета;

КонецФункции

// Проверяет наличие интерфейса для настройки автоматического формирования отчета
//
// Параметры:
//	Отчет - СправочникСсылка.Отчеты - проверяемый отчет / обработка
//
// Возвращаемое значение:
//	Булево - Истина, если отчет поддерживает автоматическое формирование
//
Функция ПоддерживаетсяАвтоматическоеФормирование(Отчет) Экспорт

	// В модуле объекта должна быть экспортная функция АвтоматическоеФормирование
	// и притом с одним обязательным параметром

	ОтчетАвтоматизирован = Ложь;
	
	КлючОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет, "Ключ");
	
	Попытка 
		
		ОбъектОтчета = ПолучитьОбъектПоКлючу(КлючОтчета);
		ОбъектОтчета.АвтоматическоеФормирование();		
		
	Исключение
		
		ИнфоОбОшибке = ИнформацияОбОшибке();
		
		Если ИнфоОбОшибке.Описание = "Недостаточно фактических параметров" Тогда
			ОтчетАвтоматизирован = Истина;	
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат ОтчетАвтоматизирован;	
	
КонецФункции

Процедура ВыполнитьАвтоматическоеФормирование(Ключ, ДополнительныеПараметры = Неопределено) Экспорт

	ОбъектОтчета = ПолучитьОбъектПоКлючу(Ключ);
	
	Если ОбъектОтчета <> Неопределено Тогда		
		ОбъектОтчета.АвтоматическоеФормирование(ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСтандартныеДоступныеНастройки(Отчет) Экспорт

	Если ТипЗнч(Отчет.Ключ) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		
		ИмяОбработки = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(Отчет.Ключ);
	
		// Проверка корректности переданных параметров
		Если ИмяОбработки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Получение экземпляра объекта
		Если Отчет.Ключ.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
			Менеджер = ВнешниеОтчеты;
		Иначе
			Менеджер = ВнешниеОбработки;
		КонецЕсли;
		
		ОбъектОтчета = Менеджер.Создать(ИмяОбработки, Ложь);
		
	ИначеЕсли ТипЗнч(Отчет.Ключ) = Тип("Строка") И ЗначениеЗаполнено(Отчет.Ключ) Тогда
		
		ОбъектОтчета = Отчеты[Отчет.Ключ].Создать();
		
	КонецЕсли; 
	
	Попытка
		МассивНастроек = ОбъектОтчета.ПолучитьДоступныеНастройки();
	Исключение
		МассивНастроек = Новый Массив;
	КонецПопытки;
	
	ОбъектОтчета = Неопределено;
		
	// Заменим текущие настройки	
	
	УстановитьПривилегированныйРежим(Истина);

	Набор = РегистрыСведений.НазначенияНастроекОтчетов.СоздатьНаборЗаписей();
	Набор.Отбор.Отчет.Установить(Отчет);
	Набор.Записать();
	
	Для Каждого КлючНастройки Из МассивНастроек Цикл
		
		Настройка = ПланыВидовХарактеристик.НастройкиОтчетов.НайтиПоКоду(КлючНастройки);
		
		Если ЗначениеЗаполнено(Настройка) Тогда
			Запись = РегистрыСведений.НазначенияНастроекОтчетов.СоздатьМенеджерЗаписи();
			Запись.Отчет = Отчет;
			Запись.Настройка = Настройка;
			ЗаполнитьЗначенияСвойств(Запись, Запись.Настройка, "НастройкаОтчета, НастройкаКлиента, НастройкаВидаДоговора, НастройкаСчетаДоверительногоУправления, НастройкаПакета");
			Запись.Записать();
		КонецЕсли;

	КонецЦикла;		
	
КонецПроцедуры

Процедура СкопироватьДоступныеНастройки(Приемник, Источник) Экспорт
	
	НаборИсточник = РегистрыСведений.НазначенияНастроекОтчетов.СоздатьНаборЗаписей();
	НаборИсточник.Отбор.Отчет.Установить(Источник);
	НаборИсточник.Прочитать();
	
	ДанныеНабора = НаборИсточник.Выгрузить();
	ДанныеНабора.ЗаполнитьЗначения(Приемник, "Отчет");
	
	Набор = РегистрыСведений.НазначенияНастроекОтчетов.СоздатьНаборЗаписей();
	Набор.Отбор.Отчет.Установить(Приемник);
	Набор.Загрузить(ДанныеНабора);
	Набор.Записать();	
	
КонецПроцедуры