
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ИнвестиционныеДекларации") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, ТипИнвестиционнойДекларации, Комментарий");
		НоваяСтрока = ЭтотОбъект.ИнвестиционныеДекларации.Добавить();
		НоваяСтрока.ИнвестиционнаяДекларация = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТипИнвестиционнойДекларации <> Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация Тогда
		ПроверяемыеРеквизиты.Добавить("ВидДоговораДоверительногоУправления");
	КонецЕсли;
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыНазначенийИнвестиционныхДеклараций.Назначение Тогда
		ПроверяемыеРеквизиты.Добавить("ИнвестиционныеДекларации");
	КонецЕсли; 
	Если ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИнвестиционныеДекларации.НомерСтроки КАК НомерСтроки,
			|	ИнвестиционныеДекларации.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация
			|ПОМЕСТИТЬ _ИнвестиционныеДекларации
			|ИЗ
			|	&ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ИнвестиционныеДекларации.НомерСтроки КАК НомерСтроки,
			|	_ИнвестиционныеДекларации.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
			|	ЕСТЬNULL(ИнвестиционныеДекларацииСчетаДоверительногоУправления.СчетДоверительногоУправления, НЕОПРЕДЕЛЕНО) КАК СчетДоверительногоУправления,
			|	ЕСТЬNULL(КлиентыДоверительногоУправленияСрезПоследних.Клиент, НЕОПРЕДЕЛЕНО) КАК Клиент,
			|	ЕСТЬNULL(СчетаДоверительногоУправленияСправочник.ВидДоговораДоверительногоУправления, НЕОПРЕДЕЛЕНО) КАК ВидДоговораДоверительногоУправления
			|ИЗ
			|	_ИнвестиционныеДекларации КАК _ИнвестиционныеДекларации
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации.СчетаДоверительногоУправления КАК ИнвестиционныеДекларацииСчетаДоверительногоУправления
			|		ПО _ИнвестиционныеДекларации.ИнвестиционнаяДекларация = ИнвестиционныеДекларацииСчетаДоверительногоУправления.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ПО (ИнвестиционныеДекларацииСчетаДоверительногоУправления.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправленияСправочник
			|		ПО (ИнвестиционныеДекларацииСчетаДоверительногоУправления.СчетДоверительногоУправления = СчетаДоверительногоУправленияСправочник.Ссылка)
			|ИТОГИ
			|	МАКСИМУМ(НомерСтроки)
			|ПО
			|	ИнвестиционнаяДекларация";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ИнвестиционныеДекларации", ЭтотОбъект.ИнвестиционныеДекларации.Выгрузить());
		
		Результат = Запрос.Выполнить();
		
		ВыборкаИД = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИД.Следующий() Цикл
			
			ТекстОшибки = "";
			Выборка = ВыборкаИД.Выбрать();
			Пока Выборка.Следующий() Цикл
			
				Если Не ЗначениеЗаполнено(Выборка.СчетДоверительногоУправления) Тогда
					ТекстОшибки = "не заполнены счета доверительного управления";
				ИначеЕсли Выборка.Клиент <> ЭтотОбъект.Субъект Тогда
					ТекстОшибки = СтрШаблон("указаны счета доверительного управления, не принадлежащие клиенту '%1'", ЭтотОбъект.Субъект);
				ИначеЕсли Выборка.ВидДоговораДоверительногоУправления <> ЭтотОбъект.ВидДоговораДоверительногоУправления Тогда 
					ТекстОшибки = СтрШаблон("указаны счета доверительного управления с видом договора, отличным от '%1'", ЭтотОбъект.ВидДоговораДоверительногоУправления);
				КонецЕсли; 
				
				Прервать;
			
			КонецЦикла; 
						
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				ТекстСообщения = СтрШаблон("В лимитной ведомости %1 %2", ВыборкаИД.ИнвестиционнаяДекларация, ТекстОшибки);
				Поле = СтрШаблон("Объект.ИнвестиционныеДекларации[%1].ИнвестиционнаяДекларация", ВыборкаИД.НомерСтроки - 1);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, Поле,, Отказ); 
			
			КонецЕсли; 
		
		КонецЦикла;
		 
	КонецЕсли; 
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация Тогда
		ЭтотОбъект.ВидДоговораДоверительногоУправления = Неопределено;
	КонецЕсли;
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыНазначенийИнвестиционныхДеклараций.Отмена Тогда
		ЭтотОбъект.ИнвестиционныеДекларации.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СформироватьМакетыКомпоновкиДанных();
	Движения.ИнвестиционныеДекларации.Записывать = Истина;
	
	Движение = Движения.ИнвестиционныеДекларации.Добавить();
	Движение.Период = ЭтотОбъект.Дата;
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	
	Движение.Действует = (ЭтотОбъект.ВидОперации = Перечисления.ВидыНазначенийИнвестиционныхДеклараций.Назначение);
	
	Если Движение.Действует Тогда
		Движение.НазначениеИнвестиционнойДекларации = ЭтотОбъект.Ссылка;
	КонецЕсли;
		
КонецПроцедуры

Процедура СформироватьМакетыКомпоновкиДанных()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииПоказатели.НомерСтроки КАК НомерСтроки,
		|	ИнвестиционныеДекларацииПоказатели.Ссылка КАК ИнвестиционнаяДекларация
		|ИЗ
		|	Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БазисыКонтроляИнвестиционныхДеклараций КАК БазисыКонтроляИнвестиционныхДеклараций
		|			ПО ИнвестиционныеДекларацииПоказатели.Базис = БазисыКонтроляИнвестиционныхДеклараций.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыИнвестиционныхДеклараций КАК НаборыИнвестиционныхДеклараций
		|			ПО ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации = НаборыИнвестиционныхДеклараций.Ссылка
		|		ПО НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация = ИнвестиционныеДекларацииПоказатели.Ссылка
		|			И (НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка = &Ссылка)
		|ГДЕ
		|	(ИнвестиционныеДекларацииПоказатели.ИдентификаторСКДБазиса <> БазисыКонтроляИнвестиционныхДеклараций.ИдентификаторСКД
		|			ИЛИ ИнвестиционныеДекларацииПоказатели.ИдентификаторСКДНабора <> НаборыИнвестиционныхДеклараций.ИдентификаторСКД)
		|ИТОГИ ПО
		|	ИнвестиционнаяДекларация";		
	#КонецОбласти 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИД.Следующий() Цикл
	
		Выборка = ВыборкаИД.Выбрать();
		
		НомераСтрокДляОбновления = Новый Массив;
		Пока Выборка.Следующий() Цикл
		
			НомераСтрокДляОбновления.Добавить(Выборка.НомерСтроки);
		
		КонецЦикла; 
		
		Справочники.ИнвестиционныеДекларации.ОбновитьМакетыКомпоновки(ВыборкаИД.ИнвестиционнаяДекларация, НомераСтрокДляОбновления);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
