
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Стратегия.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДоступныхСтратегий(Запись.СчетДоверительногоУправления));
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Элементы.Стратегия.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДоступныхСтратегий(Запись.СчетДоверительногоУправления));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивДоступныхСтратегий(СчетДоверительногоУправления)
	
	Возврат РегистрыСведений.СтратегииИндивидуальногоИнвестирования.ПолучитьМассивДоступныхСтратегий(СчетДоверительногоУправления);
	
КонецФункции

