#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	Оповестить("ОбщаяФорма.СтруктураПодчиненности.Обновить");
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ЗаполнитьЗначенияСвойств(ЭтаФорма, Объект.Основание);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Объект.БизнесПроцесс);
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
	ЭтаФорма.ТолькоПросмотр = Объект.БизнесПроцесс.Отменен;
	
КонецПроцедуры //ПриЧтенииСозданииНаСервере

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.ДатаВыполнения.ТолькоПросмотр = Объект.Выполнена;
	
КонецПроцедуры // НастроитьВидимостьДоступность

#КонецОбласти

