
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если Не ДанныеЗаполнения.Свойство("Организация") Тогда
			ДанныеЗаполнения.Вставить("Организация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
		КонецЕсли;
	Иначе
		ДанныеЗаполнения = Новый Структура("Организация",
			ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
				
		ПроверяемыеРеквизиты.Добавить(ПроверяемыеРеквизиты.Найти("ДоговорБрокерскогоОбслуживания"));	
									
		Если ЗначениеЗаполнено(Запись.ДоговорБрокерскогоОбслуживания) Тогда
			// брокер исполнителя должен совпадать с брокером из договора
			Если Запись.ДоговорБрокерскогоОбслуживания.Контрагент <> Запись.Брокер.ЮрФизЛицо Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Брокер «" + Запись.Брокер.ЮрФизЛицо + "» отличается от брокера «"
					+ Запись.ДоговорБрокерскогоОбслуживания.Контрагент + "» договора " + Запись.ДоговорБрокерскогоОбслуживания,,,, Отказ);
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	// проверим, что в рамках счета д/у основной брокер является уникальным
	// проверяем в ПриЗаписи, т.к. в это время в регистре уже обновленный набор ("новая схема проведения")
	РазрезыУникальностиОсновногоБрокера = Новый ТаблицаЗначений;
	РазрезыУникальностиОсновногоБрокера.Колонки.Добавить("Период",                       Новый ОписаниеТипов("Дата"));
	РазрезыУникальностиОсновногоБрокера.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	
	МаксПериод = Дата(1, 1, 1); // чтобы в запросе не тянуть историю без ограничения периода
	
	Для каждого Запись Из ЭтотОбъект Цикл
		НоваяСтрокаРазрезыУникальностиОсновногоБрокера = РазрезыУникальностиОсновногоБрокера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРазрезыУникальностиОсновногоБрокера, Запись);
		
		МаксПериод = Макс(МаксПериод, Запись.Период);
	КонецЦикла;
	
	Если РазрезыУникальностиОсновногоБрокера.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РазрезыУникальностиОсновногоБрокера.Период,
			|	РазрезыУникальностиОсновногоБрокера.СчетДоверительногоУправления
			|ПОМЕСТИТЬ _РазрезыУникальностиОсновногоБрокера
			|ИЗ
			|	&РазрезыУникальностиОсновногоБрокера КАК РазрезыУникальностиОсновногоБрокера
			|ИНДЕКСИРОВАТЬ ПО
			|	РазрезыУникальностиОсновногоБрокера.Период,
			|	РазрезыУникальностиОсновногоБрокера.СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КодыСчетовДоверительногоУправленияУБрокеров.Период,
			|	КодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления,
			|	КодыСчетовДоверительногоУправленияУБрокеров.Брокер,
			|	ВЫБОР
			|		КОГДА КодыСчетовДоверительногоУправленияУБрокеров.ОсновнойБрокер ТОГДА 1 ИНАЧЕ 0
			|	КОНЕЦ КАК ОсновнойБрокер
			|ПОМЕСТИТЬ _КодыСчетовДоверительногоУправленияУБрокеров
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров КАК КодыСчетовДоверительногоУправленияУБрокеров
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РазрезыУникальностиОсновногоБрокера КАК _РазрезыУникальностиОсновногоБрокера
			|		ПО КодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления = _РазрезыУникальностиОсновногоБрокера.СчетДоверительногоУправления
			|			И КодыСчетовДоверительногоУправленияУБрокеров.Период <= &МаксПериод
			|ИНДЕКСИРОВАТЬ ПО
			|	КодыСчетовДоверительногоУправленияУБрокеров.Период,
			|	КодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления,
			|	КодыСчетовДоверительногоУправленияУБрокеров.Брокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РазрезыУникальностиОсновногоБрокера.СчетДоверительногоУправления,
			|	_КодыСчетовДоверительногоУправленияУБрокеров.Брокер,
			|	МАКСИМУМ(_КодыСчетовДоверительногоУправленияУБрокеров.Период) КАК Период
			|ПОМЕСТИТЬ
			|	_КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды
			|ИЗ
			|	_РазрезыУникальностиОсновногоБрокера
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовДоверительногоУправленияУБрокеров
			|		ПО _КодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления = _РазрезыУникальностиОсновногоБрокера.СчетДоверительногоУправления
			|			И _КодыСчетовДоверительногоУправленияУБрокеров.Период <= _РазрезыУникальностиОсновногоБрокера.Период
			|СГРУППИРОВАТЬ ПО
			|	_РазрезыУникальностиОсновногоБрокера.СчетДоверительногоУправления,
			|	_КодыСчетовДоверительногоУправленияУБрокеров.Брокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды.Период,
			|	_КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды.СчетДоверительногоУправления,
			|	_КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды.Брокер,
			|	_КодыСчетовДоверительногоУправленияУБрокеров.ОсновнойБрокер
			|ИЗ
			|	_КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовДоверительногоУправленияУБрокеров
			|		ПО _КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды.СчетДоверительногоУправления = _КодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления
			|			И _КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды.Брокер = _КодыСчетовДоверительногоУправленияУБрокеров.Брокер
			|			И _КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды.Период = _КодыСчетовДоверительногоУправленияУБрокеров.Период
			|ИТОГИ
			|	СУММА(_КодыСчетовДоверительногоУправленияУБрокеров.ОсновнойБрокер)
			|ПО
			|	_КодыСчетовДоверительногоУправленияУБрокеровЗаПериоды.СчетДоверительногоУправления";
	
		Запрос.УстановитьПараметр("РазрезыУникальностиОсновногоБрокера", РазрезыУникальностиОсновногоБрокера);
		Запрос.УстановитьПараметр("МаксПериод",                          МаксПериод);
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			Если Выборка.ОсновнойБрокер > 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать коды счетов д/у у брокеров, т.к. на " + Формат(Выборка.Период, "ДФ=dd.MM.yyyy") + " по счету д/у «" + Выборка.СчетДоверительногоУправления + "» уже задан основной брокер.",,,, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Для Стагдартных стратегий создаем запись регистра "Исполнители по денежным средствам (брокерские)", если таковая отутствует.
	Если НЕ Отказ И ЭтотОбъект.Количество() Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ТЗ"	, ЭтотОбъект.Выгрузить());
		Запрос.УстановитьПараметр("НКЦ"	, ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫРАЗИТЬ(_ТЗ.Организация КАК Справочник.Организации) КАК Организация,
			|	_ТЗ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ТЗ.Брокер КАК Брокер
			|ПОМЕСТИТЬ _ДанныеНабораЗаписей
			|ИЗ
			|	&ТЗ КАК _ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДанныеНабораЗаписей.Организация КАК Организация,
			|	_ДанныеНабораЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДанныеНабораЗаписей.Брокер КАК Брокер,
			|	СтратегииИндивидуальногоИнвестированияОсновныеРасчетныеСчетаБрокера.РасчетныйСчет КАК РасчетныйСчет
			|ИЗ
			|	_ДанныеНабораЗаписей КАК _ДанныеНабораЗаписей
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(, ) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
			|		ПО _ДанныеНабораЗаписей.Организация = СтратегииИндивидуальногоИнвестированияСрезПоследних.Организация
			|			И _ДанныеНабораЗаписей.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
			|			И (СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Стандартная)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтратегииИндивидуальногоИнвестирования.ОсновныеРасчетныеСчетаБрокера КАК СтратегииИндивидуальногоИнвестированияОсновныеРасчетныеСчетаБрокера
			|		ПО _ДанныеНабораЗаписей.Организация.ВалютаУчета = СтратегииИндивидуальногоИнвестированияОсновныеРасчетныеСчетаБрокера.РасчетныйСчет.Валюта
			|			И (&НКЦ = СтратегииИндивидуальногоИнвестированияОсновныеРасчетныеСчетаБрокера.РасчетныйСчет.ЮрФизЛицо)
			|			И _ДанныеНабораЗаписей.Организация = СтратегииИндивидуальногоИнвестированияОсновныеРасчетныеСчетаБрокера.РасчетныйСчет.Организация
			|			И (СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия = СтратегииИндивидуальногоИнвестированияОсновныеРасчетныеСчетаБрокера.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
			|		ПО _ДанныеНабораЗаписей.Организация = ИсполнителиПоДенежнымСредствамБрокерские.Организация
			|			И _ДанныеНабораЗаписей.СчетДоверительногоУправления = ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления
			|			И _ДанныеНабораЗаписей.Брокер = ИсполнителиПоДенежнымСредствамБрокерские.Брокер
			|ГДЕ
			|	ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления ЕСТЬ NULL";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИсполнителиПоДенежнымСредствамБрокерские.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить исполнителя по денежным средствам (брокерские) для " + Выборка.СчетДоверительногоУправления + "!" + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
