
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Период = ТекущаяДатаСеанса();
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	
	СКД	= РегистрыСведений.АффилированныеЛица.ПолучитьМакет("СКД");
	ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
	ЭтаФорма.Параметры.ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	ЭтаФорма.Параметры.Настройки = СКД.НастройкиПоУмолчанию;
	
	ЭтаФорма.КомпоновщикНастроек.Инициализировать(ЭтаФорма.Параметры.ИсточникДоступныхНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьРезультатКомпоновки();
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ДатаСведенийПриИзменении(Элемент)
	
	ПолучитьРезультатКомпоновки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНачалеРедактированияПериода(Значение, СтандартнаяОбработка)

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРедактирование Тогда
		
		Включить = ЭтаФорма.ТекущийСписок.НайтиСтроки(Новый Структура("Действие", 1)).Количество(); 
		Исключить = ЭтаФорма.ТекущийСписок.НайтиСтроки(Новый Структура("Действие", 2)).Количество(); 
		
		Если Включить + Исключить > 0 Тогда
			СтандартнаяОбработка = Ложь;
			ТекстВопроса = "Внимание! В состав списка были внесены изменения. Перенести изменения на указанную дату?";
			ПоказатьВопрос(Новый ОписаниеОповещения("ДатаСведенийПриИзмененииЗавершение", ЭтотОбъект, Значение), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаСведенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПриНачалеРедактированияПериода(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДатаСведенийОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПриНачалеРедактированияПериода(Дата(Текст + " 00:00:00"), СтандартнаяОбработка);
КонецПроцедуры 

&НаКлиенте
Процедура ДатаСведенийПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Период = ДополнительныеПараметры;
		ПеренестиИзменения();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Период = ДополнительныеПараметры;
		ПолучитьРезультатКомпоновки();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоПриИзменении(Элемент)
	
	ПолучитьРезультатКомпоновки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Не Элементы.ТекущийСписок.ТекущиеДанные.Действие = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Или Копирование Тогда
		ТекСтрока = Элементы.ТекущийСписок.ТекущиеДанные;
		ТекСтрока.Действие = 1;
		ТекСтрока.Период = ЭтаФорма.Период;
		ТекСтрока.ДатаОснования = ЭтаФорма.Период;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСписокПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
	
		ТекСтрока = Элементы.ТекущийСписок.ТекущиеДанные;
		НайденныеСтроки = ЭтаФорма.ТекущийСписок.НайтиСтроки(Новый Структура("АффилированноеЛицо, Основание", ТекСтрока.АффилированноеЛицо, ТекСтрока.Основание));
		Если НайденныеСтроки.Количество() > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СокрЛП(ТекСтрока.АффилированноеЛицо) + " уже присутствует в списке",,,, Отказ);
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСписокПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.ТекущийСписок.ТекущиеДанные;
	
	Отказ = Не ТекСтрока.Действие = 1;
	Если ТекСтрока.Действие = 0 Тогда
		ТекСтрока.Действие = 2;
	ИначеЕсли ТекСтрока.Действие = 2 Тогда
		ТекСтрока.Действие = 0;		
	КонецЕсли; 
	Если Отказ Тогда
		// без этого таблица не обновляется
		Элементы.ИсключитьИзСписка.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Действие", 2));
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзСпискаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекСтрока = Элементы.ИсключитьИзСписка.ТекущиеДанные;
	ТекСтрока.Действие = 0;
	
	// без этого таблица не обновляется
	Элементы.ИсключитьИзСписка.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Действие", 2));
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Значение = ПолучитьЗначениеРасшифровки(ЭтаФорма.ДанныеРасшифровки, Расшифровка);
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			ОткрытьЗначение(Значение);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры


#Область Перетаскивание

#Область НачалоПеретаскивания

&НаКлиенте
Процедура ТекущийСписокНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Для каждого Индекс Из ПараметрыПеретаскивания.Значение Цикл
		
		ТекСтрока = ЭтаФорма.ТекущийСписок.НайтиПоИдентификатору(Индекс);
		Если ТекСтрока.Действие > 0 Тогда
			Выполнение = Ложь;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Выполнение Тогда
	
		ПараметрыПеретаскивания.Значение = Новый Структура("Источник, Данные", Элемент.Имя, ПараметрыПеретаскивания.Значение);
		Элементы.СтрелкаВправо.Видимость = Истина;
		Элементы.ТекущийСписок.ЦветФона = WebЦвета.ДымчатоБелый;
		Элементы.ВключитьВСписок.ЦветФона = WebЦвета.ДымчатоБелый;
		Элементы.ИсключитьИзСписка.ЦветРамки = WebЦвета.НебесноГолубой;
	
	КонецЕсли; 	
		
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзСпискаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ПараметрыПеретаскивания.Значение = Новый Структура("Источник, Данные", Элемент.Имя, ПараметрыПеретаскивания.Значение);
	Элементы.СтрелкаВлево.Видимость = Истина;
	Элементы.ТекущийСписок.ЦветРамки = WebЦвета.НебесноГолубой;
	Элементы.ВключитьВСписок.ЦветФона = WebЦвета.ДымчатоБелый;
	Элементы.ИсключитьИзСписка.ЦветФона = WebЦвета.ДымчатоБелый;
	
КонецПроцедуры
	
#КонецОбласти

#Область ПроверкаПеретаскивания

&НаКлиенте
Процедура ТекущийСписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") И ПараметрыПеретаскивания.Значение.Свойство("Источник") Тогда
		
		СтандартнаяОбработка = Ложь;
		Если ПараметрыПеретаскивания.Значение.Источник = "ТекущийСписок" Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Иначе
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзСпискаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") И ПараметрыПеретаскивания.Значение.Свойство("Источник") Тогда
		
		СтандартнаяОбработка = Ложь;
		Если ПараметрыПеретаскивания.Значение.Источник = "ИсключитьИзСписка" Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Иначе
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Перетаскивание

&НаКлиенте
Процедура ТекущийСписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") И ПараметрыПеретаскивания.Значение.Свойство("Данные") Тогда
		Для каждого СтрокаДанные Из ПараметрыПеретаскивания.Значение.Данные Цикл
			
			ТекСтрока = ЭтаФорма.ТекущийСписок.НайтиПоИдентификатору(СтрокаДанные);
			ТекСтрока.Действие = 0;
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзСпискаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") И ПараметрыПеретаскивания.Значение.Свойство("Данные") Тогда
		Для каждого СтрокаДанные Из ПараметрыПеретаскивания.Значение.Данные Цикл
			
			ТекСтрока = ЭтаФорма.ТекущийСписок.НайтиПоИдентификатору(СтрокаДанные);
			ТекСтрока.Действие = 2;
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОкончаниеПеретаскивания

&НаКлиенте
Процедура ТекущийСписокОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	                                
	ОкончаниеПеретаскивания();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзСпискаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ОкончаниеПеретаскивания();
	
КонецПроцедуры                                                                                            

&НаКлиенте
Процедура ОкончаниеПеретаскивания()

	Элементы.СтрелкаВлево.Видимость = Ложь;
	Элементы.СтрелкаВправо.Видимость = Ложь;
	
	АвтоЦвет = Новый Цвет();
	Элементы.ТекущийСписок.ЦветФона = АвтоЦвет;
	Элементы.ТекущийСписок.ЦветРамки = АвтоЦвет;
	
	Элементы.ВключитьВСписок.ЦветФона = АвтоЦвет;
	Элементы.ВключитьВСписок.ЦветРамки = АвтоЦвет;
	
	Элементы.ИсключитьИзСписка.ЦветФона = АвтоЦвет;
	Элементы.ИсключитьИзСписка.ЦветРамки = АвтоЦвет;

КонецПроцедуры
 

#КонецОбласти 

#КонецОбласти 


#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗагрузитьИзФайла(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Файл xml (*.xml)|*.xml";

	Если ДиалогВыбора.Выбрать() Тогда
		
		Файл = Новый Файл(ДиалогВыбора.ПолноеИмяФайла);
		Если Файл.Существует() Тогда
		
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогВыбора.ПолноеИмяФайла), ЭтаФорма.УникальныйИдентификатор);
			ПараметрыФормы = Новый Структура("АдресВоВременномХранилище, ТипФайла", АдресВоВременномХранилище, Файл.Расширение);
			
			Если ОткрытьФормуМодально("РегистрСведений.АффилированныеЛица.Форма.ФормаЗагрузкиИзФайла", ПараметрыФормы) = КодВозвратаДиалога.ОК Тогда 
				ПолучитьРезультатКомпоновки();
			КонецЕсли;	
			
		Иначе
			ПоказатьПредупреждение(, "Файл не обнаружен");
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ПолучитьРезультатКомпоновки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьСписок(Команда)
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ЭтаФорма.ЮридическоеЛицо) Тогда
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ЮридическоеЛицо", ЭтаФорма.ЮридическоеЛицо));
	КонецЕсли; 
	ОткрытьФорму("РегистрСведений.АффилированныеЛица.Форма.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьСостав(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Период) Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРедактирование;
		
		Элементы.ВключитьВСписок.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Действие", 1));
		Элементы.ИсключитьИзСписка.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Действие", 2));
		
		Элементы.КомандаИзменитьСостав.Видимость = Ложь;
		Элементы.КомандаЗагрузитьИзФайла.Видимость = Ложь;
		Элементы.КомандаСохранитьИзменения.Видимость = Истина;
		Элементы.КомандаОтменитьИзменения.Видимость = Истина;
		
		ПолучитьРезультатКомпоновки();
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить дату сведений", , "Период");
	
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИзменения(Команда)
	
	ЗаписатьИзмененияНаСервере();
	ВключитьРежимОтчета();
	ПолучитьРезультатКомпоновки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьИзменения(Команда)
	
	Включить = ЭтаФорма.ТекущийСписок.НайтиСтроки(Новый Структура("Действие", 1)).Количество(); 
	Исключить = ЭтаФорма.ТекущийСписок.НайтиСтроки(Новый Структура("Действие", 2)).Количество(); 
	
	Если Включить + Исключить > 0 Тогда
		
		ТекстВопроса = "Внимание! В состав списка были внесены изменения. В случае продолжения внесенные изменения будут потеряны";
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаОтменитьИзмененияЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		
		ВключитьРежимОтчета();
		ПолучитьРезультатКомпоновки();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьИзмененияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		ВключитьРежимОтчета();
		ПолучитьРезультатКомпоновки();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ВключитьРежимОтчета()

	Элементы.КомандаИзменитьСостав.Видимость = Истина;
	Элементы.КомандаЗагрузитьИзФайла.Видимость = Истина;
	Элементы.КомандаСохранитьИзменения.Видимость = Ложь;
	Элементы.КомандаОтменитьИзменения.Видимость = Ложь;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчет;

КонецПроцедуры
 
&НаСервере
Процедура ПолучитьРезультатКомпоновки()

	ЭтаФорма.Результат.Очистить();
	
	СКД = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСКД);
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчет Тогда
		
		Настройки = ЭтаФорма.КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", 			ЭтаФорма.Период);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮридическоеЛицо",	ЭтаФорма.ЮридическоеЛицо);
	
		ДанныеРасшифровкиОбъект	= Новый ДанныеРасшифровкиКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровкиОбъект);
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровкиОбъект);
		
		ПроцессорВывода = Новый	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ЭтаФорма.Результат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОбъект, ДанныеРасшифровки);
		
	Иначе
		
		Настройки = СКД.ВариантыНастроек[1].Настройки;
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", 			ЭтаФорма.Период);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮридическоеЛицо",	ЭтаФорма.ЮридическоеЛицо);
		
		ТаблицаТекущийСписок = Новый ТаблицаЗначений;
	
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

		ПроцессорВывода = Новый	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаТекущийСписок);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

		ЭтаФорма.ТекущийСписок.Загрузить(ТаблицаТекущийСписок);
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиИзменения()

	Добавленные = ЭтаФорма.ТекущийСписок.НайтиСтроки(Новый Структура("Действие", 1));
	Удаленные = ЭтаФорма.ТекущийСписок.НайтиСтроки(Новый Структура("Действие", 2));
	
	ТекСписок = ЭтаФорма.ТекущийСписок.Выгрузить(Добавленные);
	Для каждого СтрокаУдаленные Из Удаленные Цикл
		ЗаполнитьЗначенияСвойств(ТекСписок.Добавить(), СтрокаУдаленные);
	КонецЦикла; 
	
	ПолучитьРезультатКомпоновки();
	
	НовыйСписок = ЭтаФорма.ТекущийСписок.Выгрузить();
	
	Для каждого СтрокаТекСписок Из ТекСписок Цикл
		
		НайденнаяСтрока = НовыйСписок.Найти(СтрокаТекСписок.АффилированноеЛицо, "АффилированноеЛицо");
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = НовыйСписок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТекСписок);
			НоваяСтрока.Период = ЭтаФорма.Период;
		ИначеЕсли СтрокаТекСписок.Действие = 2 Тогда
			НайденнаяСтрока.Действие = СтрокаТекСписок.Действие;
		КонецЕсли; 
	
	КонецЦикла; 
	ЭтаФорма.ТекущийСписок.Загрузить(НовыйСписок);
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	
	Для каждого СтрокаТекущийСписок Из ЭтаФорма.ТекущийСписок Цикл
		
		// Действие = 0 - уже включен в список
		// Действие = 1 - включить в список
		// Действие = 2 - исключить из списка
		
		Если СтрокаТекущийСписок.Действие > 0 Тогда
		
			Запись = РегистрыСведений.АффилированныеЛица.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаТекущийСписок);
			Запись.ЮридическоеЛицо = ЭтаФорма.ЮридическоеЛицо;
			Запись.ЯвляетсяАффилированным = СтрокаТекущийСписок.Действие = 1;
			Если СтрокаТекущийСписок.Действие = 2 Тогда
				Запись.Период = ЭтаФорма.Период;
			КонецЕсли; 
			Запись.Записать();
		
		КонецЕсли; 			
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьЗначениеРасшифровки(ДанныеРасшифровки, Расшифровка)

	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Возврат ДанныеРасшифровкиОбъект.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

КонецФункции



#КонецОбласти 




