Функция ПолучитьСтатус(ЦеннаяБумага, Статус, Биржа = Неопределено, Рынок = Неопределено, ДатаПереоценки, ЗначениеПоУмолчанию = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыЦенныхБумагСрезПоследних.Активен КАК Активен
		|ИЗ
		|	РегистрСведений.СтатусыЦенныхБумаг.СрезПоследних(
		|			&ДатаПереоценки,
		|			ЦеннаяБумага = &ЦеннаяБумага
		|				И Статус = &Статус
		|				И Биржа = &Биржа
		|				И Рынок = &Рынок) КАК СтатусыЦенныхБумагСрезПоследних");
	
	Если Биржа = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Биржа = &Биржа", "");
	КонецЕсли;
	
	Если Рынок = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Рынок = &Рынок", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаПереоценки",	ДатаПереоценки);
	Запрос.УстановитьПараметр("ЦеннаяБумага",	ЦеннаяБумага);
	Запрос.УстановитьПараметр("Статус",			Статус);
	Запрос.УстановитьПараметр("Биржа",			Биржа);
	Запрос.УстановитьПараметр("Рынок",			Рынок);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Активен, ЗначениеПоУмолчанию); 
		
КонецФункции