Функция СфомироватьДокументыСЭД(Организация, МассивСчетовДУ, Период, ТекКаталогФайлов, Подписант, ПодписантДолжность, ТекМакет)

	ТекКаталогФайлов = ТекКаталогФайлов + ?(Прав(ТекКаталогФайлов, 1) = "\", "", "\");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокПоручение.Ссылка КАК Ссылка,
		|	ДокПоручение.Организация КАК Организация,
		|	ДокПоручение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДокПоручение.Брокер КАК Брокер,
		|	ДокПоручение.РасчетныйСчетПолучатель КАК СчетПолучатель,
		|	ДокПоручение.РасчетныйСчетПолучатель.Банк КАК Банк,
		|	ДокПоручение.Сумма КАК Сумма,
		|	ДокПоручение.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ДанныеПоручений
		|ИЗ
		|	Документ.ПоручениеНаПереводДенежныхСредств КАК ДокПоручение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАкцептованияОпераций.СрезПоследних КАК НастройкиАкцептованияОперацийСрезПоследних
		|		ПО ДокПоручение.Организация = НастройкиАкцептованияОперацийСрезПоследних.Организация
		|			И ДокПоручение.СчетДоверительногоУправления = НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления
		|			И (НастройкиАкцептованияОперацийСрезПоследних.ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный))
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ДокПоручение.Дата, ДЕНЬ) = &Период
		|	И ДокПоручение.Организация = &Организация
		|	И ДокПоручение.СчетДоверительногоУправления В(&МассивСчетовДУ)
		|	И ДокПоручение.Проведен
		|	И ДокПоручение.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|	И ДокПоручение.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|	И ЕСТЬNULL(НастройкиАкцептованияОперацийСрезПоследних.ТребуетсяАкцептование, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу
		|ПОМЕСТИТЬ _РеквизитыЮрЛиц
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеПоручений.Брокер КАК Объект,
		|		_ДанныеПоручений.Брокер.ЮрФизЛицо КАК ЮрЛицо
		|	ИЗ
		|		_ДанныеПоручений КАК _ДанныеПоручений
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеПоручений.Банк,
		|		_ДанныеПоручений.Банк.ЮрФизЛицо
		|	ИЗ
		|		_ДанныеПоручений КАК _ДанныеПоручений
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
		|		КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|	ИЗ
		|		РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&МассивСчетовДУ)) КАК КлиентыДоверительногоУправленияСрезПоследних) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ВложенныйЗапрос.ЮрЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕ(КонтактныеЛица.КонтактноеЛицо) КАК Представление
		|ПОМЕСТИТЬ _ДанныеПодписанта
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|	И КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|	И КонтактныеЛица.КонтактноеЛицо = &Подписант
		|	И КонтактныеЛица.Объект.Ссылка = &ЮрЛицоОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоручений.Организация КАК Организация,
		|	_ДанныеПоручений.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДанныеПоручений.СчетПолучатель.Договор.НаименованиеВладельцаДляДокументов КАК НаименованиеВладельцаДляДокументов,
		|	_РеквизитыКлиентов.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеКлиентаПоУставу,
		|	_ДанныеПоручений.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
		|	_ДанныеПоручений.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговораДУ,
		|	_РеквизитыБанков.КраткоеНаименованиеПоУставу КАК НаименованиеБанка,
		|	_РеквизитыБК.КраткоеНаименованиеПоУставу КАК НаименованиеБК,
		|	_ДанныеПоручений.Сумма КАК Сумма,
		|	_ДанныеПоручений.СчетПолучатель.НомерСчета КАК НомерСчета,
		|	ВЫБОР
		|		КОГДА _ДанныеПоручений.Валюта = &Российский_рубль
		|			ТОГДА ""руб.""
		|		ИНАЧЕ _ДанныеПоручений.Валюта.НаименованиеПолное
		|	КОНЕЦ КАК Валюта,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговораБК,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаДоговораБК
		|ИЗ
		|	_ДанныеПоручений КАК _ДанныеПоручений
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыЮрЛиц КАК _РеквизитыКлиентов
		|		ПО _ДанныеПоручений.СчетДоверительногоУправления = _РеквизитыКлиентов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыЮрЛиц КАК _РеквизитыБанков
		|		ПО _ДанныеПоручений.Банк = _РеквизитыБанков.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыЮрЛиц КАК _РеквизитыБК
		|		ПО _ДанныеПоручений.Брокер = _РеквизитыБК.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ДанныеПоручений.СчетДоверительногоУправления
		|						ИЗ
		|							_ДанныеПоручений КАК _ДанныеПоручений)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО _ДанныеПоручений.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
		|			И _ДанныеПоручений.Брокер = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МассивСчетовДУ", МассивСчетовДУ);
	Запрос.УстановитьПараметр("Подписант", Подписант);
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Российский_рубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеПодписанта = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеПодписанта"].ПолучитьДанные().Выгрузить(); 
	
	ПодписантФИО = "";
	
	Если ДанныеПодписанта.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заполнить данные подписанта [" + Подписант + "].");
    Иначе
		ПодписантФИО = ДанныеПодписанта[0].Представление;
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На выбранную дату отсутствуют распоряжения на размещение депозитных владов.");
		Возврат Ложь;		
	КонецЕсли;
		
	Пока Выборка.Следующий() Цикл
			
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ТекМакет.Параметры.ДатаУведомления = Формат(Период, "ДФ=dd.MM.yyyy");
		ТекМакет.Параметры.ВремяУведомления = Формат(ТекущаяДатаСеанса(), "ДФ='Ч'':''мм'");
		ТекМакет.Параметры.ВидСделки = "Возврат денежных средств со счета брокера " + Выборка.НаименованиеБК + " на расчетный счет";
		ТекМакет.Параметры.ПредметСделки = "Денежные средства";
		ТекМакет.Параметры.НаименованиеКлиента = Выборка.НаименованиеВладельцаДляДокументов;
		ТекМакет.Параметры.ПолноеНаименованиеЮрЛицаКлиента = Выборка.ПолноеНаименованиеКлиентаПоУставу; 
		ТекМакет.Параметры.НомерДоговораДУ = Выборка.НомерДоговораДУ;
		ТекМакет.Параметры.ДатаДоговораДУ = Формат(Выборка.ДатаДоговораДУ, "ДФ='dd.MM.yyyy ''г.'''"); 
		
		ТекМакет.Параметры.ПодписантФИО = ПодписантФИО;
		
		ТекМакет.Параметры.Контрагент = Выборка.НаименованиеБК;
		ТекМакет.Параметры.Сумма = Формат(Выборка.Сумма, "ЧДЦ=2");
		ТекМакет.Параметры.Валюта = Выборка.Валюта;
				
		ТекМакет.Параметры.УсловияСделки = СтрШаблон("Расчетный счет %1, открыт в %2", Выборка.НомерСчета, Выборка.НаименованиеБанка);
		ТекМакет.Параметры.ДокОснование = СтрШаблон("Договор с брокером № %1 от %2 ", Выборка.НомерДоговораБК, Формат(Выборка.ДатаДоговораБК, "ДФ=dd.MM.yyyy"));
				
		ТекМакет.Параметры.СрокВыдачи = "Согласие выдано на срок один рабочий день";	
					
		ТабличныйДокумент.Вывести(ТекМакет);
		
		ТабличныйДокумент.ОтображатьСетку = Ложь;
		ТабличныйДокумент.Защита = Ложь;
		ТабличныйДокумент.ТолькоПросмотр = Ложь;
		ТабличныйДокумент.ОтображатьЗаголовки = Ложь; 
				
		ИмяФайла = РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(Строка(Выборка.Организация) + "_УОН_(возврат денежных средств со счета брокера)_"
				+ Строка(Выборка.СчетДоверительногоУправления) + "_" + Формат(Выборка.Сумма, "ЧДЦ=0") + "_" + Формат(Период, "ДФ=ddMMyyyy")) + ".xls";
		
		Попытка			
			ТабличныйДокумент.Записать(ТекКаталогФайлов + ИмяФайла, ТипФайлаТабличногоДокумента.XLS);				
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка сохранения файла " + ТекКаталогФайлов + ИмяФайла + ": " + ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

