&НаКлиенте
Процедура КомандаСоздатьАкцепт(Команда)
	
	СтруктураЗаполнения = Новый Структура;
	ТипОбъектаОснования = ПолучитьТипОснования();
	ЭлементыОтбора = ЭтотОбъект.Список.Отбор.Элементы;
	
	Для Каждого ТекЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если Не (ТекЭлементОтбора.Использование И ТипОбъектаОснования.СодержитТип(ТипЗнч(ТекЭлементОтбора.ПравоеЗначение)) И ЗначениеЗаполнено(ТекЭлементОтбора.ПравоеЗначение)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекЭлементОтбора.ПравоеЗначение) = Тип("ДокументСсылка.МНО") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя акцептовать документ МНО. Для акцептования необходимо создать распоряжение на МНО.");
			Продолжить;	
		КонецЕсли;

		СтруктураЗаполнения.Вставить("Объект", ТекЭлементОтбора.ПравоеЗначение);
		
	КонецЦикла;
		
	ФормаДокумента = ПолучитьФорму("Документ.Акцепт.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения), ЭтаФорма);
	ФормаДокумента.Открыть(); 

КонецПроцедуры

&НаСервере
Функция ПолучитьТипОснования()
	
	Возврат Метаданные.Документы.Акцепт.Реквизиты.Объект.Тип;

КонецФункции	