
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыФормы = Новый Структура("ЭтоФормаРаспорядительногоДокумента", Истина);
	Если Копирование Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли; 
	ОткрытьФорму("Документ.ВнутреннийДокумент.Форма.ФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Отказ = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ПараметрыФормы = Новый Структура("ЭтоФормаРаспорядительногоДокумента, Ключ", Истина, Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.ВнутреннийДокумент.Форма.ФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	РаботаСФайловымХранилищемКлиент.ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры
