
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	//ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведенияЕПС(Отказ, Режим)
	
	ЕПС_ГлаваБ_НачислитьПроцентыПоРЕПО(Отказ);
	
	ЕПС_ПереоценитьКомиссиюПоРЕПО();
	
	ЕПС_ГлаваГ_НачислитьКурсовуюРазницу();
	
	ЕПС_ПризнатьРасходыПоБиржевымДепозитам(Отказ);
	
	ЕПС_ПереоценитьСПФИ();
	
КонецПроцедуры

Процедура ЕПС_ГлаваБ_НачислитьПроцентыПоРЕПО(Отказ)

	Переоценивать = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("Нужно_ГлаваБ_НачислитьПроцентыПоРЕПО", Переоценивать) Тогда
		Переоценивать = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.Нужно_ГлаваБ_НачислитьПроцентыПоРЕПО(Дата, Организация, СчетДоверительногоУправления);
	КонецЕсли;
	
	Если НЕ Переоценивать Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(Дата, Организация, СчетДоверительногоУправления);
	
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВидУчета,
		Отказ);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют настройки у %1 по виду учета %2 на %3!", ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, ЭтотОбъект.Дата));
		Возврат;
	КонецЕсли;
	
	ВариантРасчетаПроцентовПоСделкамРЕПО = НастройкиПоВидуУчета.ВариантРасчетаПроцентовПоСделкамРЕПО;
			
	// С 1го сентября решено использовать "реального" контрагента по д/с в репо и процентам по репо
	// на 1ое сентября будет(возрожно) сторно старых проводок
	// контрагентом по комиссии остается брокер
	
	// ПРОЦЕНТЫ ПО РЕПО
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПОСрезПоследних.Сумма + УсловияСделокРЕПОСрезПоследних.СуммаКупона КАК СуммаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК ДатаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО КАК СтавкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК Дата,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Контрагент КАК Контрагент,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Брокер.ЮрФизЛицо КАК Брокер,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.РежимБиржевыхТоргов КАК РежимБиржевыхТоргов,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0) - ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки1.ВалютнаяСуммаОстаток, 0) КАК НачисленныеПроцентыПоРЕПО,
		|	УсловияСделокРЕПОСрезПоследних1.Сумма + УсловияСделокРЕПОСрезПоследних1.СуммаКупона КАК СуммаЗакрытияРЕПО,
		|	УсловияСделокРЕПОСрезПоследних1.ДатаВторойЧастиРЕПО КАК ДатаЗакрытияРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВидСделки КАК ВидСделки
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ПериодУсловий,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет В (&СчетаПроцентовДоход),
		|				&ВидыСубконто,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|			И УсловияСделокРЕПОСрезПоследних.ВалютаОплаты = ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет В (&СчетаПроцентовРасход),
		|				&ВидыСубконто,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки1
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = ЕдиныйБухгалтерскийУчетОстатки1.Субконто1
		|			И УсловияСделокРЕПОСрезПоследних.ВалютаОплаты = ЕдиныйБухгалтерскийУчетОстатки1.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&ПериодУсловий,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних1
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних1.СделкаРЕПО
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ДатаПереоценки";

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	СчетаПроцентовДоход = Новый Массив;
	СчетаПроцентовДоход.Добавить(ПланыСчетов.Единый.ПрочиеСредства11);
	СчетаПроцентовДоход.Добавить(ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг22);
	
	СчетаПроцентовРасход = Новый Массив;
	СчетаПроцентовРасход.Добавить(ПланыСчетов.Единый.ПрочиеСредства22);
	СчетаПроцентовРасход.Добавить(ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг09);
		
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПериодУсловий", КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("СчетаПроцентовДоход", СчетаПроцентовДоход);
	Запрос.УстановитьПараметр("СчетаПроцентовРасход", СчетаПроцентовРасход);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Реквизиты = Новый Структура("Ссылка, СчетДоверительногоУправления, Дата, Брокер, Контрагент, РежимБиржевыхТоргов");
		ЗаполнитьЗначенияСвойств(Реквизиты, ВыборкаДетальныеЗаписи);
		Реквизиты.Ссылка = ВыборкаДетальныеЗаписи.СделкаРЕПО;
		КонтрагентПоСделке = БухгалтерскийУчет.ОпределитьКонтрагентаПоСделкеРЕПО(Реквизиты, НастройкиУчета);
		
		Если ВариантРасчетаПроцентовПоСделкамРЕПО = Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРавномерномуРаспределениюПоДням Тогда
			
			ЗадолженностьПоРЕПО = РаботаСоСделкамиРЕПО.РассчитатьЗадолженностьПоСделкеРЕПОПоРавномерномуРаспределениюПоДням(
				ВыборкаДетальныеЗаписи.СуммаРЕПО,
				ВыборкаДетальныеЗаписи.СуммаЗакрытияРЕПО,
				ВыборкаДетальныеЗаписи.ДатаРЕПО,
				ВыборкаДетальныеЗаписи.ДатаЗакрытияРЕПО,
				НачалоДня(ЭтотОбъект.Дата));
			
		ИначеЕсли ВариантРасчетаПроцентовПоСделкамРЕПО = Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоСтавкеОтПервойЧастиРЕПО Тогда
				
			ЗадолженностьПоРЕПО = РаботаСоСделкамиРЕПО.РассчитатьСправедливуюСтоимостьЗадолженностиПоСделкеРЕПО(
				ВыборкаДетальныеЗаписи.СуммаРЕПО,
				ВыборкаДетальныеЗаписи.СтавкаРЕПО,
				ВыборкаДетальныеЗаписи.ДатаРЕПО,
				НачалоДня(ЭтотОбъект.Дата));
				
		ИначеЕсли ВариантРасчетаПроцентовПоСделкамРЕПО = Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРасчетнойСтавке Тогда
			
			РазрядностьОкругления = 8;
				
			РасчетнаяСтавка = РаботаСоСделкамиРЕПО.РассчитатьСтавкуРЕПО(ВыборкаДетальныеЗаписи.СуммаРЕПО,
				ВыборкаДетальныеЗаписи.СуммаЗакрытияРЕПО,
				ВыборкаДетальныеЗаписи.ДатаРЕПО,
				ВыборкаДетальныеЗаписи.ДатаЗакрытияРЕПО,
				РазрядностьОкругления);
			
			ЗадолженностьПоРЕПО = РаботаСоСделкамиРЕПО.РассчитатьСправедливуюСтоимостьЗадолженностиПоСделкеРЕПО(
				ВыборкаДетальныеЗаписи.СуммаРЕПО,
				РасчетнаяСтавка,
				ВыборкаДетальныеЗаписи.ДатаРЕПО,
				НачалоДня(ЭтотОбъект.Дата));
				
		КонецЕсли;
			
		ПроцентыПоРЕПО = ЗадолженностьПоРЕПО - ВыборкаДетальныеЗаписи.СуммаРЕПО - ВыборкаДетальныеЗаписи.НачисленныеПроцентыПоРЕПО;
			
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПроцентыПоРЕПО, ВыборкаДетальныеЗаписи.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		ЦеннаяБумага = ВыборкаДетальныеЗаписи.СделкаРЕПО.ЦенныеБумаги[0].ЦеннаяБумага;
		УчетныйАктив = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО;
		
		Если ВыборкаДетальныеЗаписи.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Если ПроцентыПоРЕПО > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Проценты по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеСредства11;
				
				Проводка.СубконтоДт.Контрагенты       = КонтрагентПоСделке;
				Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.СделкаРЕПО;
				
				Проводка.ВалютаДт  = ВыборкаДетальныеЗаписи.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = ПроцентыПоРЕПО;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
				
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту(КонтрагентПоСделке, ЭтотОбъект.Дата);
				Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
				
			ИначеЕсли ПроцентыПоРЕПО < 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -СуммаОперации, "Проценты по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеРасходы01;
				
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту(КонтрагентПоСделке, ЭтотОбъект.Дата);
				Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСредства22;
				
				Проводка.СубконтоКт.Контрагенты       = КонтрагентПоСделке;
				Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.СделкаРЕПО;
				
				Проводка.ВалютаКт  = ВыборкаДетальныеЗаписи.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = -ПроцентыПоРЕПО;
				
			КонецЕсли;
		Иначе
			Если ПроцентыПоРЕПО > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Проценты по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеРасходы01;
				
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУПроцентныхРасходовПоПривлеченнымСредствам(КонтрагентПоСделке, ЭтотОбъект.Дата);
				Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг09;
				
				Проводка.СубконтоКт.Контрагенты = КонтрагентПоСделке;
				Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.СделкаРЕПО;
				
				Проводка.ВалютаКт  = ВыборкаДетальныеЗаписи.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = ПроцентыПоРЕПО;
				
			ИначеЕсли ПроцентыПоРЕПО < 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -СуммаОперации, "Проценты по РЕПО");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг22;
				
				Проводка.СубконтоДт.Контрагенты = КонтрагентПоСделке;
				Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.СделкаРЕПО;
				
				Проводка.ВалютаДт  = ВыборкаДетальныеЗаписи.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = -ПроцентыПоРЕПО;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
				
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту(КонтрагентПоСделке, ЭтотОбъект.Дата);
				Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
				
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры

Процедура ЕПС_ПереоценитьКомиссиюПоРЕПО()

	Переоценивать = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("Нужно_ЕПС_ПереоценитьКомиссиюПоРЕПО", Переоценивать) Тогда
		Переоценивать = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.Нужно_ЕПС_ПереоценитьКомиссиюПоРЕПО(Дата, Организация, СчетДоверительногоУправления);
	КонецЕсли;
	
	Если НЕ Переоценивать Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		Дата, 
		Организация, 
		СчетДоверительногоУправления);
		
	Отказ = Ложь;
		
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
		Отказ);	
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют настройки у %1 по виду учета %2 на %3!", СчетДоверительногоУправления, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, Дата));
		Возврат;
	КонецЕсли;
		
	Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
	
		ТЗПогрешности = Новый ТаблицаЗначений;
		
		ТЗПогрешности.Колонки.Добавить("СделкаРЕПО", Новый ОписаниеТипов("ДокументСсылка.СделкаРЕПО"));
		ТЗПогрешности.Колонки.Добавить("Погрешность", Новый ОписаниеТипов("Число"));
		ТЗПогрешности.Колонки.Добавить("ПогрешностьВВалютеУчета", Новый ОписаниеТипов("Число"));
		ТЗПогрешности.Колонки.Добавить("Проводки");
		
	КонецЕсли;
		
		
	// воткнул т.к. задача ставилась НЕПРАВИЛЬНО и теперь затыкаю дыру	
	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтотОбъект.СчетДоверительногоУправления, Неопределено, Неопределено);
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	// торговая комиссия - "размазываем"
	ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТорговаяКомиссия;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходыПоКомиссии.СуммаОборот КАК КомиссияПоРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК СделкаРЕПОДата,
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ) КАК ВсегоДней,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, &ДатаПереоценки, ДЕНЬ) КАК ДнейПрошло,
		|	РасходыПоКомиссии.Валюта КАК Валюта
		|ПОМЕСТИТЬ СделкиРЕПОПроценты
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ПериодДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&ПериодДата,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК РасходыПоКомиссии
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = РасходыПоКомиссии.Сделка
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ПериодДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРЕПОПроценты.СделкаРЕПО КАК СделкаРЕПО,
		|	СделкиРЕПОПроценты.СделкаРЕПО.Брокер.ЮрФизЛицо КАК Контрагент,
		|	СделкиРЕПОПроценты.СделкаРЕПО.Контрагент КАК КонтрагентПоСделке,
		|	СделкиРЕПОПроценты.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	СделкиРЕПОПроценты.ВсегоДней КАК ВсегоДней,
		|	СделкиРЕПОПроценты.ДнейПрошло КАК ДнейПрошло,
		|	СделкиРЕПОПроценты.КомиссияПоРЕПО КАК КомиссияПоРЕПОВсего,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0) КАК КомиссияПоРЕПОНачислено,
		|	(ВЫРАЗИТЬ(СделкиРЕПОПроценты.КомиссияПоРЕПО * СделкиРЕПОПроценты.ДнейПрошло / СделкиРЕПОПроценты.ВсегоДней КАК ЧИСЛО(19, 2))) - (СделкиРЕПОПроценты.КомиссияПоРЕПО - ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0)) КАК НачислитьКомиссии,
		|	СделкиРЕПОПроценты.Валюта КАК Валюта
		|ИЗ
		|	СделкиРЕПОПроценты КАК СделкиРЕПОПроценты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет В (&СчетаУчетаКомиссий),
		|				&ВидыСубконто,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЛицевойСчет.ДополнительнаяАналитика = &ДополнительнаяАналитика) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ПО СделкиРЕПОПроценты.СделкаРЕПО = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|			И СделкиРЕПОПроценты.Валюта = ЕдиныйБухгалтерскийУчетОстатки.Валюта";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	СчетаУчетаКомиссий = Новый Массив;
	СчетаУчетаКомиссий.Добавить(ПланыСчетов.Единый.ПрочиеСредства19);
	СчетаУчетаКомиссий.Добавить(ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг19);
		
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ПериодДата", КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("СчетаУчетаКомиссий", СчетаУчетаКомиссий);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.НачислитьКомиссии > 0 Тогда
			
			СуммаКомиссии = ВыборкаДетальныеЗаписи.НачислитьКомиссии;
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			ЦеннаяБумага = ВыборкаДетальныеЗаписи.СделкаРЕПО.ЦенныеБумаги[0].ЦеннаяБумага;
			УчетныйАктив = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО;
			СделкаРЕПО = ВыборкаДетальныеЗаписи.СделкаРЕПО;
			
			КонтрагентПоСделке = ВыборкаДетальныеЗаписи.КонтрагентПоСделке;
			// некоторые клиенты не хотят раскрывать реального контрагента по репо и требуют отображать брокера
			Если НастройкиУчета.ОтражатьБрокераКакКонтрагентаНаСчетахРасчетовПоРЕПО Тогда
				КонтрагентПоСделке = ВыборкаДетальныеЗаписи.Контрагент;
			КонецЕсли;
			
			ПроводкиТорговойКомиссии = Новый Массив;
			
			ЕПС_ПризнатьКомиссиюПоРЕПО(СуммаОперации,
										СуммаКомиссии,
										СделкаРЕПО,
										ВыборкаДетальныеЗаписи.Валюта,
										УчетныйАктив,
										ЦеннаяБумага,
										КонтрагентПоСделке,
										ВыборкаДетальныеЗаписи.Контрагент,
										ДополнительнаяАналитика,
										Закрывать7ойРазделПриПоступленииДенежныхСредств,
										ПроводкиТорговойКомиссии);
			
			Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
				
				Погрешность = ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего * ВыборкаДетальныеЗаписи.ДнейПрошло / ВыборкаДетальныеЗаписи.ВсегоДней
								- (ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего - ВыборкаДетальныеЗаписи.КомиссияПоРЕПОНачислено)
								- ВыборкаДетальныеЗаписи.НачислитьКомиссии;
								
				ПогрешностьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Погрешность, ВыборкаДетальныеЗаписи.СделкаРЕПО.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);								
				
				
				СтрокиПогрешности = ТЗПогрешности.НайтиСтроки(Новый Структура("СделкаРЕПО", СделкаРЕПО));
				Если СтрокиПогрешности.Количество() = 0 Тогда
					СтрокаПогрешности = ТЗПогрешности.Добавить();
					СтрокаПогрешности.СделкаРЕПО = СделкаРЕПО;
					СтрокаПогрешности.Проводки = ПроводкиТорговойКомиссии;
				Иначе
					СтрокаПогрешности = СтрокиПогрешности[0];
				КонецЕсли;
				
				СтрокаПогрешности.Погрешность = СтрокаПогрешности.Погрешность + Погрешность;
				СтрокаПогрешности.ПогрешностьВВалютеУчета = СтрокаПогрешности.ПогрешностьВВалютеУчета + ПогрешностьВВалютеУчета;
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Комиссия брокера
	
	// Итак, тут сделано проведение по "правильной" схеме, до 1.1.18 все проведене было не очень правильно (мягко говоря).
	// По большинству клиентов 18й год проводили, но были и такие по которым только с февраля провели
	// К сожалению эта периодичность тут не зашита
	// Проведение этого документа ранее 1.1.18 меняет проводки, и Таня К.(и остальные бухгалтера) в курсе
	// 
	// С 1го марта 18го схема опять изменилась, но это уже тут учитывается
	//
	
	ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КомиссияБрокера;
	
	// ГПБ ведет себя аналогично бирже - начисляет комиссию 1 раз и сразу поэтому ее тоже размазываем
	//
	// БК до 1.3.18 ведет себя "плохо" (и это реализовано в следующем блоке)
	// но с 1.3.18 начинает вести себя "хорошо", как ГПБ
	// 
	// как оказалось в трасте по НГ ПР и Традиции ПР на новую схему перешли только с 1го апреля...
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РасходыПоКомиссии.СуммаОборот, 0) КАК КомиссияПоРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК СделкаРЕПОДата,
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ) КАК ВсегоДней,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, &ДатаПереоценки, ДЕНЬ) КАК ДнейПрошло,
		|	РасходыПоКомиссии.Валюта КАК Валюта
		|ПОМЕСТИТЬ СделкиРЕПОПроценты
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ПериодДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ЧастьСделкиРЕПО = 1
		|				И СделкаРЕПО.Брокер = &БрокерГПБ) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&ПериодДата,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоКомиссии
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = РасходыПоКомиссии.Сделка
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ПериодДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРЕПОПроценты.СделкаРЕПО КАК СделкаРЕПО,
		|	СделкиРЕПОПроценты.СделкаРЕПО.Брокер.ЮрФизЛицо КАК Контрагент,
		|	СделкиРЕПОПроценты.СделкаРЕПО.Контрагент КАК КонтрагентПоСделке,
		|	СделкиРЕПОПроценты.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	СделкиРЕПОПроценты.ВсегоДней КАК ВсегоДней,
		|	СделкиРЕПОПроценты.ДнейПрошло КАК ДнейПрошло,
		|	СделкиРЕПОПроценты.КомиссияПоРЕПО КАК КомиссияПоРЕПОВсего,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0) КАК КомиссияПоРЕПОНачислено,
		|	(ВЫРАЗИТЬ(СделкиРЕПОПроценты.КомиссияПоРЕПО * СделкиРЕПОПроценты.ДнейПрошло / СделкиРЕПОПроценты.ВсегоДней КАК ЧИСЛО(19, 2))) - (СделкиРЕПОПроценты.КомиссияПоРЕПО - ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0)) КАК НачислитьКомиссии,
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта
		|ИЗ
		|	СделкиРЕПОПроценты КАК СделкиРЕПОПроценты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет В (&СчетаУчетаКомиссий),
		|				&ВидыСубконто,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЛицевойСчет.ДополнительнаяАналитика = &ДополнительнаяАналитика) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ПО СделкиРЕПОПроценты.СделкаРЕПО = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|			И СделкиРЕПОПроценты.Валюта = ЕдиныйБухгалтерскийУчетОстатки.Валюта";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	Если ЭтотОбъект.Дата < '20180301' Тогда // до 1.3.18 только ГПБ
		Запрос.УстановитьПараметр("БрокерГПБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ"));
	ИначеЕсли (ЭтотОбъект.Дата < '20180402')
		И (СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_PR_RN_001"
			ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_UL_PR_24"
			ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_NPF037") Тогда // до 27.3.18 траст нг пр и традиция пр по-старому
		Запрос.УстановитьПараметр("БрокерГПБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ"));
	Иначе // с 1.3.18 берем всех брокеров (и ГПБ и БК)
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СделкаРЕПО.Брокер = &БрокерГПБ", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ПериодДата", КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("СчетаУчетаКомиссий", СчетаУчетаКомиссий);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.НачислитьКомиссии > 0 Тогда
			
			СуммаКомиссии = ВыборкаДетальныеЗаписи.НачислитьКомиссии;
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			ЦеннаяБумага = ВыборкаДетальныеЗаписи.СделкаРЕПО.ЦенныеБумаги[0].ЦеннаяБумага;
			УчетныйАктив = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО;
			СделкаРЕПО = ВыборкаДетальныеЗаписи.СделкаРЕПО;
			
			КонтрагентПоСделке = ВыборкаДетальныеЗаписи.КонтрагентПоСделке;
			// некоторые клиенты не хотят раскрывать реального контрагента по репо и требуют отображать брокера
			Если НастройкиУчета.ОтражатьБрокераКакКонтрагентаНаСчетахРасчетовПоРЕПО Тогда
				КонтрагентПоСделке = ВыборкаДетальныеЗаписи.Контрагент;
			КонецЕсли;
			
			ЕПС_ПризнатьКомиссиюПоРЕПО(СуммаОперации, СуммаКомиссии, СделкаРЕПО, ВыборкаДетальныеЗаписи.Валюта, УчетныйАктив, ЦеннаяБумага, КонтрагентПоСделке, ВыборкаДетальныеЗаписи.Контрагент, ДополнительнаяАналитика, Закрывать7ойРазделПриПоступленииДенежныхСредств);
			
			Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
				
				Погрешность = ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего * ВыборкаДетальныеЗаписи.ДнейПрошло / ВыборкаДетальныеЗаписи.ВсегоДней
								- (ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего - ВыборкаДетальныеЗаписи.КомиссияПоРЕПОНачислено)
								- ВыборкаДетальныеЗаписи.НачислитьКомиссии;
								
				ПогрешностьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Погрешность, ВыборкаДетальныеЗаписи.СделкаРЕПО.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);								
				
				СтрокиПогрешности = ТЗПогрешности.НайтиСтроки(Новый Структура("СделкаРЕПО", СделкаРЕПО));
				Если СтрокиПогрешности.Количество() = 0 Тогда
					СтрокаПогрешности = ТЗПогрешности.Добавить();
					СтрокаПогрешности.СделкаРЕПО = СделкаРЕПО;
				Иначе
					СтрокаПогрешности = СтрокиПогрешности[0];
				КонецЕсли;
				
				СтрокаПогрешности.Погрешность = СтрокаПогрешности.Погрешность + Погрешность;
				СтрокаПогрешности.ПогрешностьВВалютеУчета = СтрокаПогрешности.ПогрешностьВВалютеУчета + ПогрешностьВВалютеУчета;
				
			КонецЕсли;
																							
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
	
		Для каждого СтрокаТЗПогрешности Из ТЗПогрешности Цикл
			
			СтрокаТЗПогрешности.Погрешность = Окр(СтрокаТЗПогрешности.Погрешность, 2);
			СтрокаТЗПогрешности.ПогрешностьВВалютеУчета = Окр(СтрокаТЗПогрешности.ПогрешностьВВалютеУчета, 2);
			
			Если СтрокаТЗПогрешности.ПогрешностьВВалютеУчета >= 0.01 ИЛИ СтрокаТЗПогрешности.ПогрешностьВВалютеУчета <= -0.01 Тогда
			
				МассивПроводок = СтрокаТЗПогрешности.Проводки;
				
				Для каждого Проводка Из МассивПроводок Цикл
				
					Проводка.Сумма = Проводка.Сумма + СтрокаТЗПогрешности.ПогрешностьВВалютеУчета;
					
					Если Проводка.СчетДт <> ПланыСчетов.Единый.ПроцентныеДоходы03 И Проводка.СчетДт <> ПланыСчетов.Единый.АктивыВДУ03 Тогда
						Проводка.ВалютнаяСуммаДт = Проводка.ВалютнаяСуммаДт + СтрокаТЗПогрешности.Погрешность;
					КонецЕсли;
					
					Если Проводка.СчетКт <> ПланыСчетов.Единый.ПроцентныеДоходы03 И Проводка.СчетКт <> ПланыСчетов.Единый.АктивыВДУ03 Тогда
						Проводка.ВалютнаяСуммаКт = Проводка.ВалютнаяСуммаКт + СтрокаТЗПогрешности.Погрешность;
					КонецЕсли;
					
				КонецЦикла;
			
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	
	// А ТЕПЕРЬ ОБРАБОТАЕМ БРОКЕРСКУЮ КОМИССИЮ ПО БК
	//
	// до 1.3.18 все шло по извращенной схеме
	// с 1.3.18 все идет по "правильной" схеме и обработано выше
	
	Если ЭтотОбъект.Дата < '20180301' // до 1го марта все по бкшной схеме
		ИЛИ (ЭтотОбъект.Дата < '20180402' // до 2го апреля нг пр и традиции тоже
			И ((СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_PR_RN_001"
				ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_UL_PR_24"
				ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_NPF037"))) Тогда
	
		// ТО ЕЩЕ ИЗВРАЩЕНИЕ
		
		// текущий день тоже считаем, поэтому -2 и -3
		ПредыдущийРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Константы.ОсновнойКалендарьКотировок.Получить(),НачалоДня(ЭтотОбъект.Дата), -2);
		ПредПредыдущийРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Константы.ОсновнойКалендарьКотировок.Получить(),НачалоДня(ЭтотОбъект.Дата), -3);
		
		Если НачалоДня(ПредПредыдущийРабочийДень) <> (НачалоДня(ЭтотОбъект.Дата) - 86400 - 86400) Тогда
		    //если предпредыдущий день нерабочий - берем 1/3 оплаченого за предыдущий
			НачалоПериода = НачалоДня(ЭтотОбъект.Дата) - 86400;
			КонецПериода = КонецДня(ЭтотОбъект.Дата) - 86400;
			
			Коэффициент = 3;
		ИначеЕсли НачалоДня(ПредыдущийРабочийДень) <> (НачалоДня(ЭтотОбъект.Дата) - 86400) Тогда
		    //если предыдущий день нерабочий - берем 2/3 оплаченного за сегодня
			НачалоПериода = НачалоДня(ЭтотОбъект.Дата);
			КонецПериода = КонецДня(ЭтотОбъект.Дата);
			
			Коэффициент = 2;
		Иначе
		    //берем, что было оплачено вчера
			НачалоПериода = НачалоДня(ЭтотОбъект.Дата) - 86400;
			КонецПериода = КонецДня(ЭтотОбъект.Дата) - 86400;
			
			Коэффициент = 1;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасходыПоСделке.СуммаОборот КАК Комиссия,
			|	РасходыПоСделке.Сделка КАК СделкаРЕПО,
			|	РасходыПоСделке.Сделка.Брокер.ЮрФизЛицо КАК Контрагент,
			|	РасходыПоСделке.Сделка.Контрагент КАК КонтрагентПоСделке,
			|	РасходыПоСделке.Сделка.ВалютаСделки КАК ВалютаСделки,
			|	РасходыПоСделке.ЦеннаяБумага КАК ЦеннаяБумага,
			|	РасходыПоСделке.Валюта КАК Валюта
			|ИЗ
			|	РегистрНакопления.РасходыПоСделке.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В (&СписокСтратегий)
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|				И Сделка ССЫЛКА Документ.СделкаРЕПО
			|				И ВЫРАЗИТЬ(Сделка КАК Документ.СделкаРЕПО).Брокер = &БрокерБК
			|				И ВЫРАЗИТЬ(Сделка КАК Документ.СделкаРЕПО).ДатаВторойЧастиРЕПО > &КонецДня) КАК РасходыПоСделке";
		
		Запрос.УстановитьПараметр("БрокерБК", ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион"));
		Запрос.УстановитьПараметр("КонецДня", КонецДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Комиссия > 0 Тогда
				
				СуммаКомиссии = ВыборкаДетальныеЗаписи.Комиссия;
				
				Если Коэффициент = 2 Тогда
					СуммаКомиссии = Окр(СуммаКомиссии / 3 * 2, 2);
				ИначеЕсли (Коэффициент = 3) И (НачалоДня(ВыборкаДетальныеЗаписи.СделкаРЕПО.Дата) < НачалоПериода) Тогда
					СуммаКомиссии = СуммаКомиссии - Окр(СуммаКомиссии / 3 * 2, 2);
				КонецЕсли;
				
				СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
				
				ЦеннаяБумага = ВыборкаДетальныеЗаписи.СделкаРЕПО.ЦенныеБумаги[0].ЦеннаяБумага;
				УчетныйАктив = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО;
				КонтрагентПоКомиссии = ВыборкаДетальныеЗаписи.Контрагент;
				СделкаРЕПО = ВыборкаДетальныеЗаписи.СделкаРЕПО;
				
				КонтрагентПоСделке = ВыборкаДетальныеЗаписи.КонтрагентПоСделке;
				// некоторые клиенты не хотят раскрывать реального контрагента по репо и требуют отображать брокера
				Если НастройкиУчета.ОтражатьБрокераКакКонтрагентаНаСчетахРасчетовПоРЕПО Тогда
					КонтрагентПоСделке = ВыборкаДетальныеЗаписи.Контрагент;
				КонецЕсли;
				
				ЕПС_ПризнатьКомиссиюПоРЕПО(СуммаОперации, СуммаКомиссии, СделкаРЕПО, ВыборкаДетальныеЗаписи.Валюта, УчетныйАктив, ЦеннаяБумага, КонтрагентПоСделке, КонтрагентПоКомиссии, ДополнительнаяАналитика, Закрывать7ойРазделПриПоступленииДенежныхСредств);
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

Процедура ЕПС_ГлаваГ_НачислитьКурсовуюРазницу()

	// ЗАДОЛЖЕННОСТИ ПО ДС
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Сделка,
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ВЫБОР
		|		КОГДА КурсыВалют.Кратность = 0
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток * КурсыВалют.Курс / КурсыВалют.Кратность
		|	КОНЕЦ КАК СуммаОстатокНовый
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (&СчетаТребованийИОбязательствПоДС),
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Валюта <> &ВалютаУчета) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Валюта = КурсыВалют.Валюта
		|			И (КурсыВалют.Период = &ДатаПереоценки)";
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Единый.ТребованияПоПоставкеДС01);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01);
	МассивСчетов.Добавить(ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("СчетаТребованийИОбязательствПоДС", МассивСчетов);
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВалютаУчета", Организация.ВалютаУчета);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СуммаОстаток > 0 Тогда  // активный счет
			КоррСчет = ПланыСчетов.Единый.КорреспонденцияСАктивом;
		Иначе
			КоррСчет = ПланыСчетов.Единый.КорреспонденцияСПассивом;
		КонецЕсли;
		
		СуммаПереоценки = Окр(ВыборкаДетальныеЗаписи.СуммаОстатокНовый - ВыборкаДетальныеЗаписи.СуммаОстаток, 2);
		
		Если СуммаПереоценки > 0 Тогда  // увеличиваем
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаПереоценки, "Курсовая разница");
				
			// дебет
			Проводка.СчетДт = ВыборкаДетальныеЗаписи.Счет;
			
			Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Сделка;
			
			Проводка.ВалютаДт  = ВыборкаДетальныеЗаписи.Валюта;
			Проводка.ВалютнаяСуммаДт = 0;
			
			// кредит
			Проводка.СчетКт = КоррСчет;
		
		ИначеЕсли СуммаПереоценки < 0 Тогда  // уменьшаем
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -СуммаПереоценки, "Курсовая разница");
				
			// дебет
			Проводка.СчетДт = КоррСчет;
			
			// кредит
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.Счет;
			
			Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.Сделка;
			
			Проводка.ВалютаКт  = ВыборкаДетальныеЗаписи.Валюта;
			Проводка.ВалютнаяСуммаКт = 0;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЕПС_ПереоценитьСПФИ()

	УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПроцентныхДоговорах;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьСПФИ.СПФИ КАК СПФИ,
		|	СтоимостьСПФИ.Валюта КАК Валюта,
		|	СтоимостьСПФИ.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность,
		|	СтоимостьСПФИ.КредиторскаяЗадолженность КАК КредиторскаяЗадолженность
		|ПОМЕСТИТЬ _ОценкаСПФИ
		|ИЗ
		|	РегистрСведений.СтоимостьСПФИ КАК СтоимостьСПФИ
		|ГДЕ
		|	СтоимостьСПФИ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьСПФИ.Период = &ПериодКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОценкаСПФИ.СПФИ КАК СПФИ,
		|	_ОценкаСПФИ.Валюта КАК Валюта,
		|	_ОценкаСПФИ.ДебиторскаяЗадолженность - ЕСТЬNULL(ЕПС_ОстаткиВходящиеПлатежи.СуммаОстатокДт, 0) КАК ПереоценкаДебиторки,
		|	_ОценкаСПФИ.КредиторскаяЗадолженность - ЕСТЬNULL(ЕПС_ОстаткиИсходящиеПлатежи.СуммаОстатокКт, 0) КАК ПереоценкаКредиторки
		|ИЗ
		|	_ОценкаСПФИ КАК _ОценкаСПФИ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = &СчетУчетаТребованийПоПоставке,
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ПроцентыКПолучению)) КАК ЕПС_ОстаткиВходящиеПлатежи
		|		ПО _ОценкаСПФИ.СПФИ = ЕПС_ОстаткиВходящиеПлатежи.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = &СчетУчетаОбязательствПоПоставке,
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ПроцентыКУплате)) КАК ЕПС_ОстаткиИсходящиеПлатежи
		|		ПО _ОценкаСПФИ.СПФИ = ЕПС_ОстаткиИсходящиеПлатежи.Субконто1";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодКотировок", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетУчетаТребованийПоПоставке", УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке);
	Запрос.УстановитьПараметр("СчетУчетаОбязательствПоПоставке", УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаДебиторки <> 0 Тогда
			ПроводкиПереоценкиСПФИ(ВыборкаДетальныеЗаписи, Истина, ВыборкаДетальныеЗаписи.ПереоценкаДебиторки, УчетныйАктивЕПС, Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПроцентыКПолучению);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаКредиторки <> 0 Тогда
			ПроводкиПереоценкиСПФИ(ВыборкаДетальныеЗаписи, Ложь, ВыборкаДетальныеЗаписи.ПереоценкаКредиторки, УчетныйАктивЕПС, Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПроцентыКУплате);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПроводкиПереоценкиСПФИ(ВыборкаДетальныеЗаписи, Дебиторка, СуммаПереоценки, УчетныйАктивЕПС, АналитикаЛицевогоСчета)

	Если Дебиторка Тогда 
		
		СчетПроцентов = УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
		КоррСчет = ПланыСчетов.Единый.КорреспонденцияСАктивом;
		
		СторонаСчета = ?(СуммаПереоценки > 0, "Дт", "Кт");
		СторонаКоррСчета = ?(СуммаПереоценки > 0, "Кт", "Дт");
		
	Иначе
		
		СчетПроцентов = УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
	 	КоррСчет = ПланыСчетов.Единый.КорреспонденцияСПассивом;
		
		СторонаСчета = ?(СуммаПереоценки > 0, "Кт", "Дт");
		СторонаКоррСчета = ?(СуммаПереоценки > 0, "Дт", "Кт");
		
	КонецЕсли;
	
	Сумма = МатематическиеФункции.МодульЧисла(СуммаПереоценки);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Сумма, "Задолженность по процентам");
	
	// дебет
	Проводка["Счет" + СторонаСчета] = СчетПроцентов;

	Проводка["Субконто" + СторонаСчета].ЦенныеБумаги = ВыборкаДетальныеЗаписи.СПФИ;
	Проводка["Субконто" + СторонаСчета].ОснованиеРасчетов = ВыборкаДетальныеЗаписи.СПФИ;

	Проводка["Валюта" + СторонаСчета] = ВыборкаДетальныеЗаписи.Валюта;
	Проводка["ВалютнаяСумма" + СторонаСчета] = Сумма;

	// кредит
	Проводка["Счет" + СторонаКоррСчета] = КоррСчет;
	
	Проводка.Партия = ВыборкаДетальныеЗаписи.СПФИ;
	Проводка.СтрокаПартии = 0;
	
	Проводка["ДополнительнаяАналитика" + СторонаСчета] = АналитикаЛицевогоСчета;

КонецПроцедуры

Процедура БУНУ_ПереоценкаЗадолженностейПоСделкамТПлюс(Отказ, УчетныйРегистр)
	
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.БухгалтерскийУчет);
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют настройки для указанной цели расчета!",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Справочники.ВариантыРасчетаОценочнойСтоимости.ПолучитьЗадолженностиПоСделкамСОтложеннымИсполнением(
		НастройкиОценки.ВариантРасчетаОценочнойСтоимости,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.Дата,
		Неопределено,
		Отказ,
		МенеджерВременныхТаблиц);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Возможно, в регистре сведений 'Настройки целей расчета' неверно установлен вариант расчета оценочной стоимости");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ _СделкиСОтложеннымИсполнением"; 
	Задолженности = Запрос.Выполнить().Выгрузить();
	
	ЗадолженностиПоСделкам = Задолженности.Скопировать(Новый Структура("ВидЗадолженности", Справочники.ВидыЗадолженности.ПоСделке), "ВидАктива, Основание, СубъектАналитики, СуммаРынокВВалютеУчета");
	
	ОбращениеНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦенныхБумагНаОРЦБ(ЭтотОбъект.Дата, ЗадолженностиПоСделкам.ВыгрузитьКолонку("СубъектАналитики"), УчетныйРегистр);
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Граница",						Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период",							ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета",						ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("ОбращениеНаОРЦБ",				ОбращениеНаОРЦБ);
	Запрос.УстановитьПараметр("Задолженности",					ЗадолженностиПоСделкам);
	
	ВидыСубконто = новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Сделка);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	Запрос.УстановитьПараметр("ВидыСубконто",					ВидыСубконто);
	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОбращениеНаОРЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
	               |	ОбращениеНаОРЦБ.ОбращаетсяНаОРЦБ КАК ОбращениеНаОРЦБ
	               |ПОМЕСТИТЬ _ОбращениеНаОРЦБ
	               |ИЗ
	               |	&ОбращениеНаОРЦБ КАК ОбращениеНаОРЦБ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки КАК АналитикаДоходовОтПереоценки
	               |ПОМЕСТИТЬ _АналитикаПереоценки
	               |ИЗ
	               |	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И ВидУчета = &ВидУчета
	               |				И УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЗадолженностьДСПоСделкамТПлюс)
	               |				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаАктивовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Задолженности.ВидАктива КАК ВидАктива,
	               |	Задолженности.Основание КАК Сделка,
	               |	Задолженности.СубъектАналитики КАК ЦеннаяБумага,
	               |	ВЫБОР
	               |		КОГДА Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	               |			ТОГДА -Задолженности.СуммаРынокВВалютеУчета
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаДт,
	               |	ВЫБОР
	               |		КОГДА Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА Задолженности.СуммаРынокВВалютеУчета
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаКт,
	               |	ВЫБОР
	               |		КОГДА Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА Задолженности.СуммаРынокВВалютеУчета
	               |		ИНАЧЕ -Задолженности.СуммаРынокВВалютеУчета
	               |	КОНЕЦ КАК Сумма
	               |ПОМЕСТИТЬ _Задолженности
	               |ИЗ
	               |	&Задолженности КАК Задолженности
	               |ГДЕ
	               |	Задолженности.Основание ССЫЛКА Документ.Сделка
	               |	И НЕ ВЫРАЗИТЬ(Задолженности.Основание КАК Документ.Сделка).МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сделка,
	               |	СуммаДт,
	               |	СуммаКт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	БухгалтерскийУчетОстатки.Субконто1 КАК Сделка,
	               |	БухгалтерскийУчетОстатки.Субконто2 КАК ЦеннаяБумага,
	               |	ВЫБОР
	               |		КОГДА _Задолженности.СуммаДт <> БухгалтерскийУчетОстатки.СуммаОстатокДт
	               |			ТОГДА -БухгалтерскийУчетОстатки.СуммаОстатокДт
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаДт,
	               |	ВЫБОР
	               |		КОГДА _Задолженности.СуммаКт <> БухгалтерскийУчетОстатки.СуммаОстатокКт
	               |			ТОГДА -БухгалтерскийУчетОстатки.СуммаОстатокКт
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаКт
	               |ПОМЕСТИТЬ _ТекущиеЗадолженности
	               |ИЗ
	               |	_Задолженности КАК _Задолженности
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
	               |				&Граница,
	               |				Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаСделокТПлюс),
	               |				&ВидыСубконто,
	               |				Организация = &Организация
	               |					И СчетДоверительногоУправления = &СчетДоверительногоУправления
	               |					И Субконто1 В
	               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |							_Задолженности.Сделка КАК Сделка
	               |						ИЗ
	               |							_Задолженности КАК _Задолженности)) КАК БухгалтерскийУчетОстатки
	               |		ПО _Задолженности.Сделка = БухгалтерскийУчетОстатки.Субконто1
				   |			И _Задолженности.ЦеннаяБумага = БухгалтерскийУчетОстатки.Субконто2
	               |			И (_Задолженности.СуммаДт <> БухгалтерскийУчетОстатки.СуммаОстатокДт
	               |				ИЛИ _Задолженности.СуммаКт <> БухгалтерскийУчетОстатки.СуммаОстатокКт)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаСделокТПлюс) КАК СчетДт,
	               |	_ТекущиеЗадолженности.Сделка КАК СубконтоДт1,
	               |	_ТекущиеЗадолженности.ЦеннаяБумага КАК СубконтоДт2,
	               |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы) КАК СчетКт,
	               |	_АналитикаПереоценки.АналитикаДоходовОтПереоценки КАК СубконтоКт1,
	               |	_ТекущиеЗадолженности.ЦеннаяБумага КАК СубконтоКт2,
	               |	_ОбращениеНаОРЦБ.ОбращениеНаОРЦБ КАК СубконтоКт3,
	               |	_ТекущиеЗадолженности.СуммаДт КАК Сумма,
	               |	ИСТИНА КАК Сторнирование
	               |ИЗ
	               |	_ТекущиеЗадолженности КАК _ТекущиеЗадолженности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _ОбращениеНаОРЦБ КАК _ОбращениеНаОРЦБ
	               |		ПО _ТекущиеЗадолженности.ЦеннаяБумага = _ОбращениеНаОРЦБ.ЦеннаяБумага
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _АналитикаПереоценки КАК _АналитикаПереоценки
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	_ТекущиеЗадолженности.СуммаДт < 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы),
	               |	_АналитикаПереоценки.АналитикаДоходовОтПереоценки,
	               |	_ТекущиеЗадолженности.ЦеннаяБумага,
	               |	_ОбращениеНаОРЦБ.ОбращениеНаОРЦБ,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаСделокТПлюс),
	               |	_ТекущиеЗадолженности.Сделка,
	               |	_ТекущиеЗадолженности.ЦеннаяБумага,
	               |	НЕОПРЕДЕЛЕНО,
	               |	_ТекущиеЗадолженности.СуммаКт,
	               |	ИСТИНА
	               |ИЗ
	               |	_ТекущиеЗадолженности КАК _ТекущиеЗадолженности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _ОбращениеНаОРЦБ КАК _ОбращениеНаОРЦБ
	               |		ПО _ТекущиеЗадолженности.ЦеннаяБумага = _ОбращениеНаОРЦБ.ЦеннаяБумага
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _АналитикаПереоценки КАК _АналитикаПереоценки
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	_ТекущиеЗадолженности.СуммаКт < 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА _Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаСделокТПлюс)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА _Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА _Задолженности.Сделка
	               |		ИНАЧЕ _АналитикаПереоценки.АналитикаДоходовОтПереоценки
	               |	КОНЕЦ,
	               |	_Задолженности.ЦеннаяБумага,
	               |	ВЫБОР
	               |		КОГДА _Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА НЕОПРЕДЕЛЕНО
	               |		ИНАЧЕ _ОбращениеНаОРЦБ.ОбращениеНаОРЦБ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА _Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаСделокТПлюс)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА _Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА _АналитикаПереоценки.АналитикаДоходовОтПереоценки
	               |		ИНАЧЕ _Задолженности.Сделка
	               |	КОНЕЦ,
	               |	_Задолженности.ЦеннаяБумага,
	               |	ВЫБОР
	               |		КОГДА _Задолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	               |			ТОГДА _ОбращениеНаОРЦБ.ОбращениеНаОРЦБ
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ,
	               |	_Задолженности.Сумма,
	               |	ЛОЖЬ
	               |ИЗ
	               |	_Задолженности КАК _Задолженности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _ОбращениеНаОРЦБ КАК _ОбращениеНаОРЦБ
	               |		ПО _Задолженности.ЦеннаяБумага = _ОбращениеНаОРЦБ.ЦеннаяБумага
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _АналитикаПереоценки КАК _АналитикаПереоценки
	               |		ПО (ИСТИНА)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.Сумма, ?(Выборка.Сторнирование, "Сторно переоценки сделки Т+", "Переоценка сделки Т+"));
		
		Проводка.СчетДт = Выборка.СчетДт;
		Проводка.СчетКт = Выборка.СчетКт;
		
		ИндексСубконто = 1;
		
		Для Каждого ТекСубконто Из Проводка.СчетДт.ВидыСубконто Цикл
			Проводка.СубконтоДт[ТекСубконто.ВидСубконто] = Выборка["СубконтоДт" + ИндексСубконто];
			ИндексСубконто = ИндексСубконто + 1;
		КонецЦикла;
		
		ИндексСубконто = 1;
		
		Для Каждого ТекСубконто Из Проводка.СчетКт.ВидыСубконто Цикл
			Проводка.СубконтоКт[ТекСубконто.ВидСубконто] = Выборка["СубконтоКт" + ИндексСубконто];
			ИндексСубконто = ИндексСубконто + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЕПС_ПризнатьКомиссиюПоРЕПО(СуммаОперации, СуммаКомиссии, СделкаРЕПО, ВалютаСделки, УчетныйАктив, ЦеннаяБумага, Контрагент, КонтрагентПоКомиссии, ДополнительнаяАналитика, Закрывать7ойРазделПриПоступленииДенежныхСредств, ВозвращаемыеПроводки = Неопределено)

	Если ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТорговаяКомиссия Тогда
	
		ОписаниеПроводкиНачисления = "Начисление торговой комиссия";
		ОписаниеПроводкиПризнания = "Признание торговой комиссия";
		ОписаниеПроводкиЗакрытия = "Торговая комиссия закрытие расхода";
		
	ИначеЕсли ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КомиссияБрокера Тогда
		
		ОписаниеПроводкиНачисления = "Начисление брокерской комиссия";
		ОписаниеПроводкиПризнания = "Признание брокерской комиссия";
		ОписаниеПроводкиЗакрытия = "Комиссия брокера закрытие расхода";
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата) И ЭтотОбъект.Дата > '20230101' Тогда
	
		ГФУ = БухгалтерскийУчетЕПС.ОпределитьГФУКомиссионныхРасходовПоСредствамПредоставленнымКонтрагенту(КонтрагентПоКомиссии, ЭтотОбъект.Дата);
		
	Иначе
		ГФУ = БухгалтерскийУчетЕПС.ОпределитьГФУКомиссионныхРасходовПоСредствамПредоставленнымКонтрагенту(Контрагент, ЭтотОбъект.Дата);
	КонецЕсли;
	
	// ПРИЗНАНИЕ КОМИССИИ
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ОписаниеПроводкиНачисления);
	
	// дебет
	Если СделкаРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеДоходы03;
		
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
	Иначе
		Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеРасходы02;
		
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУКомиссионныхРасходовПоПривлеченнымСредствам(Контрагент, ЭтотОбъект.Дата);
	КонецЕсли;
	Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
	
	// кредит
	Если СделкаРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСредства18;
	Иначе
		Проводка.СчетКт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг18;
	КонецЕсли;	
	
	Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
	Проводка.СубконтоКт.ОснованиеРасчетов = СделкаРЕПО;
	
	Проводка.ВалютаКт = ВалютаСделки;
	Проводка.ВалютнаяСуммаКт = СуммаКомиссии;
	
	Если ВозвращаемыеПроводки <> Неопределено Тогда
		ВозвращаемыеПроводки.Добавить(Проводка);
	КонецЕсли;
	
	// СВЕРНЕМ 18 и 19
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ОписаниеПроводкиПризнания);
	
	// дебет
	Если СделкаРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеСредства18;
	Иначе
		Проводка.СчетДт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг18;
	КонецЕсли;	
	
	Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
	Проводка.СубконтоДт.ОснованиеРасчетов = СделкаРЕПО;
	
	Проводка.ВалютаДт = ВалютаСделки;
	Проводка.ВалютнаяСуммаДт = СуммаКомиссии;
	
	// кредит
	Если СделкаРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСредства19;
	Иначе
		Проводка.СчетКт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг19;
	КонецЕсли;	
	
	Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
	Проводка.СубконтоКт.ОснованиеРасчетов = СделкаРЕПО;
	
	Проводка.ВалютаКт = ВалютаСделки;
	Проводка.ВалютнаяСуммаКт = СуммаКомиссии;
	Проводка.ДополнительнаяАналитикаКт = ДополнительнаяАналитика;
	
	Если ВозвращаемыеПроводки <> Неопределено Тогда
		ВозвращаемыеПроводки.Добавить(Проводка);
	КонецЕсли;
	
	// ЗАКРЫТИЕ РАСХОДОВ ПО ТОРГОВОЙ КОМИССИИ НА АКТИВЫ В ДУ
	Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ОписаниеПроводкиЗакрытия);
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоДт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
		
		// кредит
		Если СделкаРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы03;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
		Иначе
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеРасходы02;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУКомиссионныхРасходовПоПривлеченнымСредствам(Контрагент, ЭтотОбъект.Дата);
		КонецЕсли;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		
		Если ВозвращаемыеПроводки <> Неопределено Тогда
			ВозвращаемыеПроводки.Добавить(Проводка);
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

Функция ДисконтироватьЗадолженностиПоСделкамРЕПО(МассивАктивов)
	
	Если ЭтотОбъект.ВидУчета <> Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, "ПроверятьСтавкуРЕПОнаРыночность") Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	МассивВидовАктивов = Новый Массив;
	МассивВидовАктивов.Добавить(Перечисления.ВидыАктивовДляПроверкиНаРыночность.ПрямоеРЕПО);
	МассивВидовАктивов.Добавить(Перечисления.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО);
	
	Возврат РаботаСоСтоимостьюПоРыночнойСтавке.ЕстьНастройкиПроверкиНаРыночность(
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.Дата,
		БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ЭтотОбъект.ВидУчета),
		МассивВидовАктивов,
		МассивАктивов);
	
КонецФункции

//Параметр СтруктураПереоценкиПервоначальногоПризнания - структура, содержащая значения:
//		- ПереоцениватьПрямоеРЕПО
//      - ТолькоПервоначальноеПризнаниеПрямогоРЕПО
//      - ПереоцениватьОбратноеРЕПО
//      - ТолькоПервоначальноеПризнаниеОбратногоРЕПО
//
Процедура БУНУ_НачислитьПроцентыПоРЕПО(СтруктураПереоценки, Отказ)
	
	СуммыЗаймовПоПериодам = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.РассчитатьПроцентыПоРЕПО(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата, БухгалтерскийУчетПовтИсп.ОпределитьЦельРасчетаПоВидуУчета(ЭтотОбъект.ВидУчета),, Отказ);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось рассчитать проценты по сделкам РЕПО",ЭтотОбъект.Ссылка);
		Возврат;
	КонецЕсли;
	
	КоличествоСтрокСуммыЗаймовПоПериодам = СуммыЗаймовПоПериодам.Количество();

	Если КоличествоСтрокСуммыЗаймовПоПериодам = 0 Тогда
		//нет сделок
		Возврат;
	КонецЕсли;

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	//получим настройки
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);	
	
	НастройкиПрямогоРЕПО = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.РасчетыПоПрямомуРЕПО,УчетныйРегистр);
	НастройкиОбратногоРЕПО = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.РасчетыПоОбратномуРЕПО,УчетныйРегистр);
	АналитикаПроцентовПрямогоРЕПО = НастройкиПрямогоРЕПО.АналитикаДоходов; 
	АналитикаПроцентовОбратногоРЕПО = НастройкиОбратногоРЕПО.АналитикаДоходов;
	АналитикаПерекурсовкиПрямогоРЕПО = НастройкиПрямогоРЕПО.АналитикаПерекурсовки; 
	АналитикаПерекурсовкиОбратногоРЕПО = НастройкиОбратногоРЕПО.АналитикаПерекурсовки; 
	
	//т.к. у ПИФов идет оценка по справедливй стоимости, то подменяем аналитику. Если есть чем
	ЭтоПИФ = СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;
	
	Если ЭтоПИФ Тогда
		АналитикаПереоценкиПрямогоРЕПО = НастройкиПрямогоРЕПО.АналитикаДоходовОтПереоценки; 
		Если ЗначениеЗаполнено(АналитикаПереоценкиПрямогоРЕПО) И АналитикаПереоценкиПрямогоРЕПО <> АналитикаПроцентовПрямогоРЕПО Тогда
			АналитикаПроцентовПрямогоРЕПО = АналитикаПереоценкиПрямогоРЕПО; 
		КонецЕсли;
		
		АналитикаПереоценкиОбратногоРЕПО = НастройкиОбратногоРЕПО.АналитикаДоходовОтПереоценки; 
		Если ЗначениеЗаполнено(АналитикаПереоценкиОбратногоРЕПО) И АналитикаПереоценкиОбратногоРЕПО <> АналитикаПроцентовОбратногоРЕПО Тогда
			АналитикаПроцентовОбратногоРЕПО = АналитикаПереоценкиОбратногоРЕПО; 
		КонецЕсли;
	КонецЕсли;
	
	АналитикаПервоначальногоПризнанияПрямогоРЕПО = НастройкиПрямогоРЕПО.АналитикаПервоначальногоПризнания;
	АналитикаПервоначальногоПризнанияОбратногоРЕПО = НастройкиОбратногоРЕПО.АналитикаПервоначальногоПризнания;
	ВыделятьАналитикуПервоначальногоПризнанияПрямогоРЕПО = НастройкиПрямогоРЕПО.ПереоцениватьВДеньОперации 
		И ЗначениеЗаполнено(АналитикаПервоначальногоПризнанияПрямогоРЕПО) 
		И АналитикаПервоначальногоПризнанияПрямогоРЕПО <> АналитикаПроцентовПрямогоРЕПО;
	ВыделятьАналитикуПервоначальногоПризнанияОбратногоРЕПО = НастройкиОбратногоРЕПО.ПереоцениватьВДеньОперации 
		И ЗначениеЗаполнено(АналитикаПервоначальногоПризнанияОбратногоРЕПО) 
		И АналитикаПервоначальногоПризнанияОбратногоРЕПО <> АналитикаПроцентовОбратногоРЕПО;
	
	
	//Если нужно получим сделки за дату оценки
	ТаблицаПервоначальногоПризнания = Неопределено;
	Если СтруктураПереоценки.ТолькоПервоначальноеПризнаниеПрямогоРЕПО ИЛИ ВыделятьАналитикуПервоначальногоПризнанияПрямогоРЕПО 
		ИЛИ СтруктураПереоценки.ТолькоПервоначальноеПризнаниеОбратногоРЕПО ИЛИ ВыделятьАналитикуПервоначальногоПризнанияОбратногоРЕПО Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&КонецДня,
			|			СделкаРЕПО В (&СделкиРЕПО)
			|				И ЧастьСделкиРЕПО = 1
			|				И Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокРЕПОСрезПоследних
			|ГДЕ
			|	НЕ УсловияСделокРЕПОСрезПоследних.Отменено
			|	И (УсловияСделокРЕПОСрезПоследних.ДатаИсполнения МЕЖДУ &НачалоДня И &КонецДня
			|			ИЛИ УсловияСделокРЕПОСрезПоследних.ДатаОплаты МЕЖДУ &НачалоДня И &КонецДня)";
		
		Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
		Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
		Запрос.УстановитьПараметр("СделкиРЕПО", СуммыЗаймовПоПериодам.ВыгрузитьКолонку("Основание"));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		
		ТаблицаПервоначальногоПризнания = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;	
	
	СуммыЗаймовПоПериодам.Колонки.Добавить("ЭтоПрямоеРЕПО");
	СуммыЗаймовПоПериодам.Колонки.Добавить("ЭтоПервоначальноеПризнание");
	
	Для сц = -(КоличествоСтрокСуммыЗаймовПоПериодам - 1) По 0 Цикл
		
		СтрокаРЕПО = СуммыЗаймовПоПериодам.Получить(-сц);
		
		СтрокаРЕПО.ЭтоПрямоеРЕПО = Документы.СделкаРЕПО.ЭтоПрямоеРЕПО(СтрокаРЕПО.Основание.ЧастьСделкиРЕПО, СтрокаРЕПО.Основание.ВидСделки);
		//ЭтоПервоначальноеПризнание заполняем если требуется
		СтрокаРЕПО.ЭтоПервоначальноеПризнание = ?(ТаблицаПервоначальногоПризнания = Неопределено, Ложь, ТаблицаПервоначальногоПризнания.Найти(СтрокаРЕПО.Основание) <> Неопределено);
		
		Если СтрокаРЕПО.ЭтоПрямоеРЕПО ТОгда
			Если СтруктураПереоценки.ПереоцениватьПрямоеРЕПО Тогда
				Если НЕ СтруктураПереоценки.ТолькоПервоначальноеПризнаниеПрямогоРЕПО  Тогда
					Продолжить;
				ИначеЕсли СтрокаРЕПО.ЭтоПервоначальноеПризнание Тогда 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если СтруктураПереоценки.ПереоцениватьОбратноеРЕПО Тогда
				Если НЕ СтруктураПереоценки.ТолькоПервоначальноеПризнаниеОбратногоРЕПО Тогда
					Продолжить;
				ИначеЕсли СтрокаРЕПО.ЭтоПервоначальноеПризнание Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СуммыЗаймовПоПериодам.Удалить(СтрокаРЕПО);

	КонецЦикла;
	
	Если ДисконтироватьЗадолженностиПоСделкамРЕПО(СуммыЗаймовПоПериодам.ВыгрузитьКолонку("Основание")) Тогда
		
		ЗадолженностьПоСделкамРЕПО = Новый ТаблицаЗначений;
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("СделкаРЕПО");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("Задолженность");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("Ставка");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("ДатаИсполнения");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("ЗадолженностьПоСС");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("СуммаПроцентов");
		
		Для каждого Займ из СуммыЗаймовПоПериодам Цикл
			//т.к. может быть несколько периодов по займу - берем последний, там текущая задолженность
			СтрокаСделкиРЕПО = ЗадолженностьПоСделкамРЕПО.Найти(Займ.Основание, "СделкаРЕПО");
			Если СтрокаСделкиРЕПО = Неопределено Тогда  
				СтрокаСделкиРЕПО = ЗадолженностьПоСделкамРЕПО.Добавить();
				СтрокаСделкиРЕПО.СделкаРЕПО = Займ.Основание;
				СтрокаСделкиРЕПО.Ставка = Займ.СтавкаРЕПО;
				СтрокаСделкиРЕПО.ДатаИсполнения = Займ.ДатаРЕПО;
				СтрокаСделкиРЕПО.СуммаПроцентов = 0;
			КонецЕсли;
			СтрокаСделкиРЕПО.Задолженность = Займ.СуммаВЗалоге;
			СтрокаСделкиРЕПО.СуммаПроцентов = СтрокаСделкиРЕПО.СуммаПроцентов + Займ.СуммаПроцентов;
		КонецЦикла;
		
		РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьРЕПОПоРыночнойСтавке(
			ЗадолженностьПоСделкамРЕПО, 
			ЭтотОбъект.СчетДоверительногоУправления, 
			ЭтотОбъект.Дата, 
			БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ЭтотОбъект.ВидУчета),
			Неопределено,
			Неопределено,
			Отказ);
	
		СуммыЗаймовПоПериодам.Свернуть("Основание, ВалютаСделки, Контрагент, ЭтоПрямоеРЕПО, ЭтоПервоначальноеПризнание","СуммаПроцентов");
		
		Для Каждого СтрокаСделкиРЕПО из ЗадолженностьПоСделкамРЕПО Цикл
			СтрокаЗайма = СуммыЗаймовПоПериодам.Найти(СтрокаСделкиРЕПО.СделкаРЕПО, "Основание");
			Если СтрокаЗайма <> Неопределено Тогда
				Если СтрокаЗайма.СуммаПроцентов <> СтрокаСделкиРЕПО.СуммаПроцентов Тогда
					СтрокаЗайма.СуммаПроцентов = СтрокаСделкиРЕПО.СуммаПроцентов;
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена сделка РЕПО " + СтрокаСделкиРЕПО.СделкаРЕПО + " при дисконтировании задолженности за " + Формат(ЭтотОбъект.Дата,"ДФ=dd.MM.yyyy"), ЭтотОбъект.Ссылка,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
	
		СуммыЗаймовПоПериодам.Свернуть("Основание, ВалютаСделки, Контрагент, ЭтоПрямоеРЕПО, ЭтоПервоначальноеПризнание","СуммаПроцентов");
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(НалоговыйУчетОстатки.СуммаОстаток, 0) КАК НачисленныеПроцентыПоРЕПОВВалютеУчета,
		|	ЕСТЬNULL(НалоговыйУчетОстатки.ВалютнаяСуммаОстаток, 0) КАК НачисленныеПроцентыПоРЕПО,
		|	НалоговыйУчетОстатки.Субконто1 КАК СделкаРЕПО
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Остатки(
		|			&ВечерВчерашнегоДня,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоКраткосрочнымКредитам)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.СделкаРЕПО),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НалоговыйУчетОстатки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВечерВчерашнегоДня", НачалоДня(ЭтотОбъект.Дата)-1);//считаем что "включая" дложно сработать. Проценты начисляются со дня след. за днем исполнения первой части
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидУчета));
	
	НачисленныеПроцентыПоРЕПО = Запрос.Выполнить().Выгрузить();
	
	
	Для Каждого СтрокаРЕПО ИЗ СуммыЗаймовПоПериодам Цикл

		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаРЕПО.Основание, "Ссылка, СчетДоверительногоУправления, Дата, Брокер, Контрагент, РежимБиржевыхТоргов");
		КонтрагентПоСделке = БухгалтерскийУчет.ОпределитьКонтрагентаПоСделкеРЕПО(Реквизиты, НастройкиУчета);
		
		СрокаПроцентов = НачисленныеПроцентыПоРЕПО.Найти(СтрокаРЕПО.Основание,"СделкаРЕПО");
		Если СрокаПроцентов = Неопределено Тогда
			СуммаНачисленныхПроцентов = 0;
			СуммаНачисленныхПроцентовВВалютаУчета = 0;
		Иначе
			СуммаНачисленныхПроцентов = СрокаПроцентов.НачисленныеПроцентыПоРЕПО;
			СуммаНачисленныхПроцентовВВалютаУчета = СрокаПроцентов.НачисленныеПроцентыПоРЕПОВВалютеУчета;
		КонецЕсли;
		
		СчетПереоценкиРасчетовПоРЕПО = ?(СтрокаРЕПО.ЭтоПрямоеРЕПО, ПланыСчетов.Основной.ПроцентыПоКраткосрочнымКредитам, ПланыСчетов.Основной.НалоговыеНачисленияПоРЕПО); 
		АналитикаПроцентов = ?(СтрокаРЕПО.ЭтоПрямоеРЕПО, АналитикаПроцентовПрямогоРЕПО, АналитикаПроцентовОбратногоРЕПО); 
		АналитикаПерекурсовки = ?(СтрокаРЕПО.ЭтоПрямоеРЕПО, АналитикаПерекурсовкиПрямогоРЕПО, АналитикаПерекурсовкиОбратногоРЕПО); 
		
		Если СтрокаРЕПО.ЭтоПервоначальноеПризнание ТОгда
			Если СтрокаРЕПО.ЭтоПрямоеРЕПО И ВыделятьАналитикуПервоначальногоПризнанияПрямогоРЕПО Тогда
				АналитикаПроцентов = АналитикаПервоначальногоПризнанияПрямогоРЕПО;
			ИначеЕсли НЕ СтрокаРЕПО.ЭтоПрямоеРЕПО И ВыделятьАналитикуПервоначальногоПризнанияОбратногоРЕПО Тогда
				АналитикаПроцентов = АналитикаПервоначальногоПризнанияОбратногоРЕПО;	
			КонецЕсли;
		КонецЕсли;
		
		// Перекурсовка Процентов
		СуммаПроцентовПоТекущемуКурсу = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
			СуммаНачисленныхПроцентов,
			СтрокаРЕПО.ВалютаСделки,
			ЭтотОбъект.Организация,
			ЭтотОбъект.Дата);
		
		КурсоваяРазницаПроценты = СуммаПроцентовПоТекущемуКурсу - СуммаНачисленныхПроцентовВВалютаУчета;
		               
		Если КурсоваяРазницаПроценты > 0 Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], КурсоваяРазницаПроценты, "Курсовая разница");
			
			Проводка.СчетДт = СчетПереоценкиРасчетовПоРЕПО;
			Проводка.СубконтоДт.Контрагенты = КонтрагентПоСделке;
			Проводка.СубконтоДт.СделкаРЕПО = СтрокаРЕПО.Основание;
			
			Проводка.ВалютаДт = СтрокаРЕПО.ВалютаСделки;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПерекурсовки;
			
		ИначеЕсли КурсоваяРазницаПроценты > 0 Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -КурсоваяРазницаПроценты, "Курсовая разница");
			
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы =  АналитикаПерекурсовки;
			
			Проводка.СчетКт = СчетПереоценкиРасчетовПоРЕПО;
			Проводка.СубконтоКт.Контрагенты = КонтрагентПоСделке;
			Проводка.СубконтоКт.СделкаРЕПО = СтрокаРЕПО.Основание;
			
			Проводка.ВалютаКт = СтрокаРЕПО.ВалютаСделки;
			
		КонецЕсли;
		
		
		ПроцентыПоРЕПО = СтрокаРЕПО.СуммаПроцентов - СуммаНачисленныхПроцентов;
			
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
			ПроцентыПоРЕПО,
			СтрокаРЕПО.ВалютаСделки,
			ЭтотОбъект.Организация,
			ЭтотОбъект.Дата);
		
		ЦеннаяБумага = СтрокаРЕПО.Основание.ЦенныеБумаги[0].ЦеннаяБумага;
		
		СведенияОбОбращенииЦенныхБумагНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ(
			ЭтотОбъект.Дата,
			СтрокаРЕПО.Основание, 
			УчетныйРегистр);
		
		ОбращаетсяНаОРЦБ = СведенияОбОбращенииЦенныхБумагНаОРЦБ.Найти(ЦеннаяБумага, "ЦеннаяБумага").ОбращаетсяНаОРЦБ;
		
		Если ПроцентыПоРЕПО > 0 Тогда
				
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], СуммаОперации, "% по РЕПО");
			
			// дебет
			Проводка.СчетДт = СчетПереоценкиРасчетовПоРЕПО;
			Проводка.СубконтоДт.Контрагенты = КонтрагентПоСделке;
			Проводка.СубконтоДт.СделкаРЕПО = СтрокаРЕПО.Основание;
			
			Проводка.ВалютаДт = СтрокаРЕПО.ВалютаСделки;
			Проводка.ВалютнаяСуммаДт = ПроцентыПоРЕПО;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПроцентов;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.СубконтоКт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
			
		ИначеЕсли ПроцентыПоРЕПО < 0 Тогда
				
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -СуммаОперации, "% по РЕПО");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПроцентов;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
			
			// кредит
			Проводка.СчетКт = СчетПереоценкиРасчетовПоРЕПО;
			Проводка.СубконтоКт.Контрагенты = КонтрагентПоСделке;
			Проводка.СубконтоКт.СделкаРЕПО = СтрокаРЕПО.Основание;
			
			Проводка.ВалютаКт = СтрокаРЕПО.ВалютаСделки;
			Проводка.ВалютнаяСуммаКт = -ПроцентыПоРЕПО;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура БУНУ_ПризнатьКомиссиюПоРЕПО(Движения, СуммаОперации, СделкаРЕПО, ЦеннаяБумага, СведенияОбОбращенииЦенныхБумагНаОРЦБ, КонтрагентПоКомиссии, ВидКомиссии, НастройкиКомиссии, МетодПризнанияРасходовПоСделкамРЕПО, ВозвращаемыеПроводки = Неопределено)
	
	// СуммаКомиссии, ВалютаСделки - не используются т.к. невалютные счета

	Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоТорговойКомиссии Тогда
	
		ОписаниеПроводкиНачисления = "Начисление торговой комиссия";
		
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии Тогда
		
		ОписаниеПроводкиНачисления = "Начисление брокерской комиссия";
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	НастройкаКомиссии = НастройкиКомиссии.Найти(ВидКомиссии, "ВидЗадолженности");
	
	
	// ПРИЗНАНИЕ КОМИССИИ
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, СуммаОперации, ОписаниеПроводкиНачисления);
	
	// дебет
	Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
	
	Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкаКомиссии.АналитикаРЕПО;
	Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
	Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = СведенияОбОбращенииЦенныхБумагНаОРЦБ.Найти(ЦеннаяБумага, "ЦеннаяБумага").ОбращаетсяНаОРЦБ;
	
	// кредит
	Если МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичностиСОтражениемНаСчетеРасчетов Тогда
		// если настройка "...НаСчетеРасчетов" то и отражаем на счете РасчетыПоКомиссии
		Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоКомиссии;
	Иначе
		// на счете учета комиссии
		Проводка.СчетКт = НастройкаКомиссии.СчетУчета;
	КонецЕсли;
	
	Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
	Проводка.СубконтоКт.Сделка = СделкаРЕПО;
	
	//Проводка.ВалютаКт = ВалютаСделки;
	//Проводка.ВалютнаяСуммаКт = СуммаКомиссии;
	
	Если ВозвращаемыеПроводки <> Неопределено Тогда
		ВозвращаемыеПроводки.Добавить(Проводка);
	КонецЕсли;
	
КонецПроцедуры

Процедура БУНУ_ПереоценитьКомиссиюПоРЕПО(МетодПризнанияРасходовПоСделкамРЕПО, УчетныйРегистр)

	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтотОбъект.СчетДоверительногоУправления, Неопределено, Неопределено);
	
	Отказ = Ложь;
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, Отказ);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют настройки у %1 по виду учета %2 на %3!", ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, ЭтотОбъект.Дата));
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Дата < '20231231' Тогда
	    ЕПС_УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО = Истина;
	ИначеЕсли БухгалтерскийУчет.ВедетсяУчетЕПС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления) Тогда
		ЕПС_УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
			ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, "УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО");
	Иначе
		ЕПС_УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО = Ложь;
	КонецЕсли;
	
	Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
	
		ТЗПогрешности = Новый ТаблицаЗначений;
		
		ТЗПогрешности.Колонки.Добавить("СделкаРЕПО", Новый ОписаниеТипов("ДокументСсылка.СделкаРЕПО"));
		ТЗПогрешности.Колонки.Добавить("Погрешность", Новый ОписаниеТипов("Число"));
		ТЗПогрешности.Колонки.Добавить("ПогрешностьВВалютеУчета", Новый ОписаниеТипов("Число"));
		ТЗПогрешности.Колонки.Добавить("Проводки");
		
	КонецЕсли;
	
	// ------------
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаКомиссииСрезПоследних.ВидЗадолженности КАК ВидЗадолженности,
		|	НастройкиУчетаКомиссииСрезПоследних.СчетУчета КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаКомиссииСрезПоследних.АналитикаРЕПО = ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|			ТОГДА НастройкиУчетаКомиссииСрезПоследних.Аналитика
		|		ИНАЧЕ НастройкиУчетаКомиссииСрезПоследних.АналитикаРЕПО
		|	КОНЕЦ КАК АналитикаРЕПО
		|ИЗ
		|	РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))) КАК НастройкиУчетаКомиссииСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	НастройкиКомиссии = Запрос.Выполнить().Выгрузить();
	
	
	// ------------
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ПериодДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ПериодДата";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("ПериодДата", КонецДня(ЭтотОбъект.Дата));
	
	СведенияОбОбращенииЦенныхБумагНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦенныхБумагНаОРЦБ(ЭтотОбъект.Дата, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦеннаяБумага"), УчетныйРегистр);
	
	
	Если МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичностиСОтражениемНаСчетеРасчетов Тогда
		//для данного метода предполагается, что комиссии брокера и биржи не отличаются и считать их будем вместе
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасходыПоКомиссии.СуммаОборот КАК КомиссияПоРЕПО,
			|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО,
			|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК СделкаРЕПОДата,
			|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
			|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ) КАК ВсегоДней,
			|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, &ДатаПереоценки, ДЕНЬ) КАК ДнейПрошло,
			|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага
			|ПОМЕСТИТЬ СделкиРЕПОПроценты
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&ПериодДата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В (&СписокСтратегий)
			|				И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
			|				,
			|				&ПериодДата,
			|				Период,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В (&СписокСтратегий)
			|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК РасходыПоКомиссии
			|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = РасходыПоКомиссии.Сделка
			|			И УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага = РасходыПоКомиссии.ЦеннаяБумага
			|ГДЕ
			|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ПериодДата
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	РасходыПоКомиссии.СуммаОборот,
			|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО,
			|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата,
			|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО,
			|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ),
			|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, &ДатаПереоценки, ДЕНЬ),
			|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&ПериодДата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В (&СписокСтратегий)
			|				И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
			|				,
			|				&ПериодДата,
			|				Период,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления В (&СписокСтратегий)
			|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоКомиссии
			|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = РасходыПоКомиссии.Сделка
			|			И УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага = РасходыПоКомиссии.ЦеннаяБумага
			|ГДЕ
			|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ПериодДата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(СделкиРЕПОПроценты.КомиссияПоРЕПО) КАК КомиссияПоРЕПО,
			|	СделкиРЕПОПроценты.СделкаРЕПО КАК СделкаРЕПО,
			|	СделкиРЕПОПроценты.СделкаРЕПОДата КАК СделкаРЕПОДата,
			|	СделкиРЕПОПроценты.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
			|	СделкиРЕПОПроценты.ВсегоДней КАК ВсегоДней,
			|	СделкиРЕПОПроценты.ДнейПрошло КАК ДнейПрошло,
			|	СУММА(ВЫРАЗИТЬ(СделкиРЕПОПроценты.КомиссияПоРЕПО * СделкиРЕПОПроценты.ДнейПрошло / СделкиРЕПОПроценты.ВсегоДней КАК ЧИСЛО(19, 2))) КАК КомиссияЗаПериод,
			|	СделкиРЕПОПроценты.ЦеннаяБумага КАК ЦеннаяБумага
			|ПОМЕСТИТЬ _СделкиРЕПОКомиссия
			|ИЗ
			|	СделкиРЕПОПроценты КАК СделкиРЕПОПроценты
			|
			|СГРУППИРОВАТЬ ПО
			|	СделкиРЕПОПроценты.СделкаРЕПО,
			|	СделкиРЕПОПроценты.СделкаРЕПОДата,
			|	СделкиРЕПОПроценты.ДатаВторойЧастиРЕПО,
			|	СделкиРЕПОПроценты.ВсегоДней,
			|	СделкиРЕПОПроценты.ДнейПрошло,
			|	СделкиРЕПОПроценты.ЦеннаяБумага
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СделкиРЕПОКомиссия.СделкаРЕПО КАК СделкаРЕПО,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _СделкиРЕПОКомиссия.ЦеннаяБумага) КАК ЦеннаяБумага
			|ПОМЕСТИТЬ _ТаблицаОшибокЦБ
			|ИЗ
			|	_СделкиРЕПОКомиссия КАК _СделкиРЕПОКомиссия
			|
			|СГРУППИРОВАТЬ ПО
			|	_СделкиРЕПОКомиссия.СделкаРЕПО
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(_СделкиРЕПОКомиссия.ЦеннаяБумага) > 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СделкиРЕПОКомиссия.СделкаРЕПО КАК СделкаРЕПО,
			|	_СделкиРЕПОКомиссия.СделкаРЕПО.Брокер.ЮрФизЛицо КАК Контрагент,
			|	_СделкиРЕПОКомиссия.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
			|	_СделкиРЕПОКомиссия.СделкаРЕПО.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
			|	_СделкиРЕПОКомиссия.ВсегоДней КАК ВсегоДней,
			|	_СделкиРЕПОКомиссия.ДнейПрошло КАК ДнейПрошло,
			|	_СделкиРЕПОКомиссия.КомиссияПоРЕПО КАК КомиссияПоРЕПОВсего,
			|	ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстаток, 0) КАК КомиссияПоРЕПОНачислено,
			|	_СделкиРЕПОКомиссия.КомиссияЗаПериод - (_СделкиРЕПОКомиссия.КомиссияПоРЕПО - ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстаток, 0)) КАК НачислитьКомиссии,
			|	ЕСТЬNULL(СделкаРЕПОЦенныеБумаги.ЦеннаяБумага, ЗНАЧЕНИЕ(Справочник.Облигации.ПустаяССылка)) КАК ЦеннаяБумага
			|ИЗ
			|	_СделкиРЕПОКомиссия КАК _СделкиРЕПОКомиссия
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|				&Период,
			|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссии),
			|				&ВидыСубконто,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
			|		ПО _СделкиРЕПОКомиссия.СделкаРЕПО = БухгалтерскийУчетОстатки.Субконто1
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
			|		ПО _СделкиРЕПОКомиссия.СделкаРЕПО = СделкаРЕПОЦенныеБумаги.Ссылка
			|			И (СделкаРЕПОЦенныеБумаги.НомерСтроки = 1)";
		
		ВидыСубконто = Новый Массив;
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Сделка);
			
		Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("ПериодДата", КонецДня(ЭтотОбъект.Дата));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета));
		
		Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
		
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"СУММА(ВЫРАЗИТЬ(СделкиРЕПОПроценты.КомиссияПоРЕПО * СделкиРЕПОПроценты.ДнейПрошло / СделкиРЕПОПроценты.ВсегоДней КАК ЧИСЛО(19, 2))) КАК КомиссияЗаПериод",
				"ВЫРАЗИТЬ(СУММА(СделкиРЕПОПроценты.КомиссияПоРЕПО) * СделкиРЕПОПроценты.ДнейПрошло / СделкиРЕПОПроценты.ВсегоДней КАК ЧИСЛО(19, 2)) КАК КомиссияЗаПериод");
		
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		_ТаблицаОшибокЦБ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ТаблицаОшибокЦБ").ПолучитьДанные().Выгрузить();
		
		Если _ТаблицаОшибокЦБ.Количество() > 0 Тогда
			Для Каждого СтрокаОшибки Из _ТаблицаОшибокЦБ Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для сделки РЕПО %1 при расчете переоценки комиссии подобралось более 1 ценной бумаги!", СтрокаОшибки.СделкаРЕПО),,,,Отказ);
			КонецЦикла;	
			Возврат;
		КонецЕсли;	
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.НачислитьКомиссии > 0 Тогда
				
				СуммаКомиссии = ВыборкаДетальныеЗаписи.НачислитьКомиссии;
				
				// так уж сделано в СЧА и ЕПС (и у СД также!), что если в общей сумме брокерской и торговой комиссии количество копеек нечетное, то округляем в меньшую сторону
				Если ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего * ВыборкаДетальныеЗаписи.ДнейПрошло / ВыборкаДетальныеЗаписи.ВсегоДней - ВыборкаДетальныеЗаписи.НачислитьКомиссии = -0.005
					И ЭтотОбъект.Дата >= '20230430'
					И ЕПС_УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
					
					СуммаКомиссии = СуммаКомиссии - 0.01;
				
				КонецЕсли;
				
				СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
				
				ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				СделкаРЕПО = ВыборкаДетальныеЗаписи.СделкаРЕПО;
				
				БУНУ_ПризнатьКомиссиюПоРЕПО(
					ЭтотОбъект.Движения[УчетныйРегистр],
					СуммаОперации,
					СделкаРЕПО,
					ЦеннаяБумага,
					СведенияОбОбращенииЦенныхБумагНаОРЦБ,
					ВыборкаДетальныеЗаписи.Контрагент,
					Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
					НастройкиКомиссии,
					МетодПризнанияРасходовПоСделкамРЕПО);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	
	// торговая комиссия - "размазываем"
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходыПоКомиссии.СуммаОборот КАК КомиссияПоРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК СделкаРЕПОДата,
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ) КАК ВсегоДней,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, &ДатаПереоценки, ДЕНЬ) КАК ДнейПрошло,
		|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ СделкиРЕПОПроценты
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ПериодДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&ПериодДата,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК РасходыПоКомиссии
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = РасходыПоКомиссии.Сделка
		|			И УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага = РасходыПоКомиссии.ЦеннаяБумага
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ПериодДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРЕПОПроценты.СделкаРЕПО КАК СделкаРЕПО,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СделкиРЕПОПроценты.ЦеннаяБумага) КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ТаблицаОшибокЦБ
		|ИЗ
		|	СделкиРЕПОПроценты КАК СделкиРЕПОПроценты
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкиРЕПОПроценты.СделкаРЕПО
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(СделкиРЕПОПроценты.ЦеннаяБумага) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРЕПОПроценты.СделкаРЕПО КАК СделкаРЕПО,
		|	СделкиРЕПОПроценты.СделкаРЕПО.Брокер.ЮрФизЛицо КАК Контрагент,
		|	СделкиРЕПОПроценты.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	СделкиРЕПОПроценты.СделкаРЕПО.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
		|	СделкиРЕПОПроценты.ВсегоДней КАК ВсегоДней,
		|	СделкиРЕПОПроценты.ДнейПрошло КАК ДнейПрошло,
		|	СделкиРЕПОПроценты.КомиссияПоРЕПО КАК КомиссияПоРЕПОВсего,
		|	ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстаток, 0) КАК КомиссияПоРЕПОНачислено,
		|	(ВЫРАЗИТЬ(СделкиРЕПОПроценты.КомиссияПоРЕПО * СделкиРЕПОПроценты.ДнейПрошло / СделкиРЕПОПроценты.ВсегоДней КАК ЧИСЛО(19, 2))) - (СделкиРЕПОПроценты.КомиссияПоРЕПО - ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстаток, 0)) КАК НачислитьКомиссии,
		|	ЕСТЬNULL(СделкаРЕПОЦенныеБумаги.ЦеннаяБумага, ЗНАЧЕНИЕ(Справочник.Облигации.ПустаяСсылка)) КАК ЦеннаяБумага
		|ИЗ
		|	СделкиРЕПОПроценты КАК СделкиРЕПОПроценты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссии),
		|				&ВидыСубконто,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ПО СделкиРЕПОПроценты.СделкаРЕПО = БухгалтерскийУчетОстатки.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|		ПО СделкиРЕПОПроценты.СделкаРЕПО = СделкаРЕПОЦенныеБумаги.Ссылка
		|			И (СделкаРЕПОЦенныеБумаги.НомерСтроки = 1)";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Сделка);
		
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ПериодДата", КонецДня(ЭтотОбъект.Дата));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	_ТаблицаОшибокЦБ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ТаблицаОшибокЦБ").ПолучитьДанные().Выгрузить();
	
	Если _ТаблицаОшибокЦБ.Количество() > 0 Тогда
		Для Каждого СтрокаОшибки Из _ТаблицаОшибокЦБ Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для сделки РЕПО %1 при расчете переоценки комиссии подобралось более 1 ценной бумаги!", СтрокаОшибки.СделкаРЕПО),,,,Отказ);
		КонецЦикла;	
		Возврат;
	КонецЕсли;	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.НачислитьКомиссии > 0 Тогда
			
			СуммаКомиссии = ВыборкаДетальныеЗаписи.НачислитьКомиссии;
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			СделкаРЕПО = ВыборкаДетальныеЗаписи.СделкаРЕПО;
			
			ПроводкиТорговойКомиссии = Новый Массив;
			
			БУНУ_ПризнатьКомиссиюПоРЕПО(
				ЭтотОбъект.Движения[УчетныйРегистр],
				СуммаОперации,
				СделкаРЕПО,
				ЦеннаяБумага,
				СведенияОбОбращенииЦенныхБумагНаОРЦБ,
				ВыборкаДетальныеЗаписи.Контрагент,
				Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
				НастройкиКомиссии,
				МетодПризнанияРасходовПоСделкамРЕПО,
				ПроводкиТорговойКомиссии);
				
				
			Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
				
				Погрешность = ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего * ВыборкаДетальныеЗаписи.ДнейПрошло / ВыборкаДетальныеЗаписи.ВсегоДней
								- (ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего - ВыборкаДетальныеЗаписи.КомиссияПоРЕПОНачислено)
								- ВыборкаДетальныеЗаписи.НачислитьКомиссии;
								
				ПогрешностьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Погрешность, ВыборкаДетальныеЗаписи.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);								
				
				СтрокиПогрешности = ТЗПогрешности.НайтиСтроки(Новый Структура("СделкаРЕПО", СделкаРЕПО));
				Если СтрокиПогрешности.Количество() = 0 Тогда
					СтрокаПогрешности = ТЗПогрешности.Добавить();
					СтрокаПогрешности.СделкаРЕПО = СделкаРЕПО;
					СтрокаПогрешности.Проводки = ПроводкиТорговойКомиссии;
				Иначе
					СтрокаПогрешности = СтрокиПогрешности[0];
				КонецЕсли;
				
				СтрокаПогрешности.Погрешность = СтрокаПогрешности.Погрешность + Погрешность;
				СтрокаПогрешности.ПогрешностьВВалютеУчета = СтрокаПогрешности.ПогрешностьВВалютеУчета + ПогрешностьВВалютеУчета;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Комиссия брокера
	
	// Итак, тут сделано проведение по "правильной" схеме, до 1.1.18 все проведене было не очень правильно (мягко говоря).
	// По большинству клиентов 18й год проводили, но были и такие по которым только с февраля провели
	// К сожалению эта периодичность тут не зашита
	// Проведение этого документа ранее 1.1.18 меняет проводки, и Таня К.(и остальные бухгалтера) в курсе
	// 
	// С 1го марта 18го схема опять изменилась, но это уже тут учитывается
	//
	
	// ГПБ ведет себя аналогично бирже - начисляет комиссию 1 раз и сразу поэтому ее тоже размазываем
	//
	// БК до 1.3.18 ведет себя "плохо" (и это реализовано в следующем блоке)
	// но с 1.3.18 начинает вести себя "хорошо", как ГПБ
	// 
	// как оказалось в трасте по НГ ПР и Традиции ПР на новую схему перешли только с 1го апреля...
	//
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РасходыПоКомиссии.СуммаОборот, 0) КАК КомиссияПоРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК СделкаРЕПОДата,
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ) КАК ВсегоДней,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, &ДатаПереоценки, ДЕНЬ) КАК ДнейПрошло,
		|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ СделкиРЕПОПроценты
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ПериодДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И ЧастьСделкиРЕПО = 1
		|				И СделкаРЕПО.Брокер = &БрокерГПБ) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&ПериодДата,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В (&СписокСтратегий)
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоКомиссии
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = РасходыПоКомиссии.Сделка
		|			И УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага = РасходыПоКомиссии.ЦеннаяБумага
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &ПериодДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРЕПОПроценты.СделкаРЕПО КАК СделкаРЕПО,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СделкиРЕПОПроценты.ЦеннаяБумага) КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ТаблицаОшибокЦБ
		|ИЗ
		|	СделкиРЕПОПроценты КАК СделкиРЕПОПроценты
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкиРЕПОПроценты.СделкаРЕПО
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(СделкиРЕПОПроценты.ЦеннаяБумага) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРЕПОПроценты.СделкаРЕПО КАК СделкаРЕПО,
		|	СделкиРЕПОПроценты.СделкаРЕПО.Брокер.ЮрФизЛицо КАК Контрагент,
		|	СделкиРЕПОПроценты.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	СделкиРЕПОПроценты.СделкаРЕПО.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
		|	СделкиРЕПОПроценты.ВсегоДней КАК ВсегоДней,
		|	СделкиРЕПОПроценты.ДнейПрошло КАК ДнейПрошло,
		|	СделкиРЕПОПроценты.КомиссияПоРЕПО КАК КомиссияПоРЕПОВсего,
		|	ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстаток, 0) КАК КомиссияПоРЕПОНачислено,
		|	(ВЫРАЗИТЬ(СделкиРЕПОПроценты.КомиссияПоРЕПО * СделкиРЕПОПроценты.ДнейПрошло / СделкиРЕПОПроценты.ВсегоДней КАК ЧИСЛО(19, 2))) - (СделкиРЕПОПроценты.КомиссияПоРЕПО - ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстаток, 0)) КАК НачислитьКомиссии,
		|	СделкиРЕПОПроценты.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	СделкиРЕПОПроценты КАК СделкиРЕПОПроценты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссииБрокера),
		|				&ВидыСубконто,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ПО СделкиРЕПОПроценты.СделкаРЕПО = БухгалтерскийУчетОстатки.Субконто1";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Сделка);
	
	Если ЭтотОбъект.Дата < '20180301' Тогда // до 1.3.18 только ГПБ
		Запрос.УстановитьПараметр("БрокерГПБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ"));
	ИначеЕсли (ЭтотОбъект.Дата < '20180402')
		И (СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_PR_RN_001"
			ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_UL_PR_24"
			ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_NPF037") Тогда // до 27.3.18 траст нг пр и традиция пр по-старому
		Запрос.УстановитьПараметр("БрокерГПБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ"));
	Иначе // с 1.3.18 берем всех брокеров (и ГПБ и БК)
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СделкаРЕПО.Брокер = &БрокерГПБ", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ПериодДата", КонецДня(ЭтотОбъект.Дата));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	_ТаблицаОшибокЦБ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ТаблицаОшибокЦБ").ПолучитьДанные().Выгрузить();
	
	Если _ТаблицаОшибокЦБ.Количество() > 0 Тогда
		Для Каждого СтрокаОшибки Из _ТаблицаОшибокЦБ Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для сделки РЕПО %1 при расчете переоценки комиссии подобралось более 1 ценной бумаги!", СтрокаОшибки.СделкаРЕПО),,,,Отказ);
		КонецЦикла;	
		Возврат;
	КонецЕсли;	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.НачислитьКомиссии > 0 Тогда
			
			СуммаКомиссии = ВыборкаДетальныеЗаписи.НачислитьКомиссии;
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			СделкаРЕПО = ВыборкаДетальныеЗаписи.СделкаРЕПО;
			
			БУНУ_ПризнатьКомиссиюПоРЕПО(
				ЭтотОбъект.Движения[УчетныйРегистр],
				СуммаОперации,
				СделкаРЕПО,
				ЦеннаяБумага,
				СведенияОбОбращенииЦенныхБумагНаОРЦБ,
				ВыборкаДетальныеЗаписи.Контрагент,
				Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии,
				НастройкиКомиссии,
				МетодПризнанияРасходовПоСделкамРЕПО);
			
			Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
				
				Погрешность = ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего * ВыборкаДетальныеЗаписи.ДнейПрошло / ВыборкаДетальныеЗаписи.ВсегоДней
								- (ВыборкаДетальныеЗаписи.КомиссияПоРЕПОВсего - ВыборкаДетальныеЗаписи.КомиссияПоРЕПОНачислено)
								- ВыборкаДетальныеЗаписи.НачислитьКомиссии;
								
				ПогрешностьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Погрешность, ВыборкаДетальныеЗаписи.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);								
				
				СтрокиПогрешности = ТЗПогрешности.НайтиСтроки(Новый Структура("СделкаРЕПО", СделкаРЕПО));
				Если СтрокиПогрешности.Количество() = 0 Тогда
					СтрокаПогрешности = ТЗПогрешности.Добавить();
					СтрокаПогрешности.СделкаРЕПО = СделкаРЕПО;
				Иначе
					СтрокаПогрешности = СтрокиПогрешности[0];
				КонецЕсли;
				
				СтрокаПогрешности.Погрешность = СтрокаПогрешности.Погрешность + Погрешность;
				СтрокаПогрешности.ПогрешностьВВалютеУчета = СтрокаПогрешности.ПогрешностьВВалютеУчета + ПогрешностьВВалютеУчета;
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкиПоВидуУчета.УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО Тогда
	
		Для каждого СтрокаТЗПогрешности Из ТЗПогрешности Цикл
			
			СтрокаТЗПогрешности.Погрешность = Окр(СтрокаТЗПогрешности.Погрешность, 2);
			СтрокаТЗПогрешности.ПогрешностьВВалютеУчета = Окр(СтрокаТЗПогрешности.ПогрешностьВВалютеУчета, 2);
			
			Если СтрокаТЗПогрешности.ПогрешностьВВалютеУчета >= 0.01 ИЛИ СтрокаТЗПогрешности.ПогрешностьВВалютеУчета <= -0.01 Тогда
			
				МассивПроводок = СтрокаТЗПогрешности.Проводки;
				
				Для каждого Проводка Из МассивПроводок Цикл
				
					Проводка.Сумма = Проводка.Сумма + СтрокаТЗПогрешности.ПогрешностьВВалютеУчета;
					
				КонецЦикла;
			
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	// А ТЕПЕРЬ ОБРАБОТАЕМ БРОКЕРСКУЮ КОМИССИЮ ПО БК
	//
	// до 1.3.18 все шло по извращенной схеме
	// с 1.3.18 все идет по "правильной" схеме и обработано выше
	
	Если ЭтотОбъект.Дата < '20180301' // до 1го марта все по бкшной схеме
		ИЛИ (ЭтотОбъект.Дата < '20180402' // до 2го апреля нг пр и традиции тоже
			И ((СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_PR_RN_001"
				ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_UL_PR_24"
				ИЛИ СокрЛП(ЭтотОбъект.СчетДоверительногоУправления.КодСчета) = "DU_NPF037"))) Тогда
	
		// ТО ЕЩЕ ИЗВРАЩЕНИЕ
		
		// теущий день тоже считаем, поэтому -2 и -3
		ПредыдущийРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Константы.ОсновнойКалендарьКотировок.Получить(),НачалоДня(ЭтотОбъект.Дата), -2);
		ПредПредыдущийРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Константы.ОсновнойКалендарьКотировок.Получить(),НачалоДня(ЭтотОбъект.Дата), -3);
		
		Если НачалоДня(ПредПредыдущийРабочийДень) <> (НачалоДня(ЭтотОбъект.Дата) - 86400 - 86400) Тогда
		    //если предпредыдущий день нерабочий - берем 1/3 оплаченого за предыдущий
			НачалоПериода = НачалоДня(ЭтотОбъект.Дата) - 86400;
			КонецПериода = КонецДня(ЭтотОбъект.Дата) - 86400;
			
			Коэффициент = 3;
		ИначеЕсли НачалоДня(ПредыдущийРабочийДень) <> (НачалоДня(ЭтотОбъект.Дата) - 86400) Тогда
		    //если предыдущий день нерабочий - берем 2/3 оплаченного за сегодня
			НачалоПериода = НачалоДня(ЭтотОбъект.Дата);
			КонецПериода = КонецДня(ЭтотОбъект.Дата);
			
			Коэффициент = 2;
		Иначе
		    //берем, что было оплачено вчера
			НачалоПериода = НачалоДня(ЭтотОбъект.Дата) - 86400;
			КонецПериода = КонецДня(ЭтотОбъект.Дата) - 86400;
			
			Коэффициент = 1;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасходыПоСделке.СуммаОборот КАК Комиссия,
			|	РасходыПоСделке.Сделка КАК СделкаРЕПО,
			|	ВЫРАЗИТЬ(РасходыПоСделке.Сделка КАК Документ.СделкаРЕПО).Брокер.ЮрФизЛицо КАК Контрагент,
			|	ВЫРАЗИТЬ(РасходыПоСделке.Сделка КАК Документ.СделкаРЕПО).ВалютаСделки КАК ВалютаСделки,
			|	ВЫРАЗИТЬ(РасходыПоСделке.Сделка КАК Документ.СделкаРЕПО).ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
			|	РасходыПоСделке.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫРАЗИТЬ(РасходыПоСделке.Сделка КАК Документ.СделкаРЕПО).Дата КАК СделкаДата
			|ИЗ
			|	РегистрНакопления.РасходыПоСделке.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В (&СписокСтратегий)
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|				И Сделка ССЫЛКА Документ.СделкаРЕПО
			|				И ВЫРАЗИТЬ(Сделка КАК Документ.СделкаРЕПО).Брокер = &БрокерБК
			|				И ВЫРАЗИТЬ(Сделка КАК Документ.СделкаРЕПО).ДатаВторойЧастиРЕПО > &КонецДня) КАК РасходыПоСделке";
		
		Запрос.УстановитьПараметр("БрокерБК", ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион"));
		Запрос.УстановитьПараметр("КонецДня", КонецДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ЭтотОбъект.СчетДоверительногоУправления));
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Комиссия > 0 Тогда
				
				СуммаКомиссии = ВыборкаДетальныеЗаписи.Комиссия;
				
				Если Коэффициент = 2 Тогда
					СуммаКомиссии = Окр(СуммаКомиссии / 3 * 2, 2);
				ИначеЕсли (Коэффициент = 3) И (НачалоДня(ВыборкаДетальныеЗаписи.СделкаДата) < НачалоПериода) Тогда
					СуммаКомиссии = СуммаКомиссии - Окр(СуммаКомиссии / 3 * 2, 2);
				КонецЕсли;
				
				СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
				
				ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				СделкаРЕПО = ВыборкаДетальныеЗаписи.СделкаРЕПО;
				
				БУНУ_ПризнатьКомиссиюПоРЕПО(
					ЭтотОбъект.Движения[УчетныйРегистр],
					СуммаОперации,
					СделкаРЕПО,
					ЦеннаяБумага,
					СведенияОбОбращенииЦенныхБумагНаОРЦБ,
					ВыборкаДетальныеЗаписи.Контрагент,
					Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии,
					НастройкиКомиссии,
					МетодПризнанияРасходовПоСделкамРЕПО);
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

Процедура БУНУ_ПереоценитьЗадолженность(Отказ)
	
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ЭтотОбъект.ВидУчета);
	
	НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления, 
		ЦельРасчета);
		
	ВариантРасчетаОценочнойСтоимости = НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости;		
	
	Параметры = Новый Структура;
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("Период", ЭтотОбъект.Дата);
	Параметры.Вставить("ВариантРасчетаОценочнойСтоимости", ВариантРасчетаОценочнойСтоимости);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("ЦельРасчета", ЦельРасчета);
	
	ЗадолженностиКОбесценениюИДисконтированию = РаботаСоСтоимостьюПоРыночнойСтавке.РассчитатьСправедливыеСтоимостиЗадолженностей(
		Параметры, 
		Неопределено,
		Отказ);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ЗадолженностиКОбесценениюИДисконтированию, 
		"_ЗадолженностиКОбесценениюИДисконтированию", 
		Запрос.МенеджерВременныхТаблиц,,
		"ВидЗадолженности, ОснованиеЗадолженности, ТипЗадолженности, Контрагент, ПроцентыЭСП, СуммаРезерва");
		
	//Переоценку по счету 76.ПЗ.5 пока ведут вручную (задача #308260, комментарий от 18.10.2022) 
	// #572237 убрал фильтр по счету 76.ПЗ.5. Учитываем обесценение дебиторки  
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Счет КАК Счет,
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|	БухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _БухУчетОстатки
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&ДатаПереоценки,
		|			Счет В ИЕРАРХИИ (&Счет76ПЗ),
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.СделкаСНедвижимостью)
		|						ТОГДА ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаСНедвижимостью).ВидПраваНаНедвижимость <> ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.ДДУ)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БухУчетОстатки.Счет КАК СчетБухОстатки,
		|	_БухУчетОстатки.Субконто1 КАК Контрагент,
		|	_БухУчетОстатки.Субконто2 КАК ОснованиеРасчетов,
		|	_БухУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	НастройкиУчетаКомиссииСрезПоследних.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
		|	НастройкиУчетаКомиссииСрезПоследних.АналитикаПереоценки КАК АналитикаПереоценки
		|ИЗ
		|	_БухУчетОстатки КАК _БухУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = &ВидУчета
		|					И ВидЗадолженности В
		|						(ВЫБРАТЬ
		|							_ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности КАК ВидЗадолженности
		|						ИЗ
		|							_ЗадолженностиКОбесценениюИДисконтированию КАК _ЗадолженностиКОбесценениюИДисконтированию)) КАК НастройкиУчетаКомиссииСрезПоследних
		|		ПО _БухУчетОстатки.Счет = НастройкиУчетаКомиссииСрезПоследних.СчетУчетаПереоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ЗадолженностьПоДаннымБэкаВся.СуммаОстаток) КАК СуммаОстаток,
		|			ЗадолженностьПоДаннымБэкаВся.Основание КАК Основание,
		|			ЗадолженностьПоДаннымБэкаВся.ВидЗадолженности КАК ВидЗадолженности
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток,
		|				ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|				ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности
		|			ИЗ
		|				РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|						&ДатаПереоценки,
		|						Организация = &Организация
		|							И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|							И (ВидЗадолженности, Основание) В
		|								(ВЫБРАТЬ
		|									_ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности КАК ВидЗадолженности,
		|									_ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности КАК ОснованиеЗадолженности
		|								ИЗ
		|									_ЗадолженностиКОбесценениюИДисконтированию КАК _ЗадолженностиКОбесценениюИДисконтированию)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток,
		|				ЗадолженностиПоЦеннымБумагамОстатки.Основание,
		|				ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности
		|			ИЗ
		|				РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|						&ДатаПереоценки,
		|						Организация = &Организация
		|							И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|							И (ВидЗадолженности, Основание) В
		|								(ВЫБРАТЬ
		|									_ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности КАК ВидЗадолженности,
		|									_ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности КАК ОснованиеЗадолженности
		|								ИЗ
		|									_ЗадолженностиКОбесценениюИДисконтированию КАК _ЗадолженностиКОбесценениюИДисконтированию)) КАК ЗадолженностиПоЦеннымБумагамОстатки) КАК ЗадолженностьПоДаннымБэкаВся
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗадолженностьПоДаннымБэкаВся.Основание,
		|			ЗадолженностьПоДаннымБэкаВся.ВидЗадолженности) КАК ЗадолженностьПоДаннымБэка
		|		ПО _БухУчетОстатки.Субконто2 = ЗадолженностьПоДаннымБэка.Основание
		|			И (НастройкиУчетаКомиссииСрезПоследних.ВидЗадолженности = ЗадолженностьПоДаннымБэка.ВидЗадолженности)
		|ГДЕ
		|	ЗадолженностьПоДаннымБэка.СуммаОстаток = 0";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ДатаПереоценки", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Счет76ПЗ", ПланыСчетов.Основной.ПереоценкаЗадолженностей);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	
	ПроцентыПоЗайму_РПИ = Новый Массив;
	ПроцентыПоЗайму_РПИ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ПроцентыПоЗайму_РПИ_011024_5_1"));
	ПроцентыПоЗайму_РПИ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ПроцентыПоЗайму_РПИ_090125_5_1"));
	Запрос.УстановитьПараметр("ПроцентыПоЗаймуРПИ", ПроцентыПоЗайму_РПИ);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружены остатки переоценки задолженности по основанию " 
			+ ВыборкаДетальныеЗаписи.ОснованиеРасчетов + " на счете " + ВыборкаДетальныеЗаписи.СчетБухОстатки 
			+ ", при этом по данным бэк-офиса задолженность погашена полностью", ЭтотОбъект,,, Отказ);
	КонецЦикла;	
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности КАК ОснованиеЗадолженности,
		|	_ЗадолженностиКОбесценениюИДисконтированию.ТипЗадолженности КАК ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиКОбесценениюИДисконтированию.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|				И _ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|			ТОГДА Сделка.Контрагент
		|		ИНАЧЕ _ЗадолженностиКОбесценениюИДисконтированию.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	СУММА(_ЗадолженностиКОбесценениюИДисконтированию.ПроцентыЭСП) + СУММА(_ЗадолженностиКОбесценениюИДисконтированию.СуммаРезерва) КАК СуммаПереоценки,
		|	НастройкиУчетаКомиссииСрезПоследних.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиКОбесценениюИДисконтированию.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И _ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту)
		|				И ТИПЗНАЧЕНИЯ(_ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности) = ТИП(Справочник.Договоры)
		|			ТОГДА &АналитикаПереоценкиДебиторскойЗадолженности
		|		ИНАЧЕ ЕСТЬNULL(НастройкиУчетаПрочееСрезПоследних.АналитикаПереоценки, НастройкиУчетаКомиссииСрезПоследних.АналитикаПереоценки)
		|	КОНЕЦ КАК АналитикаПереоценки
		|ПОМЕСТИТЬ _ЗадолженностиСНастройками
		|ИЗ
		|	_ЗадолженностиКОбесценениюИДисконтированию КАК _ЗадолженностиКОбесценениюИДисконтированию
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности = Сделка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = &ВидУчета
		|					И ВидЗадолженности В
		|						(ВЫБРАТЬ
		|							_ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности КАК ВидЗадолженности
		|						ИЗ
		|							_ЗадолженностиКОбесценениюИДисконтированию КАК _ЗадолженностиКОбесценениюИДисконтированию)) КАК НастройкиУчетаКомиссииСрезПоследних
		|		ПО _ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности = НастройкиУчетаКомиссииСрезПоследних.ВидЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = &ВидУчета
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Прочее)) КАК НастройкиУчетаПрочееСрезПоследних
		|		ПО (ВЫРАЗИТЬ(_ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности КАК Документ.Оплата).ОбеспечительныйПлатеж)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности,
		|	_ЗадолженностиКОбесценениюИДисконтированию.ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиКОбесценениюИДисконтированию.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|				И _ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|			ТОГДА Сделка.Контрагент
		|		ИНАЧЕ _ЗадолженностиКОбесценениюИДисконтированию.Контрагент
		|	КОНЕЦ,
		|	НастройкиУчетаКомиссииСрезПоследних.СчетУчетаПереоценки,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиКОбесценениюИДисконтированию.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И _ЗадолженностиКОбесценениюИДисконтированию.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту)
		|				И ТИПЗНАЧЕНИЯ(_ЗадолженностиКОбесценениюИДисконтированию.ОснованиеЗадолженности) = ТИП(Справочник.Договоры)
		|			ТОГДА &АналитикаПереоценкиДебиторскойЗадолженности
		|		ИНАЧЕ ЕСТЬNULL(НастройкиУчетаПрочееСрезПоследних.АналитикаПереоценки, НастройкиУчетаКомиссииСрезПоследних.АналитикаПереоценки)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БухУчетОстатки.Счет КАК СчетБухОстатки,
		|	ЕСТЬNULL(_БухУчетОстатки.Субконто1, ЗадолженностиСНастройками.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) КАК ОснованиеРасчетов,
		|	ВЫБОР
		|		КОГДА ЗадолженностиСНастройками.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ * ЕСТЬNULL(_БухУчетОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ЗадолженностиСНастройками.СуммаПереоценки, 0) КАК СуммаПереоценки,
		|	ЗадолженностиСНастройками.ТипЗадолженности КАК ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА Оплата.ОбеспечительныйПлатеж
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаРасчетовСПокупателямиИЗаказчикамиОбеспечительныйПлатеж)
		|		ИНАЧЕ ЕСТЬNULL(ЗадолженностиСНастройками.СчетУчетаПереоценки, _БухУчетОстатки.Счет)
		|	КОНЕЦ КАК СчетУчетаПереоценки,
		|	ЕСТЬNULL(ЗадолженностиСНастройками.АналитикаПереоценки, ЕСТЬNULL(НастройкиУчетаПрочиеСрезПоследних.АналитикаПереоценки, НастройкиУчетаКомиссииСрезПоследних.АналитикаПереоценки)) КАК АналитикаПереоценки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|			ТОГДА ЗакрытиеКредитногоИнструмента.КредитныйИнструмент
		|		КОГДА ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) ССЫЛКА Документ.Сделка
		|			ТОГДА Сделка.Договор
		|		КОГДА ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) ССЫЛКА Документ.СделкаСНедвижимостью
		|			ТОГДА СделкаСНедвижимостью.Договор
		|		КОГДА ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) ССЫЛКА Документ.Оплата
		|			ТОГДА Оплата.Договор
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|	КОНЕЦ КАК Договор
		|ИЗ
		|	_БухУчетОстатки КАК _БухУчетОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ЗадолженностиСНастройками КАК ЗадолженностиСНастройками
		|		ПО _БухУчетОстатки.Субконто1 = ЗадолженностиСНастройками.Контрагент
		|			И (_БухУчетОстатки.Субконто2 = ВЫБОР
		|				КОГДА ЗадолженностиСНастройками.ОснованиеЗадолженности В (&ПроцентыПоЗаймуРПИ)
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ ЗадолженностиСНастройками.ОснованиеЗадолженности
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = &ВидУчета
		|					И СчетУчетаПереоценки В
		|						(ВЫБРАТЬ
		|							_БухУчетОстатки.Счет КАК Счет
		|						ИЗ
		|							_БухУчетОстатки КАК _БухУчетОстатки)) КАК НастройкиУчетаКомиссииСрезПоследних
		|		ПО _БухУчетОстатки.Счет = НастройкиУчетаКомиссииСрезПоследних.СчетУчетаПереоценки
		|			И (ЗадолженностиСНастройками.ТипЗадолженности ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО (ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) = Сделка.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|		ПО (ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) = СделкаСНедвижимостью.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеКредитногоИнструмента КАК ЗакрытиеКредитногоИнструмента
		|		ПО (ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) = ЗакрытиеКредитногоИнструмента.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|		ПО (ЕСТЬNULL(_БухУчетОстатки.Субконто2, ЗадолженностиСНастройками.ОснованиеЗадолженности) = Оплата.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = &ВидУчета
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Прочее)) КАК НастройкиУчетаПрочиеСрезПоследних
		|		ПО (Оплата.ОбеспечительныйПлатеж)
		|			И (ЗадолженностиСНастройками.ТипЗадолженности ЕСТЬ NULL)";
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("АналитикаПереоценкиДебиторскойЗадолженности", НастройкиУчета.АналитикаПереоценкиДебиторскойЗадолженности);		

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаПереоценки) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АналитикаПереоценки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для основания расчетов " + ВыборкаДетальныеЗаписи.ОснованиеРасчетов + " не удалось определить настройки переоценки",ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Переоценка = ВыборкаДетальныеЗаписи.СуммаПереоценки - ВыборкаДетальныеЗаписи.СуммаОстаток;
		
		//При обнулении переоценки тип задолженности не важен, т.к. доход/расход определится по остатку на бух.счете
		Если ВыборкаДетальныеЗаписи.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
			Переоценка = -1 * Переоценка;
		КонецЕсли;
		
		Если Переоценка > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Переоценка, "Переоценка задолженности");
			
			Проводка.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаПереоценки;
			Проводка.СубконтоДт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.ОснованиеРасчетов;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ВыборкаДетальныеЗаписи.АналитикаПереоценки;
			Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.Договор;
			
		ИначеЕсли Переоценка < 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -Переоценка, "Переоценка задолженности");
			
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ВыборкаДетальныеЗаписи.АналитикаПереоценки;
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.Договор;
			
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаПереоценки;
			Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.ОснованиеРасчетов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//техдолг:Ругаться, если нет остатков, а переоценка зависла
	
КонецПроцедуры

Процедура БУНУ_ПереоценкаДоходныхВложенийВМатериальныеЦенности(Отказ)
	
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ЭтотОбъект.ВидУчета);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчета КАК СчетУчета,
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
		|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки КАК АналитикаДоходовОтПереоценки
		|ПОМЕСТИТЬ _НастройкиУчета
		|ИЗ
		|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|			&ДатаПереоценки,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ВидУчета = &ВидУчета
		|				И УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ДоходныеВложенияВМатериальныеЦенности), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВложенияВоВнеоборотныеАктивы))) КАК НастройкиУчетаАктивовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Счет КАК Счет,
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _БухУчетОстатки
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&ДатаПереоценки,
		|			Счет В
		|				(ВЫБРАТЬ
		|					_НастройкиУчета.СчетУчета КАК СчетУчета
		|				ИЗ
		|					_НастройкиУчета КАК _НастройкиУчета
		|			
		|				ОБЪЕДИНИТЬ ВСЕ
		|			
		|				ВЫБРАТЬ
		|					_НастройкиУчета.СчетУчетаПереоценки
		|				ИЗ
		|					_НастройкиУчета КАК _НастройкиУчета),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БухУчетОстаткиАктив.Счет КАК СчетБухОстатки,
		|	_БухУчетОстаткиАктив.Субконто1 КАК ОбъектНедвижимости,
		|	_БухУчетОстаткиАктив.СуммаОстаток КАК СуммаСебестоимость,
		|	ЕСТЬNULL(_БухУчетОстаткиПереоценка.СуммаОстаток, 0) КАК СуммаПереоценка,
		|	_НастройкиУчета.СчетУчета КАК СчетУчета,
		|	_НастройкиУчета.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
		|	_НастройкиУчета.АналитикаДоходовОтПереоценки КАК АналитикаПереоценки,
		|	ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость КАК Стоимость,
		|	ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	_БухУчетОстатки КАК _БухУчетОстаткиАктив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиУчета КАК _НастройкиУчета
		|		ПО _БухУчетОстаткиАктив.Счет = _НастройкиУчета.СчетУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(&ДатаПереоценки, ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость)) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
		|		ПО _БухУчетОстаткиАктив.Субконто1 = ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БухУчетОстатки КАК _БухУчетОстаткиПереоценка
		|		ПО (_БухУчетОстаткиПереоценка.Счет = _НастройкиУчета.СчетУчетаПереоценки)
		|			И _БухУчетОстаткиАктив.Субконто1 = _БухУчетОстаткиПереоценка.Субконто1";
	
	Запрос.УстановитьПараметр("ДатаПереоценки", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаПереоценки) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АналитикаПереоценки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + ВыборкаДетальныеЗаписи.ОбъектНедвижимости + " не удалось определить настройки переоценки",ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Переоценка = ВыборкаДетальныеЗаписи.Стоимость - ВыборкаДетальныеЗаписи.СуммаСебестоимость - ВыборкаДетальныеЗаписи.СуммаПереоценка;
		
		Если Переоценка > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Переоценка, "Переоценка объекта недвижимости");
			
			Проводка.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаПереоценки;
			Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ВыборкаДетальныеЗаписи.АналитикаПереоценки;
			Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			
		ИначеЕсли Переоценка < 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -Переоценка, "Переоценка объекта недвижимости");
			
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ВыборкаДетальныеЗаписи.АналитикаПереоценки;
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаПереоценки;
			Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура БУНУ_ПереоценкаИмущественныхПрав(УчетныйАктив, Отказ)
	
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ЭтотОбъект.ВидУчета);
	
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.БухгалтерскийУчет);
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют настройки для указанной цели расчета!", ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Справочники.ОбъектыНедвижимости.ПоместитьОбъектыНедвижимостиДляСЧАВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, 
			ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, КонецДня(ЭтотОбъект.Дата), Отказ); 
			
	ВидПраваНаНедвижимость = Неопределено;
	Если УчетныйАктив = Справочники.УчетныеАктивы.Инвестконтракты Тогда
		ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт;
	ИначеЕсли УчетныйАктив = Справочники.УчетныеАктивы.ДДУ Тогда
		ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ;
	ИначеЕсли УчетныйАктив = Справочники.УчетныеАктивы.ПраваАренды Тогда
		ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда;
	КонецЕсли;
			
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчета КАК СчетУчета,
		|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
		|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки КАК АналитикаДоходовОтПереоценки
		|ПОМЕСТИТЬ _НастройкиУчета
		|ИЗ
		|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|			&ДатаПереоценки,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ВидУчета = &ВидУчета
		|				И УчетныйАктив = &УчетныйАктив) КАК НастройкиУчетаАктивовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Счет КАК Счет,
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|	БухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|	БухгалтерскийУчетОстатки.Субконто3 КАК Субконто3,
		|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _БухУчетОстатки
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&ДатаПереоценки,
		|			Счет В
		|				(ВЫБРАТЬ
		|					_НастройкиУчета.СчетУчета КАК СчетУчета
		|				ИЗ
		|					_НастройкиУчета КАК _НастройкиУчета
		|			
		|				ОБЪЕДИНИТЬ ВСЕ
		|			
		|				ВЫБРАТЬ
		|					_НастройкиУчета.СчетУчетаПереоценки
		|				ИЗ
		|					_НастройкиУчета КАК _НастройкиУчета),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО БухгалтерскийУчетОстатки.Субконто2 = Договоры.Ссылка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Инвестконтракты)
		|				ТОГДА Договоры.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СтроительствоНаСвоемУчастке), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СтроительствоНаЧужомУчастке))
		|			КОГДА &УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ПраваАренды)
		|				ТОГДА Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Аренды)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БухУчетОстаткиАктив.Счет КАК СчетБухОстатки,
		|	_БухУчетОстаткиАктив.Субконто1 КАК Контрагент,
		|	_БухУчетОстаткиАктив.Субконто2 КАК Договор,
		|	_БухУчетОстаткиАктив.Субконто3 КАК ОбъектНедвижимости,
		|	_БухУчетОстаткиАктив.СуммаОстаток КАК СуммаСебестоимость,
		|	ЕСТЬNULL(_БухУчетОстаткиПереоценка.СуммаОстаток, 0) КАК СуммаПереоценка,
		|	_НастройкиУчета.СчетУчета КАК СчетУчета,
		|	_НастройкиУчета.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
		|	_НастройкиУчета.АналитикаДоходовОтПереоценки КАК АналитикаПереоценки,
		|	ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость КАК Стоимость,
		|	ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	_БухУчетОстаткиАктив.Субконто3 ЕСТЬ NULL КАК НетДанныхБухУчета,
		|	_ОбъектыНедвижимости.ОбъектНедвижимости ЕСТЬ NULL КАК НетДанныхБэкОфиса,
		|	_ОбъектыНедвижимости.Основание КАК ОснованиеБэкОфис,
		|	_ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимостиБэкОфис
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ОбъектыНедвижимости.Основание КАК Основание,
		|		_ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|	ИЗ
		|		_ОбъектыНедвижимости КАК _ОбъектыНедвижимости
		|	ГДЕ
		|		_ОбъектыНедвижимости.ВидПраваНаНедвижимость = &ВидПраваНаНедвижимость) КАК _ОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостьюОснование
		|		ПО _ОбъектыНедвижимости.Основание = СделкаСНедвижимостьюОснование.Ссылка
		|		ПОЛНОЕ СОЕДИНЕНИЕ _БухУчетОстатки КАК _БухУчетОстаткиАктив
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = _БухУчетОстаткиАктив.Субконто3
		|			И (СделкаСНедвижимостьюОснование.Договор = _БухУчетОстаткиАктив.Субконто2)
		|			И (СделкаСНедвижимостьюОснование.Контрагент = _БухУчетОстаткиАктив.Субконто1)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиУчета КАК _НастройкиУчета
		|		ПО (_БухУчетОстаткиАктив.Счет = _НастройкиУчета.СчетУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БухУчетОстатки КАК _БухУчетОстаткиПереоценка
		|		ПО (_БухУчетОстаткиПереоценка.Счет = _НастройкиУчета.СчетУчетаПереоценки)
		|			И (_БухУчетОстаткиАктив.Субконто1 = _БухУчетОстаткиПереоценка.Субконто1)
		|			И (_БухУчетОстаткиАктив.Субконто2 = _БухУчетОстаткиПереоценка.Субконто2)
		|			И (_БухУчетОстаткиАктив.Субконто3 = _БухУчетОстаткиПереоценка.Субконто3)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(&ДатаПереоценки, ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ИмущественныеПрава), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ПраваАренды))) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
		|		ПО (_БухУчетОстаткиАктив.Субконто3 = ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики)";
	
	Запрос.УстановитьПараметр("ДатаПереоценки", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета", ЭтотОбъект.ВидУчета);
	Запрос.УстановитьПараметр("УчетныйАктив", УчетныйАктив);
	Запрос.УстановитьПараметр("ВидПраваНаНедвижимость", ВидПраваНаНедвижимость);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.НетДанныхБэкОфиса Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данным бэк-офиса объекта недвижимости " 
				+ ВыборкаДетальныеЗаписи.ОбъектНедвижимости + " по договору " + ВыборкаДетальныеЗаписи.Договор + " не числится ", ЭтотОбъект,,, Отказ);
		ИначеЕсли ВыборкаДетальныеЗаписи.НетДанныхБухУчета Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данным регистра " + ЭтотОбъект.ВидУчета
				+ " объекта недвижимости " + ВыборкаДетальныеЗаписи.ОбъектНедвижимостиБэкОфис + " по основанию "
				+ ВыборкаДетальныеЗаписи.ОснованиеБэкОфис + " не числится ", ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаПереоценки) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АналитикаПереоценки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для " + ВыборкаДетальныеЗаписи.ОбъектНедвижимости
				+ " не удалось определить настройки переоценки", ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Переоценка = ВыборкаДетальныеЗаписи.Стоимость - ВыборкаДетальныеЗаписи.СуммаСебестоимость - ВыборкаДетальныеЗаписи.СуммаПереоценка;
		
		Если Переоценка > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Переоценка, "Переоценка прав");
			
			Проводка.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаПереоценки;
			Проводка.СубконтоДт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
			Проводка.СубконтоДт.Договоры = ВыборкаДетальныеЗаписи.Договор;
			Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ВыборкаДетальныеЗаписи.АналитикаПереоценки;
			Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.Договор;
			
		ИначеЕсли Переоценка < 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -Переоценка, "Переоценка прав");
			
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ВыборкаДетальныеЗаписи.АналитикаПереоценки;
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.Договор;
			
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаПереоценки;
			Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
			Проводка.СубконтоКт.Договоры = ВыборкаДетальныеЗаписи.Договор;
			Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВидУчета,
		Отказ);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют настройки у %1 по виду учета %2 на %3!", ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, ЭтотОбъект.Дата));
		Возврат;
	КонецЕсли;
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);
	
	Движения[УчетныйРегистр].Записывать = Истина;
	Движения[УчетныйРегистр].Очистить();
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		
		ОбработкаПроведенияЕПС(Отказ, Режим);
		Возврат;
		
	КонецЕсли;		
	
	ПереоцениватьЗадолженностьДСПоСделкамТПлюс = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПереоцениватьЗадолженностьДСПоСделкамТПлюс", ПереоцениватьЗадолженностьДСПоСделкамТПлюс) Тогда
		ПереоцениватьЗадолженностьДСПоСделкамТПлюс = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.НужнаПереоценкаПоАктиву(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ЗадолженностьДСПоСделкамТПлюс, ВидУчета);
	КонецЕсли;
	Если ПереоцениватьЗадолженностьДСПоСделкамТПлюс Тогда
		БУНУ_ПереоценкаЗадолженностейПоСделкамТПлюс(Отказ, УчетныйРегистр);
	КонецЕсли;
	
	СтруктураПереоценки = Новый Структура("ПереоцениватьПрямоеРЕПО, ПереоцениватьОбратноеРЕПО, ТолькоПервоначальноеПризнаниеПрямогоРЕПО, ТолькоПервоначальноеПризнаниеОбратногоРЕПО", Ложь, Ложь, Ложь, Ложь);
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПереоцениватьРасчетыПоПрямомуРЕПО", СтруктураПереоценки.ПереоцениватьПрямоеРЕПО) Тогда
		СтруктураПереоценки.ПереоцениватьПрямоеРЕПО = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.НужнаПереоценкаПоАктиву(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.РасчетыПоПрямомуРЕПО, ВидУчета, СтруктураПереоценки.ТолькоПервоначальноеПризнаниеПрямогоРЕПО);
	Иначе
		ЭтотОбъект.ДополнительныеСвойства.Свойство("ТолькоПервоначальноеПризнаниеПрямогоРЕПО", СтруктураПереоценки.ТолькоПервоначальноеПризнаниеПрямогоРЕПО)		
	КонецЕсли;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПереоцениватьРасчетыПоОбратномуРЕПО", СтруктураПереоценки.ПереоцениватьОбратноеРЕПО) Тогда
		СтруктураПереоценки.ПереоцениватьОбратноеРЕПО = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.НужнаПереоценкаПоАктиву(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.РасчетыПоОбратномуРЕПО, ВидУчета, СтруктураПереоценки.ТолькоПервоначальноеПризнаниеОбратногоРЕПО);
	Иначе
		ЭтотОбъект.ДополнительныеСвойства.Свойство("ТолькоПервоначальноеПризнаниеОбратногоРЕПО", СтруктураПереоценки.ТолькоПервоначальноеПризнаниеОбратногоРЕПО);
	КонецЕсли;

	Если СтруктураПереоценки.ПереоцениватьПрямоеРЕПО ИЛИ СтруктураПереоценки.ПереоцениватьОбратноеРЕПО Тогда
		
		БУНУ_НачислитьПроцентыПоРЕПО(СтруктураПереоценки, Отказ);
		
		Если НастройкиПоВидуУчета.МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичности
			ИЛИ НастройкиПоВидуУчета.МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичностиСОтражениемНаСчетеРасчетов Тогда
		    БУНУ_ПереоценитьКомиссиюПоРЕПО(НастройкиПоВидуУчета.МетодПризнанияРасходовПоСделкамРЕПО, УчетныйРегистр);
		КонецЕсли;
	КонецЕсли;
	
	ПереоцениватьЗадолженности = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПереоцениватьЗадолженности", ПереоцениватьЗадолженности) Тогда
		ПереоцениватьЗадолженности = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.НужнаПереоценкаЗадолженностей(Дата, Организация, СчетДоверительногоУправления, ВидУчета);
	КонецЕсли;
	Если ПереоцениватьЗадолженности Тогда
		БУНУ_ПереоценитьЗадолженность(Отказ);
	КонецЕсли;

	ПереоцениватьДоходныеВложенияВМатериальныеЦенности = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПереоцениватьДоходныеВложенияВМатериальныеЦенности", ПереоцениватьДоходныеВложенияВМатериальныеЦенности) Тогда
		ПереоцениватьДоходныеВложенияВМатериальныеЦенности = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.НужнаПереоценкаПоАктиву(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДоходныеВложенияВМатериальныеЦенности, ВидУчета);
	КонецЕсли;
	Если ПереоцениватьДоходныеВложенияВМатериальныеЦенности Тогда
		БУНУ_ПереоценкаДоходныхВложенийВМатериальныеЦенности(Отказ);
	КонецЕсли;
	
	ПереоцениватьИнвестконтракты = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПереоцениватьИнвестконтракты", ПереоцениватьИнвестконтракты) Тогда
		ПереоцениватьИнвестконтракты = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.НужнаПереоценкаПоАктиву(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.Инвестконтракты, ВидУчета);
	КонецЕсли;
	Если ПереоцениватьИнвестконтракты Тогда
		БУНУ_ПереоценкаИмущественныхПрав(Справочники.УчетныеАктивы.Инвестконтракты, Отказ);
	КонецЕсли;
	
	ПереоцениватьПраваАренды = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПереоцениватьПраваАренды", ПереоцениватьПраваАренды) Тогда
		ПереоцениватьПраваАренды = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.НужнаПереоценкаПоАктиву(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ПраваАренды, ВидУчета);
	КонецЕсли;
	Если ПереоцениватьПраваАренды Тогда
		БУНУ_ПереоценкаИмущественныхПрав(Справочники.УчетныеАктивы.ПраваАренды, Отказ);
	КонецЕсли;
	
	ПризнатьРасходыПоБиржевымДепозитам = Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПризнатьРасходыПоБиржевымДепозитам", ПризнатьРасходыПоБиржевымДепозитам) Тогда
		ПризнатьРасходыПоБиржевымДепозитам = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.Нужно_ПризнатьРасходыПоБиржевымДепозитам(Дата, Организация, СчетДоверительногоУправления, ВидУчета);
	КонецЕсли;
	Если ПризнатьРасходыПоБиржевымДепозитам Тогда
		БУНУ_ПризнатьРасходыПоБиржевымДепозитам(Отказ);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЕПС_ПризнатьРасходыПоБиржевымДепозитам(Отказ)
	
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(ЭтотОбъект.Дата,
	ЭтотОбъект.Организация,
	ЭтотОбъект.СчетДоверительногоУправления,
	ЭтотОбъект.ВидУчета,
	Отказ);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют настройки у %1 по виду учета %2 на %3!", ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, ЭтотОбъект.Дата));
		Возврат;
	КонецЕсли;
	
	Если НастройкиПоВидуУчета.МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичности
		ИЛИ НастройкиПоВидуУчета.МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении Тогда
		
		ГФУКомиссий = ОбщегоНазначенияПовтИсп.ПолучитьИменованныйОбъект("Комиссионные_расходы_затраты_по_сделке");//Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("31322"); // пока хардкод т.к. еще не устоялась ситуация
		
		СчетУчетаДоходов = ПланыСчетов.Единый.НайтиПоКоду(ГФУКомиссий.НомерСчетаБухгалтерскогоУчета); // именно доходов т.к. комиссии уменьшают доход
		
		ВидыСубконто = Новый Массив;
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета);
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
			|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.БанковскийСчет КАК БанковскиеСчета,
			|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК ДепозитныеВклады,
			|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации КАК ДатаРегистрации,
			|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) КАК ВсегоДней,
			|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, НАЧАЛОПЕРИОДА(&ДатаПериода, ДЕНЬ), ДЕНЬ) КАК ДнейПрошло,
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
			|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СУММА(ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт, 0)) КАК СуммаОплаченоОстаток,
			|	СУММА(ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0)) КАК ВалютнаяСуммаОплаченоОстаток,
			|	СУММА(ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки05.СуммаОстатокКт, 0)) КАК СуммаКомиссииПризнаноРанееОстаток,
			|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0)) КАК СуммаКомиссии,
			|	СУММА(ЕдиныйБухгалтерскийУчетОбороты05.СуммаОборотКт) КАК СуммаКомиссииПризнаноРанееОборот
			|ИЗ
			|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
			|			&Период,
			|			ДатаНачалаДействияУсловий <= &ДатаПериода
			|				И КредитныйИнструмент.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)) КАК УсловияКредитныхИнструментовСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&Период,
			|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты07),
			|				&ВидыСубконто,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
			|		ПО (ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
			|			И (ЕдиныйБухгалтерскийУчетОстатки.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&Период,
			|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты05),
			|				&ВидыСубконто,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки05
			|		ПО (ЕдиныйБухгалтерскийУчетОстатки05.Субконто2 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
			|			И (ЕдиныйБухгалтерскийУчетОстатки05.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И Активный) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних
			|		ПО УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.БанковскийСчет.Договор = ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор
			|			И (ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|		ПО (ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.РазмещениеКредитногоИнструмента).КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
			|			И (ЗадолженностиПоДенежнымСредствам.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
			|			И (ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствам.Регистратор) = ТИП(Документ.НачислениеЗадолженности))
			|			И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
			|			И (ЗадолженностиПоДенежнымСредствам.Активность)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
			|				,
			|				&Период,
			|				Период,
			|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты05),
			|				&ВидыСубконто,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления,
			|				КорСчет = &СчетУчетаДоходов,
			|				) КАК ЕдиныйБухгалтерскийУчетОбороты05
			|		ПО (ЕдиныйБухгалтерскийУчетОбороты05.Субконто2 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
			|			И (ЕдиныйБухгалтерскийУчетОбороты05.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
			|ГДЕ
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения >= &Период
			|	И УсловияКредитныхИнструментовСрезПоследних.Действует
			|
			|СГРУППИРОВАТЬ ПО
			|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.БанковскийСчет,
			|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент,
			|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации,
			|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ),
			|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, НАЧАЛОПЕРИОДА(&ДатаПериода, ДЕНЬ), ДЕНЬ),
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения,
			|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
			|	ЗадолженностиПоДенежнымСредствам.Валюта";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ДатаПериода", КонецДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СчетУчетаДоходов", СчетУчетаДоходов);
		Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			СчетКомиссий = ПланыСчетов.Единый.Депозиты07;
			СчетРасчетов = ПланыСчетов.Единый.Депозиты05;
			
			Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления);
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				КоличествоДнейОстаток = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(ВыборкаДетальныеЗаписи.ДатаПогашения, ЭтотОбъект.Дата);
				
				СуммаНачисление = 0;
				Если ЗначениеЗаполнено(КоличествоДнейОстаток) Тогда
					СуммаНачисление = Окр((ВыборкаДетальныеЗаписи.СуммаКомиссии - ВыборкаДетальныеЗаписи.СуммаКомиссииПризнаноРанееОборот)/КоличествоДнейОстаток, 2);
					
					// Начисление
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаНачисление, "Списание расходов");	
					
					
					Проводка.СчетДт = СчетУчетаДоходов;
					
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУКомиссий;
					Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ДепозитныеВклады;
					
					
					Проводка.СчетКт = СчетРасчетов;
					
					Проводка.СубконтоКт.БанковскиеСчета = ВыборкаДетальныеЗаписи.БанковскиеСчета;
					Проводка.СубконтоКт.ДепозитныеВклады = ВыборкаДетальныеЗаписи.ДепозитныеВклады;
					
					Проводка.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
					Проводка.ВалютнаяСуммаКт = СуммаНачисление;
					
				КонецЕсли;	
				
				
				СуммаПризнание = Мин(ВыборкаДетальныеЗаписи.СуммаОплаченоОстаток, (СуммаНачисление + ВыборкаДетальныеЗаписи.СуммаКомиссииПризнаноРанееОстаток));
					
				// Признание
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаПризнание, "Списание расходов");	
				
				Проводка.СчетДт = СчетРасчетов;
				
				Проводка.СубконтоДт.БанковскиеСчета = ВыборкаДетальныеЗаписи.БанковскиеСчета;
				Проводка.СубконтоДт.ДепозитныеВклады = ВыборкаДетальныеЗаписи.ДепозитныеВклады;
				
				Проводка.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаПризнание;
				
				
				Проводка.СчетКт = СчетКомиссий;
				
				Проводка.СубконтоКт.БанковскиеСчета = ВыборкаДетальныеЗаписи.БанковскиеСчета;
				Проводка.СубконтоКт.ДепозитныеВклады = ВыборкаДетальныеЗаписи.ДепозитныеВклады;
				
				Проводка.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаПризнание;
				
				
				Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаПризнание, "Списание расходов");	
					
					Проводка.СчетДт 				= ПланыСчетов.Единый.АктивыВДУ03;
					Проводка.СубконтоДт.Договоры 	= ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
					
					Проводка.СчетКт = СчетУчетаДоходов;
					
					Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУКомиссий;
					Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ДепозитныеВклады;
					
				КонецЕсли;	
				
				
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура БУНУ_ПризнатьРасходыПоБиржевымДепозитам(Отказ)
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);	
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Сделка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.БанковскийСчет КАК БанковскиеСчета,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК ДепозитныеВклады,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации КАК ДатаРегистрации,
		|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) КАК ВсегоДней,
		|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, НАЧАЛОПЕРИОДА(&ДатаПериода, ДЕНЬ), ДЕНЬ) КАК ДнейПрошло,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстатокДт, 0)) КАК СуммаОплаченоОстаток,
		|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток, 0)) КАК ВалютнаяСуммаОплаченоОстаток,
		|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0)) КАК СуммаКомиссии,
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Контрагент,
		|	БухгалтерскийУчетОстатки.Субконто2 КАК Сделка
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&Период,
		|			ДатаНачалаДействияУсловий <= &ДатаПериода
		|				И КредитныйИнструмент.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссии),
		|				&ВидыСубконто,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ПО (ВЫРАЗИТЬ(БухгалтерскийУчетОстатки.Субконто2 КАК Документ.РазмещениеКредитногоИнструмента).КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
		|			И (БухгалтерскийУчетОстатки.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Активный) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних
		|		ПО УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.БанковскийСчет.Договор = ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор
		|			И (ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО (ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.РазмещениеКредитногоИнструмента).КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
		|			И (ЗадолженностиПоДенежнымСредствам.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
		|			И (ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствам.Регистратор) = ТИП(Документ.НачислениеЗадолженности))
		|			И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (ЗадолженностиПоДенежнымСредствам.Активность)
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения >= &Период
		|	И УсловияКредитныхИнструментовСрезПоследних.Действует
		|
		|СГРУППИРОВАТЬ ПО
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.БанковскийСчет,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации,
		|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ),
		|	РАЗНОСТЬДАТ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.ДатаРегистрации, НАЧАЛОПЕРИОДА(&ДатаПериода, ДЕНЬ), ДЕНЬ),
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения,
		|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствам.Валюта,
		|	БухгалтерскийУчетОстатки.Субконто1,
		|	БухгалтерскийУчетОстатки.Субконто2
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0)) <> 0 И
		|	СУММА(ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстатокДт, 0)) <> 0";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаПериода", КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		АналитикаПереоценки = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления, 
		Справочники.ВидыЗадолженности.ПоТорговойКомиссии, 
		УчетныйРегистр, 
		"АналитикаПереоценки",
		Истина);
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СуммаНачисление = 0;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВсегоДней) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаКомиссии) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаОплаченоОстаток) Тогда
				СуммаНачисление = Мин(Окр((ВыборкаДетальныеЗаписи.СуммаКомиссии) / ВыборкаДетальныеЗаписи.ВсегоДней * ВыборкаДетальныеЗаписи.ДнейПрошло, 2) - (ВыборкаДетальныеЗаписи.СуммаКомиссии - ВыборкаДетальныеЗаписи.СуммаОплаченоОстаток), ВыборкаДетальныеЗаписи.СуммаОплаченоОстаток);
				
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаНачисление, "Списание расходов");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоТорговойКомиссии;
				Проводка.СубконтоДт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
				Проводка.СубконтоДт.Сделка = ВыборкаДетальныеЗаписи.Сделка;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоКомиссии;
				Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
				Проводка.СубконтоКт.Сделка = ВыборкаДетальныеЗаписи.Сделка;
				
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаНачисление, "Списание расходов");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПереоценки;
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ДепозитныеВклады;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоТорговойКомиссии;
				Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
				Проводка.СубконтоКт.Сделка = ВыборкаДетальныеЗаписи.Сделка;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
