
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	УстановитьОтборыПоВедомымРегистрам(ЭтаФорма);

КонецПроцедуры // ПриСозданииНаСервере

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Договоры.Количество() > 0 Тогда
		ЗаполнитьДанныеПоДоговорам();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьОтборыПоВедомымРегистрам(ЭтаФорма);
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СудебноеДелоПриИзменении(Элемент)

	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СудебныйОрганПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыДоговорПриИзменении(Элемент)
	
	ЗаполнитьДанныеПоДоговорам(Элементы.Договоры.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыПриИзменении(Элемент)
	
	ЗаполнитьЗаголовокГруппыДоговоров();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьДанныеПоДоговорам();
	ЗаполнитьЗаголовокГруппыДоговоров();
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ЗаполнитьДанныеПоДоговорам(ИдентификаторСтроки = Неопределено)

	Если ИдентификаторСтроки = Неопределено Тогда
		НомерСтроки = Неопределено;
	Иначе
		ТекСтрока = Объект.Договоры.НайтиПоИдентификатору(ИдентификаторСтроки);
		НомерСтроки = ТекСтрока.НомерСтроки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договоры"	, Объект.Договоры.Выгрузить());
	Запрос.УстановитьПараметр("НомерСтроки"	, НомерСтроки);
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Договоры.НомерСтроки КАК НомерСтроки,
		|	Договоры.Договор КАК Договор
		|ПОМЕСТИТЬ _Договоры
		|ИЗ
		|	&Договоры КАК Договоры
		|ГДЕ
		|	(&НомерСтроки = НЕОПРЕДЕЛЕНО
		|			ИЛИ Договоры.НомерСтроки = &НомерСтроки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	_Договоры.Договор КАК Договор,
		|	_Договоры.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ _РеквизитыДоговоров
		|ИЗ
		|	_Договоры КАК _Договоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО _Договоры.Договор = СчетаДоверительногоУправления.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Договоры.ВидДоговора,
		|	Договоры.НомерДоговора,
		|	Договоры.ДатаЗаключения,
		|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения,
		|	_Договоры.Договор,
		|	_Договоры.НомерСтроки
		|ИЗ
		|	_Договоры КАК _Договоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|			ПО Договоры.Ссылка = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ПО _Договоры.Договор = Договоры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыДоговоров.ВидДоговора КАК ВидДоговора,
		|	_РеквизитыДоговоров.НомерДоговора КАК Номер,
		|	_РеквизитыДоговоров.ДатаЗаключения КАК ДатаЗаключения,
		|	_РеквизитыДоговоров.ДатаРасторжения КАК ДатаРасторжения,
		|	_РеквизитыДоговоров.Договор КАК Договор,
		|	_РеквизитыДоговоров.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	_РеквизитыДоговоров КАК _РеквизитыДоговоров
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Если ИдентификаторСтроки = Неопределено Тогда
		Объект.Договоры.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ТекСтрока, Выборка);
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовокГруппыДоговоров()
	
	Если Объект.Договоры.Количество() > 0 Тогда
		
		Если Объект.Договоры.Количество() = 1 Тогда
			ЗаголовокГруппы = "Относится к договору";
		Иначе
			ЗаголовокГруппы = "Относится к договорам";
		КонецЕсли; 
		
		Если Объект.Договоры.Количество() <= 10 Тогда
			МассивДоговоров = Новый Массив;
			Для каждого СтрокаДоговоры Из Объект.Договоры Цикл
				МассивДоговоров.Добавить("№" + СокрЛП(СтрокаДоговоры.Номер) + " от " + Формат(СтрокаДоговоры.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
			КонецЦикла; 
			ЗаголовокГруппы = ЗаголовокГруппы + ": " + СтрСоединить(МассивДоговоров, "; ");
		КонецЕсли; 
		
		ЭтаФорма.Элементы.ГруппаСписокДоговоров.Заголовок = ЗаголовокГруппы;
		
	Иначе
		ЭтаФорма.Элементы.ГруппаСписокДоговоров.Заголовок = "Указать договоры";
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыПоВедомымРегистрам(Форма)

	Объект = Форма.Объект;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма.СудебныеРешения.Отбор, "СудебныйПроцесс",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма.РеквизитыСудебныхПроцессов.Отбор, "СудебныйПроцесс",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ЭлементЗаписан = ЗначениеЗаполнено(Объект.Ссылка);
	
	Элементы.СудебныеРешения.Доступность			= ЭлементЗаписан;
	Элементы.РеквизитыСудебныхПроцессов.Доступность = ЭлементЗаписан;
	
КонецПроцедуры

#КонецОбласти





