
&НаСервере
Функция СформироватьДокументыСЭД(Организация, СчетДоверительногоУправления, Период, КаталогФайлов, ОтветственноеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрПлатежей.Организация КАК Организация,
		|	РеестрПлатежей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	РеестрПлатежей.СтрокаБанковскойВыписки.РасчетныйСчет КАК РасчетныйСчет,
		|	МАКСИМУМ(РеестрПлатежей.СтрокаБанковскойВыписки.Дата) КАК Дата
		|ПОМЕСТИТЬ _ПредыдущиеСтрокиВыписки
		|ИЗ
		|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|ГДЕ
		|	РеестрПлатежей.ДатаПлатежа < НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	И РеестрПлатежей.Организация = &Организация
		|	И РеестрПлатежей.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	РеестрПлатежей.Организация,
		|	РеестрПлатежей.СчетДоверительногоУправления,
		|	РеестрПлатежей.СтрокаБанковскойВыписки.РасчетныйСчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СчетДоверительногоУправления,
		|	РасчетныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация КАК Организация,
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет,
		|	НЕОПРЕДЕЛЕНО КАК СтрокаБанковскойВыписки
		|ПОМЕСТИТЬ _РасчетныеСчета
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &Период)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеестрПлатежей.Организация,
		|	РеестрПлатежей.СчетДоверительногоУправления,
		|	ДокументСтрокаБанковскойВыписки.РасчетныйСчет,
		|	РеестрПлатежей.СтрокаБанковскойВыписки
		|ИЗ
		|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтрокаБанковскойВыписки КАК ДокументСтрокаБанковскойВыписки
		|		ПО РеестрПлатежей.СтрокаБанковскойВыписки = ДокументСтрокаБанковскойВыписки.Ссылка
		|ГДЕ
		|	РеестрПлатежей.Организация = &Организация
		|	И РеестрПлатежей.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РеестрПлатежей.ДатаПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетныеСчета.РасчетныйСчет.НомерСчета КАК НомерСчета,
		|	_РасчетныеСчета.СтрокаБанковскойВыписки.ИсходныеДанные КАК ИсходныеДанные,
		|	ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК НачальныйОстаток,
		|	ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход, 0) КАК Приход,
		|	ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход, 0) КАК Расход,
		|	ЕСТЬNULL(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК КонечныйОстаток,
		|	_ПредыдущиеСтрокиВыписки.Дата КАК ДатаПредыдущегоДвижения,
		|	_РасчетныеСчета.СтрокаБанковскойВыписки.Сумма КАК СуммаСтрокиБанковскойВыписки
		|ИЗ
		|	_РасчетныеСчета КАК _РасчетныеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			РеестрПлатежей.Организация КАК Организация,
		|			РеестрПлатежей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			РеестрПлатежей.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки,
		|			РеестрПлатежей.СтрокаБанковскойВыписки.РасчетныйСчет КАК РасчетныйСчет
		|		ИЗ
		|			РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ГДЕ
		|			РеестрПлатежей.Организация = &Организация
		|			И РеестрПлатежей.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			И РеестрПлатежей.ДатаПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)) КАК СтрокиВыпискиЗаПериод
		|		ПО _РасчетныеСчета.Организация = СтрокиВыпискиЗаПериод.Организация
		|			И _РасчетныеСчета.СчетДоверительногоУправления = СтрокиВыпискиЗаПериод.СчетДоверительногоУправления
		|			И _РасчетныеСчета.СтрокаБанковскойВыписки = СтрокиВыпискиЗаПериод.СтрокаБанковскойВыписки
		|			И _РасчетныеСчета.РасчетныйСчет = СтрокиВыпискиЗаПериод.РасчетныйСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Период,
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстаткиИОбороты
		|		ПО _РасчетныеСчета.РасчетныйСчет = ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПредыдущиеСтрокиВыписки КАК _ПредыдущиеСтрокиВыписки
		|		ПО _РасчетныеСчета.Организация = _ПредыдущиеСтрокиВыписки.Организация
		|			И _РасчетныеСчета.СчетДоверительногоУправления = _ПредыдущиеСтрокиВыписки.СчетДоверительногоУправления
		|			И _РасчетныеСчета.РасчетныйСчет = _ПредыдущиеСтрокиВыписки.РасчетныйСчет
		|ИТОГИ
		|	МАКСИМУМ(НачальныйОстаток),
		|	МАКСИМУМ(Приход),
		|	МАКСИМУМ(Расход),
		|	МАКСИМУМ(КонечныйОстаток),
		|	МАКСИМУМ(ДатаПредыдущегоДвижения)
		|ПО
		|	_РасчетныеСчета.РасчетныйСчет";
		
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("НачалоПериода",                Новый Граница(НачалоДня(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",                 Новый Граница(КонецДня(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	ВыборкаРасчетыйСчет = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРасчетыйСчет.Следующий() Цикл
		
		// по каждому расчетному счету создается отдельный файл		
		Попытка 
			ФайлВФормате1С = Новый ЗаписьТекста(КаталогФайлов + "\" + СтрЗаменить(СокрЛП(СчетДоверительногоУправления), """", "") + ", " + СокрЛП(ВыборкаРасчетыйСчет.НомерСчета) + ".txt", КодировкаТекста.ANSI);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка выгрузки выписки по счету ДУ " + СокрЛП(СчетДоверительногоУправления) + ": " + ОписаниеОшибки());
			Прервать;
		КонецПопытки;	
		
		ФайлВФормате1С.ЗаписатьСтроку("1CClientBankExchange");
		ФайлВФормате1С.ЗаписатьСтроку("ВерсияФормата=1.01");
		ФайлВФормате1С.ЗаписатьСтроку("Кодировка=Windows");
		ФайлВФормате1С.ЗаписатьСтроку("Отправитель=1С:Предприятие");
		ФайлВФормате1С.ЗаписатьСтроку("Получатель=1С:Предприятие");
		ФайлВФормате1С.ЗаписатьСтроку("ДатаСоздания=" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
		ФайлВФормате1С.ЗаписатьСтроку("ВремяСоздания=" + Формат(ТекущаяДата(), "ДФ=ЧЧ:ММ:сс"));
		ФайлВФормате1С.ЗаписатьСтроку("ДатаНачала=" + Формат(Период, "ДФ=dd.MM.yyyy"));
		ФайлВФормате1С.ЗаписатьСтроку("ДатаКонца=" + Формат(Период, "ДФ=dd.MM.yyyy"));
		ФайлВФормате1С.ЗаписатьСтроку("РасчСчет=" + ВыборкаРасчетыйСчет.НомерСчета);
		ФайлВФормате1С.ЗаписатьСтроку("СекцияРасчСчет");
		ФайлВФормате1С.ЗаписатьСтроку("ДатаНачала=" + Формат(Период, "ДФ=dd.MM.yyyy"));
		ФайлВФормате1С.ЗаписатьСтроку("ДатаКонца=" + Формат(Период, "ДФ=dd.MM.yyyy"));
		ФайлВФормате1С.ЗаписатьСтроку("РасчСчет=" + ВыборкаРасчетыйСчет.НомерСчета);
		ФайлВФормате1С.ЗаписатьСтроку("НачальныйОстаток=" + СокрЛП(Формат(ВыборкаРасчетыйСчет.НачальныйОстаток, "ЧЦ=19; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ФайлВФормате1С.ЗаписатьСтроку("ВсегоПоступило=" + СокрЛП(Формат(ВыборкаРасчетыйСчет.Приход, "ЧЦ=19; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ФайлВФормате1С.ЗаписатьСтроку("ВсегоСписано=" + СокрЛП(Формат(ВыборкаРасчетыйСчет.Расход, "ЧЦ=19; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ФайлВФормате1С.ЗаписатьСтроку("КонечныйОстаток=" + СокрЛП(Формат(ВыборкаРасчетыйСчет.КонечныйОстаток, "ЧЦ=19; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ФайлВФормате1С.ЗаписатьСтроку("ДатаПредыдущегоДвижения=" + Формат(ВыборкаРасчетыйСчет.ДатаПредыдущегоДвижения, "ДФ=dd.MM.yyyy"));
		ФайлВФормате1С.ЗаписатьСтроку("КонецРасчСчет");
		
		Выборка = ВыборкаРасчетыйСчет.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ИсходныеДанные = Выборка.ИсходныеДанные;
			
			Если ЗначениеЗаполнено(ИсходныеДанные) Тогда
				Для Индекс = 1 По СтрЧислоСтрок(ИсходныеДанные) Цикл
					Если СтрНачинаетсяС(СтрПолучитьСтроку(ИсходныеДанные, Индекс), "Сумма=") Тогда
						ИсходныеДанные = СтрЗаменить(ИсходныеДанные, СтрПолучитьСтроку(ИсходныеДанные, Индекс), "Сумма=" + Формат(Выборка.СуммаСтрокиБанковскойВыписки, "ЧРД=.; ЧГ=0"));
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				ФайлВФормате1С.ЗаписатьСтроку(ИсходныеДанные + "КонецДокумента");
			КонецЕсли; 
		КонецЦикла;
		
		ФайлВФормате1С.ЗаписатьСтроку("КонецФайла");
		ФайлВФормате1С.Закрыть();
	КонецЦикла;
	
КонецФункции
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

