
Процедура ЗаменитьКолонкиПереоценки(ТаблицаСтоимостейЦБ) Экспорт
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ОценочнаяЦена");
	Колонка.Имя = "Цена";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ОценочнаяСумма");
	Колонка.Имя = "Сумма";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ОценочнаяЦенаКупона");
	Колонка.Имя = "ЦенаКупона";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ПолеЦены");
	Колонка.Имя = "ВидЦены";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ДатаКотировки");
	Колонка.Имя = "ДатаЦены";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ДатаКотировкиКупона");
	Колонка.Имя = "ДатаЦеныКупона";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ИсточникЦены");
	Колонка.Имя = "Источник";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ОценочнаяСуммаВВалютеУчета");
	Колонка.Имя = "СуммаВВалютеУчета";
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ОценочнаяСуммаКупонаВВалютеУчета");
	Колонка.Имя = "СуммаКупонаВВалютеУчета";   	
	
	Колонка = ТаблицаСтоимостейЦБ.Колонки.Найти("ОценочнаяСуммаКупона");
	Колонка.Имя = "СуммаКупона";
	
КонецПроцедуры

Функция ДопустимаНулеваяЦена(СтрокаДокумента) Экспорт

	ДопустимаНулеваяЦена = СтрокаДокумента.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.Дефолт
		Или СтрокаДокумента.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.Погашена
		Или СтрокаДокумента.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.РасчетнаяЦена
		Или СтрокаДокумента.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.ОценочнаяЦена
		Или СтрокаДокумента.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы
		Или СтрокаДокумента.Рынок = Перечисления.РынкиЦенныхБумаг.Опционы
		Или СтрокаДокумента.Рынок = Перечисления.РынкиЦенныхБумаг.Доли;
			
	Возврат ДопустимаНулеваяЦена;

КонецФункции
 