&НаСервере
Процедура СформироватьСписокРазделовОтчета()
	
	ЭтаФорма.РазделыОтчета.Очистить();
	
	ЭтаФорма.СохраняемыеРазделы = Отчеты.РегламентированныйОтчетБаланс.СформироватьСписокРазделовОтчета(ЭтаФорма.ИмяФормы, СтруктураРеквизитовФормы.НКО);
	
	Для Каждого Раздел Из ЭтаФорма.СохраняемыеРазделы Цикл
		ДобавитьРазделОтчета(РазделыОтчета, Раздел.Значение, Раздел.Представление);
		Раздел.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРазделОтчета(РазделыОтчета, ИмяРаздела, Представление)

	НоваяСтрока = РазделыОтчета.Добавить();
	
	НоваяСтрока.ИмяРаздела = ИмяРаздела;
	НоваяСтрока.Представление = Представление;

КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	ЭтаФорма.СтруктураРеквизитовФормы = Отчеты.РегламентированныйОтчетБаланс.ПолучитьСтруктуруПараметров(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиСервер()
	
	ЭтаФорма.ВыводитьСопоставимыеДанные = Истина;
	СформироватьСписокРазделовОтчета();
	СтруктуруНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ИмяМакетаСоставаПоказателей = КонсолидированнаяОтчетность.ПолучитьИмяМакетаСоставаПоказателей("РегламентированныйОтчетБаланс", СтруктураРеквизитовФормы);	
	МакетСоставаПоказателей = Отчеты[СтруктуруНаименованийОтчета.ИсточникОтчета].ПолучитьМакет(ИмяМакетаСоставаПоказателей);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МакетСоставаПоказателей", МакетСоставаПоказателей);
	СтруктураПараметров.Вставить("мТаблицаСоставПоказателей", мТаблицаСоставПоказателей);
	СтруктураПараметров.Вставить("УникальныйИдентификатор", ЭтаФорма.УникальныйИдентификатор);
	
	СтруктураПараметров.Вставить("Адрес_ТаблицаРасшифровки", Адрес_ТаблицаРасшифровки);
	СтруктураПараметров.Вставить("Адрес_мСтруктураЦветовРаскраски", Адрес_мСтруктураЦветовРаскраски);
	СтруктураПараметров.Вставить("Адрес_мСтруктураВариантыЗаполнения", Адрес_мСтруктураВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаВариантыЗаполнения", Адрес_мТаблицаВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаСчетов", Адрес_мТаблицаСчетов);
	
	КонсолидированнаяОтчетность.ЗаполнитьНачальныеНастройкиСервер(СтруктураПараметров);
	
	Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		Если Лев(ЭлементСтруктуры.Ключ, 6) = "Адрес_" Тогда
			ЭтаФорма[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено Тогда
		
		СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
		СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
		СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
		СписокСохранения.Свойство("НКО", СтруктураРеквизитовФормы.НКО);
		
		ЗаполнитьНачальныеНастройкиСервер();
		
		ЗаполнитьТабличныеДокументыИзМакетов();
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
           И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
        	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

		КонецЕсли;
		
	Иначе
		
		ЗаполнитьНачальныеНастройкиСервер();
		
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			// документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе
			// Это новый документ.
			Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
				СтруктураРеквизитовФормы.ВалютаДокумента  		  	= ЭтаФорма.НастройкиОтчета.ВалютаДокумента;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         	= ЭтаФорма.НастройкиОтчета.ЕдиницаИзмерения;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	= ЭтаФорма.НастройкиОтчета.ТочностьЕдиницыИзмерения;
				ЭтаФорма.Подписант 									= ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
			Иначе	
				СтруктураРеквизитовФормы.ВалютаДокумента  		  = СтруктураРеквизитовФормы.Организация.ВалютаУчета;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			КонецЕсли; 
			
			ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
			СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода = КонсолидированнаяОтчетность.ПолучитьОтчетНаКонецПредыдущегоПериода(СтруктураРеквизитовФормы, ИсточникОтчета);			
			ЭтаФорма.СтатусОтчета = "Черновик";
			
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьТабличныеДокументыИзМакетов();
		ЗаполнитьДенежныйПоказательСРазмерностью();
		
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
	
		Если ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
			
			ЭтаФорма.КлючТекущихНастроек = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
			КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетБаланс");
		
		КонецЕсли;
		
		Если ЭтаФорма.НастройкиОтчета.Свойство("ВыводитьСопоставимыеДанные")
			И ЗначениеЗаполнено(ЭтаФорма.НастройкиОтчета.ВыводитьСопоставимыеДанные)
			И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВыводитьСопоставимыеДанные) = Тип("Булево") Тогда
		
			ЭтаФорма.ВыводитьСопоставимыеДанные	= ЭтаФорма.НастройкиОтчета.ВыводитьСопоставимыеДанные;
		
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НаимСчетаДоверительногоУправления = СтруктураРеквизитовФормы.СчетДоверительногоУправления.Наименование;
	
	Если Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 1 Тогда 
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	ИначеЕсли СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = "период с " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	Иначе
		СтруктураРеквизитовФормы.СтрПериодОтчета = "Январь - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	КонецЕсли;
	
	ИнициализироватьСтруктуруЗаголовковОтчетов();
	
	мСкопированаФорма = Неопределено;
	Параметры.Свойство("мСкопированаФорма", мСкопированаФорма);
	Если ЗначениеЗаполнено(мСкопированаФорма) Тогда 
		Модифицированность = Истина;
	КонецЕсли;
	
	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);
	Элементы.НомерКорректировки.Видимость = ЭтаФорма.СтатусОтчета = "Корректировка";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерностьВалюту()
	
	ЕдиницаИзмеренияНадпись = "";
	ПредставлениеВалютыДокумента = ?(ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента), СтруктураРеквизитовФормы.ВалютаДокумента, "руб");
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		ЕдиницаИзмеренияНадпись ="в "+ ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		ЕдиницаИзмеренияНадпись ="в тысячах " + ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		ЕдиницаИзмеренияНадпись = "в миллионах " + ПредставлениеВалютыДокумента;
	КонецЕсли;
	
	Возврат ЕдиницаИзмеренияНадпись;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДенежныйПоказательСРазмерностью(ИмяРаздела = "")
	
	ДенежныйПоказательСРазмерностью = КонсолидированнаяОтчетность.ПолучитьДенежныйПоказательСРазмерностью(СтруктураРеквизитовФормы, ЭтаФорма);
	
	РазмерностьДокумента = ПолучитьРазмерностьВалюту();
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		Если ЗначениеЗаполнено(ИмяРаздела) И ИмяРаздела <> ТекСтрока.ИмяРаздела Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ТекРаздел = ТекСтрока.ТабличныйДокумент;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ТекРаздел.Области.Найти("ДенежныйПоказательСРазмерностью") <> Неопределено
			И ТекРаздел.Области.ДенежныйПоказательСРазмерностью.СодержитЗначение
			И ТекРаздел.Области.ДенежныйПоказательСРазмерностью.Значение <> ДенежныйПоказательСРазмерностью
		Тогда
			ТекРаздел.Области.ДенежныйПоказательСРазмерностью.Значение = ДенежныйПоказательСРазмерностью;
		КонецЕсли;
		
		Если ТекРаздел.Области.Найти("НаименованиеВалютыОтчета") <> Неопределено 
			И ТекРаздел.Области.НаименованиеВалютыОтчета.СодержитЗначение
			И ТекРаздел.Области.НаименованиеВалютыОтчета.Значение <> РазмерностьДокумента
		Тогда
			ТекРаздел.Области.НаименованиеВалютыОтчета.Значение = РазмерностьДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруЗаголовковОтчетов()
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов = Новый Соответствие;
	
	КонецПредыдущегоГода = КонецГода(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	ГодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ = 'гггг'");
	ГодПредыдущий = Формат(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12), "ДФ = 'гггг'");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодОтчетногоГода", "за " + ГодОтчета + "г.");
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодПредыдущегоГода", "за " + ГодПредыдущий + "г.");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаОтчетнуюДату", "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD"));
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаКонецПредыдущегоГода", "На " + Формат(КонецПредыдущегоГода, "ДЛФ=DD"));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ПоказателиОтчета;
	Перем ТаблицаРасшифровки;
	Перем РазделыСРучнойКорректировкой;
	
	СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
	
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         	 = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	 = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.ВалютаДокумента			 = СтруктураРеквизитовФормы.мСохраненныйДок.ВалютаДокумента;
	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода	 = СтруктураРеквизитовФормы.мСохраненныйДок.ОтчетНаКонецПрошлогоГода;
	Комментарий                                        	 = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтатусОтчета                                         = СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета;
	НомерКорректировки                                 	 = СтруктураРеквизитовФормы.мСохраненныйДок.НомерКорректировки;

	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	СписокСохранения.Свойство("Расшифровка", ТаблицаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		
		Адрес_ТаблицаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, УникальныйИдентификатор);
		
	КонецЕсли;
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("РазделыСРучнойКорректировкой", РазделыСРучнойКорректировкой);
	СписокСохранения.Свойство("Подписант", ЭтаФорма.Подписант);
	
	Для Каждого ТекСтрока из ЭтаФорма.РазделыОтчета Цикл
		Если Не РазделыСРучнойКорректировкой.Найти(ТекСтрока.ИмяРаздела) = Неопределено Тогда
			ТекСтрока.РучнаяКорректировка = Истина;
			КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ТекСтрока.ИмяРаздела, ТекСтрока.ТабличныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока из ПоказателиОтчета Цикл
		Попытка
			ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекСтрока.ИмяРаздела);
			ТабДок.Области[ТекСтрока.ИмяПоказателя].Значение = ТекСтрока.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеДокументыИзМакетов(ЭтоНовый = Истина)
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		Попытка
			
			Префикс = "МСФО9_";
			
			Если ТекСтрока.ИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
			
				Префикс = ?(СтруктураРеквизитовФормы.НКО, "МСФО9_НКО_", "МСФО9_");
			
			КонецЕсли; 
			
			ИмяМакета = Префикс + "Макет" + ТекСтрока.ИмяРаздела;
			
			КонсолидированнаяОтчетность.ЗаполнитьТабличныйДокументИзМакета(ЭтаФорма, ТекСтрока, ИмяМакета);
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦветФонаЯчейки(ИмяТекРаздела = "", ТекРаздел = Неопределено)

	КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяТекРаздела, ТекРаздел);
	Если ЗначениеЗаполнено(ТекРаздел = Неопределено) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяТекРаздела);
	Иначе
		ЭтаФорма.ТабличныйДокумент = ТекРаздел;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
		
		СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраница";
		СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
		
		ЗаполнитьАвто();
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
			ЭтаФорма.СтатусОтчета = "Черновик";
		КонецЕсли; 
		
		Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
			Записать(Неопределено);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьФорму Тогда
		ЭтаФорма.Открыть();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить() Экспорт
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраница";
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
	
	ЗаполнитьАвто();
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
		ЭтаФорма.СтатусОтчета = "Черновик";
	КонецЕсли; 
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьСтруктуруРеквизитовФормы();
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы, Параметры);
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	КонсолидированнаяОтчетность.ЗаполнитьСтруктуруПеременныхДляОтбора(СтруктураПеременныхДляОтбора);
	
	Инициализация(Параметры.БезОткрытияФормы);
	
	ИмяОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].ИмяРаздела;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	КонсолидированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонсолидированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета) Тогда
	
		ПредыдущаяСтрока = ЭтаФорма.РазделыОтчета.НайтиПоИдентификатору(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета);
		Если Не ПредыдущаяСтрока = Неопределено Тогда
		
			ПредыдущаяСтрока.ТабличныйДокумент = ЭтаФорма.ТабличныйДокумент;
		
		КонецЕсли; 
	
	КонецЕсли; 
		
	НаимТекущегоРаздела = Элемент.ТекущиеДанные.ИмяРаздела;
	ЭтаФорма.РучнаяКорректировка = Элемент.ТекущиеДанные.РучнаяКорректировка;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = НаимТекущегоРаздела;
	
	Если НаимТекущегоРаздела = "ОтчетТитульнаяСтраница" Тогда
		
		Элементы.РучнаяКорректировка.Доступность = Ложь;
		
	Иначе
		
		Элементы.РучнаяКорректировка.Доступность = Истина;
	
	КонецЕсли; 	
	
	ЭтаФорма.ТабличныйДокумент = Элемент.ТекущиеДанные.ТабличныйДокумент;
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Истина;
		РучнаяКорректировкаПриУстановкеСервер(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		УстановитьЦветФонаЯчейки(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
	Иначе
		
		ЭтаФорма.РучнаяКорректировка = Истина;
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РучнаяКорректировкаПриИзмененииВопросЗавершение",
		ЭтотОбъект,)
		,
		НСтр("ru = 'Будет произведено автоматическое заполнение закладки. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзмененииВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Ложь;
	ЭтаФорма.РучнаяКорректировка = Ложь;
	ЗаполнитьАвто(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриУстановкеСервер(ИмяРаздела)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Раздел", ИмяРаздела);
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Расчет(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифровкаНажатие(Неопределено);
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеОтчета

&НаСервереБезКонтекста
Функция ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет)
	Возврат РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет);
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьАвто(ИмяРаздела = "")

	Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(,"Необходимо указать валюту отчета!");
		Возврат;
	КонецЕсли;
	
	Если Не (ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")) Тогда
		ЭтаФорма.НастройкиОтчета = ПолучитьНастройкиОтчета(
			ЭтаФорма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, 
			ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления,
			"РегламентированныйОтчетБаланс");		
	КонецЕсли; 
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	Если СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12);
	Иначе
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецМесяца(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецГода(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	
	СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода    = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	КонсолидированнаяОтчетностьКлиент.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	// Очистка разделов
	Очистить(ИмяРаздела);
	ЗаполнитьДенежныйПоказательСРазмерностью(ИмяРаздела);	
	
	нСч = 0;
	ПредставлениеОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].Представление;
	// Заполнение разделов
	Если ИмяРаздела = "" Тогда
		
		Всего = ЭтаФорма.РазделыОтчета.Количество();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				
				Состояние("Заполняется раздел: " + ТекСтрока.Представление, нСч/Всего * 100, "Заполнение...");
				Выполнить("Подключаемый_ЗаполнитьРаздел_" + ТекСтрока.ИмяРаздела + "()");
				нСч = нСч + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяРаздела + "()");
		КонецЕсли;
		
	КонецЕсли;
	
	Если нСч Тогда
		Состояние("Заполняется раздел: " + ПредставлениеОсновногоРаздела, нСч/Всего * 100, "Заполнение...");
	КонецЕсли;
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		Очистить(ИмяОсновногоРаздела);
	КонецЕсли;
	
	Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
	
	Если нСч Тогда
		Состояние();
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		
		ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета[0].ТабличныйДокумент;
		
	Иначе
		
		ЭтаФорма.ТабличныйДокумент = Элементы.РазделыОтчета.ТекущиеДанные.ТабличныйДокумент;
	
	КонецЕсли; 
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
		
КонецПроцедуры

 &НаСервере
Процедура Очистить(ИмяРаздела = "")
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);		
	
	Если ИмяРаздела = "" Тогда
		
		ТаблицаРасшифровки.Очистить();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			ОчиститьТабличноеПоле(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
			
		КонецЦикла;
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("Раздел", ИмяРаздела);
		НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
		ОчиститьТабличноеПоле(ТабДок, ИмяРаздела);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	ЗаполнитьЗаголовки(ИмяРаздела);
	ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела)
	
	Если ИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
		Возврат;	
	КонецЕсли; 
	
	НайденныеСтроки = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела));
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
		
			ТекСтрока.РучнаяКорректировка = Ложь;
		
		КонецЦикла; 
		
		ЭтаФорма.РучнаяКорректировка = Ложь;
	КонецЕсли;
	
	УстановитьЦветФонаЯчейки(ИмяРаздела);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПоле(ВыбТабличныйДокумент, ИмяРаздела)
	
	Для Каждого ТекОбласть Из ВыбТабличныйДокумент.Области Цикл
			
		Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Не ТекОбласть.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка макета: раздел " + ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		ТекОбласть.Очистить();
		
	КонецЦикла;
	
	РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела);
	
КонецПроцедуры // ОчиститьТабличноеПоле()

&НаСервере
Процедура ЗаполнитьЗаголовки(ИмяРаздела = "")
	//#ЗаполнениеЗаголовков
	
	Если ИмяРаздела = "" Тогда
		мМассивРазделов = ЭтаФорма.РазделыОтчета.Выгрузить(, "ИмяРаздела").ВыгрузитьКолонку(0);
	Иначе
		мМассивРазделов = Новый Массив;
		мМассивРазделов.Добавить(ИмяРаздела);
	КонецЕсли;
	
	Для Каждого ТекИмяРаздела из мМассивРазделов Цикл
		Если ТекИмяРаздела = "Настройка"
			или ТекИмяРаздела = "Проверка"
			или ТекИмяРаздела = "ПроверкаПротоколОшибок"
			Тогда
			Продолжить;
		КонецЕсли;
		
		ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекИмяРаздела);
		
		// Настройки заполнения шапки: Текущий период
		Если НЕ ТекРаздел.Области.Найти("ТекущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
		КонецЕсли;
		
		// Настройки заполнения шапки: Предыдущий период
		Если НЕ ТекРаздел.Области.Найти("ПредыдущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ПредыдущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		КонецЕсли;
		
		// Настройки для заголовков периодов
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокНачалоПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокНачалоПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокКонецПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокКонецПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		// Настройки для титульного листа
		Если ТекИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
			Если НЕ ТекРаздел.Области.Найти("ТекущийПериод1") = Неопределено Тогда
				ТекРаздел.Области.ТекущийПериод1.Значение    = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
			Если НЕ СведенияОбОрганизации = Неопределено Тогда
			
				Если НЕ ТекРаздел.Области.Найти("Организация") = Неопределено Тогда
					ТекРаздел.Области.Организация.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
						СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
						СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				
				Если НЕ ТекРаздел.Области.Найти("ПочтовыйАдресОрганизации") = Неопределено Тогда
					ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдрес;
				КонецЕсли;	
			
			КонецЕсли; 
						
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#Область ОбщиеПроцедурыЗаполнения

&НаСервере
Функция ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь, стрДопПоля = "", стрГруппировка = "Счет")
	
	Если ТипЗнч(ВидыСубконто) = Тип("СписокЗначений") Тогда
		
		Если Развернутый Тогда
			КоличествоСубконто = ВидыСубконто.Количество();
			Для Ном = 1 По КоличествоСубконто Цикл
				стрДопПоля = стрДопПоля + Символы.ПС + "Субконто" + Ном + ",";
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СальдоОборот = "Оборот" Тогда
		
		ШаблонТекстаЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			" + ?(ПустаяСтрока(КодКорреспондентскогоСчета), "", ВидСравненияКорсчета + ", &ВидыСубконтоКорСчета") + "
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода,) КАК РеквизитыПИФСрезПоследних
		|		ПО ВЫРАЗИТЬ(вэУправленческий.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|" + стрОтбор + "
		|
		|ИТОГИ
		|	СУММА(СуммаОборотДт),
		|	СУММА(СуммаОборотКт)
		|ПО
		|	" + стрГруппировка;
		
	Иначе
		
		ШаблонТекстаЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			" + ?(СальдоОборот = "НаНачало", "&НачалоПериода", "&грКонецПериода") + ",
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ") КАК вэУправленческий" + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, "
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|		ПО вэУправленческий.Счет = СчетаСОборотнымСубконтоКонтрагенты.Счет", "") + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода,) КАК РеквизитыПИФСрезПоследних
		|		ПО ВЫРАЗИТЬ(вэУправленческий.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|" + стрОтбор + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, ?(стрОтбор = "", "ГДЕ", " И ") + "
		|			(НЕ СчетаСОборотнымСубконтоКонтрагенты.Счет ЕСТЬ NULL )
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вэУправленческий.Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			,
		|			" + ?(СальдоОборот = "НаНачало", "ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1)", "&КонецПериода") + ",
		|			,
		|			Счет В ИЕРАРХИИ (&СписокСчетов)
		|				И Счет В
		|					(ВЫБРАТЬ
		|						СчетаСОборотнымСубконтоКонтрагенты.Счет
		|					ИЗ
		|						СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			,
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода,) КАК РеквизитыПИФСрезПоследних
		|		ПО ВЫРАЗИТЬ(вэУправленческий.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|" + стрОтбор, "") + "
		|
		|ИТОГИ
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт),
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт)
		|ПО
		|	" + стрГруппировка;
	КонецЕсли;
	
	Возврат ШаблонТекстаЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, СальдоОборот, ЗаПериод, ТекРаздел, ВидыСубконто = Неопределено, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", стрТаблицаКурсовВалют = "КоэффициентыВалютПП", РезервПодОбесценение = ЛОЖЬ)
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если СальдоОборот = "НаНачало" Или СальдоОборот = "НаКонец" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто, Ложь, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	
	Если ЗаПериод = "ЗаПрошлыйПериод" Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", стрТаблицаКурсовВалют);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		
		ТекСчет = СтрокаСчета.Счет;
		
		ИмяСлагаемого     = СтрокаСчета.ИмяСлагаемого;
		ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
		ЗнакОперации      = СтрокаСчета.ЗнакОперации;
		ТекстРасшифровки  = СтрокаСчета.ТекстРасшифровки;
		
		ИмяЯчейки             = СтрокаСчета.ИмяЯчейки;
		СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		
		Если ТекстРасшифровки = "" Тогда
			СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(ТекСчет.Код), КодКорреспондентскогоСчета, ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета));
		Иначе
			СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		КонецЕсли;
			
		КонсолидированнаяОтчетность.СкорректироватьСлагаемоеНаименование_ОФР(Запрос, СлагаемоеНаименование);
		
		ТекСумма = 0;
		
		ВыборкаПоСчетам.Сбросить();
		ОтборСчета = Новый Структура("Счет", ТекСчет);
		Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
			ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
		КонецЕсли;
		
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, СтрокаСчета.ИмяПоказателя, ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
		
	КонецЦикла;
		
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Если РезервПодОбесценение Тогда
		ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, СальдоОборот, ЗаПериод, ТекРаздел, стрСчетОбесценение, стрОтборВирт = "", ИмяЯчейкиНеобесцененные = "03", ИмяЯчейкиОбесцененные = "04")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	КодКорреспондентскогоСчета = "";
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Врем_мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	мТаблицаСчетов = Врем_мТаблицаСчетов.Скопировать();
	
	мТаблицаСчетов.Колонки.Добавить("СуммаОбесцененные", Новый ОписаниеТипов("Число"));
	мТаблицаСчетов.Колонки.Добавить("ИмяРеквизитаСуммыОбесценение", Новый ОписаниеТипов("Строка"));
	мТаблицаСчетов.Колонки.Добавить("ДтКтОбесценение", Новый ОписаниеТипов("Строка"));
	
	Для Каждого стр_мТаблицаСчетов из мТаблицаСчетов Цикл
		Если стр_мТаблицаСчетов.ИмяСлагаемого = "!СКД" Тогда
			стр_мТаблицаСчетов.ИмяРеквизитаСуммыОбесценение = "СуммаОбесцененныеКт"; //Берем противоположное: Дт - Кт
			стр_мТаблицаСчетов.ДтКтОбесценение = "кредит";
		ИначеЕсли  стр_мТаблицаСчетов.ИмяСлагаемого = "!СКК" Тогда
			стр_мТаблицаСчетов.ИмяРеквизитаСуммыОбесценение = "СуммаОбесцененныеДт"; //Берем противоположное: Кт - Дт
			стр_мТаблицаСчетов.ДтКтОбесценение = "дебет";
		КонецЕсли;
	КонецЦикла;
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	
	// КешТаблицаДляСчетовОбесценение+++
	Если НЕ Адрес_КешТаблицаДляСчетовОбесценение = "" Тогда
		мКешТаблицаДляСчетовОбесценение = ПолучитьИзВременногоХранилища(Адрес_КешТаблицаДляСчетовОбесценение);
		СписокСчетовОбесцененные = Новый СписокЗначений;
		тзЯчейки = мТаблицаСчетов.Скопировать();
		тзЯчейки.Свернуть("ИмяЯчейки");
		стрИменаЯчеек = "";
		Для Каждого стр_тзЯчейки из тзЯчейки Цикл
			стрИменаЯчеек = стрИменаЯчеек + ?(стрИменаЯчеек = "", "", ",") + стр_тзЯчейки.ИмяЯчейки;
			мСтроки_мКешТаблицаДляСчетовОбесценение = мКешТаблицаДляСчетовОбесценение.НайтиСтроки(Новый Структура("Строка", стр_тзЯчейки.ИмяЯчейки));
			Для Каждого стр_мКешТаблицаДляСчетовОбесценение из мСтроки_мКешТаблицаДляСчетовОбесценение Цикл
				СписокСчетовОбесцененные.Добавить(стр_мКешТаблицаДляСчетовОбесценение.Счет);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокСчетовОбесцененные.Количество() = 0 Тогда
		//!!!!!!ТекстСообщения = НСтр("ru = 'Раздел " + ИмяРаздела + ". При заполнении строки " + стрИменаЯчеек + " не найдены счета из колонки ""Резерв под обесценение"", используется счет: " + стрСчетОбесценение + "'");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		СписокСчетовОбесцененные = ПолучитьСчетПоКоду(стрСчетОбесценение);
	КонецЕсли;
	// КешТаблицаДляСчетовОбесценение---
	
	Запрос.УстановитьПараметр("СчетОбесцененные", СписокСчетовОбесцененные);
	
	// ДепозитыМенее90Дней добавлено в запрос
	
	ТекстЗапроса = КонсолидированнаяОтчетность.ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные_ТекстЗапроса(ЭтаФорма);
	
	Если стрОтборВирт = "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &стрОтборВирт", "И ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &стрОтборВирт", стрОтборВирт);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		
		ТекСчет = СтрокаСчета.Счет;
		
		ИмяСлагаемого     = СтрокаСчета.ИмяСлагаемого;
		ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
		ИмяРеквизитаСуммыОбесценение = СтрокаСчета.ИмяРеквизитаСуммыОбесценение;
		
		ЗнакОперации      = СтрокаСчета.ЗнакОперации;
		ТекстРасшифровки  = СтрокаСчета.ТекстРасшифровки;
		
		ИмяЯчейки             = СтрокаСчета.ИмяЯчейки;
		СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		
		Если ТекстРасшифровки = "" Тогда
			СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(ТекСчет.Код), КодКорреспондентскогоСчета, ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
		Иначе
			СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		КонецЕсли;
		
		ТекСумма = 0;
		ТекСуммаОбесцененные = 0;
		
		ВыборкаПоСчетам.Сбросить();
		ОтборСчета = Новый Структура("Счет", ТекСчет);
		Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
			ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			
			Если ЗначениеЗаполнено(ИмяРеквизитаСуммыОбесценение) Тогда
				ТекСуммаОбесцененные = ?(ЗнакОперации = "-", -1, 1) * ВыборкаПоСчетам[ИмяРеквизитаСуммыОбесценение];
				СтрокаСчета.СуммаОбесцененные = СтрокаСчета.СуммаОбесцененные + ТекСуммаОбесцененные;
				
				СтрокаСчета.Сумма = СтрокаСчета.Сумма - ТекСуммаОбесцененные;
				ТекСумма = СтрокаСчета.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
		// 03
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки + ИмяЯчейкиНеобесцененные, СтрокаСчета.ИмяПоказателя, ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
		
		// 04
		стрИмяПоказателя = СтрЗаменить(СтрокаСчета.ИмяПоказателя, "Необесцененные", "Обесцененные");
		
		стрТекстСчетСчеты = ?(СписокСчетовОбесцененные.Количество() = 1, "счете", "счетах");
		стрТекстРасшифровки = "Остаток на конец периода #Период# по " + СтрокаСчета.ДтКтОбесценение + "у счета " + ТекСчет + " с учетом отборов по строке для столбца 3 (анализ ценных бумаг на " + стрТекстСчетСчеты + " " + СписокСчетовОбесцененные + ")";
		
		стрСлагаемоеНаименование = СтрЗаменить(стрТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки + ИмяЯчейкиОбесцененные, стрИмяПоказателя, ЗнакОперации, стрСлагаемоеНаименование, ТекСуммаОбесцененные, СписокСчетовОбесцененные, , , , ИмяРаздела);
		
	КонецЦикла;
		
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма, СуммаОбесцененные");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма, СуммаОбесцененные");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки + ИмяЯчейкиНеобесцененные, СтрокаСчета.Сумма);
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки + ИмяЯчейкиОбесцененные, СтрокаСчета.СуммаОбесцененные);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	Если ИмяРаздела = "АнализЧувствительности71" Тогда
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "КАК СуммаКонечныйОстатокДт,",
		"КАК СуммаКонечныйОстатокДт,
		|	вэУправленческий.ВалютнаяСуммаОстатокДт КАК СуммаКонечныйОстатокДтВВалюте,
		|	вэУправленческий.ВалютнаяСуммаОстатокКт КАК СуммаКонечныйОстатокКтВВалюте,");
		
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "
		|ИТОГИ", "
		|ИТОГИ
		|	СУММА(СуммаКонечныйОстатокДтВвалюте),
		|	СУММА(СуммаКонечныйОстатокКтВвалюте),");
	КонецЕсли;
	
	НачалоЦикла = ?(НомерКолонкиОтчетногоПериода = "", 2, 1);
	КоличествоЦиклов = ?(НомерКолонкиПредыдущегоПериода = "", 1, 2);	
	
	Для НомерЦикла = 1 По КоличествоЦиклов Цикл
		
		Если НомерЦикла = 1 Тогда
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		Иначе
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФинансовыеОрганизацииТП", "&ФинансовыеОрганизацииПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ИмяРаздела = "АнализЧувствительности71" Тогда
			ВалютаВыведена = Ложь;
		КонецЕсли;
		
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			Если ТекстРасшифровки = "" Тогда
				СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
			Иначе
				СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина"));
			КонецЕсли;
			
			ТекСумма = 0;
			ТекСуммаРасшифровки = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				Если ИмяРаздела = "АнализЧувствительности71" Тогда
					ТекСуммаРасшифровки = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы + "ВВалюте");
				КонецЕсли;
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			Если ИмяРаздела = "АнализЧувствительности71" Тогда //Расшифровка в валюте проводки, отчет в валюте документа
				Если Не ВалютаВыведена Тогда
					Выборка = ВыборкаПоСчетам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					ТекВалюта = Запрос.Параметры.Валюта;
					ТекКурс = Запрос.Параметры.Курс;
					ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", "", "#Валюта: " + ТекВалюта + "; Курс = " + ТекКурс + " * 0,1",0, , , , , ИмяРаздела);
					ВалютаВыведена = Истина;
				КонецЕсли;
				
				ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСуммаРасшифровки, ТекСчет, , , , ИмяРаздела);
			Иначе
				Если Запрос.Параметры.Свойство("ДополнительнаяАналитика") и СтрЧислоВхождений(стрОтборВирт, "ДополнительнаяАналитика") > 0 Тогда
					стрЗначенияОтбора = "";
					Для Каждого эл из Запрос.Параметры.ДополнительнаяАналитика Цикл
						стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
					КонецЦикла;
					
					стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по дополнительной аналитике", "исключая дополнительную аналитику");
			
					СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + ": " + стрЗначенияОтбора;
				КонецЕсли;
				ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
			КонецЕсли;
			
		КонецЦикла;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	//Запрос = ПолучитьИзВременногоХранилища(Адрес_Запрос);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	Если ИмяРаздела = "АнализЧувствительности71" Тогда
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "КАК СуммаКонечныйОстатокДт,",
		"КАК СуммаКонечныйОстатокДт,
		|	вэУправленческий.ВалютнаяСуммаОстатокДт КАК СуммаКонечныйОстатокДтВВалюте,
		|	вэУправленческий.ВалютнаяСуммаОстатокКт КАК СуммаКонечныйОстатокКтВВалюте,");
		
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "
		|ИТОГИ", "
		|ИТОГИ
		|	СУММА(СуммаКонечныйОстатокДтВвалюте),
		|	СУММА(СуммаКонечныйОстатокКтВвалюте),");
	КонецЕсли;
	
	Для НомерЦикла = 1 По 2 Цикл
		
		Если НомерЦикла = 1 Тогда
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		Иначе
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КурсыВалютНаКонецТекущегоПериода", "КурсыВалютНаКонецПрошлогоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		
		ТекстСравненияПоСубконтоПредставление = "";
		СравнениеИтогаСНулем = "";
		КонсолидированнаяОтчетность.ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, мТаблицаСчетов, ТекстСравненияПоСубконтоПредставление, СравнениеИтогаСНулем, стрОтборВирт);
		
		стрВсеСчета = "";
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			стрВсеСчета = стрВсеСчета + ?(стрВсеСчета = "", "", ", ") + СтрокаСчета.Счет;
		КонецЦикла;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//данные выводим итогом по счетам
		ИтогСумма = 0;
			
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			//Если ТекстРасшифровки = "" Тогда
			//	СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, ?(НомерЦикла = 1, мДатаНачалаПериодаОтчета, мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, мДатаКонцаПериодаОтчета, мДатаКонцаПрошлогоПериодаОтчета));
			//Иначе
			//	СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(НомерЦикла = 1, мДатаНачалаПериодаОтчета, мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, мДатаКонцаПериодаОтчета, мДатаКонцаПрошлогоПериодаОтчета), "ФП = Истина"));
			//КонецЕсли;
			
			ТекСумма = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			ИтогСумма = ИтогСумма + ТекСумма;
			
		КонецЦикла;
			
		//обнулим сумму, если она не подходит под условие СравнениеИтогаСНулем
		Если СравнениеИтогаСНулем = "Больше" и ИтогСумма < 0 Тогда
			ИтогСумма = 0;
		ИначеЕсли СравнениеИтогаСНулем = "Меньше" и ИтогСумма > 0 Тогда
			ИтогСумма = 0;
		КонецЕсли;
		
		СлагаемоеНаименование = "Все субконто у которых " + ТекстСравненияПоСубконтоПредставление + " итог по счетам: " + стрВсеСчета;
		
		Если Запрос.Параметры.Свойство("мВидыДоходовРасходовНФО") и СтрЧислоВхождений(стрОтборВирт, "ГруппыФинансовогоУчетаДоходовРасходов") > 0  Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мВидыДоходовРасходовНФО Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", ", ") + эл;
			КонецЦикла;
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор по ОФР " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("мУПЦБКлассификация") и СтрЧислоВхождений(стрОтборВирт, "мУПЦБКлассификация") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мУПЦБКлассификация Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("УчетныйАктивЦБРФ") и СтрЧислоВхождений(стрОтборВирт, "УчетныйАктивЦБРФ") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.УчетныйАктивЦБРФ Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("ДополнительнаяАналитика") и СтрЧислоВхождений(стрОтборВирт, "ДополнительнаяАналитика") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.ДополнительнаяАналитика Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по дополнительной аналитике", "исключая дополнительную аналитику");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + ": " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если НЕ СтрокаСчета = Неопределено Тогда
			ЗнакОперации = "+";
			ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ИтогСумма, стрВсеСчета, , , , ИмяРаздела);
		КонецЕсли;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			//значение ячейки выставляем по итогу
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, ИтогСумма);
			//УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ СчетаСОборотнымСубконтоКонтрагенты ИЗ &ТаблицаСчетовСОбСубконто КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютТП ИЗ &КоэффициентыВалютТП КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютПП ИЗ &КоэффициентыВалютПП КАК ТЗ";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетПоКоду(Счета, флСообщитьОНеНайденномСчете = Истина)
	
	Если ТипЗнч(Счета) <> Тип("Строка") Тогда
		Возврат Неопределено;
	Иначе
		
		ПланСчетов = ПланыСчетов.Единый;
		
		СписокСчетов = Новый СписокЗначений;
		
		Счета = СтрЗаменить(Счета, " ", "");
		Счета = СтрЗаменить(Счета, ",", Символы.ПС);
		
		Для НомерСтроки = 1 По СтрЧислоСтрок(Счета) Цикл
			
			КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			СчетСсылка = ПланыСчетов.Единый.НайтиПоКоду(КодСчета);
			Если ЗначениеЗаполнено(СчетСсылка) Тогда
			
				СписокСчетов.Добавить(СчетСсылка);
			
			КонецЕсли; 
			//КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			////СчетСсылка = ПланСчетов.НайтиОсновнойПоКоду(КодСчета);
			//мСчета = УПЦБ_ЗащищенныйМодуль.НайтиОсновнойПоКоду(КодСчета, Адрес_КешТаблицаДляПоискаСчетов, СтруктураРеквизитовФормы.РегистрБухгалтерии);
			//Если мСчета.Количество() = 0 Тогда
			//	
			//	Если флСообщитьОНеНайденномСчете Тогда
			//		
			//		ТекстСообщения = СтрШаблон(
			//		НСтр("ru = 'Не удалось определить счет по коду «%1». Данные по этому счету не попадут в отчет.'"),
			//		КодСчета);
			//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//		
			//	КонецЕсли;
			//	
			//Иначе
			//	Для Каждого СчетСсылка из мСчета Цикл
			//		СписокСчетов.Добавить(СчетСсылка);
			//	КонецЦикла;
			//КонецЕсли;
			
		КонецЦикла;
		
		Возврат СписокСчетов;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы)
	
	СуммаПоСчету = 0;
	
	Если Найти(ИмяРеквизитаСуммы, "Остаток") > 0 И Найти(ИмяРеквизитаСуммы, "Развернутый") = 0 Тогда
		Если ТекСчет.Вид = ВидСчета.АктивноПассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
				Если СуммаОборотПоСчету > 0 Тогда
					СуммаПоСчету = СуммаОборотПоСчету;
				КонецЕсли;
			ИначеЕсли Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы];
				Если СуммаОборотПоСчету < 0 Тогда
					СуммаПоСчету = -СуммаОборотПоСчету;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Активный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Пассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаПоСчету = -(ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы]);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы];
	КонецЕсли;
	
	Возврат СуммаПоСчету;
	
КонецФункции

&НаСервере
Процедура ДобавитьСчетВТаблицуСчетов(ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, КодСчета, ТекстРасшифровки = "", ИмяРеквизитаСуммы = "")
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = ПолучитьСчетПоКоду(КодСчета);
	
	Если СписокСчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокСчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого эл_СписокСчетов из СписокСчетов Цикл
		
		НоваяСтрокаСчета = мТаблицаСчетов.Добавить();
		НоваяСтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		НоваяСтрокаСчета.ИмяПоказателя = ИмяПоказателя;
		НоваяСтрокаСчета.Счет = эл_СписокСчетов.Значение;
		НоваяСтрокаСчета.ЗнакОперации = ЗнакОперации;
		НоваяСтрокаСчета.ИмяСлагаемого = ИмяСлагаемого;
		НоваяСтрокаСчета.ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, КодСчета, эл_СписокСчетов.Значение);
		Если ИмяРеквизитаСуммы <> "" Тогда
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ИмяРеквизитаСуммы;
		Иначе
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода)
	
	Возврат КонсолидированнаяОтчетность.НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода);
	
КонецФункции

&НаСервере
Функция ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого)
	
	Возврат КонсолидированнаяОтчетность.ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет = Неопределено, КорСчет = Неопределено, Сдвиг = Неопределено, ПраваяГраница = Неопределено, Раздел = Неопределено)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	СтруктураПолей = Новый Структура("СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел",
	СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел);
	
	КонсолидированнаяОтчетность.ДобавитьСтрокуВРасшифровку(ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СтруктураПолей);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПоказателя(ТабДокумент, ИмяЯчейки, Знач ЗначениеЯчейки)
	
	Попытка
		Если ТипЗнч(ЗначениеЯчейки) <> Тип("Число") И ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
			ЗначениеЯчейки = Строка(ЗначениеЯчейки);
			Если СтрНайти(ТабДокумент.Области[ИмяЯчейки].Значение, ЗначениеЯчейки) = 0 И ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = ", " + ЗначениеЯчейки;
			ИначеЕсли ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = "";
			КонецЕсли;
		КонецЕсли; 
		ТабДокумент.Области[ИмяЯчейки].Значение = ТабДокумент.Области[ИмяЯчейки].Значение + ?(ЗначениеЯчейки = Null, 0,ЗначениеЯчейки);
	Исключение
		ТекстСообщения = "Ошибка заполнения раздела: " + мИмяЗаполняемогоРаздела + " не найдена ячейка " + ИмяЯчейки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьВременныеТаблицыДокумента()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВалютаДокумента"          	, СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("НачалоПериода"            	, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода"             	, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("НачалоПредыдущегоПериода" 	, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода"  	, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("грКонецПериода"           	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("грКонецПредыдущегоПериода"	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, СтруктураРеквизитовФормы.Организация);

	ЗапрашиваемыеТаблицы = Новый СписокЗначений;
	ЗапрашиваемыеТаблицы.Добавить("КоэффициентыВалют");
	ЗапрашиваемыеТаблицы.Добавить("КурсыВалютНаКонец");
	ЗапрашиваемыеТаблицы.Добавить("ТаблицаСчетовСОбСубконто");
	ЗапрашиваемыеТаблицы.Добавить("ФинансовыеОрганизации");
	
	ВременныеТаблицы = КонсолидированнаяОтчетность.ПодготовитьВременныеТаблицыДокумента(Запрос, ЗапрашиваемыеТаблицы);
	
	Для Каждого ЭлементСтруктуры из ВременныеТаблицы Цикл 
		Запрос.УстановитьПараметр(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Если ВременныеТаблицы.Свойство("ДатаПеречняТП") Тогда 
		ЭтаФорма.Комментарий = "При построении отчета использован перечень организаций финансового сектора по состоянию на " + Формат(ВременныеТаблицы.ДатаПеречняТП, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	
	Возврат Запрос;
		
КонецФункции

#КонецОбласти 

#Область ПроцедурыЗаполненияРазделов

&НаСервере
Процедура ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов)
	
	Если Адрес_КешТаблицаДляСчетовОбесценение = "" Тогда
		мКешТаблицаДляСчетовОбесценение = Новый ТаблицаЗначений;
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Строка");
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Счет");
	Иначе
		мКешТаблицаДляСчетовОбесценение = ПолучитьИзВременногоХранилища(Адрес_КешТаблицаДляСчетовОбесценение);
	КонецЕсли;
	
	Для Каждого стр_мТаблицаСчетов из мТаблицаСчетов Цикл
		стр_мКешТаблицаДляСчетовОбесценение = мКешТаблицаДляСчетовОбесценение.Добавить();
		стр_мКешТаблицаДляСчетовОбесценение.Строка = Лев(стр_мТаблицаСчетов.ИмяЯчейки, 3);
		стр_мКешТаблицаДляСчетовОбесценение.Счет = стр_мТаблицаСчетов.Счет; 
	КонецЦикла;
	
	Адрес_КешТаблицаДляСчетовОбесценение = ПоместитьВоВременноеХранилище(мКешТаблицаДляСчетовОбесценение, УникальныйИдентификатор);
	
КонецПроцедуры

// 5.1
&НаСервере
Процедура ЗаполнитьРаздел_ДенежныеСредстваСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "07");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Денежные средства в пути", "+", "!СКД", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "07");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20501", "Сальдо на конец периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П04", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20502", "Сальдо на конец периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "07");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "07");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие денежные средства", "+", "!СКД", "20802", "Сальдо на конец периода #Период# по дебету счета 20802");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "07");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие денежные средства", "+", "!СКД", "30602", "Сальдо на конец периода #Период# по дебету счета 30602");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "04", "07");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_КомпонентыДенежныхСредствИИхЭквивалентовСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в пути", "+", "!СКД", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20501", "Сальдо на конец периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20502", "Сальдо на конец периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Прочие денежные средства", "+", "!СКД", "20802", "Сальдо на конец периода #Период# по дебету счета 20802");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Прочие денежные средства", "+", "!СКД", "30602", "Сальдо на конец периода #Период# по дебету счета 30602");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	
КонецПроцедуры

// 5.4
&НаСервере
Процедура ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиДенежныхСредствСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0203", "Денежные средства в кассе", "+", "!СНД", "20202", "Сальдо на начало периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П0203", "Денежные средства в кассе", "+", "!СНД", "20203", "Сальдо на начало периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0203", "Денежные средства в пути", "+", "!СНД", "20209", "Сальдо на начало периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0203", "Денежные средства, переданные в доверительное управление", "+", "!СНД", "20501", "Сальдо на начало периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П0203", "Денежные средства, переданные в доверительное управление", "+", "!СНД", "20502", "Сальдо на начало периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0203", "Денежные средства, переданные в доверительное управление", "+", "!СНД", "47901", "Сальдо на начало периода #Период# по дебету счета 47901");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0203", "Прочие денежные средства", "+", "!СНД", "20802", "Сальдо на начало периода #Период# по дебету счета 20802");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0203", "Прочие денежные средства", "+", "!СНД", "30602", "Сальдо на начало периода #Период# по дебету счета 30602");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0703", "Денежные средства в кассе", "+", "!ДО", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П0703", "Денежные средства в кассе", "+", "!ДО", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0703", "Денежные средства в пути", "+", "!ДО", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0703", "Денежные средства, переданные в доверительное управление", "+", "!ДО", "20501", "Сальдо на конец периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П0703", "Денежные средства, переданные в доверительное управление", "+", "!ДО", "20502", "Сальдо на конец периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0703", "Денежные средства, переданные в доверительное управление", "+", "!ДО", "47901", "Сальдо на конец периода #Период# по дебету счета 47901");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0703", "Прочие денежные средства", "+", "!ДО", "20802", "Сальдо на конец периода #Период# по дебету счета 20802");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0703", "Прочие денежные средства", "+", "!ДО", "30602", "Сальдо на конец периода #Период# по дебету счета 30602");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1203", "Денежные средства в кассе", "+", "!КО", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П1203", "Денежные средства в кассе", "+", "!КО", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1203", "Денежные средства в пути", "+", "!КО", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1203", "Денежные средства, переданные в доверительное управление", "+", "!КО", "20501", "Сальдо на конец периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П1203", "Денежные средства, переданные в доверительное управление", "+", "!КО", "20502", "Сальдо на конец периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1203", "Денежные средства, переданные в доверительное управление", "+", "!КО", "47901", "Сальдо на конец периода #Период# по дебету счета 47901");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1203", "Прочие денежные средства", "+", "!КО", "20802", "Сальдо на конец периода #Период# по дебету счета 20802");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1203", "Прочие денежные средства", "+", "!КО", "30602", "Сальдо на конец периода #Период# по дебету счета 30602");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3703", "Денежные средства в кассе", "+", "!СКД", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П3703", "Денежные средства в кассе", "+", "!СКД", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3703", "Денежные средства в пути", "+", "!СКД", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3703", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20501", "Сальдо на конец периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П3703", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20502", "Сальдо на конец периода #Период# по дебету счета 20502");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3703", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3703", "Прочие денежные средства", "+", "!СКД", "20802", "Сальдо на конец периода #Период# по дебету счета 20802");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3703", "Прочие денежные средства", "+", "!СКД", "30602", "Сальдо на конец периода #Период# по дебету счета 30602");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбытокСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50104", "Сальдо на конец периода #Период# по дебету счета 50104");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50105", "Сальдо на конец периода #Период# по дебету счета 50105");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50106", "Сальдо на конец периода #Период# по дебету счета 50106");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50107", "Сальдо на конец периода #Период# по дебету счета 50107");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50108", "Сальдо на конец периода #Период# по дебету счета 50108");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50109", "Сальдо на конец периода #Период# по дебету счета 50109");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50110", "Сальдо на конец периода #Период# по дебету счета 50110");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50118", "Сальдо на конец периода #Период# по дебету счета 50118");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50122", "Сальдо на конец периода #Период# по кредиту счета 50122");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50123", "Сальдо на конец периода #Период# по кредиту счета 50123");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50124", "Сальдо на конец периода #Период# по кредиту счета 50124");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50125", "Сальдо на конец периода #Период# по кредиту счета 50125");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50126", "Сальдо на конец периода #Период# по кредиту счета 50126");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50127", "Сальдо на конец периода #Период# по кредиту счета 50127");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50128", "Сальдо на конец периода #Период# по кредиту счета 50128");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50130", "Сальдо на конец периода #Период# по кредиту счета 50130");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50131", "Сальдо на конец периода #Период# по дебету счета 50131");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50132", "Сальдо на конец периода #Период# по дебету счета 50132");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50133", "Сальдо на конец периода #Период# по дебету счета 50133");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50134", "Сальдо на конец периода #Период# по дебету счета 50134");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50135", "Сальдо на конец периода #Период# по дебету счета 50135");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50136", "Сальдо на конец периода #Период# по дебету счета 50136");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50137", "Сальдо на конец периода #Период# по дебету счета 50137");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50139", "Сальдо на конец периода #Период# по дебету счета 50139");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50150", "Сальдо на конец периода #Период# по дебету счета 50150");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50151", "Сальдо на конец периода #Период# по кредиту счета 50151");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50152", "Сальдо на конец периода #Период# по дебету счета 50152");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50153", "Сальдо на конец периода #Период# по кредиту счета 50153");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50154", "Сальдо на конец периода #Период# по дебету счета 50154");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50155", "Сальдо на конец периода #Период# по кредиту счета 50155");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50156", "Сальдо на конец периода #Период# по дебету счета 50156");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50157", "Сальдо на конец периода #Период# по кредиту счета 50157");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50158", "Сальдо на конец периода #Период# по дебету счета 50158");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50159", "Сальдо на конец периода #Период# по кредиту счета 50159");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50160", "Сальдо на конец периода #Период# по дебету счета 50160");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50161", "Сальдо на конец периода #Период# по кредиту счета 50161");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50162", "Сальдо на конец периода #Период# по дебету счета 50162");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50163", "Сальдо на конец периода #Период# по кредиту счета 50163");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50167", "Сальдо на конец периода #Период# по кредиту счета 50167");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51211", "Сальдо на конец периода #Период# по дебету счета 51211");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51212", "Сальдо на конец периода #Период# по дебету счета 51212");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51213", "Сальдо на конец периода #Период# по дебету счета 51213");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51214", "Сальдо на конец периода #Период# по дебету счета 51214");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51215", "Сальдо на конец периода #Период# по дебету счета 51215");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51216", "Сальдо на конец периода #Период# по дебету счета 51216");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51217", "Сальдо на конец периода #Период# по дебету счета 51217");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51218", "Сальдо на конец периода #Период# по кредиту счета 51218");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51219", "Сальдо на конец периода #Период# по кредиту счета 51219");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51220", "Сальдо на конец периода #Период# по кредиту счета 51220");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51221", "Сальдо на конец периода #Период# по кредиту счета 51221");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51222", "Сальдо на конец периода #Период# по кредиту счета 51222");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51223", "Сальдо на конец периода #Период# по кредиту счета 51223");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51224", "Сальдо на конец периода #Период# по кредиту счета 51224");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51225", "Сальдо на конец периода #Период# по дебету счета 51225");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51226", "Сальдо на конец периода #Период# по дебету счета 51226");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51227", "Сальдо на конец периода #Период# по дебету счета 51227");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51228", "Сальдо на конец периода #Период# по дебету счета 51228");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51229", "Сальдо на конец периода #Период# по дебету счета 51229");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51230", "Сальдо на конец периода #Период# по дебету счета 51230");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51231", "Сальдо на конец периода #Период# по дебету счета 51231");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51250", "Сальдо на конец периода #Период# по дебету счета 51250");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51251", "Сальдо на конец периода #Период# по кредиту счета 51251");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51252", "Сальдо на конец периода #Период# по дебету счета 51252");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51253", "Сальдо на конец периода #Период# по кредиту счета 51253");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51254", "Сальдо на конец периода #Период# по дебету счета 51254");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51255", "Сальдо на конец периода #Период# по кредиту счета 51255");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51256", "Сальдо на конец периода #Период# по дебету счета 51256");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51257", "Сальдо на конец периода #Период# по кредиту счета 51257");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51258", "Сальдо на конец периода #Период# по дебету счета 51258");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51259", "Сальдо на конец периода #Период# по кредиту счета 51259");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51260", "Сальдо на конец периода #Период# по дебету счета 51260");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51261", "Сальдо на конец периода #Период# по кредиту счета 51261");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51262", "Сальдо на конец периода #Период# по дебету счета 51262");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51263", "Сальдо на конец периода #Период# по кредиту счета 51263");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50605", "Сальдо на конец периода #Период# по дебету счета 50605");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50606", "Сальдо на конец периода #Период# по дебету счета 50606");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50607", "Сальдо на конец периода #Период# по дебету счета 50607");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50608", "Сальдо на конец периода #Период# по дебету счета 50608");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50618", "Сальдо на конец периода #Период# по дебету счета 50618");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50622", "Сальдо на конец периода #Период# по кредиту счета 50622");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50623", "Сальдо на конец периода #Период# по кредиту счета 50623");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50624", "Сальдо на конец периода #Период# по кредиту счета 50624");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50625", "Сальдо на конец периода #Период# по кредиту счета 50625");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50626", "Сальдо на конец периода #Период# по кредиту счета 50626");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50627", "Сальдо на конец периода #Период# по дебету счета 50627");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50628", "Сальдо на конец периода #Период# по дебету счета 50628");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50629", "Сальдо на конец периода #Период# по дебету счета 50629");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50630", "Сальдо на конец периода #Период# по дебету счета 50630");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50631", "Сальдо на конец периода #Период# по дебету счета 50631");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50166", "Сальдо на конец периода #Период# по дебету счета 50166");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50670", "Сальдо на конец периода #Период# по дебету счета 50670");
	ДобавитьСчетВТаблицуСчетов("П01", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50671", "Сальдо на конец периода #Период# по кредиту счета 50671");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20315", "Сальдо на конец периода #Период# по дебету счета 20315");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20322", "Сальдо на конец периода #Период# по дебету счета 20322");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20324", "Сальдо на конец периода #Период# по дебету счета 20324");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20325", "Сальдо на конец периода #Период# по кредиту счета 20325");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20601", "Сальдо на конец периода #Период# по дебету счета 20601");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20602", "Сальдо на конец периода #Период# по дебету счета 20602");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20605", "Сальдо на конец периода #Период# по кредиту счета 20605");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20607", "Сальдо на конец периода #Период# по дебету счета 20607");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20609", "Сальдо на конец периода #Период# по дебету счета 20609");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20611", "Сальдо на конец периода #Период# по кредиту счета 20611");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20613", "Сальдо на конец периода #Период# по кредиту счета 20613");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20316", "Сальдо на конец периода #Период# по дебету счета 20316");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20323", "Сальдо на конец периода #Период# по дебету счета 20323");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20326", "Сальдо на конец периода #Период# по дебету счета 20326");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20327", "Сальдо на конец периода #Период# по кредиту счета 20327");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20604", "Сальдо на конец периода #Период# по дебету счета 20604");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20606", "Сальдо на конец периода #Период# по кредиту счета 20606");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20608", "Сальдо на конец периода #Период# по дебету счета 20608");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20610", "Сальдо на конец периода #Период# по дебету счета 20610");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20612", "Сальдо на конец периода #Период# по кредиту счета 20612");
	ДобавитьСчетВТаблицуСчетов("П05", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20614", "Сальдо на конец периода #Период# по кредиту счета 20614");
	стрОтборВирт = "";//СтруктураПеременныхДляОтбора.ДепозитныйВклад;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , ,стрОтборВирт);
	
КонецПроцедуры

// 6.2
&НаСервере
Процедура ЗаполнитьРаздел_ЦенныеБумагиПоСправедливойСтоимостиЧерезПрибыльУбытокСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	Запрос.Выполнить();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	СчетаУчетаЦенныхБумаг = КонсолидированнаяОтчетность.ПолучитьСчетаУчетаЦенныхБумаг();
	
	Запрос.УстановитьПараметр("СчетаДолговых", СчетаУчетаЦенныхБумаг.СчетаДолговых);
	Запрос.УстановитьПараметр("СчетаДолевых", СчетаУчетаЦенныхБумаг.СчетаДолевых);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Актив,
	               |	ЕСТЬNULL(Эмитенты.ЮрФизЛицо, РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо) КАК ЮрФизЛицо,
	               |	ЕдиныйБухгалтерскийУчетОстатки.Счет,
	               |	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК Сумма
	               |ПОМЕСТИТЬ _ЕдиныйБухгалтерскийУчетОстатки
	               |ИЗ
	               |	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	               |			&грКонецПериода,
	               |			Счет В (&СчетаДолевых, &СчетаДолговых),
	               |			,
	               |			Организация = &Организация
	               |				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
	               |		ПО (ВЫБОР
	               |				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
	               |					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент
	               |				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
	               |					ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент
	               |			КОНЕЦ = Эмитенты.Ссылка)				   
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
				   |		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПеречниОбъектов.Объект,
	               |	ПеречниОбъектов.ВидПеречня
	               |ПОМЕСТИТЬ _ПеречниОбъектов
	               |ИЗ
	               |	РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
	               |ГДЕ
	               |	ПеречниОбъектов.Включен
	               |	И НЕ ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ИнвестиционныеФонды)
	               |	И ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
	               |			И ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора)
	               |			И ПеречниОбъектов.Объект В
	               |				(ВЫБРАТЬ
	               |					_ЕдиныйБухгалтерскийУчетОстатки.ЮрФизЛицо
	               |				ИЗ
	               |					_ЕдиныйБухгалтерскийУчетОстатки КАК _ЕдиныйБухгалтерскийУчетОстатки)
	               |	И ПеречниОбъектов.Период = &ДатаПеречняТП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	_ПеречниОбъектов.Объект,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПеречниОбъектов.ВидПеречня) КАК ВидПеречня
	               |ПОМЕСТИТЬ _ОрганизацииВходящиеВНесколькоСекторов
	               |ИЗ
	               |	_ПеречниОбъектов КАК _ПеречниОбъектов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_ПеречниОбъектов.Объект
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПеречниОбъектов.ВидПеречня) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	_ЕдиныйБухгалтерскийУчетОстатки.Актив,
	               |	_ЕдиныйБухгалтерскийУчетОстатки.ЮрФизЛицо,
	               |	ВЫБОР
	               |		КОГДА _ЕдиныйБухгалтерскийУчетОстатки.ЮрФизЛицо В
	               |				(ВЫБРАТЬ
	               |					_ОрганизацииВходящиеВНесколькоСекторов.Объект
	               |				ИЗ
	               |					_ОрганизацииВходящиеВНесколькоСекторов КАК _ОрганизацииВходящиеВНесколькоСекторов)
	               |			ТОГДА """"
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА _ЕдиныйБухгалтерскийУчетОстатки.Счет В (&СчетаДолевых)
	               |					ТОГДА ВЫБОР
	               |							КОГДА _ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_КредитныеОрганизации)
	               |								ТОГДА ""П02""
	               |							КОГДА _ПеречниОбъектов.ВидПеречня ЕСТЬ NULL 
	               |								ТОГДА ""П04""
	               |							ИНАЧЕ ""П03""
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ВЫРАЗИТЬ(_ЕдиныйБухгалтерскийУчетОстатки.Актив КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
	               |							ТОГДА ""П06""
	               |						КОГДА ВЫРАЗИТЬ(_ЕдиныйБухгалтерскийУчетОстатки.Актив КАК Справочник.Облигации).Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная), _ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная))
	               |							ТОГДА ""П07""
	               |						КОГДА ВЫРАЗИТЬ(_ЕдиныйБухгалтерскийУчетОстатки.Актив КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
	               |							ТОГДА ""П08""
	               |						КОГДА _ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_КредитныеОрганизации)
	               |							ТОГДА ""П09""
	               |						КОГДА _ПеречниОбъектов.ВидПеречня ЕСТЬ NULL 
	               |							ТОГДА ""П11""
	               |						ИНАЧЕ ""П10""
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК НомерСтроки,
	               |	_ЕдиныйБухгалтерскийУчетОстатки.Сумма
	               |ПОМЕСТИТЬ _ИтоговаяТаблица
	               |ИЗ
	               |	_ЕдиныйБухгалтерскийУчетОстатки КАК _ЕдиныйБухгалтерскийУчетОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _ПеречниОбъектов КАК _ПеречниОбъектов
	               |		ПО _ЕдиныйБухгалтерскийУчетОстатки.ЮрФизЛицо = _ПеречниОбъектов.Объект
	               |			И (НЕ _ПеречниОбъектов.Объект В
	               |					(ВЫБРАТЬ
	               |						_ОрганизацииВходящиеВНесколькоСекторов.Объект
	               |					ИЗ
	               |						_ОрганизацииВходящиеВНесколькоСекторов КАК _ОрганизацииВходящиеВНесколькоСекторов))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	_ИтоговаяТаблица.Актив,
	               |	_ИтоговаяТаблица.ЮрФизЛицо,
	               |	_ИтоговаяТаблица.НомерСтроки,
	               |	СУММА(_ИтоговаяТаблица.Сумма) КАК Сумма
	               |ИЗ
	               |	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_ИтоговаяТаблица.НомерСтроки,
	               |	_ИтоговаяТаблица.ЮрФизЛицо,
	               |	_ИтоговаяТаблица.Актив
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ _ЕдиныйБухгалтерскийУчетОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ _ПеречниОбъектов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ _ОрганизацииВходящиеВНесколькоСекторов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ _ИтоговаяТаблица";
				   
	мТаблицаСчетов.Очистить();
	
	
	Для НомерЦикла = 1 По 2 Цикл
		
		Если НомерЦикла = 1 Тогда
			НомерКолонки = "02";
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КонецПериода", "&КонецПредыдущегоПериода");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПеречняТП", "&ДатаПеречняПП");
			
			НомерКолонки = "03";
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
			
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.НомерСтроки = "" Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для ценной бумаги " + Выборка.Актив + " не удалось определеить сектор экономики. Бумага пропущена");
				
			Иначе
				
				НоваяСтрока = мТаблицаСчетов.Добавить();
				НоваяСтрока.ИмяЯчейки = Выборка.НомерСтроки + НомерКолонки;
				НоваяСтрока.Сумма = Выборка.Сумма;
				
			КонецЕсли; 
			
		КонецЦикла;	
				
	КонецЦикла;
	
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_РеклассификацияПоСправедливойСтоимостиЧерезПрибыльУбытокСервер(ТекРаздел, ИмяРаздела)
	
	//мИмяЗаполняемогоРаздела = ИмяРаздела;
	//
	//мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	//
	//Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	//ТекРаздел.Области.ТекущийПериод.Значение    = мПредставлениеТекущегоПериода;
	//ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
КонецПроцедуры

// 10.1 
&НаСервере
Процедура ЗаполнитьРаздел_ДепозитыИСредстваВКредитныхОрганизацияхСервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	// Только кредитные организации и банки-нерезиденты
	стрОтборКредитныеОрганизации = " И ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "05", , , , стрОтборКредитныеОрганизации);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "06", , , , стрОтборКредитныеОрганизации);
	
КонецПроцедуры

// 10.2 
&НаСервере
Процедура ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиДепозитовИПрочихСредствСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	// Только кредитные организации и банки-нерезиденты
	стрОтборКредитныеОрганизации = " И ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47010", "Сальдо на начало периода #Период# по дебету счета 47010 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47011", "Сальдо на начало периода #Период# по дебету счета 47011 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СНК", "47018", "Сальдо на начало периода #Период# по кредиту счета 47018 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47019", "Сальдо на начало периода #Период# по дебету счета 47019 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47010", "Оборот за период #Период# по дебету счета 47010 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47011", "Оборот за период #Период# по дебету счета 47011 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47018", "Оборот за период #Период# по кредиту счета 47018 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47019", "Оборот за период #Период# по дебету счета 47019 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47010", "Оборот за период #Период# по кредиту счета 47010 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47011", "Оборот за период #Период# по кредиту счета 47011 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47018", "Оборот за период #Период# по дебету счета 47018 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47019", "Оборот за период #Период# по кредиту счета 47019 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
КонецПроцедуры

// 10.3 
&НаСервере
Процедура ЗаполнитьРаздел_ВыверкаИзмененийУбыткаОтОбесцененияДепозитовИПрочихСредствСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	// Только кредитные организации и банки-нерезиденты
	стрОтборКредитныеОрганизации = " И ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СНК", "47017", "Сальдо на начало периода #Период# по кредиту счета 47017 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47017", "Оборот за период #Период# по кредиту счета 47017 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47017", "Оборот за период #Период# по дебету счета 47017 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации);
	
КонецПроцедуры

// 10.4 
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашенияСервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО) КАК СтавкаМакс,
		|	МИНИМУМ(УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО) КАК СтавкаМин,
		|	МАКСИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМакс,
		|	МИНИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМин,
		|	МАКСИМУМ(УсловияСделокРЕПОСрезПоследнихП.СтавкаРЕПО) КАК СтавкаМаксП,
		|	МИНИМУМ(УсловияСделокРЕПОСрезПоследнихП.СтавкаРЕПО) КАК СтавкаМинП,
		|	МАКСИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследнихП.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследнихП.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМаксП,
		|	МИНИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследнихП.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследнихП.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМинП
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЧастьСделкиРЕПО = 1
		|				И СделкаРЕПО.Дата <= &КонецПериода
		|				И ДатаВторойЧастиРЕПО > &КонецПериода
		|				И &ТолькоКредитныеОрганизации) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПредыдущегоПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЧастьСделкиРЕПО = 1
		|					И СделкаРЕПО.Дата <= &КонецПредыдущегоПериода
		|					И ДатаВторойЧастиРЕПО > &КонецПредыдущегоПериода
		|					И &ТолькоКредитныеОрганизации) КАК УсловияСделокРЕПОСрезПоследнихП
		|		ПО (ИСТИНА)";
	
	// Только кредитные организации и банки-нерезиденты  
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", "СделкаРЕПО.СделкаСЦентральнымКонтрагентом = ИСТИНА");  	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат[0].СтавкаМин <> NULL Тогда  
		УстановитьЗначениеПоказателя(ТекРаздел, "П0402", Строка(Результат[0].СтавкаМин) + "% - " + Строка(Результат[0].СтавкаМакс) + "%");
		УстановитьЗначениеПоказателя(ТекРаздел, "П0403", Строка(Результат[0].ИнтервалМин) + " д. - " + Строка(Результат[0].ИнтервалМакс) + " д.");
	КонецЕсли;		
	
	Если Результат[0].СтавкаМинП <> NULL Тогда  
		УстановитьЗначениеПоказателя(ТекРаздел, "П0404", Строка(Результат[0].СтавкаМинП) + "% - " + Строка(Результат[0].СтавкаМаксП) + "%");
		УстановитьЗначениеПоказателя(ТекРаздел, "П0405", Строка(Результат[0].ИнтервалМинП) + " д. - " + Строка(Результат[0].ИнтервалМаксП) + " д.");
	КонецЕсли;

КонецПроцедуры

// 11.1
&НаСервере
Процедура ЗаполнитьРаздел_ПрочиеРазмещенныеСредстваДЗСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	// Исключая кредитные организации и банки-нерезиденты
	стрОтборКредитныеОрганизации_НЕ = " И ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	стрОтборБанкроты = " ГДЕ (Счет.Код НЕ В (""47423"",""47425"") ИЛИ Субконто1 В (&Банкроты))";	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П03", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П03", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П03", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "05", , , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "06", , , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКД", "47408", "Сальдо на конец периода #Период# по дебету счета 47408");
	ДобавитьСчетВТаблицуСчетов("П04", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКД", "50905", "Сальдо на конец периода #Период# по дебету счета 50905");
	ДобавитьСчетВТаблицуСчетов("П04", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКД", "50906", "Сальдо на конец периода #Период# по дебету счета 50906");
	ДобавитьСчетВТаблицуСчетов("П04", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "-", "!СКК", "50907", "Сальдо на конец периода #Период# по кредиту счета 50907");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "05");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "-", "!СКК", "50908", "Сальдо на конец периода #Период# по кредиту счета 50908");
	ДобавитьСчетВТаблицуСчетов("П04", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "-", "!СКК", "30607", "Сальдо на конец периода #Период# по кредиту счета 30607");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "06");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П06", "Расчеты по начисленным доходам по акциям, долям, паям", "+", "!СКД", "60347", "Сальдо на конец периода #Период# по дебету счета 60347");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "05");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П07", "Прочее", "-", "!СКК", "60324", "Сальдо на конец периода #Период# по кредиту счета 60324");
	ДобавитьСчетВТаблицуСчетов("П07", "Прочее", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "05", , , стрОтборБанкроты);
		
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П07", "Прочее", "-", "!СКК", "60324", "Сальдо на конец периода #Период# по кредиту счета 60324");
	ДобавитьСчетВТаблицуСчетов("П07", "Прочее", "+", "!СКК", "47425", "Сальдо на конец периода #Период# по кредиту счета 47425 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "06", , , стрОтборБанкроты);
	
КонецПроцедуры

// 11.2
&НаСервере
Процедура ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиПрочихРазмещенныхСредствИДЗСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	стрОтборБанкроты	= " И Субконто1 В (&Банкроты)";	
	стрОтборБанкроты_НЕ	= " И Субконто1 НЕ В (&Банкроты)";	
	
	// Исключая кредитные организации и банки-нерезиденты  
	стрОтборКредитныеОрганизации_НЕ = " И ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47010", "Сальдо на начало периода #Период# по дебету счета 47010 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47011", "Сальдо на начало периода #Период# по дебету счета 47011 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СНК", "47018", "Сальдо на начало периода #Период# по кредиту счета 47018 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47019", "Сальдо на начало периода #Период# по дебету счета 47019 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47408", "Сальдо на начало периода #Период# по дебету счета 47408");
	ДобавитьСчетВТаблицуСчетов("П0205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "50905", "Сальдо на начало периода #Период# по дебету счета 50905");
	ДобавитьСчетВТаблицуСчетов("П0205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "50906", "Сальдо на начало периода #Период# по дебету счета 50906");
	ДобавитьСчетВТаблицуСчетов("П0205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СНК", "50907", "Сальдо на начало периода #Период# по кредиту счета 50907");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0207", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНД", "47423", "Сальдо на начало периода #Период# по дебету счета 47423 (кроме банкротов)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0507", "кредитно-обесцененные финансовые активы", "+", "!СНД", "47423", "Сальдо на начало периода #Период# по дебету счета 47423 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47010", "Оборот за период #Период# по дебету счета 47010 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47011", "Оборот за период #Период# по дебету счета 47011 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47018", "Оборот за период #Период# по кредиту счета 47018 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47019", "Оборот за период #Период# по дебету счета 47019 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47408", "Оборот за период #Период# по дебету счета 47408");
	ДобавитьСчетВТаблицуСчетов("П0705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "50905", "Оборот за период #Период# по дебету счета 50905");
	ДобавитьСчетВТаблицуСчетов("П0705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "50906", "Оборот за период #Период# по дебету счета 50906");
	ДобавитьСчетВТаблицуСчетов("П0705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "50907", "Оборот за период #Период# по кредиту счета 50907");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0707", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47423", "Оборот за период #Период# по дебету счета 47423 (кроме банкротов)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1007", "кредитно-обесцененные финансовые активы", "+", "!ДО", "47423", "Оборот за период #Период# по дебету счета 47423 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47408", "Оборот за период #Период# по кредиту счета 47408");
	ДобавитьСчетВТаблицуСчетов("П1205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "50905", "Оборот за период #Период# по кредиту счета 50905");
	ДобавитьСчетВТаблицуСчетов("П1205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "50906", "Оборот за период #Период# по кредиту счета 50906");
	ДобавитьСчетВТаблицуСчетов("П1205", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "50907", "Оборот за период #Период# по кредиту счета 50907");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1207", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47423", "Оборот за период #Период# по кредиту счета 47423 (кроме банкротов)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты_НЕ);

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1507", "кредитно-обесцененные финансовые активы", "+", "!КО", "47423", "Оборот за период #Период# по кредиту счета 47423 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47010", "Оборот за период #Период# по кредиту счета 47010 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47011", "Оборот за период #Период# по кредиту счета 47011 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47018", "Оборот за период #Период# по кредиту счета 47018 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47019", "Оборот за период #Период# по кредиту счета 47019 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47408", "Сальдо на конец периода #Период# по дебету счета 47408");
	ДобавитьСчетВТаблицуСчетов("П3705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "50905", "Сальдо на конец периода #Период# по дебету счета 50905");
	ДобавитьСчетВТаблицуСчетов("П3705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "50906", "Сальдо на конец периода #Период# по дебету счета 50906");
	ДобавитьСчетВТаблицуСчетов("П3705", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "-", "!СКК", "50907", "Сальдо на конец периода #Период# по кредиту счета 50907");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3707", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 (кроме банкротов)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П4007", "кредитно-обесцененные финансовые активы", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	//ТекРаздел.Области.ТекущийПериод.Значение    = мПредставлениеТекущегоПериода;
	//ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
КонецПроцедуры

// 11.3
&НаСервере
Процедура ЗаполнитьРаздел_ВыверкаИзмененийРезерваПодОбесценениеПрочихРазмещенныхСредствИДЗСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	стрОтборБанкроты	= " И Субконто1 В (&Банкроты)";	
	
	// Исключая кредитные организации и банки-нерезиденты  
	стрОтборКредитныеОрганизации_НЕ = " И ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0204", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СНК", "47017", "Сальдо на начало периода #Период# по кредиту счета 47017 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0507", "кредитно-обесцененные финансовые активы", "+", "!СНК", "47425", "Сальдо на начало периода #Период# по дебету счета 47425 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаНачало", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!КО", "47017", "Оборот за период #Период# по кредиту счета 47017 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1007", "кредитно-обесцененные финансовые активы", "+", "!КО", "47425", "Оборот за период #Период# по кредиту счета 47425 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1507", "кредитно-обесцененные финансовые активы", "+", "!ДО", "47425", "Оборот за период #Период# по кредиту счета 47425 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!ДО", "47017", "Оборот за период #Период# по кредиту счета 47017 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "Оборот", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П3704", "финансовые активы, кредитные убытки по которым ожидаются в течение 12 месяцев", "+", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П4007", "кредитно-обесцененные финансовые активы", "+", "!СКК", "47425", "Сальдо на конец периода #Период# по дебету счета 47425 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , стрОтборБанкроты);
	
	//ТекРаздел.Области.ТекущийПериод.Значение    = мПредставлениеТекущегоПериода;
	//ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
КонецПроцедуры

// 11.4
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияОПлатежахКПолучениюПоФинансовойАрендеСервер(ТекРаздел, ИмяРаздела)
	
	//мИмяЗаполняемогоРаздела = ИмяРаздела;
	//
	//мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	//
	//Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	//ТекРаздел.Области.ТекущийПериод.Значение    = мПредставлениеТекущегоПериода;
	//ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
КонецПроцедуры

// 26.1
&НаСервере     
Процедура ЗаполнитьРаздел_ПрочаяКредиторскаяЗадолженностьСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "47407", "Сальдо на конец периода #Период# по кредиту счета 47407");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "60311", "Сальдо на конец периода #Период# по кредиту счета 60311");
	ДобавитьСчетВТаблицуСчетов("П02", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "60313", "Сальдо на конец периода #Период# по кредиту счета 60313");
	ДобавитьСчетВТаблицуСчетов("П02", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "31002", "Сальдо на конец периода #Период# по кредиту счета 31002");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Расчеты с прочими кредиторами", "+", "!СКК", "60322", "Сальдо на конец периода #Период# по кредиту счета 60322");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
 	ДобавитьСчетВТаблицуСчетов("П04", "Прочее", "+", "!СКК", "47422", "Сальдо на конец периода #Период# по кредиту счета 47422");
	ДобавитьСчетВТаблицуСчетов("П04", "Прочее", "+", "!СКК", "47416", "Сальдо на конец периода #Период# по кредиту счета 47416");
 	ДобавитьСчетВТаблицуСчетов("П04", "Прочее", "+", "!СКК", "47903", "Сальдо на конец периода #Период# по кредиту счета 47903");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	
	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П04", "Прочее", "-", "!КО", "47903", "Оборот по кредиту счета 47903 в корреспонденции со счетами 7 раздела, исключая дополнительную аналитику ""Вознаграждение управляющего""");
	//ДополнительнаяАналитика = Новый Массив;
	//ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	//Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , СтруктураПеременныхДляОтбора.ДополнительнаяАналитика_НЕ, "710, 715, 717, 718", , "КорСчет В Иерархии (&СписокКорСчетов)");

	//мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П04", "Прочее", "+", "!ДО", "47903", "Оборот по дебету счета 47903 в корреспонденции со счетами 7 раздела, исключая дополнительную аналитику ""Вознаграждение управляющего""");
	//ДополнительнаяАналитика = Новый Массив;
	//ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	//Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	//ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , СтруктураПеременныхДляОтбора.ДополнительнаяАналитика_НЕ, "710, 715, 717, 718", , "КорСчет В Иерархии (&СписокКорСчетов)");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел_НераспределеннаяПрибыльСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71001", "Оборот по кредиту счета 71001, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71002", "Оборот по кредиту счета 71002, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71003", "Оборот по дебету счета 71003, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71004", "Оборот по дебету счета 71004, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71005", "Оборот по кредиту счета 71005, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71006", "Оборот по дебету счета 71006, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71501", "Оборот по кредиту счета 71501, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71502", "Оборот по дебету счета 71502, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71503", "Оборот по кредиту счета 71503, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71504", "Оборот по дебету счета 71504, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71505", "Оборот по кредиту счета 71505, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71506", "Оборот по дебету счета 71506, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71507", "Оборот по кредиту счета 71507, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71508", "Оборот по дебету счета 71508, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71509", "Оборот по кредиту счета 71509, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71510", "Оборот по дебету счета 71510, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71511", "Оборот по кредиту счета 71511, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71512", "Оборот по дебету счета 71512, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71513", "Оборот по кредиту счета 71513, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71514", "Оборот по дебету счета 71514, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71701", "Оборот по кредиту счета 71701, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71702", "Оборот по дебету счета 71702, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71801", "Оборот по кредиту счета 71801, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71802", "Оборот по дебету счета 71802, за исключением оборотов со счетом 47903");
	
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , , "47903", , "НЕ КорСчет В Иерархии (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71801", "Оборот по кредиту счета 71801 в корреспонденции со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71802", "Оборот по дебету счета 71802 в корреспонденции со счетом 47903");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика, "47903", , "КорСчет В Иерархии (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71001", "Оборот по дебету счета 71001, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71002", "Оборот по дебету счета 71002, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71003", "Оборот по кредиту счета 71003, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71004", "Оборот по кредиту счета 71004, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71005", "Оборот по дебету счета 71005, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71006", "Оборот по кредиту счета 71006, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71501", "Оборот по дебету счета 71501, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71502", "Оборот по кредиту счета 71502, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71503", "Оборот по дебету счета 71503, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71504", "Оборот по кредиту счета 71504, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71505", "Оборот по дебету счета 71505, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71506", "Оборот по кредиту счета 71506, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71507", "Оборот по дебету счета 71507, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71508", "Оборот по кредиту счета 71508, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71509", "Оборот по дебету счета 71509, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71510", "Оборот по кредиту счета 71510, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71511", "Оборот по дебету счета 71511, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71512", "Оборот по кредиту счета 71512, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71513", "Оборот по дебету счета 71513, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71514", "Оборот по кредиту счета 71514, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71701", "Оборот по дебету счета 71701, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71702", "Оборот по кредиту счета 71702, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71801", "Оборот по дебету счета 71801, за исключением оборотов со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71802", "Оборот по кредиту счета 71802, за исключением оборотов со счетом 47903");
	
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , , "47903", , "НЕ КорСчет В Иерархии (&СписокКорСчетов)");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71801", "Оборот по дебету счета 71801 в корреспонденции со счетом 47903");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71802", "Оборот по кредиту счета 71802 в корреспонденции со счетом 47903");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , СтруктураПеременныхДляОтбора.КорДополнительнаяАналитика, "47903", , "КорСчет В Иерархии (&СписокКорСчетов)");
	
	//
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Прочее", "-", "!КО", "47903", "Оборот по кредиту счета 47903 в корреспонденции со счетами 7 раздела, исключая дополнительную аналитику ""Вознаграждение управляющего""");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , СтруктураПеременныхДляОтбора.ДополнительнаяАналитика_НЕ, "710, 715, 717, 718", , "КорСчет В Иерархии (&СписокКорСчетов)");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Прочее", "+", "!ДО", "47903", "Оборот по дебету счета 47903 в корреспонденции со счетами 7 раздела, исключая дополнительную аналитику ""Вознаграждение управляющего""");
	ДополнительнаяАналитика = Новый Массив;
	ДополнительнаяАналитика.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , СтруктураПеременныхДляОтбора.ДополнительнаяАналитика_НЕ, "710, 715, 717, 718", , "КорСчет В Иерархии (&СписокКорСчетов)");

		
КонецПроцедуры

// 57.11
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияОКредитныхРейтингахДолговыхИнструментовСервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Депозиты.Сумма КАК Сумма,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Депозиты.Банк) КАК Банк,
		|	Депозиты.ЭтоМНО КАК ЭтоМНО,
		|	Депозиты.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Депозиты
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК Сумма,
		|		ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОНЕЦ КАК Банк,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица КАК ЭтоМНО,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК Депозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&КонецПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Депозиты.Банк = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, ЦенныеБумаги.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ЦенныеБумаги.Эмитент) КАК Эмитент,
		|	ЦенныеБумаги.Облигация КАК Облигация,
		|	ЦенныеБумаги.Сумма КАК Сумма,
		|	ЦенныеБумаги.РазделОтчета КАК РазделОтчета
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ КАК УчетныйАктивЦБРФ,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо КАК Эмитент,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) КАК Облигация,
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК Сумма,
		|		1 КАК РазделОтчета
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО ЦенныеБумаги.Эмитент = ПереопределенияАктивов.Эмитент
		|			И ЦенныеБумаги.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&КонецПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО ЦенныеБумаги.Эмитент = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.Субъект КАК Субъект,
		|	РейтингиСрезПоследних.Шкала.ТипШкалы КАК ТипШкалы,
		|	РейтингиСрезПоследних.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	РейтингиСрезПоследних.Шкала КАК Шкала,
		|	РейтингиСрезПоследних.ЗначениеРейтинга КАК ЗначениеРейтинга,
		|	ЕСТЬNULL(СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления, 5) КАК СтрокаСопоставления,
		|	РейтингиСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ _РейтингиСрезПоследних
		|ИЗ
		|	РегистрСведений.Рейтинги.СрезПоследних(
		|			&КонецПериода,
		|			Субъект В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.Облигация
		|					ИЗ
		|						_ЦенныеБумаги КАК _ЦенныеБумаги
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						_ЦенныеБумаги.Эмитент
		|					ИЗ
		|						_ЦенныеБумаги КАК _ЦенныеБумаги
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						_Депозиты.Банк
		|					ИЗ
		|						_Депозиты КАК _Депозиты)
		|				И (Шкала.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ Шкала.ДатаПереходаВАрхив > &КонецПериода)) КАК РейтингиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&КонецПериода, Источник = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПереченьЦБ_РФДляОтчетности)) КАК СопоставлениеРейтинговыхШкалСрезПоследних
		|		ПО РейтингиСрезПоследних.Шкала = СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная
		|			И (РейтингиСрезПоследних.ЗначениеРейтинга.Оценка МЕЖДУ СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМаксимальное.Оценка И СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное.Оценка)
		|ГДЕ
		|	(РейтингиСрезПоследних.ДатаПереходаВАрхив > &КонецПериода
		|			ИЛИ РейтингиСрезПоследних.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|	И (РейтингиСрезПоследних.ЗначениеРейтинга.ДатаПереходаВАрхив > &КонецПериода
		|			ИЛИ РейтингиСрезПоследних.ЗначениеРейтинга.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|
		|СГРУППИРОВАТЬ ПО
		|	РейтингиСрезПоследних.Субъект,
		|	РейтингиСрезПоследних.Шкала.ТипШкалы,
		|	РейтингиСрезПоследних.РейтинговоеАгентство,
		|	РейтингиСрезПоследних.Шкала,
		|	РейтингиСрезПоследних.ЗначениеРейтинга,
		|	ЕСТЬNULL(СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления, 5),
		|	РейтингиСрезПоследних.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РейтингиСрезПоследних.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.АКРА)
		|			ТОГДА 1
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX)
		|			ТОГДА 2
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.FitchRatings)
		|			ТОГДА 3
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.Moodys)
		|			ТОГДА 4
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.StandardAndPoors)
		|			ТОГДА 5
		|	КОНЕЦ КАК ПриоритетРейтинговогоАгентства
		|ПОМЕСТИТЬ _ПриоритетыРейтинговыхАгентств
		|ИЗ
		|	_РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Субъект КАК Субъект,
		|	ВложенныйЗапрос.СтрокаСопоставления КАК СтрокаСопоставления,
		|	_РейтингиСрезПоследних.Шкала КАК Шкала
		|ПОМЕСТИТЬ _Рейтинги
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СтрокиСМаксимальнымРейтингом.Субъект КАК Субъект,
		|		_СтрокиСМаксимальнымРейтингом.ТипШкалы КАК ТипШкалы,
		|		_СтрокиСМаксимальнымРейтингом.СтрокаСопоставления КАК СтрокаСопоставления,
		|		МИНИМУМ(_ПриоритетыРейтинговыхАгентств.ПриоритетРейтинговогоАгентства) КАК ПриоритетРейтинговогоАгентства
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_РейтингиСрезПоследних.Субъект КАК Субъект,
		|			_РейтингиСрезПоследних.ТипШкалы КАК ТипШкалы,
		|			МИНИМУМ(_РейтингиСрезПоследних.СтрокаСопоставления) КАК СтрокаСопоставления
		|		ИЗ
		|			_РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|		ГДЕ
		|			НЕ _РейтингиСрезПоследних.ЗначениеРейтинга.РейтингСнят
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_РейтингиСрезПоследних.Субъект,
		|			_РейтингиСрезПоследних.ТипШкалы) КАК _СтрокиСМаксимальнымРейтингом
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПриоритетыРейтинговыхАгентств КАК _ПриоритетыРейтинговыхАгентств
		|				ПО _РейтингиСрезПоследних.РейтинговоеАгентство = _ПриоритетыРейтинговыхАгентств.РейтинговоеАгентство
		|			ПО _СтрокиСМаксимальнымРейтингом.Субъект = _РейтингиСрезПоследних.Субъект
		|				И _СтрокиСМаксимальнымРейтингом.ТипШкалы = _РейтингиСрезПоследних.ТипШкалы
		|				И _СтрокиСМаксимальнымРейтингом.СтрокаСопоставления = _РейтингиСрезПоследних.СтрокаСопоставления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СтрокиСМаксимальнымРейтингом.Субъект,
		|		_СтрокиСМаксимальнымРейтингом.ТипШкалы,
		|		_СтрокиСМаксимальнымРейтингом.СтрокаСопоставления) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПриоритетыРейтинговыхАгентств КАК _ПриоритетыРейтинговыхАгентств
		|		ПО ВложенныйЗапрос.ПриоритетРейтинговогоАгентства = _ПриоритетыРейтинговыхАгентств.ПриоритетРейтинговогоАгентства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|		ПО (_ПриоритетыРейтинговыхАгентств.РейтинговоеАгентство = _РейтингиСрезПоследних.РейтинговоеАгентство)
		|			И ВложенныйЗапрос.Субъект = _РейтингиСрезПоследних.Субъект
		|			И ВложенныйЗапрос.ТипШкалы = _РейтингиСрезПоследних.ТипШкалы
		|			И ВложенныйЗапрос.СтрокаСопоставления = _РейтингиСрезПоследних.СтрокаСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _Депозиты.ЭтоМНО
		|			ТОГДА ""09""
		|		ИНАЧЕ ""09""
		|	КОНЕЦ КАК НомерСтроки,
		|	_Депозиты.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_РейтингиМеждународные.СтрокаСопоставления, 5) = 5
		|			ТОГДА ЕСТЬNULL(_РейтингиНациональные.СтрокаСопоставления, 5)
		|		ИНАЧЕ _РейтингиМеждународные.СтрокаСопоставления
		|	КОНЕЦ КАК Рейтинг
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Депозиты КАК _Депозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиМеждународные
		|		ПО _Депозиты.Банк = _РейтингиМеждународные.Субъект
		|			И (НЕ _РейтингиМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (ВЫБОР
		|				КОГДА _Депозиты.Валюта = &ВалютаУчета
		|					ТОГДА _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиНациональные
		|		ПО _Депозиты.Банк = _РейтингиНациональные.Субъект
		|			И (_РейтингиМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (_РейтингиНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ""03""
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ""04""
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ""05""
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ""06""
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|				И _ЦенныеБумаги.Эмитент В (&ФинансовыеОрганизацииТП)
		|			ТОГДА ""07""
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|				И НЕ _ЦенныеБумаги.Эмитент В (&ФинансовыеОрганизацииТП)
		|			ТОГДА ""08""
		|	КОНЕЦ,
		|	_ЦенныеБумаги.Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_РейтингиЦБМеждународные.СтрокаСопоставления, 5) = 5
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(_РейтингиЦБНациональные.СтрокаСопоставления, 5) = 5
		|						ТОГДА ВЫБОР
		|								КОГДА ЕСТЬNULL(_РейтингиЭмитентовМеждународные.СтрокаСопоставления, 5) = 5
		|									ТОГДА ЕСТЬNULL(_РейтингиЭмитентовНациональные.СтрокаСопоставления, 5)
		|								ИНАЧЕ _РейтингиЭмитентовМеждународные.СтрокаСопоставления
		|							КОНЕЦ
		|					ИНАЧЕ _РейтингиЦБНациональные.СтрокаСопоставления
		|				КОНЕЦ
		|		ИНАЧЕ _РейтингиЦБМеждународные.СтрокаСопоставления
		|	КОНЕЦ
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЦБМеждународные
		|		ПО _ЦенныеБумаги.Облигация = _РейтингиЦБМеждународные.Субъект
		|			И (НЕ _РейтингиЦБМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (НЕ _РейтингиЦБМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.АКРА))
		|			И (ВЫБОР
		|				КОГДА _ЦенныеБумаги.Облигация.ВалютаНоминала = &ВалютаУчета
		|					ТОГДА _РейтингиЦБМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиЦБМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЦБНациональные
		|		ПО _ЦенныеБумаги.Облигация = _РейтингиЦБНациональные.Субъект
		|			И (_РейтингиЦБМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиЦБНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX)
		|				ИЛИ _РейтингиЦБНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.АКРА))
		|			И (_РейтингиЦБНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЭмитентовМеждународные
		|		ПО (_РейтингиЦБМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиЦБНациональные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБНациональные.СтрокаСопоставления = 5)
		|			И _ЦенныеБумаги.Эмитент = _РейтингиЭмитентовМеждународные.Субъект
		|			И (НЕ _РейтингиЭмитентовМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (НЕ _РейтингиЭмитентовМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.АКРА))
		|			И (ВЫБОР
		|				КОГДА _ЦенныеБумаги.Облигация.ВалютаНоминала = &ВалютаУчета
		|					ТОГДА _РейтингиЭмитентовМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиЭмитентовМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЭмитентовНациональные
		|		ПО (_РейтингиЦБМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиЦБНациональные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБНациональные.СтрокаСопоставления = 5)
		|			И (_РейтингиЭмитентовМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЭмитентовМеждународные.СтрокаСопоставления = 5)
		|			И _ЦенныеБумаги.Эмитент = _РейтингиЭмитентовНациональные.Субъект
		|			И (_РейтингиЭмитентовНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX)
		|				ИЛИ _РейтингиЭмитентовНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.АКРА))
		|			И (_РейтингиЭмитентовНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 1
		|			ТОГДА ""02""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 2
		|			ТОГДА ""03""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 3
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 4
		|			ТОГДА ""05""
		|		ИНАЧЕ ""06""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1))
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 1
		|			ТОГДА ""02""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 2
		|			ТОГДА ""03""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 3
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 4
		|			ТОГДА ""05""
		|		ИНАЧЕ ""06""
		|	КОНЕЦ";
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 57.16
&НаСервере
Процедура ЗаполнитьРаздел_ГеографическийАнализФинансовыхАктивовИОбязательствСервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""01"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел1
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20202"", ""20203"", ""20209"", ""47901"", ""20802"", ""20501"", ""20502""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И НЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30602"", ""47408""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	NULL
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""504""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""03"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел3
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20601"", ""20603"", ""20609"", ""20611"", ""20613""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""03"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""501"", ""506""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""09"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел9
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &ТолькоКредитныеОрганизации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""10"" КАК НомерСтроки,
		|	СУММА(ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47019"", ""47408"", ""50905"", ""50906"", ""60347"")
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокДт
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47017"", ""47018"", ""50907"")
		|			ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокКт
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""30607"", ""50908"")
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокКт		
		|		КОНЕЦ 
		|	) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел10
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30607"", ""47010"", ""47011"", ""47017"", ""47018"", ""47019"", ""47408"", ""50905"", ""50906"", ""50907"", ""50908"", ""60347""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет.Код НЕ В (""47010"", ""47011"", ""47017"", ""47018"", ""47019"")
		|	ИЛИ &ИсключаяКредитныеОрганизации	
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""10"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47423"", ""47425""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В (&Банкроты)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""23"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел23
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60311"", ""47422""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""23"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления) ССЫЛКА Справочник.СчетаДоверительногоУправления
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления).Организация.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления) ССЫЛКА Справочник.СчетаДоверительногоУправления
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления).Организация.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПеречниОбъектовСрезПоследних.Объект
		|ПОМЕСТИТЬ СтраныОЭСР
		|ИЗ
		|	РегистрСведений.ПеречниОбъектов.СрезПоследних(
		|			&КонецПериода,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ОЭСР)
		|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СтраныОЭСР)) КАК ПеречниОбъектовСрезПоследних
		|ГДЕ
		|	ПеречниОбъектовСрезПоследних.Включен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Раздел1.НомерСтроки,
		|	_Раздел1.Сумма КАК Сумма,
		|	_Раздел1.ЮрФизЛицо
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Раздел1 КАК _Раздел1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел3.НомерСтроки,
		|	_Раздел3.Сумма,
		|	_Раздел3.ЮрФизЛицо
		|ИЗ
		|	_Раздел3 КАК _Раздел3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел9.НомерСтроки,
		|	_Раздел9.Сумма,
		|	_Раздел9.ЮрФизЛицо
		|ИЗ
		|	_Раздел9 КАК _Раздел9
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел10.НомерСтроки,
		|	_Раздел10.Сумма,
		|	_Раздел10.ЮрФизЛицо
		|ИЗ
		|	_Раздел10 КАК _Раздел10
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел23.НомерСтроки,
		|	_Раздел23.Сумма,
		|	_Раздел23.ЮрФизЛицо
		|ИЗ
		|	_Раздел23 КАК _Раздел23
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации В (ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия), ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
		|			ИЛИ _ИтоговаяТаблица.ЮрФизЛицо = ""РОССИЯ""
		|			ТОГДА ""02""
		|		КОГДА НЕ СтраныОЭСР.Объект ЕСТЬ NULL 
		|			ТОГДА ""03""
		|		ИНАЧЕ ""04""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма) * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&КонецПериода, Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ СтраныОЭСР КАК СтраныОЭСР
		|			ПО РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации = СтраныОЭСР.Объект
		|		ПО _ИтоговаяТаблица.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	КурсВалютыПроводки.Курс,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации В (ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия), ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
		|			ИЛИ _ИтоговаяТаблица.ЮрФизЛицо = ""РОССИЯ""
		|			ТОГДА ""02""
		|		КОГДА НЕ СтраныОЭСР.Объект ЕСТЬ NULL 
		|			ТОГДА ""03""
		|		ИНАЧЕ ""04""
		|	КОНЕЦ";
		
	// Отбор по кредитным организациям и банкам-нерезидент
	стрОтборКредитныеОрганизации	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	стрОтборКредитныеОрганизации_НЕ	= "ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", стрОтборКредитныеОрганизации);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсключаяКредитныеОрганизации", стрОтборКредитныеОрганизации_НЕ);		
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 57.17
&НаСервере
Процедура ЗаполнитьРаздел_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСервер(ТекРаздел, ИмяРаздела)
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Подготовка запроса
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	Запрос.МенеджерВременныхТаблиц = Неопределено;
	Запрос.УстановитьПараметр("ВалютаУчета", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовФормы.Организация, "ВалютаУчета"));
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	// Получение данных раздела
	Запрос.Текст = Запрос.Текст + ";" + Символы.ПС + " 
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""27"" КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	вэУправленческий.СуммаРазвернутыйОстатокКт КАК СуммаВВалютеУчета
		|ПОМЕСТИТЬ
		|	_ИтоговаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47407""),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК вэУправленческий
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""28"" КАК НомерСтроки,
		|	""02"" КАК НомерКолонки,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	вэУправленческий.СуммаРазвернутыйОстатокКт КАК СуммаВВалютеУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60311"",""60313"",""31002""),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК вэУправленческий
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""29"" КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	вэУправленческий.СуммаРазвернутыйОстатокКт КАК СуммаВВалютеУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60322""),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК вэУправленческий
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""30"" КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего) 
		|			ТОГДА ""02""
		|		КОГДА СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1) 
		|			ТОГДА ""08""  
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего) И СчетДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1) 
		|			ТОГДА СчетДоверительногоУправления.ДатаРасторжения 
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АнализируемаяДата,
		|	вэУправленческий.СуммаРазвернутыйОстатокКт КАК СуммаВВалютеУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК вэУправленческий
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""30"" КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СчетДоверительногоУправления.ДатаРасторжения КАК АнализируемаяДата,
		|	вэУправленческий.СуммаРазвернутыйОстатокКт КАК СуммаВВалютеУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47422"",""47416""),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК вэУправленческий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 15), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 15)
		|	КОНЕЦ КАК ПятнадцатьЛет,		
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 5), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 5)
		|	КОНЕЦ КАК ПятьЛет,		
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 3)
		|	КОНЕЦ КАК ТриГода,		
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1)
		|	КОНЕЦ КАК Год,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3)
		|	КОНЕЦ КАК ТриМесяца
		|ПОМЕСТИТЬ _Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятнадцатьЛет
		|			ТОГДА ""07""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятьЛет
		|			ТОГДА ""06""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриГода
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""03""
		|		ИНАЧЕ ""02""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.СуммаВВалютеУчета)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.СуммаВВалютеУчета) * ЕСТЬNULL(КурсВалютыУчета.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыУчета
		|		ПО КурсВалютыУчета.Валюта = &ВалютаУчета,
		|	_Периоды КАК _Периоды
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятнадцатьЛет
		|			ТОГДА ""07""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятьЛет
		|			ТОГДА ""06""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриГода
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""03""
		|		ИНАЧЕ ""02""
		|	КОНЕЦ,
		|	КурсВалютыУчета.Курс		
		|";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;	
КонецПроцедуры

// 57.18
&НаСервере
Процедура ЗаполнитьРаздел_АнализФинансовыхАктивовИОбязательствВРазрезеСроковСервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""003"" КАК НомерСтроки,
		|	""02"" КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел3
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20202"", ""20203"", ""20209"", ""47901"", ""20802"", ""20501"", ""20502""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|			ТОГДА ""061""
		|		ИНАЧЕ ""004""
		|	КОНЕЦ КАК НомерСтроки,
		|	""02"" КАК НомерКолонки,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И НЕ ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АнализируемаяДата,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	НЕОПРЕДЕЛЕНО КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _Раздел4
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30602"", ""47408"", ""47423""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК МНО
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = МНО.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|			ТОГДА ""061""
		|		ИНАЧЕ ""004""
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""004"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""504""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""004"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	КОНЕЦПЕРИОДА(&КонецПериода, ГОД),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код = ""47902"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ""006""
		|		ИНАЧЕ ""005а""
		|	КОНЕЦ КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _Раздел5
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""501"", ""506""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""013"" КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ КАК АнализируемаяДата,
		|	ЕСТЬNULL(МНО.Ссылка, НЕОПРЕДЕЛЕНО) КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _Раздел13
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20601"", ""20603"", ""20609"", ""20611"", ""20613""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК МНО
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = МНО.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ,
		|	ЕСТЬNULL(МНО.Ссылка, НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""053"" КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо,
		|	ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО) КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел53
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &ТолькоКредитныеОрганизации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код = ""60347""
		|			ТОГДА ""061""
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019"")
		|			ТОГДА ""058""
		|		ИНАЧЕ ""059""
		|	КОНЕЦ КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47019"", ""47408"", ""50905"", ""50906"", ""60347"")
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокДт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47017"", ""47018"", ""50907"")
		|				ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""30607"", ""50908"")
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокКт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019"")
		|			ТОГДА ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел55
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30607"", ""47010"", ""47011"", ""47017"", ""47018"", ""47019"", ""47408"", ""50905"", ""50906"", ""50907"", ""50908"", ""60347""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|ГДЕ
		|	(НЕ ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019"")
		|			ИЛИ &ИсключаяКредитныеОрганизации)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код = ""60347""
		|			ТОГДА ""061""
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019"")
		|			ТОГДА ""058""
		|		ИНАЧЕ ""059""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019"")
		|			ТОГДА ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""061"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47423"", ""47425""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В (&Банкроты)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""089"" КАК НомерСтроки,
		|	""02"" КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел89
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код = ""47407"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""090"" КАК НомерСтроки,
		|	""02"" КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел90
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""31002"", ""60311"", ""60313""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""091"" КАК НомерСтроки,
		|	""02"" КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел91
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код = ""60322"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""092"" КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код = ""47903""
		|				И ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)
		|			ТОГДА ""02""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код = ""47903""
		|				И ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления.ДатаРасторжения
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел92
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47416"", ""47422"", ""47903""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код = ""47903""
		|				И ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)
		|			ТОГДА ""02""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код = ""47903""
		|				И ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления.ДатаРасторжения
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Раздел3.НомерСтроки КАК НомерСтроки,
		|	_Раздел3.НомерКолонки КАК НомерКолонки,
		|	_Раздел3.Сумма КАК Сумма,
		|	_Раздел3.АнализируемаяДата КАК АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО КАК ЦеннаяБумага,
		|	НЕОПРЕДЕЛЕНО КАК ДополнительнаяАналитика
		|ИЗ
		|	_Раздел3 КАК _Раздел3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел13.НомерСтроки,
		|	_Раздел13.НомерКолонки,
		|	_Раздел13.Сумма,
		|	_Раздел13.АнализируемаяДата,
		|	_Раздел13.ЦеннаяБумага,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел13 КАК _Раздел13
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел5.НомерСтроки,
		|	_Раздел5.НомерКолонки,
		|	_Раздел5.Сумма,
		|	_Раздел5.АнализируемаяДата,
		|	_Раздел5.ЦеннаяБумага,
		|	_Раздел5.ДополнительнаяАналитика
		|ИЗ
		|	_Раздел5 КАК _Раздел5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел4.НомерСтроки,
		|	_Раздел4.НомерКолонки,
		|	_Раздел4.Сумма,
		|	_Раздел4.АнализируемаяДата,
		|	_Раздел4.ЦеннаяБумага,
		|	_Раздел4.ДополнительнаяАналитика
		|ИЗ
		|	_Раздел4 КАК _Раздел4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел53.НомерСтроки,
		|	_Раздел53.НомерКолонки,
		|	_Раздел53.Сумма,
		|	_Раздел53.АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел53 КАК _Раздел53
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел55.НомерСтроки,
		|	_Раздел55.НомерКолонки,
		|	_Раздел55.Сумма,
		|	_Раздел55.АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел55 КАК _Раздел55
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел89.НомерСтроки,
		|	_Раздел89.НомерКолонки,
		|	_Раздел89.Сумма,
		|	_Раздел89.АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел89 КАК _Раздел89
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел90.НомерСтроки,
		|	_Раздел90.НомерКолонки,
		|	_Раздел90.Сумма,
		|	_Раздел90.АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел90 КАК _Раздел90
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел91.НомерСтроки,
		|	_Раздел91.НомерКолонки,
		|	_Раздел91.Сумма,
		|	_Раздел91.АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел91 КАК _Раздел91
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел92.НомерСтроки,
		|	_Раздел92.НомерКолонки,
		|	_Раздел92.Сумма,
		|	_Раздел92.АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел92 КАК _Раздел92";
	
	// Отбор по кредитным организациям и банкам-нерезидент
	стрОтборКредитныеОрганизации	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	стрОтборКредитныеОрганизации_НЕ	= "ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", стрОтборКредитныеОрганизации);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсключаяКредитныеОрганизации", стрОтборКредитныеОрганизации_НЕ);		
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("УчетныйАктив", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивы"));
	
	МассивДопАналитикКупонов = Новый Массив;
	МассивДопАналитикКупонов.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	МассивДопАналитикКупонов.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	
	Для каждого ТекСтрока Из Результат Цикл
	
		Если ЗначениеЗаполнено(ТекСтрока.НомерКолонки) 
			ИЛИ ЗначениеЗаполнено(ТекСтрока.АнализируемаяДата)
			ИЛИ Не ЗначениеЗаполнено(ТекСтрока.ЦеннаяБумага) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(ТекСтрока.ЦеннаяБумага) = Тип("ДокументСсылка.МНО") Тогда
			ТекСтрока.УчетныйАктив = Справочники.УчетныеАктивы.ПроцентыНаМНО;
		Иначе
			Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ТекСтрока.ЦеннаяБумага);
			ЭтоКупон = МассивДопАналитикКупонов.Найти(ТекСтрока.ДополнительнаяАналитика) <> Неопределено;
			ТекСтрока.УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, Рынок, ТекСтрока.ЦеннаяБумага, ЭтоКупон);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&КонецПериода КАК ОтчетнаяДата,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1)
		|	КОНЕЦ КАК Год,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3)
		|	КОНЕЦ КАК ТриМесяца
		|ПОМЕСТИТЬ _Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	ТаблицаИсточник.НомерКолонки КАК НомерКолонки,
		|	ТаблицаИсточник.Сумма КАК Сумма,
		|	ТаблицаИсточник.АнализируемаяДата КАК АнализируемаяДата,
		|	ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаИсточник.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ТаблицаИсточник.УчетныйАктив КАК УчетныйАктив
		|ПОМЕСТИТЬ _ТаблицаИсточник
		|ИЗ
		|	&ТаблицаИсточник КАК ТаблицаИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""02""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""03""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеГода)
		|			ТОГДА ""04""
		|		ИНАЧЕ _ТаблицаИсточник.НомерКолонки
		|	КОНЕЦ КАК НомерКолонки,
		|	_ТаблицаИсточник.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияКупона)
		|			ТОГДА КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияТела)
		|				ИЛИ НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты)
		|						ТОГДА ЕСТЬNULL(МИНИМУМ(УсловияОферт.ДатаВыкупа), Облигации.ДатаПогашения)
		|					ИНАЧЕ Облигации.ДатаПогашения
		|				КОНЕЦ
		|		ИНАЧЕ _ТаблицаИсточник.АнализируемаяДата
		|	КОНЕЦ КАК АнализируемаяДата,
		|	_ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, Облигации.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	Облигации.Эмитент.ЮрФизЛицо КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ТаблицаИсточник КАК _ТаблицаИсточник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК НастройкиУчетаАктивовСрезПоследних
		|		ПО _ТаблицаИсточник.УчетныйАктив = НастройкиУчетаАктивовСрезПоследних.УчетныйАктив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(
		|				&КонецПериода,
		|				Облигация В
		|					(ВЫБРАТЬ
		|						_ТаблицаИсточник.ЦеннаяБумага
		|					ИЗ
		|						_ТаблицаИсточник КАК _ТаблицаИсточник)) КАК КупонныйДоходПоОблигациямСрезПоследних
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = КупонныйДоходПоОблигациямСрезПоследних.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|			ПО Облигации.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|				И Облигации.Эмитент = ПереопределенияАктивов.Эмитент
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _ТаблицаИсточник.ЦеннаяБумага = УсловияОферт.Облигация
		|			И (&КонецПериода < УсловияОферт.ДатаВыкупа
		|				И НЕ УсловияОферт.ТолькоДляФизическихЛиц),
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаИсточник.НомерСтроки,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""02""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""03""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеГода)
		|			ТОГДА ""04""
		|		ИНАЧЕ _ТаблицаИсточник.НомерКолонки
		|	КОНЕЦ,
		|	_ТаблицаИсточник.Сумма,
		|	_ТаблицаИсточник.ЦеннаяБумага,
		|	_ТаблицаИсточник.АнализируемаяДата,
		|	НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности,
		|	КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона,
		|	Облигации.ДатаПогашения,
		|	НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона,
		|	НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо,
		|	Облигации.Эмитент.ЮрФизЛицо,
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, Облигации.УчетныйАктивЦБРФ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""006""
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|						ТОГДА ""007""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|						ТОГДА ""008""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|						ТОГДА ""009""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|						ТОГДА ""010""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|							И _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""011""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|							И НЕ _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""012""
		|				КОНЕЦ
		|		ИНАЧЕ _ИтоговаяТаблица.НомерСтроки
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""03""
		|		ИНАЧЕ ""02""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма) * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта),
		|	_Периоды КАК _Периоды
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""03""
		|		ИНАЧЕ ""02""
		|	КОНЕЦ,
		|	КурсВалютыПроводки.Курс,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерСтроки = ""006""
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|						ТОГДА ""007""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|						ТОГДА ""008""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|						ТОГДА ""009""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|						ТОГДА ""010""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|							И _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""011""
		|					КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|							И НЕ _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""012""
		|				КОНЕЦ
		|		ИНАЧЕ _ИтоговаяТаблица.НомерСтроки
		|	КОНЕЦ";
	Запрос.УстановитьПараметр("ТаблицаИсточник", Результат);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 57.19
&НаСервере
Процедура ЗаполнитьРаздел_ОбзорФинансовыхАктивовИОбязательствВРазрезеОсновныхВалютСервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""01"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел1
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20202"", ""20203"", ""20209"", ""47901"", ""20802"", ""20501"", ""20502""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И НЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30602"", ""47408""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""504""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код = ""47902"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""02"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел2
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20601"", ""20603"", ""20609"", ""20611"", ""20613""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""501"", ""506""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""06"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел6
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &ТолькоКредитныеОрганизации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""07"" КАК НомерСтроки,
		|	СУММА(ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47010"", ""47011"", ""47019"", ""47408"", ""50905"", ""50906"", ""60347"")
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокДт
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""47017"", ""47018"", ""50907"")
		|			ТОГДА -ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокКт
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Код В (""30607"", ""50908"")
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаРазвернутыйОстатокКт		
		|		КОНЕЦ 
		|	) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел7
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30607"", ""47010"", ""47011"", ""47017"", ""47018"", ""47019"", ""47408"", ""50905"", ""50906"", ""50907"", ""50908"", ""60347""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет.Код НЕ В (""47010"", ""47011"", ""47017"", ""47018"", ""47019"")
		|	ИЛИ &ИсключаяКредитныеОрганизации	
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""07"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47423"", ""47425""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В (&Банкроты)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""20"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел20
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60311"", ""47422""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""20"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Раздел1.НомерСтроки КАК НомерСтроки,
		|	_Раздел1.Сумма КАК Сумма,
		|	_Раздел1.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Раздел1 КАК _Раздел1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел2.НомерСтроки,
		|	_Раздел2.Сумма,
		|	_Раздел2.Валюта
		|ИЗ
		|	_Раздел2 КАК _Раздел2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел6.НомерСтроки,
		|	_Раздел6.Сумма,
		|	_Раздел6.Валюта
		|ИЗ
		|	_Раздел6 КАК _Раздел6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел7.НомерСтроки,
		|	_Раздел7.Сумма,
		|	_Раздел7.Валюта
		|ИЗ
		|	_Раздел7 КАК _Раздел7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел20.НомерСтроки,
		|	_Раздел20.Сумма,
		|	_Раздел20.Валюта
		|ИЗ
		|	_Раздел20 КАК _Раздел20
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА Валюты.Код = ""810""
		|				ИЛИ Валюты.Код = ""643""
		|			ТОГДА ""02""
		|		КОГДА Валюты.Код = ""840""
		|			ТОГДА ""03""
		|		КОГДА Валюты.Код = ""978""
		|			ТОГДА ""04""
		|		ИНАЧЕ ""05""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма) * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
		|		ПО _ИтоговаяТаблица.Валюта = Валюты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Валюты.Код = ""810""
		|				ИЛИ Валюты.Код = ""643""
		|			ТОГДА ""02""
		|		КОГДА Валюты.Код = ""840""
		|			ТОГДА ""03""
		|		КОГДА Валюты.Код = ""978""
		|			ТОГДА ""04""
		|		ИНАЧЕ ""05""
		|	КОНЕЦ,
		|	_ИтоговаяТаблица.НомерСтроки,
		|	КурсВалютыПроводки.Курс";
	
	// Отбор по кредитным организациям и банкам-нерезидент
	стрОтборКредитныеОрганизации	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	стрОтборКредитныеОрганизации_НЕ	= "ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", стрОтборКредитныеОрганизации);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсключаяКредитныеОрганизации", стрОтборКредитныеОрганизации_НЕ);		
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 57.20
&НаСервере
Процедура ЗаполнитьРаздел_АнализПроцентногоРискаКВозможнымИзменениямВПроцентныхСтавкахСервер(ТекРаздел, ИмяРаздела)
	
	//мИмяЗаполняемогоРаздела = ИмяРаздела;
	//
	//мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	//
	//Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	//ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
КонецПроцедуры

// 61.1
&НаСервере
Процедура ЗаполнитьРаздел_УровниВИерархииСправедливойСтоимостиСервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	
	Запрос.УстановитьПараметр("СчетаЦБ", СчетаЦБ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьПереоценки.УровеньОценки) > 1
		|			ТОГДА 0
		|		ИНАЧЕ МАКСИМУМ(СтоимостьПереоценки.УровеньОценки)
		|	КОНЕЦ КАК УровеньОценки
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
		|	ИЗ
		|		Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|	ГДЕ
		|		ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ПереоценкаЦенныхБумаг.Организация = &Организация
		|		И ПереоценкаЦенныхБумаг.Проведен
		|		И ПереоценкаЦенныхБумаг.Дата <= &КонецПериода
		|		И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ПО ПереоценкаЦенныхБумаг.Ссылка = СтоимостьПереоценки.Регистратор
		|		ПО ВложенныйЗапрос.Дата = ПереоценкаЦенныхБумаг.Дата
		|ГДЕ
		|	ПереоценкаЦенныхБумаг.Организация = &Организация
		|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаЦенныхБумаг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереоценкаЦенныхБумаг.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 1
		|			ТОГДА ""02""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|			ТОГДА ""03""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|			ТОГДА ""04""
		|	КОНЕЦ КАК НомерКолонки,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ) КАК ЭтоОблигации,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблицаПредварительная
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумаг КАК _ПереоценкаЦенныхБумаг
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ПереоценкаЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 1
		|			ТОГДА ""02""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|			ТОГДА ""03""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|			ТОГДА ""04""
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	_ИтоговаяТаблицаПредварительная.Сумма КАК Сумма,
		|	_ИтоговаяТаблицаПредварительная.НомерКолонки КАК НомерКолонки,
		|	_ИтоговаяТаблицаПредварительная.ЭтоОблигации КАК ЭтоОблигации,
		|	_ИтоговаяТаблицаПредварительная.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ИтоговаяТаблицаПредварительная КАК _ИтоговаяТаблицаПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|			И _ИтоговаяТаблицаПредварительная.Эмитент = ПереопределенияАктивов.Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИБанков), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИБанков))
		|			ТОГДА ""006""
		|		КОГДА НЕ _ИтоговаяТаблица.ЭтоОблигации
		|				И _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""007""
		|					ИНАЧЕ ""008""
		|				КОНЕЦ
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ""010""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ""011""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ""012""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ""013""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""014""
		|					ИНАЧЕ ""015""
		|				КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	_ИтоговаяТаблица.НомерКолонки КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА _ИтоговаяТаблица.Сумма
		|		ИНАЧЕ _ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""049"",
		|	""02"",
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 61.2
&НаСервере
Процедура ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня2Сервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	
	Запрос.УстановитьПараметр("СчетаЦБ", СчетаЦБ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьПереоценки.УровеньОценки) > 1
		|			ТОГДА 0
		|		ИНАЧЕ МАКСИМУМ(СтоимостьПереоценки.УровеньОценки)
		|	КОНЕЦ КАК УровеньОценки,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.Источник КАК Источник
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
		|	ИЗ
		|		Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|	ГДЕ
		|		ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ПереоценкаЦенныхБумаг.Организация = &Организация
		|		И ПереоценкаЦенныхБумаг.Проведен
		|		И ПереоценкаЦенныхБумаг.Дата <= &КонецПериода
		|		И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ПО ПереоценкаЦенныхБумаг.Ссылка = СтоимостьПереоценки.Регистратор
		|		ПО ВложенныйЗапрос.Дата = ПереоценкаЦенныхБумаг.Дата
		|ГДЕ
		|	ПереоценкаЦенныхБумаг.Организация = &Организация
		|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаЦенныхБумаг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереоценкаЦенныхБумаг.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.ВидЦены,
		|	СтоимостьПереоценки.Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	СУММА(ВЫБОР
		|			КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ) КАК ЭтоОблигации,
		|	_ПереоценкаЦенныхБумаг.ВидЦены КАК ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник КАК Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблицаПредварительная
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумаг КАК _ПереоценкаЦенныхБумаг
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ПереоценкаЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ),
		|	_ПереоценкаЦенныхБумаг.ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	_ИтоговаяТаблицаПредварительная.Сумма КАК Сумма,
		|	_ИтоговаяТаблицаПредварительная.ЭтоОблигации КАК ЭтоОблигации,
		|	_ИтоговаяТаблицаПредварительная.ВидЦены КАК ВидЦены,
		|	_ИтоговаяТаблицаПредварительная.Источник КАК Источник,
		|	_ИтоговаяТаблицаПредварительная.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ИтоговаяТаблицаПредварительная КАК _ИтоговаяТаблицаПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|			И _ИтоговаяТаблицаПредварительная.Эмитент = ПереопределенияАктивов.Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИБанков), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИБанков))
		|			ТОГДА ""006""
		|		КОГДА НЕ _ИтоговаяТаблица.ЭтоОблигации
		|				И _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""007""
		|					ИНАЧЕ ""008""
		|				КОНЕЦ
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ""010""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ""011""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ""012""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ""013""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""014""
		|					ИНАЧЕ ""015""
		|				КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА _ИтоговаяТаблица.Сумма
		|		ИНАЧЕ _ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК _02,
		|	_ИтоговаяТаблица.ВидЦены КАК _03,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК _04
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИтоговаяТаблица.Источник = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	_ИтоговаяТаблица.Сумма <> 0";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "02", СтрокаРезультат._02);
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "03", СтрокаРезультат._03);
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "04", СтрокаРезультат._04);
	КонецЦикла;
	
КонецПроцедуры

// 61.3
&НаСервере
Процедура ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня3Сервер(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	
	Запрос.УстановитьПараметр("СчетаЦБ", СчетаЦБ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьПереоценки.УровеньОценки) > 1
		|			ТОГДА 0
		|		ИНАЧЕ МАКСИМУМ(СтоимостьПереоценки.УровеньОценки)
		|	КОНЕЦ КАК УровеньОценки,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.Источник КАК Источник
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
		|	ИЗ
		|		Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|	ГДЕ
		|		ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ПереоценкаЦенныхБумаг.Организация = &Организация
		|		И ПереоценкаЦенныхБумаг.Проведен
		|		И ПереоценкаЦенныхБумаг.Дата <= &КонецПериода
		|		И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ПО ПереоценкаЦенныхБумаг.Ссылка = СтоимостьПереоценки.Регистратор
		|		ПО ВложенныйЗапрос.Дата = ПереоценкаЦенныхБумаг.Дата
		|ГДЕ
		|	ПереоценкаЦенныхБумаг.Организация = &Организация
		|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаЦенныхБумаг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереоценкаЦенныхБумаг.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.ВидЦены,
		|	СтоимостьПереоценки.Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	СУММА(ВЫБОР
		|			КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ) КАК ЭтоОблигации,
		|	_ПереоценкаЦенныхБумаг.ВидЦены КАК ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник КАК Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблицаПредварительная
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумаг КАК _ПереоценкаЦенныхБумаг
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ПереоценкаЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ),
		|	_ПереоценкаЦенныхБумаг.ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	_ИтоговаяТаблицаПредварительная.Сумма КАК Сумма,
		|	_ИтоговаяТаблицаПредварительная.ЭтоОблигации КАК ЭтоОблигации,
		|	_ИтоговаяТаблицаПредварительная.ВидЦены КАК ВидЦены,
		|	_ИтоговаяТаблицаПредварительная.Источник КАК Источник,
		|	_ИтоговаяТаблицаПредварительная.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ИтоговаяТаблицаПредварительная КАК _ИтоговаяТаблицаПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|			И _ИтоговаяТаблицаПредварительная.Эмитент = ПереопределенияАктивов.Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИБанков), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИБанков))
		|			ТОГДА ""006""
		|		КОГДА НЕ _ИтоговаяТаблица.ЭтоОблигации
		|				И _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""007""
		|					ИНАЧЕ ""008""
		|				КОНЕЦ
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ""010""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ""011""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ""012""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ""013""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""014""
		|					ИНАЧЕ ""015""
		|				КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА _ИтоговаяТаблица.Сумма
		|		ИНАЧЕ _ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК _02,
		|	_ИтоговаяТаблица.ВидЦены КАК _03,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК _04
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИтоговаяТаблица.Источник = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	_ИтоговаяТаблица.Сумма <> 0";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "02", СтрокаРезультат._02);
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "03", СтрокаРезультат._03);
		Если СокрЛП(СтрокаРезультат._03) = "Расчетная цена" Тогда
			УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "04", "Дисконтированные потоки исходя из доходности при размещении");
		Иначе
			УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "04", СтрокаРезультат._04);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// 61.6
&НаСервере
Процедура ЗаполнитьРаздел_АнализСправедливойСтоимостиИБалансоваяСтоимостьСервер(ТекРаздел, ИмяРаздела)
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Подготовка запроса
	Запрос = ПодготовитьВременныеТаблицыДокумента();

	// Отбор по кредитным организациям и банкам-нерезидент
	стрОтборКредитныеОрганизации	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	стрОтборКредитныеОрганизации_НЕ	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	
	// Отбор по банкротам
	Банкроты = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);	
	Запрос.УстановитьПараметр("Банкроты", Банкроты);		
	стрОтборБанкроты = "Субконто1 В (&Банкроты)";	
	
	// Получение данных раздела с простой логикой
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	// 03-07 (по примечанию 5.1) 
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0302", "Денежные средства в кассе", "+", "!СКД", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П0302", "Денежные средства в кассе", "+", "!СКД", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	КонсолидированнаяОтчетность.СкопироватьЗначениеЯчейки(СтруктураРеквизитовФормы, ЭтаФорма, Адрес_ТаблицаРасшифровки, ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0302");	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0402", "Денежные средства в пути", "+", "!СКД", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	КонсолидированнаяОтчетность.СкопироватьЗначениеЯчейки(СтруктураРеквизитовФормы, ЭтаФорма, Адрес_ТаблицаРасшифровки, ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0402");	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0602", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20501", "Сальдо на конец периода #Период# по дебету счета 20501");
	ДобавитьСчетВТаблицуСчетов("П0602", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20502", "Сальдо на конец периода #Период# по дебету счета 20502");
	ДобавитьСчетВТаблицуСчетов("П0602", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	КонсолидированнаяОтчетность.СкопироватьЗначениеЯчейки(СтруктураРеквизитовФормы, ЭтаФорма, Адрес_ТаблицаРасшифровки, ИмяРаздела, ТекРаздел, "П0606", ТекРаздел, "П0602");	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0702", "Прочие денежные средства", "+", "!СКД", "20802", "Сальдо на конец периода #Период# по дебету счета 20802");
	ДобавитьСчетВТаблицуСчетов("П0702", "Прочие денежные средства", "+", "!СКД", "30602", "Сальдо на конец периода #Период# по дебету счета 30602");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	КонсолидированнаяОтчетность.СкопироватьЗначениеЯчейки(СтруктураРеквизитовФормы, ЭтаФорма, Адрес_ТаблицаРасшифровки, ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0702");	
	
	// 10-13 (баланс по примечанию 10.1)	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1206", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П1206", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П1206", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П1206", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 (только кредитные организации)");
	ДобавитьСчетВТаблицуСчетов("П1206", "Сделки обратного репо с кредитными организациями и банками-нерезидентами", "-", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 (только кредитные организации)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , " И " + стрОтборКредитныеОрганизации);	
	
	// 15-21 (баланс по примечанию 11.1)	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1706", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П1706", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П1706", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П1706", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П1706", "Сделки обратного репо, кроме сделок обратного репо с кредитными организациями и банками-нерезидентами", "-", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 (кроме кредитных организаций)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , , " И " + стрОтборКредитныеОрганизации_НЕ);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1806", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКД", "47408", "Сальдо на конец периода #Период# по дебету счета 47408");
	ДобавитьСчетВТаблицуСчетов("П1806", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКД", "50905", "Сальдо на конец периода #Период# по дебету счета 50905");
	ДобавитьСчетВТаблицуСчетов("П1806", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКД", "50906", "Сальдо на конец периода #Период# по дебету счета 50906");
	ДобавитьСчетВТаблицуСчетов("П1806", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "-", "!СКК", "50907", "Сальдо на конец периода #Период# по кредиту счета 50907");
	ДобавитьСчетВТаблицуСчетов("П1806", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКК", "50908", "Сальдо на конец периода #Период# по кредиту счета 50908");
	ДобавитьСчетВТаблицуСчетов("П1806", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКК", "30607", "Сальдо на конец периода #Период# по кредиту счета 30607");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	КонсолидированнаяОтчетность.СкопироватьЗначениеЯчейки(СтруктураРеквизитовФормы, ЭтаФорма, Адрес_ТаблицаРасшифровки, ИмяРаздела, ТекРаздел, "П1802", ТекРаздел, "П1806");	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П2006", "Расчеты по начисленным доходам по акциям, долям, паям", "+", "!СКД", "60347", "Сальдо на конец периода #Период# по дебету счета 60347");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	КонсолидированнаяОтчетность.СкопироватьЗначениеЯчейки(СтруктураРеквизитовФормы, ЭтаФорма, Адрес_ТаблицаРасшифровки, ИмяРаздела, ТекРаздел, "П2002", ТекРаздел, "П2006");	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П2106", "Прочее", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 (банкроты)");
	ДобавитьСчетВТаблицуСчетов("П2106", "Прочее", "-", "!СКК", "47425", "Сальдо на конец периода #Период# по кредиту счета 47425 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , " ГДЕ " + стрОтборБанкроты);
	
	// 67-70 (по примечанию 26.1) 
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П6706", "расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКК", "47407", "Сальдо на конец периода #Период# по кредиту счета 47407");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П6806", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "60311", "Сальдо на конец периода #Период# по кредиту счета 60311");
	ДобавитьСчетВТаблицуСчетов("П6806", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "60313", "Сальдо на конец периода #Период# по кредиту счета 60313");
	ДобавитьСчетВТаблицуСчетов("П6806", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "31002", "Сальдо на конец периода #Период# по кредиту счета 31002");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П6906", "Расчеты с прочими кредиторами", "+", "!СКК", "60322", "Сальдо на конец периода #Период# по кредиту счета 60322");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);
	
	мТаблицаСчетов.Очистить();
 	ДобавитьСчетВТаблицуСчетов("П7006", "Прочее", "+", "!СКК", "47422", "Сальдо на конец периода #Период# по кредиту счета 47422");
	ДобавитьСчетВТаблицуСчетов("П7006", "Прочее", "+", "!СКК", "47416", "Сальдо на конец периода #Период# по кредиту счета 47416");
 	ДобавитьСчетВТаблицуСчетов("П7006", "Прочее", "+", "!СКК", "47903", "Сальдо на конец периода #Период# по кредиту счета 47903");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);	
	
	// 10-13 и 15-21 с разбивкой по уровню оценки справедливой стоимости	
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Текст = Запрос.Текст + ";" + Символы.ПС + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьПереоценки.УровеньОценки) > 1
		|			ТОГДА 0
		|		ИНАЧЕ МАКСИМУМ(СтоимостьПереоценки.УровеньОценки)
		|	КОНЕЦ КАК УровеньОценки
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
		|	ИЗ
		|		Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|	ГДЕ
		|		ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ПереоценкаЦенныхБумаг.Организация = &Организация
		|		И ПереоценкаЦенныхБумаг.Проведен
		|		И ПереоценкаЦенныхБумаг.Дата <= &КонецПериода
		|		И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ПО ПереоценкаЦенныхБумаг.Ссылка = СтоимостьПереоценки.Регистратор
		|		ПО ВложенныйЗапрос.Дата = ПереоценкаЦенныхБумаг.Дата
		|ГДЕ
		|	ПереоценкаЦенныхБумаг.Организация = &Организация
		|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаЦенныхБумаг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереоценкаЦенныхБумаг.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &ТолькоКредитныеОрганизации
		|			ТОГДА ""12""
		|		ИНАЧЕ ""17""
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 1
		|			ТОГДА ""02""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|			ТОГДА ""03""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|			ТОГДА ""04""
		|		ИНАЧЕ ""02""
		|	КОНЕЦ КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма
		|ПОМЕСТИТЬ _Строки_12_17
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47010"", ""47011"", ""47017"", ""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумаг КАК _ПереоценкаЦенныхБумаг
		|		ПО (_ПереоценкаЦенныхБумаг.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА &ТолькоКредитныеОрганизации
		|			ТОГДА ""12""
		|		ИНАЧЕ ""17""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 1
		|			ТОГДА ""02""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|			ТОГДА ""03""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|			ТОГДА ""04""
		|		ИНАЧЕ ""02""
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Строки_12_17.НомерСтроки КАК НомерСтроки,
		|	_Строки_12_17.НомерКолонки КАК НомерКолонки,
		|	_Строки_12_17.Сумма КАК СуммаВВалютеУчета
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Строки_12_17 КАК _Строки_12_17
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	_ИтоговаяТаблица.НомерКолонки КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.СуммаВВалютеУчета)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.СуммаВВалютеУчета) * ЕСТЬNULL(КурсВалютыУчета.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыУчета
		|		ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	_ИтоговаяТаблица.НомерКолонки,
		|	КурсВалютыУчета.Курс";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", стрОтборКредитныеОрганизации);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсключаяКредитныеОрганизации", стрОтборКредитныеОрганизации_НЕ);		
	
	Запрос.УстановитьПараметр("Банкроты", Банкроты);	
	Запрос.УстановитьПараметр("ВалютаУчета", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовФормы.Организация, "ВалютаУчета"));
	
	Запрос.МенеджерВременныхТаблиц = Неопределено;
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОтчетТитульнаяСтраница()
	
	ИмяРаздела = "ОтчетТитульнаяСтраница";
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела))[0];
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			
	РасчетРаздела_ОтчетТитульнаяСтраница(ТекРаздел, ИмяРаздела);
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ДенежныеСредства()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ДенежныеСредства"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ДенежныеСредстваСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ДенежныеСредства(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_КомпонентыДенежныхСредствИИхЭквивалентов()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "КомпонентыДенежныхСредствИИхЭквивалентов"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_КомпонентыДенежныхСредствИИхЭквивалентовСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_КомпонентыДенежныхСредствИИхЭквивалентов(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиДенежныхСредств()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ВыверкаИзмененийПолнойБалансовойСтоимостиДенежныхСредств"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиДенежныхСредствСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ВыверкаИзмененийПолнойБалансовойСтоимостиДенежныхСредств(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбыток()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбыток"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбытокСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбыток(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ЦенныеБумагиПоСправедливойСтоимостиЧерезПрибыльУбыток()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ЦенныеБумагиПоСправедливойСтоимостиЧерезПрибыльУбыток"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ЦенныеБумагиПоСправедливойСтоимостиЧерезПрибыльУбытокСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;

	РасчетРаздела_ЦенныеБумагиПоСправедливойСтоимостиЧерезПрибыльУбыток(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_РеклассификацияПоСправедливойСтоимостиЧерезПрибыльУбыток()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "РеклассификацияПоСправедливойСтоимостиЧерезПрибыльУбыток"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_РеклассификацияПоСправедливойСтоимостиЧерезПрибыльУбытокСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_РеклассификацияПоСправедливойСтоимостиЧерезПрибыльУбыток(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПрочиеРазмещенныеСредстваДЗ()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПрочиеРазмещенныеСредстваДЗ"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПрочиеРазмещенныеСредстваДЗСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ПрочиеРазмещенныеСредстваДЗ(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиПрочихРазмещенныхСредствИДЗ()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ВыверкаИзмененийПолнойБалансовойСтоимостиПрочихРазмещенныхСредствИДЗ"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиПрочихРазмещенныхСредствИДЗСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ВыверкаИзмененийПолнойБалансовойСтоимостиПрочихРазмещенныхСредствИДЗ(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ВыверкаИзмененийРезерваПодОбесценениеПрочихРазмещенныхСредствИДЗ()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ВыверкаИзмененийРезерваПодОбесценениеПрочихРазмещенныхСредствИДЗ"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ВыверкаИзмененийРезерваПодОбесценениеПрочихРазмещенныхСредствИДЗСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ВыверкаИзмененийРезерваПодОбесценениеПрочихРазмещенныхСредствИДЗ(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияОПлатежахКПолучениюПоФинансовойАренде()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияОПлатежахКПолучениюПоФинансовойАренде"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ИнформацияОПлатежахКПолучениюПоФинансовойАрендеСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ИнформацияОПлатежахКПолучениюПоФинансовойАренде(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПрочаяКредиторскаяЗадолженность()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПрочаяКредиторскаяЗадолженность"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПрочаяКредиторскаяЗадолженностьСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ПрочаяКредиторскаяЗадолженность(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_НераспределеннаяПрибыль()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "НераспределеннаяПрибыль"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_НераспределеннаяПрибыльСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_НераспределеннаяПрибыль(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияОКредитныхРейтингахДолговыхИнструментов()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияОКредитныхРейтингахДолговыхИнструментов"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ИнформацияОКредитныхРейтингахДолговыхИнструментовСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ИнформацияОКредитныхРейтингахДолговыхИнструментов(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ГеографическийАнализФинансовыхАктивовИОбязательств()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ГеографическийАнализФинансовыхАктивовИОбязательств"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ГеографическийАнализФинансовыхАктивовИОбязательствСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ГеографическийАнализФинансовыхАктивовИОбязательств(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоков()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоков"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоков(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

// 57.18
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_АнализФинансовыхАктивовИОбязательствВРазрезеСроков()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "АнализФинансовыхАктивовИОбязательствВРазрезеСроков"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_АнализФинансовыхАктивовИОбязательствВРазрезеСроковСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_АнализФинансовыхАктивовИОбязательствВРазрезеСроков(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОбзорФинансовыхАктивовИОбязательствВРазрезеОсновныхВалют()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОбзорФинансовыхАктивовИОбязательствВРазрезеОсновныхВалют"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ОбзорФинансовыхАктивовИОбязательствВРазрезеОсновныхВалютСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ОбзорФинансовыхАктивовИОбязательствВРазрезеОсновныхВалют(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_АнализПроцентногоРискаКВозможнымИзменениямВПроцентныхСтавках()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "АнализПроцентногоРискаКВозможнымИзменениямВПроцентныхСтавках"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_АнализПроцентногоРискаКВозможнымИзменениямВПроцентныхСтавкахСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_АнализПроцентногоРискаКВозможнымИзменениямВПроцентныхСтавках(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_УровниВИерархииСправедливойСтоимости()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "УровниВИерархииСправедливойСтоимости"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_УровниВИерархииСправедливойСтоимостиСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_УровниВИерархииСправедливойСтоимости(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня2()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "МетодыОценкиИИсходныеДанныеУровня2"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня2Сервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня2(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня3()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "МетодыОценкиИИсходныеДанныеУровня3"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня3Сервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня3(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_АнализСправедливойСтоимостиИБалансоваяСтоимость()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "АнализСправедливойСтоимостиИБалансоваяСтоимость"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_АнализСправедливойСтоимостиИБалансоваяСтоимостьСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_АнализСправедливойСтоимостиИБалансоваяСтоимость(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ДепозитыИСредстваВКредитныхОрганизациях()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ДепозитыИСредстваВКредитныхОрганизациях"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ДепозитыИСредстваВКредитныхОрганизацияхСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ДепозитыИСредстваВКредитныхОрганизациях(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиДепозитовИПрочихСредств()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ВыверкаИзмененийПолнойБалансовойСтоимостиДепозитовИПрочихСредств"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ВыверкаИзмененийПолнойБалансовойСтоимостиДепозитовИПрочихСредствСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ВыверкаИзмененийПолнойБалансовойСтоимостиДепозитовИПрочихСредств(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ВыверкаИзмененийУбыткаОтОбесцененияДепозитовИПрочихСредств()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ВыверкаИзмененийУбыткаОтОбесцененияДепозитовИПрочихСредств"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ВыверкаИзмененийУбыткаОтОбесцененияДепозитовИПрочихСредствСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ВыверкаИзмененийУбыткаОтОбесцененияДепозитовИПрочихСредств(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашенияСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения(ТекСтрока.ТабличныйДокумент, ИмяРаздела);

КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыРасчета

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРаздела, ИмяЯчейки, Ячейка)
	// #ЧисткаИтогов
	
	Если КонсолидированнаяОтчетностьКлиентСервер.ИтоговаяЯчейкаПервыйРасчет(ЭтаФорма, ИмяРаздела, ИмяЯчейки, Ячейка)
		Тогда
		КонсолидированнаяОтчетность.УдалитьРасшифровкуЯчейки(Адрес_ТаблицаРасшифровки, ИмяРаздела, ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейкуНачало

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейку(ИмяРазделаРезультат, РазделРезультат, ИмяЯчейкиРезультат, ИмяРазделаИсточник, ИмяЯчейкиИсточник, Множитель = 1, ИмяПоказателяРезультат = "", ИмяПоказателяИсточник = "", ДобавитьКРасчетномуЗначению = ЛОЖЬ)
	
	ИмяПоказателяИсточник_исх = ИмяПоказателяИсточник;
	ИмяПоказателяРезультат = ?(ИмяПоказателяРезультат = "", "Ячейка " + ИмяЯчейкиРезультат, ИмяПоказателяРезультат);
	ИмяПоказателяИсточник = ?(ИмяПоказателяИсточник = "", "Ячейка " + ИмяЯчейкиИсточник, ИмяПоказателяИсточник);
	
	// Определим ячейку-результат
	Попытка
		ЯчейкаРезультат = РазделРезультат.Области[ИмяЯчейкиРезультат];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: не найдена ячейка %2'"),
		ИмяРазделаРезультат,
		ИмяЯчейкиРезультат);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// #ЧисткаИтогов
	Если НЕ ДобавитьКРасчетномуЗначению Тогда
		ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРазделаРезультат, ИмяЯчейкиРезультат, ЯчейкаРезультат); 
	КонецЕсли;
	
	// Табличный документ-источник
	Если ТипЗнч(ИмяРазделаИсточник) = Тип("Строка") Тогда
		
		Попытка
			РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаИсточник))[0];
			ТабИсточник = РазделОтчета.ТабличныйДокумент;
		Исключение
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Расчет итогов по разделу %1: не найден раздел %2'"),
			ИмяРазделаРезультат,
			ИмяРазделаИсточник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	Иначе
		
		// Если передан табличный документ, значит заполнение идет с текущего раздела
		ТабИсточник = ИмяРазделаИсточник;
		РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаРезультат))[0];
		
	КонецЕсли;
	СтраницаИсточник = РазделОтчета;
	
	// Определим ячейку-источник
	Попытка
		ЯчейкаИсточник = ТабИсточник.Области[ИмяЯчейкиИсточник];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: в разделе %2 не найдена ячейка %3'"),
		ИмяРазделаРезультат,
		ИмяРазделаИсточник,
		ИмяЯчейкиИсточник);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// Определим значение - источник, умноженное на "Множитель"
	ЗначениеИсточник = ЯчейкаИсточник.Значение * Множитель;
	
	// Лобавим к значению в ячейке-результат новое значение
	ЯчейкаРезультат.Значение = ЯчейкаРезультат.Значение + КонсолидированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЗначениеИсточник, СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения, СтруктураРеквизитовФормы.мДелитель);
	
	// Определим какой должен быть знак (+/-) в расшифровке
	ЗнакВРасшифровке = ?(Множитель > 0, "+", "-");
	
	Если ИмяПоказателяИсточник_исх = ""
		и Множитель <> 1 и Множитель <> -1 
		Тогда
		МножительБезЗнака = ?(Множитель > 0, Множитель, -Множитель);
		ИмяПоказателяИсточник = ИмяПоказателяИсточник + " * " + МножительБезЗнака;
	КонецЕсли;
	
	// Сформируем текст расшифровки по шаблону: "Закладка ...., имя показателя"
	ТекстРасшифровки = "Закладка «" + СтраницаИсточник.Представление + "»";
	Если ЗначениеЗаполнено(ИмяПоказателяИсточник) Тогда
		ТекстРасшифровки = ТекстРасшифровки + ", " + ИмяПоказателяИсточник;
	КонецЕсли;
	
	// Заменим служебные команды по периоду
	стрИмяПоказателяРезультат = СтрЗаменить(ИмяПоказателяРезультат, "#ПериодТекущий#", СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода);
	стрИмяПоказателяРезультат = СтрЗаменить(стрИмяПоказателяРезультат, "#ПериодПредыдущий#", СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода);
	
	// Добавим в расшифровку
	ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейкиРезультат, стрИмяПоказателяРезультат, ЗнакВРасшифровке, ТекстРасшифровки, ЗначениеИсточник, , , , , ИмяРазделаРезультат);
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейку

&НаСервере
Процедура Расчет(ИмяРаздела = "")
	
	КонсолидированнаяОтчетностьКлиентСервер.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	Если ИмяРаздела = "" Тогда
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				Выполнить("РасчетРаздела_" + ТекСтрока.ИмяРаздела + "(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела)");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
			Выполнить("РасчетРаздела_" + ИмяРаздела + "(ТекРаздел, ИмяРаздела)");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ КонсолидированнаяОтчетностьКлиентСервер.НуженПересчетОсновногоРаздела("ТабличныйДокумент" + ИмяРаздела) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		Возврат;
	КонецЕсли;
	
	// Расчет основного раздела
	Очистить(ИмяОсновногоРаздела);
	ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяОсновногоРаздела);
	Выполнить("РасчетРаздела_" + ИмяОсновногоРаздела + "(ТекРаздел, ИмяОсновногоРаздела)");
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОтчетТитульнаяСтраница(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области["ТекущийПериод1"].Значение = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
	Если НЕ СведенияОбОрганизации = Неопределено Тогда
	
		ТекРаздел.Области["Организация"].Значение = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
			СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
			СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
		ТекРаздел.Области["ПочтовыйАдресОрганизации"].Значение = СведенияОбОрганизации.ЮридическийАдрес;
	
	КонецЕсли; 
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0102", "ДенежныеСредства", "П0602");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0103", "ДенежныеСредства", "П0605");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0302", "ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбыток", "П0602");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0303", "ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбыток", "П0603");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0902", "ДепозитыИСредстваВКредитныхОрганизациях", "П0604");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0903", "ДепозитыИСредстваВКредитныхОрганизациях", "П0607");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1002", "ПрочиеРазмещенныеСредстваДЗ", "П0804");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1003", "ПрочиеРазмещенныеСредстваДЗ", "П0807");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2902", "ПрочаяКредиторскаяЗадолженность", "П0502");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2903", "ПрочаяКредиторскаяЗадолженность", "П0503");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5202", "НераспределеннаяПрибыль", "П0202");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5203", "НераспределеннаяПрибыль", "П0203");
	
	Для НомКол = 2 По 3 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П24" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П24" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П42" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П43" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П52" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П53" + СтрНомКол, 1);

	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ДенежныеСредства(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0102", ТекРаздел, "П0103", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0102", ТекРаздел, "П0104", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0202", ТекРаздел, "П0203", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0202", ТекРаздел, "П0204", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0302", ТекРаздел, "П0303", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0302", ТекРаздел, "П0304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0402", ТекРаздел, "П0403", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0402", ТекРаздел, "П0404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0502", ТекРаздел, "П0503", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0502", ТекРаздел, "П0504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0106", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0107", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0206", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0306", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0406", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0506", -1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0507", 1);

	Для НомКол = 2 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

	КонецЦикла;	

	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 6 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "05"];
			Ячейка.Значение = 0;
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "06"];
			Ячейка.Значение = 0;
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "07"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_КомпонентыДенежныхСредствИИхЭквивалентов(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);

	КонецЦикла;	

	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 5 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ВыверкаИзмененийПолнойБалансовойСтоимостиДенежныхСредств(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0204", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0704", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0804", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0905", ТекРаздел, "П0902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0905", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0905", ТекРаздел, "П0904", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1005", ТекРаздел, "П1002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1005", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1005", ТекРаздел, "П1004", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1205", ТекРаздел, "П1202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1205", ТекРаздел, "П1203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1205", ТекРаздел, "П1204", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1305", ТекРаздел, "П1302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1305", ТекРаздел, "П1303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1305", ТекРаздел, "П1304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1405", ТекРаздел, "П1402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1405", ТекРаздел, "П1403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1405", ТекРаздел, "П1404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1505", ТекРаздел, "П1502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1505", ТекРаздел, "П1503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1505", ТекРаздел, "П1504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1705", ТекРаздел, "П1702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1705", ТекРаздел, "П1703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1705", ТекРаздел, "П1704", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1805", ТекРаздел, "П1802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1805", ТекРаздел, "П1803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1805", ТекРаздел, "П1804", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1905", ТекРаздел, "П1902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1905", ТекРаздел, "П1903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1905", ТекРаздел, "П1904", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2005", ТекРаздел, "П2002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2005", ТекРаздел, "П2003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2005", ТекРаздел, "П2004", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2205", ТекРаздел, "П2202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2205", ТекРаздел, "П2203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2205", ТекРаздел, "П2204", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2305", ТекРаздел, "П2302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2305", ТекРаздел, "П2303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2305", ТекРаздел, "П2304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2405", ТекРаздел, "П2402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2405", ТекРаздел, "П2403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2405", ТекРаздел, "П2404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2505", ТекРаздел, "П2502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2505", ТекРаздел, "П2503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2505", ТекРаздел, "П2504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2705", ТекРаздел, "П2702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2705", ТекРаздел, "П2703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2705", ТекРаздел, "П2704", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2805", ТекРаздел, "П2802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2805", ТекРаздел, "П2803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2805", ТекРаздел, "П2804", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2905", ТекРаздел, "П2902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2905", ТекРаздел, "П2903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2905", ТекРаздел, "П2904", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3005", ТекРаздел, "П3002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3005", ТекРаздел, "П3003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3005", ТекРаздел, "П3004", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3205", ТекРаздел, "П3202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3205", ТекРаздел, "П3203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3205", ТекРаздел, "П3204", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3305", ТекРаздел, "П3302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3305", ТекРаздел, "П3303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3305", ТекРаздел, "П3304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3405", ТекРаздел, "П3402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3405", ТекРаздел, "П3403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3405", ТекРаздел, "П3404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3505", ТекРаздел, "П3502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3505", ТекРаздел, "П3503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3505", ТекРаздел, "П3504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3705", ТекРаздел, "П3702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3705", ТекРаздел, "П3703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3705", ТекРаздел, "П3704", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3805", ТекРаздел, "П3802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3805", ТекРаздел, "П3803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3805", ТекРаздел, "П3804", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3905", ТекРаздел, "П3902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3905", ТекРаздел, "П3903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3905", ТекРаздел, "П3904", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4005", ТекРаздел, "П4002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4005", ТекРаздел, "П4003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4005", ТекРаздел, "П4004", 1);

	Для НомКол = 2 По 5 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ФинансовыеАктивыПоСправедливойСтоимостиЧерезПрибыльУбыток(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

	КонецЦикла;	
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 6 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ЦенныеБумагиПоСправедливойСтоимостиЧерезПрибыльУбыток(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

	КонецЦикла;	

	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 12 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_РеклассификацияПоСправедливойСтоимостиЧерезПрибыльУбыток(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 6 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ПрочиеРазмещенныеСредстваДЗ(ТекРаздел, ИмяРаздела)
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0104", ТекРаздел, "П0102", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0104", ТекРаздел, "П0103", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0204", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0204", ТекРаздел, "П0203", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0304", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0304", ТекРаздел, "П0303", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0404", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0404", ТекРаздел, "П0403", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0504", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0504", ТекРаздел, "П0503", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0604", ТекРаздел, "П0602", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0604", ТекРаздел, "П0603", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0704", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0704", ТекРаздел, "П0703", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0105", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0106", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0206", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0306", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0406", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0506", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0607", ТекРаздел, "П0605", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0607", ТекРаздел, "П0606", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0707", ТекРаздел, "П0705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0707", ТекРаздел, "П0706", -1);

	Для НомКол = 2 По 7 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
	КонецЦикла;	
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
	И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Для НомСтр = 1 По 8 Цикл
			ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "05"].Значение = 0;
			ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "06"].Значение = 0;
			ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "07"].Значение = 0;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ВыверкаИзмененийПолнойБалансовойСтоимостиПрочихРазмещенныхСредствИДЗ(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1007", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2007", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3007", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4007", 1);

	Для НомКол = 2 По 8 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ВыверкаИзмененийРезерваПодОбесценениеПрочихРазмещенныхСредствИДЗ(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0208", ТекРаздел, "П0207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0308", ТекРаздел, "П0307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0408", ТекРаздел, "П0407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0508", ТекРаздел, "П0507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0708", ТекРаздел, "П0707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0808", ТекРаздел, "П0807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0908", ТекРаздел, "П0907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1008", ТекРаздел, "П1007", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1208", ТекРаздел, "П1207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1308", ТекРаздел, "П1307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1408", ТекРаздел, "П1407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1508", ТекРаздел, "П1507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1708", ТекРаздел, "П1707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1808", ТекРаздел, "П1807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1908", ТекРаздел, "П1907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2008", ТекРаздел, "П2007", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2208", ТекРаздел, "П2207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2308", ТекРаздел, "П2307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2408", ТекРаздел, "П2407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2508", ТекРаздел, "П2507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2708", ТекРаздел, "П2707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2808", ТекРаздел, "П2807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2908", ТекРаздел, "П2907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3008", ТекРаздел, "П3007", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3208", ТекРаздел, "П3207", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3308", ТекРаздел, "П3307", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3408", ТекРаздел, "П3407", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3508", ТекРаздел, "П3507", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3708", ТекРаздел, "П3707", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3808", ТекРаздел, "П3807", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3908", ТекРаздел, "П3907", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4008", ТекРаздел, "П4007", 1);

	Для НомКол = 2 По 8 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ИнформацияОПлатежахКПолучениюПоФинансовойАренде(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0102", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0104", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0204", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П0602", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П0603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П0604", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0704", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0804", 1);

	Для НомКол = 2 По 5 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ПрочаяКредиторскаяЗадолженность(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);

	КонецЦикла;	

	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 5 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_НераспределеннаяПрибыль(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		
	КонецЦикла;
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 2 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ИнформацияОКредитныхРейтингахДолговыхИнструментов(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 6 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ГеографическийАнализФинансовыхАктивовИОбязательств(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 4 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0905", ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1005", ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1105", ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1205", ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1305", ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1405", ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1505", ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1805", ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1905", ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2105", ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2205", ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2305", ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2405", ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2505", ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2605", ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2705", ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2805", ТекРаздел, "П28" + СтрНомКол, 1);

	КонецЦикла;

	Для НомКол = 2 По 5 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П20" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П20" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П20" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П30" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П30" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, -1);

	КонецЦикла;		

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоков(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0207", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0208", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0210", ТекРаздел, "П0209", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0307", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0308", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0310", ТекРаздел, "П0309", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0407", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0408", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0410", ТекРаздел, "П0409", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0507", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0508", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0510", ТекРаздел, "П0509", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0707", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0708", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0710", ТекРаздел, "П0709", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0807", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0808", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0810", ТекРаздел, "П0809", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0907", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0908", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0910", ТекРаздел, "П0909", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1007", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1008", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1010", ТекРаздел, "П1009", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1102", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1105", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1106", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1107", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1108", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1110", ТекРаздел, "П1109", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1207", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1208", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1210", ТекРаздел, "П1209", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1307", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1308", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1310", ТекРаздел, "П1309", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1602", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1605", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1606", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1607", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1608", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1610", ТекРаздел, "П1609", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1707", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1708", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1710", ТекРаздел, "П1709", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1807", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1808", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1810", ТекРаздел, "П1809", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1907", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1908", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1910", ТекРаздел, "П1909", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2007", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2008", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2010", ТекРаздел, "П2009", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2102", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2105", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2106", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2107", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2108", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2110", ТекРаздел, "П2109", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2207", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2208", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2210", ТекРаздел, "П2209", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2307", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2308", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2310", ТекРаздел, "П2309", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2407", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2408", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2410", ТекРаздел, "П2409", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2507", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2508", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2510", ТекРаздел, "П2509", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2707", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2708", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2710", ТекРаздел, "П2709", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2807", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2808", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2810", ТекРаздел, "П2809", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2907", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2908", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2910", ТекРаздел, "П2909", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3007", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3008", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3010", ТекРаздел, "П3009", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3307", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3308", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3310", ТекРаздел, "П3309", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3407", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3408", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3410", ТекРаздел, "П3409", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3507", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3508", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3510", ТекРаздел, "П3509", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3602", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3605", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3606", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3607", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3608", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3610", ТекРаздел, "П3609", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3707", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3708", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3710", ТекРаздел, "П3709", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3907", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3908", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3910", ТекРаздел, "П3909", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4006", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4007", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4008", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4010", ТекРаздел, "П4009", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4102", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4105", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4106", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4107", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4108", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4110", ТекРаздел, "П4109", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4207", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4208", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4210", ТекРаздел, "П4209", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4307", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4308", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4310", ТекРаздел, "П4309", 1);

	Для НомКол = 2 По 10 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П15" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П38" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П38" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П38" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П38" + СтрНомКол, ТекРаздел, "П42" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П44" + СтрНомКол, ТекРаздел, "П43" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

// 57.18
&НаСервере
Процедура РасчетРаздела_АнализФинансовыхАктивовИОбязательствВРазрезеСроков(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 4 Цикл
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00205", ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00305", ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00405", ТекРаздел, "П004" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005а05", ТекРаздел, "П005а" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00705", ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00805", ТекРаздел, "П008" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00905", ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01005", ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01105", ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01205", ТекРаздел, "П012" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01305", ТекРаздел, "П013" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01605", ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01705", ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01805", ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01905", ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02005", ТекРаздел, "П020" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02105", ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02205", ТекРаздел, "П022" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02505", ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02605", ТекРаздел, "П026" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02705", ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02805", ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02905", ТекРаздел, "П029" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03005", ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03105", ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03205", ТекРаздел, "П032" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03505", ТекРаздел, "П035" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03605", ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03705", ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03805", ТекРаздел, "П038" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03905", ТекРаздел, "П039" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04105", ТекРаздел, "П041" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04205", ТекРаздел, "П042" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04305", ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04405", ТекРаздел, "П044" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04505", ТекРаздел, "П045" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04605", ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04705", ТекРаздел, "П047" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04805", ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04905", ТекРаздел, "П049" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05205", ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05305", ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05405", ТекРаздел, "П054" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05605", ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05705", ТекРаздел, "П057" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05805", ТекРаздел, "П058" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05905", ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06005", ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06105", ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06205", ТекРаздел, "П062" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06505", ТекРаздел, "П065" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06605", ТекРаздел, "П066" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06705", ТекРаздел, "П067" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06805", ТекРаздел, "П068" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07005", ТекРаздел, "П070" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07105", ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07205", ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07305", ТекРаздел, "П073" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07405", ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07505", ТекРаздел, "П075" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07805", ТекРаздел, "П078" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07905", ТекРаздел, "П079" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08005", ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08105", ТекРаздел, "П081" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08205", ТекРаздел, "П082" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08305", ТекРаздел, "П083" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08405", ТекРаздел, "П084" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08605", ТекРаздел, "П086" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08705", ТекРаздел, "П087" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08905", ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09005", ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09105", ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09205", ТекРаздел, "П092" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09505", ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09605", ТекРаздел, "П096" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09705", ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09805", ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09905", ТекРаздел, "П099" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10105", ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10205", ТекРаздел, "П102" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10305", ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10405", ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10505", ТекРаздел, "П105" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10605", ТекРаздел, "П106" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10705", ТекРаздел, "П107" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10805", ТекРаздел, "П108" + СтрНомКол, 1);	
	КонецЦикла;
	
	Для НомКол = 2 По 5 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П006" + СтрНомКол, ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П006" + СтрНомКол, ТекРаздел, "П008" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П006" + СтрНомКол, ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П006" + СтрНомКол, ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П006" + СтрНомКол, ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П006" + СтрНомКол, ТекРаздел, "П012" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П005а" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П013" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П023" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П023" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П023" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П034" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П034" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П034" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П034" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П034" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П040" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П063" + СтрНомКол, ТекРаздел, "П001" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П063" + СтрНомКол, ТекРаздел, "П005" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П063" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П063" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П063" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П063" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П063" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П069" + СтрНомКол, ТекРаздел, "П070" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П069" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П069" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П069" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П069" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П069" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П077" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П077" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П077" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П077" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П077" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П077" + СтрНомКол, ТекРаздел, "П083" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П077" + СтрНомКол, ТекРаздел, "П084" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П085" + СтрНомКол, ТекРаздел, "П086" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П085" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П093" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П093" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П064" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, -1);
	КонецЦикла; 	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОбзорФинансовыхАктивовИОбязательствВРазрезеОсновныхВалют(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 5 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0106", ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0606", ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1106", ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1606", ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2106", ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2606", ТекРаздел, "П26" + СтрНомКол, 1);

	КонецЦикла;

	Для НомКол = 2 По 6 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П27" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П28" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, -1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_АнализПроцентногоРискаКВозможнымИзменениямВПроцентныхСтавках(ТекРаздел, ИмяРаздела)
	
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_УровниВИерархииСправедливойСтоимости(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 4 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00605", ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00705", ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00805", ТекРаздел, "П008" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01005", ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01105", ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01205", ТекРаздел, "П012" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01305", ТекРаздел, "П013" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01405", ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01505", ТекРаздел, "П015" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01605", ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01905", ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02005", ТекРаздел, "П020" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02105", ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02205", ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02305", ТекРаздел, "П023" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02505", ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02605", ТекРаздел, "П026" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02705", ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02805", ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02905", ТекРаздел, "П029" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03105", ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03205", ТекРаздел, "П032" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03305", ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03405", ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03505", ТекРаздел, "П035" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03705", ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03805", ТекРаздел, "П038" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03905", ТекРаздел, "П039" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04005", ТекРаздел, "П040" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04105", ТекРаздел, "П041" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04305", ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04405", ТекРаздел, "П044" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04505", ТекРаздел, "П045" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04605", ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04705", ТекРаздел, "П047" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04805", ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04905", ТекРаздел, "П049" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05205", ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05305", ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05405", ТекРаздел, "П054" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05505", ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05605", ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05705", ТекРаздел, "П057" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05805", ТекРаздел, "П058" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06205", ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06305", ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06405", ТекРаздел, "П064" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06505", ТекРаздел, "П065" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06805", ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06905", ТекРаздел, "П069" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07005", ТекРаздел, "П070" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07105", ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07205", ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07305", ТекРаздел, "П073" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07405", ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07505", ТекРаздел, "П075" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07605", ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07705", ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07805", ТекРаздел, "П078" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08005", ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08105", ТекРаздел, "П081" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08205", ТекРаздел, "П082" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08305", ТекРаздел, "П083" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08505", ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08805", ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08905", ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09205", ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09305", ТекРаздел, "П093" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09405", ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09505", ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09605", ТекРаздел, "П096" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09805", ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09905", ТекРаздел, "П099" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10005", ТекРаздел, "П100" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10105", ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10205", ТекРаздел, "П102" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10405", ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10505", ТекРаздел, "П105" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10605", ТекРаздел, "П106" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10705", ТекРаздел, "П107" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10805", ТекРаздел, "П108" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11005", ТекРаздел, "П110" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11105", ТекРаздел, "П111" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11205", ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11305", ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11405", ТекРаздел, "П114" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11605", ТекРаздел, "П116" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11705", ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11805", ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11905", ТекРаздел, "П119" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12005", ТекРаздел, "П120" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12105", ТекРаздел, "П121" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12305", ТекРаздел, "П123" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12405", ТекРаздел, "П124" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12505", ТекРаздел, "П125" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12605", ТекРаздел, "П126" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12705", ТекРаздел, "П127" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12805", ТекРаздел, "П128" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12905", ТекРаздел, "П129" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13005", ТекРаздел, "П130" + СтрНомКол, 1);

	КонецЦикла;

	Для НомКол = 2 По 5 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П008" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П012" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П013" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П005" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П064" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П060" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П060" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П059" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П059" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П070" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П110" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П111" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П114" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П116" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П119" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П120" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П115" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П121" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П123" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П124" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П125" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П126" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П127" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П128" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П129" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П122" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П084" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П084" + СтрНомКол, ТекРаздел, "П130" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня2(ТекРаздел, ИмяРаздела)
	
	НомКол = 2;
	//Для НомКол = 2 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П008" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П012" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П013" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П005" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П064" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П060" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П060" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П059" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П059" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П070" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П110" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П111" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П114" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П116" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П119" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П120" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П115" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П121" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П123" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П124" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П125" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П126" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П127" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П128" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П129" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П122" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П084" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П084" + СтрНомКол, ТекРаздел, "П130" + СтрНомКол, 1);

	//КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня3(ТекРаздел, ИмяРаздела)
	
	НомКол = 2;
	//Для НомКол = 2 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П005" + СтрНомКол, ТекРаздел, "П008" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П012" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П013" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П009" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П018" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П024" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П030" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П036" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П042" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П017" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П005" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П051" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П050" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П061" + СтрНомКол, ТекРаздел, "П064" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П060" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П060" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П059" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П059" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П070" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П066" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П079" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П091" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П097" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П103" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П110" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П111" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П114" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П116" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П119" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П115" + СтрНомКол, ТекРаздел, "П120" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П090" + СтрНомКол, ТекРаздел, "П115" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П087" + СтрНомКол, ТекРаздел, "П121" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П123" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П124" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П125" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П126" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П127" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П128" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П122" + СтрНомКол, ТекРаздел, "П129" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П122" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П084" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П084" + СтрНомКол, ТекРаздел, "П130" + СтрНомКол, 1);

	//КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_АнализСправедливойСтоимостиИБалансоваяСтоимость(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 4 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1005", ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1105", ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1205", ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1305", ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1505", ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1605", ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1705", ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1805", ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1905", ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2005", ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2105", ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2405", ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2505", ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2605", ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2705", ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2805", ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3005", ТекРаздел, "П30" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3105", ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3205", ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3305", ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3405", ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3505", ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3605", ТекРаздел, "П36" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3705", ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3805", ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3905", ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4005", ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4105", ТекРаздел, "П41" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4405", ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4505", ТекРаздел, "П45" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4605", ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4705", ТекРаздел, "П47" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4805", ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4905", ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5005", ТекРаздел, "П50" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5205", ТекРаздел, "П52" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5305", ТекРаздел, "П53" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5605", ТекРаздел, "П56" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5705", ТекРаздел, "П57" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5805", ТекРаздел, "П58" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5905", ТекРаздел, "П59" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6005", ТекРаздел, "П60" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6205", ТекРаздел, "П62" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6305", ТекРаздел, "П63" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6405", ТекРаздел, "П64" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6505", ТекРаздел, "П65" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6705", ТекРаздел, "П67" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6805", ТекРаздел, "П68" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П6905", ТекРаздел, "П69" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П7005", ТекРаздел, "П70" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П7105", ТекРаздел, "П71" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П7205", ТекРаздел, "П72" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П7305", ТекРаздел, "П73" + СтрНомКол, 1);

	КонецЦикла;

	Для НомКол = 2 По 6 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П22" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П22" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П51" + СтрНомКол, ТекРаздел, "П52" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П51" + СтрНомКол, ТекРаздел, "П53" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П56" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П57" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П58" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П59" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П60" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П61" + СтрНомКол, ТекРаздел, "П62" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П61" + СтрНомКол, ТекРаздел, "П63" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П61" + СтрНомКол, ТекРаздел, "П64" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П61" + СтрНомКол, ТекРаздел, "П65" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П55" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П61" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П67" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П68" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П69" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П66" + СтрНомКол, ТекРаздел, "П70" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П43" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П54" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П66" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П71" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П72" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П42" + СтрНомКол, ТекРаздел, "П73" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ДепозитыИСредстваВКредитныхОрганизациях(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0104", ТекРаздел, "П0102", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0104", ТекРаздел, "П0103", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0204", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0204", ТекРаздел, "П0203", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0304", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0304", ТекРаздел, "П0303", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0404", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0404", ТекРаздел, "П0403", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0504", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0504", ТекРаздел, "П0503", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0105", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0106", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0206", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0306", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0406", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0506", -1);
	
	Если НЕ ЭтотОбъект.СтруктураРеквизитовФормы.НКО Тогда 	
		ТекРаздел.Области.СтрокаПрочие.Текст = "Прочие размещенные средства в кредитных организациях и банках-нерезидентах";		
	КонецЕсли;	

	Для НомКол = 2 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ВыверкаИзмененийПолнойБалансовойСтоимостиДепозитовИПрочихСредств(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4005", 1);

	Для НомКол = 2 По 6 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ВыверкаИзмененийУбыткаОтОбесцененияДепозитовИПрочихСредств(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0206", ТекРаздел, "П0205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0306", ТекРаздел, "П0305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0406", ТекРаздел, "П0405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0506", ТекРаздел, "П0505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0706", ТекРаздел, "П0705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0806", ТекРаздел, "П0805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0906", ТекРаздел, "П0905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1006", ТекРаздел, "П1005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1206", ТекРаздел, "П1205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1306", ТекРаздел, "П1305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1406", ТекРаздел, "П1405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1506", ТекРаздел, "П1505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1706", ТекРаздел, "П1705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1806", ТекРаздел, "П1805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1906", ТекРаздел, "П1905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2006", ТекРаздел, "П2005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2206", ТекРаздел, "П2205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2306", ТекРаздел, "П2305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2406", ТекРаздел, "П2405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2506", ТекРаздел, "П2505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2706", ТекРаздел, "П2705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2806", ТекРаздел, "П2805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2906", ТекРаздел, "П2905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3006", ТекРаздел, "П3005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3202", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3206", ТекРаздел, "П3205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3302", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3306", ТекРаздел, "П3305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3402", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3406", ТекРаздел, "П3405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3502", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3506", ТекРаздел, "П3505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3702", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3706", ТекРаздел, "П3705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3802", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3806", ТекРаздел, "П3805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3902", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П3906", ТекРаздел, "П3905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4002", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4006", ТекРаздел, "П4005", 1);

	Для НомКол = 2 По 6 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения(ТекРаздел, ИмяРаздела)	

КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область НастройкиОтчета

&НаКлиенте
Процедура ОткрытьФормуНастроекЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЕдиницаИзмерения 			= ДополнительныеПараметры.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= ДополнительныеПараметры.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= ДополнительныеПараметры.ВалютаДокумента;
	ИсходныйПодписант 			= ДополнительныеПараметры.Подписант;
	ОтчетНаКонецПрошлогоГода	= ДополнительныеПараметры.ОтчетНаКонецПрошлогоГода;
	
	Если ЕдиницаИзмерения <> СтруктураРеквизитовФормы.ЕдиницаИзмерения Тогда
		
		ЕдиницаИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ТочностьЕдиницыИзмерения <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		
		ТочностьЕдиницыИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ВалютаДокумента <> СтруктураРеквизитовФормы.ВалютаДокумента Тогда
		
		ВалютаДокументаПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ИсходныйПодписант <> ЭтаФорма.Подписант Тогда
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ОтчетНаКонецПрошлогоГода <> СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	Модифицированность = Истина;
	
	СтруктураОтбора = Новый Структура("ИмяРаздела", СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета.НайтиСтроки(СтруктураОтбора)[0].ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВывода()

	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении()
	
	ТекстСообщения = НСтр("ru = 'Изменена валюта представления отчетности.
	|Перезаполнить документ?'");
	
	ПоказатьВопрос(
	Новый ОписаниеОповещения(
	"ВалютаДокументаПриИзмененииЗавершение",
	ЭтотОбъект),
	ТекстСообщения,
	РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвто();
	КонецЕсли;
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в рублях точность не может превышать 2 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в тысячах рублей точность не может превышать 3 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в миллионах рублей точность не может превышать 6 знаков'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьТочность()
	
#КонецОбласти 

#Область ЗаписьОтчета

&НаКлиенте
Процедура СохранитьНаКлиенте(ВыполняемоеОповещение=Неопределено) Экспорт

	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		ИмяСобытия = "ЗаписьРегламентированногоОтчета";
	Иначе
		ИмяСобытия = "ЗаписьНовогоРегламентированногоОтчета";
	КонецЕсли; 
	
	ЗаполнитьПоказатели();
	ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
	
		Модифицированность = Ложь;
	
		ИсторияРаботыПользователя.Добавить(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок);
		
		Оповестить(ИмяСобытия, Новый Структура("Ключ", СтруктураРеквизитовФормы.мСохраненныйДок));
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	КонсолидированнаяОтчетность.ЗаписатьОтчет(ЭтаФорма);

КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьПоказатели()

	ЭтаФорма.Показатели.Очистить();
		
	Для Каждого ТекСтрока Из РазделыОтчета Цикл
		
		Попытка
			ОбластиРаздела = ТекСтрока.ТабличныйДокумент.Области;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого ТекОбласть Из ОбластиРаздела Цикл
			
			Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Если Не ТекОбласть.СодержитЗначение Тогда
					Продолжить;
				КонецЕсли;
			Исключение
				ТекстСообщения = "Ошибка макета: раздел " + ТекСтрока.ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(ТекОбласть.Значение) Тогда
			
				Продолжить;
			
			КонецЕсли; 
			
			НоваяСтрока = ЭтаФорма.Показатели.Добавить();
			НоваяСтрока.ИмяРаздела 		= ТекСтрока.ИмяРаздела;
			НоваяСтрока.ИмяПоказателя 	= ТекОбласть.Имя;
			НоваяСтрока.Значение 		= ТекОбласть.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтаФорма.Показатели.Сортировать("ИмяРаздела, ИмяПоказателя");
	
КонецПроцедуры

#КонецОбласти 

#Область Расшифровка

&НаКлиенте
Процедура РасшифровкаНажатиеВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Адрес_Расшифровка 	= ДополнительныеПараметры.Адрес_Расшифровка;
	ИмяРаздела 			= ДополнительныеПараметры.ИмяРаздела;
	
	ИмяЯчейки = "";
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатиеЗавершение(Знач Адрес_Расшифровка, Знач ИмяРаздела, ИмяЯчейки)
	
	СтруктураПараметров = Новый Структура(
	"Адрес_Расшифровка,
	|Адрес_СтруктураВариантыЗаполнения,
	|ОсобыйАлгоритмРасшифровки",
	Адрес_Расшифровка,
	Адрес_мСтруктураВариантыЗаполнения,
	Истина);
	
	ТабДок = КонсолидированнаяОтчетность.СформироватьМакетРасшифровки(ИмяРаздела, ИмяЯчейки, СтруктураПараметров);
	
	ВывестиРасшифровкуСервер(ТабДок, ИмяЯчейки);
	
	Элементы.ГруппаРасшифровки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Новый Структура("ИмяЯчейки, Раздел", ИмяЯчейки, ИмяРаздела));
	
	ЕстьРасшифровка = (Не НайденныеСтроки.Количество() = 0);
		
	СтруктураОтбора = Новый Структура("Раздел, ИмяЯчейки", ИмяРаздела, ИмяЯчейки);
	пТаблицаРасшифровки = ТаблицаРасшифровки.Скопировать(СтруктураОтбора);
	
	Если пТаблицаРасшифровки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Адрес_Расшифровка = ПоместитьВоВременноеХранилище(пТаблицаРасшифровки, УникальныйИдентификатор);
	
	Возврат ЕстьРасшифровка;
	
КонецФункции

&НаСервере
Процедура ВывестиРасшифровкуСервер(ТабДок, ИмяСтраницы)
	
	КоличествоРасшифровок = КоличествоРасшифровок + 1;
	НомерСтраницы = Формат(КоличествоРасшифровок, "ЧГ=0");
	ИмяСтраницы = ?(ИмяСтраницы = "", "Расшифровка № " + КоличествоРасшифровок, ИмяСтраницы);
	
	ИмяЭлемента = "СтраницаРасшифровки" + НомерСтраницы;
	ТекСтраница = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Элементы.СтраницыРасшифровки);
	ТекСтраница.Заголовок = ИмяСтраницы;
	
	ИмяЭлемента = "ТабДок_Расшифровка" + НомерСтраницы;
	
	МассивДобавляемых = Новый Массив;
	МассивДобавляемых.Добавить(Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов("ТабличныйДокумент")));
	ИзменитьРеквизиты(МассивДобавляемых);
	
	ТекЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ТекСтраница);
	ТекЭлемент.ПутьКДанным = ИмяЭлемента;
	ТекЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ТекЭлемент.ГоризонтальнаяПолосаПрокрутки = Ложь;
	
	ЭтотОбъект[ИмяЭлемента] = ТабДок;
	
	Элементы.СтраницыРасшифровки.ТекущаяСтраница = ТекСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьРасшифровкуСервер()
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекРасшифровка = Элементы.СтраницыРасшифровки.ТекущаяСтраница;
	СтраницыРасшифровки = Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы;
	
	Если ТекРасшифровка = Неопределено Тогда
		ТекРасшифровка = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
	КонецЕсли;
	
	ТекРасшифровка.Видимость = Ложь;
	
	МассивУдаляемых = Новый Массив;
	МассивУдаляемых.Добавить(ТекРасшифровка.ПодчиненныеЭлементы[0].ПутьКДанным);
	ИзменитьРеквизиты( , МассивУдаляемых);
	
	Элементы.Удалить(ТекРасшифровка);
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		
	ИначеЕсли Элементы.СтраницыРасшифровки.ТекущаяСтраница = Неопределено Тогда
		
		Элементы.СтраницыРасшифровки.ТекущаяСтраница = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьНажатие(Команда)
	
	ЗаполнитьАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	ЗаполнитьАвто(ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНажатие(Команда)
	
	Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Очистить(ИмяРаздела);
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		
		Очистить(ИмяОсновногоРаздела);
		Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо сохранить документ.");
		Возврат;
	
	КонецЕсли; 
	
	ИмяФайла = "Бухгалтерский баланс на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD");
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогСохраненияФайла.Фильтр             = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок          = "Укажите файл";
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	СписокРазделовПредыдущегоГода = КонсолидированнаяОтчетность.ПолучитьСписокРазделовПредыдущегоГода("РегламентированныйОтчетБаланс", СтруктураРеквизитовФормы.мВыбраннаяФорма, СтруктураРеквизитовФормы.НКО);
		
	КонсолидированнаяОтчетностьКлиент.СохранитьРегламентированныйОтчетВExcel(ЭтаФорма, ДиалогСохраненияФайла.ПолноеИмяФайла, ЭтаФорма.СохраняемыеРазделы, СписокРазделовПредыдущегоГода, ЭтаФорма.ВыводитьСопоставимыеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНаКлиенте();
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", 					СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", 			СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения", 	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	ПараметрыФормы.Вставить("ОтчетНаКонецПрошлогоГода", 	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	ПараметрыФормы.Вставить("Подписант", 					ЭтаФорма.Подписант);
	ПараметрыФормы.Вставить("ИсточникОтчета",				СтруктураНаименованийОтчета.ИсточникОтчета);
	ПараметрыФормы.Вставить("ВыбраннаяФорма",				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	
	ФормаНастройкиОтчета = ПолучитьФорму("Отчет." + СтруктураНаименованийОтчета.ИсточникОтчета + ".Форма.НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ЕдиницаИзмерения 			= СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= СтруктураРеквизитовФормы.ВалютаДокумента;
	Подписант 					= ЭтаФорма.Подписант;
	ОтчетНаКонецПрошлогоГода 	= СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода;
	
	ДополнительныеПараметры = Новый Структура("ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ОтчетНаКонецПрошлогоГода", ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ОтчетНаКонецПрошлогоГода);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуНастроекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСкрытьПоказать(Команда)
	
	Элементы.ГруппаРасшифровки.Видимость = Не Элементы.ГруппаРасшифровки.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатие(Команда)
	
	ИмяРаздела = ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	Если ИмяРаздела = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИмяЯчейки = ЭтаФорма.ТабличныйДокумент.ТекущаяОбласть.Имя;
	Исключение
		Возврат;
	КонецПопытки;
	
	Адрес_Расшифровка = "";
	
	// Считываем и помещаем данные на сервере
	РасшифровкаНайдена = РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка);
	
	Если РасшифровкаНайдена = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Расшифровка не сформирована.
		|Расшифровка формируется при нажатии на кнопку ""Заполнить"".'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	Если НЕ РасшифровкаНайдена Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка для выбранной ячейки не существует.'"));
		
		Возврат;
		
		ТекстСообщения = НСтр("ru = 'Расшифровка для выбранной ячейки не существует.
		|Показать расшифровку для всех ячеек раздела?");
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РасшифровкаНажатиеВопросЗавершение",
		ЭтотОбъект,
		Новый Структура(
		"Адрес_Расшифровка,
		|ИмяРаздела",
		Адрес_Расшифровка,
		ИмяРаздела)),
		ТекстСообщения,
		РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьРасшифровкуНажатие(Команда)
	
	ЗакрытьРасшифровкуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.СтатусОтчета = "Корректировка" Тогда
		Элементы.НомерКорректировки.Видимость = Истина;
		ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
		ЭтаФорма.НомерКорректировки = ПолучитьНомерКорректировки(ЭтаФорма.СтруктураРеквизитовФормы, ИсточникОтчета);
	Иначе
		Элементы.НомерКорректировки.Видимость = Ложь;
		ЭтаФорма.НомерКорректировки = 0;
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерКорректировки(СтруктураРеквизитовФормы, ИсточникОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕстьNULL(МАКСИМУМ(РегламентированныйОтчет.НомерКорректировки), 0) КАК НомерКорректировки
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Организация = &Организация
		|	И РегламентированныйОтчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
		|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
		|	И РегламентированныйОтчет.ВалютаДокумента = &ВалютаДокумента
		|	И РегламентированныйОтчет.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И РегламентированныйОтчет.ТочностьЕдиницыИзмерения = &ТочностьЕдиницыИзмерения
		|	И РегламентированныйОтчет.ОтчетНаКонецПрошлогоГода = &ОтчетНаКонецПрошлогоГода
		|	И РегламентированныйОтчет.ОтчетЗаПоследнийКвартал = &ОтчетЗаПоследнийКвартал
		|	И РегламентированныйОтчет.ВыбраннаяФорма = &ВыбраннаяФорма
		|	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
		|	И РегламентированныйОтчет.СтатусОтчета = &СтатусОтчета";
	
	Запрос.УстановитьПараметр("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВыбраннаяФорма", 				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", 					НачалоДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", 				СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ИсточникОтчета", 				ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", 					СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ОтчетЗаПоследнийКвартал", 		Ложь);
	Запрос.УстановитьПараметр("ОтчетНаКонецПрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	Запрос.УстановитьПараметр("СтатусОтчета", 					"Корректировка");
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТочностьЕдиницыИзмерения", 		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерКорректировки = 0;
	Если Выборка.Следующий() Тогда
		НомерКорректировки = Выборка.НомерКорректировки;
	КонецЕсли;
	Возврат НомерКорректировки + 1;		
		
КонецФункции

&НаКлиенте
Процедура НомерКорректировкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьНастройкиВарианта(Команда)
	
	ДанныеВарианта = ОткрытьФормуМодально("ОбщаяФорма.ФормаНастройкиСохраняемыхРазделов",
							Новый Структура("СохраняемыеРазделы", ЭтаФорма.СохраняемыеРазделы));
	
	Если ДанныеВарианта = Неопределено ИЛИ ДанныеВарианта = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.СохраняемыеРазделы			= ДанныеВарианта.СохраняемыеРазделы;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.СохранитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетБаланс");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетБаланс", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		СохранитьВариантНастроекНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетБаланс");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетБаланс", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		ЗагрузитьВариантНастроекНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

