
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Запись		= Форма.Запись;
	Элементы	= Форма.Элементы;
	
	Элементы.ГруппаВидыОтчетности.Видимость = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Договор, "ВидДоговора") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДополнительноеСоглашение"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

