
#Область Расчет_НДФЛ

Функция ВыделитьДивиденды(ТаблицаРезультат, ТаблицаНастройки, ЯчейкаДивиденды, ОбластиИЗначения, ДатаНачальная, ДатаКонечная, ТабДивиденды, ОснованиеРасчета)

	// с октября 2019 года мы стали налоговым агентом. 
	// извлекаю дивиденды, выплаченнные после 01.10.2019 года  
	// 
	
	ДатаОтсечки = Дата(2019,10,1);
	СуммаДивиденды = 0;
	
	Если Год(ДатаКонечная) < 2019 Тогда 
		Возврат 0;
	Иначе 
		// устанавливаем месяц получения дивидендов
		// 
		СтрокаТаблицыНастроек = ТаблицаНастройки.Найти(ЯчейкаДивиденды, "ИмяПараметра");
		
		Отбор = Новый Структура();
		Отбор.Вставить("Счет", СтрокаТаблицыНастроек.Счет);
		Отбор.Вставить("ПрочиеДоходыРасходы", СтрокаТаблицыНастроек.СтатьяДоходаРасхода);
		
		СтрокиТаблицаРезультат = ТаблицаРезультат.НайтиСтроки(Отбор);
		Для Каждого СтрокаРезультат из СтрокиТаблицаРезультат Цикл 
			Если СтрокаРезультат.Регистратор.Дата < ДатаОтсечки Тогда 
				Продолжить;
			КонецЕсли;
			СуммаДивиденды = СуммаДивиденды + СтрокаРезультат.СуммаОборотКт - СтрокаРезультат.СуммаОборотДт;
			
			СтрДивиденды = ТабДивиденды.Добавить();
			СтрДивиденды.Сумма = СтрокаРезультат.СуммаОборотКт - СтрокаРезультат.СуммаОборотДт;
			СтрДивиденды.Год = Год(СтрокаРезультат.Регистратор.Дата);
			СтрДивиденды.Месяц = Месяц(СтрокаРезультат.Регистратор.Дата);
			СтрДивиденды.Знак = 1; 
			СтрДивиденды.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010;
		КонецЦикла;	
		Возврат СуммаДивиденды;		
	КонецЕсли;	
	
КонецФункции	

Функция ВычетСДивидендов(Организация, СчетДоверительногоУправления, ДатаНачальная, ДатаКонечная, ТабДивиденды, ОснованиеРасчета)
	
	ДатаОтсечки = Дата(2019,10,1);
	
	Если Год(ДатаКонечная) < 2019 Тогда 
		Возврат 0;
	КонецЕсли;
	
	// ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
  	//  выделяет те дивиденды по которым прошла оплата. Доход считается по выплате
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК ДокументНачисление,
	|	НачислениеДивидендов.ЦеннаяБумага КАК ЦеннаяБумага,
	|	НачислениеДивидендов.СуммаОбъявленная КАК СуммаОбъявленная,
	|	КодыВоВнешнихСистемахСрезПоследних.Код КАК ИдСобытия,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ _НачисленияДивидендов
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&ДатаНачальная,
	|			&ДатаКонечная,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
	|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = НачислениеДивидендов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
	|				&ДатаКонечная,
	|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.НРД)
	|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.КорпоративноеСобытиеПоВыплатеДивидендов)) КАК КодыВоВнешнихСистемахСрезПоследних
	|		ПО (НачислениеДивидендов.Ссылка = КодыВоВнешнихСистемахСрезПоследних.Объект)
	|ГДЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход > 0
	|	И ЗадолженностиПоДенежнымСредствамОбороты.Основание ССЫЛКА Документ.НачислениеДивидендов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ДивидендыПоАкциямСрезПоследних.Д1 = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДивидендыПоАкциямСрезПоследних.Д1 > ДивидендыПоАкциямСрезПоследних.Д2
	|					ТОГДА _НачисленияДивидендов.СуммаОбъявленная * ДивидендыПоАкциямСрезПоследних.Д2 / ДивидендыПоАкциямСрезПоследних.Д1
	|				ИНАЧЕ _НачисленияДивидендов.СуммаОбъявленная
	|			КОНЕЦ
	|	КОНЕЦ КАК Вычет,
	|	ГОД(_НачисленияДивидендов.Регистратор.Дата) КАК Год,
	|	МЕСЯЦ(_НачисленияДивидендов.Регистратор.Дата) КАК Месяц
	|ИЗ
	|	_НачисленияДивидендов КАК _НачисленияДивидендов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДивидендыПоАкциям.СрезПоследних(
	|				&ДатаКонечная,
	|				ИдСобытияПоВыплатеДивидендов В
	|					(ВЫБРАТЬ
	|						_НачисленияДивидендов.ИдСобытия КАК ИдСобытия
	|					ИЗ
	|						_НачисленияДивидендов КАК _НачисленияДивидендов)) КАК ДивидендыПоАкциямСрезПоследних
	|		ПО _НачисленияДивидендов.ЦеннаяБумага = ДивидендыПоАкциямСрезПоследних.Акция
	|			И _НачисленияДивидендов.ИдСобытия = ДивидендыПоАкциямСрезПоследних.ИдСобытияПоВыплатеДивидендов";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачальная", Макс(ДатаНачальная, ДатаОтсечки));		
	Запрос.УстановитьПараметр("ДатаКонечная", ДатаКонечная);
	
	Вычет = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Слагаемое = Окр(Выборка.Вычет, 2);
		Если Слагаемое > 0 Тогда
			Вычет = Вычет + Слагаемое;
			СтрДивиденды = ТабДивиденды.Добавить();
			СтрДивиденды.Сумма = Слагаемое;
			СтрДивиденды.Месяц = Выборка.Год;
			СтрДивиденды.Месяц = Выборка.Месяц;	
			СтрДивиденды.Знак = -1;
			СтрДивиденды.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Вычет;
		
КонецФункции	

Функция СформироватьСводныйНалоговыйРегистрФЛ(Организация, СчетДоверительногоУправления, ДатаНачальная, ДатаКонечная, ОбщиеФункции, ОснованиеРасчета) 
	
	Результат = Новый Структура;
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
		
	МакетНастройка = ПолучитьМакет("Настройка");
	//Если ДатаКонечная <= Дата(2019,12,1,0,0,0) Тогда 
	//	ВерсияПравил = "Данные";
	//ИначеЕсли ДатаКонечная < Дата(2021,1,1,0,0,0) ТОгда	
	//	ВерсияПравил = "Данные2019";		
	//	//1) доход от реализации НКД корпоративых облигаций, выпущенных после 2017 года, исключен из необлагаемой базы
	//Иначе
	//	ВерсияПравил = "Данные2021";
	//КонецЕсли;
	
	Если ДатаКонечная < Дата(2018,1,1,0,0,0) Тогда 
		ВерсияПравил = "Данные";  // нет льгот по НКД, корп., выпущенных после 2017 г.  
	ИначеЕсли ДатаКонечная < Дата(2021,1,1,0,0,0) ТОгда	
		ВерсияПравил = "Данные2018";	//НКД корп 2017, доход по погашнию не облагается налогом. 	
	Иначе
		ВерсияПравил = "Данные2021";  // Нет льгот по НКД гос и Корп-2017. 
	КонецЕсли;
		
	ТаблицаНастройки = ОбщиеФункции.ТабличныйДокументВТаблицуЗначений(МакетНастройка,"Заголовки", ВерсияПравил, "Колонки");		
	ОбщиеФункции.ОбработатьТаблицуНастроек(ТаблицаНастройки, НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	Если ТаблицаНастройки.Количество() = 0 Тогда 
		Сообщить("Отсутствует настройка для отчета");
		Возврат ОбластиИЗначения;
	КонецЕсли;	
	
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "П06030000", "П07080000", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы);
	
	ТабДивиденды = Новый ТаблицаЗначений;
	ТабДивиденды.Колонки.Добавить("Сумма", ТипЧисло);
	ТабДивиденды.Колонки.Добавить("Год", ТипЧисло);
	ТабДивиденды.Колонки.Добавить("Месяц", ТипЧисло);
	ТабДивиденды.Колонки.Добавить("Знак", ТипЧисло);
	ТабДивиденды.Колонки.Добавить("ВидДоходаВычета");

	
	СуммаДивиденды = ВыделитьДивиденды(ТаблицаРезультат, ТаблицаНастройки, "П08070000", ОбластиИЗначения, ДатаНачальная, ДатаКонечная, ТабДивиденды, ОснованиеРасчета);
	ОбластиИЗначения.Вставить("П08090000", СуммаДивиденды);
	ВычетДивиденды = ВычетСДивидендов(Организация, СчетДоверительногоУправления, ДатаНачальная, ДатаКонечная, ТабДивиденды, ОснованиеРасчета);
	ОбластиИЗначения.Вставить("П09010000", ВычетДивиденды);
	
	ТабДивиденды.Свернуть("Год, Месяц, ВидДоходаВычета, Знак", "Сумма");
		
	Результат.Вставить("ОбластиИЗначения", ОбластиИЗначения);
	Результат.Вставить("ТабРасшифровки", ТабРасшифровки);
	Результат.Вставить("ПрочиеДоходы", ПрочиеДоходы);
	Результат.Вставить("ПрочиеРасходы", ПрочиеРасходы);
	Результат.Вставить("СуммаДивиденды", СуммаДивиденды);
	Результат.Вставить("ТабДивиденды", ТабДивиденды);
	
	Возврат Результат;	
	
КонецФункции

Процедура НоваяСтрокаНалоговойБазы(ТаблицаРезультат, Ставка, ВидДоходаВычета, Сумма, Знак, Период, Месяц=0, ПереносУбытка = Ложь)
	
	НоваяСтрока = ТаблицаРезультат.Добавить();
	НоваяСтрока.СтавкаНДФЛ = Ставка;
	НоваяСтрока.Год = Год(Период);
	Если Месяц <> 0 Тогда 
		НоваяСтрока.Месяц = Месяц;
	Иначе
		НоваяСтрока.Месяц = Месяц(Период);
	КонецЕсли;	
	НоваяСтрока.Код = ВидДоходаВычета.Код;
	НоваяСтрока.ВидДоходаВычета = ВидДоходаВычета;
	Если ПереносУбытка Тогда 
		НоваяСтрока.Сумма = 0;
		НоваяСтрока.Сумма2НДФЛ = Знак* Сумма;		
	Иначе	
		НоваяСтрока.Сумма = Знак* Сумма;
		НоваяСтрока.Сумма2НДФЛ = НоваяСтрока.Сумма;
	КонецЕсли;	
	НоваяСтрока.ВидОбращения = ВидДоходаВычета.ВидОбращения;
		
КонецПроцедуры 	

Процедура НоваяСтрокаТаблицыКодов(ТаблицаКодов, ВидДохода, ВидВычета, Сумма)
	
	Если ВидДохода = Справочники.ВидыДоходовНДФЛ.Код1010 Тогда 
		Возврат;
	КонецЕсли;	
			
	НоваяСтрока = ТаблицаКодов.Добавить();
	НоваяСтрока.ВидДохода = ВидДохода;
	НоваяСтрока.ВидВычета = ВидВычета;
	НоваяСтрока.Сумма = Сумма;
	
КонецПроцедуры

Функция СоздатьТаблицуПравил()
	
	Макет = ПолучитьМакет("НастройкаКодовНДФЛ");
	
	ОбластьЗаголовки = Макет.ПолучитьОбласть("Заголовок|Колонки");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные|Колонки");
	
	Рез = Новый ТаблицаЗначений;
	
	КоличествоКолонок = ОбластьЗаголовки.ШиринаТаблицы;
	КоличествоСтрок = ОбластьДанные.ВысотаТаблицы;
	
	Для инд = 1 по КоличествоКолонок Цикл 
		Рез.Колонки.Добавить(ОбластьЗаголовки.ПолучитьОбласть(1, инд).ТекущаяОбласть.Текст);
	КонецЦикла;	
	
	Для индСтроки = 1 по КоличествоСтрок Цикл 
		НоваяСтрока = Рез.Добавить();
		Для индКолонки = 1 по КоличествоКолонок Цикл 
			НоваяСтрока[ИндКолонки-1] = ОбластьДанные.ПолучитьОбласть(индСтроки, индКолонки).ТекущаяОбласть.Текст;		
		КонецЦикла;	
	КонецЦикла;	
	
	Для Каждого СтрокаТаб из Рез Цикл 
		СтрокаТаб.Знак = Число(СтрокаТаб.Знак);
		Если СтрокаТаб.ВычитатьИзРасходов = "Да" Тогда 
			СтрокаТаб.ВычитатьИзРасходов = Истина;
		Иначе 
			СтрокаТаб.ВычитатьИзРасходов = Ложь;
		КонецЕсли;	
		Если СтрокаТаб.Распределять = "Да" Тогда 
			СтрокаТаб.Распределять = Истина;
		Иначе 
			СтрокаТаб.Распределять = Ложь;
		КонецЕсли;	
		Если СтрокаТаб.Знак = 1 Тогда 
			СтрокаТаб.КодФЛ = Справочники.ВидыДоходовНДФЛ[СтрокаТаб.КодФЛ];
			СтрокаТаб.КодИИС = Справочники.ВидыДоходовНДФЛ[СтрокаТаб.КодИИС];
			СтрокаТаб.КодВычетаФЛ = Справочники.ВидыВычетовНДФЛ[СтрокаТаб.КодВычетаФЛ];
			СтрокаТаб.КодВычетаИИС = Справочники.ВидыВычетовНДФЛ[СтрокаТаб.КодВычетаИИС];									
		ИначеЕсли СтрокаТаб.Знак = -1 Тогда 
			СтрокаТаб.КодФЛ = Справочники.ВидыВычетовНДФЛ[СтрокаТаб.КодФЛ];
			СтрокаТаб.КодИИС = Справочники.ВидыВычетовНДФЛ[СтрокаТаб.КодИИС];			
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Рез;	
	
КонецФункции

Функция СоздатьТаблицуСекций()
	
	Макет = ПолучитьМакет("НастройкаКодовНДФЛ");
	
	ОбластьЗаголовки = Макет.ПолучитьОбласть("ЗаголовокСекции|КолонкиСекции");
	ОбластьДанные = Макет.ПолучитьОбласть("ДанныеСекции|КолонкиСекции");
	
	Рез = Новый ТаблицаЗначений;
	
	КоличествоКолонок = ОбластьЗаголовки.ШиринаТаблицы;
	КоличествоСтрок = ОбластьДанные.ВысотаТаблицы;
	
	Для инд = 1 по КоличествоКолонок Цикл 
		Рез.Колонки.Добавить(ОбластьЗаголовки.ПолучитьОбласть(1, инд).ТекущаяОбласть.Текст);
	КонецЦикла;	
	
	Для индСтроки = 1 по КоличествоСтрок Цикл 
		НоваяСтрока = Рез.Добавить();
		Для индКолонки = 1 по КоличествоКолонок Цикл 
			НоваяСтрока[ИндКолонки-1] = ОбластьДанные.ПолучитьОбласть(индСтроки, индКолонки).ТекущаяОбласть.Текст;		
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Рез;	
	
КонецФункции

Функция ВернутьСтатусРезидента(СчетДУ, НаДату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕстьNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ, НЕОПРЕДЕЛЕНО) КАК РезидентРФ
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДУ) КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(&Период, ) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
	|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо";
	
	Запрос.УстановитьПараметр("СчетДУ", СчетДУ);
	Запрос.УстановитьПараметр("Период", НаДату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.РезидентРФ;
	КонецЕсли;	
		
КонецФункции	

Функция ВернутьСохраненноеЗначение(ИмяПараметра, ОбластиИЗначения)
	
	Перем Рез;
	
	Если ОбластиИЗначения.Свойство(ИмяПараметра, Рез) Тогда 
		Возврат Рез;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

Процедура УменьшитьВычетДляНДФЛ(ТаблицаРезультат, ВидВычета, Сумма)
	
	СтрокаТаблицы = ТаблицаРезультат.Найти(ВидВычета,"ВидДоходаВычета");
	Если СтрокаТаблицы <> Неопределено Тогда 
		СтрокаТаблицы.Сумма2НДФЛ = СтрокаТаблицы.Сумма - Сумма;
	КонецЕсли;
	
КонецПроцедуры 	

Процедура ПеренестиУбыток(ТаблицаРезультат, ВидВычета, СуммаНОБКудаОтносимУбыток, СуммаУбытка, Период, СтавкаНДФЛ)
	
	Если СуммаНОБКудаОтносимУбыток >= СуммаУбытка Тогда
		НоваяСтрокаНалоговойБазы(ТаблицаРезультат, СтавкаНДФЛ, ВидВычета, СуммаУбытка, -1, Период, , Истина);
		СуммаНОБКудаОтносимУбыток = СуммаНОБКудаОтносимУбыток - СуммаУбытка;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура РассчитатьНОБ(ДокументРезультат, ТаблицаРезультат, ВидДоговора, Период, ОсновнаяСтавка, ОснованиеРасчета, ЭтоРезидент)
	
	Отчет = ПолучитьМакет("Отчет2021");	
	ОбластьНОБ = Отчет.ПолучитьОбласть("НОБ");

	
	НОБЦБобращаемые = 0;
	НОБЦБнеобращаемые = 0;
	НОБПФИобращаемые = 0;
	НОБПФИнеобращаемые = 0;
	НОБдивиденды = 0;
	НОБРЕПО = 0;
	НОБПрочие = 0;
		
	Для Каждого СтрокаНалоговаяБаза ИЗ ТаблицаРезультат Цикл 
		
		Если СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601 Тогда 
			НОБдивиденды = НОБдивиденды + СтрокаНалоговаяБаза.Сумма;
		ИначеЕсли СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1537 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код211 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1551 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код230 Тогда
			НОБРЕПО = НОБРЕПО + СтрокаНалоговаяБаза.Сумма; 
		ИначеЕсли СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1530 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код201
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1544 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код221 Тогда 		
		  	НОБЦБобращаемые = НОБЦБобращаемые + СтрокаНалоговаяБаза.Сумма;
		ИначеЕсли СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1531 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код202
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1545 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код226 Тогда 		
		  	НОБЦБнеобращаемые = НОБЦБнеобращаемые + СтрокаНалоговаяБаза.Сумма;
		ИначеЕсли СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1532 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код206
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1546 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код228 Тогда 		
		  	НОБПФИобращаемые = НОБПФИобращаемые + СтрокаНалоговаяБаза.Сумма;
		ИначеЕсли СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1535 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код207
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1548 
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код229 Тогда 		
		  	НОБПФИнеобращаемые = НОБПФИнеобращаемые + СтрокаНалоговаяБаза.Сумма;
		ИначеЕсли СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код4800
			ИЛИ СтрокаНалоговаяБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код620 Тогда 
			НОБПрочие = НОБПрочие + СтрокаНалоговаяБаза.Сумма;	
		КонецЕсли;		
	КонецЦикла;
	
	Если НОБЦБобращаемые < 0 Тогда 
		ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код221, Справочники.ВидыВычетовНДФЛ.Код201);	
		// надо придумать таблицу соотвтетсвия кода вычета и кода дохода
		УменьшитьВычетДляНДФЛ(ТаблицаРезультат, ВидВычета, НОБЦБобращаемые);
		НОБЦБобращаемые = 0;
	КонецЕсли;
	
	Если НОБЦБнеобращаемые < 0 Тогда 
		ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код226, Справочники.ВидыВычетовНДФЛ.Код202);	
		УменьшитьВычетДляНДФЛ(ТаблицаРезультат, ВидВычета, НОБЦБнеобращаемые);
		НОБЦБнеобращаемые = 0;
	КонецЕсли;	
	
	Если НОБРЕПО < 0 Тогда
		// вычет по РЕПО уменьшим до суммы дохода
		// превышение расхода над доходом перенесем на вычет по ЦБ
		ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код230, Справочники.ВидыВычетовНДФЛ.Код211);
		УменьшитьВычетДляНДФЛ(ТаблицаРезультат, ВидВычета, НОБРЕПО);
		Если (-НОБРЕПО <= НОБЦБобращаемые + НОБЦБнеобращаемые) И ОснованиеРасчета <> Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда 
			//можем убыток по РЕПО отнести на ЦБ
			Если ДокументРезультат.Области.Найти("П07070010") <> Неопределено Тогда
				ДоходРЕПООбращаемые = ДокументРезультат.Области.П07070010.Значение;
				ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код239, Справочники.ВидыВычетовНДФЛ.Код222);
				ПеренестиУбыток(ТаблицаРезультат, ВидВычета, НОБЦБобращаемые, ДоходРЕПООбращаемые, Период, ОсновнаяСтавка);
			КонецЕсли;
			
			Если ДокументРезультат.Области.Найти("П07070020") <> Неопределено Тогда
				ДоходРЕПОНеобращаемые = ДокументРезультат.Области.П07070020.Значение;
				ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код240, Справочники.ВидыВычетовНДФЛ.Код223);		
				ПеренестиУбыток(ТаблицаРезультат, ВидВычета, НОБЦБнеобращаемые, ДоходРЕПОНеобращаемые, Период, ОсновнаяСтавка);
			КонецЕсли;			
		КонецЕсли;	
		НОБРЕПО = 0;	
	КонецЕсли; 
	
	Если НОБПФИобращаемые < 0 Тогда		
		ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код228, Справочники.ВидыВычетовНДФЛ.Код206);	
		УменьшитьВычетДляНДФЛ(ТаблицаРезультат, ВидВычета, НОБПФИобращаемые);
		Если ОснованиеРасчета <> Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда 
			ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код250, Справочники.ВидыВычетовНДФЛ.Код208);
			ПеренестиУбыток(ТаблицаРезультат, ВидВычета, НОБЦБобращаемые, -НОБПФИобращаемые, Период, ОсновнаяСтавка);
		КонецЕсли;	
		НОБПФИобращаемые = 0;	
	КонецЕсли;	
	
	Если НОБПФИнеобращаемые < 0 Тогда
		ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код229, Справочники.ВидыВычетовНДФЛ.Код207);	
		УменьшитьВычетДляНДФЛ(ТаблицаРезультат, ВидВычета, НОБПФИнеобращаемые);	
		Если ОснованиеРасчета <> Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда 
			ВидВычета = ?(ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Справочники.ВидыВычетовНДФЛ.Код251, Справочники.ВидыВычетовНДФЛ.Код209);
			ПеренестиУбыток(ТаблицаРезультат, ВидВычета, НОБЦБнеобращаемые, -НОБПФИнеобращаемые, Период, ОсновнаяСтавка);
		КонецЕсли;	
		НОБПФИнеобращаемые = 0;
	КонецЕсли;	
	
	Если НОБПрочие < 0 Тогда 
		ВидВычета =  Справочники.ВидыВычетовНДФЛ.Код620; 
		УменьшитьВычетДляНДФЛ(ТаблицаРезультат, ВидВычета, НОБПрочие);		
		НОБПрочие = 0;
	КонецЕсли;	
	
	НОБ = НОБЦБобращаемые + НОБЦБнеобращаемые + НОБПФИобращаемые + НОБПФИнеобращаемые + НОБРЕПО + НОБПрочие;  
	
	// печать 
	ОбластьНОБ.Параметры.НОБЦБобращаемые 	= НОБЦБобращаемые;
	ОбластьНОБ.Параметры.НОБЦБнеобращаемые 	= НОБЦБнеобращаемые;
	ОбластьНОБ.Параметры.НОБПФИобращаемые 	= НОБПФИобращаемые;
	ОбластьНОБ.Параметры.НОБПФИнеобращаемые = НОБПФИнеобращаемые;
	ОбластьНОБ.Параметры.НОБРЕПО 			= НОБРЕПО;
	ОбластьНОБ.Параметры.НОБдивиденды 		= НОБдивиденды;	
	ОбластьНОБ.Параметры.НОБПрочие 			= НОБПрочие;	
	ОбластьНОБ.Параметры.НОБ 				= НОБ;	
	ДокументРезультат.Вывести(ОбластьНОБ);
	
	//выделение 15%
	Если Период >= Дата(2021,1,1) И НОБ > 5000000 И ЭтоРезидент Тогда	
		// здесь будет алгоритм выделения налога 15%
	КонецЕсли;	
			
КонецПроцедуры	

Функция ВернутьНачисленныйНДФЛ(ДокументРезультат, ОбластьНДФЛ, Период, Организация, СчетДоверительногоУправления)

	// 1) берем движения, основаниями которых были расчеты НДФЛ. 
	// оставляем только созданые в этом году. Расчеты за прошлый период, по которым оплата произошла в этом, отбрасываем
	//запрос будет работать для данных с 2019 г. в 18-м году не было связи РасчетНДФЛ и Начисдение НДФЛ	
	// 2) Основание для начисления налога - Начисление Дивидендов. 
	// Аналогично, учитываем только налог, выставленный в текущем году.  
	// 3) соединяем две таблицы, в каждой по одной строке 
	
	НДФЛРанееНачисленный = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК НДФЛНачисленный,
	|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК НДФЛУплаченный
	|ПОМЕСТИТЬ _НДФЛ
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
	|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.НачислениеЗадолженности)) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
	|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = НачислениеЗадолженностиОснования.Ссылка
	|ГДЕ
	|	ВЫРАЗИТЬ(НачислениеЗадолженностиОснования.Основание КАК Документ.РасчетНДФЛ).ДатаРасчета >= &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК НДФЛНачисленный,
	|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК НДФЛУплаченный
	|ПОМЕСТИТЬ _НДФЛДивиденды
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
	|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.НачислениеДивидендов)) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
	|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = НачислениеЗадолженностиОснования.Основание
	|ГДЕ
	|	ВЫРАЗИТЬ(НачислениеЗадолженностиОснования.Ссылка КАК Документ.НачислениеЗадолженности).Дата >= &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(_НДФЛ.НДФЛНачисленный, 0) КАК Начисленный,
	|	ЕСТЬNULL(_НДФЛ.НДФЛУплаченный, 0) КАК Уплаченный,
	|	ЕСТЬNULL(_НДФЛДивиденды.НДФЛНачисленный, 0) КАК НачисленныйПоДивидендам,
	|	ЕСТЬNULL(_НДФЛДивиденды.НДФЛУплаченный, 0) КАК УплаченныйПоДивидендам
	|ИЗ
	|	_НДФЛ КАК _НДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НДФЛДивиденды КАК _НДФЛДивиденды
	|		ПО (ИСТИНА)";	
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Период));
	Запрос.УстановитьПараметр("КонецПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда 
		
		ОбластьНДФЛ.Параметры.НДФЛРанееНачисленный 				= Выборка.Начисленный;
		ОбластьНДФЛ.Параметры.НДФЛРанееНачисленныйДивиденды 	= Выборка.НачисленныйПоДивидендам;
		ОбластьНДФЛ.Параметры.ИтогоНДФЛНачисленный 				= Выборка.Начисленный + Выборка.НачисленныйПоДивидендам;
		ОбластьНДФЛ.Параметры.НДФЛУплаченный 					= Выборка.Уплаченный;
		ОбластьНДФЛ.Параметры.НДФЛУплаченныйДивиденды 			= Выборка.УплаченныйПоДивидендам;
		ОбластьНДФЛ.Параметры.ИтогоНДФЛУплаченный 				= Выборка.Уплаченный + Выборка.УплаченныйПоДивидендам;	
		ДокументРезультат.Вывести(ОбластьНДФЛ);
		
		НДФЛРанееНачисленный = Выборка.Начисленный;
		
	КонецЕсли;	
	
	Возврат НДФЛРанееНачисленный;

КонецФункции

//
Функция Расчет_НДФЛ(Организация, СчетДоверительногоУправления, Период, ЭтоОтчет = Ложь, ОснованиеРасчета=Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	НДФЛРанееНачисленный = 0;
	
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("ВидДохода");
	ТаблицаКодов.Колонки.Добавить("ВидВычета");
	ТаблицаКодов.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	ДатаНачальная = НачалоГода(Период);	
	ДатаКонечная = КонецДня(Период);		
	
	Данные = СформироватьСводныйНалоговыйРегистрФЛ(Организация, СчетДоверительногоУправления, ДатаНачальная, ДатаКонечная, ОбщиеФункции, ОснованиеРасчета);	
	ОбластиИЗначения = Данные.ОбластиИЗначения;
	ТабДивиденды = Данные.ТабДивиденды;
	
	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Тип("СправочникСсылка.ВидыДоходовНДФЛ"));
	МассивВидов.Добавить(Тип("СправочникСсылка.ВидыВычетовНДФЛ"));
	
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("СтавкаНДФЛ");
	ТаблицаРезультат.Колонки.Добавить("Год");
	ТаблицаРезультат.Колонки.Добавить("Месяц");
	ТаблицаРезультат.Колонки.Добавить("Код");
	ТаблицаРезультат.Колонки.Добавить("ВидДоходаВычета", Новый ОписаниеТипов(МассивВидов));
	ТаблицаРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("Сумма2НДФЛ", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("ВидОбращения");
		
	ЭтоРезидент = ВернутьСтатусРезидента(СчетДоверительногоУправления, Период);
	Если ЭтоРезидент <> Неопределено Тогда 
		Если ЭтоРезидент Тогда 
			ОсновнаяСтавка = Перечисления.СтавкиНДФЛ.Ставка13;
		Иначе
			ОсновнаяСтавка = Перечисления.СтавкиНДФЛ.Ставка30;
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СчетДоверительногоУправления + " на " + Формат(Период, "ДФ=dd.MM.yyyy") + " не заполнены анкетные данные. Статус резидента неопределен.");
		Возврат Неопределено;
	КонецЕсли;	
		
	ТаблицаПравил = СоздатьТаблицуПравил();
	Если СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица Тогда 
		КолонкаКод = "КодФЛ";
		КолонкаВычет = "КодВычетаФЛ";
	Иначе
		КолонкаКод = "КодИИС";
		КолонкаВычет = "КодВычетаИИС";
	КонецЕсли;	
	
	//распределим дивиденды
	Для Каждого СтрДивиденды из ТабДивиденды Цикл 
		НоваяСтрокаНалоговойБазы(ТаблицаРезультат, ОсновнаяСтавка, СтрДивиденды.ВидДоходаВычета, СтрДивиденды.Сумма, СтрДивиденды.Знак, Период, СтрДивиденды.Месяц);	
	КонецЦикла;	
	
	Инфо = "";
	Если НЕ (СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет 
		И ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода) Тогда 
		
		//ИИС, конец налогово периода - в расчет включаем только дивиденды
		
		Поправка = 0; 
		Инфо = "Распределение прочих расходов по кодам налоговой базы."; 
		Для Каждого СтрокаПравил из ТаблицаПравил Цикл
			Сумма  = ВернутьСохраненноеЗначение(СтрокаПравил.ОбластьДанные, ОбластиИЗначения);
			Если НЕ СтрокаПравил.Распределять Тогда 			
				Если Сумма > 0 Тогда
					НоваяСтрокаНалоговойБазы(ТаблицаРезультат, ОсновнаяСтавка, СтрокаПравил[КолонкаКод], Сумма, СтрокаПравил.Знак, Период);
					Если СтрокаПравил.Знак = 1 Тогда 
						НоваяСтрокаТаблицыКодов(ТаблицаКодов, СтрокаПравил[КолонкаКод], СтрокаПравил[КолонкаВычет], Сумма);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			Если СтрокаПравил.ВычитатьИзРасходов Тогда 
				Поправка = Поправка + Сумма;
			КонецЕсли;
			Если СтрокаПравил.Распределять Тогда 
				Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда 
					Продолжить;
				КонецЕсли;
				
				Сумма = Сумма - Поправка;
				Инфо = Инфо + Символы.ВК + "Сумма, подлежащая распределению: " + Сумма;
				Если Поправка > 0 Тогда 
					Инфо = Инфо + Символы.ВК + "Сумма, исключенная из распределения прочих расходов: " + Поправка;
				КонецЕсли;	
				
				Если Сумма> 0 Тогда 
					// делим прочие расходы пропорционально доходам
					//для этого используем  ТаблицаКодов
					ТаблицаКодов.Свернуть("ВидДохода, ВидВычета", "Сумма");
					
					ВсеДоходы = ТаблицаКодов.Итог("Сумма");
					ТаблицаКодов.Сортировать("Сумма Возр");
					КоличествоСтрок = ТаблицаКодов.Количество() ;
					
					ОстатокПрочие = Сумма;
					Если (ВсеДоходы) > 0 Тогда 				
						Для инд = 0 по КоличествоСтрок-1 Цикл 
							
							Доля = Окр(Сумма * ТаблицаКодов[инд].Сумма/ВсеДоходы, 2); 
							Инфо = Инфо + Символы.ВК + "Код вычета " + ТаблицаКодов[инд].ВидВычета + ", Код дохода " + ТаблицаКодов[инд].ВидДохода + ": " + Сумма + " * " + ТаблицаКодов[инд].Сумма + " / "+ВсеДоходы + " 	= " + Доля;  						
							Если инд <> КоличествоСтрок-1 Тогда 
								ОстатокПрочие = ОстатокПрочие - Доля;
								НоваяСтрокаНалоговойБазы(ТаблицаРезультат, ОсновнаяСтавка, ТаблицаКодов[инд].ВидВычета, Доля, -1, Период);
							Иначе
								НоваяСтрокаНалоговойБазы(ТаблицаРезультат, ОсновнаяСтавка, ТаблицаКодов[инд].ВидВычета, ОстатокПрочие, -1, Период);
							КонецЕсли;
						КонецЦикла;	
					Иначе //дохода нет, только расход, отнесем на обращаемые.
						НоваяСтрокаНалоговойБазы(ТаблицаРезультат, ОсновнаяСтавка, СтрокаПравил[КолонкаКод], Сумма, СтрокаПравил.Знак, Период);
					КонецЕсли;
				КонецЕсли;				
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
			
	//вывод формы	
	ДокументРезультат = Новый ТабличныйДокумент;
	Отчет = ПолучитьМакет("Отчет2021");
	
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(Период, Организация, СчетДоверительногоУправления);
	ОбластьШапка = Отчет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьШапка.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	ДокументРезультат.Вывести(ОбластьШапка);	
		
	ТекущаяОбласть = Отчет.ПолучитьОбласть("Таблица");
	ДокументРезультат.Вывести(ТекущаяОбласть);
	
	ТаблицаСекций = СоздатьТаблицуСекций();		
	Для Каждого Секция Из ТаблицаСекций Цикл 
		ВыводитьСекцию = Ложь;
		Если ЗначениеЗаполнено(Секция.ЯчейкаДоход) И ОбластиИЗначения.Свойство(Секция.ЯчейкаДоход) И ОбластиИЗначения[Секция.ЯчейкаДоход] <> 0 Тогда 
			ВыводитьСекцию = Истина;
		КонецЕсли;	
		Если Не ВыводитьСекцию И (ЗначениеЗаполнено(Секция.ЯчейкаРасход) И ОбластиИЗначения.Свойство(Секция.ЯчейкаРасход) И ОбластиИЗначения[Секция.ЯчейкаРасход] <> 0) Тогда 
			ВыводитьСекцию = Истина;
		КонецЕсли;	
		Если ВыводитьСекцию Тогда 
			ТекущаяОбласть = Отчет.ПолучитьОбласть(Секция.ИмяСекции);
			Если ЗначениеЗаполнено(Секция.ЯчейкаДоход) И ОбластиИЗначения.Свойство(Секция.ЯчейкаДоход) Тогда 
				ТекущаяОбласть.Области[Секция.ЯчейкаДоход].Значение = ОбластиИЗначения[Секция.ЯчейкаДоход];
			КонецЕсли;	
			Если ЗначениеЗаполнено(Секция.ЯчейкаРасход) И ОбластиИЗначения.Свойство(Секция.ЯчейкаРасход) Тогда 
				ТекущаяОбласть.Области[Секция.ЯчейкаРасход].Значение = ОбластиИЗначения[Секция.ЯчейкаРасход];
			КонецЕсли;									
			Если ЗначениеЗаполнено(Секция.КодДохода) Тогда
				СтрокаПравил = ТаблицаПравил.Найти(Секция.КодДохода, "ОбластьКоды");
				ТекущаяОбласть.Области[Секция.КодДохода].Значение = СтрокаПравил[КолонкаКод].Код
			КонецЕсли;
			Если ЗначениеЗаполнено(Секция.КодВычета) Тогда
				СтрокаПравил = ТаблицаПравил.Найти(Секция.КодВычета, "ОбластьКоды");
				ТекущаяОбласть.Области[Секция.КодВычета].Значение = СтрокаПравил[КолонкаКод].Код					
			КонецЕсли;				
			ДокументРезультат.Вывести(ТекущаяОбласть);
		КонецЕсли;	
	КонецЦикла;
	
	ОбластьИнфо = Отчет.ПолучитьОбласть("Инфо");
	ОбластьИнфо.Параметры.Инфо = Инфо;
	ДокументРезультат.Вывести(ОбластьИнфо);
		
	Если ЭтоОтчет Тогда 
		Результат.Вставить("ТабРасшифровки", Данные.ТабРасшифровки);		
	Иначе	
		
		//расчитаем НОБ, отразим в табличном документе
		РассчитатьНОБ(ДокументРезультат, ТаблицаРезультат, СчетДоверительногоУправления.ВидДоговораДоверительногоУправления, Период, ОсновнаяСтавка, ОснованиеРасчета, ЭтоРезидент);
				
		ТаблицаРезультат.Свернуть("СтавкаНДФЛ, Год, Месяц, ВидДоходаВычета, ВидОбращения", "Сумма, Сумма2НДФЛ");  
		ТаблицаРезультат.Сортировать("Год, Месяц, ВидДоходаВычета");			
				
		ОбластьНДФЛ = Отчет.ПолучитьОбласть("НДФЛ");
		НДФЛРанееНачисленный = ВернутьНачисленныйНДФЛ(ДокументРезультат, ОбластьНДФЛ, Период, Организация, СчетДоверительногоУправления);	
	КонецЕсли;
	
	Результат.Вставить("ТаблицаРезультат", ТаблицаРезультат);	
	Результат.Вставить("ДокументРезультат", ДокументРезультат);
	Результат.Вставить("НДФЛРанееНачисленный", НДФЛРанееНачисленный);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьНалоговуюБазуИСС(Период, ТаблицаРезультат, ДокументРезультат, ОснованиеРасчета)
	
	Отчет = ПолучитьМакет("Отчет2021");	
	
	ТаблицаРезультат.Сортировать("Год, Месяц, ВидДоходаВычета");
	
	КоличествоСтрок = ТаблицаРезультат.Количество();
	Для индекс = -(КоличествоСтрок-1) по 0 Цикл 
		СтрокаРезультат = ТаблицаРезультат.Получить(-индекс);
		Если (СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010 
			ИЛИ СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601) 
			И СтрокаРезультат.Год <> Год(Период) Тогда 
			Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора Тогда
				ТаблицаРезультат.Удалить(СтрокаРезультат);
				Продолжить;	// Дивиденды прошлых лет удаляем. Они присутствуют в документах на конец года.
			ИначеЕсли ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику Тогда 
				СтрокаРезультат.Сумма2НДФЛ = 0;  // дивиденды прошлых лет, налог уплачен. 
			КонецЕсли;	
		КонецЕсли;			
		Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику 
			И НЕ (СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010 
			ИЛИ СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601) Тогда 
			СтрокаРезультат.Сумма2НДФЛ = 0;       //налог не считаем		
		Конецесли;	
	КонецЦикла;			
	
	Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора 
		ИЛИ ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаНаследнику 
		ИЛИ ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.КорректировкаНалога Тогда 
		// посчитаем налоговую база за весть период действия договора
		ОбластьШапкаБаза = Отчет.ПолучитьОбласть("ШапкаБаза");
		ДокументРезультат.Вывести(ОбластьШапкаБаза);
		
		ОбластьБаза = Отчет.ПолучитьОбласть("СтрБаза");
		Для Каждого СтрокаРезультат Из ТаблицаРезультат Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьБаза.Параметры, СтрокаРезультат);
			ОбластьБаза.Параметры.ВидДоходаВычетаНаименование = СтрокаРезультат.ВидДоходаВычета.Наименование;
			ДокументРезультат.Вывести(ОбластьБаза);
			Если НЕ (СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010 
				ИЛИ СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601)  Тогда 		
				СтрокаРезультат.Месяц = Месяц(Период);
				СтрокаРезультат.Год = Год(Период);  //Доходы расходы прошлых лет считаем полученными на момент расторжения 
				СтрокаРезультат.Сумма2НДФЛ = СтрокаРезультат.Сумма;
			КонецЕсли;	
		КонецЦикла;	
		
		ТаблицаРезультат.Свернуть("СтавкаНДФЛ, Год, Месяц, ВидДоходаВычета, ВидОбращения", "Сумма, Сумма2НДФЛ");  
		ТаблицаРезультат.Сортировать("Месяц, ВидДоходаВычета");		
		
		//итог
		ОбластьБазаИтог = Отчет.ПолучитьОбласть("БазаИтог");
		Для Каждого СтрокаРезультат Из ТаблицаРезультат Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьБазаИтог.Параметры, СтрокаРезультат);
			ОбластьБазаИтог.Параметры.ВидДоходаВычетаНаименование = СтрокаРезультат.ВидДоходаВычета.Наименование;
			ДокументРезультат.Вывести(ОбластьБазаИтог);
		КонецЦикла;		
		
		РассчитатьНОБ(ДокументРезультат, ТаблицаРезультат, Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Период, Перечисления.СтавкиНДФЛ.Ставка13, Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора, Истина);
	КонецЕсли;	
		
КонецПроцедуры	

Процедура ЗаполнитьНалоговуюБазу(ДокументРасчетНДФЛ, ТаблицаРезультат, ТаблицаРазницаМеждуРасчетами)
	
	ТаблицаНачислений = ТаблицаРезультат.Скопировать();
	ТаблицаНачислений.Сортировать("Год, Месяц");
	
	ДокументРасчетНДФЛ.НалоговаяБаза.Очистить();
	
	Если ДокументРасчетНДФЛ.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица Тогда 
		
		// Актуально только для физлиц в случае выводов активов
		// табличную часть Налоговая база заполняем по месяцам с учетом истории. 
		// просто берем последний расчет за прошлый месяц, если он есть. 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РасчетНДФЛ.Ссылка КАК ДокументРасчет
		|ИЗ
		|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
		|ГДЕ
		|	РасчетНДФЛ.Организация = &Организация
		|	И РасчетНДФЛ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РасчетНДФЛ.ДатаРасчета МЕЖДУ &ДатаНачало И &ДатаКонец
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасчетНДФЛ.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Организация", ДокументРасчетНДФЛ.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДокументРасчетНДФЛ.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ДатаНачало", НачалоГода(ДокументРасчетНДФЛ.ДатаРасчета));
		Запрос.УстановитьПараметр("ДатаКонец", НачалоМесяца(ДокументРасчетНДФЛ.ДатаРасчета));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			БазаПрошлыйМесяц = Выборка.ДокументРасчет.НалоговаяБаза.Выгрузить();
			
			// получим разницу, что мы заработали в этом месяце
			Для Каждого СтрокаБаза из БазаПрошлыйМесяц Цикл 
				НоваяСтрока = ТаблицаНачислений.Добавить();	
				Если СтрокаБаза.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010 
					ИЛИ СтрокаБаза.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601 Тогда 	
					НоваяСтрока.Год = СтрокаБаза.Год;	
					НоваяСтрока.Месяц = СтрокаБаза.Месяц;
				Иначе
					НоваяСтрока.Год = Год(ДокументРасчетНДФЛ.ДатаРасчета);
					НоваяСтрока.Месяц = Месяц(ДокументРасчетНДФЛ.ДатаРасчета);
				КонецЕсли;	
				НоваяСтрока.СтавкаНДФЛ = СтрокаБаза.СтавкаНДФЛ;
				НоваяСтрока.ВидДоходаВычета = СтрокаБаза.ВидДоходаВычета;
				НоваяСтрока.Сумма = -СтрокаБаза.Сумма;
				НоваяСтрока.Сумма2НДФЛ = -СтрокаБаза.Сумма2НДФЛ;
				
				//сразу добавим в документ. В налоговой базе будут начисления прошлых месяцев + разница
				НоваяСтрокаДок = ДокументРасчетНДФЛ.НалоговаяБаза.Добавить();
				НоваяСтрокаДок.Год = СтрокаБаза.Год;
				НоваяСтрокаДок.Месяц = СтрокаБаза.Месяц;
				НоваяСтрокаДок.СтавкаНДФЛ = СтрокаБаза.СтавкаНДФЛ;
				НоваяСтрокаДок.ВидДоходаВычета = СтрокаБаза.ВидДоходаВычета;
				НоваяСтрокаДок.Сумма = СтрокаБаза.Сумма;
				НоваяСтрокаДок.Сумма2НДФЛ = СтрокаБаза.Сумма2НДФЛ;	
			КонецЦикла;	
		КонецЕсли;
		
		ТаблицаНачислений.Свернуть("Год, Месяц, СтавкаНДФЛ, ВидДоходаВычета", "Сумма, Сумма2НДФЛ");
		ТаблицаНачислений.Сортировать("Год, Месяц");
		//только разница, заработанная в текущем месяце
		
	КонецЕсли;
	
	Для Каждого СтрокаРезультат	ИЗ ТаблицаНачислений Цикл 
		Если СтрокаРезультат.Сумма = 0 И СтрокаРезультат.Сумма2НДФЛ = 0 Тогда 
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = ДокументРасчетНДФЛ.НалоговаяБаза.Добавить();
		НоваяСтрока.Год = СтрокаРезультат.Год;
		НоваяСтрока.Месяц = СтрокаРезультат.Месяц;
		НоваяСтрока.СтавкаНДФЛ = СтрокаРезультат.СтавкаНДФЛ;
		НоваяСтрока.ВидДоходаВычета = СтрокаРезультат.ВидДоходаВычета;
		НоваяСтрока.Сумма = СтрокаРезультат.Сумма;	
		НоваяСтрока.Сумма2НДФЛ = СтрокаРезультат.Сумма2НДФЛ;
		
		//
		НоваяСтрокаРазницы = ТаблицаРазницаМеждуРасчетами.Добавить();
		НоваяСтрокаРазницы.СтавкаНДФЛ = СтрокаРезультат.СтавкаНДФЛ;
		НоваяСтрокаРазницы.ВидДоходаВычета = СтрокаРезультат.ВидДоходаВычета;
		НоваяСтрокаРазницы.Сумма = СтрокаРезультат.Сумма;	
		НоваяСтрокаРазницы.Сумма2НДФЛ = СтрокаРезультат.Сумма2НДФЛ;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьНалоговуюБазуНДФЛсВывода(ДокументРасчетНДФЛ, СуммаВывода)
	
	// данные за прошлые месяца оставляем, текущий месяц очищаем кроме двивидендов, 
	
	НоваяБаза = ДокументРасчетНДФЛ.НалоговаяБаза.Выгрузить();
	КоличествоСтрок = НоваяБаза.Количество();
	
	ИскомаяСумма = 0;
	ИскомыйКод = Справочники.ВидыДоходовНДФЛ.Код1530;  //выводы только у физлиц. 
	Для инд = -(КоличествоСтрок-1) по 0 Цикл 
		СтрокаРезультат = НоваяБаза.Получить(-инд);
		Если СтрокаРезультат.Месяц = Месяц(ДокументРасчетНДФЛ.ДатаРасчета) И НЕ (СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010 
			ИЛИ СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601) Тогда  
			Если СтрокаРезультат.Сумма > ИскомаяСумма Тогда
				ИскомаяСумма = СтрокаРезультат.Сумма;
				ИскомыйКод = СтрокаРезультат.ВидДоходаВычета;
			КонецЕсли;				
			НоваяБаза.Удалить(СтрокаРезультат);
		КонецЕсли;			       
	КонецЦикла;	
	
	//вставляем сумму вывода. Относим на доходы 
	НоваяСтрока = НоваяБаза.Добавить();
	НоваяСтрока.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13;
	НоваяСтрока.ВидДоходаВычета = ИскомыйКод;  
	НоваяСтрока.Сумма = СуммаВывода;
	НоваяСтрока.Месяц = Месяц(ДокументРасчетНДФЛ.ДатаРасчета);
	
	ДокументРасчетНДФЛ.НалоговаяБаза.Очистить();
	Для Каждого СтрокаБаза	ИЗ НоваяБаза Цикл 
		НоваяСтрока = ДокументРасчетНДФЛ.НалоговаяБаза.Добавить();
		НоваяСтрока.Месяц = СтрокаБаза.Месяц;
		НоваяСтрока.СтавкаНДФЛ = СтрокаБаза.СтавкаНДФЛ;
		НоваяСтрока.ВидДоходаВычета = СтрокаБаза.ВидДоходаВычета;
		НоваяСтрока.Сумма = СтрокаБаза.Сумма;		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьДокумент(ДокументРасчетНДФЛ, РезультатРасчета, СуммаВывода)  Экспорт
	
	ТаблицаРезультат = РезультатРасчета.ТаблицаРезультат;
	ДокументРезультат = РезультатРасчета.ДокументРезультат;
	НДФЛРанееНачисленный = РезультатРасчета.НДФЛРанееНачисленный;
	ТаблицаРазницаМеждуРасчетами = ТаблицаРезультат.СкопироватьКолонки();  // для вывода активов нужно знать разницу, которую мы заработали со времени предыдущего вывода. в один месяц может быть несколько Расчетов 
		
	Если ДокументРасчетНДФЛ.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет 
		И ДокументРасчетНДФЛ.ОснованиеРасчета <> Перечисления.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода Тогда
		ЗаполнитьНалоговуюБазуИСС(ДокументРасчетНДФЛ.ДатаРасчета, ТаблицаРезультат, ДокументРезультат, ДокументРасчетНДФЛ.ОснованиеРасчета);
	КонецЕсли;	
	
	ЗаполнитьНалоговуюБазу(ДокументРасчетНДФЛ, ТаблицаРезультат, ТаблицаРазницаМеждуРасчетами);
	
	//удалим дивиденды. Мы с них уже заплатили налог
	КоличествоСтрок = ТаблицаРезультат.Количество();
	Для индекс = -(КоличествоСтрок-1) по 0 Цикл 
		СтрокаРезультат = ТаблицаРезультат.Получить(-индекс);
		Если СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1010 
			ИЛИ СтрокаРезультат.ВидДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код601 Тогда 
			ТаблицаРезультат.Удалить(СтрокаРезультат);
		КонецЕсли;			
	КонецЦикла;	
	
	РасчетНДФЛ = РасчетСуммыНДФЛ(ТаблицаРезультат);
		
	ДокументРасчетНДФЛ.НДФЛ = РасчетНДФЛ;  
	ДокументРасчетНДФЛ.НДФЛРанееНачисленный = НДФЛРанееНачисленный;	
	
	Если ДокументРасчетНДФЛ.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда
		РасчетНДФЛ_Разница = РасчетСуммыНДФЛ(ТаблицаРазницаМеждуРасчетами);
	Иначе 
		РасчетНДФЛ_Разница = 0;
	КонецЕсли;	
	
	Если (СуммаВывода > 0) И (СуммаВывода <= РасчетНДФЛ_Разница) И ДокументРасчетНДФЛ.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда 	
		//налог с вывода
		ДокументРасчетНДФЛ.НДФЛНачисленный = СуммаВывода*0.13;
		ЗаполнитьНалоговуюБазуНДФЛсВывода(ДокументРасчетНДФЛ, СуммаВывода);	
	Иначе 
		ДокументРасчетНДФЛ.НДФЛНачисленный = ДокументРасчетНДФЛ.НДФЛ - ДокументРасчетНДФЛ.НДФЛРанееНачисленный;
		Если ДокументРасчетНДФЛ.НДФЛНачисленный < 0 Тогда 
			ДокументРасчетНДФЛ.НДФЛНачисленный = 0;
		КонецЕсли;			
	КонецЕсли;	
	
КонецПроцедуры

Функция РасчетСуммыНДФЛ(Данные)
	
	Данные.Свернуть("СтавкаНДФЛ", "Сумма2НДФЛ");
	
	Результат = 0;
	
	Для Каждого СтрокаДанные из Данные Цикл 				
		Если СтрокаДанные.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13 Тогда 
			Результат = Результат + СтрокаДанные.Сумма2НДФЛ * 0.13;
		ИначеЕсли СтрокаДанные.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15 Тогда
			Результат = Результат + СтрокаДанные.Сумма2НДФЛ * 0.15;
		ИначеЕсли СтрокаДанные.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка30 Тогда
			Результат = Результат + СтрокаДанные.Сумма2НДФЛ * 0.30;
		ИначеЕсли СтрокаДанные.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка35 Тогда	
			Результат = Результат + СтрокаДанные.Сумма2НДФЛ * 0.35;
		КонецЕсли;			
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти