
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда 
		
		Если НЕ (ДанныеЗаполнения.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет 
			ИЛИ ДанныеЗаполнения.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица) Тогда
			Возврат;
		КонецЕсли;	
		
		ЭтотОбъект.СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыводДенежныхСредств")
			ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда 
			ЭтотОбъект.Дата = ДанныеЗаполнения.Дата+60;
			ЭтотОбъект.ДатаРасчета = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ДанныеЗаполнения.Дата - 24*60*60); 
			ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Оплата")
			И ДанныеЗаполнения.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНачислениюДивидендовАкции Тогда 
			ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов; 
			ЭтотОбъект.Дата = ДанныеЗаполнения.Дата+60;
			ЭтотОбъект.ДатаРасчета = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ДанныеЗаполнения.Дата);   
		КонецЕсли;	
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаНаследнику Тогда
		ПроверяемыеРеквизиты.Добавить("Наследник");
	КонецЕсли;
				
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	

	Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов
		ИЛИ ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда 
		Если Основания.Количество() > 0 Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасчетНДФЛВыводы.Ссылка КАК ДокументРасчет,
			|	РасчетНДФЛВыводы.Основание КАК ДокументВывод
			|ИЗ
			|	Документ.РасчетНДФЛ.Основания КАК РасчетНДФЛВыводы
			|ГДЕ
			|	РасчетНДФЛВыводы.Основание В(&СписокОснований)
			|	И РасчетНДФЛВыводы.Ссылка <> &СсылкаДокументРасчет";
				
			СписокОснований = ЭтотОбъект.Основания.Выгрузить().ВыгрузитьКолонку("Основание");
			Запрос.УстановитьПараметр("СписокОснований", СписокОснований);
			Запрос.УстановитьПараметр("СсылкаДокументРасчет", Ссылка);
						
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Уже существует " + Выборка.ДокументРасчет + " с данными основаниями. Документ не сохранен.",,,,Отказ);
			КонецЦикла;
		Иначе 
			//Фаллико. Два договора ДУ. Вывод делаем по одному, но налог надо посчитать в двух расчетах 
			// проверим есть ли расчеты по другому договору
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
				|ПОМЕСТИТЬ _СчетаДУ
				|ИЗ
				|	(ВЫБРАТЬ
				|		КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
				|	ИЗ
				|		РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
				|				,
				|				Организация = &Организация
				|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних) КАК ВложенныйЗапрос
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
				|		ПО ВложенныйЗапрос.Клиент = КлиентыДоверительногоУправленияСрезПоследних.Клиент
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РасчетНДФЛ.Ссылка КАК ДокументРасчет,
				|	РасчетНДФЛ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
				|ИЗ
				|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
				|ГДЕ
				|	РасчетНДФЛ.СчетДоверительногоУправления В
				|			(ВЫБРАТЬ
				|				_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
				|			ИЗ
				|				_СчетаДУ КАК _СчетаДУ)
				|	И РасчетНДФЛ.СчетДоверительногоУправления <> &СчетДоверительногоУправления
				|	И РасчетНДФЛ.ОснованиеРасчета = ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ВыводАктивов)
				|	И РасчетНДФЛ.ДатаРасчета = &ДатаРасчета";
			
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("ДатаРасчета", ЭтотОбъект.ДатаРасчета);
			Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выводы средств есть в расчете НДФЛ по счету ДУ " + Выборка.СчетДоверительногоУправления, Выборка.ДокументРасчет,,,);	
			Иначе 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Таблица Выводов не заполнена. Документ не сохранен.",,,,Отказ);
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода Тогда 	
		Если ДатаРасчета <> НачалоДня(КонецГода(ДатаРасчета)) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата расчета не является концом года. Документ не сохранен.",,,,Отказ);
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетНДФЛ.Ссылка КАК ДокументРасчет
		|ИЗ
		|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
		|ГДЕ
		|	РасчетНДФЛ.Организация = &Организация
		|	И РасчетНДФЛ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РасчетНДФЛ.ОснованиеРасчета = ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода)
		|	И НЕ РасчетНДФЛ.ПометкаУдаления
		|	И РасчетНДФЛ.Ссылка <> &Ссылка
		|	И РасчетНДФЛ.ДатаРасчета = &ДатаРасчета";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Существует документ на конец " + Формат(Год(ДатаРасчета),"ЧГ=0") + " г.",,,,Отказ); 
		КонецЕсли;	
	ИначеЕсли ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора
		ИЛИ ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику
		ИЛИ ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.КорректировкаНалога Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетНДФЛ.Дата КАК Дата,
		|	РасчетНДФЛ.ОснованиеРасчета КАК ОснованиеРасчета
		|ИЗ
		|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
		|ГДЕ
		|	РасчетНДФЛ.Организация = &Организация
		|	И РасчетНДФЛ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РасчетНДФЛ.ОснованиеРасчета В(&ОснованиеРасчета)
		|	И НЕ РасчетНДФЛ.ПометкаУдаления
		|	И РасчетНДФЛ.Ссылка <> &Ссылка
		|	И РасчетНДФЛ.Дата <> &ДатаРасчета";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
		ОснованияРасторжения = Новый Массив;
		ОснованияРасторжения.Добавить(Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику);
		ОснованияРасторжения.Добавить(Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора);
		
		Запрос.УстановитьПараметр("ОснованиеРасчета", ОснованияРасторжения);
			
		Выборка = Запрос.Выполнить().Выбрать();
		Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора
			ИЛИ ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику Тогда 
			Если Выборка.Следующий() Тогда  
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СчетДоверительногоУправления + " есть Расчет НДФЛ от " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy") + " с основанием " + Выборка.ОснованиеРасчета + ", документ не сохранен",,,,Отказ); 
			КонецЕсли;
		ИначеЕсли ОснованиеРасчета =  Перечисления.ОснованияРасчетаНДФЛ.КорректировкаНалога Тогда 
			Если НЕ Выборка.Следующий() Тогда  
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СчетДоверительногоУправления + " нет Расчета НДФЛ с основанием 'Расторжение договора' или 'Перевод активов другому профучастнику', документ не сохранен",,,,Отказ); 
			Иначе
				Если Выборка.Дата >= ДатаРасчета Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СчетДоверительногоУправления + " есть Расчет НДФЛ от " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy") + " с основанием " + Выборка.ОснованиеРасчета + ". Корретировка налога должна быть позже расторжения договора или перевода активов",,,,Отказ); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокумента

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт 
	
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата); 
	ИФНС = БухгалтерскийУчет.ОпределитьИФНС(ЭтотОбъект.Ссылка);
	ВалютаРубль = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");

	// регистр БазаНачисленияНДФЛ 
	Движения.БазаНачисленияНДФЛ.Записывать = Истина;
	Для Каждого ТекСтрокаНалоговаяБаза Из НалоговаяБаза2025 Цикл
		
		Если (ЗначениеЗаполнено(ТекСтрокаНалоговаяБаза.ВидДохода) И ТекСтрокаНалоговаяБаза.СуммаНДФЛДоход > 0)
			ИЛИ (ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы = Перечисления.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы И ТекСтрокаНалоговаяБаза.СуммаДохода > 0) Тогда 
			Движение = Движения.БазаНачисленияНДФЛ.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ФизЛицо = Клиент;
			Движение.ВидНалогооблагаемойБазы = ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы;  
			Движение.ДатаПолученияДохода = Дата(ТекСтрокаНалоговаяБаза.Год, ТекСтрокаНалоговаяБаза.Месяц, 1);
			Движение.ВидДоходаВычета = ТекСтрокаНалоговаяБаза.ВидДохода;
			Движение.СтавкаНДФЛ = ТекСтрокаНалоговаяБаза.СтавкаНДФЛ; 
			Движение.СуммаНДФЛ = ТекСтрокаНалоговаяБаза.СуммаНДФЛДоход; 
			Движение.Сумма = ТекСтрокаНалоговаяБаза.СуммаДохода; 
			Движение.Примечание = ТекСтрокаНалоговаяБаза.Примечание;
		КонецЕсли;  
		
		Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда 
			Продолжить;  // вычет по дивидендам в НДФЛ не отражаем 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрокаНалоговаяБаза.ВидВычета) И ТекСтрокаНалоговаяБаза.СуммаНДФЛВычет <> 0 
			ИЛИ (ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы = Перечисления.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы И ТекСтрокаНалоговаяБаза.СуммаРасхода > 0) Тогда 
			Движение = Движения.БазаНачисленияНДФЛ.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ФизЛицо = Клиент;
			Движение.ВидНалогооблагаемойБазы = ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы;  
			Движение.ДатаПолученияДохода = Дата(ТекСтрокаНалоговаяБаза.Год, ТекСтрокаНалоговаяБаза.Месяц, 1);
			Движение.ВидДоходаВычета = ТекСтрокаНалоговаяБаза.ВидВычета;
			Движение.СтавкаНДФЛ = ТекСтрокаНалоговаяБаза.СтавкаНДФЛ; 
			Движение.СуммаНДФЛ = - ТекСтрокаНалоговаяБаза.СуммаНДФЛВычет; 
			Движение.Сумма = - ТекСтрокаНалоговаяБаза.СуммаРасхода;
			Движение.Примечание = ТекСтрокаНалоговаяБаза.Примечание;
		КонецЕсли;
	КонецЦикла; 
	
	//Регистр НачисленияНалогов
	Движения.НачисленияНалогов.Записывать = Истина; 
	//Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	Если ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда
		Для Каждого ТекСтрокаНалоговаяБаза Из НалоговаяБаза2025 Цикл 
			
			Движение = Движения.НачисленияНалогов.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДоверительногоУправления = СчетДоверительногоУправления;
			Движение.Налогоплательщик = Клиент; 
			Если ТекСтрокаНалоговаяБаза.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13 Тогда 
				Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ13;
			ИначеЕсли ТекСтрокаНалоговаяБаза.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15 Тогда 
				Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ15;
			КонецЕсли;
			Движение.Основание = ЭтотОбъект.Ссылка;
			Движение.БазаНалога = ТекСтрокаНалоговаяБаза.СуммаНДФЛДоход;
			Движение.Сумма = ТекСтрокаНалоговаяБаза.СуммаНалога;
			
			//уменьшение налога  
			Если ТекСтрокаНалоговаяБаза.СуммаНДФЛВычет > 0 Тогда   //СуммаУменьшающаяНалог может быть 0, но вычет <> 0
				Движение = Движения.НачисленияНалогов.Добавить();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.СчетДоверительногоУправления = СчетДоверительногоУправления;
				Движение.Налогоплательщик = Клиент; 
				Если ТекСтрокаНалоговаяБаза.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13 Тогда 
					Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ13;
				ИначеЕсли ТекСтрокаНалоговаяБаза.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15 Тогда 
					Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ15;
				КонецЕсли;
				Движение.Основание = ЭтотОбъект.Ссылка;
				Движение.БазаНалога = - ТекСтрокаНалоговаяБаза.СуммаНДФЛВычет;
				Движение.Сумма = - ТекСтрокаНалоговаяБаза.СуммаУменьшающаяНалог;
				Движение.Примечание = "Сумма уменьшающая налог по дивидендам";
			КонецЕсли;
			
			// задолжжность по НДФЛ
			//Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			//Движение.Период = Дата;
			//Движение.Организация = Организация;
			//Движение.СчетДоверительногоУправления = СчетДоверительногоУправления;
			//Движение.Основание = ЭтотОбъект.Ссылка;
			//Движение.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
			//Если ТекСтрокаНалоговаяБаза.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13 Тогда 
			//	Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ13;
			//ИначеЕсли ТекСтрокаНалоговаяБаза.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15 Тогда 
			//	Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ15;
			//КонецЕсли;
			//Движение.Валюта = ВалютаРубль;
			//Движение.Аванс = Ложь;
			//Движение.Контрагент = ИФНС;
			//Движение.Сумма = ТекСтрокаНалоговаяБаза.СуммаНалога + ТекСтрокаНалоговаяБаза.СуммаУменьшающаяНалог;  

		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка.Дата КАК Период,
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка.Организация КАК Организация,
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА РасчетНДФЛНалоговаяБаза2025.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|		КОГДА РасчетНДФЛНалоговаяБаза2025.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
		|		КОГДА РасчетНДФЛНалоговаяБаза2025.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ30)
		|	КОНЕЦ КАК ВидЗадолженности,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Налогоплательщик,
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка КАК Основание,
		|	СУММА(РасчетНДФЛНалоговаяБаза2025.СуммаНДФЛДоход - РасчетНДФЛНалоговаяБаза2025.СуммаНДФЛВычет) КАК БазаНалога,
		|	СУММА(РасчетНДФЛНалоговаяБаза2025.СуммаНалога) КАК Сумма
		|ИЗ
		|	Документ.РасчетНДФЛ.НалоговаяБаза2025 КАК РасчетНДФЛНалоговаяБаза2025
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = РасчетНДФЛНалоговаяБаза2025.Ссылка.СчетДоверительногоУправления)
		|ГДЕ
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка = &Ссылка
		|	И РасчетНДФЛНалоговаяБаза2025.ВидНалогооблагаемойБазы <> ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка.Организация,
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА РасчетНДФЛНалоговаяБаза2025.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|		КОГДА РасчетНДФЛНалоговаяБаза2025.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
		|		КОГДА РасчетНДФЛНалоговаяБаза2025.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ30)
		|	КОНЕЦ,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка,
		|	РасчетНДФЛНалоговаяБаза2025.Ссылка.Дата";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", Дата);
		
		Движения.НачисленияНалогов.Записывать = Истина;     
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Движения.НачисленияНалогов.Добавить(), Выборка);   
			
			// задолжжность по НДФЛ
			//Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			//Движение.Период = Дата;
			//Движение.Организация = Организация;
			//Движение.СчетДоверительногоУправления = СчетДоверительногоУправления;
			//Движение.Основание = ЭтотОбъект.Ссылка;
			//Движение.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
			//Движение.ВидЗадолженности =  Выборка.ВидЗадолженности;
			//Движение.Валюта = ВалютаРубль;
			//Движение.Аванс = Ложь;
			//Движение.Контрагент = ИФНС;
			//Движение.Сумма = Выборка.Сумма  
			
		КонецЦикла;
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента2025   

Функция ПолучитьДанныеДляНачисленияНалога(Запрос, ДатаРасчетаНДФЛ, ОсновнаяСтавка)
	
	Организация = ЭтотОбъект.Организация;
	СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления; 
	Период = КонецДня(ДатаРасчетаНДФЛ); 
	
	
	Запрос.УстановитьПараметр("ОсновнаяСтавка", ОсновнаяСтавка);
	
	АктивыЦБ = Новый Массив;
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.Акции);
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов);
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.Еврооблигации);
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.ЕврооблигацииКупон);
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративные);
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные);
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.Паи);
	АктивыЦБ.Добавить(Справочники.УчетныеАктивы.ПаиИностранныхЭмитентов);
	
	АктивыАкции = Новый Массив;
	АктивыАкции.Добавить(Справочники.УчетныеАктивы.Акции);
	АктивыАкции.Добавить(Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов);

 	АктивыПроценты = Новый Массив;
	АктивыПроценты.Добавить(Справочники.УчетныеАктивы.ДепозитныеВклады);
	АктивыПроценты.Добавить(Справочники.УчетныеАктивы.ПроцентыНаМНО);
	
	Комиссии = Новый Массив;
	Комиссии.Добавить(Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
	Комиссии.Добавить(Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии);
	Комиссии.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария);
	Комиссии.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария);
	Комиссии.Добавить(Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария);
	Комиссии.Добавить(Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего);
	Комиссии.Добавить(Справочники.ВидыЗадолженности.БанковскаяКомиссия);
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления); 
	Запрос.УстановитьПараметр("ДатаКонечная", Период); 
	Запрос.УстановитьПараметр("ДатаКонечнаяГраница", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаНачальная", НачалоГода(Период));  //всегда считаем с начала года. Если были движения задним числом, они должны быть скорретированы новом расчете
	// по ИИС никогда не будет движений пл НДФЛ за прошлые периоды, кроме дивидендов. 
	Запрос.УстановитьПараметр("ЭтоИИС", СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет);
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период);
	Запрос.УстановитьПараметр("Клиент", Клиент);
 		
	Запрос.УстановитьПараметр("АктивыЦБ", АктивыЦБ); 
	Запрос.УстановитьПараметр("АктивыАкции", АктивыАкции); 
	Запрос.УстановитьПараметр("АктивыПроценты", АктивыПроценты); 
	Запрос.УстановитьПараметр("Комиссии", Комиссии); 

	
	ГодОтчета = Год(Период);   
	Если ГодОтчета >= 2025 Тогда
		Запрос.УстановитьПараметр("ГодПравил", "2025");      // Добавился код 3023. Код действует с 2021 года, но мы применяем его с 2025
	ИначеЕсли ГодОтчета >= 2021 Тогда
		Если СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда
			Запрос.УстановитьПараметр("ГодПравил", "2025");  // для ИИС будем использовать код 3023 с 21 года, т.к. по ИИС делаем только закрытие договора. 
		Иначе
			Запрос.УстановитьПараметр("ГодПравил", "2021");
		КонецЕсли;
	ИначеЕсли ГодОтчета >= 2018 Тогда
		Запрос.УстановитьПараметр("ГодПравил", "2018");
	Иначе
		Запрос.УстановитьПараметр("ГодПравил", "до2018");
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов КАК АналитикаДоходов,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов
		|			ТОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|	КОНЕЦ КАК АналитикаДоходовОтРеализации,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов
		|				И НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации
		|			ТОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|	КОНЕЦ КАК АналитикаДоходовПоследнееПогашение,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов
		|				И НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации
		|				И НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение
		|			ТОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|	КОНЕЦ КАК АналитикаДоходовОтПереоценки,
		|	НастройкиУчетаАктивовСрезПоследних.АналитикаПерекурсовки КАК АналитикаПерекурсовки
		|ПОМЕСТИТЬ _НастройкиУчета
		|ИЗ
		|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|			&ДатаКонечная,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетДоверительногоУправления)
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)) КАК НастройкиУчетаАктивовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаКомиссииСрезПоследних.ВидЗадолженности КАК ВидЗадолженности,
		|	НастройкиУчетаКомиссииСрезПоследних.Аналитика КАК Аналитика,
		|	НастройкиУчетаКомиссииСрезПоследних.АналитикаРЕПО КАК АналитикаРЕПО
		|ПОМЕСТИТЬ _НастройкиУчетаКомиссии
		|ИЗ
		|	РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
		|			&ДатаКонечная,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)) КАК НастройкиУчетаКомиссииСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиВалютныхСредствУБрокера КАК АналитикаПерекурсовкиВалютныхСредствУБрокера,
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиВалютныхСредств КАК АналитикаПерекурсовкиВалютныхСредств,
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиВалютныхСредствВПути КАК АналитикаПерекурсовкиВалютныхСредствВПути,
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиДебеторскойЗадолженности КАК АналитикаПерекурсовкиДебеторскойЗадолженности,
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиКредиторскойЗадолженности КАК АналитикаПерекурсовкиКредиторскойЗадолженности,
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиСделокСВалютой КАК АналитикаПерекурсовкиСделокСВалютой,
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиСделокСВалютойЧерезБрокера КАК АналитикаПерекурсовкиСделокСВалютойЧерезБрокера,
		|	НастройкиУчетаОбщиеСрезПоследних.АналитикаПерекурсовкиЗаймов КАК АналитикаПерекурсовкиЗаймов
		|ПОМЕСТИТЬ _АналитикиКурсовыеНастройкиУчетаОбщие
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&ДатаКонечная,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_НастройкиУчета.АналитикаПерекурсовки КАК Аналитика
		|ПОМЕСТИТЬ _АналитикиКурсовые
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.АналитикаПерекурсовки <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиВалютныхСредствУБрокера
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиВалютныхСредств
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиВалютныхСредствВПути
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиДебеторскойЗадолженности
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиКредиторскойЗадолженности
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиСделокСВалютой
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиСделокСВалютойЧерезБрокера
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие.АналитикаПерекурсовкиЗаймов
		|ИЗ
		|	_АналитикиКурсовыеНастройкиУчетаОбщие КАК _АналитикиКурсовыеНастройкиУчетаОбщие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым) КАК ВидНОБ,
		|	_НастройкиУчета.АналитикаДоходов КАК Аналитика,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается) КАК ПризнакОРЦБ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ КАК КодДохода,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ КАК КодВычета,
		|	ЛОЖЬ КАК РаспределятьРасход,
		|	&ОсновнаяСтавка КАК СтавкаПоУмолчанию,
		|	НЕОПРЕДЕЛЕНО КАК ДопУсловие,
		|	ЛОЖЬ КАК НеУчитыватьВНОБ,
		|	"""" КАК Примечание
		|ПОМЕСТИТЬ _Коды
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В(&АктивыЦБ)
		|	И НЕ _НастройкиУчета.УчетныйАктив В (&АктивыАкции)
		|	И _НастройкиУчета.АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамНеобращаемым),
		|	_НастройкиУчета.АналитикаДоходов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.НеОбращается),
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1545)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1531)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код226)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код202)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В(&АктивыЦБ)
		|	И НЕ _НастройкиУчета.УчетныйАктив В (&АктивыАкции)
		|	И _НастройкиУчета.АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчета.АналитикаДоходовОтРеализации,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается),
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (&АктивыЦБ, ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
		|	И _НастройкиУчета.АналитикаДоходовОтРеализации <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчета.АналитикаДоходовПоследнееПогашение,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается),
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (&АктивыЦБ, ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
		|	И _НастройкиУчета.АналитикаДоходовПоследнееПогашение <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамНеобращаемым),
		|	_НастройкиУчета.АналитикаДоходовОтРеализации,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.НеОбращается),
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1545)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1531)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код226)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код202)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (&АктивыЦБ, ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
		|	И _НастройкиУчета.АналитикаДоходовОтРеализации <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамНеобращаемым),
		|	_НастройкиУчета.АналитикаДоходовПоследнееПогашение,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.НеОбращается),
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1545)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1531)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код226)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код202)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (&АктивыЦБ, ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
		|	И _НастройкиУчета.АналитикаДоходовПоследнееПогашение <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчета.АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""2021"", ""2025"")
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""2021"", ""2025"")
		|			ТОГДА """"
		|		ИНАЧЕ ""НКД гос. и муницип. обл.""
		|	КОНЕЦ
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон))
		|	И _НастройкиУчета.АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчета.АналитикаДоходовОтРеализации,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""2021"", ""2025"")
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""2021"", ""2025"")
		|			ТОГДА """"
		|		ИНАЧЕ ""НКД гос. и муницип. обл.""
		|	КОНЕЦ
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон))
		|	И _НастройкиУчета.АналитикаДоходовОтРеализации <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчета.АналитикаДоходовПоследнееПогашение,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""2021"", ""2025"")
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""2021"", ""2025"")
		|			ТОГДА """"
		|		ИНАЧЕ ""НКД гос. и муницип. обл.""
		|	КОНЕЦ
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон))
		|	И _НастройкиУчета.АналитикаДоходовПоследнееПогашение <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчета.АналитикаДоходов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается),
		|	ВЫБОР
		|		КОГДА &ГодПравил = ""2025""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код3023)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ЭтоИИС
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГодПравил = ""2025""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код253)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ЭтоИИС
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	ИСТИНА,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""до2018"", ""2021"", ""2025"")
		|			ТОГДА ЛОЖЬ
		|		КОГДА &ГодПравил = ""2018""
		|			ТОГДА ИСТИНА
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГодПравил В (""до2018"", ""2021"", ""2025"")
		|			ТОГДА """"
		|		КОГДА &ГодПравил = ""2018""
		|			ТОГДА ""НКД корп. обл. обращаемых, эмитированных после 01.01.2017""
		|	КОНЕЦ
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
		|	И _НастройкиУчета.АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчета.АналитикаДоходов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается),
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
		|	И _НастройкиУчета.АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамНеобращаемым),
		|	_НастройкиУчета.АналитикаДоходов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.НеОбращается),
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1545)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1531)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код226)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код202)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
		|	И _НастройкиУчета.АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоДивидендам),
		|	_НастройкиУчета.АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010),
		|	ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка),
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В(&АктивыАкции)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоРЕПО),
		|	_НастройкиУчета.АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1551)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1537)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код230)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код211)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.РасчетыПоПрямомуРЕПО), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.РасчетыПоОбратномуРЕПО))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоРЕПО),
		|	_НастройкиУчетаКомиссии.АналитикаРЕПО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1551)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1537)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код230)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код211)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	_НастройкиУчетаКомиссии КАК _НастройкиУчетаКомиссии
		|ГДЕ
		|	_НастройкиУчетаКомиссии.АналитикаРЕПО <> НЕОПРЕДЕЛЕНО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым),
		|	_НастройкиУчетаКомиссии.Аналитика,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1544)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код221)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
		|	КОНЕЦ,
		|	ИСТИНА,
		|	&ОсновнаяСтавка,
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""Распределяемые расходы""
		|ИЗ
		|	_НастройкиУчетаКомиссии КАК _НастройкиУчетаКомиссии
		|ГДЕ
		|	_НастройкиУчетаКомиссии.ВидЗадолженности В(&Комиссии)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы),
		|	_НастройкиУчета.АналитикаДоходов,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1552)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1538)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ЭтоИИС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код232)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код215)
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка0),
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""Проценты по депозитам и МНО""
		|ИЗ
		|	_НастройкиУчета КАК _НастройкиУчета
		|ГДЕ
		|	_НастройкиУчета.УчетныйАктив В(&АктивыПроценты)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы),
		|	_АналитикиКурсовые.Аналитика,
		|	НЕОПРЕДЕЛЕНО,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код4800),
		|	ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код620),
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка0),
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	""Курсовые разницы""
		|ИЗ
		|	_АналитикиКурсовые КАК _АналитикиКурсовые
		|ГДЕ
		|	_АналитикиКурсовые.Аналитика <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Обороты.Период КАК Период,
		|	Обороты.Субконто1 КАК ПрочиеДоходыРасходы,
		|	Обороты.Субконто3 КАК ОбращаетсяНаОРЦБ,
		|	Обороты.Субконто2 КАК ЦенныеБумаги,
		|	Обороты.СуммаОборотДт КАК Расход,
		|	Обороты.СуммаОборотКт КАК Доход,
		|	ВЫБОР
		|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|			ТОГДА ВЫБОР
		|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|							И Облигации.ДатаНачалаРазмещения >= ДАТАВРЕМЯ(2017, 1, 1)
		|							И Обороты.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается)
		|							И РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДопУсловие
		|ПОМЕСТИТЬ _ДоходыРасходы
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			ДЕНЬ,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетДоверительногоУправления),
		|			КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Основной.СальдоПрочихДоходовИРасходов),
		|			) КАК Обороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&ДатаКонечная,
		|					Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО Облигации.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО Обороты.Субконто2 = Облигации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_Коды.ВидНОБ, ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоПрочимДоходам)) КАК ВидНалогооблагаемойБазы,
		|	ГОД(&ДатаКонечная) КАК Год,
		|	МЕСЯЦ(&ДатаКонечная) КАК Месяц,
		|	ЕСТЬNULL(_Коды.КодДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код4800)) КАК ВидДохода,
		|	ЕСТЬNULL(_Коды.КодВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код620)) КАК ВидВычета,
		|	СУММА(ВЫБОР
		|			КОГДА _Коды.НеУчитыватьВНОБ
		|				ТОГДА _ДоходыРасходы.Доход - _ДоходыРасходы.Расход
		|			ИНАЧЕ _ДоходыРасходы.Доход
		|		КОНЕЦ) КАК СуммаДохода,
		|	СУММА(ВЫБОР
		|			КОГДА _Коды.НеУчитыватьВНОБ
		|				ТОГДА 0
		|			ИНАЧЕ _ДоходыРасходы.Расход
		|		КОНЕЦ) КАК СуммаРасхода,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(_Коды.СтавкаПоУмолчанию, &ОсновнаяСтавка) = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка0)
		|				ТОГДА 0
		|			КОГДА _Коды.НеУчитыватьВНОБ
		|				ТОГДА _ДоходыРасходы.Доход - _ДоходыРасходы.Расход
		|			ИНАЧЕ _ДоходыРасходы.Доход
		|		КОНЕЦ) КАК СуммаНДФЛДоход,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(_Коды.СтавкаПоУмолчанию, &ОсновнаяСтавка) = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка0)
		|				ТОГДА 0
		|			КОГДА _Коды.НеУчитыватьВНОБ
		|				ТОГДА _ДоходыРасходы.Доход - _ДоходыРасходы.Расход
		|			ИНАЧЕ _ДоходыРасходы.Расход
		|		КОНЕЦ) КАК СуммаНДФЛВычет,
		|	ЕСТЬNULL(_Коды.РаспределятьРасход, ЛОЖЬ) КАК РаспределятьРасход,
		|	0 КАК СуммаНалога,
		|	ЕСТЬNULL(_Коды.СтавкаПоУмолчанию, &ОсновнаяСтавка) КАК СтавкаНДФЛ,
		|	ЕСТЬNULL(_Коды.Примечание, """") КАК Примечание,
		|	0 КАК РаспределяемыеРасходы
		|ПОМЕСТИТЬ _НОБСНачалаГода
		|ИЗ
		|	_ДоходыРасходы КАК _ДоходыРасходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Коды КАК _Коды
		|		ПО _ДоходыРасходы.ПрочиеДоходыРасходы = _Коды.Аналитика
		|			И (_Коды.ПризнакОРЦБ = НЕОПРЕДЕЛЕНО
		|				ИЛИ _ДоходыРасходы.ОбращаетсяНаОРЦБ = _Коды.ПризнакОРЦБ)
		|			И (_Коды.ДопУсловие = НЕОПРЕДЕЛЕНО
		|				ИЛИ _Коды.ДопУсловие = _ДоходыРасходы.ДопУсловие)
		|ГДЕ
		|	НЕ ЕСТЬNULL(_Коды.ВидНОБ, ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоПрочимДоходам)) В (ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоДивидендам))
		|
		|СГРУППИРОВАТЬ ПО
		|	_Коды.ВидНОБ,
		|	ЕСТЬNULL(_Коды.КодДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код4800)),
		|	ЕСТЬNULL(_Коды.КодВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код620)),
		|	_Коды.РаспределятьРасход,
		|	ЕСТЬNULL(_Коды.СтавкаПоУмолчанию, &ОсновнаяСтавка),
		|	_Коды.НеУчитыватьВНОБ,
		|	ЕСТЬNULL(_Коды.Примечание, """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыДоходовНДФЛ.Ссылка КАК ВидДохода,
		|	ВидыДоходовНДФЛ.ВидВычета КАК ВидВычета
		|ПОМЕСТИТЬ _СвязиКодов
		|ИЗ
		|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
		|ГДЕ
		|	НЕ ВидыДоходовНДФЛ.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ВидНалогооблагаемойБазы КАК ВидНалогооблагаемойБазы,
		|	ВложенныйЗапрос.ВидДохода КАК ВидДохода,
		|	ВложенныйЗапрос.ВидВычета КАК ВидВычета,
		|	СУММА(ВложенныйЗапрос.СуммаДохода) КАК СуммаДохода,
		|	СУММА(ВложенныйЗапрос.СуммаРасхода) КАК СуммаРасхода,
		|	СУММА(ВложенныйЗапрос.СуммаНДФЛДоход) КАК СуммаНДФЛДоход,
		|	СУММА(ВложенныйЗапрос.СуммаНДФЛВычет) КАК СуммаНДФЛВычет,
		|	0 КАК СуммаНалога,
		|	ЛОЖЬ КАК РаспределятьРасход,
		|	ВложенныйЗапрос.Примечание КАК Примечание
		|ПОМЕСТИТЬ _ДвиженияНДФЛ
		|ИЗ
		|	(ВЫБРАТЬ
		|		БазаНачисленияНДФЛ.ВидНалогооблагаемойБазы КАК ВидНалогооблагаемойБазы,
		|		БазаНачисленияНДФЛ.ВидДоходаВычета КАК ВидДохода,
		|		БазаНачисленияНДФЛ.ВидДоходаВычета.ВидВычета КАК ВидВычета,
		|		БазаНачисленияНДФЛ.Сумма КАК СуммаДохода,
		|		0 КАК СуммаРасхода,
		|		БазаНачисленияНДФЛ.СуммаНДФЛ КАК СуммаНДФЛДоход,
		|		0 КАК СуммаНДФЛВычет,
		|		БазаНачисленияНДФЛ.Примечание КАК Примечание
		|	ИЗ
		|		РегистрНакопления.БазаНачисленияНДФЛ КАК БазаНачисленияНДФЛ
		|	ГДЕ
		|		БазаНачисленияНДФЛ.Организация = &Организация
		|		И БазаНачисленияНДФЛ.ФизЛицо = &Клиент
		|		И БазаНачисленияНДФЛ.Период < НАЧАЛОПЕРИОДА(&ДатаКонечная, ДЕНЬ)
		|		И ГОД(БазаНачисленияНДФЛ.ДатаПолученияДохода) = ГОД(&ДатаКонечная)
		|		И БазаНачисленияНДФЛ.Активность
		|		И ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛ.ВидДоходаВычета) = ТИП(Справочник.ВидыДоходовНДФЛ)
		|		И БазаНачисленияНДФЛ.ВидНалогооблагаемойБазы <> ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоДивидендам)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		БазаНачисленияНДФЛ.ВидНалогооблагаемойБазы,
		|		_СвязиКодов.ВидДохода,
		|		БазаНачисленияНДФЛ.ВидДоходаВычета,
		|		0,
		|		-БазаНачисленияНДФЛ.Сумма,
		|		0,
		|		-БазаНачисленияНДФЛ.СуммаНДФЛ,
		|		БазаНачисленияНДФЛ.Примечание
		|	ИЗ
		|		РегистрНакопления.БазаНачисленияНДФЛ КАК БазаНачисленияНДФЛ
		|			ЛЕВОЕ СОЕДИНЕНИЕ _СвязиКодов КАК _СвязиКодов
		|			ПО БазаНачисленияНДФЛ.ВидДоходаВычета = _СвязиКодов.ВидВычета
		|	ГДЕ
		|		БазаНачисленияНДФЛ.Организация = &Организация
		|		И БазаНачисленияНДФЛ.ФизЛицо = &Клиент
		|		И БазаНачисленияНДФЛ.Период < НАЧАЛОПЕРИОДА(&ДатаКонечная, ДЕНЬ)
		|		И ГОД(БазаНачисленияНДФЛ.ДатаПолученияДохода) = ГОД(&ДатаКонечная)
		|		И БазаНачисленияНДФЛ.Активность
		|		И ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛ.ВидДоходаВычета) = ТИП(Справочник.ВидыВычетовНДФЛ)
		|		И БазаНачисленияНДФЛ.ВидНалогооблагаемойБазы <> ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоДивидендам)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ВидНалогооблагаемойБазы,
		|	ВложенныйЗапрос.ВидДохода,
		|	ВложенныйЗапрос.ВидВычета,
		|	ВложенныйЗапрос.Примечание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СУММА(НачисленияНалоговОбороты.СуммаОборот),
		|	ЛОЖЬ,
		|	""""
		|ИЗ
		|	РегистрНакопления.НачисленияНалогов.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечнаяГраница,
		|			Регистратор,
		|			Организация = &Организация
		|				И Налогоплательщик = &Клиент) КАК НачисленияНалоговОбороты
		|ГДЕ
		|	ВЫРАЗИТЬ(НачисленияНалоговОбороты.Регистратор КАК Документ.РасчетНДФЛ).ОснованиеРасчета <> ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НОБСНачалаГода.ВидНалогооблагаемойБазы КАК ВидНалогооблагаемойБазы,
		|	_НОБСНачалаГода.Год КАК Год,
		|	_НОБСНачалаГода.Месяц КАК Месяц,
		|	_НОБСНачалаГода.ВидДохода КАК ВидДохода,
		|	_НОБСНачалаГода.ВидВычета КАК ВидВычета,
		|	_НОБСНачалаГода.СуммаДохода - ЕСТЬNULL(_ДвиженияНДФЛ.СуммаДохода, 0) КАК СуммаДохода,
		|	_НОБСНачалаГода.СуммаРасхода - ЕСТЬNULL(_ДвиженияНДФЛ.СуммаРасхода, 0) КАК СуммаРасхода,
		|	_НОБСНачалаГода.СуммаНДФЛДоход - ЕСТЬNULL(_ДвиженияНДФЛ.СуммаНДФЛДоход, 0) КАК СуммаНДФЛДоход,
		|	_НОБСНачалаГода.СуммаНДФЛВычет - ЕСТЬNULL(_ДвиженияНДФЛ.СуммаНДФЛВычет, 0) КАК СуммаНДФЛВычет,
		|	_НОБСНачалаГода.РаспределятьРасход КАК РаспределятьРасход,
		|	_НОБСНачалаГода.СуммаНалога КАК СуммаНалога,
		|	_НОБСНачалаГода.СтавкаНДФЛ КАК СтавкаНДФЛ,
		|	_НОБСНачалаГода.Примечание КАК Примечание,
		|	_НОБСНачалаГода.РаспределяемыеРасходы КАК РаспределяемыеРасходы
		|ИЗ
		|	_НОБСНачалаГода КАК _НОБСНачалаГода
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДвиженияНДФЛ КАК _ДвиженияНДФЛ
		|		ПО _НОБСНачалаГода.ВидНалогооблагаемойБазы = _ДвиженияНДФЛ.ВидНалогооблагаемойБазы
		|			И _НОБСНачалаГода.ВидДохода = _ДвиженияНДФЛ.ВидДохода
		|			И _НОБСНачалаГода.ВидВычета = _ДвиженияНДФЛ.ВидВычета
		|			И (НЕ _НОБСНачалаГода.РаспределятьРасход)";  
	
	Возврат Запрос.Выполнить().Выгрузить();   
		
КонецФункции

Функция ПолучитьДанныеДляНачисленияНалогаПоДивидендам(Запрос, ДатаРасчетаНДФЛ)	
	
	Организация = ЭтотОбъект.Организация;
	СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления; 
	Период = КонецДня(ДатаРасчетаНДФЛ);	
	
	// на момент заполнения документа проводок по НУ может не быть. 
	// сведения о дивидендах берем из регистра ЗадолженностиПоДенежнымСредствам 
	
	АктивыАкции = Новый Массив;
	АктивыАкции.Добавить(Справочники.УчетныеАктивы.Акции);
	АктивыАкции.Добавить(Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления); 
	Запрос.УстановитьПараметр("Клиент", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период)); 
	Запрос.УстановитьПараметр("ДатаКонечная",  КонецДня(Период)); 
	Запрос.УстановитьПараметр("ДатаКонечнаяГраница", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая)); 
	Запрос.УстановитьПараметр("ОплатыПоДивидендам", ЭтотОбъект.Основания.ВыгрузитьКолонку("Основание"));   
	// Расчет можем делать не в дату оплаты. Возьмем данные непосредтвенно из движений, сделанных оплатами
	
	// может быть несколько начислений дивидендов в 1 день. Эта ситуация не смоделирована. 
	
	Запрос.УстановитьПараметр("ДатаНачальная", НачалоДня(Период));  
	
//	Запрос.УстановитьПараметр("АктивыАкции", АктивыАкции); 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
		|	ГОД(ЗадолженностиПоДенежнымСредствам.Период) КАК Год,
		|	МЕСЯЦ(ЗадолженностиПоДенежнымСредствам.Период) КАК Месяц,
		|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК ДокументНачисление,
		|	НачислениеДивидендов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫРАЗИТЬ(НачислениеДивидендов.СуммаОбъявленная * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(19, 2)) КАК СуммаОбъявленная,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК ИдСобытия
		|ПОМЕСТИТЬ _НачисленияДивидендов
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
		|		ПО ЗадолженностиПоДенежнымСредствам.Основание = НачислениеДивидендов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&ДатаКонечная,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.НРД)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.КорпоративноеСобытиеПоВыплатеДивидендов)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО (НачислениеДивидендов.Ссылка = КодыВоВнешнихСистемахСрезПоследних.Объект)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствам.Валюта = КурсыВалют.Валюта
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) = КурсыВалют.Период)
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор В(&ОплатыПоДивидендам)
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции)
		|	И ЗадолженностиПоДенежнымСредствам.Активность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НачисленияДивидендов.СуммаОбъявленная КАК Сумма,
		|	ВЫБОР
		|		КОГДА ДивидендыПоАкциямСрезПоследних.Д1 = 0
		|				ИЛИ ДивидендыПоАкциямСрезПоследних.Д1 ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДивидендыПоАкциямСрезПоследних.Д1 > ДивидендыПоАкциямСрезПоследних.Д2
		|					ТОГДА ВЫРАЗИТЬ(_НачисленияДивидендов.СуммаОбъявленная * ДивидендыПоАкциямСрезПоследних.Д2 / ДивидендыПоАкциямСрезПоследних.Д1 КАК ЧИСЛО(19, 2))
		|				ИНАЧЕ _НачисленияДивидендов.СуммаОбъявленная
		|			КОНЕЦ
		|	КОНЕЦ КАК Вычет,
		|	_НачисленияДивидендов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_НачисленияДивидендов.Год КАК Год,
		|	_НачисленияДивидендов.Месяц КАК Месяц,
		|	ДивидендыПоАкциямСрезПоследних.Д1 КАК Д1,
		|	ДивидендыПоАкциямСрезПоследних.Д2 КАК Д2
		|ПОМЕСТИТЬ _ВычетыПоДивидендам
		|ИЗ
		|	_НачисленияДивидендов КАК _НачисленияДивидендов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДивидендыПоАкциям.СрезПоследних(
		|				&ДатаКонечная,
		|				ИдСобытияПоВыплатеДивидендов В
		|					(ВЫБРАТЬ
		|						_НачисленияДивидендов.ИдСобытия КАК ИдСобытия
		|					ИЗ
		|						_НачисленияДивидендов КАК _НачисленияДивидендов)) КАК ДивидендыПоАкциямСрезПоследних
		|		ПО _НачисленияДивидендов.ЦеннаяБумага = ДивидендыПоАкциямСрезПоследних.Акция
		|			И _НачисленияДивидендов.ИдСобытия = ДивидендыПоАкциямСрезПоследних.ИдСобытияПоВыплатеДивидендов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ВидНалогооблагаемойБазы КАК ВидНалогооблагаемойБазы,
		|	ВложенныйЗапрос.ВидДохода КАК ВидДохода,
		|	ВложенныйЗапрос.ВидВычета КАК ВидВычета,
		|	СУММА(ВложенныйЗапрос.СуммаДохода) КАК СуммаДохода,
		|	СУММА(ВложенныйЗапрос.СуммаРасхода) КАК СуммаРасхода,
		|	СУММА(ВложенныйЗапрос.СуммаНДФЛДоход) КАК СуммаНДФЛДоход,
		|	СУММА(ВложенныйЗапрос.СуммаНДФЛВычет) КАК СуммаНДФЛВычет,
		|	0 КАК СуммаНалога,
		|	ЛОЖЬ КАК РаспределятьРасход,
		|	0 КАК РаспределяемыеРасходы
		|ПОМЕСТИТЬ _ДвиженияНДФЛ
		|ИЗ
		|	(ВЫБРАТЬ
		|		БазаНачисленияНДФЛОбороты.ВидНалогооблагаемойБазы КАК ВидНалогооблагаемойБазы,
		|		БазаНачисленияНДФЛОбороты.ВидДоходаВычета КАК ВидДохода,
		|		БазаНачисленияНДФЛОбороты.ВидДоходаВычета.ВидВычета КАК ВидВычета,
		|		БазаНачисленияНДФЛОбороты.СуммаОборот КАК СуммаДохода,
		|		0 КАК СуммаРасхода,
		|		БазаНачисленияНДФЛОбороты.СуммаНДФЛОборот КАК СуммаНДФЛДоход,
		|		0 КАК СуммаНДФЛВычет
		|	ИЗ
		|		РегистрНакопления.БазаНачисленияНДФЛ.Обороты(
		|				,
		|				&ДатаКонечнаяГраница,
		|				,
		|				Организация = &Организация
		|					И ФизЛицо = &Клиент
		|					И ГОД(ДатаПолученияДохода) = ГОД(&ДатаКонечная)) КАК БазаНачисленияНДФЛОбороты
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛОбороты.ВидДоходаВычета) = ТИП(Справочник.ВидыДоходовНДФЛ)
		|		И БазаНачисленияНДФЛОбороты.ВидНалогооблагаемойБазы = ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоДивидендам)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ВидНалогооблагаемойБазы,
		|	ВложенныйЗапрос.ВидДохода,
		|	ВложенныйЗапрос.ВидВычета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СУММА(НачисленияНалоговОбороты.СуммаОборот),
		|	ЛОЖЬ,
		|	0
		|ИЗ
		|	РегистрНакопления.НачисленияНалогов.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечнаяГраница,
		|			Регистратор,
		|			Организация = &Организация
		|				И Налогоплательщик = &Клиент) КАК НачисленияНалоговОбороты
		|ГДЕ
		|	ВЫРАЗИТЬ(НачисленияНалоговОбороты.Регистратор КАК Документ.РасчетНДФЛ).ОснованиеРасчета = ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоДивидендам) КАК ВидНалогооблагаемойБазы,
		|	_ВычетыПоДивидендам.Год КАК Год,
		|	_ВычетыПоДивидендам.Месяц КАК Месяц,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010) КАК ВидДохода,
		|	ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код601) КАК ВидВычета,
		|	СУММА(_ВычетыПоДивидендам.Сумма) КАК СуммаДохода,
		|	СУММА(_ВычетыПоДивидендам.Вычет) КАК СуммаРасхода,
		|	СУММА(_ВычетыПоДивидендам.Сумма) КАК СуммаНДФЛДоход,
		|	СУММА(_ВычетыПоДивидендам.Вычет) КАК СуммаНДФЛВычет,
		|	ЛОЖЬ КАК РаспределятьРасход,
		|	0 КАК СуммаНалога,
		|	0 КАК СуммаУменьшающаяНалог,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13) КАК СтавкаНДФЛ,
		|	0 КАК РаспределяемыеРасходы
		|ИЗ
		|	_ВычетыПоДивидендам КАК _ВычетыПоДивидендам
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВычетыПоДивидендам.Год,
		|	_ВычетыПоДивидендам.Месяц";  
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьБазуДвиженийНДФЛ(ДатаРасчета, ОсновнаяСтавка, Отказ = Ложь) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Если ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда
		ТаблицаНОБ = ПолучитьДанныеДляНачисленияНалогаПоДивидендам(Запрос, ДатаРасчета);
	Иначе 
		ТаблицаНОБ = ПолучитьДанныеДляНачисленияНалога(Запрос, ДатаРасчета, ОсновнаяСтавка);
	КонецЕсли; 
	
	ДвиженияНДФЛ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДвиженияНДФЛ").ПолучитьДанные().Выгрузить();	
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТаблицаНОБ", ТаблицаНОБ);
	Результат.Вставить("ДвиженияНДФЛ", ДвиженияНДФЛ);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧасть(Отказ = Ложь) Экспорт

	Перем ДанныеПрошлыхЛет;
	
	ЭтоРезидент = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата), ЭтотОбъект.Организация, Дата);
	Если ЭтоРезидент <> Неопределено Тогда 
		Если ЭтоРезидент Тогда 
			ОсновнаяСтавка = Перечисления.СтавкиНДФЛ.Ставка13;
		Иначе
			ОсновнаяСтавка = Перечисления.СтавкиНДФЛ.Ставка30;
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СчетДоверительногоУправления + " на " + Формат(Дата, "ДФ=dd.MM.yyyy") + " не заполнены анкетные данные. Статус резидента неопределен.");
		Возврат;
	КонецЕсли;	

	//Документы за прошлые годы по ИИС
	Если ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику 
		ИЛИ ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.КорректировкаНалога 
		ИЛИ (ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора И ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		ИЛИ (ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаНаследнику И ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет) Тогда
					
		ГодОт = Год(ЭтотОбъект.СчетДоверительногоУправления.ДатаЗаключения);
		ГодДо = Год(ЭтотОбъект.ДатаРасчета)-1;
		Для ГодРасчета=ГодОт по ГодДо Цикл 
			ДатаРасчетаПрошлое = Дата(ГодРасчета, 12, 31);
			
			Результат = ПолучитьБазуДвиженийНДФЛ(КонецДня(ДатаРасчетаПрошлое), ОсновнаяСтавка); //Результат = Документы.РасчетНДФЛ.Расчет_НДФЛ(Объект.Организация, Объект.СчетДоверительногоУправления, КонецДня(ДатаРасчетаПрошлое), ,Объект.ОснованиеРасчета);	
			Если Результат = Неопределено Тогда 
				Продолжить;
			КонецЕсли;				
			Если ДанныеПрошлыхЛет = Неопределено Тогда 
				ДанныеПрошлыхЛет = Результат.ТаблицаНОБ.Скопировать();
			Иначе
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(Результат.ТаблицаНОБ, ДанныеПрошлыхЛет); 
			Конецесли;	
		
		КонецЦикла;
		
	КонецЕсли;
	
	//Текущий период
	Результат = ПолучитьБазуДвиженийНДФЛ(ЭтотОбъект.ДатаРасчета, ОсновнаяСтавка);
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если ДанныеПрошлыхЛет <> Неопределено Тогда
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ДанныеПрошлыхЛет, Результат.ТаблицаНОБ);
		Результат.ТаблицаНОБ.Сортировать("Год, Месяц");
	КонецЕсли;  
	
	Если Дата >= '2025.01.01' 
		ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда  // по ИСС только закрытие. По ФЛ с 2025 года. 
		УчитыватьВсеДоходыПриРаспределенииРасходовНеЦБ = Истина;
	Иначе
		УчитыватьВсеДоходыПриРаспределенииРасходовНеЦБ = Ложь;
	КонецЕсли;
		
	ВыполнитьРасчетНалоговойБазы(Результат.ТаблицаНОБ, Результат.ДвиженияНДФЛ, ОсновнаяСтавка, УчитыватьВсеДоходыПриРаспределенииРасходовНеЦБ);
	
	ЭтотОбъект.НалоговаяБаза2025.Очистить();
	Для Каждого СтрокаРезультат из Результат.ТаблицаНОБ Цикл    
		
		//могут быть строки с нулевыми показателями. мы их пропустим
		Если СтрокаРезультат.СуммаНДФЛДоход = 0 И СтрокаРезультат.СуммаНДФЛВычет = 0
			И СтрокаРезультат.СуммаДохода = 0 И СтрокаРезультат.СуммаРасхода = 0
			И СтрокаРезультат.СуммаНалога = 0 И СтрокаРезультат.РаспределяемыеРасходы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ЭтотОбъект.НалоговаяБаза2025.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультат);
		
	КонецЦикла; 
	
	
КонецПроцедуры

Процедура ДобавитьСведенияОНалоге(НалоговыеНачисленияПоДокументу, СтавкаНДФЛ, СуммаНалога)
	
	Если НалоговыеНачисленияПоДокументу = Неопределено Тогда
		НалоговыеНачисленияПоДокументу = Новый ТаблицаЗначений; 
		НалоговыеНачисленияПоДокументу.Колонки.Добавить("СтавкаНДФЛ"); 
		НалоговыеНачисленияПоДокументу.Колонки.Добавить("СуммаНалога"); 
	КонецЕсли;
	
	НоваяСтрока = НалоговыеНачисленияПоДокументу.Добавить();
	НоваяСтрока.СтавкаНДФЛ = СтавкаНДФЛ;
	НоваяСтрока.СуммаНалога = СуммаНалога;
	
КонецПроцедуры

Процедура РасчитатьСуммуНалогаПоДокументу(СуммаДохода, СуммаДоходаНаНачалоРасчета, СуммаНалогаРанееНачисленного, ПороговаяСумма, ОсновнаяСтавка, НалоговыеНачисленияПоДокументу)
	
	// вернем таблицу: сколько налога по какой ставке начислено
	// Расчет строк и округление нужно считатать по всем ставкам, что бы в случае выделения налога по ставке 15%
	// сумма налога по ставке 13% за всеть год была равна ровно ПороговаяСумма * 0.13 
	// если так не сделать,  то общая сумма будет правильная, но распределение налога по ставкам из-за округления может отличаться.
		
	СуммаДоходаСНачалаГода = СуммаДоходаНаНачалоРасчета + СуммаДохода; 
	
	ПовышеннаяСтавка = Перечисления.СтавкиНДФЛ.Ставка15;  //   0.15;  // Пока так. Возможно будут еще ступени    
	
	Если (ПороговаяСумма = 0) 
		ИЛИ (СуммаДоходаСНачалаГода <= ПороговаяСумма)  Тогда    
		// это нерезидент, древние времена когда не было повышенной ставки, или просто уложились в доход ниже порога
		СуммаНалогаСНачалаГода = Окр(СуммаДоходаСНачалаГода * РаботаСНалогамиКлиентСервер.ЧисловоеЗначениеСтавкиНДФЛ(ОсновнаяСтавка), 0);  
		СуммаНалога = СуммаНалогаСНачалаГода - СуммаНалогаРанееНачисленного; 
		ДобавитьСведенияОНалоге(НалоговыеНачисленияПоДокументу, ОсновнаяСтавка, СуммаНалога);
	Иначе	
		СуммаНалогаСНачалаГода = ПороговаяСумма * РаботаСНалогамиКлиентСервер.ЧисловоеЗначениеСтавкиНДФЛ(ОсновнаяСтавка) + Окр((СуммаДоходаСНачалаГода - ПороговаяСумма) * РаботаСНалогамиКлиентСервер.ЧисловоеЗначениеСтавкиНДФЛ(ПовышеннаяСтавка), 0); 
		Если СуммаДоходаНаНачалоРасчета > ПороговаяСумма Тогда //Только 15% 
			СуммаНалога = СуммаНалогаСНачалаГода - СуммаНалогаРанееНачисленного; 
			ДобавитьСведенияОНалоге(НалоговыеНачисленияПоДокументу, ПовышеннаяСтавка, СуммаНалога);
		Иначе // делим 13, 15%  
			СуммаНалогаПороговая = ПороговаяСумма * РаботаСНалогамиКлиентСервер.ЧисловоеЗначениеСтавкиНДФЛ(ОсновнаяСтавка);

			СуммаНалога13 =  СуммаНалогаПороговая - СуммаНалогаРанееНачисленного;
			СуммаНалога15 =  СуммаНалогаСНачалаГода - СуммаНалогаПороговая; 
			
			ДобавитьСведенияОНалоге(НалоговыеНачисленияПоДокументу, ОсновнаяСтавка, СуммаНалога13);
			ДобавитьСведенияОНалоге(НалоговыеНачисленияПоДокументу, ПовышеннаяСтавка, СуммаНалога15);
		КонецЕсли
	КонецЕсли; 
	
КонецПроцедуры

Процедура РасчетСуммыНалога(ТаблицаНОБ, СуммаДоходаНаНачалоРасчета, ПороговаяСумма, СуммаНалогаРанееНачисленного, ОсновнаяСтавка, СуммаНалогаКРаспределениюВведеннаяВручную = 0, ТолькоПересчет = Ложь) Экспорт
	
	Перем НалоговыеНачисленияПоДокументу;
	
	// ТолькоПересчет = Истина - Это вызов из формы документа при изменении руками табличной части. 

	Если ТолькоПересчет Тогда
		Если СуммаНалогаКРаспределениюВведеннаяВручную <> 0 Тогда  // только если считаем налог из формы в интерактивном режиме 
			РучнойРасчет = Истина;
			Погрешность = СуммаНалогаКРаспределениюВведеннаяВручную;
		Иначе
			РучнойРасчет = Ложь;
		КонецЕсли;
		Для Каждого СтрокаНОБ из ТаблицаНОБ Цикл
			ТекущаяСтавка = СтрокаНОБ.СтавкаНДФЛ;
			Ставка = РаботаСНалогамиКлиентСервер.ЧисловоеЗначениеСтавкиНДФЛ(ТекущаяСтавка);
			Если Ставка <> Неопределено Тогда
				СуммаНалога = (СтрокаНОБ.СуммаНДФЛДоход - СтрокаНОБ.СуммаНДФЛВычет) * Ставка;
				ДобавитьСведенияОНалоге(НалоговыеНачисленияПоДокументу, ТекущаяСтавка, СуммаНалога);
				Если РучнойРасчет Тогда 
					Погрешность = Погрешность - СуммаНалога;
				КонецЕсли;
			Иначе 
				Продолжить;  
				//строка добавлена вручную. Ставка не заполнена
			КонецЕсли;
		КонецЦикла;
		Если РучнойРасчет И Погрешность <> 0 Тогда //тут бы не помешала проверка, что разница слишком большая. Погрешность должна быть не больше одного рубля
			ДобавитьСведенияОНалоге(НалоговыеНачисленияПоДокументу, ТекущаяСтавка, Погрешность); 
		КонецЕсли;
		
		Если НалоговыеНачисленияПоДокументу <> Неопределено Тогда
			НалоговыеНачисленияПоДокументу.Свернуть("СтавкаНДФЛ", "СуммаНалога");
			//Для Каждого СтрокаНачислений из НалоговыеНачисленияПоДокументу Цикл 
			//	СтрокаНачислений.СуммаНалога = Окр(СтрокаНачислений.СуммаНалога, 0);
			//КонецЦикла;
			СуммаНалогаКРаспределению = Окр(НалоговыеНачисленияПоДокументу.Итог("СуммаНалога"), 0); 
		Иначе
			СуммаНалогаКРаспределению = 0;
		КонецЕсли;
		
	Иначе
		
		СуммаДохода = ТаблицаНОБ.Итог("СуммаНДФЛДоход") - ТаблицаНОБ.Итог("СуммаНДФЛВычет");  // полученная между двумя расчетами 
		РасчитатьСуммуНалогаПоДокументу(СуммаДохода, СуммаДоходаНаНачалоРасчета, СуммаНалогаРанееНачисленного, ПороговаяСумма, ОсновнаяСтавка, НалоговыеНачисленияПоДокументу); 
		СуммаНалогаКРаспределению = НалоговыеНачисленияПоДокументу.Итог("СуммаНалога");
		//СуммаНалогаКРаспределению = РасчитатьСуммуНалогаПоДокументу(СуммаДохода, СуммаДоходаНаНачалоРасчета, СуммаНалогаРанееНачисленного, ПороговаяСумма, ОсновнаяСтавка);
				
		//проверим сумму вывода. Если сумма вывода меньше суммы налога, мы должны перезаполнить ТаблицаНОБ и взять налог с вывода
		Если ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда
			СуммаВывода = ЭтотОбъект.Основания.Итог("Сумма");
			Если СуммаВывода < СуммаНалогаКРаспределению И СуммаВывода <> 0 Тогда
				//делаем одну строку. остальное удаляем
				
				ТаблицаНОБ.Сортировать("СуммаДохода Убыв");
				ЭталоннаяСтрока = РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(ТаблицаНОБ[0]);
				
				ТаблицаНОБ.Очистить();
				ЗаполнитьЗначенияСвойств(ТаблицаНОБ.Добавить(), ЭталоннаяСтрока);
				ТаблицаНОБ[0].СуммаРасхода = 0;
				ТаблицаНОБ[0].СуммаНДФЛВычет = 0;
				ТаблицаНОБ[0].СуммаДохода = СуммаВывода;
				ТаблицаНОБ[0].СуммаНДФЛДоход = СуммаВывода;
				ТаблицаНОБ[0].Примечание = "Налог с суммы вывода";     
				
				СуммаДохода = СуммаВывода;
				РасчитатьСуммуНалогаПоДокументу(СуммаДохода, СуммаДоходаНаНачалоРасчета, СуммаНалогаРанееНачисленного, ПороговаяСумма, ОсновнаяСтавка, НалоговыеНачисленияПоДокументу);
			КонецЕсли; 
		КонецЕсли;
		
		Если (СуммаДоходаНаНачалоРасчета > ПороговаяСумма) Тогда 
			
			Для Каждого СтрокаНОБ из ТаблицаНОБ Цикл
				Если СтрокаНОБ.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13 Тогда
					СтрокаНОБ.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли (СуммаДоходаНаНачалоРасчета < ПороговаяСумма)
			И ((СуммаДоходаНаНачалоРасчета + СуммаДохода )> ПороговаяСумма) Тогда
			
			РаспределяемаяСумма = ПороговаяСумма - СуммаДоходаНаНачалоРасчета;
			
			ТаблицаНОБ.Сортировать("СуммаНДФЛДоход Убыв");
			
			МассивУдаляемыхСтрок = Новый Массив;
			//делим доходы по ставке 13 и 15%
			Для Индекс = 0 по ТаблицаНОБ.Количество()-1 Цикл
				СтрокаТаблицы = ТаблицаНОБ[индекс];
				Если СтрокаТаблицы.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка0 Тогда 
					Продолжить;
				КонецЕсли;
				СуммаДоход = СтрокаТаблицы.СуммаНДФЛДоход - СтрокаТаблицы.СуммаНДФЛВычет; 
				Если СуммаДоход < 0 
					И СтрокаТаблицы.Примечание <> "Распределяемые расходы" Тогда
					Продолжить; //убыток по строке. не распределяем.
				КонецЕсли; 
				Если СуммаДоход > РаспределяемаяСумма И РаспределяемаяСумма <> 0 Тогда  // повезло. Есть доход по 15%
					Сумма15 = СтрокаТаблицы.СуммаНДФЛДоход - РаспределяемаяСумма;
					Сумма13 = РаспределяемаяСумма;

					//строка 15%
					НоваяСтрока = ТаблицаНОБ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					НоваяСтрока.СуммаДохода = Сумма15;
					НоваяСтрока.СуммаНДФЛДоход = Сумма15; 
					НоваяСтрока.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15;  
					
					//добавим строку 13%
					НоваяСтрока = ТаблицаНОБ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					НоваяСтрока.СуммаДохода = Сумма13;
					НоваяСтрока.СуммаНДФЛДоход = Сумма13; 
					НоваяСтрока.СуммаРасхода = 0;
					НоваяСтрока.СуммаНДФЛВычет = 0; 
					НоваяСтрока.РаспределяемыеРасходы = 0;  //оставим эту сумму в строке 15%
					
					//исходную строку надо удалить. мы ее разделили на две. 
					МассивУдаляемыхСтрок.Добавить(СтрокаТаблицы);
					РаспределяемаяСумма = 0;      
					
					// т.к. цикл по количеству строк, то по новым строкам цикл уже не будет идти.
				ИначеЕсли СуммаДоход <= РаспределяемаяСумма И РаспределяемаяСумма > 0 Тогда
					РаспределяемаяСумма = РаспределяемаяСумма - СуммаДоход; 
					//ничего не делаем, должно остаться 13%
					//?
				ИначеЕсли РаспределяемаяСумма = 0 И СтрокаТаблицы.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13 Тогда
					СтрокаТаблицы.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15; 
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого СтрокаДляУдаления из МассивУдаляемыхСтрок Цикл 
				ТаблицаНОБ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	//собственно расчет налога.
	ТаблицаНОБ.Сортировать("СтавкаНДФЛ"); 
	
	Если НалоговыеНачисленияПоДокументу = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяЗапись из НалоговыеНачисленияПоДокументу Цикл
		
		РаспределяемыйНалог = ТекущаяЗапись.СуммаНалога;
		СтрокиНОБ = ТаблицаНОБ.НайтиСтроки(Новый Структура("СтавкаНДФЛ", ТекущаяЗапись.СтавкаНДФЛ));
		
		КоличествоСтрок = СтрокиНОБ.Количество();
		Для Индекс = 0 по КоличествоСтрок - 1 Цикл     
			
			Если СтрокиНОБ[Индекс].ВидНалогооблагаемойБазы = Перечисления.ВидыНалогооблагаемыхБаз.ПоДивидендам Тогда 
				// по дивидендам у нас всегда будет только одна строка.  
				// Вычет по дивидендам не показываем в 2 НДФЛ. 
				Ставка = РаботаСНалогамиКлиентСервер.ЧисловоеЗначениеСтавкиНДФЛ(СтрокиНОБ[Индекс].СтавкаНДФЛ);
				НалогИсчисленный  = Окр(СтрокиНОБ[Индекс].СуммаНДФЛДоход * Ставка, 0);   // Налог от полной суммы дивидендов.
				СуммаНалогПолучению = Окр((СтрокиНОБ[Индекс].СуммаНДФЛДоход - СтрокиНОБ[Индекс].СуммаНДФЛВычет) * Ставка, 0);  // налог удержанный. То что мы насчитали с учетом вычета
				СтрокиНОБ[Индекс].СуммаНалога = НалогИсчисленный;
				СтрокиНОБ[Индекс].СуммаУменьшающаяНалог = НалогИсчисленный - СуммаНалогПолучению;    // разница. Отражается в 2-НДФЛ и 6-НДФЛ
			Иначе
				Если Индекс < КоличествоСтрок - 1 Тогда  
					СуммаДоходПоСтроке = СтрокиНОБ[Индекс].СуммаНДФЛДоход - СтрокиНОБ[Индекс].СуммаНДФЛВычет;
					//Если СуммаДоходПоСтроке <= 0 И
					//	СтрокиНОБ[Индекс].Примечание <> "Распределяемые расходы" Тогда 
					//	СтрокиНОБ[Индекс].СуммаНалога = 0;
					//	Продолжить;
					//КонецЕсли;
					СуммаНалогПоСтроке = Окр(СуммаДоходПоСтроке * РаботаСНалогамиКлиентСервер.ЧисловоеЗначениеСтавкиНДФЛ(СтрокиНОБ[Индекс].СтавкаНДФЛ), 0);
					СтрокиНОБ[Индекс].СуммаНалога = СуммаНалогПоСтроке;
					РаспределяемыйНалог = РаспределяемыйНалог - СуммаНалогПоСтроке; 
				Иначе
					СтрокиНОБ[Индекс].СуммаНалога = РаспределяемыйНалог; 
					// налог в последней строке не считаем, чтобы избежать погрешности округления. 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла
	
КонецПроцедуры 

Процедура РаспределитьРасходыНеЦБ(ТаблицаНОБ, ДвиженияНДФЛ = Неопределено, ОсновнаяСтавка, УчитыватьВсеДоходыПриРаспределенииРасходовНеЦБ) Экспорт
	
	// расходы поместим в колонку СуммаУмешьшающаДоход. 
	// сократим количество строк. Визуально будет понятно к какому доходу относится сумма, уменьшающая НОБ. 
	
	// распределение расходов, не связанных с ЦБ.
	Если ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов Тогда
		РаспределятьРасходыНеЦБ = Ложь;
	Иначе
		РаспределятьРасходыНеЦБ = Истина;
	КонецЕсли;   	
	//СтрокаРасходыНеЦБ = ТаблицаНОБ.Найти(Истина, "РаспределятьРасход");  
	СтрокиРасходыНеЦБ = ТаблицаНОБ.НайтиСтроки(Новый Структура("РаспределятьРасход", Истина));  
	
	Если РаспределятьРасходыНеЦБ И СтрокиРасходыНеЦБ.Количество() > 0 Тогда
		
		ДанныеДляРасчета = ТаблицаНОБ.Скопировать(); 
		Если ДвиженияНДФЛ <> Неопределено Тогда 
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ДвиженияНДФЛ, ДанныеДляРасчета);
		КонецЕсли;
		
		//удаляем строки, которые не нужны для распределения расходов.
		// 1) строки со значением РаспределятьРасход
		// 2) неучитывапемые доходы    - 6.11.2025 НЕ УБИРАЕМ! Распределяем расход по всем видам доходов, независимо от того, платим с них налог или нет. 
		// 3) строку с начисленным налогов из таблицы ДвиженияНДФЛ. см. запрос. 
		// 4) "НКД гос. и муницип. обл." и "НКД корп. обл. обращаемых, эмитированных после 01.01.2017". ИИС, старые периоды. По этим доходам налог не платим. Вычет принудительно ставим равным доходу. 
		//     распределять расходы не ЦБ на них не будем, так как налог = 0. 
		
		СуммаРаспределения = 0;
		
		Для индекс = -(ДанныеДляРасчета.Количество() - 1) по 0 Цикл 
			Если ДанныеДляРасчета[-индекс].РаспределятьРасход Тогда 
				СуммаРаспределения = СуммаРаспределения + ДанныеДляРасчета[-индекс].СуммаНДФЛВычет;
			КонецЕсли; 
			Если ДанныеДляРасчета[-индекс].РаспределятьРасход
				ИЛИ (ДанныеДляРасчета[-индекс].ВидНалогооблагаемойБазы = Перечисления.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы И НЕ УчитыватьВсеДоходыПриРаспределенииРасходовНеЦБ)
				ИЛИ НЕ ЗначениеЗаполнено(ДанныеДляРасчета[-индекс].ВидНалогооблагаемойБазы) 
				ИЛИ (ДанныеДляРасчета[-индекс].Примечание = "НКД гос. и муницип. обл." 
					ИЛИ ДанныеДляРасчета[-индекс].Примечание = "НКД корп. обл. обращаемых, эмитированных после 01.01.2017") Тогда 
				ДанныеДляРасчета.Удалить(-индекс);
			КонецЕсли;
		КонецЦикла;

		ДанныеДляРасчета.Свернуть("ВидНалогооблагаемойБазы, ВидДохода, ВидВычета, Примечание", "СуммаДохода, СуммаРасхода, СуммаНДФЛДоход, СуммаНДФЛВычет, РаспределяемыеРасходы"); 
		
		Если ДанныеДляРасчета.Количество() = 0 Тогда
			// дохода в этом году нет. налог не платим. сумму не распределяем  
			// При закрытии ИИС строк со знаечнием РаспределятьРасход может быть несколько. По одной на каждый год расчета. В случае ИИС программа может в эту ветку не попасть. 
			Для Каждого СтрокаНОБ из ТаблицаНОБ Цикл 
				Если СтрокаНОБ.РаспределятьРасход Тогда
					СтрокаНОБ.СуммаНДФЛВычет = 0;  
				КонецЕсли;
			КонецЦикла;
		Иначе
			
			ОбщаяСуммаДохода = ДанныеДляРасчета.Итог("СуммаДохода");
			
			//распределим
			ОсталосьРаспределить = СуммаРаспределения;
			КоличествоЗначений = ДанныеДляРасчета.Количество(); 
			Для индекс = 0 по КоличествоЗначений - 1 Цикл
				ДобавкаРасход = Окр(СуммаРаспределения * ДанныеДляРасчета[индекс].СуммаДохода / ОбщаяСуммаДохода, 2);
				Если индекс <> КоличествоЗначений - 1 Тогда
					ДанныеДляРасчета[индекс].РаспределяемыеРасходы = ДобавкаРасход; 
					ОсталосьРаспределить = ОсталосьРаспределить - ДобавкаРасход;
				Иначе
					ДанныеДляРасчета[индекс].РаспределяемыеРасходы = ОсталосьРаспределить; 
				КонецЕсли;
			КонецЦикла;
			
			//удалим строки с расходамм не ЦБ и добавим новые с распределенными расходами. 
			// в последенем расчете могут быть не все виды доходов, а сумму мы распределили пропорционально годовым доходам
			
			Для Каждого СтрокаРасхода из СтрокиРасходыНеЦБ Цикл 
				ТаблицаНОБ.Удалить(СтрокаРасхода);
			КонецЦикла;   
			
			Для Каждого СтрокаТаблицы из ДанныеДляРасчета Цикл
				НоваяСтрока = ТаблицаНОБ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,,"СуммаДохода, СуммаРасхода, СуммаНДФЛДоход, СуммаНДФЛВычет, РаспределяемыеРасходы");
				НоваяСтрока.Год = Год(ЭтотОбъект.ДатаРасчета);
				НоваяСтрока.Месяц = Месяц(ЭтотОбъект.ДатаРасчета);   
				НоваяСтрока.СуммаДохода = 0;
				НоваяСтрока.СуммаНДФЛДоход = 0;
				НоваяСтрока.СуммаРасхода = 0;
				НоваяСтрока.СуммаНДФЛВычет = СтрокаТаблицы.РаспределяемыеРасходы;  //Распределяемые расходы уменьшают НОБ
				НоваяСтрока.РаспределяемыеРасходы = СтрокаТаблицы.РаспределяемыеРасходы; 
				Если НоваяСтрока.ВидНалогооблагаемойБазы = Перечисления.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы Тогда
					НоваяСтрока.СуммаНДФЛВычет = 0;
					НоваяСтрока.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка0;
				Иначе
					НоваяСтрока.СтавкаНДФЛ = ОсновнаяСтавка;
				КонецЕсли;
			КонецЦикла; 
			
			
			ТаблицаНОБ.Свернуть("ВидНалогооблагаемойБазы, Год, Месяц, ВидДохода, ВидВычета, СтавкаНДФЛ, Примечание", "СуммаДохода, СуммаРасхода, СуммаНДФЛДоход, СуммаНДФЛВычет, РаспределяемыеРасходы, СуммаНалога")
		КонецЕсли;

	ИначеЕсли НЕ РаспределятьРасходыНеЦБ И СтрокиРасходыНеЦБ.Количество() > 0 Тогда
		Для Каждого СтрокаРасхода из СтрокиРасходыНеЦБ Цикл 
			ТаблицаНОБ.Удалить(СтрокаРасхода);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПереносУбытков(ТаблицаНОБ, ДвиженияНДФЛ, ОсновнаяСтавка) 
	
	//Перенос убытков на другие НОБ сделаю потом
	ТаблицаПереносаУбытков = Новый ТаблицаЗначений;
	ТаблицаПереносаУбытков.Колонки.Добавить("ВидНалогооблагаемойБазы");
	ТаблицаПереносаУбытков.Колонки.Добавить("ВидДохода");
	ТаблицаПереносаУбытков.Колонки.Добавить("ВидВычета");
	ТаблицаПереносаУбытков.Колонки.Добавить("СуммаУбытка");   
	
	КолонкиГруппировок = "ВидНалогооблагаемойБазы, ВидДохода, ВидВычета";
	КолонкиИтогов = "СуммаНДФЛДоход, СуммаНДФЛВычет";
	
	ДанныеДляРасчета = ТаблицаНОБ.Скопировать(, КолонкиГруппировок + ", " + КолонкиИтогов);
	ДанныеПрошлыхРасчетов = ДвиженияНДФЛ.Скопировать(, КолонкиГруппировок + ", " + КолонкиИтогов);

	РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ДанныеПрошлыхРасчетов, ДанныеДляРасчета);  
	ДанныеДляРасчета.Свернуть(КолонкиГруппировок, КолонкиИтогов);
	
	Для Каждого СтрокаДанные из ДанныеДляРасчета Цикл
		НОБ = СтрокаДанные.СуммаНДФЛДоход - СтрокаДанные.СуммаНДФЛВычет;
		Если НОБ < 0 Тогда  
			СтруктураПоиска = Новый Структура("ВидНалогооблагаемойБазы, ВидДохода, ВидВычета", СтрокаДанные.ВидНалогооблагаемойБазы, СтрокаДанные.ВидДохода, СтрокаДанные.ВидВычета);
			
			НайденныеСтроки = ТаблицаНОБ.НайтиСтроки(СтруктураПоиска);  //будет 1 строка. 
			Для Каждого СтрокаНОБ Из НайденныеСтроки Цикл 
				
				//Умешьшаем вычет
				СуммаУбытка = СтрокаНОБ.СуммаНДФЛВычет - СтрокаНОБ.СуммаНДФЛДоход;
				СтрокаНОБ.СуммаНДФЛВычет = СтрокаНОБ.СуммаНДФЛДоход;
				
				СтрокаПереноса = ТаблицаПереносаУбытков.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПереноса, СтрокаНОБ);
				СтрокаПереноса.СуммаУбытка = СуммаУбытка;  
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//Перенос убытков на другие НОБ сделаю потом  
	// пока не было подходящей ситуации

	//нераспределенные убытки содержатся в таблице ТаблицаПереносаУбытков 
	
	// у нас только 4 вида доходов.   Доходы по ПФИ пока не учитываем
	
	
	// нет такого случая:
	 // Сумма убытка по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, полученного по результатам указанных операций, 
	 // совершенных в налоговом периоде, уменьшает налоговую базу по операциям с производными финансовыми инструментами, обращающимися на организованном 
	 // рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых 
	 // являются ценные бумаги или фондовые индексы. 
	 
	// обратный случай: нет такого.  
	// Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются 
	// ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, 
	// полученного по результатам указанных операций, совершенных в налоговом периоде, после уменьшения налоговой базы по операциям с производными 
	// финансовыми инструментами, обращающимися на организованном рынке, уменьшает налоговую базу по операциям с ценными бумагами, обращающимися 
	// на организованном рынке ценных бумаг.
	
	//  Убыток по операциям РЕПО принимается в уменьшение доходов по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, 
	// а также с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, в пропорции, рассчитанной как соотношение стоимости ценных бумаг,
	// являющихся объектом операций РЕПО, обращающихся на организованном рынке ценных бумаг, и стоимости ценных бумаг, являющихся объектом операций РЕПО, 
	// не обращающихся на организованном рынке ценных бумаг, в общей стоимости ценных бумаг, являющихся объектом операций РЕПО.
	
	// перенос на другой вид НОБ сделаю, если таковой вдругн появится. 
	
	
КонецПроцедуры

Процедура ВыполнитьРасчетНалоговойБазы(ТаблицаНОБ, ДвиженияНДФЛ, ОсновнаяСтавка, УчитыватьВсеДоходыПриРаспределенииРасходовНеЦБ)  Экспорт
	
	Если НЕ (ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов
		ИЛИ ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику) Тогда
		РаспределитьРасходыНеЦБ(ТаблицаНОБ, ДвиженияНДФЛ, ОсновнаяСтавка, УчитыватьВсеДоходыПриРаспределенииРасходовНеЦБ);
	КонецЕсли;
	
	//перенос убытков на другие коды. 
	ВыполнитьПереносУбытков(ТаблицаНОБ, ДвиженияНДФЛ, ОсновнаяСтавка);
	
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда 
		Если ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда
			//ничего не делаем 
		ИначеЕсли ЭтотОбъект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику Тогда
			// налоги не платим. Просто передаем информацию о полученных доходах 
			// таблицу не сворачиваем. 
		Иначе   //расторжение договора, корректировка, выплата наследнику 
			// налоговую базу посчитаем за весь период действия договора
			ТаблицаНОБ.ЗаполнитьЗначения(Год(ЭтотОбъект.ДатаРасчета), "Год");
			ТаблицаНОБ.ЗаполнитьЗначения(Месяц(ЭтотОбъект.ДатаРасчета), "Месяц"); 
			
			ТаблицаНОБ.Свернуть("ВидНалогооблагаемойБазы, Год, Месяц, ВидДохода, ВидВычета, СтавкаНДФЛ, Примечание", "СуммаДохода, СуммаРасхода, СуммаНДФЛДоход, СуммаНДФЛВычет, СуммаНалога, РаспределяемыеРасходы");
			
		КонецЕсли;
	КонецЕсли;
		
	Если ЭтотОбъект.ОснованиеРасчета <> Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику Тогда 
		СуммаДоходаНаНачалоРасчета = (ДвиженияНДФЛ.Итог("СуммаНДФЛДоход") - ДвиженияНДФЛ.Итог("СуммаНДФЛВычет")); // до текущего расчета  
		ПороговаяСумма = РаботаСНалогамиКлиентСервер.ПорогПримененияСтавкиНДФЛ15Процентов(ЭтотОбъект.ДатаРасчета, ОсновнаяСтавка); 
		СуммаНалогаРанееНачисленного = ДвиженияНДФЛ.Итог("СуммаНалога");
		РасчетСуммыНалога(ТаблицаНОБ, СуммаДоходаНаНачалоРасчета, ПороговаяСумма, СуммаНалогаРанееНачисленного, ОсновнаяСтавка);
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти