
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
		
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("КонецДня", КонецДня(ТекущаяДатаСеанса()));
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Организация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	
	ДоступныПолныеПрава = РольДоступна("ПолныеПрава");
	
	ЭтаФорма.Элементы.СоздатьПоручение.Видимость = (ДоступныПолныеПрава Или РольДоступна("ОперацииБэкОфиса"));
	ЭтаФорма.Элементы.ОтменитьПоручения.Видимость = (ДоступныПолныеПрава Или РольДоступна("ОперацииФронтОфисаУправляющейКомпании"));
			
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ОтменитьПоручениеНаСервере(Знач МассивПоручений)
		
	Для Каждого Поручение Из МассивПоручений Цикл
		
		НачатьТранзакцию();
		
		БлокировкаДанных = Новый БлокировкаДанных();
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств");
		ЭлементБлокировки.УстановитьЗначение("ПоручениеНаПереводДенежныхСредств", Поручение);
		БлокировкаДанных.Заблокировать();
		
		ТекущийСтатус = РаботаСДокументами.ПолучитьТекущийСтатусПорученияНаПереводДенежныхСредств(Поручение);
		
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поручение, "Брокер")) Тогда
			
			Если ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.ОжидаетАкцепта Тогда	
				
				РегистрыСведений.СтатусыПорученийНаПереводДенежныхСредств.УстановитьСтатусПоручения(Поручение, Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Снято);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документу [" + Поручение + "] установлен статус [Снято].");
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Поручение) + " экспортируются через систему QUIK. Необходимо отправить запрос на отмену в QUIKе.");
			КонецЕсли;
			
		Иначе
						
			Если ТекущийСтатус = Неопределено 
				Или ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Отправлено
				Или ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.ГотовКОтправке Тогда
				
				РегистрыСведений.СтатусыПорученийНаПереводДенежныхСредств.УстановитьСтатусПоручения(Поручение, Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Снято);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документу [" + Поручение + "] установлен статус [Снято].");
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено отменять поручения со статусом [" + ТекущийСтатус + "].");	
			КонецЕсли;
			
		КонецЕсли; 
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручение(Команда)
	
	ФормаОбработки = ПолучитьФорму("Документ.ПоручениеНаПереводДенежныхСредств.Форма.ФормаСозданиеПоручений");
	ФормаОбработки.Открыть();
		
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоручение(Команда)
		
	ОтменитьПоручениеНаСервере(ЭтаФорма.Элементы.Список.ВыделенныеСтроки);
	
	Оповестить("ПорученияНаПереводДС.Обновить");	
	ОповеститьОбИзменении(Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств"));
	
КонецПроцедуры