&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КопироватьДанныеФормы(Параметры.Объект, Объект);
	
	Для Каждого СтрокаОрганизации Из Объект.Организации Цикл
		НоваяСтрока = Организации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОрганизации);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПрименить");
	ВыполнитьКомандаПрименить();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаПрименить()
	Объект.Организации.Очистить();
	Для Каждого СтрокаОрганизации Из Организации Цикл
		НоваяСтрока = Объект.Организации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОрганизации);
	КонецЦикла;
	
	Закрыть(Объект);
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(
		РеквизитФормыВЗначение("Объект"), ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
КонецПроцедуры

#КонецОбласти
