#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаСборкиРелиза = ТекущаяДатаСеанса();
	Объект.ИмяСервера = "ap69";
	Объект.ДлительностьОбновления = 30;
	Объект.ШаблонПутиКПапкеРелизов = СтрШаблон("\\%1\InfoBases8\Релизы\", Объект.ИмяСервера);
	ЗаполнитьКаталогРелиза(Объект);
	
	БлокировкаСеансов = ПолучитьБлокировкуСеансов();
	ЭтаФорма.БлокировкаСеансовНачало = ТекущаяДатаСеанса() + 600;
	ЭтаФорма.БлокировкаСеансовКодРазрешения = БлокировкаСеансов.КодРазрешения;
	ЭтаФорма.БлокировкаСеансовУстановлена = БлокировкаСеансов.Установлена;
	ОбновитьПараметрыБлокировкиСеансов(ЭтаФорма);
	ОбновитьЭлементыФормыБлокировкиДанных(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ДлительностьОбновленияПриИзменении(Элемент)
	
	ОбновитьПараметрыБлокировкиСеансов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСборкиРелизаПриИзменении(Элемент)
	ЗаполнитьКаталогРелиза(Объект);
КонецПроцедуры 

&НаКлиенте
Процедура БлокировкаСеансовНачалоПриИзменении(Элемент)
	
	ОбновитьПараметрыБлокировкиСеансов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокировкаСеансовОкончаниеПриИзменении(Элемент)
	
	ОбновитьПараметрыБлокировкиСеансов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаОбработатьОтчетыПоВерсиямХранилищ(Команда)
	
	ОбработатьОтчетыПоВерсиямХранилищНаСервере();
	Элементы.ПанельСтраниц.ТекущаяСтраница = Элементы.СтраницаОписаниеИзменений;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьКонфигурациюОсновногоХранилища(Команда)
	
	ЗапуститьКонфигураторВПакетномРежиме(Истина, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьКонфигурациюХранилищаОбновлений(Команда)
	
	ЗапуститьКонфигураторВПакетномРежиме(Ложь, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьОтчетыПоВерсиямХранилища(Команда)
	
	ЗапуститьКонфигураторВПакетномРежиме(Истина, Ложь, Истина);
	ЗапуститьКонфигураторВПакетномРежиме(Ложь, Ложь, Истина);
	КомандаОбработатьОтчетыПоВерсиямХранилищ(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодготовитьПисьмо(Команда)
	
	Получатели = ПолучитьАдресаАктивныхПользователей();
	Тема = "Обновление 1С";
	Текст = СтрШаблон("Чтобы провести обновление, необходимо закрыть 1С. Это будет сделано автоматически через 10 минут. 
		|Планируется, что обновление займет около %1 минут, после чего в 1С снова можно будет работать. 
		|Если вам потребуется больше времени для завершения текущих операций, сообщите мне.", Объект.ДлительностьОбновления);
	
	Ссылка = СтрШаблон("mailto:%1&body=%2?subject=%3",
		Получатели, 
		СтрЗаменить(Текст, " ", "%20"),
		СтрЗаменить(Тема, " ", "%20"));
	ЗапуститьПриложение(Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьТекущуюДату(Команда)
	
	ЭтаФорма.БлокировкаСеансовНачало = ТекущаяДата();
	ОбновитьПараметрыБлокировкиСеансов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьБлокировкуСеансов(Команда)
	
	ЭтаФорма.БлокировкаСеансовУстановлена = Не ЭтаФорма.БлокировкаСеансовУстановлена;
	
	ПараметрыБлокировки = Новый Структура;
	ПараметрыБлокировки.Вставить("КодРазрешения", ЭтаФорма.БлокировкаСеансовКодРазрешения);
	ПараметрыБлокировки.Вставить("Конец", ЭтаФорма.БлокировкаСеансовОкончание);
	ПараметрыБлокировки.Вставить("Начало", ЭтаФорма.БлокировкаСеансовНачало);
	ПараметрыБлокировки.Вставить("Сообщение", ЭтаФорма.БлокировкаСеансовСообщение);
	ПараметрыБлокировки.Вставить("Установлена", ЭтаФорма.БлокировкаСеансовУстановлена);
	
	КомандаУстановитьБлокировкуСеансовНаСервере(ПараметрыБлокировки);
	ОбновитьЭлементыФормыБлокировкиДанных(ЭтаФорма)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапуститьКонсольАдминистрирования(Команда)
	ЗапуститьПриложение("C:\Program Files (x86)\1cv8\common\1CV8 Servers.msc");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапуститьMSSMS(Команда)
	ЗапуститьПриложение("C:\Program Files (x86)\Microsoft SQL Server Management Studio 18\Common7\IDE\Ssms.exe");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоместитьТекстФормированияБэкапаВБуферОбмена(Команда)
	
	ТекстЗапроса = "BACKUP DATABASE [AssetManagement] TO  [AssetManagement_backup_before_update] WITH  DIFFERENTIAL , 
		|NOFORMAT, INIT,  NAME = N'AssetManagement-Full Database Backup', SKIP, NOREWIND, NOUNLOAD,  STATS = 10
		|GO";
	СредстваБуфераОбмена.ПоместитьДанныеАсинх(Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, ТекстЗапроса));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьОтчет(Команда)
	
	ИмяФайлаОтчета = СтрШаблон("%1Описание_Изменений_%2.xlsx", Объект.ШаблонПутиКПапкеРелизов,  Формат(Объект.ДатаСборкиРелиза, "ДФ=yyyyMMdd"));
	
	Файл = Новый Файл(ИмяФайлаОтчета);
	
	Если Файл.Существует() Тогда
		
		ТекстВопроса = ИмяФайлаОтчета + " уже существует." + Символы.ПС + "Вы хотите заменить его?";
		
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	Попытка
		ЭтаФорма.ОписаниеИзменений.Записать(ИмяФайлаОтчета, ТипФайлаТабличногоДокумента.XLSX);
	Исключение
		Предупреждение(ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке()));
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЖурналРегистрации(Команда)
	
	Форма = ПолучитьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации", , ЭтаФорма, ЭтаФорма);
	
	ИмяПриложения = Новый СписокЗначений;
	ИмяПриложения.Добавить("1CV8C", "Тонкий клиент");
	Форма.ОтборЖурналаРегистрации.Вставить("ИмяПриложения", ИмяПриложения);
	Форма.ОтборЖурналаРегистрации.Вставить("ДатаНачала", ТекущаяДата() - 3600);
		
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьФоновыеЗадания(Команда)
	
	Форма = ПолучитьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентныеИФоновыеЗадания", , ЭтаФорма, ЭтаФорма);
	Форма.Элементы.Задания.ТекущаяСтраница = Форма.Элементы.ФоновыеЗадания;
	Форма.ОтборПоСостояниюЗавершено = Ложь;
	Форма.ОтборПоСостояниюЗавершеноАварийно = Ложь;
	Форма.ОтборПоСостояниюОтменено = Ложь;
	Форма.ОтборПоСостояниюАктивно = Истина;
	Форма.ОтбиратьПоРегламентномуЗаданию = Ложь;
	Форма.ОбновлятьСписокАвтоматически = Истина;
	
	Форма.Открыть();
	
КонецПроцедуры

#КонецОбласти 

#Область Обработка_отчета_по_версиям

&НаСервере
Процедура ОбработатьОтчетыПоВерсиямХранилищНаСервере()
	
	ЭтаФорма.ОписаниеИзменений.Очистить();
	
	ДанныеКоммитов = СериализоватьКоммитыНаСервере(ПараметрыХранилища(Истина, Объект));
	ДанныеКоммитовХранилищаОбновлений = СериализоватьКоммитыНаСервере(ПараметрыХранилища(Ложь, Объект));
	НомераКоммитовДинамическихОбновлений = НомераКоммитовДинамическихОбновлений(ДанныеКоммитовХранилищаОбновлений);
	
	ОтобразитьКоммитыДинамическихОбновленийНаСервере(ДанныеКоммитов, НомераКоммитовДинамическихОбновлений);
	
КонецПроцедуры

&НаСервере
Функция СериализоватьКоммитыНаСервере(ПараметрыХранилища)
	
	ДанныеКоммитов = Новый Массив;
	
	Файл = Новый Файл(ПараметрыХранилища.ИмяФайлаОтчетаПоВерсиям);
	Если Не Файл.Существует() Тогда
		Сообщить("Файл " + ПараметрыХранилища.ИмяФайлаОтчетаПоВерсиям + " с отчетом по версиям хранилища не найден");
		Возврат ДанныеКоммитов;
	ИначеЕсли НРег(Файл.Расширение) <> ".mxl" Тогда
		Сообщить("Указанный файл не является файлом табличного документа 1С");
		Возврат ДанныеКоммитов;
	КонецЕсли;
	
	ИменаПолейКоммита = "Версия, Пользователь, ДатаСоздания, ВремяСоздания, ВерсияКонфигурации, Комментарий, Метка, КомментарийМетки, Добавлены, Изменены, Удалены";
	
	НаборОбщихПолейКоммита = Новый СписокЗначений; // важен порядок, а структура и соответствие его не обеспечивают
	НаборОбщихПолейКоммита.Добавить("Версия",             "Версия:");
	НаборОбщихПолейКоммита.Добавить("Пользователь",       "Пользователь:");
	НаборОбщихПолейКоммита.Добавить("ДатаСоздания",       "Дата создания:");
	НаборОбщихПолейКоммита.Добавить("ВремяСоздания",      "Время создания:");
	НаборОбщихПолейКоммита.Добавить("ВерсияКонфигурации", "Версия конфигурации:");
	НаборОбщихПолейКоммита.Добавить("Комментарий",        "Комментарий:");
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ПараметрыХранилища.ИмяФайлаОтчетаПоВерсиям);
	
	Если ТабличныйДокумент.Область(1, 1).Текст <> "Отчет по версиям хранилища:    " + ПараметрыХранилища.КаталогХранилища Тогда
		Сообщить("Указанный файл не является отчетом по версиям хранилища AssetManagement");
		Возврат ДанныеКоммитов;
	КонецЕсли;
	
	// вдруг понадобятся
	//ДатаОтчета  = ТабличныйДокумент.Область(2, 2).Текст;
	//ВремяОтчета = ТабличныйДокумент.Область(3, 2).Текст;
	
	ДанныеКоммита = Неопределено;
	ТекПолеКоммита = "";
	
	НомСтрОтчета = 5;
	Пока НомСтрОтчета <= ТабличныйДокумент.ВысотаТаблицы Цикл
		
		ТекИмяПоляОтчета = ТабличныйДокумент.Область(НомСтрОтчета, 1).Текст;
		ТекЗнчПоляОтчета = ТабличныйДокумент.Область(НомСтрОтчета, 2).Текст;
		
		Если ПустаяСтрока(ТекИмяПоляОтчета) И ПустаяСтрока(ТекЗнчПоляОтчета) Тогда
			НомСтрОтчета = НомСтрОтчета + 1;
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекИмяПоляОтчета) Тогда // многострочное значение поля
			
			ДанныеКоммита[ТекПолеКоммита] = ДанныеКоммита[ТекПолеКоммита] + Символы.ПС + ТекЗнчПоляОтчета;
			
			НомСтрОтчета = НомСтрОтчета + 1;
			
		ИначеЕсли ТекИмяПоляОтчета = НаборОбщихПолейКоммита[0].Представление Тогда // начало нового блока
			
			Если ЗначениеЗаполнено(ДанныеКоммита) Тогда
				ДанныеКоммитов.Добавить(ДанныеКоммита);
			КонецЕсли;
			
			ДанныеКоммита = Новый Структура(ИменаПолейКоммита);
			
			Для Инд = 0 По НаборОбщихПолейКоммита.Количество() - 1 Цикл
				Если ТабличныйДокумент.Область(НомСтрОтчета + Инд, 1).Текст = НаборОбщихПолейКоммита[Инд].Представление Тогда
					ДанныеКоммита[НаборОбщихПолейКоммита[Инд].Значение] = ТабличныйДокумент.Область(НомСтрОтчета + Инд, 2).Текст;
				Иначе
					Сообщить("Обработка поля """ + ТабличныйДокумент.Область(НомСтрОтчета + Инд, 1).Текст + """ в строке " + (НомСтрОтчета + Инд) + " не поддерживается!");
				КонецЕсли;
			КонецЦикла;
			
			ТекПолеКоммита = "";
			НомСтрОтчета   = НомСтрОтчета + НаборОбщихПолейКоммита.Количество();
			
		ИначеЕсли ТекИмяПоляОтчета = "Метка:" И ТабличныйДокумент.Область(НомСтрОтчета + 1, 1).Текст = "Комментарий метки:" Тогда
			
			//  данные поля появляются только, если заполнена метка
            ДанныеКоммита.Метка            = ТекЗнчПоляОтчета;
			ДанныеКоммита.КомментарийМетки = ТабличныйДокумент.Область(НомСтрОтчета + 1, 2).Текст;
			
			ТекПолеКоммита = "";
			НомСтрОтчета   = НомСтрОтчета + 2;
			
		ИначеЕсли ТекИмяПоляОтчета = "Добавлены:" Или ТекИмяПоляОтчета = "Изменены:" Или ТекИмяПоляОтчета = "Удалены:" Тогда
			
			// отрежем ":" в конце имени поля
			ТекПолеКоммита = Сред(ТекИмяПоляОтчета, 1, СтрДлина(ТекИмяПоляОтчета) - 1);
			
			ДанныеКоммита.Вставить(ТекПолеКоммита, ТекЗнчПоляОтчета);
			
			НомСтрОтчета = НомСтрОтчета + 1;
			
		Иначе
			
			Сообщить("Обработка поля """ + ТекИмяПоляОтчета + """ в строке " + НомСтрОтчета + " не поддерживается!");
			
			ТекПолеКоммита = "";
			НомСтрОтчета   = НомСтрОтчета + 1;			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеКоммита) Тогда
		ДанныеКоммитов.Добавить(ДанныеКоммита);
	КонецЕсли;
	
	Возврат ДанныеКоммитов;
	
КонецФункции

&НаСервере
Процедура ОтобразитьКоммитыДинамическихОбновленийНаСервере(ДанныеКоммитов, НомераКоммитовДинамическихОбновлений)

	Если ДанныеКоммитов.Количество() = 0 Тогда
		Элементы.СтраницаОписаниеИзменений.Заголовок = "Описание изменений (0)";
		Возврат;
	КонецЕсли;

	ПредставленияПользователей = Новый Соответствие;
	ПредставленияПользователей.Вставить("Кривоносов", "Сережа К");
	ПредставленияПользователей.Вставить("Балагуров",  "Коля Б");
	ПредставленияПользователей.Вставить("Чесняк",     "Витя Ч");
	ПредставленияПользователей.Вставить("Батраков",   "Саша Б");
	ПредставленияПользователей.Вставить("Тополь",     "Андрей Т");
	ПредставленияПользователей.Вставить("Щелкунов",   "Слава Щ");
	ПредставленияПользователей.Вставить("Власов",     "Гриша В");
	ПредставленияПользователей.Вставить("Токмаков",   "Тема Т");
	ПредставленияПользователей.Вставить("Пустовит",   "Дима П");
	ПредставленияПользователей.Вставить("Поломошнов", "Максим П");
	ПредставленияПользователей.Вставить("Тарасов", 	  "Дима Т");
	
	КоличествоСтрокОтчета = 0;
	
	МакетРелиза = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Релиз");
	ШапкаОтчетаРелиза = МакетРелиза.ПолучитьОбласть("ШапкаОтчета");
	СтрокаОтчетаРелиза = МакетРелиза.ПолучитьОбласть("СтрокаОтчета");
	
	ДанныеОтчета = Новый ТаблицаЗначений;
	ДанныеОтчета.Колонки.Добавить("Раздел", Новый ОписаниеТипов("Число"));
	ДанныеОтчета.Колонки.Добавить("Метаданные", Новый ОписаниеТипов("Строка"));
	ДанныеОтчета.Колонки.Добавить("КраткоеОписание", Новый ОписаниеТипов("Строка"));
	ДанныеОтчета.Колонки.Добавить("Автор", Новый ОписаниеТипов("Строка"));
	ДанныеОтчета.Колонки.Добавить("Сигнатура", Новый ОписаниеТипов("Строка"));
	ДанныеОтчета.Колонки.Добавить("Примечание", Новый ОписаниеТипов("Строка"));
	
	МеткаТекущегоРелиза = Формат(Объект.ДатаСборкиРелиза, "ДФ=yyyy-MM-dd");
	
	Для каждого ДанныеКоммита Из ДанныеКоммитов Цикл
				
		ДатаКоммита = Дата(ДанныеКоммита.ДатаСоздания + " 00:00:00");
		Если ДатаКоммита > Объект.ДатаСборкиРелиза Тогда
			Продолжить;
		КонецЕсли;
		
		Примечание = "";
		Сигнатура = "";
		
		Если ЗначениеЗаполнено(ДанныеКоммита.Метка) Тогда
			
			МеткаБезПробелов = СтрЗаменить(СтрЗаменить(ДанныеКоммита.Метка, Символ(160), ""), Символ(32), "");
			
			Если ДанныеКоммита.Метка = МеткаТекущегоРелиза Тогда
				
				Раздел = 2;	
				
			ИначеЕсли НомераКоммитовДинамическихОбновлений.Найти(МеткаБезПробелов) <> Неопределено Тогда
				
				Раздел = 1;
				Сигнатура = "++";
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
									
		Иначе
			
			Раздел = 3;
			Сигнатура = "--";
			
		КонецЕсли;
		
		ИзмененныеМетаданные = "";
		
		Если ПустаяСтрока(ДанныеКоммита.Добавлены) И ПустаяСтрока(ДанныеКоммита.Удалены) Тогда
			
			ИзмененныеМетаданные = ДанныеКоммита.Изменены;
			
		Иначе
			
			Если Не ПустаяСтрока(ДанныеКоммита.Добавлены) Тогда
				ИзмененныеМетаданные = "Добавлены: " + Символы.ПС + ДанныеКоммита.Добавлены;
			КонецЕсли;
			
			Если Не ПустаяСтрока(ДанныеКоммита.Удалены) Тогда
				ИзмененныеМетаданные = ИзмененныеМетаданные
					+ ?(ПустаяСтрока(ИзмененныеМетаданные), "", Символы.ПС + Символы.ПС)
					+ "Удалены: " + Символы.ПС + ДанныеКоммита.Удалены;
			КонецЕсли;
			
			Если Не ПустаяСтрока(ДанныеКоммита.Изменены) Тогда
				ИзмененныеМетаданные = ИзмененныеМетаданные
					+ ?(ПустаяСтрока(ИзмененныеМетаданные), "", Символы.ПС + Символы.ПС)
					+ "Изменены: " + Символы.ПС + ДанныеКоммита.Изменены;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаОтчета = ДанныеОтчета.Добавить();
		
		СтрокаОтчета.Раздел          = Раздел;
		СтрокаОтчета.Метаданные      = ИзмененныеМетаданные;
		СтрокаОтчета.КраткоеОписание = ДанныеКоммита.Комментарий;
		СтрокаОтчета.Автор           = ПредставленияПользователей[ДанныеКоммита.Пользователь];
		СтрокаОтчета.Сигнатура       = Сигнатура;
		СтрокаОтчета.Примечание      = Примечание;
	
		КоличествоСтрокОтчета = КоличествоСтрокОтчета + 1;
			
	КонецЦикла;
	
	ЭтаФорма.ОписаниеИзменений.Вывести(ШапкаОтчетаРелиза);
	
	ДанныеОтчета.Сортировать("Раздел");
	ТекРаздел = 1;
	
	Для каждого СтрокаОтчета Из ДанныеОтчета Цикл

		Если ТекРаздел <> СтрокаОтчета.Раздел Тогда
			ТекРаздел = СтрокаОтчета.Раздел;
			ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		Иначе
			ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		КонецЕсли;
		
		СтрокаОтчетаРелиза.Параметры.Заполнить(СтрокаОтчета);
		СтрокаОтчетаРелиза.Область(1, 1, 1, 5).ГраницаСверху = ГраницаСверху;
		ЭтаФорма.ОписаниеИзменений.Вывести(СтрокаОтчетаРелиза);
	
	КонецЦикла;
	
	Элементы.СтраницаОписаниеИзменений.Заголовок = "Описание изменений (" + КоличествоСтрокОтчета + ")";
	
КонецПроцедуры 

&НаСервере
Функция НомераКоммитовДинамическихОбновлений(ДанныеКоммитовХранилищаОбновлений)
	
	НомераКоммитовДинамическихОбновлений = Новый Массив;
	
	Для Индекс = -ДанныеКоммитовХранилищаОбновлений.ВГраница() По 0 Цикл
		
		ДанныеКоммита = ДанныеКоммитовХранилищаОбновлений[-Индекс];
		
		Если СтрНайти(НРег(ДанныеКоммита.Метка), "релиз") > 0 Или СтрНайти(НРег(ДанныеКоммита.Комментарий), "релиз") > 0 Тогда
		
			ДатаРелиза = Дата(ДанныеКоммита.ДатаСоздания + " 00:00:00");
			Если ДатаРелиза < Объект.ДатаСборкиРелиза Тогда
			
				Прервать;
			
			КонецЕсли;
			
		Иначе
			
			ВерсияБезПробелов = СтрЗаменить(СтрЗаменить(ДанныеКоммита.Версия, Символ(160), ""), Символ(32), "");
			НомераКоммитовДинамическихОбновлений.Добавить(ВерсияБезПробелов);
			
		КонецЕсли;
	
	КонецЦикла;  
	
	Возврат НомераКоммитовДинамическихОбновлений;
	
КонецФункции

#КонецОбласти 

#Область Работа_с_хранилищем

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыХранилища(ОсновноеХранилище, Объект)

	ПараметрыХранилища = Новый Структура;
	
	КаталогХранилища = "tcp://" + Объект.ИмяСервера + "/";
	
	Если ОсновноеХранилище Тогда
		ИмяХранилища = "AssetManagement";
		ИмяФайлаКонфигурации = "Хранилище";
		ИмяФайлаОтчета = "основного хранилища";
	Иначе
		ИмяХранилища = "Updates";
		ИмяФайлаКонфигурации = "Релиз";
		ИмяФайлаОтчета = "хранилища обновлений";
	КонецЕсли;
	
	ПараметрыХранилища.Вставить("КаталогХранилища", КаталогХранилища + ИмяХранилища);
	
	ПараметрыХранилища.Вставить("ИмяФайлаКонфигурацииХранилища", СтрШаблон(
			"%(1)1Cv8_%2_%3.cf",
			Объект.КаталогРелиза,
			Формат(Объект.ДатаСборкиРелиза, "ДФ=yyyyMMdd"),
			ИмяФайлаКонфигурации));
			
	ПараметрыХранилища.Вставить("ИмяФайлаОтчетаПоВерсиям", СтрШаблон(
			"%1Отчет по версиям %2.mxl",
			Объект.КаталогРелиза,
			ИмяФайлаОтчета));
			
	Возврат ПараметрыХранилища;

КонецФункции
		
&НаКлиенте
Процедура ЗапуститьКонфигураторВПакетномРежиме(ОсновноеХранилище, ВыгрузитьКонфигурацию = Ложь, ВыгрузитьОтчет = Ложь)
	
	Если Не (ВыгрузитьКонфигурацию Или ВыгрузитьОтчет) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСоздатьКаталогРелиза();
		
	#Область Параметры_доступа_к_хранилищу
	
	ПараметрыХранилища = ПараметрыХранилища(ОсновноеХранилище, Объект);
	ИмяПользователя = ПолучитьФИОПользователя().Фамилия;
	СтрокаКоманды = КаталогПрограммы() + "1cv8.exe DESIGNER /S " + Объект.ИмяСервера + "\RedPillTest"
		+ " /ConfigurationRepositoryF " + ПараметрыХранилища.КаталогХранилища + " /ConfigurationRepositoryN " + ИмяПользователя;		
	#КонецОбласти
		
	Если ВыгрузитьКонфигурацию Тогда
		СтрокаКоманды = СтрокаКоманды + " /ConfigurationRepositoryDumpCfg " + """" + ПараметрыХранилища.ИмяФайлаКонфигурацииХранилища + """";
	КонецЕсли;
	
	Если ВыгрузитьОтчет Тогда
		НачалоПериода = Формат(ДобавитьМесяц(Объект.ДатаСборкиРелиза, -1), "ДФ=yyyyMMdd") + "000000";
		СтрокаКоманды = СтрокаКоманды + " /ConfigurationRepositoryReport " + """" + ПараметрыХранилища.ИмяФайлаОтчетаПоВерсиям + """ -DateBegin " + НачалоПериода;
	КонецЕсли;		
	
	ЗапуститьПриложение(СтрокаКоманды, , Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоздатьКаталогРелиза()

	Каталог = Новый Файл(Объект.КаталогРелиза);
	Если Не Каталог.Существует() Тогда
		СоздатьКаталог(Объект.КаталогРелиза);
	КонецЕсли

КонецПроцедуры

#КонецОбласти    

#Область Служебные_процедуры_и_функции

&НаСервереБезКонтекста
Функция ПолучитьФИОПользователя()

	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ИмяПользователяМассив = СтрРазделить(ТекущийПользователь.ПолноеИмя, " ", Ложь);
	
	ФИО = Новый Структура("Фамилия, Имя", 
		ИмяПользователяМассив[0],
		ИмяПользователяМассив[1]);
	
	Возврат ФИО;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКаталогРелиза(Объект)

	Объект.КаталогРелиза = СтрШаблон("%1%2\", Объект.ШаблонПутиКПапкеРелизов, Формат(Объект.ДатаСборкиРелиза, "ДФ=yyyy-MM-dd"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресаАктивныхПользователей()
	
	Сеансы = ПолучитьСеансыИнформационнойБазы();

	Пользователи = Новый Массив;

	Для Каждого Сеанс Из Сеансы Цикл

		Если Пользователи.Найти(Сеанс.Пользователь.УникальныйИдентификатор) = Неопределено Тогда
			Пользователи.Добавить(Сеанс.Пользователь.УникальныйИдентификатор);
		КонецЕсли;

	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Пользователи.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ В(&Пользователи)";
	Запрос.УстановитьПараметр("Пользователи", Пользователи);
	Результат = Запрос.Выполнить();
	
	Возврат СтрСоединить(Результат.Выгрузить().ВыгрузитьКолонку(0), ";");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПараметрыБлокировкиСеансов(ЭтаФорма)

	Длительность = ЭтаФорма.Объект.ДлительностьОбновления;
	
	ЭтаФорма.БлокировкаСеансовОкончание = ЭтаФорма.БлокировкаСеансовНачало + Длительность * 60;
	
	ТекстСообщения = СтрШаблон("Выполняются технические работы. Ожидаемое время завершения %1. В случае вопросов можно обратиться к %2",
		Формат(ЭтаФорма.БлокировкаСеансовОкончание, "ДФ=ЧЧ:мм"),
		КтоОбновляет());
	
	ЭтаФорма.БлокировкаСеансовСообщение = ТекстСообщения;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КтоОбновляет() 

	ФИО = ПолучитьФИОПользователя();
	Возврат ПолучитьСклоненияСтроки(ФИО.Имя + " " + ФИО.Фамилия, , "ПД=Дательный")[0];

КонецФункции

&НаСервере
Процедура КомандаУстановитьБлокировкуСеансовНаСервере(ПараметрыБлокировки)
	
	БлокировкаСеансов = ПолучитьБлокировкуСеансов();
	ЗаполнитьЗначенияСвойств(БлокировкаСеансов, ПараметрыБлокировки);
	УстановитьБлокировкуСеансов(БлокировкаСеансов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыФормыБлокировкиДанных(ЭтаФорма)

	Если ЭтаФорма.БлокировкаСеансовУстановлена Тогда
	    ЗаголовокКнопки = "Отключить";
		ЗаголовокГруппы = "(включена)";
	Иначе
		ЗаголовокКнопки = "Включить";
		ЗаголовокГруппы = "(отключена)";
	КонецЕсли;
	
	ЭтаФорма.Элементы.КомандаУстановитьБлокировкуСеансов.Заголовок = ЗаголовокКнопки + " блокировку сеансов";
	ЭтаФорма.Элементы.БлокировкаСеансов.Заголовок = "Блокировка сеансов " + ЗаголовокГруппы;

КонецПроцедуры

#КонецОбласти 



