
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа
			И Не ЭтотОбъект.ОтложенноеИсполнение
			И ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок
	Тогда
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		Если Не ЭтотОбъект.ОтложенноеИсполнение И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
			ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЭтотОбъект.Рынок);
			
			ЭлементБлокировкиДанных.ИсточникДанных = ЭтотОбъект.ЦенныеБумаги;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ДепозитарныйСчет", "ДепозитарныйСчет");
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ЦеннаяБумага",     "ЦеннаяБумага");
		КонецЕсли;
		
		БлокировкаДанных.Заблокировать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоОперациямСЦеннымиБумагами()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Ссылка КАК Операция,
		|	ВЫБОР
		|		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	Сделка.Организация,
		|	Сделка.СчетДоверительногоУправления,
		|	Сделка.Рынок,
		|	Сделка.ВалютаСделки КАК Валюта,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаПоставки
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаПоставкиПлановая,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаОплаты
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаОплатыПлановая,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ Сделка.Дата
		|	КОНЕЦ КАК ДатаОплаты,
		|	СделкаЦенныеБумаги.Количество,
		|	СделкаЦенныеБумаги.Цена,
		|	СделкаЦенныеБумаги.ЦенаПроцент,
		|	СделкаЦенныеБумаги.ЦенаКупона,
		|	СделкаЦенныеБумаги.Сумма,
		|	СделкаЦенныеБумаги.СуммаКупона,
		|	Сделка.Дата КАК ДатаОперации
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка
		|ГДЕ
		|	Сделка.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СделкаЦенныеБумаги.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОперацииСЦеннымиБумагами.Добавить(), Выборка);
	КонецЦикла;
		
КонецПроцедуры // СформироватьДвиженияПоОперациямСЦеннымиБумагами


Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	ЭтоРынокФьючерсов = (ЭтотОбъект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы"));
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиЦенныхБумаг.Записывать               	= Истина;
	Движения.ОстаткиДенежныхСредств.Записывать           	= Истина;
	Движения.ЗадолженностиПоЦеннымБумагам.Записывать     	= Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать 	= Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать         	= Истина;
	Движения.УсловияСделок.Записывать                    	= Истина;
	Движения.РасходыПоСделке.Записывать						= Истина;
	Движения.РаспределенияАктивовЕПС.Записывать				= Истина;
	Движения.РезервыПИФ.Записывать					        = Истина;
	
	Если ЭтотОбъект.ОтложенноеИсполнение Тогда
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ТипЗадолженностиПоЦБ = Перечисления.ТипыЗадолженности.Дебиторская;
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ТипЗадолженностиПоЦБ = Перечисления.ТипыЗадолженности.Кредиторская;
		КонецЕсли;
		
		// задолженность по ц/б
		Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
			Движение = Движения.ЗадолженностиПоЦеннымБумагам.ДобавитьПриход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Основание                    = ЭтотОбъект.Ссылка;
			Движение.ТипЗадолженности             = ТипЗадолженностиПоЦБ;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоСделке;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.Валюта                       = ЭтотОбъект.ВалютаСделки;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
			Движение.Сумма                        = СтрокаЦенныеБумаги.Сумма;
			Движение.СуммаКупона                  = СтрокаЦенныеБумаги.СуммаКупона;
		КонецЦикла;
		
		Если НЕ ЭтоРынокФьючерсов Тогда
			РегистрыНакопления.ЗадолженностиПоДенежнымСредствам.СформироватьСводныеДвиженияПоСделке(ЭтотОбъект, Справочники.ВидыЗадолженности.ПоСделке);
		КонецЕсли;
		
	Иначе
		// остатки ц/б
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ВидДвиженияЦБ = ВидДвиженияНакопления.Приход;
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ВидДвиженияЦБ = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		
		Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
			Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
			Движение.ВидДвижения                  = ВидДвиженияЦБ;
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
		КонецЦикла;
		
		Если НЕ ЭтоРынокФьючерсов Тогда
			РегистрыНакопления.ОстаткиДенежныхСредств.СформироватьСводныеДвиженияПоСделке(ЭтотОбъект, Справочники.ВидыЗадолженности.ПоСделке);
		КонецЕсли;
		
	КонецЕсли;
	
	//Расходы по сделке
	Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
		Если СтрокаЦенныеБумаги.ТорговаяКомиссия > 0 Тогда
			Движение = Движения.РасходыПоСделке.Добавить();
			Движение.Период							= ЭтотОбъект.Дата;
			Движение.Организация					= ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Сделка							= ЭтотОбъект.Ссылка;
			Движение.Рынок							= ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага					= СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.ВидЗадолженности				= Справочники.ВидыЗадолженности.ПоТорговойКомиссии;
			Движение.Валюта							= ЭтотОбъект.ВалютаТорговойКомиссии;
			Движение.Сумма							= СтрокаЦенныеБумаги.ТорговаяКомиссия;
		КонецЕсли;
	КонецЦикла;
	
	//Считаем что торговая комиссия у ПИФ проходит по прочим резервам
	ПрочиеРезервыПИФНачисляетсяВУчете = БухгалтерскийУчет.РезервПИФНачисляетсяВУчете(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.Резервы.ПрочиеВозмещаемыеРасходыУправляющего);
	Если ПрочиеРезервыПИФНачисляетсяВУчете и ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия")>0 Тогда 

		АналитикаТорговойКомисии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
			Дата, 
			Организация, 
			СчетДоверительногоУправления,
			Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
			Перечисления.ВидыУчета.БухгалтерскийУчет,
			"Аналитика");
			
		Если ЗначениеЗаполнено(АналитикаТорговойКомисии) Тогда
				
			РезервПоРасходу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АналитикаТорговойКомисии, "Резерв");
			Если ЗначениеЗаполнено(РезервПоРасходу) Тогда
				
				Движение = Движения.РезервыПИФ.ДобавитьРасход();
				Движение.Период                       = ЭтотОбъект.Дата;
				Движение.Организация                  = ЭтотОбъект.Организация;
				Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
				Движение.Резерв                       = РезервПоРасходу;
				
				ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета");
				Если ЭтотОбъект.ВалютаТорговойКомиссии <> ВалютаУчета Тогда 
					СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия"), ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
					Движение.Валюта = ВалютаУчета;
				Иначе
				    СуммаОперации = ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия");
					Движение.Валюта = ЭтотОбъект.ВалютаТорговойКомиссии;
				КонецЕсли;
				
				Движение.Сумма  = СуммаОперации;
				
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана аналитика  торговой комиссии по бухучету! Списание резервов невозможно!",ЭтотОбъект.Ссылка,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСРегистрамиНакопления.СформироватьСводныеДвиженияПоТорговойКомиссииВСделке(ЭтотОбъект);
	
	РегистрыСведений.УсловияСделок.СформироватьДвижения(ЭтотОбъект);
	РегистрыСведений.ПлановыеДатыОплат.СформироватьДвижения(ЭтотОбъект);
	
	СформироватьДвиженияПоОперациямСЦеннымиБумагами();

	
	// #654954 - согласно письму Будущего, с 13.08.2025 все ОФЗ, который покупают в эти портфели всегда по СС:

	//АО МНПФ БОЛЬШОЙ ПР 180225-1				СчетДУ_Большой_ПР_180225-1
	//НПФ БУДУЩЕЕ АО ПР 180225-2			    СчетДУ_БУДУЩЕЕ_ПР_180225-2
	//НПФ Достойное БУДУЩЕЕ  АО ПР 180225-3     СчетДУ_ДостойноеБудущее_ПР_180225-3
	//НПФ ОПФ ПР 180225-4                       СчетДУ_ОПФ_ПР_180225-4
	//НПФ Телеком-Союз АО ПР 180225-5           СчетДУ_Телеком-Союз_ПР_180225-5
	//НПФ Эволюция ПР 180225-7                  СчетДУ_Эволюция_ПР_180225-7
	//ПЕРСПЕКТИВА НПФ АО ПР 180225-6            СчетДУ_Перспектива_ПР_180225-6
	//НПФ ФЕДЕРАЦИЯ АО ПР	                    СчетДУ_Федерация_ПР
	МассивСчетовДУВсегдаССПоОФЗ = Новый Массив();
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Большой_ПР_180225-1"));
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_БУДУЩЕЕ_ПР_180225-2"));
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ДостойноеБудущее_ПР_180225-3"));
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ОПФ_ПР_180225-4"));
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Телеком-Союз_ПР_180225-5"));
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Эволюция_ПР_180225-7"));
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Перспектива_ПР_180225-6"));
	МассивСчетовДУВсегдаССПоОФЗ.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Федерация_ПР"));
	
	ВсегдаССПоОФЗ = (ЭтотОбъект.Дата >= '20250813' И МассивСчетовДУВсегдаССПоОФЗ.Найти(СчетДоверительногоУправления) <> Неопределено);
	
	
	// #451103 - Нужно автоматизировать отнесение ценных бумаг в категорию "долговые ценные бумаги удерживаемые до погашения"
	// хардкод для дефолтового распределения по активам ЕПС
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
		И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка
		И НЕ ВсегдаССПоОФЗ
		И БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата) Тогда
		
		КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата);
		
		Если КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция") 	// Эволюция всегда на МСФО9
			ИЛИ ЭтотОбъект.Дата > '20250101' Тогда																// Остальные с 1.1.25
			
			УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияРФ; // МСФО9 - счет 504
			
		Иначе
			
			УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДРФ; // МСФО39 - счет 503
			
		КонецЕсли;
		
		ПроверяемГосы = Ложь;
		ПроверятьГодДоПогашения = Ложь;
		
		Если ЭтотОбъект.Дата > '20221010' И ЭтотОбъект.Дата < '20230101' Тогда //#451103
		
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20231231';
			
		ИначеЕсли (ЭтотОбъект.Дата > '20230117' И ЭтотОбъект.Дата < '20230401') Тогда //#466454 
				
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20240331';
				
		ИначеЕсли (ЭтотОбъект.Дата > '20230401' И ЭтотОбъект.Дата < '20230701') Тогда //#476382 
				
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20240331';
				
		//ИначеЕсли (ЭтотОбъект.Дата > '20230703' И ЭтотОбъект.Дата < '20240101') Тогда //#491176 
		ИначеЕсли (ЭтотОбъект.Дата > '20230703' И ЭтотОбъект.Дата < '20231101') Тогда //#509350 отключили это письмо с 1.11.23
				
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20240630';
				
		ИначеЕсли (ЭтотОбъект.Дата > '20231101' И ЭтотОбъект.Дата < '20240701') Тогда //#509350 
				
			ПроверяемГосы = Истина;
			ПроверятьГодДоПогашения = Истина;
			НачалоПериодаДоПогашения = '20241231';
				
		ИначеЕсли (ЭтотОбъект.Дата > '20240701' И ЭтотОбъект.Дата < '20250101') Тогда //#543197 
				
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20241231';
				
		ИначеЕсли (ЭтотОбъект.Дата > '20250101' И ЭтотОбъект.Дата < '20250701') Тогда //#578885 
				
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20251231';
			
		ИначеЕсли (ЭтотОбъект.Дата >= '20250701' И ЭтотОбъект.Дата < '20260101') Тогда //#630671 
				
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20251231';
			
		ИначеЕсли (ЭтотОбъект.Дата >= '20260101' И ЭтотОбъект.Дата < '20260701') Тогда //#701709 
				
			ПроверяемГосы = Истина;
			НачалоПериодаДоПогашения = '20261231';
				
		КонецЕсли; 
		
		Если ПроверяемГосы Тогда

			ВСекундах365Дней = 365 * 24 * 60 * 60;
			
			Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
				
				Если ПроверяемГосы Тогда
				
					РеквизитыЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаЦенныеБумаги.ЦеннаяБумага, "Категория,Тип,ДатаПогашения");
					
					ЭтоГосЦБ = (РеквизитыЦБ.Категория = Перечисления.КатегорииОблигаций.Государственная);
					ЭтоФиксСтавка = (РеквизитыЦБ.Тип = Перечисления.ТипыОблигаций.КупоннаяПД);
					
					ДатаПогашенияПодходит = (РеквизитыЦБ.ДатаПогашения > НачалоПериодаДоПогашения);
					
					//#509350 допусловие по ИЛИ: до погашения более 365 дней
					ДоПогашенияБольшеГода = (РеквизитыЦБ.ДатаПогашения - НачалоДня(ЭтотОбъект.Дата) > ВСекундах365Дней);
					ДатаПогашенияПодходит = ДатаПогашенияПодходит Или (ПроверятьГодДоПогашения И ДоПогашенияБольшеГода); 
					
					Распределяем = ЭтоГосЦБ И ЭтоФиксСтавка И ДатаПогашенияПодходит;
					
				КонецЕсли;
				
				Если Распределяем Тогда
					
					Движение = Движения.РаспределенияАктивовЕПС.Добавить();
					Движение.Организация     = ЭтотОбъект.Организация;
					Движение.Сделка          = ЭтотОбъект.Ссылка;
					Движение.Рынок           = ЭтотОбъект.Рынок;
					Движение.ЦеннаяБумага    = СтрокаЦенныеБумаги.ЦеннаяБумага;
					Движение.УчетныйАктивЕПС = УчетныйАктивЕПС;
					Движение.Количество      = СтрокаЦенныеБумаги.Количество;
					
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли; 
		
	КонецЕсли;
	
	// #699671 Будущее и Эволюция. Бумаги корпоративные, не ОФЗ, поэтому список из ВсегдаССПоОФЗ по ним не проверяем, и выносим это в отдельную ветку.
	// Нужно автоматизировать отнесение ценных бумаг в категорию "долговые ценные бумаги удерживаемые до погашения"
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
		И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка
		И БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата) Тогда
		
		ПроверяемВЭБ = (ЭтотОбъект.Дата > '20250402'); //#595425 
		ПроверяемПСБ = (ЭтотОбъект.Дата > '20250417'); //#597427 
		ПроверяемРЖД = (ЭтотОбъект.Дата > '20251119'); //#699671 
		// #699671 - с 19.11.2025:
		// РЖД ОАО, 4-30-65045-D, 1000.00 RUB
		// РЖД ОАО, 4B02-36-65045-D-001P, 1000.00 RUB
		// РЖД ОАО, 4B02-37-65045-D-001P, 1000.00 RUB
		
		Облигация_ВЭБ_РФ_002 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_002");
		Облигация_ПРОМСВЯЗЬБАНК_ПАО_013 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПРОМСВЯЗЬБАНК_ПАО_013");
		
		Для Каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
			
			ЭтоВЭБ = ПроверяемВЭБ И (СтрокаЦенныеБумаги.ЦеннаяБумага = Облигация_ВЭБ_РФ_002);
			ЭтоПСБ = ПроверяемПСБ И (СтрокаЦенныеБумаги.ЦеннаяБумага = Облигация_ПРОМСВЯЗЬБАНК_ПАО_013);
			ЭтоРЖД = ПроверяемРЖД И (СтрокаЦенныеБумаги.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЖД_30") 
				Или СтрокаЦенныеБумаги.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЖД_1Р-36R") 
				Или СтрокаЦенныеБумаги.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЖД_1Р-37R"));
			
			Если ЭтоВЭБ Или ЭтоПСБ Тогда
			
				Распределяем = Истина;
				УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияКредитныхОрганизаций;
				
			ИначеЕсли ЭтоРЖД Тогда 
				
				Распределяем = Истина;
				УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияПрочихРезидентов;
				
			КонецЕсли;
			
			Если Распределяем Тогда
				
				Движение = Движения.РаспределенияАктивовЕПС.Добавить();
				Движение.Организация     = ЭтотОбъект.Организация;
				Движение.Сделка          = ЭтотОбъект.Ссылка;
				Движение.Рынок           = ЭтотОбъект.Рынок;
				Движение.ЦеннаяБумага    = СтрокаЦенныеБумаги.ЦеннаяБумага;
				Движение.УчетныйАктивЕПС = УчетныйАктивЕПС;
				Движение.Количество      = СтрокаЦенныеБумаги.Количество;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// #538030 - Нужно автоматизировать отнесение ценных бумаг в категорию "долговые ценные бумаги удерживаемые до погашения"
	// хардкод для дефолтового распределения по активам ЕПС
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
		И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка
		И НЕ ВсегдаССПоОФЗ 
		И Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата) = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФХантыМансийский") Тогда
		
		МассивБумагВыпусковДоПогашения = Новый Массив();
		Если ЭтотОбъект.Дата >= '20240514' И ЭтотОбъект.Дата < '20240521' Тогда
			
			МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26224"));
			МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26237"));
			МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26244"));
			МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26221"));
			МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26243"));
			МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26240"));
			
		ИначеЕсли ЭтотОбъект.Дата >= '20240521' Тогда	
			
			Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_UL1615")
				ИЛИ СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_NPF124") Тогда
				
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26224"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26237"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26244"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26221"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26243"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26240"));
				
			ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_NPF076") Тогда
				
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26207"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26219"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОФЗ_26212RMFS"));
				МассивБумагВыпусковДоПогашения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26236"));
				
			КонецЕсли;
		КонецЕсли;
		
		Если МассивБумагВыпусковДоПогашения.Количество() > 0 Тогда
			Для Каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
				Если МассивБумагВыпусковДоПогашения.Найти(СтрокаЦенныеБумаги.ЦеннаяБумага) <> Неопределено Тогда
					
					Движение = Движения.РаспределенияАктивовЕПС.Добавить();
					Движение.Организация     = ЭтотОбъект.Организация;
					Движение.Сделка          = ЭтотОбъект.Ссылка;
					Движение.Рынок           = ЭтотОбъект.Рынок;
					Движение.ЦеннаяБумага    = СтрокаЦенныеБумаги.ЦеннаяБумага;
					Движение.УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДРФ;
					Движение.Количество      = СтрокаЦенныеБумаги.Количество;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтотОбъект.ОтложенноеИсполнение
			И ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок
			// биржевые сделки мы загружаем по факту их свершения и проверять
			// отрицательные остатки смысл нет, т.к. движение активов точно произошло,
			// кроме того, это подтверждается в конце дня сверками с брокером
	Тогда
	
		// проверим отрицательные остатки
		Движения.Записать();
	
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			// биржа осуществляет клиринг по расписанию, а не непрерывно, так что в течение дня
			// деньги и/или бумаги могут уходить в минуса. Решили, что деньги котролировать не будем,
			// а вот бумаги всё же стоит
			// РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредств(ЭтотОбъект, Отказ);
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЦенныхБумаг(ЭтотОбъект, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПСФьючерсы(УчетныйРегистр, Отказ)
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	МассивУчетныхАктивов = Новый Массив;
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		АналитикаКомиссии	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
		АналитикаСделки		= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
	Иначе
		АналитикаКомиссии	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
		АналитикаСделки		= Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
	КонецЕсли;
	
	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	
	// #381119: Хардкод для Сафмара по фьючерсам т.к. непонятно пока, какую делать настройку
	МассивСчетовСАФМАР = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
		ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"),
		ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
		ЭтотОбъект.Дата);
	
	ЭтоКлиентСАФМАР = (МассивСчетовСАФМАР.Найти(ЭтотОбъект.СчетДоверительногоУправления) <> Неопределено);
	
	// Комиссия
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		ВидДвиженияДенежныхСредствКомиссия = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка;
	ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		ВидДвиженияДенежныхСредствКомиссия = Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа;
	КонецЕсли;
		
	Для Каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
		
		// Для фьючей не передаем СчетДоверительногоУправления - ибо не переопределяются
		УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(, Перечисления.РынкиЦенныхБумаг.Фьючерсы, СтрокаЦенныеБумаги.ЦеннаяБумага);
		
		Если МассивУчетныхАктивов.Найти(УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
		КонецЕсли;
		
		СуммаКомиссииВВалюте = СтрокаЦенныеБумаги.ТорговаяКомиссия;
		
		Если СуммаКомиссииВВалюте > 0 Тогда
			СуммаКомиссииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
				СуммаКомиссииВВалюте, ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКомиссииВВалютеУчета, "Торговая комиссия начисление");
			
			Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;
			
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("53803");
			
			Проводка.ДополнительнаяАналитикаДт = АналитикаКомиссии;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты22;
			
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Брокер.ЮрФизЛицо;
			Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
			
			Проводка.ВалютаКт = ЭтотОбъект.ВалютаТорговойКомиссии;
			Проводка.ВалютнаяСуммаКт = СуммаКомиссииВВалюте;
			
			Если Не ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии Тогда
				Если Не ЭтоКлиентСАФМАР Тогда // Нормальные клиенты делают 2 проводки через Расчеты22, а Сафмар - 1, напрямую
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКомиссииВВалютеУчета, "Торговая комиссия списание");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.Расчеты22;
					
					Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Брокер.ЮрФизЛицо;
					Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
					
					Проводка.ВалютаДт = ЭтотОбъект.ВалютаТорговойКомиссии;
					Проводка.ВалютнаяСуммаДт = СуммаКомиссииВВалюте;
				Иначе
					Проводка.СубконтоКт.Очистить();
				КонецЕсли;
				
				// Кредит
				Проводка.СчетКт = ПланыСчетов.Единый.РасчетыСБрокерами02;
				
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредствКомиссия;
				
				Проводка.ВалютаКт = ЭтотОбъект.ВалютаТорговойКомиссии;
				Проводка.ВалютнаяСуммаКт = СуммаКомиссииВВалюте;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Глава А
	
	БиржаКонтрагент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ").ЮрФизЛицо;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьПокупки) КАК Стоимость,
		|	СУММА(БухПартииСрочныхКонтрактов.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииСрочныхКонтрактов.ПереоценкаСНачалаГода) КАК ПереоценкаСНачалаГода
		|ПОМЕСТИТЬ ЗакрытияКонтрактов
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
		|ГДЕ
		|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
		|	И БухПартииСрочныхКонтрактов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Цена КАК Цена,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗакрытияКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЗакрытияКонтрактов.Количество КАК Количество,
		|	ЗакрытияКонтрактов.Стоимость КАК Стоимость,
		|	ЗакрытияКонтрактов.Переоценка КАК Переоценка,
		|	ЗакрытияКонтрактов.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ЕСТЬNULL(КотировкиТорговыхПлощадок.SETTLEPRICE, 0) КАК Котировка
		|ИЗ
		|	ЗакрытияКонтрактов КАК ЗакрытияКонтрактов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО ЗакрытияКонтрактов.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|		ПО ЗакрытияКонтрактов.ЦеннаяБумага = КотировкиТорговыхПлощадок.ЦеннаяБумага
		|			И (КотировкиТорговыхПлощадок.Период = &ДатаКотировок)
		|			И (КотировкиТорговыхПлощадок.РежимТоргов = &РежимТоргов)
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Регистратор";
	#КонецОбласти
	Запрос.УстановитьПараметр("ДатаКотировок", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("РежимТоргов", ОбщегоНазначения.ПолучитьИменованныйОбъект("РежимТоргов_ФОРТС"));
	
	Списания = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСписания Из Списания Цикл
		Если СтрокаСписания.Цена = 0 Тогда // это закрытие позиции - берм котировку
			Если СтрокаСписания.Котировка = 0 Тогда // совсем плохо
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует цена фьючерса!", ЭтотОбъект, "Рынок",, Отказ);
				Возврат;
			Иначе
				СтрокаСписания.Цена = СтрокаСписания.Котировка;
			КонецЕсли;
		КонецЕсли;
		
		СебестоимостьФьючерса = СтрокаСписания.Стоимость + СтрокаСписания.Переоценка;
		СтоимостьСписания = СтрокаСписания.Количество * СтрокаСписания.Цена;
		Прибыль = СтоимостьСписания - СебестоимостьФьючерса;
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда // списывали продажи, а для продаж рост бэд, а падение гуд
			Прибыль = -Прибыль;
		КонецЕсли;
		
		Если МассивУчетныхАктивов.Найти(СтрокаСписания.УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(СтрокаСписания.УчетныйАктивЕПС);
		КонецЕсли;
		
		Если Прибыль > 0 Тогда
			// Проводка 1: Прибыль на фьючерс
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Прибыль от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиА;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписания.УчетныйАктивЕПС.АналитикаДоходовОтОпераций;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаКт = АналитикаСделки;
			
			// Проводка 2: Фьючерс на вспомогательный
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Прибыль от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
			// Кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиА;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Проводка 3: Вспомогательный на дебиторку
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Задолженность по вар.марже");
			
			// Дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
			Проводка.СубконтоДт.Контрагенты = БиржаКонтрагент;
			Проводка.ВалютаДт = ВалютаУчета;
			Проводка.ВалютнаяСуммаДт = Прибыль;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
		ИначеЕсли Прибыль < 0 Тогда
			// Проводка 1: Фьючерс на прибыль
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Убыток от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписания.УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаДт = АналитикаСделки;
			
			// Кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиП;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Проводка 2: Вспомогательный на фьючерс
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Убыток от закрытия контракта");
			
			// Дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиП;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
			// Проводка 3: Кредиторку на вспомогательный
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
				ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Задолженность по вар.марже");
			
			// Дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			
			// Кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
			Проводка.СубконтоКт.Контрагенты = БиржаКонтрагент;
			Проводка.ВалютаКт = ВалютаУчета;
			Проводка.ВалютнаяСуммаКт = -Прибыль;
		КонецЕсли;
		
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
			// Т.к. закрывали партии фьючерсов то закроем 7ой раздел
			СуммаЗакрытия7гоРаздела = Прибыль;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				СуммаЗакрытия7гоРаздела = СуммаЗакрытия7гоРаздела + СтрокаСписания.ПереоценкаСНачалаГода;
			Иначе
				СуммаЗакрытия7гоРаздела = СуммаЗакрытия7гоРаздела - СтрокаСписания.ПереоценкаСНачалаГода;
			КонецЕсли;
			
			Если СуммаЗакрытия7гоРаздела > 0 Тогда
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					СтрокаСписания.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций,
					СтрокаСписания.ЦеннаяБумага,
					СтрокаСписания.УчетныйАктивЕПС.АналитикаДоходовОтОпераций,
					ВалютаУчета,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаСделки,
					-СуммаЗакрытия7гоРаздела); // Приходится передавать наоборот ибо вот так вот сделана процедура
			ИначеЕсли СуммаЗакрытия7гоРаздела < 0 Тогда
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					СтрокаСписания.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций,
					СтрокаСписания.ЦеннаяБумага,
					СтрокаСписания.УчетныйАктивЕПС.АналитикаРасходовОтОпераций,
					ВалютаУчета,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаСделки,
					-СуммаЗакрытия7гоРаздела); // Приходится передавать наоборот ибо вот так вот сделана процедура
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЭтотОбъект.ОтложенноеИсполнение Тогда
		// Если мы этой сделкой только закрываем чужие сделки и не открываем новых то мы сразу же и закроем 7ой раздел
		//	ибо других прибылей/убытков по сделке не предполагается
		Запрос = Новый Запрос;
		Запрос.Текст =
		#Область ТекстЗапроса
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество
			|ПОМЕСТИТЬ ОткрытияКонтрактов
			|ИЗ
			|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
			|ГДЕ
			|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
			|	И БухПартииСрочныхКонтрактов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииСрочныхКонтрактов.ЦеннаяБумага
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СделкаЦенныеБумаги.Количество КАК КоличествоСделка,
			|	СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссия,
			|	ЕСТЬNULL(ОткрытияКонтрактов.Количество, 0) КАК Количество
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОткрытияКонтрактов КАК ОткрытияКонтрактов
			|		ПО (ОткрытияКонтрактов.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага)
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка = &Регистратор";
		#КонецОбласти
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
		
		Создания = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаСоздания Из Создания Цикл
			Если СтрокаСоздания.Количество = 0 Тогда // Мы не создавали новых партий
				// Для фьючей не передаем СчетДоверительногоУправления - ибо не переопределяются
				УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(, Перечисления.РынкиЦенныхБумаг.Фьючерсы, СтрокаСоздания.ЦеннаяБумага);
				
				Если МассивУчетныхАктивов.Найти(УчетныйАктивЕПС) = Неопределено Тогда
					МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
				КонецЕсли;
				
				// По просьбе Светы Мищенко не делаем закрытия по комиссии - ждем конца года ибо методика неопределена
				Продолжить;
				
				// Закроем 7-ой раздел в части начисленной комиссии
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций,
					СтрокаСоздания.ЦеннаяБумага,
					УчетныйАктивЕПС.АналитикаРасходовОтОпераций,
					ЭтотОбъект.ВалютаТорговойКомиссии,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаКомиссии,
					СтрокаСоздания.ТорговаяКомиссия);
			КонецЕсли;
		КонецЦикла;
		
		БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Истина, Истина, Неопределено, Отказ);
	КонецЕсли;
	
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
	
	// Глава Г
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактов.ВидДвижения КАК ВидДвижения,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.ВидСделки КАК ВидСделки,
		|	БухПартииСрочныхКонтрактов.Партия КАК Партия,
		|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьПокупки) КАК Стоимость,
		|	СУММА(БухПартииСрочныхКонтрактов.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьБазовогоАктиваВВалютеУчета) КАК СтоимостьБазовогоАктиваВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
		|ГДЕ
		|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
		|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииСрочныхКонтрактов.ВидДвижения,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС,
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.ВидСделки,
		|	БухПартииСрочныхКонтрактов.Партия";
	#КонецОбласти
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
	
	ДвиженияПартий = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДвиженияПартий Из ДвиженияПартий Цикл
		БазовыйАктив = СтрокаДвиженияПартий.ЦеннаяБумага.БазовыйАктив;
		
		Если ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.ВалютныеПары") Тогда
			ВалютаАктива = БазовыйАктив.Валюта;
		ИначеЕсли ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.Акции") Тогда
			ВалютаАктива = БазовыйАктив.ВалютаНоминала;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Учет по главе Г не проведен! Учет реализован только для валютных пар и акций!", ЭтотОбъект, "Основание");
			Продолжить;
		КонецЕсли;
		
		ОснованиеРасчетов = СтрокаДвиженияПартий.Партия;
		
		Если ТипЗнч(ОснованиеРасчетов) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
			ОснованиеРасчетов = ОснованиеРасчетов.Основание;
		КонецЕсли;
		
		Если СтрокаДвиженияПартий.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			// Перечисления.ВидыСделок.Покупка
			#Область Перечисления_ВидыСделок_Покупка
			Если СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				// Кредиторка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Обязательство по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
				
				// Дебиторка
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Требование по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаАктива;
					Проводка.ВалютнаяСуммаДт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				КонецЕсли;
			#КонецОбласти
			// Перечисления.ВидыСделок.Продажа
			#Область Перечисления_ВидыСделок_Продажа
			ИначеЕсли СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
				// Дебиторка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Требование по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				КонецЕсли;
				
				// Кредиторка
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Обязательство по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаАктива;
					Проводка.ВалютнаяСуммаКт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
		ИначеЕсли СтрокаДвиженияПартий.ВидДвижения = ВидДвиженияНакопления.Расход Тогда // Закрываем требования и обязательства
			// Перечисления.ВидыСделок.Покупка
			#Область Перечисления_ВидыСделок_Покупка
			Если СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				// Закрытие кредиторки стоимость
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Закрытие обязательства по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				КонецЕсли;
				
				// Закрытие кредиторки переоценка
				Если СтрокаДвиженияПартий.Переоценка <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Переоценка, "Закрытие обязательства по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Переоценка;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				КонецЕсли;
				
				// Закрытие дебиторки
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Закрытие требования по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаАктива;
					Проводка.ВалютнаяСуммаКт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
			#КонецОбласти
			// Перечисления.ВидыСделок.Продажа
			#Область Перечисления_ВидыСделок_Продажа
			ИначеЕсли СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
				// Закрытие дебиторки стоимость
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Закрытие требования по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				КонецЕсли;
				
				// Закрытие дебиторки переоценка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Переоценка, "Закрытие требования по поставке");
					
					// Дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// Кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Переоценка;
				КонецЕсли;
				
				// Закрытие кредиторки
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(
						ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Закрытие обязательства по поставке");
					
					// Дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаАктива;
					Проводка.ВалютнаяСуммаДт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// Кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, Контрагент, КонтрагентЯвляетсяРезидентом, КонтрагентПоКомиссии, СчетДС, СубконтоДС, ВидСубконтоДС, Отказ)
	
	Если НЕ ЭтотОбъект.ОтложенноеИсполнение Тогда
		
		СуммаСделки = ЭтотОбъект.ЦенныеБумаги.Итог("Сумма");
		СуммаКупона = ЭтотОбъект.ЦенныеБумаги.Итог("СуммаКупона");
		СуммаСделкиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаСделки, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		СуммаКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупона, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		
		ПараметрыОплаты = Новый Структура;
		
		ПараметрыОплаты.Вставить("Сделка",							ЭтотОбъект.Ссылка);
		ПараметрыОплаты.Вставить("СуммаТела",						СуммаСделки);
		ПараметрыОплаты.Вставить("СуммаКупона",						СуммаКупона);
		ПараметрыОплаты.Вставить("ВалютаСделки",					ЭтотОбъект.ВалютаСделки);
		ПараметрыОплаты.Вставить("ВалютаОплаты",					ЭтотОбъект.ВалютаСделки);
		ПараметрыОплаты.Вставить("Контрагент",						Контрагент);
		ПараметрыОплаты.Вставить("СчетДС",							СчетДС);
		ПараметрыОплаты.Вставить("СубконтоДС",						СубконтоДС);
		ПараметрыОплаты.Вставить("ВидСубконтоДС",					ВидСубконтоДС);
		ПараметрыОплаты.Вставить("КонтрагентЯвляетсяРезидентом",	КонтрагентЯвляетсяРезидентом);
		ПараметрыОплаты.Вставить("КонтрагентПоКомиссии",			КонтрагентПоКомиссии);
		
		ПараметрыОплаты.Вставить("СуммаСделкиВВалютеУчета",			СуммаСделкиВВалютеУчета);
		ПараметрыОплаты.Вставить("СуммаКупонаВВалютеУчета",			СуммаКупонаВВалютеУчета);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачалаСделкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиОплатыПоСделке(ЭтотОбъект, ПараметрыОплаты, Отказ);
		
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			
			// оплата комиссии
			// тут есть заложенность на то, что при покупке мы не будем делить по виду учетного актива (всегда будем отправлять на 1 вид)
			// я так решил потому, что прецендентов не было
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссия,
			|	БухПартииЦенныхБумаг.Партия КАК Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = БухПартииЦенныхБумаг.ЦеннаяБумага
			|			И (БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
			|			И (БухПартииЦенныхБумаг.Количество <> 0)
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка = &Ссылка
			|	И БухПартииЦенныхБумаг.Регистратор = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ПараметрыОплаты.Вставить("УчетныйАктивЕПС",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС);
				ПараметрыОплаты.Вставить("ЦеннаяБумага",		ВыборкаДетальныеЗаписи.ЦеннаяБумага);
				ПараметрыОплаты.Вставить("ТорговаяКомиссия",	ВыборкаДетальныеЗаписи.ТорговаяКомиссия);
				ПараметрыОплаты.Вставить("Партия",				ВыборкаДетальныеЗаписи.Партия);
				ПараметрыОплаты.Вставить("СтрокаПартии",		ВыборкаДетальныеЗаписи.СтрокаПартии);
				
				БухгалтерскийУчетЕПС.СформироватьПроводкиОплатыТорговойКомиссииСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
				
			КонецЦикла;
			
			БухгалтерскийУчетЕПС.СформироватьПроводкиПокупкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, Контрагент);
			
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			
			БухгалтерскийУчетЕПС.СформироватьПроводкиПродажиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
		КонецЕсли;
		
	Иначе // Т +
		
		СформироватьПроводкиПоГлавеГДляСделкиТПлюс(КонтрагентЯвляетсяРезидентом, Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
	
		ПроведениеПоРегиструЕПСФьючерсы(УчетныйРегистр, Отказ);
		Возврат;
		
	ИначеЕсли ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Доли Тогда
		Возврат;
	КонецЕсли;
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	НастройкиУчетаОбщие = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);
		
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Если ЭтотОбъект.Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
		Контрагент 				= ЭтотОбъект.Брокер.ЮрФизЛицо;
		КонтрагентПоКомиссии	= ЭтотОбъект.Брокер.ЮрФизЛицо;
		СчетДС 					= ПланыСчетов.Единый.РасчетыСБрокерами02;
		
		ВидСубконтоДС	= ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
		СубконтоДС 		= БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
	Иначе
		Контрагент 				= ЭтотОбъект.Контрагент;
		КонтрагентПоКомиссии 	= ЭтотОбъект.Контрагент;
		Если Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк, Дата) Тогда
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета01;
		Иначе
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		
		ВидСубконтоДС 	= ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета;
		СубконтоДС		= ЭтотОбъект.РасчетныйСчет;
	КонецЕсли;
	
	КонтрагентЯвляетсяРезидентом = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Контрагент, ЭтотОбъект.Организация);
	
	СуммаКомиссииВВалюте = ЭтотОбъект.ЦенныеБумаги.Итог("ТорговаяКомиссия");

	Если ЭтотОбъект.ОтложенноеИсполнение и СуммаКомиссииВВалюте > 0 Тогда
		
		ПараметрыКомиссии = Новый Структура;
		ПараметрыКомиссии.Вставить("ЦБ", 					Неопределено);
		ПараметрыКомиссии.Вставить("ВидСделки", 			ВидСделки);
		ПараметрыКомиссии.Вставить("ВалютаКомиссии", 		ЭтотОбъект.ВалютаТорговойКомиссии);
		ПараметрыКомиссии.Вставить("ВидКомиссии", 			Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
		ПараметрыКомиссии.Вставить("КонтрагентПоКомиссии", 	КонтрагентПоКомиссии);
		ПараметрыКомиссии.Вставить("ВключатьРасходыПоПокупкеВСтоимость", 	Ложь);
		ПараметрыКомиссии.Вставить("УчетныйАктив",			Неопределено);
		ПараметрыКомиссии.Вставить("Сделка",				Ссылка);
		ПараметрыКомиссии.Вставить("СчетДС", 				СчетДС);
		ПараметрыКомиссии.Вставить("СубконтоДС", 			СубконтоДС);
		ПараметрыКомиссии.Вставить("ВидСубконтоДС",			ВидСубконтоДС);

		Если Не ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии  Тогда //комиссия
			
			// торговую комиссию Деньги -> Комисия 
			// а на расходы комиссию спишет исполнение
			
			ТаблицаСделок = Новый ТаблицаЗначений;
			ТаблицаСделок.Колонки.Добавить("Основание", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
			СтрокаТаблицыСделок 			= ТаблицаСделок.Добавить();
			СтрокаТаблицыСделок.Основание 	= Ссылка;
			РаспределениеПоВидуАктиваЕПС 	= БухгалтерскийУчетЕПС.ПолучитьРаспределениеПоВидуАктива(ТаблицаСделок);
			
			Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
				
				СуммаКомиссииВВалюте      = СтрокаЦенныеБумаги.ТорговаяКомиссия;
				СуммаКомиссииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссииВВалюте, ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
				
				ПараметрыКомиссии.ЦБ = СтрокаЦенныеБумаги.ЦеннаяБумага;
				
				ПараметрыКомиссии.Вставить("СуммаОперации", СуммаКомиссииВВалютеУчета);
				ПараметрыКомиссии.Вставить("СуммаКомисии", 	СуммаКомиссииВВалюте);
								
				РаспределениеТекущейЦБ = РаспределениеПоВидуАктиваЕПС.НайтиСтроки(Новый  Структура("ЦеннаяБумага",СтрокаЦенныеБумаги.ЦеннаяБумага));
				
				СуммаКомиссииВВалютеКРаспределению 		= ПараметрыКомиссии.СуммаКомисии;
				СуммаКомиссииВВалютеУчетаКРаспределению = ПараметрыКомиссии.СуммаОперации;
				
				КоличествоПоСделке = 0;
				
				Для Каждого СтрокаРаспределенияТекущейЦБ Из РаспределениеТекущейЦБ Цикл
					КоличествоПоСделке = КоличествоПоСделке + СтрокаРаспределенияТекущейЦБ.Количество;
				КонецЦикла;
				
				Для Каждого СтрокаРаспределенияТекущейЦБ Из РаспределениеТекущейЦБ Цикл
					ТекКоличество = СтрокаРаспределенияТекущейЦБ.Количество;
					СуммаКомиссииВВалюте 		= Окр(СуммаКомиссииВВалютеКРаспределению 		* ТекКоличество / КоличествоПоСделке,2);
					СуммаКомиссииВВалютеУчета 	= Окр(СуммаКомиссииВВалютеУчетаКРаспределению 	* ТекКоличество / КоличествоПоСделке,2);
					
					ПараметрыКомиссии.СуммаКомисии 						 = СуммаКомиссииВВалюте;
					ПараметрыКомиссии.СуммаОперации 					 = СуммаКомиссииВВалютеУчета;
					ПараметрыКомиссии.УчетныйАктив 						 = СтрокаРаспределенияТекущейЦБ.УчетныйАктивЕПС;
					ПараметрыКомиссии.ВключатьРасходыПоПокупкеВСтоимость = СтрокаРаспределенияТекущейЦБ.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость;
					
					ПараметрыКомиссии.Вставить("ОплатаВДеньПокупки",	Ложь);
					ПараметрыКомиссии.Вставить("ПроводитьЧерезРасчеты",	Ложь);
					ПараметрыКомиссии.Вставить("ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты",	НастройкиУчетаОбщие.ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты);
					
					Если НастройкиУчетаОбщие.ПроводитьКомиссиюПоСделкамЧерезСчетаРасчетов Тогда
						ПараметрыКомиссии.Вставить("ПроводитьЧерезРасчеты",	Истина);
						
						ПараметрыКомиссии.Вставить("СуммаЧерезРасчеты",	СуммаКомиссииВВалютеУчета);
						ПараметрыКомиссии.Вставить("СуммаЧерезРасчетыВал",	СуммаКомиссииВВалюте);
					КонецЕсли;
					
					Если НЕ НастройкиУчетаОбщие.ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты Тогда
						
						ПараметрыКомиссии.Вставить("ПредварительныеЗатратыПоСделке", 	Истина);
						
						БухгалтерскийУчетЕПС.НачислитьКомиссию(ЭтотОбъект, ПараметрыКомиссии, Отказ);	
					
					КонецЕсли;
					
					ПараметрыКомиссии.Вставить("Закрывать7ойРазделПриПоступленииДенежныхСредств",	Закрывать7ойРазделПриПоступленииДенежныхСредств);
					
					БухгалтерскийУчетЕПС.ОплатитьКомиссиюНаЦБ(ЭтотОбъект,ПараметрыКомиссии, Отказ);
					
					КоличествоПоСделке = КоличествоПоСделке - ТекКоличество;
					СуммаКомиссииВВалютеКРаспределению 		= СуммаКомиссииВВалютеКРаспределению 		- СуммаКомиссииВВалюте;
					СуммаКомиссииВВалютеУчетаКРаспределению = СуммаКомиссииВВалютеУчетаКРаспределению 	- СуммаКомиссииВВалютеУчета;
				КонецЦикла;				
			КонецЦикла;
			
		ИначеЕсли НЕ НастройкиУчетаОбщие.ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты Тогда
			
			СуммаКомиссииВВалютеУчета 	= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссииВВалюте, ЭтотОбъект.ВалютаТорговойКомиссии, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			ПараметрыКомиссии.Вставить("СуммаКомисии", 						СуммаКомиссииВВалюте);
			ПараметрыКомиссии.Вставить("СуммаОперации", 					СуммаКомиссииВВалютеУчета);
			ПараметрыКомиссии.Вставить("ПредварительныеЗатратыПоСделке", 	Истина);
			ПараметрыКомиссии.Вставить("СуммаЧерезРасчеты",					СуммаКомиссииВВалютеУчета);
			ПараметрыКомиссии.Вставить("СуммаЧерезРасчетыВал",				СуммаКомиссииВВалюте);
			
			БухгалтерскийУчетЕПС.НачислитьКомиссию(ЭтотОбъект, ПараметрыКомиссии, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если НастройкиУчетаОбщие.ОтражатьПартииНаЛицевыхСчетах Тогда
		ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, Контрагент, КонтрагентЯвляетсяРезидентом, КонтрагентПоКомиссии, СчетДС, СубконтоДС, ВидСубконтоДС, Отказ);
	Иначе
		Если ЭтотОбъект.ОтложенноеИсполнение Тогда // только глава Г
			// если не день-в-день
			Если НачалоДня(ЭтотОбъект.ДатаОплаты) > НачалоДня(ЭтотОбъект.Дата) И НачалоДня(ЭтотОбъект.ДатаПоставки)	> НачалоДня(ЭтотОбъект.Дата) Тогда
				СформироватьПроводкиПоГлавеГДляСделкиТПлюс(КонтрагентЯвляетсяРезидентом, Отказ);
			КонецЕсли;
		Иначе // полноценные движения по бумагам и деньгам
			БухгалтерскийУчетЕПС.СформироватьПроводкиПокупкиПродажиЦеннойБумаги(ЭтотОбъект, Ссылка, УчетныйРегистр, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиПоГлавеГДляСделкиТПлюс(КонтрагентЯвляетсяРезидентом, Отказ)
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		
		НастройкиУчета = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиУчета(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления);	
			
		ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагКПолучению.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагКПолучению.Рынок КАК Рынок,
			|	БухПартииЦенныхБумагКПолучению.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	СУММА(БухПартииЦенныхБумагКПолучению.Количество) КАК Количество,
			|	СУММА(БухПартииЦенныхБумагКПолучению.Стоимость) КАК Стоимость,
			|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьКупона) КАК СтоимостьКупона,
			|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
			|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
			|	СУММА(БухПартииЦенныхБумагКПолучению.РасходыПриПокупкеВСтоимости) КАК РасходыПриПокупкеВСтоимости
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКПолучению КАК БухПартииЦенныхБумагКПолучению
			|ГДЕ
			|	БухПартииЦенныхБумагКПолучению.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумагКПолучению.ВидУчета = &ВидУчета
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииЦенныхБумагКПолучению.ЦеннаяБумага,
			|	БухПартииЦенныхБумагКПолучению.Рынок,
			|	БухПартииЦенныхБумагКПолучению.УчетныйАктивЕПС";
		
		Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ВалютаНоминала = ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала;
			
			СуммаЦБ = ВыборкаДетальныеЗаписи.Стоимость;
			СуммаЦБВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
			
			СуммаДС = ВыборкаДетальныеЗаписи.Стоимость;
			СуммаДСВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
			
			// для бумаг по АС в РасходыПриПокупкеВСтоимости попадает комиссия 
			// еще она же попадает и в Стоимость и в СтоимостьВВалютеУчета
			// а она на главе Г, как оказалось, никому не нужна
			// Тех.долг: добавить на регистр БухПартииЦенныхБумагКПолучению ресурс РасходыПриПокупкеВСтоимостиВВалютеУчета, в нынешнее время не сильно актуально, но нужно сделать
			//
			// Сейчас на РасходыПриПокупкеВСтоимости лежит рублевая сумма, а валютную приходится считать
			Если ВалютаНоминала = ВалютаУчета Тогда
				РасходыПриПокупкеВСтоимостиВВалютеНоминала = ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости; 
			Иначе	
				РасходыПриПокупкеВСтоимостиВВалютеНоминала = РаботаСВалютами.ПересчетСуммыВВалюте(ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости, ВалютаУчета,ЭтотОбъект.Дата, ВалютаНоминала, ЭтотОбъект.Дата, Отказ);
			КонецЕсли;
			
			СуммаЦБ = СуммаЦБ - РасходыПриПокупкеВСтоимостиВВалютеНоминала;
			СуммаЦБВВалютеУчета = СуммаЦБВВалютеУчета - ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости;
			
			// для задолженности по ДС на главе Г, она тем более не нужна
			СуммаДС = СуммаДС - РасходыПриПокупкеВСтоимостиВВалютеНоминала; 
			СуммаДСВВалютеУчета = СуммаДСВВалютеУчета - ВыборкаДетальныеЗаписи.РасходыПриПокупкеВСтоимости;
			
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБВВалютеУчета, "Отражены требования по поставке ЦБ");
			
			// дебет
			Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ01, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ02);
			
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
			
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаДт = СуммаДС;
			Проводка.КоличествоДт = ВыборкаДетальныеЗаписи.Количество;
			
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаДСВВалютеУчета, "Отражены обязательства по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			
			// кредит
			Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
			Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
			
			Проводка.ВалютаКт = ЭтотОбъект.ВалютаСделки;
			Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаДСВВалютеУчета, ВалютаУчета, ЭтотОбъект.Дата, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата);
			
			
			Если ВыборкаДетальныеЗаписи.СтоимостьКупона <> 0 Тогда
			
				СуммаЦБ = ВыборкаДетальныеЗаписи.СтоимостьКупона;
				СуммаЦБВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБВВалютеУчета, "Отражены требования по поставке ЦБ");
				
				// дебет
				Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ01, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ02);
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
				
				ВалютаНоминала = ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала;
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = СуммаЦБ;
				
				Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБВВалютеУчета, "Отражены обязательства по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				// кредит
				Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
				Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
				
				Проводка.ВалютаКт = ЭтотОбъект.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаЦБВВалютеУчета, ВалютаУчета, ЭтотОбъект.Дата, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата);
			
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		
		Для каждого СтрокаДокумента из ЭтотОбъект.ЦенныеБумаги Цикл
			
			ВалютаНоминала = СтрокаДокумента.ЦеннаяБумага.ВалютаНоминала;
			
			СуммаВал = СтрокаДокумента.Сумма;
			СуммаВалЦБ = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, ВалютаНоминала, ЭтотОбъект.Дата, Отказ);
			СуммаВалДС = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, 
				ЭтотОбъект.ВалютаОплаты, ?(ЭтотОбъект.СобственныйКурсОплаты, ЭтотОбъект.КурсОплаты, ЭтотОбъект.Дата), Отказ);
				
			СуммаРубЦБ = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалЦБ, ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
			СуммаРубДС = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалДС, ЭтотОбъект.ВалютаОплаты, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубДС, "Отражены требования по поставке ДС");
			
			// дебет
			Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
			
			Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
			
			Проводка.ВалютаДт = ЭтотОбъект.ВалютаСделки;
			Проводка.ВалютнаяСуммаДт = СуммаВалДС;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубЦБ, "Отражены обязательства по поставке ЦБ");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			
			// кредит
			Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01);
			Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаДокумента.ЦеннаяБумага;
			
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = СуммаВалЦБ;
			Проводка.КоличествоКт = СтрокаДокумента.Количество;
			
			Если СтрокаДокумента.СуммаКупона <> 0 Тогда
			
				СуммаВал = СтрокаДокумента.СуммаКупона;
				СуммаВалЦБ = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, ВалютаНоминала, ЭтотОбъект.Дата, Отказ);
				СуммаВалДС = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Дата, 
					ЭтотОбъект.ВалютаОплаты, ?(ЭтотОбъект.СобственныйКурсОплаты, ЭтотОбъект.КурсОплаты, ЭтотОбъект.Дата), Отказ);
					
				СуммаРубЦБ = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалЦБ, ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
				СуммаРубДС = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалДС, ЭтотОбъект.ВалютаОплаты, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
				
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубДС, "Отражены требования по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
				
				Проводка.СубконтоДт.ОснованиеРасчетов = Ссылка;
				
				Проводка.ВалютаДт = ЭтотОбъект.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = СуммаВалДС;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
			
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубЦБ, "Отражены обязательства по поставке ЦБ");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				// кредит
				Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01);
				Проводка.СубконтоКт.ОснованиеРасчетов = Ссылка;
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаДокумента.ЦеннаяБумага;
				
				Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
				Проводка.ВалютаКт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = СуммаВалЦБ;
			
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерииДоли(УчетныйРегистр, Отказ)
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ЭтотОбъект.ОтложенноеИсполнение Тогда
		Возврат;
	КонецЕсли;
	
	УчетныйАктив					= БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Рынок, Неопределено);
	НастройкиУчетаАктива			= БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, Организация, СчетДоверительногоУправления, УчетныйАктив, УчетныйРегистр);
	ВалютныйУчет					= НастройкиУчетаАктива.СчетУчета.Валютный;
	СчетРасчетаСКонтрагентами		= ПланыСчетов.Основной.РасчетыСКонтрагентами;
	СчетПрочиеРасходы				= ПланыСчетов.Основной.ПрочиеРасходы;
	СчетПрочиеДоходы				= ПланыСчетов.Основной.ПрочиеДоходы;
	ВидСубконтоУчетаЦеннойБумаги	= БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);
	
	СчетУчетаДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВалютаСделки,
		ЭтотОбъект.Брокер);
		
	Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
		
		Для Каждого ТекСтрока Из ЦенныеБумаги Цикл
			
			Если ТекСтрока.Количество > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Покупка доли");
				
				// Дт.
				Проводка.СчетДт = НастройкиУчетаАктива.СчетУчета;
				Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ТекСтрока.ЦеннаяБумага;
				
				Проводка.КоличествоДт = ТекСтрока.Количество;
				
				// Кт.
				Проводка.СчетКт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				
			КонецЕсли;
			
			Если ТекСтрока.Сумма > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата продавцу");
				
				// Дт.
				Проводка.СчетДт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				
				// Кт.
				Проводка.СчетКт = СчетУчетаДС;
				Проводка.СубконтоКт.БанковскиеСчета = РасчетныйСчет;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Граница",						Новый Граница(МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация",					Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("СчетУчетаАктивов",				НастройкиУчетаАктива.СчетУчета);
		Запрос.УстановитьПараметр("СчетУчетаПереоценки",			НастройкиУчетаАктива.СчетУчетаПереоценки);
		Запрос.УстановитьПараметр("ТЧ",								ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, Количество, Сумма"));
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЦенныеБумаги.ЦеннаяБумага КАК Доля,
			|	ЦенныеБумаги.Количество КАК Количество,
			|	ЦенныеБумаги.Сумма КАК Сумма
			|ПОМЕСТИТЬ _ТЧ
			|ИЗ
			|	&ТЧ КАК ЦенныеБумаги
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТЧ.Доля КАК Доля,
			|	СУММА(_ТЧ.Количество) КАК Количество,
			|	СУММА(_ТЧ.Сумма) КАК Сумма
			|ПОМЕСТИТЬ _ЦенныеБумаги
			|ИЗ
			|	_ТЧ КАК _ТЧ
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТЧ.Доля
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто1 КАК Доля,
			|	БухгалтерскийУчетОстатки.КоличествоОстатокДт КАК КоличествоОстаток,
			|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстаток
			|ПОМЕСТИТЬ _ОстаткиАктива
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Граница,
			|			Счет = &СчетУчетаАктивов,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Доли),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_ЦенныеБумаги.Доля КАК Доля
			|					ИЗ
			|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто1 КАК Доля,
			|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
			|ПОМЕСТИТЬ _ОстаткиПереоценки
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Граница,
			|			Счет = &СчетУчетаПереоценки,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Доли),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_ЦенныеБумаги.Доля КАК Доля
			|					ИЗ
			|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.Доля КАК Доля,
			|	_ЦенныеБумаги.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА _ОстаткиАктива.СуммаОстаток
			|				ИНАЧЕ _ОстаткиАктива.СуммаОстаток * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаДоля,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0)
			|				ИНАЧЕ ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаПереоценка,
			|	_ЦенныеБумаги.Сумма КАК Сумма
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиАктива КАК _ОстаткиАктива
			|		ПО _ЦенныеБумаги.Доля = _ОстаткиАктива.Доля
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПереоценки КАК _ОстаткиПереоценки
			|		ПО _ЦенныеБумаги.Доля = _ОстаткиПереоценки.Доля";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			// Себестоимость.
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаДоля, ВалютаСделки, Организация, Дата, Отказ), "Продажа доли");
			
			// Дт.
			Проводка.СчетДт = СчетПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.Доля;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается;
			
			// Кт.
			Проводка.СчетКт = НастройкиУчетаАктива.СчетУчета;
			Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.Доля;
			
			Проводка.КоличествоКт = Выборка.Количество;
			
			Если Выборка.СуммаПереоценка <> 0 Тогда
				
				// Переоценка.
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаПереоценка, ВалютаСделки, Организация, Дата, Отказ), "Продажа доли (переоценка)");
				
				// Дт.
				Проводка.СчетДт = СчетПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.Доля;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается;
				
				// Кт.
				Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
				Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.Доля;
				
			КонецЕсли;
			
			Если Выборка.Сумма > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Начисление дебиторской задолженности");
				
				// Дт.
				Проводка.СчетДт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				
				// Кт.
				Проводка.СчетКт = СчетПрочиеДоходы;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоКт.ЦенныеБумаги			= Выборка.Доля;
				Проводка.СубконтоКт.ОбращаетсяНаОРЦБ		= Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата от покупателя");
				
				// Дт.
				Проводка.СчетДт = СчетУчетаДС;
				Проводка.СубконтоДт.БанковскиеСчета = РасчетныйСчет;
				
				// Кт.
				Проводка.СчетКт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Если ЭтотОбъект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли") Тогда
		ПроведениеПоРегиструБухгалтерииДоли(УчетныйРегистр, Отказ);
		Возврат;
	КонецЕсли;
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	БухгалтерскийУчет.СформироватьПроводкиПокупкиПродажиЦеннойБумагиБУНУ(ЭтотОбъект, УчетныйРегистр, Отказ);
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "НомерСделки, ВремяСделки");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Для сделок с отлагательным условием не контролируем даты. Для него они могут быть пустыми
	Если (ЭтотОбъект.ОтложенноеИсполнение) и (ЭтотОбъект.ПлатежноеУсловиеСделки <> "Delayed") Тогда
		Если ЭтотОбъект.РаздельноеИсполнение Тогда
			ПроверяемыеРеквизиты.Добавить("ДатаОплаты");
			ПроверяемыеРеквизиты.Добавить("ДатаПоставки");
		Иначе
			ПроверяемыеРеквизиты.Добавить("ДатаИсполнения");
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ОтложеннаяОплатаТорговойКомиссии Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОплатыТорговойКомиссии");
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Количество") <> Неопределено И ЭтотОбъект.ПриобретениеПаев Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Количество"));
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Цена") <> Неопределено И ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Доли Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЦенныеБумаги.Цена"));
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	РаботаСДокументами.ЗаполнитьСтрокиПартии(ЭтотОбъект);

	Если ЭтотОбъект.ОтложенноеИсполнение И Не ЭтотОбъект.РаздельноеИсполнение Тогда
		ЭтотОбъект.ДатаОплаты   = ЭтотОбъект.ДатаИсполнения;
		ЭтотОбъект.ДатаПоставки = ЭтотОбъект.ДатаИсполнения;
	КонецЕсли;
		
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		РаботаСДокументами.ПроверитьУникальностьНомераСделки(ЭтотОбъект, Отказ);
		
		РаботаСДокументами.ПроверитьЗаполнениеРасчетногоСчета(ЭтотОбъект, Отказ);
		
		Если Не ЭтотОбъект.ОтложенноеИсполнение Тогда // даты исполнения, оплаты и поставки не д.б. заполнены
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИсполнения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата исполнения может быть заполнена только при отложенном исполнении сделки", ЭтотОбъект, "ДатаИсполнения",, Отказ);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОплаты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата оплаты может быть заполнена только при отложенном раздельном исполнении сделки", ЭтотОбъект, "ДатаОплаты",, Отказ);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаПоставки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата поставки может быть заполнена только при отложенном раздельном исполнении сделки", ЭтотОбъект, "ДатаПоставки",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.РаздельноеИсполнение Тогда // дата исполнения не д.б. заполнена
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИсполнения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата исполнения может быть заполнена только при отложенном, но не раздельном, исполнении сделки", ЭтотОбъект, "ДатаИсполнения",, Отказ);
			КонецЕсли;
		Иначе
			Если ЭтотОбъект.ВалютаОплаты <> ЭтотОбъект.ВалютаСделки Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта оплаты отличается от валюты сделки", ЭтотОбъект, "ВалютаОплаты",, Отказ);	
			КонецЕсли;
		КонецЕсли;
		
		// Если заполнены р/счет контрагента, то должен быть выбран правильный контрагент
		Если ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчетКонтрагента) Тогда
			Если ЭтотОбъект.РасчетныйСчетКонтрагента.ЮрФизЛицо <> ЭтотОбъект.Контрагент Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагент «" + ЭтотОбъект.Контрагент + "» не является владельцем р/счета «" + ЭтотОбъект.РасчетныйСчетКонтрагента + "».", ЭтотОбъект, "Рынок",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ТипЦеннойБумаги = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтотОбъект.Рынок);
		
		Для НомСтр = 0 По ЭтотОбъект.ЦенныеБумаги.Количество() - 1 Цикл
			
			СтрокаЦенныеБумаги = ЭтотОбъект.ЦенныеБумаги[НомСтр];
			
			// проверим, что рынок соответствует типу ценной бумаги
			Если Не ТипЦеннойБумаги.СодержитТип(ТипЗнч(СтрокаЦенныеБумаги.ЦеннаяБумага)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип ценной бумаги в строке № " + (НомСтр + 1) + " не соответствует рынку " + ЭтотОбъект.Рынок + ".",,,, Отказ);
			КонецЕсли;
			
			// для рынка векселей проверим количество
			Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя И СтрокаЦенныеБумаги.Количество <> 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество векселей в строке № " + (НомСтр + 1) + " отлично от 1. Обратитесь к разработчикам.",,,, Отказ);
			КонецЕсли;
			
			// цена и сумма купона могут быть заполнены только для облигаций
			Если ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Облигации Тогда
				
				Если СтрокаЦенныеБумаги.ЦенаКупона <> 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № " + (НомСтр + 1) + " заполнена цена купона при выбранном рынке ц/б «" + ЭтотОбъект.Рынок + "».",,,, Отказ);
				КонецЕсли;
				
				Если СтрокаЦенныеБумаги.СуммаКупона <> 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № " + (НомСтр + 1) + " заполнена сумма купона при выбранном рынке ц/б «" + ЭтотОбъект.Рынок + "».",,,, Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоПогашениеПаев() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Операция 'Погашение паёв' регистрируется документом 'Погашение ценных бумаг'", ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ПриобретениеПаев Тогда
			
			Если ЭтотОбъект.МестоХранения <> ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок")
				И НЕ ЭтотОбъект.МестоХранения.ПринадлежитЭлементу(ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок")) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приобретение паев доступно только для внебиржевых сделок.",,,, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.ВидСделки <> ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приобретение паев доступно только при виде сделки ""Покупка"".",,,, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приобретение паев доступно только для рынка ""Паи"".",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// т.к. по документу используется сводная форма в журнале
	РаботаСЖурналамиОпераций.ПередЗаписьюДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью

Процедура ПередУдалением(Отказ)
	
	// заполнение доп. свойств объекта перед удалением, т.к
	// в дальнейшем происходит обращение к доп. св-вам ЭтоНовый и ПредЗначенияРеквизитовШапки
	// при устанвке блокровки ЖурналОперацийБэкОфиса
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	РаботаСЖурналамиОпераций.ПередУдалениемДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

Функция ЭтоПогашениеПаев()
	
	Если ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Паи 
	 ИЛИ ЭтотОбъект.ВидСделки <> Перечисления.ВидыСделок.Продажа Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЦенныеБумаги",	ЭтотОбъект.ЦенныеБумаги.ВыгрузитьКолонку("ЦеннаяБумага"));
	Запрос.УстановитьПараметр("Период",			ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Контрагент",		ЭтотОбъект.Контрагент);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Паи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Паи КАК Паи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО Паи.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|ГДЕ
		|	Паи.Ссылка В(&ЦенныеБумаги)
		|	И РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо = &Контрагент";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
