Процедура УстановитьСтатусПлатежногоПоручения(Организация, ПлатежноеПоручение, НовыйСтатус, Период = Неопределено, Отказ = Ложь) Экспорт
	
	Попытка
		
		Блокировка				= Новый БлокировкаДанных;
		ЭлементБлокировки		= Блокировка.Добавить(Метаданные.РегистрыСведений.СтатусыИсходящихПлатежныхПоручений.ПолноеИмя());
		ЭлементБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("Организация", 				Организация);
		ЭлементБлокировки.УстановитьЗначение("ПлатежноеПоручениеИсходящее", ПлатежноеПоручение);
		                        
		Блокировка.Заблокировать();

		Период = ?(Период = Неопределено, ТекущаяДатаСеанса(), Период);
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыИсходящихПлатежныхПоручений.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ПлатежноеПоручениеИсходящее = &ПлатежноеПоручение) КАК СтатусыИсходящихПлатежныхПорученийСрезПоследних");
			
		Запрос.УстановитьПараметр("Период",				Период);
		Запрос.УстановитьПараметр("ПлатежноеПоручение", ПлатежноеПоручение);
		Запрос.УстановитьПараметр("Организация", 		Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		// Проверяем текущий статус
		Если Выборка.Следующий() Тогда
			Если Выборка.Статус = НовыйСтатус Тогда
				Возврат;
			ИначеЕсли Выборка.Статус = Перечисления.СтатусыПлатежныхПоручений.Исполнено Или Выборка.Статус = Перечисления.СтатусыПлатежныхПоручений.Отменено Тогда
				// Это конечные статусы, их не меняем
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Запрещено изменять статус '%1' документа %2", Выборка.Статус, ПлатежноеПоручение), ПлатежноеПоручение,,, Отказ);
				Возврат;		
			КонецЕсли;
		КонецЕсли;
				
		МенеджерЗаписи								= РегистрыСведений.СтатусыИсходящихПлатежныхПоручений.СоздатьМенеджерЗаписи();
	    МенеджерЗаписи.Период						= Период;
		МенеджерЗаписи.Организация					= Организация;
		МенеджерЗаписи.ПлатежноеПоручениеИсходящее	= ПлатежноеПоручение;
		МенеджерЗаписи.Статус						= НовыйСтатус;
		
		МенеджерЗаписи.Записать(Истина);
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;	
		
КонецПроцедуры