Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	// Получение списка проводок вынесено в модуль менеджера
	НаборПроводок = Документы.АктПриемаПередачиОбъектовНедвижимости.ПодготовитьНаборПроводок(
		ЭтотОбъект.Ссылка, 
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйРегистр, 
		Отказ);
				
	Если Отказ ИЛИ НаборПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗПроводок = НаборПроводок.Выгрузить();
	ТЗПроводок.ЗаполнитьЗначения(ЭтотОбъект.Ссылка, "Регистратор");
	Движения[УчетныйРегистр].Загрузить(ТЗПроводок);  

КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Движения.УсловияСделокСНедвижимостью.Записывать = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Дата КАК Период,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Организация КАК Организация,
		|	УсловияСделокСНедвижимостьюСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Основание,
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК ПлановаяДатаПередачи,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Сумма КАК Сумма,
		|	УсловияСделокСНедвижимостьюСрезПоследних.СтавкаНДС КАК СтавкаНДС,
		|	УсловияСделокСНедвижимостьюСрезПоследних.СуммаНДС КАК СуммаНДС,
		|	&Ссылка КАК СведенияОГосРегистрацииПраваСобственности,
		|	УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи КАК АктПриемаПередачи,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Отменено КАК Отменено
		|ИЗ
		|	Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|				&МоментВремени,
		|				Основание = &Основание
		|					И ОбъектНедвижимости В
		|						(ВЫБРАТЬ
		|							СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|						ИЗ
		|							Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
		|						ГДЕ
		|							СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка = &Ссылка)) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ПО СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости
		|ГДЕ
		|	СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ЭтотОбъект.МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.УсловияСделокСНедвижимостью.Загрузить(РезультатЗапроса.Выгрузить());
	
	Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		Документы.АктПриемаПередачиОбъектовНедвижимости.ОтразитьНДСНаРегистрахБэкОФиса(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		
		ЭтотОбъект.Дата = ТекущаяДата();
		ЭтотОбъект.СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления; 
		ЭтотОбъект.Основание = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК ПлановаяДатаПередачи
			|ИЗ
			|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|			&ТекущаяДата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Основание = &Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|ГДЕ
			|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
			|	И УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности = ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.)";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ТекущаяДата", ЭтотОбъект.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Строка = ЭтотОбъект.ОбъектыНедвижимости.Добавить();
			Строка.ОбъектНедвижимости  = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОбъектыДокумента.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	_ОбъектыДокумента.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ _ПоДокументу
			|ИЗ
			|	&ОбъектыДокумента КАК _ОбъектыДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПоДокументу.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПоДокументу.НомерСтроки) КАК КоличествоСтрок,
			|	МИНИМУМ(ЕСТЬNULL(СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка, ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.))) КАК ДругаяРегистрацияСобственности,
			|	МИНИМУМ(_ПоДокументу.НомерСтроки) КАК ПерваяСтрока
			|ПОМЕСТИТЬ _ОшибкиДокумента
			|ИЗ
			|	_ПоДокументу КАК _ПоДокументу
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
			|		ПО _ПоДокументу.ОбъектНедвижимости = СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка <> &Ссылка)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Основание = &Основание)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Организация = &Организация)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Дата <= &Дата)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ПоДокументу.ОбъектНедвижимости
			|
			|ИМЕЮЩИЕ
			|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПоДокументу.НомерСтроки) > 1
			|		ИЛИ МИНИМУМ(СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка) ЕСТЬ НЕ NULL )
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОшибкиДокумента.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	_ОшибкиДокумента.КоличествоСтрок КАК КоличествоСтрок,
			|	_ОшибкиДокумента.ДругаяРегистрацияСобственности КАК ДругаяРегистрацияСобственности,
			|	_ОшибкиДокумента.ПерваяСтрока КАК ПерваяСтрока,
			|	СведенияОРегистрацииПраваСобственности.Представление КАК ПредставлениеРегистрацииСобственности,
			|	СправочникОбъектыНедвижимости.Представление КАК ПредставлениеОбъекта
			|ИЗ
			|	_ОшибкиДокумента КАК _ОшибкиДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыНедвижимости КАК СправочникОбъектыНедвижимости
			|		ПО _ОшибкиДокумента.ОбъектНедвижимости = СправочникОбъектыНедвижимости.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности КАК СведенияОРегистрацииПраваСобственности
			|		ПО _ОшибкиДокумента.ДругаяРегистрацияСобственности = СведенияОРегистрацииПраваСобственности.Ссылка";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ОбъектыДокумента", ЭтотОбъект.ОбъектыНедвижимости.Выгрузить(,"ОбъектНедвижимости, НомерСтроки"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.КоличествоСтрок > 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект """ + ВыборкаДетальныеЗаписи.ПредставлениеОбъекта 
					+ """, указанный в строке " + ВыборкаДетальныеЗаписи.ПерваяСтрока + " встречается в документе несколько раз!", 
					ЭтотОбъект, "ОбъектыНедвижимости[" + (ВыборкаДетальныеЗаписи.ПерваяСтрока - 1) + "].ОбъектНедвижимости", ,Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДругаяРегистрацияСобственности) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта """ + ВыборкаДетальныеЗаписи.ПредставлениеОбъекта 
					+ """, указанного в строке " + ВыборкаДетальныеЗаписи.ПерваяСтрока 
					+ " ранее уже было зарегистрировано право собственности (" + ВыборкаДетальныеЗаписи.ПредставлениеРегистрацииСобственности + ")!", 
					ЭтотОбъект, "ОбъектыНедвижимости[" + (ВыборкаДетальныеЗаписи.ПерваяСтрока - 1) + "].ОбъектНедвижимости", ,Отказ);
			КонецЕсли;
				
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

Процедура ПередУдалением(Отказ)
	
	// заполнение доп. свойств объекта перед удалением, т.к
	// в дальнейшем происходит обращение к доп. св-вам ЭтоНовый и ПредЗначенияРеквизитовШапки
	// при устанвке блокровки ЖурналОперацийБэкОфиса
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	РаботаСЖурналамиОпераций.ПередУдалениемДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения
#КонецОбласти
