
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		ЭтаФорма.Организация = Параметры.Организация;
	Иначе
		ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли; 
	
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Организация", ЭтаФорма.Организация);
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", КонецДня(ТекущаяДата()));
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые", Ложь);
	
	// для команд, которые были добавлены вручную, откроем видимость только при наличии соответствующих прав,
	// повторим тем самым логику работы 1С с автоматически добавленными командами
	РедактированиеДатЗапретаДоступно = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.ДатыЗапретаРедактирования);
	
	Элементы.Список.КоманднаяПанель.ПодчиненныеЭлементы.СписокСоздать.Видимость            = РедактированиеДатЗапретаДоступно;
	Элементы.Список.КоманднаяПанель.ПодчиненныеЭлементы.СписокИзменитьВыделенные.Видимость = РедактированиеДатЗапретаДоступно;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьПоВидамУчета();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленыДатыЗапретаРедактирования" Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
	
КонецПроцедуры

	
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтображатьБухгалтерскийУчетПриИзменении(Элемент)
	УстановитьВидимостьПоВидамУчета();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНалоговыйУчетПриИзменении(Элемент)
	УстановитьВидимостьПоВидамУчета();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьЕдиныйБухгалтерскийУчетПриИзменении(Элемент)
	УстановитьВидимостьПоВидамУчета();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.СчетаДоверительногоУправления") И ЗначениеЗаполнено(ТекСтрока) Тогда
		ОткрытьФормуНастройки(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОткрытьФормуНастройки(Неопределено);
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.СчетаДоверительногоУправления") И ЗначениеЗаполнено(ТекСтрока) Тогда
		ОткрытьФормуНастройки(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы
 
&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	Если Не Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
	
		ИмяТекущегоЭлемента = Элементы.Список.ТекущийЭлемент.Имя;
		ИмяКолонки = "";
		Если СтрНачинаетсяС(ИмяТекущегоЭлемента, "СписокДатаЗапрета") Тогда
			ИмяКолонки = СтрЗаменить(ИмяТекущегоЭлемента, "СписокДатаЗапрета", "");
		КонецЕсли; 
		
		СчетаДоверительногоУправления = Новый СписокЗначений;
		Для каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
			Если ТипЗнч(ВыделеннаяСтрока) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
				СчетаДоверительногоУправления.Добавить(ВыделеннаяСтрока, , Истина);
			КонецЕсли; 
		КонецЦикла; 
		
		ПараметрыФормы = Новый Структура("Организация, СчетаДоверительногоУправления, ИмяКолонки", ЭтаФорма.Организация, СчетаДоверительногоУправления, ИмяКолонки);
		ОткрытьФормуМодально("РегистрСведений.ДатыЗапретаРедактирования.Форма.УстановкаДатыЗапрета", ПараметрыФормы, ЭтаФорма);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФормуНастройки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьЗакрытые(Команда)
	
	Элементы.СписокКомандаОтобразитьЗакрытые.Пометка =
		Не Элементы.СписокКомандаОтобразитьЗакрытые.Пометка;
		
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые", Элементы.СписокКомандаОтобразитьЗакрытые.Пометка);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьПоВидамУчета()

	Элементы.ГруппаБУ.Видимость  = ОтображатьБухгалтерскийУчет;
	Элементы.ГруппаНУ.Видимость  = ОтображатьНалоговыйУчет;
	Элементы.ГруппаЕПС.Видимость = ОтображатьЕдиныйБухгалтерскийУчет;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(СчетДоверительногоУправления)

	ПараметрыФормы = Новый Структура("Организация, ОтображатьБухгалтерскийУчет, ОтображатьНалоговыйУчет, ОтображатьЕдиныйБухгалтерскийУчет");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЭтаФорма);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);

	ОткрытьФормуМодально("РегистрСведений.ДатыЗапретаРедактирования.Форма.НастройкиДатЗапрета", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

#КонецОбласти 



 