
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
	
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	
	КонецЕсли; 
	
	Для каждого Отбор Из Параметры.Отбор Цикл
	
		Элементы[Отбор.Ключ].Видимость = Ложь;
	
	КонецЦикла;
	
	ПоляГруппировки = "";
	
	Если Параметры.Свойство("Группировка", ПоляГруппировки) Тогда
		
		Список.Группировка.Элементы.Очистить();
		
		МассивГруппировок = СтрРазделить(ПоляГруппировки, ",", Ложь);
		
		Для каждого ИмяПоляГруппировки Из МассивГруппировок Цикл
		
			ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляГруппировки);
				
		КонецЦикла; 
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма")
		И ЭтаФорма.ВладелецФормы.ИмяФормы = "Справочник.Отчеты.Форма.ФормаЭлемента"		
	Тогда	
		ОтчетВладелец = ЭтаФорма.ВладелецФормы.Объект.Ссылка;
	КонецЕсли;		
		
	Если Элементы.Найти("ФормаКомандаЗаполнитьСтандартнымиНастройками") <> Неопределено Тогда 	
		Элементы.ФормаКомандаЗаполнитьСтандартнымиНастройками.Видимость = ЗначениеЗаполнено(ОтчетВладелец);
	КонецЕсли;
	Если Элементы.Найти("ФормаКомандаЗаполнитьИзДругогоОтчета") <> Неопределено Тогда 	
		Элементы.ФормаКомандаЗаполнитьИзДругогоОтчета.Видимость = ЗначениеЗаполнено(ОтчетВладелец);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	Оповестить("УдаленаДоступнаяНастройка", ПараметрыОпопвещения);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	ПараметрыОпопвещения = Новый Структура("Отчет, НастройкаОтчета, НастройкаСчетаДоверительногоУправления, НастройкаПакета");
	ЗаполнитьЗначенияСвойств(ПараметрыОпопвещения, Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСтандартнымиНастройками(Команда)

	Если Вопрос("Текущие доступные настройки будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		УстановитьСтандартныеДоступныеНастройки(ОтчетВладелец);
		
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НазначенияНастроекОтчетов"));	
		
	КонецЕсли; 		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСтандартныеДоступныеНастройки(Отчет)
	
	Справочники.Отчеты.УстановитьСтандартныеДоступныеНастройки(Отчет);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИзДругогоОтчета(Команда)

	Если Вопрос("Текущие доступные настройки будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ОтчетИсточник = Неопределено;
		
		Если ВвестиЗначение(ОтчетИсточник, "Выберите отчет для копирования доступных настроек", Тип("СправочникСсылка.Отчеты")) Тогда
		
			СкопироватьДоступныеНастройки(ОтчетВладелец, ОтчетИсточник);
			
			ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НазначенияНастроекОтчетов"));
			
		КонецЕсли;
		
	КонецЕсли; 		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьДоступныеНастройки(Отчет, ОтчетИсточник)
	
	Справочники.Отчеты.СкопироватьДоступныеНастройки(Отчет, ОтчетИсточник);	
	
КонецПроцедуры