
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетДоходности
		ИЛИ ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетПроцентнойСтавки
		ИЛИ ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетРезервовПИФ
		ИЛИ ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетНадбавокИСкидокПаевыхИнвестиционныхФондов
	Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВалютаРасчета"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Составляющие.Периодичность"));
	КонецЕсли;
	
	Если ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетДоходности Тогда
		
		// Ключевая ставка и фиксированная ставка могут быть либо одни, либо вдвоем
		
		Если ЭтотОбъект.Составляющие.Найти(Справочники.БазыРасчета.КлючеваяСтавкаЦБРФ, "БазаРасчета") <> Неопределено
			ИЛИ ЭтотОбъект.Составляющие.Найти(Справочники.БазыРасчета.ФиксированнаяСтавка, "БазаРасчета") <> Неопределено
		Тогда
		
			Если ЭтотОбъект.Составляющие.Количество() > 1 Тогда
				
				МассивКлючевыхСтавок = Новый Массив();
				МассивКлючевыхСтавок.Добавить(Справочники.БазыРасчета.КлючеваяСтавкаЦБРФ);
				МассивКлючевыхСтавок.Добавить(Справочники.БазыРасчета.ИндексПотребительскихЦен);
				
				ПроверкаПройдена = ЭтотОбъект.Составляющие.Количество() = 1
					ИЛИ ЭтотОбъект.Составляющие.Количество() = 2
						И (МассивКлючевыхСтавок.Найти(ЭтотОбъект.Составляющие[0].БазаРасчета) <> Неопределено
								И ЭтотОбъект.Составляющие[1].БазаРасчета = Справочники.БазыРасчета.ФиксированнаяСтавка
							ИЛИ ЭтотОбъект.Составляющие[0].БазаРасчета = Справочники.БазыРасчета.ФиксированнаяСтавка 
								И МассивКлючевыхСтавок.Найти(ЭтотОбъект.Составляющие[1].БазаРасчета) <> Неопределено);

				Если Не ПроверкаПройдена Тогда	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка расчета может состоять только из одной базы расчета ""Фиксированная ставка"" и ""Ключевая ставка ЦБ РФ""(или ИПЦ), либо из их объединения!", ЭтотОбъект, , , Отказ);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;	
		
	ИначеЕсли ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетПроцентнойСтавки Тогда
		
		// Фиксированная ставка может быть только одна
		
		Если ЭтотОбъект.Составляющие.НайтиСтроки(Новый Структура("БазаРасчета", Справочники.БазыРасчета.ФиксированнаяСтавка)).Количество() > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка расчета может состоять только из одной базы расчета ""Фиксированная ставка""!", ЭтотОбъект, , , Отказ);
		КонецЕсли;	
		
	ИначеЕсли ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетРезервовПИФ Тогда
		
		// Расчет резервов ПИФ возможен только по одной составляющей
		Если ЭтотОбъект.Составляющие.Количество() > 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка расчета резерва ПИФ может иметь только одну составляющую", ЭтотОбъект, , , Отказ);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ВидРасчета <> Перечисления.ВидыРасчета.РасчетВознагражденияУправляющего И Не ЭтотОбъект.ЭтоНовый() Тогда
		Если ОбщегоНазначения.ОбъектИспользуетсяВБазеДанных(ЭтотОбъект.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка расчета используется в объектах базы данных, изменение недоступно.", ЭтотОбъект, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Убираем мусорные данные
	
	Если ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетДоходности
		ИЛИ ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетПроцентнойСтавки
		ИЛИ ЭтотОбъект.ВидРасчета = Перечисления.ВидыРасчета.РасчетНадбавокИСкидокПаевыхИнвестиционныхФондов
	Тогда
		ЭтотОбъект.ВалютаРасчета = Неопределено;
		
		Для Каждого СтрокаСоставляющие Из ЭтотОбъект.Составляющие Цикл
			СтрокаСоставляющие.Периодичность = Неопределено;
		КонецЦикла;
	КонецЕсли;	
	
	// Проверяем корректность данных
	
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбщегоНазначения.ОбъектИспользуетсяВБазеДанных(ЭтотОбъект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка расчета используется в объектах базы данных, удаление недоступно", ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры
