
#Область Пакетное_Обновление_Из_Матрих

Процедура АвтоматическоеОбновлениеИзМатрих(ПолучателиОтчета = "", ИмяГруппыОбъектов = Неопределено) Экспорт
	
	Результат = Новый Структура("ИнформацияОбОбновлении, СообщенияОбОшибках, ВнешняяСистема", Неопределено, Новый Массив, Справочники.ВнешниеСистемы.Матрих);
	
	// сначала выполним обновление широкими мазками
	Если ИмяГруппыОбъектов = Неопределено Тогда
		
		Для каждого ИмяГруппыОбъектов Из ПолучитьИменаЗагружаемыхИзМатрихГруппОбъектов() Цикл
			ОбновитьИзМатрих(ИмяГруппыОбъектов, 3, Результат); // группами по 20 объектов
		КонецЦикла;
		
		// оставшиеся "проблемные" объеты попробуем обновить по отдельности
		ОбновитьИзМатрих(, 6, Результат);
		
	Иначе
		
		ИменаЗагружаемыхГруппОбъектов = Новый Массив;
		ИменаЗагружаемыхГруппОбъектов.Добавить(ИмяГруппыОбъектов);
		
		Результат.Вставить("ИменаЗагружаемыхГруппОбъектов", ИменаЗагружаемыхГруппОбъектов);
		
		ОбновитьИзМатрих(ИмяГруппыОбъектов, 3, Результат);
		ОбновитьИзМатрих(ИмяГруппыОбъектов, 6, Результат);
			
	КонецЕсли;
			
	// на указанные адреса отправим оповещение

	Если Не ПустаяСтрока(ПолучателиОтчета) Тогда
		
		ОтчетHTML = СформироватьОтчетОбОбновлении(Результат);
		
		ТемаПисьма = "Обновление нормативно-справочной информации из Матрих";
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОтчета, ТемаПисьма, ОтчетHTML, ТипТекстаПочтовогоСообщения.HTML);
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма,, Истина);
		
	КонецЕсли;	
	
	//оповещения 
	СформироватьОтчетОбОбновленииДляБухгалтерии(Результат.ИнформацияОбОбновлении);
	
	ОтправитьОтчетОЗамещающихОблигациях(Результат.ИнформацияОбОбновлении);
			
КонецПроцедуры // АвтоматическоеОбновлениеИзМатрих

Процедура ОбновитьИзМатрих(ИмяГруппыОбъектов = Неопределено, РежимОбновления, Результат = Неопределено) Экспорт
	
	ИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
	
	ИмпортНСИ.Подразделение = Справочники.Подразделения.ГруппаКомпаний;
	ИмпортНСИ.Язык          = Справочники.Языки.Русский;
	ИмпортНСИ.ГруппаПравил  = "Матрих";
	
	ИмпортНСИ.НеСообщатьОСозданииНовыхОбъектов = Истина;
	ИмпортНСИ.НеСообщатьОбОтсутствииИзменений  = Истина;
	
	Если      РежимОбновления = 0 Тогда // единым списком
		МаксКоличество = 0;
	ИначеЕсли РежимОбновления = 1 Тогда // каждый по отдельности
		МаксКоличество = 1;
	ИначеЕсли РежимОбновления = 2 Тогда // группами по 10 объектов
		МаксКоличество = 10;
	ИначеЕсли РежимОбновления = 3 Тогда // группами по 20 объектов
		МаксКоличество = 20;
	ИначеЕсли РежимОбновления = 4 Тогда // группами по 30 объектов
		МаксКоличество = 30;
	ИначеЕсли РежимОбновления = 5 Тогда // группами по 50 объектов
		МаксКоличество = 50;
	ИначеЕсли РежимОбновления = 6 Тогда // необновленные объекты
		МаксКоличество = 1;
	Иначе
		
		СообщениеОбОшибке = "Режим обновления '" + РежимОбновления + "' не поддерживается";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		
		Если Результат <> Неопределено Тогда
			Результат.СообщенияОбОшибках.Добавить(СообщениеОбОшибке);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если РежимОбновления = 6 Тогда // необновленные объекты
		
		Выборка = ВыбратьОбъектыОбновленныеРанееТекущейДаты(Результат);
		
	Иначе
		
		ИмпортНСИ.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию(ИмяГруппыОбъектов, Ложь, Ложь);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
			|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
			|ИЗ
			|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
			|			,
			|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
			|				И ГруппаОбъектов = &ГруппаОбъектов) КАК КодыВоВнешнихСистемахСрезПоследних";
		
		Запрос.УстановитьПараметр("ГруппаОбъектов", ИмпортНСИ.ГруппаОбъектов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
	КонецЕсли;	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаИмпортируемыеОбъекты = ИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
				
		Если РежимОбновления = 6 Тогда // необновленные объекты
			ИмпортНСИ.ГруппаОбъектов = Выборка.ГруппаОбъектов;
		КонецЕсли;
		
		НоваяСтрокаИмпортируемыеОбъекты.Объект              = Выборка.Объект;
		НоваяСтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = Выборка.Код;
		
		Если МаксКоличество > 0 И ИмпортНСИ.ИмпортируемыеОбъекты.Количество() = МаксКоличество Тогда
			
			Попытка
				ИмпортНСИ.ИмпортироватьДанные(, Результат);
			Исключение
				
				СообщениеОбОшибке = "При импорте данных из Матрих возникла ошибка: " + ОписаниеОшибки();
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
				
				Если Результат <> Неопределено Тогда
					Результат.СообщенияОбОшибках.Добавить(СообщениеОбОшибке);
				КонецЕсли;
				
			КонецПопытки;
			
			ИмпортНСИ.ИмпортируемыеОбъекты.Очистить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмпортНСИ.ИмпортируемыеОбъекты.Количество() > 0 Тогда
		
		Попытка
			ИмпортНСИ.ИмпортироватьДанные(, Результат);
		Исключение
			
			СообщениеОбОшибке = "При импорте данных из Матрих возникла ошибка: " + ОписаниеОшибки();
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			
			Если Результат <> Неопределено Тогда
				Результат.СообщенияОбОшибках.Добавить(СообщениеОбОшибке);
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.ИнформацияОбОбновлении = Неопределено Тогда
			Результат.ИнформацияОбОбновлении = ИмпортНСИ.ИнформацияОбОбновлении;
		Иначе
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ИмпортНСИ.ИнформацияОбОбновлении, Результат.ИнформацияОбОбновлении);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьИзМатрих

Функция ПолучитьИменаЗагружаемыхИзМатрихГруппОбъектов() Экспорт
	
	ИменаГруппОбъектов = Новый Массив;
	
	ИменаГруппОбъектов.Добавить("Лицензии");
	ИменаГруппОбъектов.Добавить("ЮридическиеЛица");
	ИменаГруппОбъектов.Добавить("ФизическиеЛица");
	ИменаГруппОбъектов.Добавить("ПаевыеИнвестиционныеФонды");
	
	ИменаГруппОбъектов.Добавить("Акции");
	ИменаГруппОбъектов.Добавить("Облигации");
	ИменаГруппОбъектов.Добавить("Паи");
	ИменаГруппОбъектов.Добавить("Векселя");
	ИменаГруппОбъектов.Добавить("ДепозитарныеРасписки");
	ИменаГруппОбъектов.Добавить("ИпотечныеСертификатыУчастия");
	ИменаГруппОбъектов.Добавить("ПроизводныеФинансовыеИнструменты");
	ИменаГруппОбъектов.Добавить("ВалютныеПары");
	ИменаГруппОбъектов.Добавить("Товары");
	
	Возврат ИменаГруппОбъектов;
	
КонецФункции // ПолучитьИменаЗагружаемыхИзМатрихГруппОбъектов

Функция ВыбратьОбъектыОбновленныеРанееТекущейДаты(Результат = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Результат = Новый Структура;
	КонецЕсли;
	
	Если НЕ Результат.Свойство("ВнешняяСистема") Тогда	
		Результат.Вставить("ВнешняяСистема", Справочники.ВнешниеСистемы.Матрих);
	КонецЕсли;	
	
	Если НЕ Результат.Свойство("ИменаЗагружаемыхГруппОбъектов") Тогда	
		Результат.Вставить("ИменаЗагружаемыхГруппОбъектов", ПолучитьИменаЗагружаемыхИзМатрихГруппОбъектов());
	КонецЕсли;	
	
	ТекстЗапроса = "";
	
	ШаблонЗапросаКПервойТаблице = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЮрФизЛица.Ссылка КАК Объект
		|ПОМЕСТИТЬ _ОбъектыОбновляемыеИзВнешнейСистемы
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица";
	
	ШаблонЗапросаКПоследующимТаблицам =
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЮрФизЛица.Ссылка КАК Объект
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица";
	
	Для каждого ИмяГруппыОбъектов Из Результат.ИменаЗагружаемыхГруппОбъектов Цикл
		
		Если      ИмяГруппыОбъектов = "ЮридическиеЛица" Тогда
			ИмяТаблицы = "ЮрФизЛица";
		ИначеЕсли ИмяГруппыОбъектов = "ФизическиеЛица" Тогда
			Продолжить;
		Иначе
			ИмяТаблицы = ИмяГруппыОбъектов;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = СтрЗаменить(ШаблонЗапросаКПервойТаблице, "ЮрФизЛица", ИмяТаблицы);
		Иначе
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ШаблонЗапросаКПоследующимТаблицам, "ЮрФизЛица", ИмяТаблицы);
		КонецЕсли;
		
		УсловияЗапроса = Новый Массив;
		
		Если Метаданные.Справочники[ИмяТаблицы].Иерархический 
		   И Метаданные.Справочники[ИмяТаблицы].ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		   УсловияЗапроса.Добавить("НЕ " + ИмяТаблицы + ".ЭтоГруппа");
		КонецЕсли;
		
		Если Результат.Свойство("ИсключатьОбновленныеРанееПомеченныеНаУдаление") И Результат.ИсключатьОбновленныеРанееПомеченныеНаУдаление Тогда	
			УсловияЗапроса.Добавить("НЕ " + ИмяТаблицы + ".ПометкаУдаления");
		КонецЕсли;
		
		Если УсловияЗапроса.Количество() > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ГДЕ " + Символы.ПС + Символы.Таб + СтрСоединить(УсловияЗапроса, Символы.ПС + Символы.Таб + "И ");
		КонецЕсли;
			
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса +
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбъектыОбновляемыеИзВнешнейСистемы.Объект КАК Объект,
		|	ТИПЗНАЧЕНИЯ(_ОбъектыОбновляемыеИзВнешнейСистемы.Объект) КАК ТипОбъекта,
		|	_КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов,
		|	_КодыВоВнешнихСистемахСрезПоследних.Код КАК Код,
		|	ОбновленияОбъектовИзВнешнихСистем.ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	_ОбъектыОбновляемыеИзВнешнейСистемы КАК _ОбъектыОбновляемыеИзВнешнейСистемы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(, ВнешняяСистема = &ВнешняяСистема) КАК _КодыВоВнешнихСистемахСрезПоследних
		|		ПО _ОбъектыОбновляемыеИзВнешнейСистемы.Объект = _КодыВоВнешнихСистемахСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбновленияОбъектовИзВнешнихСистем КАК ОбновленияОбъектовИзВнешнихСистем
		|		ПО _ОбъектыОбновляемыеИзВнешнейСистемы.Объект = ОбновленияОбъектовИзВнешнихСистем.Объект
		|			И ОбновленияОбъектовИзВнешнихСистем.ВнешняяСистема = &ВнешняяСистема
		|ГДЕ
		|	ЕСТЬNULL(ОбновленияОбъектовИзВнешнихСистем.ДатаОбновления, ДАТАВРЕМЯ(1, 1, 1)) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("ВнешняяСистема", Результат.ВнешняяСистема);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции // ВыбратьОбъектыОбновленныеРанееТекущейДаты

Функция СформироватьОтчетОбОбновлении(Результат) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	ВыводитьДетали = Результат.ИнформацияОбОбновлении <> Неопределено;
	
	Макет								= ПолучитьМакет("Отчет");
	ОбластьЗаголовок					= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокОбновлено			= Макет.ПолучитьОбласть("ЗаголовокОбновлено");
	ОбластьСтрокаОбновлено				= Макет.ПолучитьОбласть("СтрокаОбновлено");
	ОбластьПодвалОбновлено				= Макет.ПолучитьОбласть("ПодвалОбновлено");
	ОбластьЗаголовокОшибки				= Макет.ПолучитьОбласть("ЗаголовокОшибки");
	ОбластьСтрокаОшибки					= Макет.ПолучитьОбласть("СтрокаОшибки");
	ОбластьЗаголовокРанееОбновленные	= Макет.ПолучитьОбласть("ЗаголовокРанееОбновленные");
	ОбластьСтрокаРанееОбновленные		= Макет.ПолучитьОбласть("СтрокаРанееОбновленные");
	ОбластьПодвалРанееОбновленные		= Макет.ПолучитьОбласть("ПодвалРанееОбновленные");
	
	Если ВыводитьДетали Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИнформацияОбОбновлении.Объект КАК Объект,
			|	ИнформацияОбОбновлении.ГруппаОбъектов КАК ГруппаОбъектов,
			|	ИнформацияОбОбновлении.КодВоВнешнейСистеме КАК КодВоВнешнейСистеме,
			|	ИнформацияОбОбновлении.Создан КАК Создан,
			|	ИнформацияОбОбновлении.Обновлен КАК Обновлен,
			|	ИнформацияОбОбновлении.ОписаниеИзменений КАК ОписаниеИзменений
			|ПОМЕСТИТЬ _Данные
			|ИЗ
			|	&ИнформацияОбОбновлении КАК ИнформацияОбОбновлении
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(1) КАК Обработано,
			|	СУММА(ВЫБОР
			|			КОГДА _Данные.Создан
			|					ИЛИ _Данные.Обновлен
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК Обновлено
			|ИЗ
			|	_Данные КАК _Данные
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Данные.Объект КАК Объект,
			|	_Данные.ГруппаОбъектов КАК ГруппаОбъектов,
			|	_Данные.КодВоВнешнейСистеме КАК КодВоВнешнейСистеме,
			|	ВЫБОР
			|		КОГДА _Данные.Создан
			|			ТОГДА ""Создан новый объект""
			|		ИНАЧЕ _Данные.ОписаниеИзменений
			|	КОНЕЦ КАК Описание
			|ИЗ
			|	_Данные КАК _Данные
			|ГДЕ
			|	(_Данные.Создан
			|			ИЛИ _Данные.Обновлен)";		
		
		Запрос.УстановитьПараметр("ИнформацияОбОбновлении", Результат.ИнформацияОбОбновлении);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ОбщиеДанные = РезультатЗапроса[1].Выгрузить()[0];
		Обновленные = РезультатЗапроса[2].Выбрать();
		
		Если Результат.СообщенияОбОшибках.Количество() > 0 Тогда
			РезультатОбновления = "Выполнено с ошибками";
		Иначе
			РезультатОбновления = "Успешно";
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Обработано	= ОбщиеДанные.Обработано;
		ОбластьЗаголовок.Параметры.Обновлено	= ОбщиеДанные.Обновлено;
		
	Иначе
		РезультатОбновления = "Прервано";
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.ДатаОбновления		= ТекущаяДатаСеанса();
	ОбластьЗаголовок.Параметры.РезультатОбновления	= РезультатОбновления;
	ОбластьЗаголовок.Параметры.ВнешняяСистема		= Результат.ВнешняяСистема;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Если ВыводитьДетали Тогда
		
		Если Обновленные.Количество() > 0 Тогда
			
			ТабДок.Вывести(ОбластьЗаголовокОбновлено);
			
			Пока Обновленные.Следующий() Цикл
				ОбластьСтрокаОбновлено.Параметры.Заполнить(Обновленные);
				ТабДок.Вывести(ОбластьСтрокаОбновлено);
			КонецЦикла;
			
			ТабДок.Вывести(ОбластьПодвалОбновлено);
			
		КонецЕсли;
		
		Если Не Результат.Свойство("ИсключитьРанееОбновленныеДанные") Тогда
			
			РанееОбновленные = ВыбратьОбъектыОбновленныеРанееТекущейДаты(Результат);
			
			Если РанееОбновленные.Количество() > 0 Тогда
				
				ОбластьЗаголовокРанееОбновленные.Параметры.Дата = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
				
				ТабДок.Вывести(ОбластьЗаголовокРанееОбновленные);
				
				Пока РанееОбновленные.Следующий() Цикл
					ОбластьСтрокаРанееОбновленные.Параметры.Заполнить(РанееОбновленные);
					ТабДок.Вывести(ОбластьСтрокаРанееОбновленные);
				КонецЦикла;
				
				ТабДок.Вывести(ОбластьПодвалРанееОбновленные);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат.СообщенияОбОшибках.Количество() > 0 Тогда
		
		ТабДок.Вывести(ОбластьЗаголовокОшибки);
		
		РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(Результат.СообщенияОбОшибках);
		
		Для Каждого Ошибка Из Результат.СообщенияОбОшибках Цикл
			ОбластьСтрокаОшибки.Параметры.СообщениеОбОшибке = Ошибка;
			ТабДок.Вывести(ОбластьСтрокаОшибки);
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
	
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
	
	ТелоПисьма = Новый ТекстовыйДокумент;
	ТелоПисьма.Прочитать(ИмяВременногоФайла);
	
	Текст = ТелоПисьма.ПолучитьТекст();
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Текст;
	
КонецФункции

Функция СоздатьТаблицуКонтролируемыхРеквизитов()
	
	ТаблицаКонтролируемыхРеквизитов = Новый ТаблицаЗначений;
	
	ТаблицаКонтролируемыхРеквизитов.Колонки.Добавить("ТипОбъекта");
	ТаблицаКонтролируемыхРеквизитов.Колонки.Добавить("НаименованиеОбъекта");
	ТаблицаКонтролируемыхРеквизитов.Колонки.Добавить("Синоним");
	ТаблицаКонтролируемыхРеквизитов.Колонки.Добавить("Реквизит");
	
	НоваяСтрока = ТаблицаКонтролируемыхРеквизитов.Добавить();
	НоваяСтрока.ТипОбъекта 			= "Справочник";
	НоваяСтрока.НаименованиеОбъекта = "Облигации";
	НоваяСтрока.Синоним 			= "Облигации";
	НоваяСтрока.Реквизит 			= "ДатаПогашения";
	
	НоваяСтрока = ТаблицаКонтролируемыхРеквизитов.Добавить();
	НоваяСтрока.ТипОбъекта 			= "РегистрСведений";
	НоваяСтрока.НаименованиеОбъекта = "КупонныйДоходПоОблигациям";
	НоваяСтрока.Синоним 			= "Купонный доход по облигациям";
	НоваяСтрока.Реквизит 			= "СтавкаКупона";
	
	НоваяСтрока = ТаблицаКонтролируемыхРеквизитов.Добавить();
	НоваяСтрока.ТипОбъекта 			= "РегистрСведений";
	НоваяСтрока.НаименованиеОбъекта = "КупонныйДоходПоОблигациям";
	НоваяСтрока.Синоним 			= "Купонный доход по облигациям";
	НоваяСтрока.Реквизит 			= "ДатаПубликации";	
	
	ПоляУсловияОферты = "ДатаВыкупа,ТолькоДляФизическихЛиц,ЦенаПроцент,Цена,АкцептС,АкцептПо,ОписаниеУсловий,ТипОферты,ДатаОбъявления";
	МассивПоля = СтрРазделить(ПоляУсловияОферты, ",");
	
	Для Каждого Элемент из МассивПоля Цикл 		
		НоваяСтрока = ТаблицаКонтролируемыхРеквизитов.Добавить();
		НоваяСтрока.ТипОбъекта 			= "РегистрСведений";
		НоваяСтрока.НаименованиеОбъекта = "УсловияОферт";
		НоваяСтрока.Синоним 			= "Условия оферт";
		НоваяСтрока.Реквизит 			= Элемент;
	КонецЦикла;
	
	Возврат ТаблицаКонтролируемыхРеквизитов;
	
КонецФункции	

Процедура СформироватьОтчетОбОбновленииДляБухгалтерии(ИнформацияОбОбновлении) 	Экспорт 
	// оповещаем бухгалтерию об изменениях, которые ее интересуют
	ТаблицаКонтролируемыхРеквизитов = СоздатьТаблицуКонтролируемыхРеквизитов();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнформацияОбОбновлении.Объект КАК Объект,
	|	ИнформацияОбОбновлении.ГруппаОбъектов КАК ГруппаОбъектов,
	|	ИнформацияОбОбновлении.КодВоВнешнейСистеме КАК КодВоВнешнейСистеме,
	|	ИнформацияОбОбновлении.Создан КАК Создан,
	|	ИнформацияОбОбновлении.Обновлен КАК Обновлен,
	|	ИнформацияОбОбновлении.ОписаниеИзменений КАК ОписаниеИзменений
	|ПОМЕСТИТЬ _Данные
	|ИЗ
	|	&ИнформацияОбОбновлении КАК ИнформацияОбОбновлении
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиЦенныхБумагОстатки.Организация КАК Организация,
	|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) КАК КоличествоВНаличии,
	|	0 КАК КоличествоКПередаче,
	|	0 КАК КоличествоКПолучению,
	|	0 КАК КоличествоВРЕПО
	|ПОМЕСТИТЬ _Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация В (&Организации)
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_Данные.Объект КАК Объект
	|					ИЗ
	|						_Данные КАК _Данные)) КАК ОстаткиЦенныхБумагОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадолженностиПоЦеннымБумагамОстатки.Организация,
	|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления,
	|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага,
	|	0,
	|	ВЫБОР
	|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|			ТОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|			ТОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
	|			&Период,
	|			Организация В (&Организации)
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_Данные.Объект КАК Объект
	|					ИЗ
	|						_Данные КАК _Данные)) КАК ЗадолженностиПоЦеннымБумагамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&Период, Организация В (&Организации)) КАК УсловияСделокСрезПоследних
	|		ПО ЗадолженностиПоЦеннымБумагамОстатки.Основание = УсловияСделокСрезПоследних.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&Период, Организация В (&Организации)) КАК УсловияСделокРепоСрезПоследних
	|		ПО ЗадолженностиПоЦеннымБумагамОстатки.Основание = УсловияСделокРепоСрезПоследних.СделкаРЕПО
	|			И (УсловияСделокРепоСрезПоследних.ЧастьСделкиРЕПО = 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадолженностиПоВторойЧастиРЕПООстатки.Организация,
	|	ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления,
	|	ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток, 0)
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
	|			&Период,
	|			Организация В (&Организации)
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_Данные.Объект КАК Объект
	|					ИЗ
	|						_Данные КАК _Данные)) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&Период, Организация В (&Организации)) КАК УсловияСделокРЕПОСрезПоследних
	|		ПО ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
	|			И (УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Остатки.Организация КАК Организация,
	|	_Остатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Остатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	СУММА(_Остатки.КоличествоВНаличии) КАК КоличествоВНаличии,
	|	СУММА(_Остатки.КоличествоКПередаче) КАК КоличествоКПередаче,
	|	СУММА(_Остатки.КоличествоКПолучению) КАК КоличествоКПолучению,
	|	СУММА(_Остатки.КоличествоВРЕПО) КАК КоличествоВРЕПО,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет
	|				И НЕ ДатыЗапретаРедактированияБух.ДатаЗапретаРедактирования ЕСТЬ NULL
	|			ТОГДА ДатыЗапретаРедактированияБух.ДатаЗапретаРедактирования
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаЗапретаРедактированияБух,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет
	|				И НЕ ДатыЗапретаРедактированияНал.ДатаЗапретаРедактирования ЕСТЬ NULL
	|			ТОГДА ДатыЗапретаРедактированияНал.ДатаЗапретаРедактирования
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаЗапретаРедактированияНал,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет
	|				И НЕ ДатыЗапретаРедактированияЕПС.ДатаЗапретаРедактирования ЕСТЬ NULL
	|			ТОГДА ДатыЗапретаРедактированияЕПС.ДатаЗапретаРедактирования
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ДатаЗапретаРедактированияЕПС,
	|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.СчетУчета КАК СчетУчета,
	|	НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаКупонногоДохода КАК ВариантУчетаКупонногоДохода
	|ПОМЕСТИТЬ _ОстаткиСведенияПартий
	|ИЗ
	|	_Остатки КАК _Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|				&Период,
	|				Организация В (&Организации)
	|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
	|		ПО _Остатки.Организация = БухПартииЦенныхБумагОстатки.Организация
	|			И _Остатки.СчетДоверительногоУправления = БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления
	|			И _Остатки.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактированияБух
	|		ПО _Остатки.Организация = ДатыЗапретаРедактированияБух.Организация
	|			И _Остатки.СчетДоверительногоУправления = ДатыЗапретаРедактированияБух.СчетДоверительногоУправления
	|			И (ДатыЗапретаРедактированияБух.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет))
	|			И (ДатыЗапретаРедактированияБух.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Проводки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактированияНал
	|		ПО _Остатки.Организация = ДатыЗапретаРедактированияНал.Организация
	|			И _Остатки.СчетДоверительногоУправления = ДатыЗапретаРедактированияНал.СчетДоверительногоУправления
	|			И (ДатыЗапретаРедактированияНал.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет))
	|			И (ДатыЗапретаРедактированияНал.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Проводки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактированияЕПС
	|		ПО _Остатки.Организация = ДатыЗапретаРедактированияЕПС.Организация
	|			И _Остатки.СчетДоверительногоУправления = ДатыЗапретаРедактированияЕПС.СчетДоверительногоУправления
	|			И (ДатыЗапретаРедактированияЕПС.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
	|			И (ДатыЗапретаРедактированияЕПС.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Проводки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&Период, ) КАК НастройкиУчетаОбщиеСрезПоследних
	|		ПО _Остатки.Организация = НастройкиУчетаОбщиеСрезПоследних.Организация
	|			И _Остатки.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
	|
	|СГРУППИРОВАТЬ ПО
	|	_Остатки.СчетДоверительногоУправления,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет
	|				И НЕ ДатыЗапретаРедактированияБух.ДатаЗапретаРедактирования ЕСТЬ NULL
	|			ТОГДА ДатыЗапретаРедактированияБух.ДатаЗапретаРедактирования
	|		ИНАЧЕ ""-""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет
	|				И НЕ ДатыЗапретаРедактированияНал.ДатаЗапретаРедактирования ЕСТЬ NULL
	|			ТОГДА ДатыЗапретаРедактированияНал.ДатаЗапретаРедактирования
	|		ИНАЧЕ ""-""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет
	|				И НЕ ДатыЗапретаРедактированияЕПС.ДатаЗапретаРедактирования ЕСТЬ NULL
	|			ТОГДА ДатыЗапретаРедактированияЕПС.ДатаЗапретаРедактирования
	|		ИНАЧЕ ""-""
	|	КОНЕЦ,
	|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.СчетУчета,
	|	НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаКупонногоДохода,
	|	_Остатки.ЦеннаяБумага,
	|	_Остатки.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(_Остатки.КоличествоВНаличии) <> СУММА(_Остатки.КоличествоВРЕПО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Данные.Объект КАК Объект,
	|	_Данные.ОписаниеИзменений КАК ОписаниеИзменений,
	|	_ОстаткиСведенияПартий.Организация КАК Организация,
	|	_ОстаткиСведенияПартий.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ОстаткиСведенияПартий.КоличествоВНаличии КАК КоличествоВНаличии,
	|	_ОстаткиСведенияПартий.КоличествоКПередаче КАК КоличествоКПередаче,
	|	_ОстаткиСведенияПартий.КоличествоКПолучению КАК КоличествоКПолучению,
	|	_ОстаткиСведенияПартий.ДатаЗапретаРедактированияБух КАК ДатаЗапретаРедактированияБух,
	|	_ОстаткиСведенияПартий.ДатаЗапретаРедактированияНал КАК ДатаЗапретаРедактированияНал,
	|	_ОстаткиСведенияПартий.ДатаЗапретаРедактированияЕПС КАК ДатаЗапретаРедактированияЕПС,
	|	_ОстаткиСведенияПартий.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА _ОстаткиСведенияПартий.СчетУчета В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыделятьКрасным,
	|	_ОстаткиСведенияПартий.ВариантУчетаКупонногоДохода КАК ВариантУчетаКупонногоДохода
	|ИЗ
	|	_ОстаткиСведенияПартий КАК _ОстаткиСведенияПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Данные КАК _Данные
	|		ПО (_Данные.Объект = _ОстаткиСведенияПартий.ЦеннаяБумага)
	|ИТОГИ ПО
	|	Организация,
	|	Объект";	
		
	ДатаОтчета = ТекущаяДатаСеанса();
	
	Запрос.УстановитьПараметр("ИнформацияОбОбновлении", ИнформацияОбОбновлении);
	Запрос.УстановитьПараметр("Период", ДатаОтчета);
	
	СписокОрганизаций = Новый Массив;
	СписокОрганизаций.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	СписокОрганизаций.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	
	Запрос.УстановитьПараметр("Организации", СписокОрганизаций);
	
	ТаблицаДатыПубликаций = ПолучитьТаблицуДатыПубликаций(ИнформацияОбОбновлении);	
	
	//<p align="left">Текст</p>
	
	СтрокаИзмененийКупон = "<tr><td><p align=""left"">%1</p></td>
	|<td><p align=""right"">%2</p></td>
	|<td><p align=""right"">%3</p></td>
	|<td><p align=""center"">%4</p></td>
	|<td><p align=""center"">%5</p></td></tr>";
	СтрокаИзмененийПрочее = "<tr><td><p align=""left"">%1</p></td>
	|<td><p align=""right"">%2</p></td>
	|<td><p align=""right"">%3</p></td></tr>";	
	СтрокаОстатков  = "<tr><td><p align=""left"">%1</p></td>
	|<td><p align=""right"">%2</p></td>
	|<td><p align=""right"">%3</p></td>
	|<td><p align=""right"">%4</p></td>	
	|<td><p align=""center"">%5</p></td>
	|<td><p align=""center"">%6</p></td>
	|<td><p align=""center"">%7</p></td>
	|<td><p align=""right"">%8</p></td>
	|<td><p align=""right"">%9</p></td></tr>";
		
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока  ВыборкаОрганизации.Следующий() Цикл 
		
		ТекстПисьма = "<html><body><p><b>Отчет об обновлении важных для бухучета реквизитов из Matrix</b></p>";
		ТекстПисьма = ТекстПисьма + "<p>Организация: "+ ВыборкаОрганизации.Организация + "</p>";
		ТекстПисьма = ТекстПисьма + "<p>Дата и время формирования отчета: "+ ТекущаяДатаСеанса() + "</p>";
		
		ЕстьИзменения = Ложь;
		Выборка = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл 		
			
			ТаблицаИзменений = Новый ТаблицаЗначений;
			//проверка отслеживаемых изменений
			ВыборкаДетали = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);		
			Если ВыборкаДетали.Следующий() Тогда  
				ТаблицаИзменений = СформироватьТаблицуИзменений(Выборка.Объект, ТаблицаКонтролируемыхРеквизитов, ВыборкаДетали.ОписаниеИзменений, ТаблицаДатыПубликаций);	
			КонецЕсли;
			
			Если ТаблицаИзменений.Количество() > 0 Тогда //есть отслеживаемые изменения 
				
				ТекстПисьма = ТекстПисьма + "<br><p><font color = ""blue"">Ценная бумага: "+ ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Выборка.Объект) + "</font></p>";
				
				//первый проход. изменение ставки купона 
				Отбор = Новый Структура("Реквизит", "Купонный доход по облигациям: СтавкаКупона");
				НайденныеСтроки = ТаблицаИзменений.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда 
					ТекстПисьма = ТекстПисьма + "<p><b>Изменение ставки купона</b></p>";
					ТекстПисьма = ТекстПисьма + "<table border = 1>";
					ТекстПисьма = ТекстПисьма + СтрШаблон(СтрокаИзмененийКупон, "Реквизит", "Старое<br>значение", "Новое<br>значение", "Дата начала<br>купонного периода", "Дата<br>публикации"); 
					
					Для Каждого СтрокаТаблицы из НайденныеСтроки Цикл 
						ТекстПисьма = ТекстПисьма + СтрШаблон(СтрокаИзмененийКупон, СтрокаТаблицы.Реквизит, СтрокаТаблицы.СтароеЗначение, СтрокаТаблицы.НовоеЗначение, СтрокаТаблицы.Дата, СтрокаТаблицы.ДатаПубликации);				
						ТаблицаИзменений.Удалить(СтрокаТаблицы);	
					КонецЦикла;	
					ТекстПисьма = ТекстПисьма + "</table>";
				КонецЕсли;
				
				//второй проход. прочие изменения 
				Если ТаблицаИзменений.Количество() > 0 Тогда 
					ТекстПисьма = ТекстПисьма + "<p><b>Прочие изменения</b></p>";
					ТекстПисьма = ТекстПисьма + "<table border = 1>";
					ТекстПисьма = ТекстПисьма + СтрШаблон(СтрокаИзмененийПрочее, "Реквизит", "Старое<br>значение", "Новое<br>значение"); 
					
					Для Каждого СтрокаТаблицы из ТаблицаИзменений Цикл 
						ТекстПисьма = ТекстПисьма + СтрШаблон(СтрокаИзмененийПрочее, СтрокаТаблицы.Реквизит, СтрокаТаблицы.СтароеЗначение, СтрокаТаблицы.НовоеЗначение);
					КонецЦикла;	
					ТекстПисьма = ТекстПисьма + "</table>";
				КонецЕсли;
				
				//остатки
				ТекстПисьма = ТекстПисьма + "<p><b>Сведения об остатках</b></p>";
				ТекстПисьма = ТекстПисьма + "<table border = 1>";
				ТекстПисьма = ТекстПисьма + СтрШаблон(СтрокаОстатков, "Счет доверительного управления", "Остаток", "К получению", "К передаче", "Дата проводок<br>РСБУ", "Дата проводок<br>НУ", "Дата проводок<br>ЕПС", "Счет учета ЕПС", "Вариант учета<br>купонного дохода");
				
				ВыборкаДетали.Сбросить();
				Пока ВыборкаДетали.Следующий() Цикл 
					Если ВыборкаДетали.ВыделятьКрасным Тогда 
						СчетУчета = "<font color = ""red"">" + ВыборкаДетали.СчетУчета + "</font>";
					Иначе	
						СчетУчета = СокрЛП(ВыборкаДетали.СчетУчета);
					КонецЕсли;	
					Попытка
						ТекстПисьма = ТекстПисьма + СтрШаблон(СтрокаОстатков, ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(ВыборкаДетали.СчетДоверительногоУправления), ВыборкаДетали.КоличествоВНаличии, ВыборкаДетали.КоличествоКПолучению, ВыборкаДетали.КоличествоКПередаче, Формат(ВыборкаДетали.ДатаЗапретаРедактированияБух, "ДФ=dd.MM.yyyy"), Формат(ВыборкаДетали.ДатаЗапретаРедактированияНал, "ДФ=dd.MM.yyyy"), Формат(ВыборкаДетали.ДатаЗапретаРедактированияЕПС, "ДФ=dd.MM.yyyy"), СчетУчета, ВыборкаДетали.ВариантУчетаКупонногоДохода);		
					Исключение
						ТекстПисьма = ТекстПисьма + СтрШаблон(СтрокаОстатков, ВыборкаДетали.СчетДоверительногоУправления, ВыборкаДетали.КоличествоВНаличии, ВыборкаДетали.КоличествоКПолучению, ВыборкаДетали.КоличествоКПередаче, Формат(ВыборкаДетали.ДатаЗапретаРедактированияБух, "ДФ=dd.MM.yyyy"), Формат(ВыборкаДетали.ДатаЗапретаРедактированияНал, "ДФ=dd.MM.yyyy"), Формат(ВыборкаДетали.ДатаЗапретаРедактированияЕПС, "ДФ=dd.MM.yyyy"), СчетУчета, ВыборкаДетали.ВариантУчетаКупонногоДохода);		
					КонецПопытки;
				КонецЦикла;
				ТекстПисьма = ТекстПисьма + "</table>";
				
				ЕстьИзменения = Истина;
			КонецЕсли;	
		КонецЦикла;	
		ТекстПисьма = ТекстПисьма + "</body></html>";
		
		Если ЕстьИзменения Тогда 
			ТемаПисьма = "Отчет об обновлении важных для бухгалтерии реквизитов из Matrix";	
			РеквизитыОповещения = Новый Структура("Тема, Текст, Организация", 
			ТемаПисьма, 
			ТекстПисьма, 
			ВыборкаОрганизации.Организация);
			
			Справочники.Оповещения.СформироватьОповещения("Обработка.ИмпортНормативноСправочнойИнформации.ОповещениеБухгалтерии", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);			
		КонецЕсли;	
		
	КонецЦикла;
			
КонецПроцедуры

Функция СформироватьТаблицуИзменений(ЦеннаяБумага, ТаблицаКонтролируемыхРеквизитов, ОписаниеИзменений, ТаблицаДатыПубликаций)
	
	ТаблицаИзменений = Новый ТаблицаЗначений;
	ТаблицаИзменений.Колонки.Добавить("Реквизит");
	ТаблицаИзменений.Колонки.Добавить("СтароеЗначение");
	ТаблицаИзменений.Колонки.Добавить("НовоеЗначение");
	ТаблицаИзменений.Колонки.Добавить("Дата");	
	ТаблицаИзменений.Колонки.Добавить("ДатаПубликации");	
	
	Синоним = ЦеннаяБумага.Метаданные().Имя;	
	СтрокиТаблицыРеквизитов = ТаблицаКонтролируемыхРеквизитов.НайтиСтроки(Новый Структура("НаименованиеОбъекта", Синоним));
		
	ЧислоСтрок = СтрЧислоСтрок(ОписаниеИзменений);
	Для индекс = 1 по ЧислоСтрок Цикл 
		
		ТекущаяСтрока = СтрПолучитьСтроку(ОписаниеИзменений, индекс);
		Если ПустаяСтрока(ТекущаяСтрока) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ТекущаяСтрока, "Изменены записи регистра сведений ") Тогда 
			Синоним = СтрЗаменить(ТекущаяСтрока, "Изменены записи регистра сведений ", ""); 			 
			СтрокиТаблицыРеквизитов = ТаблицаКонтролируемыхРеквизитов.НайтиСтроки(Новый Структура("Синоним", Синоним)); 
			Продолжить;
		КонецЕсли;	
				
		Если СтрокиТаблицыРеквизитов.Количество() > 0 Тогда 
			Для Каждого СтрокаТаблицы из СтрокиТаблицыРеквизитов Цикл 
				НаименованиеРеквизита = СтрокаТаблицы.Реквизит; 
				Если СтрНачинаетсяС(ТекущаяСтрока, НаименованиеРеквизита + ":") Тогда   // + ":" - предотвращаем задвоение строк, если реквизиты начинаются одинаково. Например, Цена и ЦенаПроцент
					
					НоваяСтрока = ТаблицаИзменений.Добавить();
					НоваяСтрока.Реквизит = Синоним + ": " + НаименованиеРеквизита; 
					
					ПозицияНач = СтрНайти(ТекущаяСтрока, "[",,,1);
					ПозицияКон = СтрНайти(ТекущаяСтрока, "]",,,1);
					НоваяСтрока.СтароеЗначение = Сред(ТекущаяСтрока, ПозицияНач + 1, ПозицияКон - ПозицияНач - 1);
					
					ПозицияНач = СтрНайти(ТекущаяСтрока, "[",,,2);
					ПозицияКон = СтрНайти(ТекущаяСтрока, "]",,,2);
					
					НоваяСтрока.НовоеЗначение = Сред(ТекущаяСтрока, ПозицияНач + 1, ПозицияКон - ПозицияНач - 1);
					
					Если СтрДлина(ТекущаяСтрока) > ПозицияКон Тогда 
						//Это купонный доход по операциям
						
						 // дата купонного периода
						НоваяСтрока.Дата = Сред(ТекущаяСтрока, ПозицияКон + 1, 10);      
						ЛитералДаты = Сред(НоваяСтрока.Дата, 7, 4) + Сред(НоваяСтрока.Дата, 4, 2) + Лев(НоваяСтрока.Дата, 2);
						
						//Дата публикации
						ПараметрыПоиска = Новый Структура("Облигация, Период", ЦеннаяБумага, Дата(ЛитералДаты));
						НайденныеСтроки = ТаблицаДатыПубликаций.НайтиСтроки(ПараметрыПоиска); 
						Если НайденныеСтроки.Количество() > 0 Тогда 
							НоваяСтрока.ДатаПубликации = Формат(НайденныеСтроки[0].ДатаПубликации, "ДФ=dd.MM.yyyy"); 
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	 
			КонецЦикла;	
		КонецЕсли;			 	
	КонецЦикла; 	
	
	Возврат ТаблицаИзменений;
		
КонецФункции	

Функция ПолучитьТаблицуДатыПубликаций(ИнформацияОбОбновлении)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнформацияОбОбновлении.Объект КАК Объект
	|ПОМЕСТИТЬ _Данные
	|ИЗ
	|	&ИнформацияОбОбновлении КАК ИнформацияОбОбновлении
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КупонныйДоходПоОблигациям.Период КАК Период,
	|	КупонныйДоходПоОблигациям.Облигация КАК Облигация,
	|	КупонныйДоходПоОблигациям.СтавкаКупона КАК СтавкаКупона,
	|	КупонныйДоходПоОблигациям.ДатаПубликации КАК ДатаПубликации
	|ИЗ
	|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
	|ГДЕ
	|	КупонныйДоходПоОблигациям.Облигация В
	|			(ВЫБРАТЬ
	|				_Данные.Объект
	|			ИЗ
	|				_Данные
	|			ГДЕ
	|				_Данные.Объект ССЫЛКА Справочник.Облигации)
	|	И КупонныйДоходПоОблигациям.Период >= &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Облигация,
	|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона";
	
	Запрос.УстановитьПараметр("ИнформацияОбОбновлении", ИнформацияОбОбновлении);
	Запрос.УстановитьПараметр("Период", ДобавитьМесяц(ТекущаяДатаСеанса(), -12)); //чтобы гарантировано получить предыдущий период. Изменение ставки может произойти в текущем периода
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

Процедура ОтправитьОтчетОЗамещающихОблигациях(ИзмененныеДанные) Экспорт
	
	Запрос = Новый Запрос;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзмененныеДанные.Объект КАК Объект,
		|	ИзмененныеДанные.ГруппаОбъектов КАК ГруппаОбъектов,
		|	ИзмененныеДанные.КодВоВнешнейСистеме КАК КодВоВнешнейСистеме,
		|	ИзмененныеДанные.Создан КАК Создан,
		|	ИзмененныеДанные.Обновлен КАК Обновлен,
		|	ИзмененныеДанные.ОписаниеИзменений КАК ОписаниеИзменений
		|ПОМЕСТИТЬ _ИзмененныеДанные
		|ИЗ
		|	&ИзмененныеДанные КАК ИзмененныеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИзмененныеДанные.Объект КАК Облигация,
		|	_ИзмененныеДанные.ОписаниеИзменений КАК ОписаниеИзменений,
		|	ОстаткиЦенныхБумагОстатки.Организация КАК Организация,
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	_ИзмененныеДанные КАК _ИзмененныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(&Дата, Организация В (&УК_РЭМ, &УК_Траст)) КАК ОстаткиЦенныхБумагОстатки
		|		ПО _ИзмененныеДанные.Объект = ОстаткиЦенныхБумагОстатки.ЦеннаяБумага
		|ГДЕ
		|	_ИзмененныеДанные.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)
		|	И _ИзмененныеДанные.Объект ССЫЛКА Справочник.Облигации
		|	И ВЫРАЗИТЬ(_ИзмененныеДанные.Объект КАК Справочник.Облигации).Замещающая
		|	И (_ИзмененныеДанные.Создан
		|			ИЛИ _ИзмененныеДанные.ОписаниеИзменений ПОДОБНО ""%Замещающая%"")
		|ИТОГИ ПО
		|	Организация,
		|	Облигация,
		|	СчетДоверительногоУправления";
#КонецОбласти
	
	Запрос.УстановитьПараметр("ИзмененныеДанные", ИзмененныеДанные);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("УК_РЭМ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	Запрос.УстановитьПараметр("УК_Траст", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	
	ГруппировкаПоОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ГруппировкаПоОрганизации.Следующий() Цикл
		
		ОтчетHTML = "<tr class=""top2""><td colspan=""2"">" + ГруппировкаПоОрганизации.Организация + "</td></tr>"; 
		
		ГруппировкаПоОблигации = ГруппировкаПоОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоОблигации.Следующий() Цикл
			
			ОтчетHTML = ОтчетHTML + "<tr class=""top3""><td colspan=""2"">" + ГруппировкаПоОблигации.Облигация + ". &ОписаниеИзменений </td></tr>";
			
			ГруппировкаПоСчетуДоверительногоУправления = ГруппировкаПоОблигации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ГруппировкаПоСчетуДоверительногоУправления.Следующий() Цикл
				
				ДетальныеЗаписи = ГруппировкаПоСчетуДоверительногоУправления.Выбрать();
				
				Пока ДетальныеЗаписи.Следующий() Цикл
					
					Если СтрНайти(ОтчетHTML, "&ОписаниеИзменений") > 0 Тогда
						ОтчетHTML = СтрЗаменить(ОтчетHTML, "&ОписаниеИзменений", ДетальныеЗаписи.ОписаниеИзменений);  	
					КонецЕсли;
					
					ОтчетHTML = ОтчетHTML + "<tr class=""line""><td>" + ДетальныеЗаписи.СчетДоверительногоУправления  + "</td><td>" + ДетальныеЗаписи.КоличествоОстаток  + "</td></tr>";
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОтчетHTML = 
			"<html>
			|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
			|	<style>
			|		body  { font: 10pt sans-serif; }
			|		table { text-align: left; border-spacing: 0; border-collapse: collapse; }
			|		td    { vertical-align: top; border: 1px solid #CCC085; padding: 5px; }
			|		.top  { font-size: 14px; font-weight: 600; background: #F4ECC5; }
			|		.top2 { font-size: 14px; background: #F8F2D8; }
			|		.top3 { font-size: 14px; font-weight: 600; background: #FBF9EC; }
			|		.line { font-size: 12px;}
			|	</style>
			|</head><body>
			|<table cols= ""2"">
			|<tr class=""top""><td colspan=""2"">Облигация</td></tr>
			|<tr class=""top""><td colspan=""2"">Организация</td></tr>
			|<tr class=""top""><td>Счет доверительного управления</td><td>Количество</td></tr>
			|" + ОтчетHTML + "</body></html>";
		
		РеквизитыОповещения = Новый Структура("Тема, Текст, Организация", "Оповещение о замещающих облигациях.", ОтчетHTML, ГруппировкаПоОрганизации.Организация); 
		Справочники.Оповещения.СформироватьОповещения("Обработка.ИмпортНСИ.ОповещениеОЗамещающихОблигациях", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
