
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЗаполнитьСписокВариантов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитов(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьРеквизитов(Форма)

	Отчет		= Форма.Отчет;
	Элементы	= Форма.Элементы;

	Элементы.Валюта.Видимость = (Отчет.ВариантОтчета = "ВалютныеПортфелиФЛ");
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	
	ВидимостьРеквизитов(ЭтаФорма);	
	
КонецПроцедуры
	
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ПроверкаЗаполнения() Тогда
		ПараметрыОтчета = Новый Структура("Организация, СчетДоверительногоУправления, Период, Валюта");
		ЗаполнитьЗначенияСвойств(ПараметрыОтчета, Отчет);
		
		ФормаОтчета = ПолучитьФорму("ВнешнийОтчет._РасчетДоходностиExcel.Форма." + Отчет.ВариантОтчета, ПараметрыОтчета);
		Если ФормаОтчета <> Неопределено Тогда //контроли прошли
			ФормаОтчета.СформироватьОтчет();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ДополнительныеДействия

&НаСервере
Процедура ЗаполнитьСписокВариантов()
	
	Элементы.ВариантОтчета.СписокВыбора.Очистить();
	
	ОбъектОтчета = РеквизитФормыВЗначение("Отчет");
	
	Для Каждого ФормаОтчета Из ОбъектОтчета.Метаданные().Формы Цикл
		Если ФормаОтчета <> ОбъектОтчета.Метаданные().ОсновнаяФорма Тогда
			Элементы.ВариантОтчета.СписокВыбора.Добавить(ФормаОтчета.Имя, ФормаОтчета.Синоним);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполнения()
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
		ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.ВариантОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Вариант отчета"" не заполнено",,, "Отчет.ВариантОтчета", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Счет доверительного управления"" не заполнено",,, "Отчет.СчетДоверительногоУправления", Отказ);
	КонецЕсли;
	
	Если Отчет.ВариантОтчета = "ВалютныеПортфелиФЛ" И НЕ ЗначениеЗаполнено(Отчет.Валюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Валюта"" не заполнено",,, "Отчет.Валюта", Отказ);
	КонецЕсли;
		
	Возврат НЕ Отказ;
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти




