&НаСервере
Процедура СформироватьСписокРазделовОтчета()
	
	ЭтаФорма.РазделыОтчета.Очистить();
	
	ЭтаФорма.СохраняемыеРазделы = Отчеты.РегламентированныйОтчетОФинансовыхРезультатахРСБУ.СформироватьСписокРазделовОтчета(ЭтаФорма.ИмяФормы);
	
	Для Каждого Раздел Из ЭтаФорма.СохраняемыеРазделы Цикл
		ДобавитьРазделОтчета(РазделыОтчета, Раздел.Значение, Раздел.Представление);
		Раздел.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьРазделОтчета(РазделыОтчета, ИмяРаздела, Представление)

	НоваяСтрока = РазделыОтчета.Добавить();
	
	НоваяСтрока.ИмяРаздела = ИмяРаздела;
	НоваяСтрока.Представление = Представление;

КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	ЭтаФорма.СтруктураРеквизитовФормы = Отчеты.РегламентированныйОтчетОФинансовыхРезультатахРСБУ.ПолучитьСтруктуруПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиСервер()
	
	СформироватьСписокРазделовОтчета();
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
	
	ИмяМакетаСоставаПоказателей = КонсолидированнаяОтчетность.ПолучитьИмяМакетаСоставаПоказателей("РегламентированныйОтчетОФинансовыхРезультатахРСБУ", СтруктураРеквизитовФормы);
	МакетСоставаПоказателей = Отчеты[СтруктураНаименованийОтчета.ИсточникОтчета].ПолучитьМакет(ИмяМакетаСоставаПоказателей);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МакетСоставаПоказателей", МакетСоставаПоказателей);
	СтруктураПараметров.Вставить("мТаблицаСоставПоказателей", мТаблицаСоставПоказателей);
	СтруктураПараметров.Вставить("УникальныйИдентификатор", ЭтаФорма.УникальныйИдентификатор);
	
	СтруктураПараметров.Вставить("Адрес_ТаблицаРасшифровки", Адрес_ТаблицаРасшифровки);
	СтруктураПараметров.Вставить("Адрес_мСтруктураЦветовРаскраски", Адрес_мСтруктураЦветовРаскраски);
	СтруктураПараметров.Вставить("Адрес_мСтруктураВариантыЗаполнения", Адрес_мСтруктураВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаВариантыЗаполнения", Адрес_мТаблицаВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаСчетов", Адрес_мТаблицаСчетов);
	
	КонсолидированнаяОтчетность.ЗаполнитьНачальныеНастройкиСервер(СтруктураПараметров);
	
	Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		Если Лев(ЭлементСтруктуры.Ключ, 6) = "Адрес_" Тогда
			ЭтаФорма[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено Тогда
		
		СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
		СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
		СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
		СписокСохранения.Свойство("ВидДеятельностиОрганизации", СтруктураРеквизитовФормы.ВидДеятельностиОрганизации);
		
		ЗаполнитьНачальныеНастройкиСервер();
	
		ЗаполнитьТабличныеДокументыИзМакетов();
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
           И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
        	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

        КонецЕсли;
		
	Иначе
		
		ЗаполнитьНачальныеНастройкиСервер();
		
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			// документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе
			// Это новый документ.
			Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
				СтруктураРеквизитовФормы.ВалютаДокумента  		  	= ЭтаФорма.НастройкиОтчета.ВалютаДокумента;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         	= ЭтаФорма.НастройкиОтчета.ЕдиницаИзмерения;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	= ЭтаФорма.НастройкиОтчета.ТочностьЕдиницыИзмерения;
				ЭтаФорма.Подписант 									= ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
				//ЭтаФорма.ПодписантБухгалтер							= ЭтаФорма.НастройкиОтчета.ПодписантБухгалтер.КонтактноеЛицо;
			Иначе	
				СтруктураРеквизитовФормы.ВалютаДокумента  		  = СтруктураРеквизитовФормы.Организация.ВалютаУчета;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			КонецЕсли; 
			
			ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
			СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода = КонсолидированнаяОтчетность.ПолучитьОтчетНаКонецПредыдущегоПериода(СтруктураРеквизитовФормы, ИсточникОтчета);  
			//  оставлено для общности. Прошлый год пересчитываем. 
			ЭтаФорма.СтатусОтчета = "Черновик";
			
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьТабличныеДокументыИзМакетов();
		ЗаполнитьДенежныйПоказательСРазмерностью();
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НаимСчетаДоверительногоУправления = СтруктураРеквизитовФормы.СчетДоверительногоУправления.Наименование;
	
	Если Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 1 Тогда 
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	ИначеЕсли СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = "период с " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ИначеЕсли СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(НачалоКвартала(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ДФ='ММММ'") + " - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг "" г.""'");
	Иначе
		СтруктураРеквизитовФормы.СтрПериодОтчета = "Январь - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	КонецЕсли;
	
	ИнициализироватьСтруктуруЗаголовковОтчетов();
	
	мСкопированаФорма = Неопределено;
	Параметры.Свойство("мСкопированаФорма", мСкопированаФорма);
	Если ЗначениеЗаполнено(мСкопированаФорма) Тогда 
		Модифицированность = Истина;
	КонецЕсли;
	
	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);
	Элементы.НомерКорректировки.Видимость = ЭтаФорма.СтатусОтчета = "Корректировка";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерностьВалюту()
	
	ЕдиницаИзмеренияНадпись = "";
	ПредставлениеВалютыДокумента = ?(ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента), СтруктураРеквизитовФормы.ВалютаДокумента, "руб");
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		ЕдиницаИзмеренияНадпись ="в "+ ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		ЕдиницаИзмеренияНадпись ="в тысячах " + ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		ЕдиницаИзмеренияНадпись = "в миллионах " + ПредставлениеВалютыДокумента;
	КонецЕсли;
	
	Возврат ЕдиницаИзмеренияНадпись;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДенежныйПоказательСРазмерностью()
	
	ДенежныйПоказательСРазмерностью = КонсолидированнаяОтчетность.ПолучитьДенежныйПоказательСРазмерностью(СтруктураРеквизитовФормы, ЭтаФорма);
	
	РазмерностьДокумента = ПолучитьРазмерностьВалюту();
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		ИмяРаздела = ТекСтрока.ИмяРаздела;
		
		Попытка
			ТекРаздел = ТекСтрока.ТабличныйДокумент;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если НЕ ТекРаздел.Области.Найти("ДенежныйПоказательСРазмерностью") = Неопределено
			и ТекРаздел.Области.ДенежныйПоказательСРазмерностью.СодержитЗначение
			Тогда
			ТекРаздел.Области.ДенежныйПоказательСРазмерностью.Значение = ДенежныйПоказательСРазмерностью;
		КонецЕсли;
		Если НЕ ТекРаздел.Области.Найти("НаименованиеВалютыОтчета") = Неопределено 
			и ТекРаздел.Области.НаименованиеВалютыОтчета.СодержитЗначение
			Тогда
			ТекРаздел.Области.НаименованиеВалютыОтчета.Значение = РазмерностьДокумента;
		КонецЕсли;
		Если НЕ ТекРаздел.Области.Найти("КодПоОКЕИ") = Неопределено
			и ТекРаздел.Области.КодПоОКЕИ.СодержитЗначение
			Тогда 
				Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда
					ТекРаздел.Области.КодПоОКЕИ.Значение = 384;
				ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
					ТекРаздел.Области.КодПоОКЕИ.Значение = 385;
				Иначе
					ТекРаздел.Области.КодПоОКЕИ.Значение = 383;
				КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруЗаголовковОтчетов()
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов = Новый Соответствие;
	
	КонецПредыдущегоГода = КонецГода(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	ГодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ = 'гггг'");
	ГодПредыдущий = Формат(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12), "ДФ = 'гггг'");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодОтчетногоГода", "за " + ГодОтчета + "г.");
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодПредыдущегоГода", "за " + ГодПредыдущий + "г.");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаОтчетнуюДату", "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD"));
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаКонецПредыдущегоГода", "На " + Формат(КонецПредыдущегоГода, "ДЛФ=DD"));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ПоказателиОтчета;
	Перем ТаблицаРасшифровки;
	Перем РазделыСРучнойКорректировкой;
	
	СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
	
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         		 = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 		 = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.ВалютаДокумента				 = СтруктураРеквизитовФормы.мСохраненныйДок.ВалютаДокумента;
	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода		 = СтруктураРеквизитовФормы.мСохраненныйДок.ОтчетНаКонецПрошлогоГода;  
	
	СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала = НачалоКвартала(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета  = НачалоКвартала(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	Если СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12);
	Иначе
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецМесяца(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	КонецЕсли;
	
	Комментарий                                        		 = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтатусОтчета                                        	 = СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета;
	НомерКорректировки                                 		 = СтруктураРеквизитовФормы.мСохраненныйДок.НомерКорректировки;

	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	СписокСохранения.Свойство("Расшифровка", ТаблицаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		
		Адрес_ТаблицаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, УникальныйИдентификатор);
		
	КонецЕсли;
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("РазделыСРучнойКорректировкой", РазделыСРучнойКорректировкой);
	СписокСохранения.Свойство("Подписант", ЭтаФорма.Подписант);
	СписокСохранения.Свойство("ПодписантБухгалтер", ЭтаФорма.ПодписантБухгалтер);
	
	Для Каждого ТекСтрока из ЭтаФорма.РазделыОтчета Цикл
		Если Не РазделыСРучнойКорректировкой.Найти(ТекСтрока.ИмяРаздела) = Неопределено Тогда
			ТекСтрока.РучнаяКорректировка = Истина;
			КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ТекСтрока.ИмяРаздела, ТекСтрока.ТабличныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока из ПоказателиОтчета Цикл
		Попытка
			ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекСтрока.ИмяРаздела);
			ТабДок.Области[ТекСтрока.ИмяПоказателя].Значение = ТекСтрока.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеДокументыИзМакетов(ЭтоНовый = Истина)
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		Попытка
			
			Префикс = "ОФРРСБУ_";
			
			ИмяМакета = Префикс + "Макет" + ТекСтрока.ИмяРаздела;
			
			КонсолидированнаяОтчетность.ЗаполнитьТабличныйДокументИзМакета(ЭтаФорма, ТекСтрока, ИмяМакета);

		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦветФонаЯчейки(ИмяТекРаздела = "", ТекРаздел = Неопределено)

	КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяТекРаздела, ТекРаздел);
	Если ЗначениеЗаполнено(ТекРаздел = Неопределено) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяТекРаздела);
	Иначе
		ЭтаФорма.ТабличныйДокумент = ТекРаздел;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
		
		СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетОФинансовыхРезультатах2025";
		СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
		
		ЗаполнитьАвто();
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант,,Истина);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
			ЭтаФорма.СтатусОтчета = "Черновик";
		КонецЕсли; 
		
		Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
			Записать(Неопределено);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьФорму Тогда
		ЭтаФорма.Открыть();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить() Экспорт
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетОФинансовыхРезультатах2025";
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
	
	ЗаполнитьАвто();
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант,,Истина);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
		ЭтаФорма.СтатусОтчета = "Черновик";
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДополнительныеСведения()
	
	РезультатЗапроса = Отчеты.РегламентированныйОтчетОФинансовыхРезультатахРСБУ.ПолучитьНастройкиОтчетностиРСБУ(ЭтаФорма.СтруктураРеквизитовФормы.Организация, 
		ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления);
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтаФорма.СтруктураРеквизитовФормы.Вставить(ВыборкаДетальныеЗаписи.СвойствоКлюч, ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла;
	
	
	Если НЕ ЭтаФорма.СтруктураРеквизитовФормы.Свойство("СтрокаУправленческихРасходов") Тогда
		ЭтаФорма.СтруктураРеквизитовФормы.Вставить("СтрокаУправленческихРасходов", 2350);
	КонецЕсли;	

	Если НЕ ЭтаФорма.СтруктураРеквизитовФормы.Свойство("СтрокаДоходовОтРеализации") Тогда
		ЭтаФорма.СтруктураРеквизитовФормы.Вставить("СтрокаДоходовОтРеализации", 2340);
	КонецЕсли;	

	Если НЕ ЭтаФорма.СтруктураРеквизитовФормы.Свойство("СтрокаРасходовОтРеализации") Тогда
		ЭтаФорма.СтруктураРеквизитовФормы.Вставить("СтрокаРасходовОтРеализации", 2350);
	КонецЕсли;			
	// две посление настройки связаны. Должны принимать значения 2110, 2120 или 2340, 2350
	
	ВыводитьНомерПриказа = Неопределено;
	Если НЕ ЭтаФорма.СтруктураРеквизитовФормы.Свойство("ВыводитьНомерПриказа",ВыводитьНомерПриказа) Тогда
		ЭтаФорма.СтруктураРеквизитовФормы.Вставить("ВыводитьНомерПриказа", Истина);
	КонецЕсли;
		
	ФормироватьОтУК = Неопределено;
	Если НЕ ЭтаФорма.СтруктураРеквизитовФормы.Свойство("ФормироватьОтУК",ФормироватьОтУК) Тогда
		ЭтаФорма.СтруктураРеквизитовФормы.Вставить("ФормироватьОтУК", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьСтруктуруРеквизитовФормы();
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы, Параметры);
	
	ПолучитьДополнительныеСведения();
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	КонсолидированнаяОтчетность.ЗаполнитьСтруктуруПеременныхДляОтбора(СтруктураПеременныхДляОтбора);
	
	Инициализация(Параметры.БезОткрытияФормы);
	
	ИмяОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].ИмяРаздела;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	КонсолидированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонсолидированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
КонецПроцедуры


#КонецОбласти 

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета) Тогда
	
		ПредыдущаяСтрока = ЭтаФорма.РазделыОтчета.НайтиПоИдентификатору(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета);
		Если Не ПредыдущаяСтрока = Неопределено Тогда
		
			ПредыдущаяСтрока.ТабличныйДокумент = ЭтаФорма.ТабличныйДокумент;
		
		КонецЕсли; 
	
	КонецЕсли; 
		
	НаимТекущегоРаздела = Элемент.ТекущиеДанные.ИмяРаздела;
	ЭтаФорма.РучнаяКорректировка = Элемент.ТекущиеДанные.РучнаяКорректировка;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = НаимТекущегоРаздела;
	
	Если НаимТекущегоРаздела = "ОтчетОФинансовыхРезультатах2025" Тогда
		
		Элементы.РучнаяКорректировка.Доступность = Ложь;
		
	Иначе
		
		Элементы.РучнаяКорректировка.Доступность = Истина;
	
	КонецЕсли; 	
	
	ЭтаФорма.ТабличныйДокумент = Элемент.ТекущиеДанные.ТабличныйДокумент;
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Истина;
		РучнаяКорректировкаПриУстановкеСервер(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		УстановитьЦветФонаЯчейки(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
	Иначе
		
		ЭтаФорма.РучнаяКорректировка = Истина;
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РучнаяКорректировкаПриИзмененииВопросЗавершение",
		ЭтотОбъект,)
		,
		НСтр("ru = 'Будет произведено автоматическое заполнение закладки. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзмененииВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Ложь;
	ЭтаФорма.РучнаяКорректировка = Ложь;
	ЗаполнитьАвто(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриУстановкеСервер(ИмяРаздела)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Раздел", ИмяРаздела);
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Расчет(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифровкаНажатие(Неопределено);
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеОтчета

&НаСервереБезКонтекста
Функция ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет)
	Возврат РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет);
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьАвто(ИмяРаздела = "")

	Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(,"Необходимо указать валюту отчета!");
		Возврат;
	КонецЕсли;
	
	Если Не (ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")) Тогда
		ЭтаФорма.НастройкиОтчета = ПолучитьНастройкиОтчета(
			ЭтаФорма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, 
			ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления,
			"РегламентированныйОтчетОФинансовыхРезультатахРСБУ");		
	КонецЕсли; 
	
	СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала = НачалоКвартала(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета  = НачалоКвартала(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	Если СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12);
	Иначе
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецМесяца(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
		
		СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);	
		
	Иначе
		
		СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "За " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
		
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	// Очистка разделов
	Очистить(ИмяРаздела);
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	нСч = 0;
	ПредставлениеОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].Представление;
	// Заполнение разделов
	Если ИмяРаздела = "" Тогда
		
		Всего = ЭтаФорма.РазделыОтчета.Количество();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				
				Состояние("Заполняется раздел: " + ТекСтрока.Представление, нСч/Всего * 100, "Заполнение...");
				Выполнить("Подключаемый_ЗаполнитьРаздел_" + ТекСтрока.ИмяРаздела + "()");
				нСч = нСч + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяРаздела + "()");
		КонецЕсли;
		
	КонецЕсли;
	
	Если нСч Тогда
		Состояние("Заполняется раздел: " + ПредставлениеОсновногоРаздела, нСч/Всего * 100, "Заполнение...");
	КонецЕсли;
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		Очистить(ИмяОсновногоРаздела);
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма,,,Истина);
	
	Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
	
	Если нСч Тогда
		Состояние();
	КонецЕсли;
	
	
	Модифицированность = Истина;
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		
		ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета[0].ТабличныйДокумент;
		
	Иначе
		
		ЭтаФорма.ТабличныйДокумент = Элементы.РазделыОтчета.ТекущиеДанные.ТабличныйДокумент;
	
	КонецЕсли;
		
КонецПроцедуры

 &НаСервере
Процедура Очистить(ИмяРаздела = "")
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Если ИмяРаздела = "" Тогда
		
		ТаблицаРасшифровки.Очистить();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			ОчиститьТабличноеПоле(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
			
		КонецЦикла;
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("Раздел", ИмяРаздела);
		НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
		ОчиститьТабличноеПоле(ТабДок, ИмяРаздела);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	ЗаполнитьЗаголовки(ИмяРаздела);
	ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела)
	
	Если ИмяРаздела = "ОтчетОФинансовыхРезультатах2025" Тогда
		Возврат;	
	КонецЕсли; 
	
	НайденныеСтроки = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела));
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
		
			ТекСтрока.РучнаяКорректировка = Ложь;
		
		КонецЦикла; 
		
	КонецЕсли;
	
	УстановитьЦветФонаЯчейки(ИмяРаздела);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПоле(ВыбТабличныйДокумент, ИмяРаздела)
	
	Для Каждого ТекОбласть Из ВыбТабличныйДокумент.Области Цикл
			
		Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Не ТекОбласть.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка макета: раздел " + ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		ТекОбласть.Очистить();
		
	КонецЦикла;
	
	РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела);
	
КонецПроцедуры // ОчиститьТабличноеПоле()

&НаСервере
Процедура ЗаполнитьЗаголовки(ИмяРаздела = "")
	//#ЗаполнениеЗаголовков
	
	Если ИмяРаздела = "" Тогда
		мМассивРазделов = ЭтаФорма.РазделыОтчета.Выгрузить(, "ИмяРаздела").ВыгрузитьКолонку(0);
	Иначе
		мМассивРазделов = Новый Массив;
		мМассивРазделов.Добавить(ИмяРаздела);
	КонецЕсли;
	
	Для Каждого ТекИмяРаздела из мМассивРазделов Цикл
		Если ТекИмяРаздела = "Настройка"
			или ТекИмяРаздела = "Проверка"
			или ТекИмяРаздела = "ПроверкаПротоколОшибок"
			Тогда
			Продолжить;
		КонецЕсли;
		
		ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекИмяРаздела);
		
		// Настройки заполнения шапки: Текущий период
		Если НЕ ТекРаздел.Области.Найти("ТекущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
		КонецЕсли;
		
		// Настройки заполнения шапки: Предыдущий период
		Если НЕ ТекРаздел.Области.Найти("ПредыдущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ПредыдущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		КонецЕсли;
				
		// Настройки для титульного листа
		Если ТекИмяРаздела = "ОтчетОФинансовыхРезультатах2025" Тогда   

			Если НЕ ТекРаздел.Области.Найти("ТекущийПериод1") = Неопределено Тогда
				ТекРаздел.Области.ТекущийПериод1.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;;
			КонецЕсли;
			
			Если НЕ ТекРаздел.Области.Найти("ТекущийПериод2") = Неопределено Тогда
				ТекРаздел.Области.ТекущийПериод2.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			КонецЕсли;
			
			// Настройки заполнения шапки: Предыдущий период
			Если НЕ ТекРаздел.Области.Найти("ПредыдущийПериод2") = Неопределено Тогда
				ТекРаздел.Области.ПредыдущийПериод2.Значение    = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			КонецЕсли;			
			
			Если НЕ ТекРаздел.Области.Найти("Число") = Неопределено Тогда
				ТекРаздел.Области.Число.Значение    = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd");
			КонецЕсли;
			Если НЕ ТекРаздел.Области.Найти("Месяц") = Неопределено Тогда
				ТекРаздел.Области.Месяц.Значение    = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=MM");
			КонецЕсли;
			Если НЕ ТекРаздел.Области.Найти("Год") = Неопределено Тогда
				ТекРаздел.Области.Год.Значение    = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=yyyy");
			КонецЕсли;
			
			Если НЕ ТекРаздел.Области.Найти("КодПоОКОПФ") = Неопределено Тогда
				ТекРаздел.Области.КодПоОКОПФ.Значение    = СтруктураРеквизитовФормы.КодПоОКОПФ;
			КонецЕсли;
			Если НЕ ТекРаздел.Области.Найти("КодПоОКФС") = Неопределено Тогда
				ТекРаздел.Области.КодПоОКФС.Значение    = СтруктураРеквизитовФормы.КодПоОКФС;
			КонецЕсли;
			
			СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
			Если НЕ СведенияОбОрганизации = Неопределено Тогда
			
				Если НЕ ТекРаздел.Области.Найти("Организация") = Неопределено Тогда
					Если СтруктураРеквизитовФормы.ФормироватьОтУК Тогда
						ТекРаздел.Области.Организация.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
							СведенияОбОрганизации.КраткоеНаименование + " по договору №" + 
							СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
						ТекРаздел.Области.НазваниеОтчета.Значение = "Отчет о финансовых результатах";
					Иначе
						ТекРаздел.Области.Организация.Значение    = "Учредитель управления " + СведенияОбОрганизации.ПолноеНаименование;
						ТекРаздел.Области.НазваниеОтчета.Значение = "Отчет о финансовых результатах Доверительного управляющего " 
							+ СведенияОбОрганизации.ПолноеНаименованиеОрганизации 
							+ " по договору № " + СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора,"ДФ=dd.MM.yyyy");
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ ТекРаздел.Области.Найти("ПочтовыйАдресОрганизации") = Неопределено Тогда
					Если СтруктураРеквизитовФормы.ФормироватьОтУК Тогда
						ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдресОрганизации;
					Иначе
						ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдрес;
					КонецЕсли;
				КонецЕсли;	
			
				Если НЕ ТекРаздел.Области.Найти("КодПоОКПО") = Неопределено Тогда
					Если СтруктураРеквизитовФормы.ФормироватьОтУК Тогда
						ТекРаздел.Области.КодПоОКПО.Значение    = СведенияОбОрганизации.КодПоОКПООрганизации;
					Иначе
						ТекРаздел.Области.КодПоОКПО.Значение    = СведенияОбОрганизации.КодПоОКПО;
					КонецЕсли;						
				КонецЕсли;	
				
				Если НЕ ТекРаздел.Области.Найти("ИНН") = Неопределено Тогда
					Если СтруктураРеквизитовФормы.ФормироватьОтУК Тогда
						ТекРаздел.Области.ИНН.Значение    = СведенияОбОрганизации.ИННОрганизации;
					Иначе
						ТекРаздел.Области.ИНН.Значение    = СведенияОбОрганизации.ИНН;
					КонецЕсли;
				КонецЕсли;	
				
				Если НЕ ТекРаздел.Области.Найти("КодПоОКВЭД") = Неопределено Тогда
					Если СтруктураРеквизитовФормы.ФормироватьОтУК Тогда
						//берем первый код ОКВЭД из строки.
						МестоЗапятой = СтрНайти(СведенияОбОрганизации.КодПоОКВЭДОрганизации, ",");
						Если МестоЗапятой = 0 Тогда
							ТекРаздел.Области.КодПоОКВЭД.Значение    = СокрЛП(СведенияОбОрганизации.КодПоОКВЭДОрганизации);
						Иначе
							ТекРаздел.Области.КодПоОКВЭД.Значение    = СокрЛП(Лев(СведенияОбОрганизации.КодПоОКВЭДОрганизации,МестоЗапятой -1));
						КонецЕсли;
						Если ТекРаздел.Области.КодПоОКВЭД.Значение = "66.12.2" Тогда
							ТекРаздел.Области.ВидЭкономическойДеятельности.Значение = "Деятельность по управлению ценными бумагами";
						ИначеЕсли ТекРаздел.Области.КодПоОКВЭД.Значение = "66.30.1" Тогда
							ТекРаздел.Области.ВидЭкономическойДеятельности.Значение = "Управление инвестиционными фондами";
						Иначе
							ТекРаздел.Области.ВидЭкономическойДеятельности.Значение = "";
						КонецЕсли;
					Иначе
						ТекРаздел.Области.КодПоОКВЭД.Значение    = СведенияОбОрганизации.КодПоОКВЭД;
						ТекРаздел.Области.ВидЭкономическойДеятельности.Значение = "";
					КонецЕсли;
				КонецЕсли;	
				
				Если НЕ ТекРаздел.Области.Найти("ОрганизационноПравоваяФормаИФормаСобственности") = Неопределено Тогда
					НаименованиеФормыСобственности = ?(СтруктураРеквизитовФормы.КодПоОКФС = 16, "частная", "");//считаем что у всех частная собственность. Если нет, то надо добавлять параметр в дополнительные сведения в раздел "Отчетность РСБУ"."
					Если СтруктураРеквизитовФормы.ФормироватьОтУК Тогда
						ТекРаздел.Области.ОрганизационноПравоваяФормаИФормаСобственности.Значение    = СведенияОбОрганизации.ОрганизационноПравоваяФормаОрганизации + "/" + НаименованиеФормыСобственности;
					Иначе
						ТекРаздел.Области.ОрганизационноПравоваяФормаИФормаСобственности.Значение    = СведенияОбОрганизации.ОрганизационноПравоваяФорма+ "/" + НаименованиеФормыСобственности;
					КонецЕсли;
				КонецЕсли;	
				
			КонецЕсли; 
						
		КонецЕсли;
		
		ЗаполнитьДенежныйПоказательСРазмерностью();		
		
	КонецЦикла;

КонецПроцедуры

#Область ОбщиеПроцедурыЗаполнения

&НаСервереБезКонтекста
Процедура ЗапомнитьСумму(ИмяПараметра, ЗначениеПараметра, ОбластиИЗначения, Замена = Ложь)
	
	Перем ТекущееЗначение;
	
	Если ОбластиИЗначения.Свойство(ИмяПараметра, ТекущееЗначение) И НЕ Замена Тогда 
		ОбластиИЗначения[ИмяПараметра] = ТекущееЗначение + ЗначениеПараметра;
	Иначе
		ОбластиИЗначения.Вставить(ИмяПараметра, ЗначениеПараметра);
	КонецЕсли;			
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет = Неопределено, КорСчет = Неопределено, Сдвиг = Неопределено, ПраваяГраница = Неопределено, Раздел = Неопределено)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	СтруктураПолей = Новый Структура("СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел",
	СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел);
	
	КонсолидированнаяОтчетность.ДобавитьСтрокуВРасшифровку(ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СтруктураПолей);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РаспределитьДоходыРасходыРасшифровкаПоНастройке(ОбщиеФункции, ОбластиИЗначения, СтруктураРеквизитовФормы, ПрошлыйГод)
	
	НомерКолонки = ?(ПрошлыйГод, "03", "02");
	
	//прочие расходы должны быть с минусом.
	ЗапомнитьСумму("П72" + НомерКолонки, - ОбщиеФункции.ВернутьСохраненноеЗначение("П72" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения, Истина);
	
	//Управленческие расходы
	Если  СтруктураРеквизитовФормы.СтрокаУправленческихРасходов = 2350 Тогда
		
		ЗапомнитьСумму("П68" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П17" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П17" + НомерКолонки, 0, ОбластиИЗначения, Истина);
	    ЗапомнитьСумму("П69" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П18" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П18" + НомерКолонки, 0, ОбластиИЗначения, Истина);   
		ЗапомнитьСумму("П70" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П19" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П19" + НомерКолонки, 0, ОбластиИЗначения, Истина);  
		ЗапомнитьСумму("П71" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П20" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П20" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		
	КонецЕсли;        
	
	//Сворачивание курсовой разницы
	СуммаКурсовойРазницы = ОбщиеФункции.ВернутьСохраненноеЗначение("П74" + НомерКолонки, ОбластиИЗначения) + ОбщиеФункции.ВернутьСохраненноеЗначение("П75" + НомерКолонки, ОбластиИЗначения);
	Если СуммаКурсовойРазницы > 0 Тогда 
		ЗапомнитьСумму("П74" + НомерКолонки, СуммаКурсовойРазницы, ОбластиИЗначения, Истина); 
		ЗапомнитьСумму("П75" + НомерКолонки, 0, ОбластиИЗначения, Истина);
	Иначе   
		ЗапомнитьСумму("П74" + НомерКолонки, 0, ОбластиИЗначения, Истина); 
		ЗапомнитьСумму("П75" + НомерКолонки, СуммаКурсовойРазницы, ОбластиИЗначения, Истина);
	КонецЕсли;
	
	// сворачиваем доходы расходы по РЕПО
	СуммаДоходРЕПО = ОбщиеФункции.ВернутьСохраненноеЗначение("П38" + НомерКолонки, ОбластиИЗначения) + ОбщиеФункции.ВернутьСохраненноеЗначение("П67" + НомерКолонки, ОбластиИЗначения);
	Если СуммаДоходРЕПО > 0 Тогда 
		ЗапомнитьСумму("П38" + НомерКолонки, СуммаДоходРЕПО, ОбластиИЗначения, Истина); 
		ЗапомнитьСумму("П67" + НомерКолонки, 0, ОбластиИЗначения, Истина);
	Иначе   
		ЗапомнитьСумму("П38" + НомерКолонки, 0, ОбластиИЗначения, Истина); 
		ЗапомнитьСумму("П67" + НомерКолонки, СуммаДоходРЕПО, ОбластиИЗначения, Истина);
	КонецЕсли;
	
	// Сворачивание переоценки 
	СуммаПереоценки = 0;
	Для Индекс = 48 по 52 Цикл 
		ИмяЯчейки = "П" + Формат(Индекс, "ЧЦ=2; ЧВН=") + НомерКолонки;
        СуммаПереоценки = СуммаПереоценки + ОбщиеФункции.ВернутьСохраненноеЗначение(ИмяЯчейки, ОбластиИЗначения);
	КонецЦикла;  	
	Для Индекс = 62 по 66 Цикл 
		ИмяЯчейки = "П" + Формат(Индекс, "ЧЦ=2; ЧВН=") + НомерКолонки;
        СуммаПереоценки = СуммаПереоценки + ОбщиеФункции.ВернутьСохраненноеЗначение(ИмяЯчейки, ОбластиИЗначения);
	КонецЦикла;  
	
	//паи
	 СуммаПереоценки = СуммаПереоценки + ОбщиеФункции.ВернутьСохраненноеЗначение("П78" + НомерКолонки, ОбластиИЗначения);
	 СуммаПереоценки = СуммаПереоценки + ОбщиеФункции.ВернутьСохраненноеЗначение("П79" + НомерКолонки, ОбластиИЗначения);
	
	
	Если СуммаПереоценки > 0 Тогда
		ЗапомнитьСумму("П48" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П62" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П49" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П63" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П50" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П64" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П51" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П65" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П52" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П66" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П78" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П79" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		
		ЗапомнитьСумму("П62" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П63" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П64" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П65" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П66" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П79" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		
	Иначе
		ЗапомнитьСумму("П62" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П48" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П63" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П49" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П64" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П50" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П65" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П51" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П66" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П52" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		ЗапомнитьСумму("П79" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П78" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
		
		ЗапомнитьСумму("П48" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П49" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П50" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П51" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П52" + НомерКолонки, 0, ОбластиИЗначения, Истина);  
		ЗапомнитьСумму("П78" + НомерКолонки, 0, ОбластиИЗначения, Истина);

		
	КонецЕсли;
	

	 // доходы расходы от реализации
	Если СтруктураРеквизитовФормы.СтрокаДоходовОтРеализации = 2340 И СтруктураРеквизитовФормы.СтрокаРасходовОтРеализации = 2350 Тогда          //!!! сдесь косяк. Надо разобраться.
		//в этом случае доходы/расходы по реализации надо свернуть.  
		
		
		ДоходРасходРеализация = 0;
		Для Индекс = 2 по 13 Цикл
			Если Индекс = 3 ИЛИ Индекс = 8 Тогда 
				Продолжить;
			КонецЕсли;
			
			ИмяЯчейки = "П" + Формат(Индекс, "ЧЦ=2; ЧВН=") + НомерКолонки;
			ЗначениеПоказателя = ОбщиеФункции.ВернутьСохраненноеЗначение(ИмяЯчейки, ОбластиИЗначения);
			
			ДоходРасходРеализация = ДоходРасходРеализация + ЗначениеПоказателя;
			
		КонецЦикла;  
		
		ДоходРасходРеализация = ДоходРасходРеализация + ОбщиеФункции.ВернутьСохраненноеЗначение("П76" + НомерКолонки, ОбластиИЗначения);;
		ДоходРасходРеализация = ДоходРасходРеализация + ОбщиеФункции.ВернутьСохраненноеЗначение("П77" + НомерКолонки, ОбластиИЗначения);;
		
		//паи
		
		Если ДоходРасходРеализация > 0 Тогда   
			
			// акции
			ЗапомнитьСумму("П42" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П02" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П42" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П09" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
						
			// ОФЗ
			ЗапомнитьСумму("П44" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П04" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П44" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П10" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
			
			// СФО
			ЗапомнитьСумму("П45" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П05" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П45" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П11" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
			
			//ОМЗ
			ЗапомнитьСумму("П46" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П06" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П46" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П12" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
			
			// Корпр. 
			ЗапомнитьСумму("П47" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П07" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П47" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П13" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			
			//паи
			ЗапомнитьСумму("П80" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П76" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П80" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П77" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			
		Иначе
			
			// акции
			ЗапомнитьСумму("П57" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П02" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П57" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П09" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
			
			// ОФЗ
			ЗапомнитьСумму("П58" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П04" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П58" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П10" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
			
			// СФО
			ЗапомнитьСумму("П59" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П05" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П59" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П11" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
			
			//ОМЗ
			ЗапомнитьСумму("П60" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П06" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П60" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П12" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения);
			
			// Корпр. 
			ЗапомнитьСумму("П61" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П07" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П61" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П13" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			
			//паи
			ЗапомнитьСумму("П81" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П76" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 
			ЗапомнитьСумму("П81" + НомерКолонки, ОбщиеФункции.ВернутьСохраненноеЗначение("П77" + НомерКолонки, ОбластиИЗначения), ОбластиИЗначения); 			

		КонецЕсли;  
		
		//исходные значения обнулим
		Для Индекс = 2 по 13 Цикл
			Если  Индекс = 3 ИЛИ Индекс = 8 Тогда 
				Продолжить;
			КонецЕсли;
			ИмяЯчейки = "П" + Формат(Индекс, "ЧЦ=2; ЧВН=") + НомерКолонки;
			ЗапомнитьСумму(ИмяЯчейки, 0, ОбластиИЗначения, Истина);
		КонецЦикла;
		
		ЗапомнитьСумму("П76" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		ЗапомнитьСумму("П77" + НомерКолонки, 0, ОбластиИЗначения, Истина);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыЗаполненияРазделов

&НаСервере
Процедура ЗаполнитьРаздел_РасшифровкаСервер(ТекРаздел, ИмяРаздела)
	
	ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет;
	СтрокаВидУчета = "БухгалтерскийУчет";
	
	ТипЧисло = Новый ОписаниеТипов("Число");   
		
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	ПрочиеДоходыПрошлыйГод = Новый ТаблицаЗначений;
	ПрочиеДоходыПрошлыйГод.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходыПрошлыйГод.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходыПрошлыйГод = Новый ТаблицаЗначений;
	ПрочиеРасходыПрошлыйГод.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходыПрошлыйГод.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	
	Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда 
		ДатаНачальная = СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала;
		ДатаКонечная = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета; 
	Иначе	
		ДатаНачальная = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
		ДатаКонечная = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета; 
	КонецЕсли;
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
		
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(ЭтаФорма.СтруктураРеквизитовФормы.Организация, ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления, ДатаКонечная, ВидУчета);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(ЭтаФорма.СтруктураРеквизитовФормы.Организация, ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления, ДатаКонечная, ВидУчета);

	МакетНастройка = Отчеты.РегламентированныйОтчетОФинансовыхРезультатахРСБУ.ПолучитьМакет("Настройка");
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "ДанныеРасшифровка", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);
	
	ТаблицаНастройкиПрошлыйГод = ТаблицаНастройки.Скопировать();  
	Для Каждого СтрокаНастройки из ТаблицаНастройкиПрошлыйГод Цикл
		СтрокаНастройки.ИмяПараметра = Лев(СтрокаНастройки.ИмяПараметра, 3) + "03";
	КонецЦикла;
	
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(ЭтаФорма.СтруктураРеквизитовФормы.Организация, ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления, ДатаКонечная, СтрокаВидУчета, ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "П5402", "П7202", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы, Ложь);
	
	РаспределитьДоходыРасходыРасшифровкаПоНастройке(ОбщиеФункции, ОбластиИЗначения, ЭтаФорма.СтруктураРеквизитовФормы, Ложь);  
	
	//прошлый год
	Если СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда 
		//все  нормально, реформации в этом году не было 
		
		Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
			ДатаКонечнаяПрошлыйГод = СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета;
			ДатаНачальнаяПрошлыйГод = СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКварталаПрошлогоПериодаОтчета;    
		Иначе	
			ДатаКонечнаяПрошлыйГод = СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета;
			ДатаНачальнаяПрошлыйГод = СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета;    
		КонецЕсли;
		
		ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(ЭтаФорма.СтруктураРеквизитовФормы.Организация, ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления, ДатаКонечнаяПрошлыйГод, СтрокаВидУчета, ДатаНачальнаяПрошлыйГод);	
		ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройкиПрошлыйГод, "П5403", "П7203", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходыПрошлыйГод, ПрочиеРасходыПрошлыйГод, Ложь);	
		
		РаспределитьДоходыРасходыРасшифровкаПоНастройке(ОбщиеФункции, ОбластиИЗначения, ЭтаФорма.СтруктураРеквизитовФормы, Истина);
	КонецЕсли;	
	
    ОбщиеФункции.ЗаполнениеОбластиЗначениями(ТекРаздел, ОбластиИЗначения);
		
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОтчетОФинансовыхРезультатах2025()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОтчетОФинансовыхРезультатах2025"))[0];	
	
	РасчетРаздела_ОтчетОФинансовыхРезультатах2025(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_Расшифровка()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "Расшифровка"))[0];;

	ЗаполнитьРаздел_РасшифровкаСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
		
	РасчетРаздела_Расшифровка(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыРасчета

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРаздела, ИмяЯчейки, Ячейка)
	// #ЧисткаИтогов
	
	Если КонсолидированнаяОтчетностьКлиентСервер.ИтоговаяЯчейкаПервыйРасчет(ЭтаФорма, ИмяРаздела, ИмяЯчейки, Ячейка)
		Тогда
		КонсолидированнаяОтчетность.УдалитьРасшифровкуЯчейки(Адрес_ТаблицаРасшифровки, ИмяРаздела, ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейкуНачало

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейку(ИмяРазделаРезультат, РазделРезультат, ИмяЯчейкиРезультат, ИмяРазделаИсточник, ИмяЯчейкиИсточник, Множитель = 1, ИмяПоказателяРезультат = "", ИмяПоказателяИсточник = "", ДобавитьКРасчетномуЗначению = ЛОЖЬ)
	
	ИмяПоказателяИсточник_исх = ИмяПоказателяИсточник;
	ИмяПоказателяРезультат = ?(ИмяПоказателяРезультат = "", "Ячейка " + ИмяЯчейкиРезультат, ИмяПоказателяРезультат);
	ИмяПоказателяИсточник = ?(ИмяПоказателяИсточник = "", "Ячейка " + ИмяЯчейкиИсточник, ИмяПоказателяИсточник);
	
	// Определим ячейку-результат
	Попытка
		ЯчейкаРезультат = РазделРезультат.Области[ИмяЯчейкиРезультат];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: не найдена ячейка %2'"),
		ИмяРазделаРезультат,
		ИмяЯчейкиРезультат);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// #ЧисткаИтогов
	Если НЕ ДобавитьКРасчетномуЗначению Тогда
		ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРазделаРезультат, ИмяЯчейкиРезультат, ЯчейкаРезультат); 
	КонецЕсли;
	
	// Табличный документ-источник
	Если ТипЗнч(ИмяРазделаИсточник) = Тип("Строка") Тогда
		
		Попытка
			РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаИсточник))[0];
			ТабИсточник = РазделОтчета.ТабличныйДокумент;
		Исключение
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Расчет итогов по разделу %1: не найден раздел %2'"),
			ИмяРазделаРезультат,
			ИмяРазделаИсточник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	Иначе
		
		// Если передан табличный документ, значит заполнение идет с текущего раздела
		ТабИсточник = ИмяРазделаИсточник;
		РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаРезультат))[0];
		
	КонецЕсли;
	СтраницаИсточник = РазделОтчета;
	
	// Определим ячейку-источник
	Попытка
		ЯчейкаИсточник = ТабИсточник.Области[ИмяЯчейкиИсточник];
	Исключение
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Расчет итогов по разделу %1: в разделе %2 не найдена ячейка %3'"),
		ИмяРазделаРезультат,
		ИмяРазделаИсточник,
		ИмяЯчейкиИсточник);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// Определим значение - источник, умноженное на "Множитель"
	ЗначениеИсточник = ЯчейкаИсточник.Значение * Множитель;
	
	// Лобавим к значению в ячейке-результат новое значение
	ЯчейкаРезультат.Значение = ЯчейкаРезультат.Значение + ?(ИмяРазделаРезультат = "Расшифровка", ЗначениеИсточник, КонсолидированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЗначениеИсточник, СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения, СтруктураРеквизитовФормы.мДелитель));
	
	// Определим какой должен быть знак (+/-) в расшифровке
	ЗнакВРасшифровке = ?(Множитель > 0, "+", "-");
	
	Если ИмяПоказателяИсточник_исх = ""
		и Множитель <> 1 и Множитель <> -1 
		Тогда
		МножительБезЗнака = ?(Множитель > 0, Множитель, -Множитель);
		ИмяПоказателяИсточник = ИмяПоказателяИсточник + " * " + МножительБезЗнака;
	КонецЕсли;
	
	// Сформируем текст расшифровки по шаблону: "Закладка ...., имя показателя"
	ТекстРасшифровки = "Закладка «" + СтраницаИсточник.Представление + "»";
	Если ЗначениеЗаполнено(ИмяПоказателяИсточник) Тогда
		ТекстРасшифровки = ТекстРасшифровки + ", " + ИмяПоказателяИсточник;
	КонецЕсли;
	
	// Заменим служебные команды по периоду
	стрИмяПоказателяРезультат = СтрЗаменить(ИмяПоказателяРезультат, "#ПериодТекущий#", СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода);
	стрИмяПоказателяРезультат = СтрЗаменить(стрИмяПоказателяРезультат, "#ПериодПредыдущий#", СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода);
	
	// Добавим в расшифровку
	ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейкиРезультат, стрИмяПоказателяРезультат, ЗнакВРасшифровке, ТекстРасшифровки, ЗначениеИсточник, , , , , ИмяРазделаРезультат);
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейку

&НаСервере
Процедура Расчет(ИмяРаздела = "")
	
	КонсолидированнаяОтчетностьКлиентСервер.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	Если ИмяРаздела = "" Тогда
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				Выполнить("РасчетРаздела_" + ТекСтрока.ИмяРаздела + "(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела)");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
			Выполнить("РасчетРаздела_" + ИмяРаздела + "(ТекРаздел, ИмяРаздела)");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ КонсолидированнаяОтчетностьКлиентСервер.НуженПересчетОсновногоРаздела("ТабличныйДокумент" + ИмяРаздела) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		Возврат;
	КонецЕсли;
	
	// Расчет основного раздела
	Очистить(ИмяОсновногоРаздела);
	ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяОсновногоРаздела);
	Выполнить("РасчетРаздела_" + ИмяОсновногоРаздела + "(ТекРаздел, ИмяОсновногоРаздела)");
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОтчетОФинансовыхРезультатах2025(ТекРаздел, ИмяРаздела)
	
	Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
		ТекРаздел.Области["ТекущийПериод1"].Значение = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);    	
	Иначе
		ТекРаздел.Области["ТекущийПериод1"].Значение = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);    
	КонецЕсли;	 

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0103", "Расшифровка", "П0102");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0104", "Расшифровка", "П0103");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0203", "Расшифровка", "П0802");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0204", "Расшифровка", "П0803");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0403", "Расшифровка", "П1502");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0404", "Расшифровка", "П1503");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0503", "Расшифровка", "П1602");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0504", "Расшифровка", "П1603");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0703", "Расшифровка", "П2202");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0704", "Расшифровка", "П2203");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0803", "Расшифровка", "П2302");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0804", "Расшифровка", "П2303");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0903", "Расшифровка", "П3902");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0904", "Расшифровка", "П3903");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1003", "Расшифровка", "П4002");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1004", "Расшифровка", "П4003");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1103", "Расшифровка", "П5502");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1104", "Расшифровка", "П5503");

	
	Для НомКол = 3 По 4 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);   
		
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);  
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1); 
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1); 
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);     
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
			
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_Расшифровка(ТекРаздел, ИмяРаздела)
	
	Если СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал Тогда
		ТекРаздел.Области["ТекущийПериод1"].Значение = "за " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПоследнегоКвартала ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);    	
	Иначе
		ТекРаздел.Области["ТекущийПериод1"].Значение = "за " + ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета ,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);    
	КонецЕсли;	
	
	Для НомКол = 2 По 3 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П76" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);  
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, "П77" + СтрНомКол, 1);  
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1); 
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1); 
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П16" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П21" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);  
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П41" + СтрНомКол, ТекРаздел, "П42" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П41" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П41" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П41" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П41" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П41" + СтрНомКол, ТекРаздел, "П80" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П52" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П53" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П54" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П74" + СтрНомКол, 1);  
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П40" + СтрНомКол, ТекРаздел, "П78" + СтрНомКол, 1);

		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П56" + СтрНомКол, ТекРаздел, "П57" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П56" + СтрНомКол, ТекРаздел, "П58" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П56" + СтрНомКол, ТекРаздел, "П59" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П56" + СтрНомКол, ТекРаздел, "П60" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П56" + СтрНомКол, ТекРаздел, "П61" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П56" + СтрНомКол, ТекРаздел, "П81" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П56" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П62" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П63" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П64" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П65" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П66" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П67" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П68" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П69" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П70" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П71" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П72" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П75" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П79" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П73" + СтрНомКол, ТекРаздел, "П55" + СтрНомКол, 1);  
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область НастройкиОтчета

&НаКлиенте
Процедура ОткрытьФормуНастроекЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЕдиницаИзмерения 				= ДополнительныеПараметры.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 		= ДополнительныеПараметры.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 				= ДополнительныеПараметры.ВалютаДокумента;
	ИсходныйПодписант 				= ДополнительныеПараметры.Подписант;
	ИсходныйПодписантБухгалтер		= ДополнительныеПараметры.ПодписантБухгалтер;
	ОтчетНаКонецПрошлогоГода 		= ДополнительныеПараметры.ОтчетНаКонецПрошлогоГода;
	
	Если ЕдиницаИзмерения <> СтруктураРеквизитовФормы.ЕдиницаИзмерения Тогда
		
		ЕдиницаИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ТочностьЕдиницыИзмерения <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		
		ТочностьЕдиницыИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ВалютаДокумента <> СтруктураРеквизитовФормы.ВалютаДокумента Тогда
		
		ВалютаДокументаПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ИсходныйПодписант <> ЭтаФорма.Подписант ИЛИ ИсходныйПодписантБухгалтер <> ЭтаФорма.ПодписантБухгалтер Тогда
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма,,,Истина);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ОтчетНаКонецПрошлогоГода <> СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	Модифицированность = Истина;
	
	СтруктураОтбора = Новый Структура("ИмяРаздела", СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета.НайтиСтроки(СтруктураОтбора)[0].ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВывода()

	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении()
	
	ТекстСообщения = НСтр("ru = 'Изменена валюта представления отчетности.
	|Перезаполнить документ?'");
	
	ПоказатьВопрос(
	Новый ОписаниеОповещения(
	"ВалютаДокументаПриИзмененииЗавершение",
	ЭтотОбъект),
	ТекстСообщения,
	РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвто();
	КонецЕсли;
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в рублях точность не может превышать 2 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в тысячах рублей точность не может превышать 3 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в миллионах рублей точность не может превышать 6 знаков'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьТочность()
	
#КонецОбласти 

#Область ЗаписьОтчета

&НаКлиенте
Процедура СохранитьНаКлиенте(ВыполняемоеОповещение=Неопределено) Экспорт

	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		ИмяСобытия = "ЗаписьРегламентированногоОтчета";
	Иначе
		ИмяСобытия = "ЗаписьНовогоРегламентированногоОтчета";
	КонецЕсли; 
	
	ЗаполнитьПоказатели();
	ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
	
		Модифицированность = Ложь;
	
		ИсторияРаботыПользователя.Добавить(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок);
		
		Оповестить(ИмяСобытия, Новый Структура("Ключ", СтруктураРеквизитовФормы.мСохраненныйДок));
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	КонсолидированнаяОтчетность.ЗаписатьОтчет(ЭтаФорма);

КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьПоказатели()

	ЭтаФорма.Показатели.Очистить();
		
	Для Каждого ТекСтрока Из РазделыОтчета Цикл
		
		Попытка
			ОбластиРаздела = ТекСтрока.ТабличныйДокумент.Области;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого ТекОбласть Из ОбластиРаздела Цикл
			
			Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Если Не ТекОбласть.СодержитЗначение Тогда
					Продолжить;
				КонецЕсли;
			Исключение
				ТекстСообщения = "Ошибка макета: раздел " + ТекСтрока.ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(ТекОбласть.Значение) Тогда
			
				Продолжить;
			
			КонецЕсли; 
			
			НоваяСтрока = ЭтаФорма.Показатели.Добавить();
			НоваяСтрока.ИмяРаздела 		= ТекСтрока.ИмяРаздела;
			НоваяСтрока.ИмяПоказателя 	= ТекОбласть.Имя;
			НоваяСтрока.Значение 		= ТекОбласть.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтаФорма.Показатели.Сортировать("ИмяРаздела, ИмяПоказателя");
	
КонецПроцедуры

#КонецОбласти 

#Область Расшифровка

&НаКлиенте
Процедура РасшифровкаНажатиеВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Адрес_Расшифровка 	= ДополнительныеПараметры.Адрес_Расшифровка;
	ИмяРаздела 			= ДополнительныеПараметры.ИмяРаздела;
	
	ИмяЯчейки = "";
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатиеЗавершение(Знач Адрес_Расшифровка, Знач ИмяРаздела, ИмяЯчейки)
	
	СтруктураПараметров = Новый Структура(
	"Адрес_Расшифровка,
	|Адрес_СтруктураВариантыЗаполнения,
	|ОсобыйАлгоритмРасшифровки",
	Адрес_Расшифровка,
	Адрес_мСтруктураВариантыЗаполнения,
	Истина);
	
	ТабДок = КонсолидированнаяОтчетность.СформироватьМакетРасшифровки(ИмяРаздела, ИмяЯчейки, СтруктураПараметров);
	
	ВывестиРасшифровкуСервер(ТабДок, ИмяЯчейки);
	
	Элементы.ГруппаРасшифровки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Новый Структура("ИмяЯчейки, Раздел", ИмяЯчейки, ИмяРаздела));
	
	ЕстьРасшифровка = (Не НайденныеСтроки.Количество() = 0);
		
	СтруктураОтбора = Новый Структура("Раздел, ИмяЯчейки", ИмяРаздела, ИмяЯчейки);
	пТаблицаРасшифровки = ТаблицаРасшифровки.Скопировать(СтруктураОтбора);
	
	Если пТаблицаРасшифровки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Адрес_Расшифровка = ПоместитьВоВременноеХранилище(пТаблицаРасшифровки, УникальныйИдентификатор);
	
	Возврат ЕстьРасшифровка;
	
КонецФункции

&НаСервере
Процедура ВывестиРасшифровкуСервер(ТабДок, ИмяСтраницы)
	
	КоличествоРасшифровок = КоличествоРасшифровок + 1;
	НомерСтраницы = Формат(КоличествоРасшифровок, "ЧГ=0");
	ИмяСтраницы = ?(ИмяСтраницы = "", "Расшифровка № " + КоличествоРасшифровок, ИмяСтраницы);
	
	ИмяЭлемента = "СтраницаРасшифровки" + НомерСтраницы;
	ТекСтраница = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Элементы.СтраницыРасшифровки);
	ТекСтраница.Заголовок = ИмяСтраницы;
	
	ИмяЭлемента = "ТабДок_Расшифровка" + НомерСтраницы;
	
	МассивДобавляемых = Новый Массив;
	МассивДобавляемых.Добавить(Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов("ТабличныйДокумент")));
	ИзменитьРеквизиты(МассивДобавляемых);
	
	ТекЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ТекСтраница);
	ТекЭлемент.ПутьКДанным = ИмяЭлемента;
	ТекЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ТекЭлемент.ГоризонтальнаяПолосаПрокрутки = Ложь;
	
	ЭтотОбъект[ИмяЭлемента] = ТабДок;
	
	Элементы.СтраницыРасшифровки.ТекущаяСтраница = ТекСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьРасшифровкуСервер()
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекРасшифровка = Элементы.СтраницыРасшифровки.ТекущаяСтраница;
	СтраницыРасшифровки = Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы;
	
	Если ТекРасшифровка = Неопределено Тогда
		ТекРасшифровка = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
	КонецЕсли;
	
	ТекРасшифровка.Видимость = Ложь;
	
	МассивУдаляемых = Новый Массив;
	МассивУдаляемых.Добавить(ТекРасшифровка.ПодчиненныеЭлементы[0].ПутьКДанным);
	ИзменитьРеквизиты( , МассивУдаляемых);
	
	Элементы.Удалить(ТекРасшифровка);
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		
	ИначеЕсли Элементы.СтраницыРасшифровки.ТекущаяСтраница = Неопределено Тогда
		
		Элементы.СтраницыРасшифровки.ТекущаяСтраница = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьНажатие(Команда)
	
	ЗаполнитьАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	ЗаполнитьАвто(ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНажатие(Команда)
	
	Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Очистить(ИмяРаздела);
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		
		Очистить(ИмяОсновногоРаздела);
		Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо сохранить документ.");
		Возврат;
	
	КонецЕсли; 
	
	ИмяФайла = "Отчет о финансовых результатах за " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD");
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогСохраненияФайла.Фильтр             = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок          = "Укажите файл";
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
		
	КонсолидированнаяОтчетностьКлиент.СохранитьРегламентированныйОтчетВExcel(ЭтаФорма, ДиалогСохраненияФайла.ПолноеИмяФайла, ЭтаФорма.СохраняемыеРазделы);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНаКлиенте();
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", 						СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", 	СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", 				СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения", 		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("ВалютаДокумента", 					СтруктураРеквизитовФормы.ВалютаДокумента);
	ПараметрыФормы.Вставить("ОтчетНаКонецПрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	ПараметрыФормы.Вставить("Подписант", 						ЭтаФорма.Подписант);
	ПараметрыФормы.Вставить("ПодписантБухгалтер", 				ЭтаФорма.ПодписантБухгалтер);
	ПараметрыФормы.Вставить("ИсточникОтчета",					СтруктураНаименованийОтчета.ИсточникОтчета);
	ПараметрыФормы.Вставить("ВыбраннаяФорма",					СтруктураРеквизитовФормы.мВыбраннаяФорма);
	ПараметрыФормы.Вставить("ОтчетЗаПоследнийКвартал",			СтруктураРеквизитовФормы.ОтчетЗаПоследнийКвартал);
	
	ФормаНастройкиОтчета = ПолучитьФорму("Отчет." + СтруктураНаименованийОтчета.ИсточникОтчета + ".Форма.НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ЕдиницаИзмерения 			= СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= СтруктураРеквизитовФормы.ВалютаДокумента;
	Подписант 					= ЭтаФорма.Подписант;
	ПодписантБухгалтер			= ЭтаФорма.ПодписантБухгалтер;
	ОтчетНаКонецПрошлогоГода	= СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода;
	
	ДополнительныеПараметры = Новый Структура("ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ПодписантБухгалтер, ОтчетНаКонецПрошлогоГода", ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ПодписантБухгалтер, ОтчетНаКонецПрошлогоГода);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуНастроекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСкрытьПоказать(Команда)
	
	Элементы.ГруппаРасшифровки.Видимость = Не Элементы.ГруппаРасшифровки.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатие(Команда)
	
	ИмяРаздела = ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	Если ИмяРаздела = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИмяЯчейки = ЭтаФорма.ТабличныйДокумент.ТекущаяОбласть.Имя;
	Исключение
		Возврат;
	КонецПопытки;
	
	Адрес_Расшифровка = "";
	
	// Считываем и помещаем данные на сервере
	РасшифровкаНайдена = РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка);
	
	Если РасшифровкаНайдена = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Расшифровка не сформирована.
		|Расшифровка формируется при нажатии на кнопку ""Заполнить"".'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	Если НЕ РасшифровкаНайдена Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка для выбранной ячейки не существует.'"));
		
		Возврат;
		
		ТекстСообщения = НСтр("ru = 'Расшифровка для выбранной ячейки не существует.
		|Показать расшифровку для всех ячеек раздела?");
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РасшифровкаНажатиеВопросЗавершение",
		ЭтотОбъект,
		Новый Структура(
		"Адрес_Расшифровка,
		|ИмяРаздела",
		Адрес_Расшифровка,
		ИмяРаздела)),
		ТекстСообщения,
		РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьРасшифровкуНажатие(Команда)
	
	ЗакрытьРасшифровкуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.СтатусОтчета = "Корректировка" Тогда
		Элементы.НомерКорректировки.Видимость = Истина;
		ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
		ЭтаФорма.НомерКорректировки = ПолучитьНомерКорректировки(ЭтаФорма.СтруктураРеквизитовФормы, ИсточникОтчета);
	Иначе
		Элементы.НомерКорректировки.Видимость = Ложь;
		ЭтаФорма.НомерКорректировки = 0;
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерКорректировки(СтруктураРеквизитовФормы, ИсточникОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕстьNULL(МАКСИМУМ(РегламентированныйОтчет.НомерКорректировки), 0) КАК НомерКорректировки
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Организация = &Организация
		|	И РегламентированныйОтчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
		|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
		|	И РегламентированныйОтчет.ВалютаДокумента = &ВалютаДокумента
		|	И РегламентированныйОтчет.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И РегламентированныйОтчет.ТочностьЕдиницыИзмерения = &ТочностьЕдиницыИзмерения
		|	И РегламентированныйОтчет.ОтчетНаКонецПрошлогоГода = &ОтчетНаКонецПрошлогоГода
		|	И РегламентированныйОтчет.ОтчетНаКонецПозапрошлогоГода = &ОтчетНаКонецПозапрошлогоГода
		|	И РегламентированныйОтчет.ОтчетЗаПоследнийКвартал = &ОтчетЗаПоследнийКвартал
		|	И РегламентированныйОтчет.ВыбраннаяФорма = &ВыбраннаяФорма
		|	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
		|	И РегламентированныйОтчет.СтатусОтчета = &СтатусОтчета";
	
	Запрос.УстановитьПараметр("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВыбраннаяФорма", 				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", 					НачалоДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", 				СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ИсточникОтчета", 				ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", 					СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ОтчетЗаПоследнийКвартал", 		Ложь);
	Запрос.УстановитьПараметр("ОтчетНаКонецПрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	Запрос.УстановитьПараметр("ОтчетНаКонецПозапрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПозапрошлогоГода);
	Запрос.УстановитьПараметр("СтатусОтчета", 					"Корректировка");
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТочностьЕдиницыИзмерения", 		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерКорректировки = 0;
	Если Выборка.Следующий() Тогда
		НомерКорректировки = Выборка.НомерКорректировки;
	КонецЕсли;
	Возврат НомерКорректировки + 1;		
		
КонецФункции

&НаКлиенте
Процедура НомерКорректировкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьНастройкиВарианта(Команда)
	
	ДанныеВарианта = ОткрытьФормуМодально("ОбщаяФорма.ФормаНастройкиСохраняемыхРазделов",
							Новый Структура("СохраняемыеРазделы", ЭтаФорма.СохраняемыеРазделы));
	
	Если ДанныеВарианта = Неопределено ИЛИ ДанныеВарианта = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.СохраняемыеРазделы			= ДанныеВарианта.СохраняемыеРазделы;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.СохранитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОФинансовыхРезультатахРСБУ");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетОФинансовыхРезультатахРСБУ", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		СохранитьВариантНастроекНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетОФинансовыхРезультатахРСБУ");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетОФинансовыхРезультатахРСБУ", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		ЗагрузитьВариантНастроекНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


