
#Область Получение_расчетного_купона

Функция ПолучитьРасчетныйКупон(ЦеннаяБумага, Период, СчетДоверительногоУправления, НаУтро = Ложь, ТочностьОкругления = 2, ДанныеКупона = Неопределено) Экспорт

	Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстандарт") Тогда		
		Возврат РассчитатьКотировкуКупона_Финстандарт(Период, 0);
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс") Тогда
	
		Если Период >= '20221031' Тогда // все, банкрот, фиксируем купон на 15.05.2022
			Возврат 501.84;	
		Иначе
			Возврат РассчитатьКотировкуКупона_АрчерФинанс(Период);
		КонецЕсли;
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстоун") И Период >= '20180111' Тогда
	
		Если Период >= '20221031' Тогда // все, банкрот, фиксируем купон на 30.03.2022
			Возврат 474.03;
		Иначе
			Возврат РассчитатьКотировкуКупона_Финстоун(Период);
		КонецЕсли;
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг") Тогда
		
		Если Период >= '20180125' И Период < '20200722' Тогда
			Возврат РассчитатьКотировкуКупона_ОткрытиеХолдинг4B0203(ЦеннаяБумага, Период);
			
		ИначеЕсли Период >= '20221117' Тогда // все, банкрот, фиксируем купон на УТРО(!!!) 20.07.2022, с этой даты все клиенты признали его банкротом
			Возврат 0.04;
		ИначеЕсли Период >= '20221031' // а с этой даты его признали банкротом все, кроме Сафмара - они опять не такие как все
			И Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период) <> ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар") Тогда 
			Возврат 0.04;
		КонецЕсли;
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрХолдинг_004") Тогда
		
		Если Период >= '20221117' Тогда // все, банкрот, фиксируем купон на УТРО(!!!) 20.07.2022, с этой даты все клиенты признали его банкротом
			Возврат 0.02;
		ИначеЕсли Период >= '20221031' // а с этой даты его признали банкротом все, кроме Сафмара - они опять не такие как все
			И Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период) <> ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар") Тогда 
			Возврат 0.02;
		КонецЕсли;
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКап_001") И Период >= '20221011' И Период < '20221028' Тогда
		Возврат ПолучитьКотировкуКупона_ГазпромКап40136400R003P(Период);
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Роснефть_005") И Период >= '20240223' И Период <= '20240227' Тогда
		
		// эмитент не объявил купон и бумага, скорее всего, пойдет на оферту 28.02.24 (https://www.moex.com/n67861?nt=101)
		// вечером 26.02.24 эмитент таки дал ставку, но мы начинаем использовать ее с 27.02.24
		Если Период < '20240227' Тогда
			Возврат 0; 
		Иначе // прогнувшись под СД ВТБ, клиенты Ханты, ППА и СФР решили и 27.02.24 считать купон нулевым
			КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период);
			Если КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ППА")
				ИЛИ КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФХантыМансийский")
				ИЛИ КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ПФР") Тогда
				
				Возврат 0
			
			КонецЕсли;
			
		КонецЕсли;

	// временная срочная затыка пока не реализовал формулу
	ИначеЕсли (ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин29026")
				ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин29027"))
		И Период >= '20241213' И Период <= '20241215' Тогда
		
		Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин29026") Тогда
			Если Период = '20241213' Тогда
				Возврат 5.17;
			ИначеЕсли Период = '20241214' Тогда
				Возврат 5.74;
			ИначеЕсли Период = '20241215' Тогда
				Возврат 6.31;
			КонецЕсли;
		ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин29027") Тогда
			Если Период = '20241213' Тогда
				Возврат 1.15;
			ИначеЕсли Период = '20241214' Тогда
				Возврат 1.71;
			ИначеЕсли Период = '20241215' Тогда
				Возврат 2.28;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ_РФ_ВЭБ2Р-50") Тогда
	
		Возврат РассчитатьКотировкуКупонаПоИндексуРУОНИАиСпреду(ЦеннаяБумага, Период, 2.3);
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_210") Тогда
		
		Возврат РассчитатьКотировкуКупонаПоИндексуРУОНИАиСпреду(ЦеннаяБумага, Период, 1.75);	
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ_РФ_ПБО_002Р_52") Тогда
		
		Возврат РассчитатьКотировкуКупонаПоИндексуРУОНИАиСпреду(ЦеннаяБумага, Период, 1.85);	
		
	КонецЕсли;
	
	// для бумаг с реструктуризацией купонных платежей
	Добавка = 0; 
	Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БизнесКонсалтиг")
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БКЗ_ФИНАНС")
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ТМ-энергоФинанс")
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_Груп_Финанс") Тогда
		
		Если НаУтро Тогда
			Добавка = ПолучитьДобавкуПоБумагамСРеструктуризацией(ЦеннаяБумага, Период - 1);
		Иначе
			Добавка = ПолучитьДобавкуПоБумагамСРеструктуризацией(ЦеннаяБумага, Период);
		КонецЕсли;
	
	КонецЕсли;
	
	#Область ПропертизФинанс01_для_Будущего_и_ТелекомСоюза_с_03_10_2020 
	
	Если Период >= '20201003' И Период < '20201118'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_ПропертизФин")
	Тогда
	
		МассивСчетовБудущее = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
			ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_БУДУЩЕЕ"), ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"), Период);
		МассивСчетовТелекомСоюз = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
			ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ТелекомСоюз"), ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"), Период);
	
		Если МассивСчетовБудущее.Найти(СчетДоверительногоУправления) <> Неопределено
			ИЛИ МассивСчетовТелекомСоюз.Найти(СчетДоверительногоУправления) <> Неопределено
		Тогда
			Возврат 0;
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти	
	
	Если ДанныеКупона = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(КупонныйДоходПоОблигациям.Период) КАК Период,
			|	МАКСИМУМ(КупонныйДоходПоОблигациям.НомерКупона) КАК НомерКупона
			|ПОМЕСТИТЬ НашПериод
			|ИЗ
			|	Справочник.Облигации КАК Облигации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
			|		ПО (КупонныйДоходПоОблигациям.Облигация = Облигации.Ссылка)
			|ГДЕ
			|	Облигации.Ссылка = &ЦеннаяБумага
			|	И КупонныйДоходПоОблигациям.Период <= &Период
			|	И (Облигации.ДатаПогашения >= &Период
			|			ИЛИ Облигации.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НашПериод.Период КАК Период,
			|	КупонныйДоходПоОблигациям.СтавкаКупона КАК Процент,
			|	КупонныйДоходПоОблигациям.СуммаКупона КАК СуммаКупона,
			|	КупонныйДоходПоОблигациям.Срок КАК Срок,
			|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
			|	ФормулыРасчетаСтавокКупоновСрезПоследних.ФормулаРасчетаСтавки КАК ФормулаРасчетаСтавки,
			|	КупонныйДоходПоОблигациям.СтавкаКупона <> 0
			|		И КупонныйДоходПоОблигациям.СтавкаОпределена
			|		И КупонныйДоходПоОблигациям.ДатаПубликации <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		И КупонныйДоходПоОблигациям.ДатаПубликации < &Период КАК СтавкаОпределена,
			|	КупонныйДоходПоОблигациям.Облигация.ИндексируемыйНоминал КАК ИндексируемыйНоминал,
			|	КупонныйДоходПоОблигациям.Облигация.Категория КАК Категория,
			|	КупонныйДоходПоОблигациям.Облигация.БазаРасчета КАК БазаРасчета
			|ИЗ
			|	НашПериод КАК НашПериод
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
			|		ПО НашПериод.Период = КупонныйДоходПоОблигациям.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормулыРасчетаСтавокКупонов.СрезПоследних(&Период, Облигация = &ЦеннаяБумага) КАК ФормулыРасчетаСтавокКупоновСрезПоследних
			|		ПО НашПериод.НомерКупона = ФормулыРасчетаСтавокКупоновСрезПоследних.НомерКупона
			|ГДЕ
			|	КупонныйДоходПоОблигациям.Облигация = &ЦеннаяБумага";

		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			НачалоПериода = ВыборкаДетальныеЗаписи.Период;
			Процент = ВыборкаДетальныеЗаписи.Процент;
			СуммаКупона = ВыборкаДетальныеЗаписи.СуммаКупона;
			Срок = ВыборкаДетальныеЗаписи.Срок;
			ДатаОкончанияКупона = ВыборкаДетальныеЗаписи.ДатаОкончанияКупона;
			ФормулаРасчетаСтавки = ВыборкаДетальныеЗаписи.ФормулаРасчетаСтавки;
			ИндексируемыйНоминал = ВыборкаДетальныеЗаписи.ИндексируемыйНоминал;
			Категория = ВыборкаДетальныеЗаписи.Категория;
			НачалоНоминалы = Неопределено;
			СтавкаОпределена = ВыборкаДетальныеЗаписи.СтавкаОпределена;
			БазаРасчета = ВыборкаДетальныеЗаписи.БазаРасчета;
			
		Иначе
			Возврат 0 + Добавка;
		КонецЕсли;
		
	Иначе
		
		НачалоПериода = ДанныеКупона.Период;
		Процент = ДанныеКупона.Процент;
		СуммаКупона = ДанныеКупона.СуммаКупона;
		Срок = ДанныеКупона.Срок;
		ДатаОкончанияКупона = ДанныеКупона.ДатаОкончанияКупона;
		ФормулаРасчетаСтавки = ДанныеКупона.ФормулаРасчетаСтавки;
		ИндексируемыйНоминал = ДанныеКупона.ИндексируемыйНоминал;
		Категория = ДанныеКупона.Категория;
		НачалоНоминалы = ДанныеКупона.ПериодНоминала;
		СтавкаОпределена = ДанныеКупона.СтавкаОпределена;
		БазаРасчета = ДанныеКупона.БазаРасчета;
		
	КонецЕсли;
	
	Если НаУтро И ДатаОкончанияКупона = Период Тогда
		Возврат СуммаКупона; 
	КонецЕсли;
	
	Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПСБ_013") // ждем когда матрикс чухнется и исправит, а пока хардкодим
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Промсвязьбанк") Тогда
	
		БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365Fixed;
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКап_004")
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКапиталООО_014")
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКапиталООО_015")
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКапиталООО_016") Тогда
		
		БазаРасчета = Перечисления.БазыРасчетаОблигаций.ActICMA;
		
	КонецЕсли;
	
	// Ситуация: что по облигациям бывают торги в режиме «Размещение: Адресные заявки» до того как начнутся купонные периоды
	// В эти дни в котировках купон равен нулю, но проверка начинает считать купон за этот день и падает из-за отсутствия купонного периода
	// Пример: облигация «Сбербанк ПАО, 4B02-582-01481-B-001P, 1000.00 RUB»
	// Это условие по отработке этого момента
	Если НачалоПериода = Null Тогда
		Возврат 0;	
	КонецЕсли;
	
	// Тут идут хардкоды для замещающих облигаций, у них начало купона условное(для правильного расчета должно быть другое) и Матрикс дает направильную ставку
	Если Период >= '20221122' И Период < '20230127'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Газпромкап7доп")
	Тогда
		НачалоПериода = '20220727';
		Процент = 2.95;
	КонецЕсли;
	
	Если Период >= '20230220' И Период < '20230321'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКапиталООО_014")
	Тогда
		НачалоПериода = '20220321';
		Процент = 4.364;
	КонецЕсли;
	
	Если Период >= '20230301' И Период < '20230415'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКапиталООО_016")
	Тогда
		НачалоПериода = '20220415';
		Процент = 2.95;
	КонецЕсли;
	
	Если Период >= '20221110'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_CBOM_Finance_XS1601094755")
	Тогда
		Процент = 8.974;
	КонецЕсли;
	
	Если Период >= '20231115' И Период < '20231130'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_003")
	Тогда
		НачалоПериода = '20230531';
		Процент = 5.125;
	КонецЕсли;
	
	Если Период >= '20231130' И Период < '20240218'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_005_НеBO")
	Тогда
		НачалоПериода = '20230818';
		Процент = 4.949;
	КонецЕсли;
	
	Если Период >= '20231205' И Период < '20240311'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_НорильскийНикель_005")
	Тогда
		НачалоПериода = '20230911';
		Процент = 2.55;
	КонецЕсли;	
	
	Если Период >= '20240614' И Период < '20250602'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_НЛМК_ПАО_4-12-00102-A")
	Тогда
		// замена НЛМК, 1.45% 2jun2026, EUR (XS2346922755, STL-26 EUR) 
		// M=0.48 евро
		НачалоПериода = '20240602';
		Процент = 1.45;
		Срок = 365;
	КонецЕсли;	
	
	Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_МКБ_020") Тогда
	
		НачалоПериода = '20231225';
		
	ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_МКБ_027_4-22-01978-B") И Период < '20250121' Тогда
	    // Обменяна из Московский кредитный банк, 3.1% 21jan2026, EUR
		// Остаток НКД по первому купонному периоду 6.95 Евро
		// первый купонный период с 21.02.24
		
		НачалоПериода = '20240121';
		Срок = 366;
	
	КонецЕсли;
	
	// В решении о выпуске "О1 Пропертиз Финанс АО, 4B02-01-71827-H-001P, 1000.00 USD" сказано:
	// если ставка EURIBOR 6М за день до начала купонного периода будет больше нуля, то ее нужно прибавить к ставке 2.2%.
	// На 29.07.2022 EURIBOR 6М был больше нуля, но НРД все еще давал 2.2%.
	// Спохватились и стали считать по правильной ставке только 25.10.2022 (#452693)
	
	Если Период >= '20220729' И Период < '20221025'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_Дол")
	Тогда
		Процент = 2.2;
	КонецЕсли;
	
	// еще один Пропертиз, завязанный на EURIBOR по которому НРД чухается неделю, а нма уже нужно считать
	// #494987
	Если Период >= '20231114' И Период < '20240515'
		И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_До2")
	Тогда
		Процент = 6.085;
	КонецЕсли;	
	
	//#391307 - хардкод для расчета НКД по "ПРОМСВЯЗЬБАНК ПАО, 41403251B, 10000000.00 RUB" и "ПРОМСВЯЗЬБАНК ПАО, 41303251B, 10000000.00 RUB"
	//т.к. у бумаги окончание предудущего купонного периода не совпадает с началом следующего то
	//делаем "как у ММВБ":
	//1. Купонный период считается не с даты начала текущего периода, а с даты окончания предыдущего т.е. - в 1ый день периода купон уже начисляется
	//2. Купонный период = 0 в день окончания купонного периода		
	Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Промсвязьбанк")
		ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПСБ_013") Тогда
		
	    Если Не НаУтро И НачалоДня(Период) = ДатаОкончанияКупона Тогда
			Возврат 0;
		Иначе				
			НачалоПериода = НачалоПериода - 24 * 60 * 60;
		КонецЕсли;
	
	КонецЕсли;
	
	Если (НЕ НаУтро) И (НачалоПериода = Период ИЛИ ДатаОкончанияКупона = Период) Тогда //В день погашения вечером после погашения
		Возврат 0 + Добавка;
	КонецЕсли;
	
	// #414233 - правильный расчет через ставку ИПЦ
	// #411739 - правильный расчет через ставку руониа
	Если ЗначениеЗаполнено(ФормулаРасчетаСтавки) 
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Магистраль_002")
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЖД_028") // хоть и есть формула НКД считается через ставку, так в решении о выпуске сказано
		Тогда
	
		Составляющие = ФормулаРасчетаСтавки.Составляющие;
		
		Если Составляющие.Количество() = 2 
			И Составляющие[0].БазаРасчета = Справочники.БазыРасчета.ИндексПотребительскихЦен
			И Составляющие[1].БазаРасчета = Справочники.БазыРасчета.ФиксированнаяСтавка Тогда
			
			ВидПрогнознойПроцентнойСтавки = Составляющие[0].ПараметрыРасчета.Получить().ПараметрРасчетаВидИПЦ;
			
			ПрогнозИПЦ = РегистрыСведений.ПроцентныеПоказатели.ПрогнозноеЗначениеПоказателя(
				ВидПрогнознойПроцентнойСтавки,
				КонецМесяца(ДобавитьМесяц(НачалоПериода, -2)),
				ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Росстат"),
				Период,
				Истина);
				
			Процент = ПрогнозИПЦ - 100 + Составляющие[1].ПараметрыРасчета.Получить().ПараметрРасчетаСтавка;
				
		ИначеЕсли Составляющие.Количество() = 1
			И Составляющие[0].БазаРасчета = Справочники.БазыРасчета.БиржевойИндекс
			И Составляющие[0].ПараметрыРасчета.Получить().ПараметрРасчетаБиржевойИндекс = ОбщегоНазначения.ПолучитьИменованныйОбъект("Индекс_РУОНИА")
			И Составляющие[0].ПараметрыРасчета.Получить().ПараметрСреднеарифметическое Тогда 
			
			Возврат РассчитатьКотировкуКупонаПоСреднейСтавкеРУОНИА(ЦеннаяБумага, Период);
			
		ИначеЕсли Составляющие.Количество() = 1
			И Составляющие[0].БазаРасчета = Справочники.БазыРасчета.БиржевойИндекс
			И Составляющие[0].ПараметрыРасчета.Получить().ПараметрРасчетаБиржевойИндекс = ОбщегоНазначения.ПолучитьИменованныйОбъект("Срочное_РУОНИА")
			И НЕ Составляющие[0].ПараметрыРасчета.Получить().ПараметрСреднеарифметическое Тогда 
			
			Возврат РассчитатьКотировкуКупонаПоИндексуРУОНИА(Период, НачалоПериода, 1000);
			
		ИначеЕсли Составляющие.Количество() = 2
			И Составляющие[0].БазаРасчета = Справочники.БазыРасчета.БиржевойИндекс
			И Составляющие[0].ПараметрыРасчета.Получить().ПараметрРасчетаБиржевойИндекс = ОбщегоНазначения.ПолучитьИменованныйОбъект("Индекс_РУОНИА")
			И Составляющие[0].ПараметрыРасчета.Получить().ПараметрСреднеарифметическое
			И Составляющие[1].БазаРасчета = Справочники.БазыРасчета.ФиксированнаяСтавка 
			И (НЕ(СтавкаОпределена И Категория = Перечисления.КатегорииОблигаций.Государственная) Или ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин29007")) Тогда // для госов правило: если ставку определили, то считаем по ней. UPD: а вот и не для всех 29007
			
			// очень оригинальная облигация где берется среднее арифметическое от средней руониа 
			Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РоссельхозбанкАО_4B02-11-03349-B-002P") Тогда
				
				Возврат РассчитатьКотировкуКупонаПоСреднейЗаПериодСреднейСтавкиРУОНИА(ЦеннаяБумага, Период, Составляющие[1].ПараметрыРасчета.Получить().ПараметрРасчетаСтавка, -7, 31);
				
			ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин29007") Тогда
				
				Возврат РассчитатьКотировкуКупонаПоСреднейЗаПериодСреднейСтавкиРУОНИА(ЦеннаяБумага, Период, Составляющие[1].ПараметрыРасчета.Получить().ПараметрРасчетаСтавка, -2);
				
			КонецЕсли;
			
			Смещение = 7;
			СмещениеВКалендарныхДнях = Истина;
			Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЕСОЛиз2П5") Тогда
				
				Смещение = 5;
				
			КонецЕсли;
			
			Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЕСОЛиз2П5") Тогда
				
				СмещениеВКалендарныхДнях = Ложь;	
				
			КонецЕсли;	
			
			
			Возврат РассчитатьКотировкуКупонаПоСреднейСтавкеРУОНИА(ЦеннаяБумага, Период, Составляющие[1].ПараметрыРасчета.Получить().ПараметрРасчетаСтавка, Смещение, СмещениеВКалендарныхДнях);
			
		ИначеЕсли Составляющие.Количество() > 0
			И Составляющие[0].БазаРасчета = Справочники.БазыРасчета.КлючеваяСтавкаЦБРФ Тогда
			
			// Т.к. изначально ПараметрСреднеарифметическое не был предусмотрен для КлючеваяСтавкаЦБРФ
			// то у старых настроек расчета его может не быть
			ПараметрСреднеарифметическое = Ложь;
			Если Составляющие[0].ПараметрыРасчета.Получить().Свойство("ПараметрСреднеарифметическое", ПараметрСреднеарифметическое) Тогда
				
				Если ПараметрСреднеарифметическое Тогда
				
					ФиксированнаяСтавка = 0;
					Если Составляющие.Количество() = 2
						И Составляющие[1].БазаРасчета = Справочники.БазыРасчета.ФиксированнаяСтавка Тогда
						
						ФиксированнаяСтавка = Составляющие[1].ПараметрыРасчета.Получить().ПараметрРасчетаСтавка;
					
					КонецЕсли;
					
					Смещение = 7;
					СмещениеВКалендарныхДнях = Истина;
					Если ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_ХК_МЕТАЛЛОИНВЕСТ")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_МегаФон")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_РЕСО_Лизинг")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Алроса")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Полипласт")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Икс5Финанс")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Магнит")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_ПГК")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Брусника")
						ИЛИ ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Яндекс")
						ИЛИ (ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_РусГидро") 
							И (ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РусГид2Р01")
							И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РусГид2Р05")
							И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РусГид2Р09")
							И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РусГид2Р06")))
						ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_СибурХ1Р04")
						ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_СибурХ1Р05")
						ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_СибурХ1Р06")
						ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_НорНикБ1P9") Тогда
												
						Смещение = 5;
					
					КонецЕсли;
					
					Точность = 0;
					Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Аэрофьюэлз_003")
						ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Кокс_001")
						ИЛИ ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_2P-10") Тогда
					
						Точность = 2;
					
					КонецЕсли;
					
					Если ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_ХК_МЕТАЛЛОИНВЕСТ") 
						Или ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЕСОЛиз2П2")
						Или ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ЕврХол3P01")
						Или ЦеннаяБумага.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Магнит") Тогда
						СмещениеВКалендарныхДнях = Ложь;	
					КонецЕсли;	
					
					Возврат РассчитатьКотировкуКупонаПоСреднейСтавкеРефинансирования(ЦеннаяБумага, Период,  Составляющие[1].ПараметрыРасчета.Получить().ПараметрРасчетаСтавка, Смещение, СмещениеВКалендарныхДнях, Точность);
				
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ СтавкаОпределена Тогда
			
				ДатаКлючевойСтавки = НачалоПериода - 5 * 24 * 60 * 60; // 5й день перед началом купона - взял из проспектов РСХБ, Роснефти и ГТКЛ т.к. у всех 5й день
				
				ЗначениеКлючевойСтавки = РегистрыСведений.ПроцентныеПоказатели.ПрогнозноеЗначениеПоказателя(
					Перечисления.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ,
					ДатаКлючевойСтавки,
					ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрЛицо_ЦБРФ"),
					ДатаКлючевойСтавки,
					Истина);
				
				Процент = ЗначениеКлючевойСтавки + Составляющие[1].ПараметрыРасчета.Получить().ПараметрРасчетаСтавка;
			
			КонецЕсли;
			
		ИначеЕсли ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_Дол")
			И НЕ СтавкаОпределена Тогда
			
			Процент = 2.2;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗначенияБиржевыхИндексов.YIELD КАК YIELD
				|ИЗ
				|	РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
				|ГДЕ
				|	ЗначенияБиржевыхИндексов.Период = &ПериодEURIBOR_6M
				|	И ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс";
			
			Запрос.УстановитьПараметр("БиржевойИндекс", ОбщегоНазначения.ПолучитьИменованныйОбъект("Индекс_6M_EURIBOR"));
			Запрос.УстановитьПараметр("ПериодEURIBOR_6M", НачалоПериода - 24 * 60 * 60);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Процент = Процент + Макс(ВыборкаДетальныеЗаписи.YIELD,0);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	Если ИндексируемыйНоминал Тогда //по ним все считается по последнему номиналу!!!
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НоминалыЦенныхБумагСрезПоследних.Номинал
			|ИЗ
			|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалыЦенныхБумагСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Купон = РассчитатьКупон(БазаРасчета, НачалоПериода, Период, ВыборкаДетальныеЗаписи.Номинал, Процент);
			Возврат Окр(Купон, ТочностьОкругления, 1);
			
		Иначе
			
			Возврат 0;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если Категория = Перечисления.КатегорииОблигаций.Государственная
		И ЦеннаяБумага.УчетныйАктивЦБРФ <> Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств // появилась облигация Казахии и поломала схему
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_МинфинРоссии_128") // это очень старая бумага и купон по ней считаем по общей схеме
		ИЛИ Категория = Перечисления.КатегорииОблигаций.Субфедеральная // #426153 - прав-во Москвы по формуле для ОФЗ с 1го апреля 2022
			И Период >= '20220401'
			И ЦеннаяБумага.Эмитент.ЮрФизЛицо = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ПрМосквыВЛицеДФ")
		ИЛИ БазаРасчета = Перечисления.БазыРасчетаОблигаций.ActICMA
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Беларусь_BYM000001917") //постановление Министерства финансов Республики Беларусь от 11 июля 2018 г. №51
		Тогда 
			
		// Считаем по методике ММВБ
		ДнейВПериоде = (НачалоДня(Период) - НачалоДня(НачалоПериода)) / (60 * 60 * 24);
		
		Если БазаРасчета = Перечисления.БазыРасчетаОблигаций._30E360 Тогда // у валютных госбумаг нужно учитывать базу расчета
			ДнейВПериоде = (Год(Период) - Год(НачалоПериода)) * 360 + (Месяц(Период) - Месяц(НачалоПериода)) * 30 + (Мин(30, День(Период)) - Мин(30, День(НачалоПериода)));
		КонецЕсли;			
		
		Добавка = 0;
		// по этой бумаге Минфин дал таблицу купонов до 1.5.23 и там странные добавки
		Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин52005") Тогда
			Если НачалоДня(Период) = '20230407' Тогда
				Добавка = -0.02;
			ИначеЕсли Период >= '20230319' И Период < '20230323' ИЛИ Период >= '20230327' И Период < '20230424' Тогда
				Добавка = -0.01;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Окр(СуммаКупона * ДнейВПериоде / Срок, ТочностьОкругления, 1) + Добавка;
		
	КонецЕсли;
	
	Если НачалоНоминалы = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
			|ИЗ
			|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
			|ГДЕ
			|	НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
			|	И НоминалыЦенныхБумаг.Период < &Период";

		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НачалоНоминалы = ВыборкаДетальныеЗаписи.Период;
		Иначе //Данные по номиналу берем из карточки т.к. истории номиналов нет
			Номинал = ЦеннаяБумага.Номинал;
			
			Купон = РассчитатьКупон(БазаРасчета, НачалоПериода, Период, Номинал, Процент);
			Возврат Окр(Купон, ТочностьОкругления, 1) + Добавка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумаг.Период КАК НачалоПериода,
		|	НоминалыЦенныхБумаг.Номинал,
		|	МИНИМУМ(НоминалыЦенныхБумаг1.Период) КАК КонецПериода
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг1
		|		ПО НоминалыЦенныхБумаг.ЦеннаяБумага = НоминалыЦенныхБумаг1.ЦеннаяБумага
		|			И НоминалыЦенныхБумаг.Период < НоминалыЦенныхБумаг1.Период
		|ГДЕ
		|	НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
		|	И НоминалыЦенныхБумаг.Период >= &ПериодНачало
		|
		|СГРУППИРОВАТЬ ПО
		|	НоминалыЦенныхБумаг.Период,
		|	НоминалыЦенныхБумаг.Номинал
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачалоПериода";

	Запрос.УстановитьПараметр("ПериодНачало", Мин(НачалоПериода, НачалоНоминалы));
	Запрос.УстановитьПараметр("КонецПериода", Период);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Купон = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачалоПериодаРасчета = Макс(НачалоПериода, ВыборкаДетальныеЗаписи.НачалоПериода);
		Если ВыборкаДетальныеЗаписи.КонецПериода = NULL Тогда
			КонецПериодаРасчета = Период;
		Иначе
			КонецПериодаРасчета = Мин(Период, ВыборкаДетальныеЗаписи.КонецПериода);	
		КонецЕсли;
		
		Если НачалоПериодаРасчета >= Период Тогда
			Прервать;
		КонецЕсли;
		
		КупонЗаПериод = РассчитатьКупон(БазаРасчета, НачалоПериодаРасчета, КонецПериодаРасчета, ВыборкаДетальныеЗаписи.Номинал, Процент);
		
		Купон = Купон + КупонЗаПериод;
		
	КонецЦикла;

	Возврат Окр(Купон, ТочностьОкругления, 1) + Добавка;
	
КонецФункции

Функция РассчитатьКупон(БазаРасчета, ДатаНачала, ДатаОкончания, Номинал, Процент, ПотерянныйДень = 0) Экспорт
	
	// По этим базам считается по всему периоду
	Если БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365L ИЛИ БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365Fixed Тогда 
		
		Возврат (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (24 * 60 * 60) * Номинал * Процент / 100 / КоличествоДнейВГоду(БазаРасчета, ДатаОкончания);

	// По остальным базам нужно делать цикл по годам и вызывать эту же функцию рекурсивно для каждого года
	ИначеЕсли Год(ДатаНачала) <> Год(ДатаОкончания) Тогда
		
		// за 1ый год, он неполный
		Купон = РассчитатьКупон(БазаРасчета, ДатаНачала, НачалоДня(КонецГода(ДатаНачала)), Номинал, Процент, 1);
		
		// за все полные года, входящие в купонный период
		КоличествоПолныхЛет = Год(ДатаОкончания) - Год(ДатаНачала) - 1;
		Для Сч = 1 По КоличествоПолныхЛет Цикл
			Купон = Купон + РассчитатьКупон(БазаРасчета, Дата(Год(ДатаНачала) + Сч, 1, 1), Дата(Год(ДатаНачала) + Сч, 12, 31), Номинал, Процент, 1);
		КонецЦикла;
		
		// за последний год, он неполный
		Купон = Купон + РассчитатьКупон(БазаРасчета, НачалоДня(НачалоГода(ДатаОкончания)), ДатаОкончания, Номинал, Процент);
		
		Возврат Купон;
		
	// А это расчет за один год
	Иначе
		// это 2 очень редкие, почти неиспользуемые базы, поэтому долго не прилетало
		Если БазаРасчета = Перечисления.БазыРасчетаОблигаций.ActICMA
			ИЛИ БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365 Тогда
			КоличествоДней = (ДатаОкончания - ДатаНачала) / 86400;
		Иначе
			КоличествоДней = (Месяц(ДатаОкончания) - Месяц(ДатаНачала)) * 30
				+ ПолучитьДеньМесяцаПоБазеРасчета(ДатаОкончания, БазаРасчета, ДатаНачала)
				- ПолучитьДеньМесяцаПоБазеРасчета(ДатаНачала, БазаРасчета, ДатаНачала);
		КонецЕсли;
		
		КоличествоДней = КоличествоДней + ПотерянныйДень; //при разбивании периода на до НГ и после НГ теряется один день, нужно его компенсировать.
		
		Возврат КоличествоДней * Номинал * Процент / 100 / КоличествоДнейВГоду(БазаРасчета, ДатаОкончания);
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДеньМесяцаПоБазеРасчета(Дата, БазаРасчета, Дата2)

	Если БазаРасчета = Перечисления.БазыРасчетаОблигаций._30E360 Тогда
	
		Возврат Мин(30, День(Дата));
		
	ИначеЕсли БазаРасчета = Перечисления.БазыРасчетаОблигаций._30E360_ISDA Тогда
		
		// если D=31 или D-последний день февраля, то D=30
		
		Возврат ?(КонецДня(Дата) = КонецМесяца(Дата), 30, День(Дата));
		
	ИначеЕсли БазаРасчета = Перечисления.БазыРасчетаОблигаций._30360US Тогда
		
		// если D1=31 или D1-последний день февраля, то D1=30
		// если D2=31 и D1=31 или D1-последний день февраля и D2-последний день февраля, то D2=30
		
		Если Дата = Дата2 Тогда // считаем D1 
			Возврат ?(КонецДня(Дата) = КонецМесяца(Дата), 30, День(Дата));
		Иначе // считаем D2
			Если День(Дата) = 31 И День(Дата2) = 31 
				ИЛИ Месяц(Дата) = 2 И Месяц(Дата2) = 2 И КонецДня(Дата) = КонецМесяца(Дата) И КонецДня(Дата2) = КонецМесяца(Дата2)
			Тогда
				Возврат 30;
			Иначе
				Возврат День(Дата);
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		Возврат День(Дата);
		
	КонецЕсли;

КонецФункции

Функция КоличествоДнейВГоду(БазаРасчета, Дата)
	
	Если БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365Fixed Тогда
		Возврат 365;
	ИначеЕсли БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act360 Тогда
		Возврат 360;
	ИначеЕсли БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365 Тогда
		Возврат (КонецГода(Дата) + 1 - НачалоГода(Дата)) / 86400;
	ИначеЕсли БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365L Тогда
		Возврат (КонецГода(Дата) + 1 - НачалоГода(Дата)) / 86400;
	ИначеЕсли БазаРасчета = Перечисления.БазыРасчетаОблигаций._30E360 Тогда
		Возврат 360;
	ИначеЕсли БазаРасчета = Перечисления.БазыРасчетаОблигаций.ActICMA Тогда 
		Возврат (КонецГода(Дата) + 1 - НачалоГода(Дата)) / 86400;
	КонецЕсли;
	
КонецФункции

// Возвращает необходимость расчета купона в случаях, когда ММВБ перестает считать НКД
//
// Параметры:
//	ЦеннаяБумага	- СправочникСсылка.Облигации	- облигация
//	Период			- Дата							- дата
//
// Возвращаемое значение:
//	Булево - Истина, когда требуется расчет купона 
//
Функция ТребуетсяРасчетКупона(ЦеннаяБумага, Период) Экспорт
	
	// Иногда ММВБ перестает считать НКД определенных бумаг, тогда по ним в котировках купона приходят 0.
	// В таких случаях требуется выполнять расчет купона самостоятельно
	
	ТребуетсяРасчетКупона = Ложь;
	
	Если Период >= '20190925' И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БизнесКонсалтиг")
		ИЛИ Период >= '20190925' И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БКЗ_ФИНАНС")
		ИЛИ Период >= '20190925' И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ТМ-энергоФинанс")
		ИЛИ Период >= '20210504' И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Alliance20")
		ИЛИ Период >= '20210526' И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОВКФинанс") И Период < '20211124' // исключил дату погашения
		ИЛИ Период = '20240227' И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Роснефть_005")
		ИЛИ Период >= '20240530' И ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_ПропертизФин")
	Тогда
		ТребуетсяРасчетКупона = Истина;	
	КонецЕсли;
	
	Возврат ТребуетсяРасчетКупона;
	
КонецФункции

Функция ТочностьРасчетногоКупона(ЦеннаяБумага, Период, ВалютаНоминала = Неопределено, СчетДоверительногоУправления = Неопределено) Экспорт
	
	ТочностьКупона = 2;
		
	Если ВалютаНоминала = Неопределено Тогда 
		ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦеннаяБумага, "ВалютаНоминала");
	КонецЕсли;
	
	Если ВалютаНоминала <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль")		// точность 4 знака нужна для валютных бумаг
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_Дол")		// по этим бумагам точность 2 - ММВБ не дает по ним купона и мы считаем до 2х
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_До2")
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_011")
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГазпромКапиталООО_006") // по этой бумаге точность задана в проспекте эмиссии
		И ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V")		// по этой бумаге точность задана в проспекте эмиссии
	Тогда
		ТочностьКупонаДляОблигацийВВалюте = Неопределено;
		Если СчетДоверительногоУправления <> Неопределено Тогда
			БухгалтерскийУчет.ОпределитьРасчетнуюНастройкуУчета(Период, Неопределено, СчетДоверительногоУправления, "ТочностьРасчетногоКупонаДляОблигацийВВалюте", ТочностьКупонаДляОблигацийВВалюте);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ТочностьКупонаДляОблигацийВВалюте) Тогда
			ТочностьКупона = ТочностьКупонаДляОблигацийВВалюте;
		Иначе 	
			ТочностьКупона = 4;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_CBOM_4.7_01/29/25")
		И НачалоДня(Период) = '20231230' Тогда
	
		ТочностьКупона = 6;
	
	КонецЕсли;
	
	Возврат ТочностьКупона;
	
КонецФункции

#Область Корректировки_купона

Функция РассчитатьКотировкуКупонаПоСреднейСтавкеРУОНИА(ЦеннаяБумага, ДатаКотировки, Добавка = 0, Смещение = 7, СмещениеВКалендарныхДнях = Истина)
	
	Если СмещениеВКалендарныхДнях Тогда
		СмещениеКупонногоПериода = Смещение;	
	Иначе
		СмещениеКупонногоПериода = 0;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(КупонныйДоходПоОблигациям.Период) КАК ДатаНачалаПериодаКупона
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.Период <= &Период";
	
	Запрос.УстановитьПараметр("Облигация", ЦеннаяБумага);
	Запрос.УстановитьПараметр("Период", ДатаКотировки);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона = ДатаКотировки Тогда
			Возврат 0;
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона = NULL Тогда // запросили за дату ранее начала расчетов купонов
			Возврат 0;
		Иначе
			ДатаНачалаРуониа = ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона - (СмещениеКупонногоПериода - 1) * 60 * 60 * 24;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	ДатаОкончанияРуониа = ДатаКотировки - СмещениеКупонногоПериода * 60 * 60 * 24;

	
	Запрос = Новый Запрос;
	
	Если СмещениеВКалендарныхДнях Тогда
			
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеКалендаря.Дата КАК Дата
			|ПОМЕСТИТЬ _Дни
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Дни.Дата КАК Дата,
			|	МАКСИМУМ(ЗначенияБиржевыхИндексов.Период) КАК Период
			|ПОМЕСТИТЬ _ДниРуониа
			|ИЗ
			|	_Дни КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|		ПО _Дни.Дата >= ЗначенияБиржевыхИндексов.Период
			|			И (ЗначенияБиржевыхИндексов.Биржа = &Биржа)
			|			И (ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс)
			|
			|СГРУППИРОВАТЬ ПО
			|	_Дни.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(_ДниРуониа.Дата, ГОД), КОНЕЦПЕРИОДА(_ДниРуониа.Дата, ГОД), ДЕНЬ) = 364
			|			ТОГДА ВЫРАЗИТЬ((ЗначенияБиржевыхИндексов.CLOSE + &Добавка) * 1000 / 365 / 100 КАК ЧИСЛО(21, 19))
			|		ИНАЧЕ ВЫРАЗИТЬ((ЗначенияБиржевыхИндексов.CLOSE + &Добавка) * 1000 / &ДнейВВисокосномГоду / 100 КАК ЧИСЛО(21, 19))
			|	КОНЕЦ КАК СтавкаЗаДень,
			|	_ДниРуониа.Дата КАК Дата
			|ИЗ
			|	_ДниРуониа КАК _ДниРуониа
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|		ПО _ДниРуониа.Период = ЗначенияБиржевыхИндексов.Период
			|			И (ЗначенияБиржевыхИндексов.Биржа = &Биржа)
			|			И (ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс)
			|ИТОГИ
			|	СУММА(СтавкаЗаДень)
			|ПО
			|	ОБЩИЕ";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеКалендаря.Дата КАК Дата
			|ПОМЕСТИТЬ _Дни
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, &Смещение - 30) И ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 15)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 999
			|	ДанныеКалендаря.Дата КАК Дата,
			|	АВТОНОМЕРЗАПИСИ() КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниРабочие
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, &Смещение - 30) И ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 15)
			|	И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
			|			ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДниРабочие.Дата КАК Дата,
			|	_ДниРабочие.ПорядковыйНомерДня КАК ПорядковыйНомерДня,
			|	МАКСИМУМ(_ДниРабочиеСоСмещением.Дата) КАК ДатаСоСмещением
			|ПОМЕСТИТЬ _ДниРабочиеСоСмещением
			|ИЗ
			|	_ДниРабочие КАК _ДниРабочие
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниРабочие КАК _ДниРабочиеСоСмещением
			|		ПО (_ДниРабочие.ПорядковыйНомерДня >= _ДниРабочиеСоСмещением.ПорядковыйНомерДня - &Смещение)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДниРабочие.Дата,
			|	_ДниРабочие.ПорядковыйНомерДня
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Дни.Дата КАК Дата,
			|	ВЫБОР
			|		КОГДА _Дни.Дата = _ДниРабочиеСоСмещением.Дата
			|			ТОГДА _ДниРабочиеСоСмещением.ПорядковыйНомерДня
			|		ИНАЧЕ _ДниРабочиеСоСмещением.ПорядковыйНомерДня + 1
			|	КОНЕЦ КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного
			|ИЗ
			|	_Дни КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниРабочиеСоСмещением КАК _ДниРабочиеСоСмещением
			|		ПО _Дни.Дата >= _ДниРабочиеСоСмещением.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного.Дата КАК Дата,
			|	МАКСИМУМ(_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного.ПорядковыйНомерДня) КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничногоСГруппировкой
			|ИЗ
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного КАК _ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Дни.Дата КАК Дата,
			|	МАКСИМУМ(_ДниРабочиеСоСмещением.ДатаСоСмещением) КАК БлижайшийРабочийДень,
			|	МАКСИМУМ(_ДниРабочиеСоСмещением.ПорядковыйНомерДня) КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДни
			|ИЗ
			|	_Дни КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниРабочиеСоСмещением КАК _ДниРабочиеСоСмещением
			|		ПО _Дни.Дата >= _ДниРабочиеСоСмещением.Дата
			|
			|СГРУППИРОВАТЬ ПО
			|	_Дни.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_Дни.Дата КАК Дата,
			|	_ДниИБлижайшиеРабочиеДни.БлижайшийРабочийДень КАК БлижайшийРабочийДеньСоСмещением
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДниСоСмещением
			|ИЗ
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничногоСГруппировкой КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниИБлижайшиеРабочиеДни КАК _ДниИБлижайшиеРабочиеДни
			|		ПО _Дни.ПорядковыйНомерДня = _ДниИБлижайшиеРабочиеДни.ПорядковыйНомерДня
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДниИБлижайшиеРабочиеДниСоСмещением.Дата КАК Дата,
			|	МАКСИМУМ(ЗначенияБиржевыхИндексов.Период) КАК Период
			|ПОМЕСТИТЬ _ДниРУОНИА
			|ИЗ
			|	_ДниИБлижайшиеРабочиеДниСоСмещением КАК _ДниИБлижайшиеРабочиеДниСоСмещением
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|		ПО _ДниИБлижайшиеРабочиеДниСоСмещением.БлижайшийРабочийДеньСоСмещением >= ЗначенияБиржевыхИндексов.Период
			|			И (ЗначенияБиржевыхИндексов.Биржа = &Биржа)
			|			И (ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс)
			|ГДЕ
			|	_ДниИБлижайшиеРабочиеДниСоСмещением.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДниИБлижайшиеРабочиеДниСоСмещением.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(_ДниРУОНИА.Дата, ГОД), КОНЕЦПЕРИОДА(_ДниРУОНИА.Дата, ГОД), ДЕНЬ) = 364
			|			ТОГДА ВЫРАЗИТЬ((ЗначенияБиржевыхИндексов.CLOSE + &Добавка) * 1000 / 365 / 100 КАК ЧИСЛО(21, 19))
			|		ИНАЧЕ ВЫРАЗИТЬ((ЗначенияБиржевыхИндексов.CLOSE + &Добавка) * 1000 / &ДнейВВисокосномГоду / 100 КАК ЧИСЛО(21, 19))
			|	КОНЕЦ КАК СтавкаЗаДень,
			|	_ДниРУОНИА.Дата КАК Дата
			|ИЗ
			|	_ДниРУОНИА КАК _ДниРУОНИА
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|		ПО _ДниРУОНИА.Период = ЗначенияБиржевыхИндексов.Период
			|			И (ЗначенияБиржевыхИндексов.Биржа = &Биржа)
			|			И (ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс)
			|ИТОГИ
			|	СУММА(СтавкаЗаДень)
			|ПО
			|	ОБЩИЕ";
		
			КоличествоДнейВКупонномПериоде = (НачалоДня(ДатаОкончанияРуониа) - НачалоДня(ДатаНачалаРуониа)) / (60 * 60 * 24);
		
		    Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 999", "ПЕРВЫЕ " + Формат(КоличествоДнейВКупонномПериоде + 30 + Смещение, "ЧЦ=15; ЧДЦ=0; ЧН=1; ЧГ=0"));
		
	КонецЕсли;	
	
	// для госбумаг при расчете всегда учитывается високосность независимо от базы расчета, указанной в карточке
	Если ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Государственная
		ИЛИ ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Субфедеральная
		ИЛИ ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
	
		ДнейВВисокосномГоду = 366;
		
	// для корпоративных бумаг мы зависим от базы расчета - если она Fixed, то високосность не считаем
	ИначеЕсли ЦеннаяБумага.БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365Fixed
		ИЛИ ЦеннаяБумага.БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365 Тогда
		
		ДнейВВисокосномГоду = 365;
		
	// а если не Fixed, то считаем
	Иначе
		
		ДнейВВисокосномГоду = 366;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("СРО_НФА"));
	Запрос.УстановитьПараметр("БиржевойИндекс", ОбщегоНазначения.ПолучитьИменованныйОбъект("Индекс_РУОНИА"));
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаРуониа);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияРуониа);
	Запрос.УстановитьПараметр("Календарь", Справочники.Календари.Общероссийский);
	Запрос.УстановитьПараметр("Добавка", Добавка);
	Запрос.УстановитьПараметр("ДнейВВисокосномГоду", ДнейВВисокосномГоду);
	Запрос.УстановитьПараметр("Смещение", -Смещение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	Возврат Окр(ВыборкаОбщийИтог.СтавкаЗаДень, 2);
	
КонецФункции

Функция РассчитатьКотировкуКупонаПоСреднейЗаПериодСреднейСтавкиРУОНИА(ЦеннаяБумага, ДатаКотировки, Добавка = 0, ДнейОтступа = 0, ДнейПрошлогоПериода = Неопределено)
	
	РеквизитыЦеннойБумаги = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЦеннаяБумага, "ДатаНачалаОбращения, ДатаПогашения, Категория, БазаРасчета, УчетныйАктивЦБРФ, Эмитент");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(КупонныйДоходПоОблигациям.Период) КАК ДатаНачалаПериодаКупона
		|ПОМЕСТИТЬ _НачалоКупонногоПериода
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.Период <= &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(КупонныйДоходПоОблигациям.Период) КАК ДатаОкончанияПериодаКупона
		|ПОМЕСТИТЬ _ОкочаниеКупонногоПериода
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.Период >= &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_НачалоКупонногоПериода.ДатаНачалаПериодаКупона) КАК ДатаНачалаПериодаКупона,
		|	МАКСИМУМ(КупонныйДоходПоОблигациям.Период) КАК ДатаНачалаПрошлогоПериодаКупона,
		|	МИНИМУМ(_ОкочаниеКупонногоПериода.ДатаОкончанияПериодаКупона) КАК ДатаОкончанияПериодаКупона
		|ИЗ
		|	_НачалоКупонногоПериода КАК _НачалоКупонногоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|		ПО (КупонныйДоходПоОблигациям.Период < _НачалоКупонногоПериода.ДатаНачалаПериодаКупона)
		|			И (КупонныйДоходПоОблигациям.Облигация = &Облигация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОкочаниеКупонногоПериода КАК _ОкочаниеКупонногоПериода
		|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("Облигация", ЦеннаяБумага);
	Запрос.УстановитьПараметр("Период", ДатаКотировки);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона = ДатаКотировки Тогда
			Возврат 0;
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона = NULL Тогда // запросили за дату ранее начала расчетов купонов
			Возврат 0;
		Иначе
			ДатаНачалаПериодаКупона = ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона;
			Если ДнейПрошлогоПериода = Неопределено И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачалаПрошлогоПериодаКупона) Тогда
				ДнейПрошлогоПериода = (НачалоДня(ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона) - НачалоДня(ВыборкаДетальныеЗаписи.ДатаНачалаПрошлогоПериодаКупона)) / (60 * 60 * 24);	
			ИначеЕсли ДнейПрошлогоПериода = Неопределено И Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачалаПрошлогоПериодаКупона) Тогда
				ДнейПрошлогоПериода = (НачалоДня(ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона) - НачалоДня(РеквизитыЦеннойБумаги.ДатаНачалаОбращения)) / (60 * 60 * 24);	
			КонецЕсли;	
			
			ДатаОкончанияПериодаКупона = ВыборкаДетальныеЗаписи.ДатаОкончанияПериодаКупона;
			Если Не ЗначениеЗаполнено(ДатаОкончанияПериодаКупона) Тогда
				ДатаОкончанияПериодаКупона = РеквизитыЦеннойБумаги.ДатаПогашения;	
			КонецЕсли;	
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Дни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = &Календарь
		|	И ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ДатаОкончанияПредидущегоКупонногоПериода, ДЕНЬ, -1 * &ДнейПрошлогоПериода), МЕСЯЦ, -2) И &ДатаОкончанияПредидущегоКупонногоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Дни.Дата КАК Дата,
		|	МАКСИМУМ(ЗначенияБиржевыхИндексов.Период) КАК Период
		|ПОМЕСТИТЬ _ДниРуониа
		|ИЗ
		|	_Дни КАК _Дни
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|		ПО _Дни.Дата >= ЗначенияБиржевыхИндексов.Период
		|			И (ЗначенияБиржевыхИндексов.Биржа = &Биржа)
		|			И (ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс)
		|
		|СГРУППИРОВАТЬ ПО
		|	_Дни.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_ДниРуониа.Период) КАК ПериодМаксимум,
		|	МИНИМУМ(ДОБАВИТЬКДАТЕ(_ДниРуониа.Период, ДЕНЬ, -1 * &ДнейПрошлогоПериода)) КАК ПериодМинимум
		|ПОМЕСТИТЬ _ДниРуониаМаксимумМинимум
		|ИЗ
		|	_ДниРуониа КАК _ДниРуониа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниСреднееРуониаХХДней
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДниРуониаМаксимумМинимум КАК _ДниРуониаМаксимумМинимум
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ДанныеКалендаря.Календарь = &Календарь
		|	И ДанныеКалендаря.Дата МЕЖДУ _ДниРуониаМаксимумМинимум.ПериодМинимум И _ДниРуониаМаксимумМинимум.ПериодМаксимум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДниРуониаМаксимумМинимум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниСреднееРуониаХХДней.Дата КАК Период,
		|	МАКСИМУМ(ЗначенияБиржевыхИндексов.Период) КАК ПериодЗначенияБиржевыхИндексов
		|ПОМЕСТИТЬ _ДниДляСрезПоследнихРуониаЗаХХДней
		|ИЗ
		|	_ДниСреднееРуониаХХДней КАК _ДниСреднееРуониаХХДней
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|		ПО _ДниСреднееРуониаХХДней.Дата >= ЗначенияБиржевыхИндексов.Период
		|			И (ЗначенияБиржевыхИндексов.Биржа = &Биржа)
		|			И (ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДниСреднееРуониаХХДней.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниДляСрезПоследнихРуониаЗаХХДней.Период КАК Период,
		|	ЗначенияБиржевыхИндексов.CLOSE КАК CLOSE
		|ПОМЕСТИТЬ _СрезПоследнихРуониаЗаХХДней
		|ИЗ
		|	_ДниДляСрезПоследнихРуониаЗаХХДней КАК _ДниДляСрезПоследнихРуониаЗаХХДней
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|		ПО (ЗначенияБиржевыхИндексов.Биржа = &Биржа)
		|			И (ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс)
		|			И (ЗначенияБиржевыхИндексов.Период = _ДниДляСрезПоследнихРуониаЗаХХДней.ПериодЗначенияБиржевыхИндексов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДниДляСрезПоследнихРуониаЗаХХДней
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниРуониа.Дата КАК Дата,
		|	(ВЫРАЗИТЬ(СУММА(ЗначенияБиржевыхИндексов.CLOSE) / &ДнейПрошлогоПериода КАК ЧИСЛО(15, 2))) + &Добавка КАК ПроцентКупона
		|ПОМЕСТИТЬ _ПроцентКупона
		|ИЗ
		|	_ДниРуониа КАК _ДниРуониа
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СрезПоследнихРуониаЗаХХДней КАК ЗначенияБиржевыхИндексов
		|		ПО _ДниРуониа.Дата >= ЗначенияБиржевыхИндексов.Период
		|			И (ЗначенияБиржевыхИндексов.Период > ДОБАВИТЬКДАТЕ(_ДниРуониа.Дата, ДЕНЬ, -&ДнейПрошлогоПериода))
		|ГДЕ
		|	_ДниРуониа.Дата = ДОБАВИТЬКДАТЕ(&ДатаОкончанияПредидущегоКупонногоПериода, ДЕНЬ, &ДнейОтступа)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДниРуониа.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаКотировки, ГОД), КОНЕЦПЕРИОДА(&ДатаКотировки, ГОД), ДЕНЬ) = 364
		|			ТОГДА РАЗНОСТЬДАТ(&ДатаОкончанияПредидущегоКупонногоПериода, &ДатаКотировки, ДЕНЬ) * _ПроцентКупона.ПроцентКупона * 1000 / 365 / 100
		|		ИНАЧЕ РАЗНОСТЬДАТ(&ДатаОкончанияПредидущегоКупонногоПериода, &ДатаКотировки, ДЕНЬ) * _ПроцентКупона.ПроцентКупона * 1000 / &ДнейВВисокосномГоду / 100
		|	КОНЕЦ КАК КотировкаКупона,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончанияПредидущегоКупонногоПериода, ГОД), КОНЕЦПЕРИОДА(&ДатаОкончанияПериодаКупона, ГОД), ДЕНЬ) = 364
		|			ТОГДА РАЗНОСТЬДАТ(&ДатаОкончанияПредидущегоКупонногоПериода, &ДатаОкончанияПериодаКупона, ДЕНЬ) * _ПроцентКупона.ПроцентКупона * 1000 / 365 / 100
		|		ИНАЧЕ РАЗНОСТЬДАТ(&ДатаОкончанияПредидущегоКупонногоПериода, &ДатаОкончанияПериодаКупона, ДЕНЬ) * _ПроцентКупона.ПроцентКупона * 1000 / &ДнейВВисокосномГоду / 100
		|	КОНЕЦ КАК СуммаКупона
		|ИЗ
		|	_ПроцентКупона КАК _ПроцентКупона";
	
	// для госбумаг при расчете всегда учитывается високосность независимо от базы расчета, указанной в карточке
	Если РеквизитыЦеннойБумаги.Категория = Перечисления.КатегорииОблигаций.Государственная
		ИЛИ РеквизитыЦеннойБумаги.Категория = Перечисления.КатегорииОблигаций.Субфедеральная
		ИЛИ РеквизитыЦеннойБумаги.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
	
		ДнейВВисокосномГоду = 366;
		
	// для корпоративных бумаг мы зависим от базы расчета - если она Fixed, то високосность не считаем
	ИначеЕсли РеквизитыЦеннойБумаги.БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365Fixed
		ИЛИ РеквизитыЦеннойБумаги.БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365 Тогда
		
		ДнейВВисокосномГоду = 365;
		
	// а если не Fixed, то считаем
	Иначе
		
		ДнейВВисокосномГоду = 366;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("СРО_НФА"));
	Запрос.УстановитьПараметр("БиржевойИндекс", ОбщегоНазначения.ПолучитьИменованныйОбъект("Индекс_РУОНИА"));
	Запрос.УстановитьПараметр("Календарь", Справочники.Календари.Общероссийский);
	Запрос.УстановитьПараметр("Добавка", Добавка);
	Запрос.УстановитьПараметр("ДнейВВисокосномГоду", ДнейВВисокосномГоду);
	Запрос.УстановитьПараметр("ДатаКотировки", ДатаКотировки);
	Запрос.УстановитьПараметр("ДнейОтступа", ДнейОтступа);
	Запрос.УстановитьПараметр("ДнейПрошлогоПериода", ДнейПрошлогоПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияПредидущегоКупонногоПериода", ДатаНачалаПериодаКупона);
	Запрос.УстановитьПараметр("ДатаОкончанияПериодаКупона", ДатаОкончанияПериодаКупона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать();
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	Если РеквизитыЦеннойБумаги.Категория = Перечисления.КатегорииОблигаций.Государственная
		И РеквизитыЦеннойБумаги.УчетныйАктивЦБРФ <> Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств // появилась облигация Казахии и поломала схему
		ИЛИ РеквизитыЦеннойБумаги.Категория = Перечисления.КатегорииОблигаций.Субфедеральная // #426153 - прав-во Москвы по формуле для ОФЗ с 1го апреля 2022
			И ДатаКотировки >= '20220401'
			И РеквизитыЦеннойБумаги.Эмитент.ЮрФизЛицо = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ПрМосквыВЛицеДФ")
		ИЛИ РеквизитыЦеннойБумаги.БазаРасчета = Перечисления.БазыРасчетаОблигаций.ActICMA
		Тогда 
			
		// Считаем по методике ММВБ
		ДнейВПериоде = (НачалоДня(ДатаКотировки) - НачалоДня(ДатаНачалаПериодаКупона)) / (60 * 60 * 24);
		Срок = (НачалоДня(ДатаОкончанияПериодаКупона) - НачалоДня(ДатаНачалаПериодаКупона)) / (60 * 60 * 24);
		СуммаКупона = Окр(ВыборкаОбщийИтог.СуммаКупона, 2);
		
		Если РеквизитыЦеннойБумаги.БазаРасчета = Перечисления.БазыРасчетаОблигаций._30E360 Тогда // у валютных госбумаг нужно учитывать базу расчета
			ДнейВПериоде = (Год(ДатаКотировки) - Год(ДатаНачалаПериодаКупона)) * 360 + (Месяц(ДатаКотировки) - Месяц(ДатаНачалаПериодаКупона)) * 30 + (Мин(30, День(ДатаКотировки)) - Мин(30, День(ДатаНачалаПериодаКупона)));
		КонецЕсли;			
		
		Возврат Окр(СуммаКупона * ДнейВПериоде / Срок, 2);
		
	Иначе
		
		Возврат Окр(ВыборкаОбщийИтог.КотировкаКупона, 2);
		
	КонецЕсли;
	
КонецФункции

Функция РассчитатьКотировкуКупонаПоСреднейСтавкеРефинансирования(ЦеннаяБумага, ДатаКотировки, Добавка = 0, Смещение = 7, СмещениеВКалендарныхДнях = Истина, Точность = 0)

	Если СмещениеВКалендарныхДнях Тогда
		СмещениеКупонногоПериода = Смещение;	
	Иначе
		СмещениеКупонногоПериода = 0;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(КупонныйДоходПоОблигациям.Период) КАК ДатаНачалаПериодаКупона
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.Период <= &Период";
	
	Запрос.УстановитьПараметр("Облигация", ЦеннаяБумага);
	Запрос.УстановитьПараметр("Период", ДатаКотировки);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона = ДатаКотировки Тогда
			Возврат 0;
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона = NULL Тогда // запросили за дату ранее начала расчетов купонов
			Возврат 0;
		Иначе
			ДатаНачалаКлючевая = ВыборкаДетальныеЗаписи.ДатаНачалаПериодаКупона - (СмещениеКупонногоПериода - 1) * 60 * 60 * 24;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	ДатаОкончанияКлючевая = ДатаКотировки - СмещениеКупонногоПериода * 60 * 60 * 24;

	Если СмещениеВКалендарныхДнях Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеКалендаря.Дата КАК Дата
			|ПОМЕСТИТЬ _Дни
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Дни.Дата КАК Дата,
			|	МАКСИМУМ(ПроцентныеПоказатели.ДатаЗначения) КАК ДатаЗначения
			|ПОМЕСТИТЬ _ДниКлючевая
			|ИЗ
			|	_Дни КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
			|		ПО _Дни.Дата >= ПроцентныеПоказатели.ДатаЗначения
			|			И (ПроцентныеПоказатели.Показатель = &КлючеваяСтавка)
			|			И (ПроцентныеПоказатели.Источник = &ЦБРФ)
			|
			|СГРУППИРОВАТЬ ПО
			|	_Дни.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(_ДниКлючевая.Дата, ГОД), КОНЕЦПЕРИОДА(_ДниКлючевая.Дата, ГОД), ДЕНЬ) = 364
			|			ТОГДА ВЫРАЗИТЬ((ПроцентныеПоказатели.ЗначениеПоказателя + &Добавка) * 1000 / 365 / 100 КАК ЧИСЛО(21, 19))
			|		ИНАЧЕ ВЫРАЗИТЬ((ПроцентныеПоказатели.ЗначениеПоказателя + &Добавка) * 1000 / &ДнейВВисокосномГоду / 100 КАК ЧИСЛО(21, 19))
			|	КОНЕЦ КАК СтавкаЗаДень,
			|	_ДниКлючевая.Дата КАК Дата
			|ИЗ
			|	_ДниКлючевая КАК _ДниКлючевая
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
			|		ПО _ДниКлючевая.ДатаЗначения = ПроцентныеПоказатели.ДатаЗначения
			|			И (ПроцентныеПоказатели.Показатель = &КлючеваяСтавка)
			|			И (ПроцентныеПоказатели.Источник = &ЦБРФ)
			|ИТОГИ
			|	СУММА(СтавкаЗаДень)
			|ПО
			|	ОБЩИЕ";
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеКалендаря.Дата КАК Дата
			|ПОМЕСТИТЬ _Дни
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, &Смещение - 30) И ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 15)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 999
			|	ДанныеКалендаря.Дата КАК Дата,
			|	АВТОНОМЕРЗАПИСИ() КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниРабочие
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, &Смещение - 30) И ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 15)
			|	И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
			|			ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДниРабочие.Дата КАК Дата,
			|	_ДниРабочие.ПорядковыйНомерДня КАК ПорядковыйНомерДня,
			|	МАКСИМУМ(_ДниРабочиеСоСмещением.Дата) КАК ДатаСоСмещением
			|ПОМЕСТИТЬ _ДниРабочиеСоСмещением
			|ИЗ
			|	_ДниРабочие КАК _ДниРабочие
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниРабочие КАК _ДниРабочиеСоСмещением
			|		ПО (_ДниРабочие.ПорядковыйНомерДня >= _ДниРабочиеСоСмещением.ПорядковыйНомерДня - &Смещение)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДниРабочие.Дата,
			|	_ДниРабочие.ПорядковыйНомерДня
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Дни.Дата КАК Дата,
			|	ВЫБОР
			|		КОГДА _Дни.Дата = _ДниРабочиеСоСмещением.Дата
			|			ТОГДА _ДниРабочиеСоСмещением.ПорядковыйНомерДня
			|		ИНАЧЕ _ДниРабочиеСоСмещением.ПорядковыйНомерДня + 1
			|	КОНЕЦ КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного
			|ИЗ
			|	_Дни КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниРабочиеСоСмещением КАК _ДниРабочиеСоСмещением
			|		ПО _Дни.Дата >= _ДниРабочиеСоСмещением.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного.Дата КАК Дата,
			|	МАКСИМУМ(_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного.ПорядковыйНомерДня) КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничногоСГруппировкой
			|ИЗ
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного КАК _ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничного.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Дни.Дата КАК Дата,
			|	МАКСИМУМ(_ДниРабочиеСоСмещением.ДатаСоСмещением) КАК БлижайшийРабочийДень,
			|	МАКСИМУМ(_ДниРабочиеСоСмещением.ПорядковыйНомерДня) КАК ПорядковыйНомерДня
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДни
			|ИЗ
			|	_Дни КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниРабочиеСоСмещением КАК _ДниРабочиеСоСмещением
			|		ПО _Дни.Дата >= _ДниРабочиеСоСмещением.Дата
			|
			|СГРУППИРОВАТЬ ПО
			|	_Дни.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_Дни.Дата КАК Дата,
			|	_ДниИБлижайшиеРабочиеДни.БлижайшийРабочийДень КАК БлижайшийРабочийДеньСоСмещением
			|ПОМЕСТИТЬ _ДниИБлижайшиеРабочиеДниСоСмещением
			|ИЗ
			|	_ДниИБлижайшиеРабочиеДниСУчетомВыходногоИлиПраздничногоСГруппировкой КАК _Дни
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниИБлижайшиеРабочиеДни КАК _ДниИБлижайшиеРабочиеДни
			|		ПО _Дни.ПорядковыйНомерДня = _ДниИБлижайшиеРабочиеДни.ПорядковыйНомерДня
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДниИБлижайшиеРабочиеДниСоСмещением.Дата КАК Дата,
			|	МАКСИМУМ(ПроцентныеПоказатели.Период) КАК Период
			|ПОМЕСТИТЬ _ДниКлючевая
			|ИЗ
			|	_ДниИБлижайшиеРабочиеДниСоСмещением КАК _ДниИБлижайшиеРабочиеДниСоСмещением
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
			|		ПО _ДниИБлижайшиеРабочиеДниСоСмещением.БлижайшийРабочийДеньСоСмещением >= ПроцентныеПоказатели.Период
			|			И (ПроцентныеПоказатели.Показатель = &КлючеваяСтавка)
			|			И (ПроцентныеПоказатели.Источник = &ЦБРФ)
			|ГДЕ
			|	_ДниИБлижайшиеРабочиеДниСоСмещением.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДниИБлижайшиеРабочиеДниСоСмещением.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(_ДниКлючевая.Дата, ГОД), КОНЕЦПЕРИОДА(_ДниКлючевая.Дата, ГОД), ДЕНЬ) = 364
			|			ТОГДА ВЫРАЗИТЬ((ПроцентныеПоказатели.ЗначениеПоказателя + &Добавка) * 1000 / 365 / 100 КАК ЧИСЛО(21, 19))
			|		ИНАЧЕ ВЫРАЗИТЬ((ПроцентныеПоказатели.ЗначениеПоказателя + &Добавка) * 1000 / &ДнейВВисокосномГоду / 100 КАК ЧИСЛО(21, 19))
			|	КОНЕЦ КАК СтавкаЗаДень,
			|	_ДниКлючевая.Дата КАК Дата
			|ИЗ
			|	_ДниКлючевая КАК _ДниКлючевая
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
			|		ПО _ДниКлючевая.Период = ПроцентныеПоказатели.Период
			|			И (ПроцентныеПоказатели.Показатель = &КлючеваяСтавка)
			|			И (ПроцентныеПоказатели.Источник = &ЦБРФ)
			|ИТОГИ
			|	СУММА(СтавкаЗаДень)
			|ПО
			|	ОБЩИЕ";
		
			КоличествоДнейВКупонномПериоде = (НачалоДня(ДатаОкончанияКлючевая) - НачалоДня(ДатаНачалаКлючевая)) / (60 * 60 * 24);
		
		    Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 999", "ПЕРВЫЕ " + Формат(КоличествоДнейВКупонномПериоде + 30 + Смещение, "ЧЦ=15; ЧДЦ=0; ЧН=1; ЧГ=0"));
	КонецЕсли;	
	
	Если Точность <> 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(21, 19)", СтрШаблон("ЧИСЛО(21, %1)", Точность));
	КонецЕсли;
	
	// для госбумаг при расчете всегда учитывается високосность независимо от базы расчета, указанной в карточке
	Если ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Государственная
		ИЛИ ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Субфедеральная
		ИЛИ ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
	
		ДнейВВисокосномГоду = 366;
		
	// для корпоративных бумаг мы зависим от базы расчета - если она Fixed, то високосность не считаем
	ИначеЕсли ЦеннаяБумага.БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365Fixed
		ИЛИ ЦеннаяБумага.БазаРасчета = Перечисления.БазыРасчетаОблигаций.Act365 Тогда
		
		ДнейВВисокосномГоду = 365;
		
	// а если не Fixed, то считаем
	Иначе
		
		ДнейВВисокосномГоду = 366;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КлючеваяСтавка", Перечисления.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ);
	Запрос.УстановитьПараметр("ЦБРФ", ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрЛицо_ЦБРФ"));
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаКлючевая);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияКлючевая);
	Запрос.УстановитьПараметр("Календарь", Справочники.Календари.Общероссийский);
	Запрос.УстановитьПараметр("Добавка", Добавка);
	Запрос.УстановитьПараметр("ДнейВВисокосномГоду", ДнейВВисокосномГоду);
	Запрос.УстановитьПараметр("Смещение", -Смещение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	Возврат Окр(ВыборкаОбщийИтог.СтавкаЗаДень, 2);
	
КонецФункции

Функция РассчитатьКотировкуКупонаПоИндексуРУОНИА(Период, НачалоПериода, Номинал)

	ДатаДляДелимого = НачалоДня(Период) - 7 * 60 * 60 * 24;
	ДатаДляДелителя = НачалоДня(НачалоПериода) - 7 * 60 * 60 * 24;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗначенияБиржевыхИндексовДелимое.CLOSE / ЗначенияБиржевыхИндексовДелитель.CLOSE - 1 КАК НКДвДоляхНоминала
		|ИЗ
		|	РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексовДелимое,
		|	РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексовДелитель
		|ГДЕ
		|	ЗначенияБиржевыхИндексовДелимое.Биржа = &Биржа
		|	И ЗначенияБиржевыхИндексовДелимое.БиржевойИндекс = &БиржевойИндекс
		|	И ЗначенияБиржевыхИндексовДелитель.Биржа = &Биржа
		|	И ЗначенияБиржевыхИндексовДелитель.БиржевойИндекс = &БиржевойИндекс
		|	И ЗначенияБиржевыхИндексовДелимое.Период = &ПериодДелимое
		|	И ЗначенияБиржевыхИндексовДелитель.Период = &ПериодДелитель";
	
	Запрос.УстановитьПараметр("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("СРО_НФА"));
	Запрос.УстановитьПараметр("БиржевойИндекс", ОбщегоНазначения.ПолучитьИменованныйОбъект("Срочное_РУОНИА"));
	Запрос.УстановитьПараметр("ПериодДелимое", ДатаДляДелимого);
	Запрос.УстановитьПараметр("ПериодДелитель", ДатаДляДелителя);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Окр(ВыборкаДетальныеЗаписи.НКДвДоляхНоминала * Номинал, 2);
	Иначе
		Возврат 0; //Техдолг: зарегать ошибку
	КонецЕсли;
	
КонецФункции

Функция РассчитатьКотировкуКупона_ОткрытиеХолдинг4B0203(ЦеннаяБумага, ДатаКотировки)

	// Данные cbonds
	// Два расчетных периода: первый с 26.07.2017 по 24.01.2018 со ставкой 11.5% годовых, второй - с 24.01.2018 по 22.07.2020 со ставкой 12.42% годовых.	
	
	Возврат Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20170726', '20180124', 1000, 11.5), 2, 1)
			+ Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20180124', НачалоДня(ДатаКотировки), 1000, 12.42), 2, 1);

КонецФункции

Функция РассчитатьКотировкуКупонаПоИндексуРУОНИАиСпреду(ЦеннаяБумага, ДатаКотировки, Спред)

   // Данные cbonds
   //1-8 купоны: Rj = (max (((Index Endj-7/Index Startj-7) - 1) ; 0) * B/Tj * 100%) + S, где: <br>
   //IndexStart j-7 - значение индекса RUONIA для 7-го календарного дня, предшествующего Start j (Start j-7), публикуемое на официальном сайте Банка России в информационно-телекоммуникационной сети "Интернет". <br>
   //В случае отсутствия опубликованного значения индекса RUONIA для Start j-7 (в том числе, если Start j-7 является выходным или праздничным днем в Российской Федерации), значение индекса RUONIA принимается равным последнему значению индекса RUONIA, опубликованному Банком России до даты Start j-7. <br>
   //IndexEnd j-7 - значение индекса RUONIA для 7-го календарного дня, предшествующего End j (End j-7), публикуемое на официальном сайте Банка России в информационно-телекоммуникационной сети "Интернет". <br>
   //В случае отсутствия опубликованного значения индекса RUONIA для End j-7 (в том числе, если End j-7 является выходным или праздничным днем в Российской Федерации), значение индекса RUONIA принимается равной последнему значению индекса RUONIA, опубликованному Банком России до даты End j-7. <br>
   //S - спред, в процентах годовых <br>
   //Tj - длительность j-го купонного периода, в днях, определяемая как End j - Start j; <br>
   //В - база расчета, определяемая по формуле: B = 1/((w/366)+(1-w)/365) <br>
   //w - доля календарных дней високосного года в периоде, за который осуществляется расчет КД за j-ый купонный период. При расчете применяются календарные дни за те же даты, за которые применяются значения индекса RUONIA, используемые для расчета НКД за данный период.
   
   
   
   Запрос = Новый Запрос;
   Запрос.Текст = 
   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
   |	МАКСИМУМ(КупонныйДоходПоОблигациям.Период) КАК Период,
   |	МАКСИМУМ(КупонныйДоходПоОблигациям.НомерКупона) КАК НомерКупона
   |ПОМЕСТИТЬ НашПериод
   |ИЗ
   |	Справочник.Облигации КАК Облигации
   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
   |		ПО (КупонныйДоходПоОблигациям.Облигация = Облигации.Ссылка)
   |ГДЕ
   |	Облигации.Ссылка = &ЦеннаяБумага
   |	И КупонныйДоходПоОблигациям.Период <= &ДатаКотировки
   |	И (Облигации.ДатаПогашения >= &ДатаКотировки
   |			ИЛИ Облигации.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1))
   |;
   |
   |////////////////////////////////////////////////////////////////////////////////
   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
   |	НашПериод.Период КАК Период,
   |	КупонныйДоходПоОблигациям.Срок КАК Срок,
   |	КупонныйДоходПоОблигациям.ДатаОкончанияКупона КАК ДатаОкончанияКупона
   |ИЗ
   |	НашПериод КАК НашПериод
   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
   |		ПО НашПериод.Период = КупонныйДоходПоОблигациям.Период
   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормулыРасчетаСтавокКупонов.СрезПоследних(&ДатаКотировки, Облигация = &ЦеннаяБумага) КАК ФормулыРасчетаСтавокКупоновСрезПоследних
   |		ПО НашПериод.НомерКупона = ФормулыРасчетаСтавокКупоновСрезПоследних.НомерКупона
   |ГДЕ
   |	КупонныйДоходПоОблигациям.Облигация = &ЦеннаяБумага";
   
   Запрос.УстановитьПараметр("ДатаКотировки", ДатаКотировки);
   Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
   
   ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
   
   Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	   
	   НачалоПериода = ВыборкаДетальныеЗаписи.Период;
	   Срок = ВыборкаДетальныеЗаписи.Срок;
	   ДатаОкончанияКупона = ВыборкаДетальныеЗаписи.ДатаОкончанияКупона;
	   
	   ДатаДляIndexEnd = НачалоДня(ДатаКотировки) - 7 * 60 * 60 * 24;
	   ДатаДляIndexStart = НачалоДня(НачалоПериода) - 7 * 60 * 60 * 24;
	   Номинал = 1000;
	   
	   Запрос = Новый Запрос;
	   Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	   |	ВЫБОР
	   |		КОГДА ЗначенияБиржевыхИндексовДелитель.CLOSE = 0
	   |			ТОГДА 0
	   |		КОГДА РАЗНОСТЬДАТ(&ПериодДелитель, &ПериодДелимое, ДЕНЬ) = 0
	   |			ТОГДА 0
	   |		КОГДА ЗначенияБиржевыхИндексовДелимое.CLOSE / ЗначенияБиржевыхИндексовДелитель.CLOSE - 1 > 0
	   |			ТОГДА ВЫРАЗИТЬ(((ЗначенияБиржевыхИндексовДелимое.CLOSE / ЗначенияБиржевыхИндексовДелитель.CLOSE - 1) * 365 / РАЗНОСТЬДАТ(&ПериодДелитель, &ПериодДелимое, ДЕНЬ) * 100 + 2.3) / 100 * РАЗНОСТЬДАТ(&ПериодДелитель, &ПериодДелимое, ДЕНЬ) / 365 * &Номинал КАК ЧИСЛО(15, 2))
	   |		ИНАЧЕ 0
	   |	КОНЕЦ КАК НКД,
	   |	ЕСТЬNULL(ЗначенияБиржевыхИндексовДелимое.CLOSE, 0) КАК ЗначенияБиржевыхИндексовДелимое_CLOSE,
	   |	ЕСТЬNULL(ЗначенияБиржевыхИндексовДелитель.CLOSE, 0) КАК ЗначенияБиржевыхИндексовДелитель_CLOSE,
	   |	РАЗНОСТЬДАТ(&ПериодДелитель, &ПериодДелимое, ДЕНЬ) КАК ДлительностьПериода
	   |ИЗ
	   |	РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексовДелимое,
	   |	РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексовДелитель
	   |ГДЕ
	   |	ЗначенияБиржевыхИндексовДелимое.Биржа = &Биржа
	   |	И ЗначенияБиржевыхИндексовДелимое.БиржевойИндекс = &БиржевойИндекс
	   |	И ЗначенияБиржевыхИндексовДелитель.Биржа = &Биржа
	   |	И ЗначенияБиржевыхИндексовДелитель.БиржевойИндекс = &БиржевойИндекс
	   |	И ЗначенияБиржевыхИндексовДелимое.Период = &ПериодДелимое
	   |	И ЗначенияБиржевыхИндексовДелитель.Период = &ПериодДелитель";
	   
	   Запрос.УстановитьПараметр("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("СРО_НФА"));
	   Запрос.УстановитьПараметр("БиржевойИндекс", ОбщегоНазначения.ПолучитьИменованныйОбъект("Срочное_РУОНИА"));
	   Запрос.УстановитьПараметр("ПериодДелимое", ДатаДляIndexEnd);
	   Запрос.УстановитьПараметр("ПериодДелитель", ДатаДляIndexStart);
	   Запрос.УстановитьПараметр("Номинал", Номинал);
	   
	   ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	   
	   Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		   Если ВыборкаДетальныеЗаписи.ЗначенияБиржевыхИндексовДелитель_CLOSE <> 0 И ВыборкаДетальныеЗаписи.ДлительностьПериода <> 0 Тогда 
			   Возврат Окр((Макс(((ВыборкаДетальныеЗаписи.ЗначенияБиржевыхИндексовДелимое_CLOSE/ВыборкаДетальныеЗаписи.ЗначенияБиржевыхИндексовДелитель_CLOSE) - 1), 0) * (365 / ВыборкаДетальныеЗаписи.ДлительностьПериода) * 100 + Спред) / 100 * ВыборкаДетальныеЗаписи.ДлительностьПериода / 365 * Номинал, 2);
		   Иначе
			   Возврат 0;
		   КонецЕсли;
	   Иначе
		   Возврат 0;
	   КонецЕсли;
	   
   Иначе
	   Возврат 0;
   КонецЕсли;
   
КонецФункции	

// ДатаКотировки - дата, на которую рассчитываем котировку купона
Функция РассчитатьКотировкуКупона_АрчерФинанс(ДатаКотировки) Экспорт
	
	//КД= КД1+ КД2, где
	//КД – величина купонного дохода по одной Облигации за 8 купонный период
	//КД1 – величина купонного дохода по одной Облигации за 1-ый Расчетный период 8-го купонного периода, которая рассчитывается по формуле:
	//КД1 = 9,25% * N *(T2 – T1) / (365 * 100%)
	//КД2 – величина купонного дохода по одной Облигации за 2-ой Расчетный период 8-го купонного периода, которая рассчитывается по формуле: КД2 = (С * N) * (Т3-Т2)) / (365 * 100%).
	//N – номинальная стоимость одной Облигации.
	//C = ОФЗ + 4,5%, где;
	//C – процентная ставка (в процентах годовых) по второму Расчетному периоду 8-го купонного периода.
	//ОФЗ – значение точки на кривой бескупонной доходности 
	//государственных ценных бумаг (ОФЗ) со сроком до погашения 1 (один) год (G-кривая), 
	//публикуемое на официальном сайте Биржи 
	//по адресу http:	//moex.com/ru/marketdata/indices/state/yieldcurve/ или по иному адресу, 
	//если такой будет определен Биржей после даты регистрации настоящих изменений Банком России, по состоянию 
	//на конец 7 (седьмого) рабочего дня, предшествующего дате начала второго Расчетного периода 8-го купонного периода (в процентах годовых).  	
	//T1 – дата начала 1 Расчетного периода 8 купонного периода, которой является дата начала 8 купонного периода;
	//Т2 - дата окончания 1 Расчетного периода 8 купонного периода и одновременно дата начала 2 Расчетного периода 8 купонного периода, которая наступает 31.05.2018 г.
	//Т3 - дата окончания 8 купонного периода, которая наступает 23.03.2027 г.
	//
	//Поскольку в рамках новации 03.04.2018 было погашение купона на 0.01 руб на облигацию, дата Т1 - 03.04.2018 г.  	
	
	ДатаРасчета = НачалоДня(ДатаКотировки);

	Если ДатаРасчета > '20270323' Тогда
		// После окончания купонного периода не рассчитываем
		Возврат 0;
	ИначеЕсли ДатаРасчета > '20200129' Тогда // с 30.01.2020 возвращаемся к расчету "как у ММВБ"
		ДатаНачалаКД1 = '20171003';
		ДатаНачалаКД2 = '20180531';
	Иначе
		ДатаНачалаКД1 = '20180403';
		ДатаНачалаКД2 = '20180531';
	КонецЕсли;
	
	ДнейКД1 	  = (ДатаНачалаКД2 - ДатаНачалаКД1) / 86400;
	ДнейКД2 	  = (ДатаРасчета - ДатаНачалаКД2) / 86400;
	
	КД1 = Окр(1000 * 0.0925 * ДнейКД1 / 365, 2, 1);
	КД2 = 1000 * 0.1114 * ДнейКД2 / 365;
	
	Возврат Окр(КД1 + КД2, 2, 1);
	
КонецФункции

// ДатаКотировки - дата, на которую рассчитываем котировку купона
// ТекущаяКотировкаКупона - котировка купона, загруженная с ММВБ
// КурсВалютыНоминала - курс, по которому нужна рассчитать котировку.
Функция РассчитатьКотировкуКупона_Финстандарт(ДатаКотировки, ТекущаяКотировкаКупона, КурсВалютыНоминала = 1) Экспорт	
	
	//13-й купонный период делится на три подпериода:
	// 1. 25.05.2018 - 30.11.2018, ставка 8.22%;
	// 2. 30.11.2018 - 25.05.2019, ставка 10.6%;
	// 3. 25.05.2019 - 22.05.2020, ставка 10.6%;
	ДатаРасчета = НачалоДня(ДатаКотировки);
	                             	
	Если ДатаРасчета > '20200522' Или ДатаРасчета < '20180525' Тогда
		// До и после окончания купонного периода с особым порядком расчета не рассчитываем
		Возврат ТекущаяКотировкаКупона;
	КонецЕсли;
	
	Сумма_1Подпериод = 0;
	Сумма_2Подпериод = 0;
	Сумма_3Подпериод = 0;
	
	// Рассчитываем Сумма_1Подпериод
	ДатаРасчета_1Подпериод = ?(ДатаРасчета >= '20181130', '20181130', ДатаРасчета);
	Сумма_1Подпериод = Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20180525', ДатаРасчета_1Подпериод, 1000, 8.22), 2, 1);
	
	// Рассчитываем Сумма_2Подпериод
	Если ДатаРасчета > '20181130' Тогда
		ДатаРасчета_2Подпериод = ?(ДатаРасчета >= '20190525', '20190525', ДатаРасчета);
		Сумма_2Подпериод = Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20181130', ДатаРасчета_2Подпериод, 1000, 10.6), 2, 1);
	КонецЕсли;
			
	// Рассчитываем Сумма_3Подпериод
	Если ДатаРасчета > '20190525' Тогда
		Сумма_3Подпериод = Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20190525', ДатаРасчета, 1000 + Сумма_1Подпериод + Сумма_2Подпериод, 10.6), 2, 1);
	КонецЕсли;
	
	Возврат Окр((Сумма_1Подпериод + Сумма_2Подпериод + Сумма_3Подпериод) * КурсВалютыНоминала, 2, 1);
	
КонецФункции

// ДатаКотировки - дата, на которую рассчитываем котировку купона
// ТекущаяКотировкаКупона - котировка купона, загруженная с ММВБ
// КурсВалютыНоминала - курс, по которому нужна рассчитать котировку.
Функция РассчитатьКотировкуКупона_Финстоун(ДатаКотировки) Экспорт	
	
	//9-й купонный период делится на 6 подпериодов:
	// 1й подпериод делится 2 подподпериода
	//	1.1. 11.01.2018	28.02.2018	9,25
	//	1.2. 28.02.2018	10.01.2019	9,86
	//	2.   10.01.2019	09.01.2020	11,3
	//	3.   09.01.2020	07.01.2021	9,02
	//	4.   07.01.2021	06.01.2022	7,93
	//	5.   06.01.2022	05.01.2023	н/о
	//	6.   05.01.2023	04.01.2024	н/о

	ДатаРасчета = НачалоДня(ДатаКотировки);
	
	СуммаКупона = 0;
	
	СуммаКупона = СуммаКупона + Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20180111', '20180228', 1000, 9.25), 2, 1);
	
	Если ДатаРасчета > '20180228' Тогда
		СуммаКупона = СуммаКупона + Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20180228', '20190110', 1000, 9.86), 2, 1);
	КонецЕсли;
	
	Если ДатаРасчета > '20190110' Тогда
		СуммаКупона = СуммаКупона + Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20190110', '20200109', 1097.52, 11.3), 2, 1);
	КонецЕсли;
	
	Если ДатаРасчета > '20200109' Тогда
		СуммаКупона = СуммаКупона + Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20200109', '20210107', 1221.2, 9.02), 2, 1);
	КонецЕсли;
	
	Если ДатаРасчета > '20210107' Тогда
		СуммаКупона = СуммаКупона + Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20210107', '20220106', 1331.05, 7.93), 2, 1);
	КонецЕсли;
	
	Если ДатаРасчета > '20220106' Тогда
		СуммаКупона = СуммаКупона + Окр(РассчитатьКупон(Перечисления.БазыРасчетаОблигаций.Act365Fixed, '20220106', ДатаРасчета, 1436.31, 11.55), 2, 1);
	КонецЕсли;
	
	Если ДатаРасчета > '20230105' Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По облигации 'Финстоун ООО, 4-01-36431-R, 1000.00 RUB' срочно необходимо исправить расчет купона! В данный момент расчет неправильный!");
	КонецЕсли;
	
	Возврат СуммаКупона;
	
КонецФункции

Функция ПолучитьКотировкуКупона_ГазпромКап40136400R003P(ДатаКотировки)

	ДатаРасчета = НачалоДня(ДатаКотировки);
	
	Если ДатаРасчета = '20221011' Тогда
		Возврат	39.05;
	ИначеЕсли ДатаРасчета = '20221012' Тогда
		Возврат	39.29;
	ИначеЕсли ДатаРасчета = '20221013' Тогда
		Возврат	39.53;
	ИначеЕсли ДатаРасчета = '20221014' Тогда
		Возврат	39.77;
	ИначеЕсли ДатаРасчета = '20221017' Тогда
		Возврат	40.49;
	ИначеЕсли ДатаРасчета = '20221018' Тогда
		Возврат	40.73;
	ИначеЕсли ДатаРасчета = '20221019' Тогда
		Возврат	40.97;
	ИначеЕсли ДатаРасчета = '20221020' Тогда
		Возврат	41.21;
	ИначеЕсли ДатаРасчета = '20221021' Тогда
		Возврат	41.45;
	ИначеЕсли ДатаРасчета = '20221024' Тогда
		Возврат	42.17;
	ИначеЕсли ДатаРасчета = '20221025' Тогда
		Возврат	42.41;
	ИначеЕсли ДатаРасчета = '20221026' Тогда
		Возврат	42.65;
	ИначеЕсли ДатаРасчета = '20221027' Тогда
		Возврат	42.89;
	КонецЕсли;
	
КонецФункции 

Функция РассчитатьСтавкуКупона(Облигация, РеквизитыОблигации, Номинал, Купон, ДатаНачала, ДатаОкончания, РазрядностьОкругления = 2) Экспорт
	
	ДнейВГоду		= КоличествоДнейВГоду(РеквизитыОблигации.БазаРасчета, ДатаОкончания);	
	ДнейВПериоде	= (ДатаОкончания - ДатаНачала) / (24 * 60 * 60);
	
	Возврат Окр(Купон * ДнейВГоду * 100 / (Номинал * ДнейВПериоде), РазрядностьОкругления, 1);
	
КонецФункции

#КонецОбласти

#Область Добавки_к_купонам_бумаг_с_реструктуризацией

Процедура ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, Облигация, ДатаСтр, Сумма)

	НоваяСтрока = ТЗ_Реструктуризации.Добавить();
	
	НоваяСтрока.Облигация	= ОбщегоНазначения.ПолучитьИменованныйОбъект(Облигация);
	НоваяСтрока.Дата		= Дата(ДатаСтр);
	НоваяСтрока.Сумма		= Сумма;

КонецПроцедуры

Функция ПолучитьДобавкуПоБумагамСРеструктуризацией(Облигация, ДатаКотировки)

	ТЗ_Реструктуризации = Новый ТаблицаЗначений;
	ТЗ_Реструктуризации.Колонки.Добавить("Облигация",	Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	ТЗ_Реструктуризации.Колонки.Добавить("Дата",		Новый ОписаниеТипов("Дата"));
	ТЗ_Реструктуризации.Колонки.Добавить("Сумма",		Новый ОписаниеТипов("Число"));
	
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БизнесКонсалтиг", "20190925", 105.53);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БизнесКонсалтиг", "20200608", 87.94);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БизнесКонсалтиг", "20210220", 70.35);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БизнесКонсалтиг", "20211104", 52.76);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БизнесКонсалтиг", "20220719", 35.17);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БизнесКонсалтиг", "20230402", 17.58);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БизнесКонсалтиг", "20231215", 0);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БКЗ_ФИНАНС", "20190925", 105.53);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БКЗ_ФИНАНС", "20200608", 87.94);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БКЗ_ФИНАНС", "20210220", 70.35);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БКЗ_ФИНАНС", "20211104", 52.76);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БКЗ_ФИНАНС", "20220719", 35.17);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БКЗ_ФИНАНС", "20230402", 17.58);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_БКЗ_ФИНАНС", "20231215", 0);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_ТМ-энергоФинанс", "20190925", 94.19);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_ТМ-энергоФинанс", "20200419", 78.49);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_ТМ-энергоФинанс", "20201113", 62.79);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_ТМ-энергоФинанс", "20210609", 47.09);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_ТМ-энергоФинанс", "20220103", 31.39);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_ТМ-энергоФинанс", "20220730", 15.69);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_ТМ-энергоФинанс", "20230223", 0);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20180215", 54.7);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20180816", 103.17);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20190214", 153.43);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20190815", 206.83);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20200213", 255.95);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20200813", 297.39);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20210211", 333.19);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20210812", 369.99);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20220210", 418.01);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20220811", 481.29);
	ДобавитьСтрокуРеструктуризации(ТЗ_Реструктуризации, "Облигация_О1_Груп_Финанс", "20230209", 532.75);
	
	Добавка = 0;
	
	НайденныеСтроки = ТЗ_Реструктуризации.НайтиСтроки(Новый Структура("Облигация", Облигация));
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Если ДатаКотировки >= НайденнаяСтрока.Дата Тогда
			Добавка = НайденнаяСтрока.Сумма;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Добавка;

КонецФункции

#КонецОбласти

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////

Процедура СоздатьДвиженияРегистраНоминалыДляПервоначальногоНоминала(ЦеннаяБумага, ДатаРегистрации = '19800101')
			
	НоминалыПерваяЗапись = РегистрыСведений.НоминалыЦенныхБумаг.СоздатьМенеджерЗаписи();
	НоминалыПерваяЗапись.Период       = ДатаРегистрации;
	НоминалыПерваяЗапись.ЦеннаяБумага = ЦеннаяБумага;
	НоминалыПерваяЗапись.Прочитать();
	
	НоминалыПерваяЗапись.Период       = ДатаРегистрации;
	НоминалыПерваяЗапись.ЦеннаяБумага = ЦеннаяБумага;
	НоминалыПерваяЗапись.Номинал      = ЦеннаяБумага.Номинал;
	НоминалыПерваяЗапись.Записать();
		
КонецПроцедуры // СоздатьДвиженияРегистраНоминалыДляПервоначальногоНоминала

Функция ВыполнитьДвиженияПоРегиструСведенийНоминалыДляПервоначальногоНоминала(ЦеннаяБумага, ДатаРегистрации = '19800101') Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Номиналы.Период,
	|	Номиналы.ЦеннаяБумага,
	|	Номиналы.Номинал
	|ИЗ
	|	РегистрСведений.НоминалыЦенныхБумаг КАК Номиналы
	|ГДЕ
	|	Номиналы.ЦеннаяБумага = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЦеннаяБумага);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()=0  Тогда  
		СоздатьДвиженияРегистраНоминалыДляПервоначальногоНоминала(ЦеннаяБумага, ДатаРегистрации);
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество()>=1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		ВыборкаДетальныеЗаписи.Получить(0);
		Если (ДатаРегистрации < ВыборкаДетальныеЗаписи.Период) или ((ДатаРегистрации = ВыборкаДетальныеЗаписи.Период) и (ВыборкаДетальныеЗаписи.Номинал<>ЦеннаяБумага.Номинал)) Тогда
			СоздатьДвиженияРегистраНоминалыДляПервоначальногоНоминала(ЦеннаяБумага, ДатаРегистрации);
		ИначеЕсли (ДатаРегистрации > ВыборкаДетальныеЗаписи.Период) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Существует значение номинала, введенное "+Формат(ВыборкаДетальныеЗаписи.Период,"ДФ=dd.MM.yyyy")+" (ранее "+Формат(ДатаРегистрации, "ДФ=dd.MM.yyyy")+").'");
			Сообщение.Сообщить();
			Возврат Истина;	
		КонецЕсли; 
	КонецЕсли; 
	
    Возврат Ложь;	
	
КонецФункции // ВыполнитьДвиженияПоРегиструСведенийНоминалыДляПервоначальногоНоминала

////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьНоминалИВалютуЦеннойБумаги(ЦеннаяБумага, Период) Экспорт
	
	НоминалИВалютаЦеннойБумаги = Новый Структура("Номинал, ВалютаНоминала");
	
	Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Акции") Тогда
		ЗаполнитьЗначенияСвойств(НоминалИВалютаЦеннойБумаги, ЦеннаяБумага);
	ИначеЕсли ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Векселя") Тогда
		ЗаполнитьЗначенияСвойств(НоминалИВалютаЦеннойБумаги, ЦеннаяБумага);
	ИначеЕсли ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НоминалыЦенныхБумагСрезПоследних.Номинал,
			|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала
			|ИЗ
			|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалыЦенныхБумагСрезПоследних";
			
		Запрос.Параметры.Вставить("Период",       Период);
		Запрос.Параметры.Вставить("ЦеннаяБумага", ЦеннаяБумага);
			
		Выборка = Запрос.Выполнить().Выбрать();	
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(НоминалИВалютаЦеннойБумаги, Выборка);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
		НоминалИВалютаЦеннойБумаги.Номинал = 0;
		НоминалИВалютаЦеннойБумаги.ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
	ИначеЕсли ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.ДепозитарныеРасписки") Тогда
		НоминалИВалютаЦеннойБумаги.Номинал = 0;
		НоминалИВалютаЦеннойБумаги.ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
	КонецЕсли;
	
	Возврат НоминалИВалютаЦеннойБумаги;
	
КонецФункции

Функция ЗаполнитьНоминалыИСуммыВсегоВТаблице(ЦенныеБумаги, Период, Организация = Неопределено) Экспорт
	
	Если ЦенныеБумаги.Количество() = 0 Тогда
		Возврат ЦенныеБумаги;
	КонецЕсли;
	
	// чтобы порядок строк в полученной таблице совпадал с порядком строк в исходной таблице,
	// упорядочим результат по номеру строки
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ЦеннаяБумага КАК ЦеннаяБумага,
		|	&СуммаВсего КАК СуммаВсего,
		|	&СуммаВсегоВВалютеУчета КАК СуммаВсегоВВалютеУчета,
		|	&СуммаВсегоРынок КАК СуммаВсегоРынок,
		|	&СуммаВсегоРынокВВалютеУчета КАК СуммаВсегоРынокВВалютеУчета,
		|	ЦенныеБумаги.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	&ЦенныеБумаги КАК ЦенныеБумаги
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ВалютаУчета КАК ВалютаУчета,
		|	&ВсеПоляЦенныхБумаг КАК ВсеПоляЦенныхБумаг,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА Акции.ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА Векселя.ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА Облигации.ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА Паи.ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА ДепозитарныеРасписки.ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ИпотечныеСертификатыУчастия.ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|				И ПроизводныеФинансовыеИнструменты.ТипПроизводногоФинансовогоИнструмента В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс), ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион))
		|			ТОГДА ПроизводныеФинансовыеИнструменты.Валюта
		|	КОНЕЦ КАК ВалютаНоминала,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА Акции.Номинал
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА Векселя.Номинал
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА НоминалыЦенныхБумагСрезПоследних.Номинал
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА 0
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА 0
		|	КОНЕЦ КАК Номинал
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Акции.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Векселя КАК Векселя
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Векселя.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Паи.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = ДепозитарныеРасписки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = ИпотечныеСертификатыУчастия.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроизводныеФинансовыеИнструменты КАК ПроизводныеФинансовыеИнструменты
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = ПроизводныеФинансовыеИнструменты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(
		|				&Период,
		|				ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.ЦеннаяБумага
		|					ИЗ
		|						_ЦенныеБумаги
		|					ГДЕ
		|						ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации))) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ЦенныеБумаги.НомерСтроки");
	
	ИсключаемыеПоля = Новый Массив;
	ИсключаемыеПоля.Добавить("НомерСтроки");
	ИсключаемыеПоля.Добавить("Номинал");
	ИсключаемыеПоля.Добавить("ВалютаНоминала");

	РасчетПоляВсего = "";
	Если ЦенныеБумаги.Колонки.Найти("Сумма") <> Неопределено
		И ЦенныеБумаги.Колонки.Найти("СуммаКупона") <> Неопределено
	Тогда
		РасчетПоляВсего = "Сумма + СуммаКупона КАК СуммаВсего,";
		ИсключаемыеПоля.Добавить("СуммаВсего");
	КонецЕсли;
	
	РасчетПоляВсегоВВалютеУчета = "";
	Если ЦенныеБумаги.Колонки.Найти("СуммаВВалютеУчета") <> Неопределено
		И ЦенныеБумаги.Колонки.Найти("СуммаКупонаВВалютеУчета") <> Неопределено
	Тогда
		РасчетПоляВсего = "СуммаВВалютеУчета + СуммаКупонаВВалютеУчета КАК СуммаВсегоВВалютеУчета,";
		ИсключаемыеПоля.Добавить("СуммаВсегоВВалютеУчета");
	КонецЕсли;
	
	РасчетПоляВсегоРынок = "";
	Если ЦенныеБумаги.Колонки.Найти("СуммаРынок") <> Неопределено
		И ЦенныеБумаги.Колонки.Найти("СуммаКупонаРынок") <> Неопределено
	Тогда
		РасчетПоляВсегоРынок = "СуммаРынок + СуммаКупонаРынок КАК СуммаВсегоРынок,";
		ИсключаемыеПоля.Добавить("СуммаВсегоРынок");
	КонецЕсли;	
	
	РасчетПоляВсегоРынокВВалютеУчета = "";
	Если ЦенныеБумаги.Колонки.Найти("СуммаРынокВВалютеУчета") <> Неопределено
		И ЦенныеБумаги.Колонки.Найти("СуммаКупонаРынокВВалютеУчета") <> Неопределено
	Тогда
		РасчетПоляВсегоРынокВВалютеУчета = "СуммаРынокВВалютеУчета + СуммаКупонаРынокВВалютеУчета КАК СуммаВсегоРынокВВалютеУчета,";
		ИсключаемыеПоля.Добавить("СуммаВсегоРынокВВалютеУчета");
	КонецЕсли;
	
	РасчетПоляВалютаУчета = "";
	Если Организация <> Неопределено
		И ЦенныеБумаги.Колонки.Найти("ВалютаУчета") <> Неопределено
	Тогда
		РасчетПоляВалютаУчета = "ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета КАК ВалютаУчета,";
		ИсключаемыеПоля.Добавить("ВалютаУчета");
	КонецЕсли;
	
	ИсключаемыеПоляСтрокой  = СтрСоединить(ИсключаемыеПоля, ", ");
	ПоляТаблицыДляЗапроса = РаботаСКоллекциями.ПолучитьПоляТаблицыДляЗапроса(ЦенныеБумаги, , ИсключаемыеПоляСтрокой);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЦеннаяБумага КАК ЦеннаяБумага",									ПоляТаблицыДляЗапроса);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаВсего КАК СуммаВсего,",										РасчетПоляВсего);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаВсегоВВалютеУчета КАК СуммаВсегоВВалютеУчета,",				РасчетПоляВсегоВВалютеУчета);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаВсегоРынок КАК СуммаВсегоРынок,",							РасчетПоляВсегоРынок);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаВсегоРынокВВалютеУчета КАК СуммаВсегоРынокВВалютеУчета,",	РасчетПоляВсегоРынокВВалютеУчета);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВсеПоляЦенныхБумаг КАК ВсеПоляЦенныхБумаг",						"_ЦенныеБумаги.*");		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВалютаУчета КАК ВалютаУчета,",									РасчетПоляВалютаУчета);
	
	Запрос.УстановитьПараметр("Период",			Период);
	Запрос.УстановитьПараметр("ЦенныеБумаги",	ЦенныеБумаги);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗаполнитьКотировкиНоминалыИСуммыВсегоВТаблице(ЦенныеБумаги, Период, Рынок, Биржа, КлиентЯвляетсяНПФилиПН, Организация = Неопределено) Экспорт
	Если ЦенныеБумаги.Количество() = 0 Тогда
		Возврат ЦенныеБумаги;
	КонецЕсли;
	
	ТекстЗапросаДляКотировок = СформироватьТекстЗапросаДляКотировок(Рынок, КлиентЯвляетсяНПФилиПН);
	Если ТекстЗапросаДляКотировок = "" Тогда
		Если Организация <> Неопределено И ЦенныеБумаги.Колонки.Найти("ВалютаУчета") <> Неопределено Тогда
			ЦенныеБумаги.ЗаполнитьЗначения(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета"), "ВалютаУчета");
		КонецЕсли;
		
		Возврат ЦенныеБумаги;
	КонецЕсли;
	
	РасчетПоляВсегоРынокВВалютеУчета = "";
	Если ЦенныеБумаги.Колонки.Найти("СуммаРынокВВалютеУчета") <> Неопределено
		И ЦенныеБумаги.Колонки.Найти("СуммаКупонаРынокВВалютеУчета") <> Неопределено 
	Тогда
		РасчетПоляВсегоРынокВВалютеУчета = "ЦенныеБумаги.СуммаРынокВВалютеУчета + ЦенныеБумаги.СуммаКупонаРынокВВалютеУчета КАК СуммаВсегоРынокВВалютеУчета,";
	КонецЕсли;
	
	РасчетныеПоля = "СуммаВсего, СуммаВсегоРынок, СуммаВсегоРынокВВалютеУчета, Номинал, ВалютаНоминала, Котировка, КотировкаВПроцентах, КупонКотировка";
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ " + РаботаСКоллекциями.ПолучитьПоляТаблицыДляЗапроса(ЦенныеБумаги, , РасчетныеПоля) + ",
		|	" + РасчетПоляВсегоРынокВВалютеУчета + "
		|	ЦенныеБумаги.Сумма + ЦенныеБумаги.СуммаКупона КАК СуммаВсего,
		|	ЦенныеБумаги.СуммаРынок + ЦенныеБумаги.СуммаКупонаРынок КАК СуммаВсегоРынок
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	&ЦенныеБумаги КАК ЦенныеБумаги
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага; " + ТекстЗапросаДляКотировок);
	
	Запрос.УстановитьПараметр("ЦенныеБумаги", ЦенныеБумаги);
	Запрос.УстановитьПараметр("Период",       Период);
	Запрос.УстановитьПараметр("Рынок",        Рынок);
	Запрос.УстановитьПараметр("Биржа",        Биржа);
	Запрос.УстановитьПараметр("Организация",  Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ЗаполнитьКотировкиНоминалыИСуммыВсегоВТаблице

Функция СформироватьТекстЗапросаДляКотировок(Рынок, КлиентЯвляетсяНПФилиПН)
	ТекстЗапроса =
	#Область ЧастичныйТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Период КАК Период,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.РежимТоргов КАК РежимТоргов,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.Валюта
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.ВалютаНоминала
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.БазоваяЦБ.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала,
		|	ВЫБОР
		|		КОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя))
		|			ТОГДА КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага.Номинал
		|	КОНЕЦ КАК Номинал,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT КАК ACCINT,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ACCINT_DATE КАК ACCINT_DATE,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE3 КАК MARKETPRICE3,
		|	КотировкиТорговыхПлощадокСводныеСрезПоследних.MARKETPRICE3_DATE КАК MARKETPRICE3_DATE
		|ПОМЕСТИТЬ _ПоследниеКотировки
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
		|				&Период,
		|				РежимТоргов.ОсновнойРежим
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ЦенныеБумаги.ЦеннаяБумага
		|						ИЗ
		|							_ЦенныеБумаги КАК _ЦенныеБумаги)
		|					И Биржа = &Биржа
		|					И Рынок = &Рынок) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.MARKETPRICE3_DATE) КАК MARKETPRICE3_DATE
		|ПОМЕСТИТЬ _ДатыПоследнихЗначенийКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_ПоследниеКотировки.Период) КАК МаксимальныйПериод,
		|	МАКСИМУМ(ДатыПоследнихЗначенийMARKETPRICE3.MARKETPRICE3_DATE) КАК MARKETPRICE3_DATE,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(НЕ ДатыПоследнихЗначенийMARKETPRICE3.ЦеннаяБумага ЕСТЬ NULL
		|					И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|					И _ПоследниеКотировки.MARKETPRICE3 <> 0)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE3.ЦеннаяБумага ЕСТЬ NULL
		|								И _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
		|								И _ПоследниеКотировки.MARKETPRICE3 <> 0
		|							ТОГДА _ПоследниеКотировки.РежимТоргов
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(ВЫБОР
		|					КОГДА НЕ ДатыПоследнихЗначенийMARKETPRICE3.ЦеннаяБумага ЕСТЬ NULL
		|							И _ПоследниеКотировки.MARKETPRICE3 <> 0
		|						ТОГДА _ПоследниеКотировки.РежимТоргов
		|				КОНЕЦ)
		|	КОНЕЦ КАК РежимТорговДляMARKETPRICE3
		|ПОМЕСТИТЬ _РежимыТорговПоследнихКотировок
		|ИЗ
		|	_ПоследниеКотировки КАК _ПоследниеКотировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийACCINT
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийACCINT.ЦеннаяБумага
		|			И (_ПоследниеКотировки.Период = &Период)
		|			И (_ПоследниеКотировки.ACCINT_DATE = &Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийMARKETPRICE3
		|		ПО _ПоследниеКотировки.ЦеннаяБумага = ДатыПоследнихЗначенийMARKETPRICE3.ЦеннаяБумага
		|			И _ПоследниеКотировки.MARKETPRICE3_DATE = ДатыПоследнихЗначенийMARKETPRICE3.MARKETPRICE3_DATE
		|ГДЕ
		|	(НЕ ДатыПоследнихЗначенийACCINT.ЦеннаяБумага ЕСТЬ NULL
		|			ИЛИ НЕ ДатыПоследнихЗначенийMARKETPRICE3.ЦеннаяБумага ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_ПоследниеКотировки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыПоследнихЗначенийКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(ПоследниеКотировкиДляACCINT.ВалютаНоминала, ПоследниеКотировкиДляMARKETPRICE3.ВалютаНоминала) КАК ВалютаНоминала,
		|	ЕСТЬNULL(ПоследниеКотировкиДляACCINT.Номинал, ПоследниеКотировкиДляMARKETPRICE3.Номинал) КАК Номинал,
		|	ЕСТЬNULL(КупоныВыходногоДня.Период, _РежимыТорговПоследнихКотировок.МаксимальныйПериод) КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ КупоныВыходногоДня.Период ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ПоследниеКотировкиДляACCINT.РежимТоргов
		|	КОНЕЦ КАК РежимТорговДляACCINT,
		|	ПоследниеКотировкиДляMARKETPRICE3.РежимТоргов КАК РежимТорговДляMARKETPRICE3,
		|	ЕСТЬNULL(КупоныВыходногоДня.ACCINT, ПоследниеКотировкиДляACCINT.ACCINT) КАК ACCINT,
		|	ПоследниеКотировкиДляMARKETPRICE3.MARKETPRICE3 КАК MARKETPRICE3,
		|	ПоследниеКотировкиДляMARKETPRICE3.MARKETPRICE3_DATE КАК MARKETPRICE3_DATE
		|ПОМЕСТИТЬ _КотировкиЦенныхБумаг
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыТорговПоследнихКотировок КАК _РежимыТорговПоследнихКотировок
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = _РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляACCINT
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляACCINT.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляACCINT = ПоследниеКотировкиДляACCINT.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляMARKETPRICE3
		|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляMARKETPRICE3.ЦеннаяБумага)
		|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляMARKETPRICE3 = ПоследниеКотировкиДляMARKETPRICE3.РежимТоргов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупоныВыходногоДня КАК КупоныВыходногоДня
		|		ПО (КупоныВыходногоДня.Период = &Период)
		|			И (_ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации)
		|			И _ЦенныеБумаги.ЦеннаяБумага = КупоныВыходногоДня.Облигация
		|			И (ПоследниеКотировкиДляACCINT.ЦеннаяБумага ЕСТЬ NULL
		|				ИЛИ НЕ ПоследниеКотировкиДляACCINT.ЦеннаяБумага ЕСТЬ NULL
		|					И КупоныВыходногоДня.Биржа = &Биржа)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_РежимыТорговПоследнихКотировок.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ПоследниеКотировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РежимыТорговПоследнихКотировок";
	#КонецОбласти
	
	Если Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		#Область ЧастичныйТекстЗапроса
		ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.*,
			|	0 КАК Номинал,
			|	_КотировкиЦенныхБумаг.ВалютаНоминала КАК ВалютаНоминала,
			|	ЕСТЬNULL(_КотировкиЦенныхБумаг.MARKETPRICE3, 0) КАК Котировка,
			|	Организации.ВалютаУчета КАК ВалютаУчета
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК _КотировкиЦенныхБумаг
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = _КотировкиЦенныхБумаг.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО Организации.Ссылка = &Организация";
		#КонецОбласти
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		#Область ЧастичныйТекстЗапроса
		ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.*,
			|	_КотировкиЦенныхБумаг.ВалютаНоминала КАК ВалютаНоминала,
			|	ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, 0) КАК Номинал,
			|	ЕСТЬNULL(_КотировкиЦенныхБумаг.MARKETPRICE3, 0) КАК КотировкаВПроцентах,
			|	ЕСТЬNULL(_КотировкиЦенныхБумаг.MARKETPRICE3, 0) * ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, 0) / 100. КАК Котировка,
			|	ЕСТЬNULL(_КотировкиЦенныхБумаг.ACCINT, 0) КАК КупонКотировка,
			|	Организации.ВалютаУчета КАК ВалютаУчета
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК _КотировкиЦенныхБумаг
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = _КотировкиЦенныхБумаг.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(
			|			&Период,
			|			ЦеннаяБумага В(
			|				ВЫБРАТЬ
			|					_ЦенныеБумаги.ЦеннаяБумага
			|				ИЗ
			|					_ЦенныеБумаги
			|			)
			|		) КАК НоминалыЦенныхБумагСрезПоследних
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО Организации.Ссылка = &Организация";
		#КонецОбласти
			
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Акции Или Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		#Область ЧастичныйТекстЗапроса
		ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.*,
			|	_КотировкиЦенныхБумаг.Номинал КАК Номинал,
			|	_КотировкиЦенныхБумаг.ВалютаНоминала КАК ВалютаНоминала,
			|	ЕСТЬNULL(_КотировкиЦенныхБумаг.MARKETPRICE3, 0) КАК Котировка,
			|	Организации.ВалютаУчета КАК ВалютаУчета
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК _КотировкиЦенныхБумаг
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = _КотировкиЦенныхБумаг.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО Организации.Ссылка = &Организация";
		#КонецОбласти
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки Тогда
		#Область ЧастичныйТекстЗапроса
		ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.*,
			|	0 КАК Номинал,
			|	_КотировкиЦенныхБумаг.ВалютаНоминала КАК ВалютаНоминала,
			|	ЕСТЬNULL(_КотировкиЦенныхБумаг.MARKETPRICE3, 0) КАК Котировка,
			|	Организации.ВалютаУчета КАК ВалютаУчета
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК _КотировкиЦенныхБумаг
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = _КотировкиЦенныхБумаг.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО Организации.Ссылка = &Организация";
		#КонецОбласти
	Иначе
		Возврат "";
	КонецЕсли;

	Если КлиентЯвляетсяНПФилиПН Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "MARKETPRICE3", "MARKETPRICE2");
	КонецЕсли;
	
	// Чтобы порядок строк в полученной таблице совпадал с порядком строк в исходной таблице, упорядочим результат по номеру строки
	ТекстЗапроса = ТекстЗапроса + Символы.ПС +
		"УПОРЯДОЧИТЬ ПО
		|	_ЦенныеБумаги.НомерСтроки";
	
	Возврат ТекстЗапроса;
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Функция КонтрагентПоЦеннойБумаге(ЦеннаяБумага, Период = Неопределено) Экспорт
		
	Если ЗначениеЗаполнено(ЦеннаяБумага)  Тогда
		ТипЦБ = ТипЗнч(ЦеннаяБумага);
		
		Если ТипЦБ = Тип("СправочникСсылка.Паи")  Тогда
			ТекПериод = ?(Период = Неопределено, ТекущаяДата(), Период);
			УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(ТекПериод, ЦеннаяБумага);
			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
		ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Закладные")  Тогда
			Возврат ЦеннаяБумага.Банк.ЮрФизЛицо;	
		ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Доли")  Тогда
			Возврат ЦеннаяБумага.ЮрЛицо;	
		Иначе
			Возврат ЦеннаяБумага.Эмитент.ЮрФизЛицо;
		КонецЕсли;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьРасчетнуюЦенуПая(ЦеннаяБумага, Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетныеЦеныПаевСрезПоследних.РасчетнаяЦена
		|ИЗ
		|	РегистрСведений.РасчетныеЦеныПаев.СрезПоследних(&Период, ЦеннаяБумага = &ЦеннаяБумага) КАК РасчетныеЦеныПаевСрезПоследних";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.РасчетнаяЦена;
	
	КонецЕсли;
	
	Возврат 0;

КонецФункции

Процедура РассчитатьРыночнуюЦену(ТаблицаКотировок, ПараметрыРасчета, РабочаяДатаПереоценки) Экспорт

	СчетДоверительногоУправления 	= ПараметрыРасчета.СчетДоверительногоУправления;
	ВариантРасчетаСтоимости 		= ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости;
	Организация = ПараметрыРасчета.Организация;
	Период 		= НачалоДня(ПараметрыРасчета.Дата);
	
	СоответствиеПериодов = Новый Соответствие;
	ТекущийПериод = Неопределено;
	
	Для каждого СтрокаТаблицыКотировок Из ТаблицаКотировок Цикл
		
		Если СтрокаТаблицыКотировок.Рынок = Перечисления.РынкиЦенныхБумаг.Паи 
			И НЕ СтрокаТаблицыКотировок.ДатаКотировки = РабочаяДатаПереоценки Тогда //Пай по сча если не на дату
			
			РасчетнаяЦенаПая = СтрокаТаблицыКотировок.РасчетнаяЦенаПая;
			Если РасчетнаяЦенаПая <> 0 Тогда
				
				СтрокаТаблицыКотировок.ОценочнаяЦена 		= РасчетнаяЦенаПая;
				СтрокаТаблицыКотировок.ОценочнаяЦенаПроцент = РасчетнаяЦенаПая;
				СтрокаТаблицыКотировок.ОценочнаяСумма 		= СтрокаТаблицыКотировок.ОценочнаяЦена * СтрокаТаблицыКотировок.Количество;
				СтрокаТаблицыКотировок.ПолеЦены 			= Перечисления.ИсточникиЦеныДляПереоценки.СЧА;
				
			КонецЕсли;
								
		ИначеЕсли СтрокаТаблицыКотировок.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации 
			И СтрокаТаблицыКотировок.ДатаПогашения <= Период Тогда //Погашенные облигации нужно брать - по 100%
		
			СтрокаТаблицыКотировок.ОценочнаяЦена 		= СтрокаТаблицыКотировок.Номинал;
			СтрокаТаблицыКотировок.ОценочнаяЦенаПроцент = 100;
			СтрокаТаблицыКотировок.ОценочнаяСумма 		= СтрокаТаблицыКотировок.ОценочнаяЦена * СтрокаТаблицыКотировок.Количество;
			СтрокаТаблицыКотировок.ПолеЦены 			= Перечисления.ИсточникиЦеныДляПереоценки.Погашена;
			
		ИначеЕсли (ВариантРасчетаСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхНакоплений ИЛИ ВариантРасчетаСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхРезервов)
			И СтрокаТаблицыКотировок.ДатаКотировки = РабочаяДатаПереоценки Тогда
			
			СтрокаТаблицыКотировок.ОценочнаяЦена 		= СтрокаТаблицыКотировок.РыночнаяЦена;
			СтрокаТаблицыКотировок.ОценочнаяЦенаПроцент = СтрокаТаблицыКотировок.РыночнаяЦенаПроцент;
			СтрокаТаблицыКотировок.ОценочнаяСумма 		= СтрокаТаблицыКотировок.ОценочнаяЦена * СтрокаТаблицыКотировок.Количество;
			СтрокаТаблицыКотировок.ПолеЦены 			= Перечисления.ИсточникиЦеныДляПереоценки.РыночнаяЦена;
			
		ИначеЕсли СтрокаТаблицыКотировок.ТребуетсяРасчет Тогда
			// Котировка не в дату. Заполняем соответствие периодов и ценных бумаг, по которым требуется расчет
			ТекущийПериод = СтрокаТаблицыКотировок.ДатаКотировки;
			Если СоответствиеПериодов.Получить(ТекущийПериод) = Неопределено Тогда
				МассивЦенныхБумаг = Новый Массив;
				МассивЦенныхБумаг.Добавить(СтрокаТаблицыКотировок.ЦеннаяБумага);
				СоответствиеПериодов.Вставить(ТекущийПериод, МассивЦенныхБумаг);
			ИначеЕсли СоответствиеПериодов[ТекущийПериод].Найти(СтрокаТаблицыКотировок.ЦеннаяБумага) = Неопределено Тогда
				СоответствиеПериодов[ТекущийПериод].Добавить(СтрокаТаблицыКотировок.ЦеннаяБумага);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	Запрос = Новый Запрос;
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _НачальныеОстатки
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦеннаяБумага В (&ЦенныеБумаги)) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) КАК ДатаОперации,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПриход,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПриход,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРасход,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРасход
		|ПОМЕСТИТЬ _ОперацииСЦеннымиБумагами
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ЦеннаяБумага В(&ЦенныеБумаги)
		|	И (ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.Сделка)
		|				И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Операция КАК Документ.Сделка).ОтложенноеИсполнение)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ),
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаРынок,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	0,
		|	0
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО ОперацииСЦеннымиБумагами.Операция = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И ОперацииСЦеннымиБумагами.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ЦеннаяБумага В(&ЦенныеБумаги)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ),
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	0,
		|	0,
		|	ВыводЦенныхБумагЦенныеБумаги.СуммаРынок,
		|	ОперацииСЦеннымиБумагами.Количество
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
		|		ПО ОперацииСЦеннымиБумагами.Операция = ВыводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ЦеннаяБумага В(&ЦенныеБумаги)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ОперацииСЦеннымиБумагами.ЦеннаяБумага, _НачальныеОстатки.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ОперацииСЦеннымиБумагами.ДатаОперации, &НачалоПериода) КАК ДатаОперации,
		|	СУММА(ЕСТЬNULL(_ОперацииСЦеннымиБумагами.СуммаПриход, 0)) КАК СуммаПриход,
		|	СУММА(ЕСТЬNULL(_ОперацииСЦеннымиБумагами.КоличествоПриход, 0)) КАК КоличествоПриход,
		|	СУММА(ЕСТЬNULL(_ОперацииСЦеннымиБумагами.СуммаРасход, 0)) КАК СуммаРасход,
		|	СУММА(ЕСТЬNULL(_ОперацииСЦеннымиБумагами.КоличествоРасход, 0)) КАК КоличествоРасход,
		|	МАКСИМУМ(ЕСТЬNULL(_НачальныеОстатки.КоличествоОстаток, 0)) КАК КоличествоНачальное
		|ПОМЕСТИТЬ _ОперацииСЦеннымиБумагамиИНачальныеОстатки
		|ИЗ
		|	_ОперацииСЦеннымиБумагами КАК _ОперацииСЦеннымиБумагами
		|		ПОЛНОЕ СОЕДИНЕНИЕ _НачальныеОстатки КАК _НачальныеОстатки
		|		ПО _ОперацииСЦеннымиБумагами.ЦеннаяБумага = _НачальныеОстатки.ЦеннаяБумага
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ЕСТЬNULL(_ОперацииСЦеннымиБумагами.ЦеннаяБумага, _НачальныеОстатки.ЦеннаяБумага)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.ДатаОперации КАК ДатаОперации,
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.СуммаПриход КАК СуммаПриход,
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.КоличествоПриход КАК КоличествоПриход,
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.СуммаРасход КАК СуммаРасход,
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.КоличествоРасход КАК КоличествоРасход,
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.КоличествоНачальное КАК КоличествоНачальное,
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.ПериодНоминала КАК ПериодНоминала,
		|	НоминалыЦенныхБумаг.Номинал КАК НоминалОперации
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.КоличествоНачальное КАК КоличествоНачальное,
		|		МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.ДатаОперации КАК ДатаОперации,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.СуммаПриход КАК СуммаПриход,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.КоличествоПриход КАК КоличествоПриход,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.СуммаРасход КАК СуммаРасход,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.КоличествоРасход КАК КоличествоРасход
		|	ИЗ
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки КАК _ОперацииСЦеннымиБумагамиИНачальныеОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|			ПО _ОперацииСЦеннымиБумагамиИНачальныеОстатки.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|				И _ОперацииСЦеннымиБумагамиИНачальныеОстатки.ДатаОперации >= НоминалыЦенныхБумаг.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.КоличествоНачальное,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.ДатаОперации,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.ЦеннаяБумага,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.СуммаПриход,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.КоличествоПриход,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.СуммаРасход,
		|		_ОперацииСЦеннымиБумагамиИНачальныеОстатки.КоличествоРасход) КАК _ОперацииСЦеннымиБумагамиСПериодомНоминала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО (_ОперацииСЦеннымиБумагамиСПериодомНоминала.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага)
		|			И (_ОперацииСЦеннымиБумагамиСПериодомНоминала.ПериодНоминала = НоминалыЦенныхБумаг.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ОперацииСЦеннымиБумагамиСПериодомНоминала.ДатаОперации
		|ИТОГИ
		|	МАКСИМУМ(КоличествоНачальное)
		|ПО
		|	ЦеннаяБумага";
	
	Для каждого ЭлементСоответствия Из СоответствиеПериодов Цикл
		
		// Выполняем расчет
		ДатаКотировки = ЭлементСоответствия.Ключ;
		МассивЦенныхБумаг = ЭлементСоответствия.Значение;
		
		
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Период", 		Новый Граница(КонецДня(ДатаКотировки), ВидГраницы.Включая));	
		Запрос.УстановитьПараметр("НачалоПериода", 	КонецДня(ДатаКотировки) + 1);
		Запрос.УстановитьПараметр("КонецПериода", 	КонецДня(Период));
		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("ЦенныеБумаги", 	МассивЦенныхБумаг);

		Результат = Запрос.Выполнить();
		
		ВыборкаЦенныеБумаги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЦенныеБумаги.Следующий() Цикл
			
			НайденныеСтроки = ТаблицаКотировок.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаЦенныеБумаги.ЦеннаяБумага));
			
			РасчетнаяРыночнаяЦена = НайденныеСтроки[0].РыночнаяЦена;
			НоминалНаДатуРасчета =  НайденныеСтроки[0].Номинал;
			
			КоличествоНачальное = ВыборкаЦенныеБумаги.КоличествоНачальное;
			ВыборкаОперацииСЦеннымиБумагами = ВыборкаЦенныеБумаги.Выбрать();
			
			Пока ВыборкаОперацииСЦеннымиБумагами.Следующий() Цикл
				
				КоэффициентИзмененияНоминала = 1;
				
				Если ТипЗнч(ВыборкаЦенныеБумаги.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда				
					НоминалНаДатуОперации 			= ВыборкаОперацииСЦеннымиБумагами.НоминалОперации;
					Если НоминалНаДатуОперации <> 0 Тогда						
						КоэффициентИзмененияНоминала 	= НоминалНаДатуРасчета/НоминалНаДатуОперации;
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На дату операции " + ВыборкаОперацииСЦеннымиБумагами.ДатаОперации + " у ценной бумаги " + ВыборкаОперацииСЦеннымиБумагами.ЦеннаяБумага + " обнаружен нулевой номинал. Расчетная цена не может быть определена.");
					КонецЕсли; 
				КонецЕсли; 

			
				Если КоличествоНачальное + ВыборкаОперацииСЦеннымиБумагами.КоличествоПриход + ВыборкаОперацииСЦеннымиБумагами.КоличествоРасход <> 0 Тогда
				
					РасчетнаяРыночнаяЦена = (РасчетнаяРыночнаяЦена * КоличествоНачальное + ВыборкаОперацииСЦеннымиБумагами.СуммаПриход*КоэффициентИзмененияНоминала + ВыборкаОперацииСЦеннымиБумагами.СуммаРасход*КоэффициентИзмененияНоминала) 
											/ (КоличествоНачальное + ВыборкаОперацииСЦеннымиБумагами.КоличествоПриход + ВыборкаОперацииСЦеннымиБумагами.КоличествоРасход);
				
				КонецЕсли;
										
				КоличествоНачальное = КоличествоНачальное + ВыборкаОперацииСЦеннымиБумагами.КоличествоПриход - ВыборкаОперацииСЦеннымиБумагами.КоличествоРасход;
				
			КонецЦикла;
			
			Для каждого СтрокаКотировок Из НайденныеСтроки Цикл
			
				СтрокаКотировок.ОценочнаяЦена 	= РасчетнаяРыночнаяЦена;
				
				// Перестало работать получение расчетных цен в 2017 г. (например, для отчета о состоянии портфеля).
				// Пока переносим расчетную цену в рыночную
				СтрокаКотировок.РыночнаяЦена 	= РасчетнаяРыночнаяЦена;
				СтрокаКотировок.ИсточникЦены 	= Справочники.ЮрФизЛица.ПустаяСсылка();
				
				Если СтрокаКотировок.Номинал <> 0 Тогда
					СтрокаКотировок.ОценочнаяЦенаПроцент = СтрокаКотировок.ОценочнаяЦена / СтрокаКотировок.Номинал * 100;
				Иначе
					СтрокаКотировок.ОценочнаяЦенаПроцент = СтрокаКотировок.ОценочнаяЦена;
				КонецЕсли;
				
				СтрокаКотировок.ОценочнаяСумма 	= СтрокаКотировок.ОценочнаяЦена * СтрокаКотировок.Количество;
				СтрокаКотировок.ПолеЦены 		= Перечисления.ИсточникиЦеныДляПереоценки.РасчетнаяЦенаДляПН;	
			
			КонецЦикла; 
					
		КонецЦикла; 
		
	КонецЦикла;

	РассчитатьСтоимостьДефолтныхОблигаций(ТаблицаКотировок, ПараметрыРасчета);
		
КонецПроцедуры

Процедура РассчитатьОценочнуюСтоимостьПоПриказу07_67ФСФР(ПараметрыРасчета, ТаблицаЦенныхБумаг) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =  
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал
		|ПОМЕСТИТЬ _НоминалыЦенныхБумагНаДатуПредыдущейОценки
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&ДатаПредыдущейОценки, ЦеннаяБумага В (&ЦенныеБумаги)) КАК НоминалыЦенныхБумагСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.Операция КАК Сделка,
		|	НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) КАК ДатаОперации,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПриход,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРасход
		|ПОМЕСТИТЬ _СделкиЗаПериод
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ЦеннаяБумага В(&ЦенныеБумаги)
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.Сделка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СделкиЗаПериодСПериодомНоминала.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_СделкиЗаПериодСПериодомНоминала.ДатаОперации КАК ДатаОперации,
		|	_СделкиЗаПериодСПериодомНоминала.ПериодНоминала КАК ПериодНоминала,
		|	НоминалыЦенныхБумаг.Номинал КАК НоминалОперации,
		|	_СделкиЗаПериодСПериодомНоминала.КоличествоПриход КАК КоличествоПриход,
		|	_СделкиЗаПериодСПериодомНоминала.КоличествоРасход КАК КоличествоРасход,
		|	УсловияСделокСрезПоследних.Цена КАК Цена,
		|	УсловияСделокСрезПоследних.КурсОплаты КАК Курс,
		|	УсловияСделокСрезПоследних.ВалютаОплаты КАК Валюта
		|ПОМЕСТИТЬ _ДанныеСделок
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СделкиЗаПериод.ДатаОперации КАК ДатаОперации,
		|		_СделкиЗаПериод.ЦеннаяБумага КАК ЦеннаяБумага,
		|		МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала,
		|		_СделкиЗаПериод.КоличествоПриход КАК КоличествоПриход,
		|		_СделкиЗаПериод.КоличествоРасход КАК КоличествоРасход,
		|		_СделкиЗаПериод.Сделка КАК Сделка
		|	ИЗ
		|		_СделкиЗаПериод КАК _СделкиЗаПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|			ПО _СделкиЗаПериод.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|				И _СделкиЗаПериод.ДатаОперации >= НоминалыЦенныхБумаг.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СделкиЗаПериод.ДатаОперации,
		|		_СделкиЗаПериод.ЦеннаяБумага,
		|		_СделкиЗаПериод.КоличествоПриход,
		|		_СделкиЗаПериод.КоличествоРасход,
		|		_СделкиЗаПериод.Сделка) КАК _СделкиЗаПериодСПериодомНоминала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО _СделкиЗаПериодСПериодомНоминала.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И _СделкиЗаПериодСПериодомНоминала.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И Сделка В
		|						(ВЫБРАТЬ
		|							_СделкиЗаПериод.Сделка КАК Сделка
		|						ИЗ
		|							_СделкиЗаПериод КАК _СделкиЗаПериод)) КАК УсловияСделокСрезПоследних
		|		ПО _СделкиЗаПериодСПериодомНоминала.Сделка = УсловияСделокСрезПоследних.Сделка
		|			И _СделкиЗаПериодСПериодомНоминала.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДанныеСделок.ДатаОперации КАК ДатаОперации,
		|	_ДанныеСделок.ПериодНоминала КАК ПериодНоминала,
		|	_ДанныеСделок.НоминалОперации КАК НоминалОперации,
		|	_ДанныеСделок.КоличествоПриход КАК КоличествоПриход,
		|	_ДанныеСделок.КоличествоРасход КАК КоличествоРасход,
		|	ВЫБОР
		|		КОГДА КурсыВалют.Курс ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА _ДанныеСделок.Курс <> НЕОПРЕДЕЛЕНО
		|						ТОГДА _ДанныеСделок.Цена * (ВЫРАЗИТЬ(_ДанныеСделок.Курс КАК ЧИСЛО))
		|					ИНАЧЕ _ДанныеСделок.Цена
		|				КОНЕЦ
		|		ИНАЧЕ _ДанныеСделок.Цена * КурсыВалют.Курс / КурсыВалют.Кратность
		|	КОНЕЦ КАК Цена
		|ПОМЕСТИТЬ _ДанныеДляРасчета
		|ИЗ
		|	_ДанныеСделок КАК _ДанныеСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО _ДанныеСделок.Валюта = КурсыВалют.Валюта
		|			И (ВЫБОР
		|				КОГДА _ДанныеСделок.Курс <> НЕОПРЕДЕЛЕНО
		|						И ТИПЗНАЧЕНИЯ(_ДанныеСделок.Курс) = ТИП(ЧИСЛО)
		|					ТОГДА _ДанныеСделок.Курс = КурсыВалют.Период
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",					ПараметрыРасчета.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ПараметрыРасчета.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаПредыдущейОценки",			ПараметрыРасчета.ДатаПредыдущейОценки);
	Запрос.УстановитьПараметр("НачалоПериода",					КонецДня(ПараметрыРасчета.ДатаПредыдущейОценки) + 1);
	Запрос.УстановитьПараметр("КонецПериода",					КонецДня(ПараметрыРасчета.ДатаОценки));
	Запрос.УстановитьПараметр("ЦенныеБумаги",					ТаблицаЦенныхБумаг.ВыгрузитьКолонку("ЦеннаяБумага"));
	
	Запрос.Выполнить();
	
	НоминалыНаДатуПредыдущейОценки	= Запрос.МенеджерВременныхТаблиц.Таблицы["_НоминалыЦенныхБумагНаДатуПредыдущейОценки"].ПолучитьДанные().Выгрузить();
	ДанныеДляРасчета				= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляРасчета"].ПолучитьДанные().Выгрузить();
	
	Для Каждого ТекСтрока Из ТаблицаЦенныхБумаг Цикл
		
		Если ТекСтрока.Стоимость = 0 И ТекСтрока.ТребуетсяРасчет Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЦеннаяБумага", ТекСтрока.ЦеннаяБумага);
			                                                                                                                              
			ДанныеСделок	= ДанныеДляРасчета.НайтиСтроки(Отбор);
			Номинал			= НоминалыНаДатуПредыдущейОценки.НайтиСтроки(Отбор);
			
			Если ДанныеСделок.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Номинал.Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На дату предыдущей оценки (" + Формат(ПараметрыРасчета.ДатаПредудыщейОценки, "ДФ=dd.MM.yyyy") + ") у ценной бумаги " + ТекСтрока.ЦеннаяБумага + " обнаружен нулевой номинал. Расчетная цена не может быть определена.");
				Продолжить;
			Иначе
				НоминалНаДатуПредыдущейОценки = Номинал[0];
			КонецЕсли;
			
			ОбщаяСумма		= 0;
			ОбщееКоличество	= 0;
			
			Расчитывать = Истина;
			
			Для Каждого Сделка Из ДанныеСделок Цикл
				
				КоэффициентИзмененияНоминала = 1;
				
				Если ТипЗнч(ТекСтрока.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда				
					НоминалНаДатуОперации 			= Сделка.НоминалОперации;
					Если НоминалНаДатуОперации <> 0 Тогда						
						КоэффициентИзмененияНоминала = НоминалНаДатуПредыдущейОценки/НоминалНаДатуОперации;
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На дату операции " + Сделка.ДатаОперации + " у ценной бумаги " + Сделка.ЦеннаяБумага + " обнаружен нулевой номинал. Расчетная цена не может быть определена.");
						Расчитывать = Ложь;
						Прервать;
					КонецЕсли; 
				КонецЕсли;
				
				ОбщаяСумма		= ОбщаяСумма + КоэффициентИзмененияНоминала * Сделка.КоличествоПриход * Сделка.Цена + КоэффициентИзмененияНоминала * Сделка.КоличествоРасход * Сделка.Цена;
				ОбщееКоличество	= ОбщееКоличество + Сделка.КоличествоПриход + Сделка.КоличествоРасход;
				
			КонецЦикла;
			
			Если Расчитывать Тогда
				ТекСтрока.Стоимость		= (ТекСтрока.ЦенаДляРасчета * ТекСтрока.КоличествоДляРасчета + ОбщаяСумма) / (ТекСтрока.КоличествоДляРасчета + ОбщееКоличество);
				ТекСтрока.УровеньОценки	= 2;
				ТекСтрока.Источник		= Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура РассчитатьСтоимостьДефолтныхОблигаций(ТаблицаКотировок, ПараметрыРасчета) Экспорт
	
	Если ТипЗнч(ПараметрыРасчета) = Тип("ДокументОбъект.ПереоценкаЦенныхБумаг") Тогда
		ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ПараметрыРасчета.ВидУчета);
	Иначе
		ПараметрыРасчета.Свойство("ЦельРасчета",  ЦельРасчета);
	КонецЕсли;
	
	// Процедура применяется только для вариантов расчета оценочной стоимости Р2 для ПН и Р2 для ПР
	Если (ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхНакоплений
		ИЛИ ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхРезервов) Тогда
	
		// Учитываем пункт положений для ПН/ПР:
		// В случае неисполнения предусмотренного облигацией обязательства по выплате суммы основного долга, рыночная стоимость таких облигаций 
		// по истечении 7 дней с даты окончания срока исполнения указанного обязательства определяется по формуле:
	    //
		//  S = max[0, ((0.7 - (i - 7) * 0.03) * P0 * Q)]
		//
	    // где:
		// S  - рыночная стоимость облигаций на дату расчета рыночной стоимости активов, составляющих инвестиционный портфель;
		// P0 - рыночная цена (средняя цена) указанных облигаций на дату истечения предусмотренного ими срока исполнения обязательств по выплате суммы основного долга;
		// Q  - количество указанных облигаций в инвестиционном портфеле;
		// i  - количество полных календарных дней, прошедших с даты окончания срока исполнения обязательств по выплате суммы основного долга, предусмотренной указанными облигациями;
	    //
		// 1. Получаем бумаги в дефолте по погашению тела облигации и просроченные неоплаченные погашения тела
		// 2. Получаем рыночные цены для этих бумаг на соответсвующие даты
		// 3. Применяем формулу.
		//
		// Коэффициент (0.7 - (i - 7) * 0.03) становится отрицательным при i >= 31, т. е. если срок задолженности 
		// по погашению тела более 30 дней, рыночная стоимость облигаций по этой формуле равна нулю.
		// Дата отсчета задолженности: если в документе "Погашение ЦБ" заполнена плановая дата оплаты, используем ее, иначе - дату погашения ценной бумаги.

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаЦБ.Партия КАК Партия,
		|	_ТаблицаЦБ.Количество КАК Количество,
		|	_ТаблицаЦБ.СтрокаПартии КАК СтрокаПартии,
		|	_ТаблицаЦБ.РыночнаяСумма КАК РыночнаяСумма
		|ПОМЕСТИТЬ _ТаблицаЦБ
		|ИЗ
		|	&ТаблицаЦБ КАК _ТаблицаЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Облигации.Ссылка КАК ЦеннаяБумага,
		|	_ТаблицаЦБ.Партия КАК Партия,
		|	_ТаблицаЦБ.СтрокаПартии КАК СтрокаПартии,
		|	_ТаблицаЦБ.Количество КАК Количество,
		|	_ТаблицаЦБ.РыночнаяСумма КАК РыночнаяСумма
		|ПОМЕСТИТЬ _ТаблицаОблигаций
		|ИЗ
		|	_ТаблицаЦБ КАК _ТаблицаЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ТаблицаЦБ.ЦеннаяБумага = Облигации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДефолтыПоОблигациямСрезПоследних.Облигация КАК Облигация,
		|	ДефолтыПоОблигациямСрезПоследних.СтатусДефолта КАК СтатусДефолта,
		|	ДефолтыПоОблигациямСрезПоследних.Период КАК Период,
		|	РАЗНОСТЬДАТ(ДефолтыПоОблигациямСрезПоследних.Облигация.ДатаПогашения, &Период, ДЕНЬ) КАК ДнейЗадолженности
		|ПОМЕСТИТЬ _ДефолтыПоОблигациям
		|ИЗ
		|	РегистрСведений.ДефолтыПоОблигациям.СрезПоследних(
		|			&Период,
		|			Облигация В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ТаблицаОблигаций.ЦеннаяБумага
		|					ИЗ
		|						_ТаблицаОблигаций КАК _ТаблицаОблигаций)
		|				И ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации)) КАК ДефолтыПоОблигациямСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ДатаОплатыПлановая = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага.ДатаПогашения
		|					ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Основание.ДатаОплатыПлановая
		|				КОНЕЦ
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	КОНЕЦ КАК ДатаЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаКупонаОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоПогашениюЦБ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
		|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ТаблицаОблигаций.ЦеннаяБумага
		|			ИЗ
		|				_ТаблицаОблигаций КАК _ТаблицаОблигаций)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(СтоимостьПереоценки.Период) КАК ДатаЦены,
		|	СтоимостьПереоценки.Цена КАК Цена,
		|	_ЗадолженностьПоПогашениюЦБ.ДатаЗадолженности КАК ДатаЗадолженности
		|ПОМЕСТИТЬ _ТаблицаСтоимости_Рынок
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоПогашениюЦБ КАК _ЗадолженностьПоПогашениюЦБ
		|		ПО СтоимостьПереоценки.ЦеннаяБумага = _ЗадолженностьПоПогашениюЦБ.ЦеннаяБумага
		|ГДЕ
		|	СтоимостьПереоценки.ЦеннаяБумага В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ЗадолженностьПоПогашениюЦБ.ЦеннаяБумага
		|			ИЗ
		|				_ЗадолженностьПоПогашениюЦБ КАК _ЗадолженностьПоПогашениюЦБ)
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ВидУчета = &ВидУчета
		|	И СтоимостьПереоценки.ЦельРасчета = &ЦельРасчета
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|	И ВЫБОР
		|			КОГДА &ЭтоР2ДляПН
		|				ТОГДА СтоимостьПереоценки.Период = ЕСТЬNULL(_ЗадолженностьПоПогашениюЦБ.ДатаЗадолженности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|			КОГДА &ЭтоР2ДляПР
		|				ТОГДА СтоимостьПереоценки.Период < ЕСТЬNULL(_ЗадолженностьПоПогашениюЦБ.ДатаЗадолженности, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.Цена,
		|	_ЗадолженностьПоПогашениюЦБ.ДатаЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ТаблицаСтоимости_Рынок.ЦеннаяБумага, _ДефолтыПоОблигациям.Облигация) КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА _ДефолтыПоОблигациям.ДнейЗадолженности > &МаксимальноеКоличествоДнейДляРасчета
		|				ИЛИ РАЗНОСТЬДАТ(_ТаблицаСтоимости_Рынок.ДатаЗадолженности, &Период, ДЕНЬ) > &МаксимальноеКоличествоДнейДляРасчета
		|			ТОГДА 0
		|		КОГДА РАЗНОСТЬДАТ(_ТаблицаСтоимости_Рынок.ДатаЗадолженности, &Период, ДЕНЬ) <= &МинимальноеКоличествоДнейДляРасчета
		|			ТОГДА -1
		|		ИНАЧЕ (0.7 - (РАЗНОСТЬДАТ(_ТаблицаСтоимости_Рынок.ДатаЗадолженности, &Период, ДЕНЬ) - 7) * 0.03) * _ТаблицаСтоимости_Рынок.Цена
		|	КОНЕЦ КАК РыночнаяСтоимость,
		|	ВЫБОР
		|		КОГДА _ДефолтыПоОблигациям.ДнейЗадолженности > &МаксимальноеКоличествоДнейДляРасчета
		|				ИЛИ РАЗНОСТЬДАТ(_ТаблицаСтоимости_Рынок.ДатаЗадолженности, &Период, ДЕНЬ) > &МаксимальноеКоличествоДнейДляРасчета
		|			ТОГДА ""Стоимость0""
		|		КОГДА РАЗНОСТЬДАТ(_ТаблицаСтоимости_Рынок.ДатаЗадолженности, &Период, ДЕНЬ) <= &МинимальноеКоличествоДнейДляРасчета
		|			ТОГДА ""ТекущаяСтоимость""
		|		ИНАЧЕ ""ПоФормуле""
		|	КОНЕЦ КАК ПрименениеФормулы
		|ИЗ
		|	_ТаблицаСтоимости_Рынок КАК _ТаблицаСтоимости_Рынок
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДефолтыПоОблигациям КАК _ДефолтыПоОблигациям
		|		ПО _ТаблицаСтоимости_Рынок.ЦеннаяБумага = _ДефолтыПоОблигациям.Облигация";
		
		Запрос.УстановитьПараметр("МаксимальноеКоличествоДнейДляРасчета", 30);
		Запрос.УстановитьПараметр("МинимальноеКоличествоДнейДляРасчета",  7);
		Запрос.УстановитьПараметр("ТаблицаЦБ", 							  ТаблицаКотировок);
		Запрос.УстановитьПараметр("Организация", 						  ПараметрыРасчета.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", 		  ПараметрыРасчета.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ЭтоР2ДляПН", 						  ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхНакоплений);
		Запрос.УстановитьПараметр("ЭтоР2ДляПР", 						  ПараметрыРасчета.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная2ДляПенсионныхРезервов);     
		Запрос.УстановитьПараметр("ВидУчета", 						  	  ПараметрыРасчета.ВидУчета);
		Запрос.УстановитьПараметр("ЦельРасчета", 						  ЦельРасчета);
		Запрос.УстановитьПараметр("Период",  							  НачалоДня(ПараметрыРасчета.Дата));
		
		СтоимостьДефолтныхЦБ = Запрос.Выполнить().Выгрузить();
		Для Каждого ТекСтрокаДефолтнойЦБ Из СтоимостьДефолтныхЦБ Цикл
			
			Если ТекСтрокаДефолтнойЦБ.ПрименениеФормулы = "ТекущаяСтоимость" Тогда
				Продолжить;
			КонецЕсли;
			
			ТекОтбор = Новый Структура("ЦеннаяБумага", ТекСтрокаДефолтнойЦБ.ЦеннаяБумага);
			НайдСтроки = ТаблицаКотировок.НайтиСтроки(ТекОтбор);
			
			Для Каждого НайдСтрока Из НайдСтроки Цикл
				Если ТекСтрокаДефолтнойЦБ.ПрименениеФормулы = "Стоимость0" Тогда
					НайдСтрока.РыночнаяСумма = 0;	
					НайдСтрока.ОценочнаяСумма = 0;	
				Иначе
					НайдСтрока.РыночнаяСумма = НайдСтрока.Количество * ТекСтрокаДефолтнойЦБ.РыночнаяСтоимость;
					НайдСтрока.ОценочнаяСумма = НайдСтрока.Количество * ТекСтрокаДефолтнойЦБ.РыночнаяСтоимость;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры // РассчитатьСтоимостьДефолтныхОблигаций	
	
Функция ПолучитьРыночнуюЦену(ЦеннаяБумага, Период, Организация, СчетДоверительногоУправления, ДатаКотировки, РыночнаяЦена) Экспорт

	КоличествоНачальное = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ДатаКотировки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КоличествоНачальное = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПриход,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПриход,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРасход,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА ОперацииСЦеннымиБумагами.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРасход
		|ПОМЕСТИТЬ ОперацииСЦеннымиБумагами
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ЦеннаяБумага = &ЦеннаяБумага
		|	И (ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.ВводЦенныхБумаг)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.ВыводЦенныхБумаг)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Операция) = ТИП(Документ.Сделка)
		|				И НЕ ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Операция КАК Документ.Сделка).ОтложенноеИсполнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	СУММА(ОперацииСЦеннымиБумагами.СуммаПриход) КАК СуммаПриход,
		|	СУММА(ОперацииСЦеннымиБумагами.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ОперацииСЦеннымиБумагами.СуммаРасход) КАК СуммаРасход,
		|	СУММА(ОперацииСЦеннымиБумагами.КоличествоРасход) КАК КоличествоРасход
		|ИЗ
		|	ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.ДатаОперации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОперацииСЦеннымиБумагами.ДатаОперации";

	Запрос.УстановитьПараметр("НачалоПериода", КонецДня(ДатаКотировки) + 1);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	ОперацииСЦеннымиБумагами = Запрос.Выполнить().Выгрузить();
	
	РасчетнаяРыночнаяЦена = РыночнаяЦена;
	
	Для каждого СтрокаОпераций Из ОперацииСЦеннымиБумагами Цикл
		
		Если КоличествоНачальное + СтрокаОпераций.КоличествоПриход + СтрокаОпераций.КоличествоРасход <> 0 Тогда
		
			РасчетнаяРыночнаяЦена = (РасчетнаяРыночнаяЦена * КоличествоНачальное + СтрокаОпераций.СуммаПриход + СтрокаОпераций.СуммаРасход) 
									/ (КоличествоНачальное + СтрокаОпераций.КоличествоПриход + СтрокаОпераций.КоличествоРасход);
		
		КонецЕсли;
								
		КоличествоНачальное = КоличествоНачальное + СтрокаОпераций.КоличествоПриход - СтрокаОпераций.КоличествоРасход;
		
	КонецЦикла;
	
	Возврат РасчетнаяРыночнаяЦена;

КонецФункции

Функция ПолучитьКупонныйДоходЗаПериод(ЦеннаяБумага, ДатаНачала, ДатаОкончания, СчетДоверительногоУправления) Экспорт

	НачальныйКупон = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ЦеннаяБумага, НачалоДня(ДатаНачала), СчетДоверительногоУправления, Истина);
	КонечныйКупон = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ЦеннаяБумага, НачалоДня(ДатаОкончания), СчетДоверительногоУправления, Истина);
	
	КупонЗаПериод = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(КупонныйДоходПоОблигациям.СуммаКупона), 0) КАК СуммаКупона
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона >= &НачалоПериода
		|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона < &ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("Облигация", ЦеннаяБумага);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаОкончания);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КупонЗаПериод = ВыборкаДетальныеЗаписи.СуммаКупона;
	КонецЕсли;

	Возврат КонечныйКупон - НачальныйКупон + КупонЗаПериод;

КонецФункции 

Функция ОпределитьУровниРейтингов(Объект, Дата)

	СписокАгентств = Новый Массив;
	СписокАгентств.Добавить(Справочники.РейтинговыеАгентства.FitchRatings);
	СписокАгентств.Добавить(Справочники.РейтинговыеАгентства.Moodys);
	СписокАгентств.Добавить(Справочники.РейтинговыеАгентства.StandardAndPoors);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.РейтинговоеАгентство,
		|	РейтингиСрезПоследних.УровеньРейтинга
		|ИЗ
		|	РегистрСведений.Рейтинги.СрезПоследних(
		|			&Период,
		|			Субъект = &Объект
		|					И РейтинговоеАгентство В (&СписокАгентств)
		|					И Шкала.Наименование = ""Долгосрочный Межд. рейтинг в нац. вал.""
		|				ИЛИ Шкала.Наименование = ""Долгосрочный Межд. рейтинг в нац. валюте""
		|				ИЛИ Шкала.Наименование = ""Долгосрочный Межд. рейтинг в нац. валюте"") КАК РейтингиСрезПоследних";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("СписокАгентств", СписокАгентств);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	//1 - лучше, чем BBB-, 2 - от BB- до BBB-, 3 - от B- до BB-
	СписокУровней = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.РейтинговоеАгентство = Справочники.РейтинговыеАгентства.FitchRatings Тогда
			
			Если ВыборкаДетальныеЗаписи.УровеньРейтинга >= 69 Тогда // BBB-
				СписокУровней.Добавить(1);
			ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРейтинга >= 59 Тогда // BB-
				СписокУровней.Добавить(2);
			ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРейтинга >= 49 Тогда // B-
				СписокУровней.Добавить(3);
			КонецЕсли;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.РейтинговоеАгентство = Справочники.РейтинговыеАгентства.Moodys Тогда
			
			Если ВыборкаДетальныеЗаписи.УровеньРейтинга >= 61 Тогда // Baa3-
				СписокУровней.Добавить(1);
			ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРейтинга >= 51 Тогда // Ba3-
				СписокУровней.Добавить(2);
			ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРейтинга >= 41 Тогда // B3-
				СписокУровней.Добавить(3);
			КонецЕсли;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.РейтинговоеАгентство = Справочники.РейтинговыеАгентства.StandardAndPoors Тогда
			
			Если ВыборкаДетальныеЗаписи.УровеньРейтинга >= 89 Тогда // BBB-
				СписокУровней.Добавить(1);
			ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРейтинга >= 79 Тогда // BB-
				СписокУровней.Добавить(2);
			ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРейтинга >= 69 Тогда // B-
				СписокУровней.Добавить(3);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокУровней.Количество() = 0 Тогда
	    Возврат ОпределитьУровниРейтингов(Объект.Эмитент.ЮрФизЛицо, Дата);
	Иначе
	    Возврат СписокУровней;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИндексыДляОблигации(Облигация, Дата, ДатаПогашения = Неопределено) Экспорт

	Если ТипЗнч(Облигация) <> Тип("СправочникСсылка.Облигации") Тогда
		Возврат Справочники.БиржевыеИндексы.ПустаяСсылка();
	КонецЕсли;
	
	Если ДатаПогашения = Неопределено Тогда
		ЛетДоПогашения = Облигация.ДатаПогашения - Дата; //вполне возможно, что тут надо считать не срок а дюрацию, но точно не известно
	Иначе
		ЛетДоПогашения = ДатаПогашения - Дата; //вполне возможно, что тут надо считать не срок а дюрацию, но точно не известно
	КонецЕсли;
	
	МассивКодовИндексов = Новый Массив;
	
	Если Облигация.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
		Если ЛетДоПогашения <= 365 * 86400 Тогда
			МассивКодовИндексов.Добавить("RUGBICP1Y");
		ИначеЕсли ЛетДоПогашения <= 3 * 365 * 86400 Тогда
			МассивКодовИндексов.Добавить("RUGBICP3Y");
		ИначеЕсли ЛетДоПогашения <= 5 * 365 * 86400 Тогда
			МассивКодовИндексов.Добавить("RUGBICP5Y");
		Иначе
			МассивКодовИндексов.Добавить("RUGBICP5+");
		КонецЕсли;
	ИначеЕсли Облигация.Категория = Перечисления.КатегорииОблигаций.Муниципальная ИЛИ Облигация.Категория = Перечисления.КатегорииОблигаций.Субфедеральная Тогда
		Если ЛетДоПогашения <= 365 * 86400 Тогда
			МассивКодовИндексов.Добавить("RUMBITR1Y");
		Иначе
			УровниРейтингов = ОпределитьУровниРейтингов(Облигация, Дата); 
			//1 - лучше, чем BBB-, 2 - от BB- до BBB-, 3 - от B- до BB-
			Для каждого УровеньРейтинга Из УровниРейтингов Цикл
				Если УровеньРейтинга = 1 Тогда
					Если ЛетДоПогашения <= 3 * 365 * 86400 Тогда
						МассивКодовИндексов.Добавить("RUMBITRBBB3Y");
					Иначе
					    МассивКодовИндексов.Добавить("RUMBITRBBB3+");
					КонецЕсли;
				ИначеЕсли УровеньРейтинга = 2 И ЛетДоПогашения <= 3 * 365 * 86400 Тогда
					МассивКодовИндексов.Добавить("RUMBITRBB3Y");
				КонецЕсли;
			КонецЦикла;
			
			Если МассивКодовИндексов.Количество() = 0 Тогда // Ничего не добавили
				Если ЛетДоПогашения <= 3 * 365 * 86400 Тогда
					МассивКодовИндексов.Добавить("RUMBITR3Y");
				Иначе
					МассивКодовИндексов.Добавить("RUMBITR3+");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе //остались корпоративные
		
		Если ЛетДоПогашения <= 365 * 86400 Тогда
			МассивКодовИндексов.Добавить("RUCBITR1Y");
		ИначеЕсли ЛетДоПогашения <= 3 * 365 * 86400 Тогда
			
			УровниРейтингов = ОпределитьУровниРейтингов(Облигация, Дата); 
			//1 - лучше, чем BBB-, 2 - от BB- до BBB-, 3 - от B- до BB-
			Для каждого УровеньРейтинга Из УровниРейтингов Цикл
				Если УровеньРейтинга = 1 Тогда
					МассивКодовИндексов.Добавить("RUCBITRBBB3Y");
				ИначеЕсли УровеньРейтинга = 2 Тогда
					МассивКодовИндексов.Добавить("RUCBITRBB3Y");
				ИначеЕсли УровеньРейтинга = 3 Тогда
					МассивКодовИндексов.Добавить("RUCBITRB3Y");
				КонецЕсли;
			КонецЦикла;
			
			Если МассивКодовИндексов.Количество() = 0 Тогда // Ничего не добавили
				МассивКодовИндексов.Добавить("RUCBTR3Y");
			КонецЕсли;
			
		ИначеЕсли ЛетДоПогашения <= 5 * 365 * 86400 Тогда
			
			УровниРейтингов = ОпределитьУровниРейтингов(Облигация, Дата); 
			//1 - лучше, чем BBB-, 2 - от BB- до BBB-, 3 - от B- до BB-
			Для каждого УровеньРейтинга Из УровниРейтингов Цикл
				Если УровеньРейтинга = 1 Тогда
					МассивКодовИндексов.Добавить("RUCBITRBBB5Y");
				ИначеЕсли УровеньРейтинга = 2 Тогда
					МассивКодовИндексов.Добавить("RUCBITRBB5Y");
				КонецЕсли;
			КонецЦикла;
			
			Если МассивКодовИндексов.Количество() = 0 Тогда // Ничего не добавили
				МассивКодовИндексов.Добавить("RUCBTR5Y");
			КонецЕсли;
			
		Иначе
			
			УровниРейтингов = ОпределитьУровниРейтингов(Облигация, Дата); 
			//1 - лучше, чем BBB-, 2 - от BB- до BBB-, 3 - от B- до BB-
			Для каждого УровеньРейтинга Из УровниРейтингов Цикл
				Если УровеньРейтинга = 1 Тогда
					МассивКодовИндексов.Добавить("RUCBITRBBB3+");
				ИначеЕсли УровеньРейтинга = 2 Тогда
					МассивКодовИндексов.Добавить("RUCBITRBB3+");
				КонецЕсли;
			КонецЦикла;
			
			Если МассивКодовИндексов.Количество() = 0 Тогда // Ничего не добавили
				МассивКодовИндексов.Добавить("RUCBITR3+");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БиржевыеИндексы.Ссылка
		|ИЗ
		|	Справочник.БиржевыеИндексы КАК БиржевыеИндексы
		|ГДЕ
		|	БиржевыеИндексы.Код В (&Коды)";
	
	Запрос.УстановитьПараметр("Коды", МассивКодовИндексов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьЗначенияИндексовДляОблигации(Облигация, Дата, ДатаПогашения = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияБиржевыхИндексовСрезПоследних.YIELD КАК Доходность,
		|	ЗначенияБиржевыхИндексовСрезПоследних.БиржевойИндекс.Код КАК КодИндекса
		|ИЗ
		|	РегистрСведений.ЗначенияБиржевыхИндексов.СрезПоследних(
		|			&Период,
		|			Биржа = &Биржа
		|				И БиржевойИндекс В (&БиржевыеИндексы)) КАК ЗначенияБиржевыхИндексовСрезПоследних";
	
	Запрос.УстановитьПараметр("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Запрос.УстановитьПараметр("БиржевыеИндексы", ПолучитьИндексыДляОблигации(Облигация, Дата, ДатаПогашения));
	Запрос.УстановитьПараметр("Период", Дата);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	МассивЗначенийИндексов = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивЗначенийИндексов.Добавить(Новый Структура("КодИндекса,Доходность", ВыборкаДетальныеЗаписи.КодИндекса, ВыборкаДетальныеЗаписи.Доходность));
	КонецЦикла;
	
	Возврат МассивЗначенийИндексов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Процедура РассчитатьСводныеКотировки(ИмяРегистра, Отбор, Отказ) Экспорт
	Если ЗначениеЗаполнено(Отбор.ЦеннаяБумага.Значение)
		И Не ОбщегоНазначения.ОбъектСуществуетВБазеДанных(Отбор.ЦеннаяБумага.Значение)
	Тогда
		// Идёт непосредственное удаление ведущего объекта и ничего пересчитывать не надо
		Возврат;
	КонецЕсли;
	
	Если Не Отбор.Период.Использование Или Не ЗначениеЗаполнено(Отбор.Период.Значение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись котировок без установленного отбора по периоду не поддерживается",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	КотировкиМД = Метаданные.РегистрыСведений[ИмяРегистра];
	
	ОтборБезПериода = Новый Структура;
	
	ИзмеренияСтрокой       = "";
	УсловиеСрезаСводных    = "";
	УсловиеОтбораКотировок = "";
	УсловиеСоединения      = "";
	РасчетныеПоляСводныхКотировок = "&Период КАК Период";
	
	Для Каждого ИзмерениеМД Из КотировкиМД.Измерения Цикл
		Если Отбор[ИзмерениеМД.Имя].Использование Тогда
			ОтборБезПериода.Вставить(ИзмерениеМД.Имя, Отбор[ИзмерениеМД.Имя].Значение);
			
			УсловиеСрезаСводных = УсловиеСрезаСводных + ?(ПустаяСтрока(УсловиеСрезаСводных), "", " И ") + ИзмерениеМД.Имя + " = &" + ИзмерениеМД.Имя;
			УсловиеОтбораКотировок = УсловиеОтбораКотировок + ?(ПустаяСтрока(УсловиеОтбораКотировок), "", " И ")
				+ "Котировки." + ИзмерениеМД.Имя + " = &" + ИзмерениеМД.Имя;
		КонецЕсли;
		
		ИзмеренияСтрокой  = ИзмеренияСтрокой + ?(ПустаяСтрока(ИзмеренияСтрокой), "", ", ") + ИзмерениеМД.Имя;
		РасчетныеПоляСводныхКотировок = РасчетныеПоляСводныхКотировок + "," + Символы.ПС + Символы.Таб + "ЕСТЬNULL(Котировки." + ИзмерениеМД.Имя
			+ ", КотировкиСводныеСрезПоследних." + ИзмерениеМД.Имя + ") КАК " + ИзмерениеМД.Имя;
		УсловиеСоединения = УсловиеСоединения + ?(ПустаяСтрока(УсловиеСоединения), "", Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб + " И ")
			+ "Котировки." + ИзмерениеМД.Имя + " = КотировкиСводныеСрезПоследних." + ИзмерениеМД.Имя;
	КонецЦикла;
	
	ШаблонРесурса =
		"	ВЫБОР КОГДА ЕСТЬNULL(Котировки.Ресурс, 0) <> 0 ТОГДА Котировки.Ресурс ИНАЧЕ КотировкиСводныеСрезПоследних.Ресурс КОНЕЦ КАК Ресурс,
		|	ВЫБОР КОГДА ЕСТЬNULL(Котировки.Ресурс, 0) <> 0 ТОГДА &Период ИНАЧЕ КотировкиСводныеСрезПоследних.Ресурс_DATE КОНЕЦ КАК Ресурс_DATE";
	
	Ресурсы = Новый Массив;
	
	Для Каждого РесурсМД Из КотировкиМД.Ресурсы Цикл
		Ресурсы.Добавить(РесурсМД.Имя);
		
		РасчетныеПоляСводныхКотировок = РасчетныеПоляСводныхКотировок + "," + Символы.ПС;
		
		Если НРег(РесурсМД.Имя) = "валюта" Тогда
			РасчетныеПоляСводныхКотировок = РасчетныеПоляСводныхКотировок + "	ЕСТЬNULL(Котировки.Валюта, КотировкиСводныеСрезПоследних.Валюта) КАК Валюта";
		ИначеЕсли НРег(РесурсМД.Имя) = "accint" Тогда
			РасчетныеПоляСводныхКотировок = РасчетныеПоляСводныхКотировок +
				"	Котировки.ACCINT КАК ACCINT,
				|	Котировки.Период КАК ACCINT_DATE";
		Иначе
			РасчетныеПоляСводныхКотировок = РасчетныеПоляСводныхКотировок + СтрЗаменить(ШаблонРесурса, "Ресурс", РесурсМД.Имя)
		КонецЕсли;
	КонецЦикла;
	
	ДатаРасчета = Отбор.Период.Значение;
	
	// Сводные котировки рассчитываются на каждую дату из таблицы котировок.
	//	В 99% случаев мы качаем котировки за вчерашний день, поэтому этот день
	//	рассчитаем в запросе, а последующие дни уже в цикле
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	// Блокировка
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений." + ИмяРегистра + "Сводные");
	ЭлементБлокировкиДанных.УстановитьЗначение("Период", Новый Диапазон(ДатаРасчета, ));
	Для Каждого КлючЗнач Из ОтборБезПериода Цикл
		ЭлементБлокировкиДанных.УстановитьЗначение(КлючЗнач.Ключ, КлючЗнач.Значение);
	КонецЦикла;
	БлокировкаДанных.Заблокировать();
	
	Запрос = Новый Запрос;
	// Запрос нельзя редактировать через конструктор, т.к. он зависит от параметров.
	//	Если потребуется сделать его совместимым к изменениям через конструктор, нужно добавить для
	//		"&РасчетныеПоляСводныхКотировокНаДатуРасчета КАК РасчетныеПоляСводныхКотировокНаДатуРасчета" вместо "*"
	//		у временной таблицы _СводныеКотировкиНаДатуРасчета замену на текст, который аналогичен тому, что лежит под фразой
	//		"&РасчетныеПоляСводныхКотировок КАК РасчетныеПоляСводныхКотировок", но с учётом того, что нужно брать параметры
	//		из таблицы _ПолныеСводныеКотировки, а не Котировки или КотировкиСводныеСрезПоследних.
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&РасчетныеПоляСводныхКотировок КАК РасчетныеПоляСводныхКотировок,
		|	НЕ Котировки.Период ЕСТЬ NULL КАК КотировкаНаДатуРасчета
		|ПОМЕСТИТЬ _ПолныеСводныеКотировки
		|ИЗ
		|	(ВЫБРАТЬ
		|		*
		|	ИЗ
		|		РегистрСведений.КотировкиТорговыхПлощадок КАК Котировки
		|	ГДЕ
		|		Котировки.Период = &Период
		|		И &УсловиеОтбораКотировок
		|	) КАК Котировки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
		|			ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -1),
		|			&УсловиеСрезаСводных
		|		) КАК КотировкиСводныеСрезПоследних
		|		ПО (&УсловиеСоединения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ПОМЕСТИТЬ _СводныеКотировкиНаДатуРасчета
		|ИЗ
		|	_ПолныеСводныеКотировки КАК _ПолныеСводныеКотировки
		|ГДЕ
		|	_ПолныеСводныеКотировки.КотировкаНаДатуРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Котировки.Период КАК Период
		|ПОМЕСТИТЬ _ПериодыСводныхКотировокПозжеДатыРасчета
		|ИЗ
		|	РегистрСведений.КотировкиТорговыхПлощадокСводные КАК Котировки
		|ГДЕ
		|	Котировки.Период > &Период
		|	И &УсловиеОтбораКотировок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	РегистрСведений.КотировкиТорговыхПлощадок КАК Котировки
		|ГДЕ
		|	Котировки.Период > &Период
		|	И &УсловиеОтбораКотировок
		|ИТОГИ ПО
		|	Период";
	#КонецОбласти
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КотировкиТорговыхПлощадок", ИмяРегистра);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораКотировок", УсловиеОтбораКотировок);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСрезаСводных", УсловиеСрезаСводных);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСоединения", УсловиеСоединения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РасчетныеПоляСводныхКотировок КАК РасчетныеПоляСводныхКотировок", РасчетныеПоляСводныхКотировок);
	
	Запрос.УстановитьПараметр("Период", ДатаРасчета);
	Для Каждого КлючЗнач Из ОтборБезПериода Цикл
		Запрос.УстановитьПараметр(КлючЗнач.Ключ, КлючЗнач.Значение);
	КонецЦикла;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РезультатЗапрос = Запрос.Выполнить();
	
	// Запись сводных котировок на дату расчёта
	НаборСводныхКотировок = РегистрыСведений[ИмяРегистра + "Сводные"].СоздатьНаборЗаписей();
	
	Для Каждого КлючЗнач Из ОтборБезПериода Цикл
		НаборСводныхКотировок.Отбор[КлючЗнач.Ключ].Установить(КлючЗнач.Значение);
	КонецЦикла;
	
	НаборСводныхКотировок.Отбор.Период.Установить(ДатаРасчета);
	
	НаборСводныхКотировок.Загрузить(Запрос.МенеджерВременныхТаблиц.Таблицы["_СводныеКотировкиНаДатуРасчета"].ПолучитьДанные().Выгрузить());
	НаборСводныхКотировок.Записать();
	
	// Удаление сводных котировок за даты позже даты расчёта
	_ПериодыСводныхКотировокПозжеДатыРасчета =
		Запрос.МенеджерВременныхТаблиц.Таблицы["_ПериодыСводныхКотировокПозжеДатыРасчета"].ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("Период");
	
	Для Каждого Период Из _ПериодыСводныхКотировокПозжеДатыРасчета Цикл
		НаборСводныхКотировок.Отбор.Период.Установить(Период);
		НаборСводныхКотировок.Очистить();
		НаборСводныхКотировок.Записать();
	КонецЦикла;
	
	// Дорасчёт сводных котировок, введённых позже
	СводныеКотировки = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПолныеСводныеКотировки"].ПолучитьДанные().Выгрузить();
	
	ВыборкаПериод = РезультатЗапрос.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериод.Следующий() Цикл
		НаборСводныхКотировок.Отбор.Период.Установить(ВыборкаПериод.Период);
		НаборСводныхКотировок.Очистить();
		
		Выборка = ВыборкаПериод.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаписьСводныхКотировок = НаборСводныхКотировок.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьСводныхКотировок, Выборка, "Период, " + ИзмеренияСтрокой);
			
			ОтборЗаписи = Новый Структура(ИзмеренияСтрокой);
			ЗаполнитьЗначенияСвойств(ОтборЗаписи, Выборка, ИзмеренияСтрокой);
			
			СтрокиСводныеКотировки = СводныеКотировки.НайтиСтроки(ОтборЗаписи);
			
			Если СтрокиСводныеКотировки.Количество() = 0 Тогда
				СтрокаСводныеКотировки = СводныеКотировки.Добавить();
			ИначеЕсли СтрокиСводныеКотировки.Количество() = 1 Тогда
				СтрокаСводныеКотировки = СтрокиСводныеКотировки[0];
			Иначе
				ВызватьИсключение "Ошибка расчета сводных котировок: неоднозначные сводные котировки";
			КонецЕсли;
			
			Для Каждого Ресурс Из Ресурсы Цикл
				Если Ресурс = "Валюта" Тогда
					ЗаписьСводныхКотировок.Валюта = Выборка.Валюта;
				Иначе
					Если Выборка[Ресурс] <> 0 Или Ресурс = "ACCINT" Тогда // Купон может быть 0
						ЗаписьСводныхКотировок[Ресурс] = Выборка[Ресурс];
						ЗаписьСводныхКотировок[Ресурс + "_DATE"] = Выборка.Период;
					Иначе
						ЗаписьСводныхКотировок[Ресурс] = СтрокаСводныеКотировки[Ресурс];
						ЗаписьСводныхКотировок[Ресурс + "_DATE"] = СтрокаСводныеКотировки[Ресурс + "_DATE"];
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ЗаполнитьЗначенияСвойств(СтрокаСводныеКотировки, ЗаписьСводныхКотировок,, "Период");
		КонецЦикла;
		НаборСводныхКотировок.Записать();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры // РассчитатьСводныеКотировки

////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьЗапросПортфеляЦенныхБумаг(Организация, Период, ФильтрЦенныхБумаг, РасшифровкаПоОснованию = Ложь, РасшифровкаПоКонтрагенту = Ложь, РасшифровкаПоЦеннойБумаге = Ложь, ПоместитьВоВременнуюТаблицу = Ложь, ИмяВременнойТаблицы = "_ПортфельЦенныхБумаг", МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностиПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(&Период, &ФильтрЦенныхБумаг) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоОснованию
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Основание,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоКонтрагенту
		|			ТОГДА ВЫБОР
		|					КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер.ЮрФизЛицо
		|					ИНАЧЕ _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоЦеннойБумаге
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ЦеннаяБумага
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	0 КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПроданоВРЕПО,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КупленоПоРЕПО,
		|	0 КАК ПроданоТПлюс,
		|	0 КАК КупленоТПлюс
		|ПОМЕСТИТЬ _ЗадолженностиИОстаткиЦБ
		|ИЗ
		|	_ЗадолженностиПоЦеннымБумагамОстатки КАК _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностиПоЦеннымБумагамОстатки КАК _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО
		|		ПО _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.СчетДоверительногоУправления = _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.СчетДоверительногоУправления
		|			И _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание = _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.Основание
		|			И (_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ЦеннаяБумага = _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ЦеннаяБумага)
		|			И (_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|ГДЕ
		|	_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоОснованию
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоКонтрагенту
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер.ЮрФизЛицо
		|					ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоЦеннойБумаге
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(&Период, &ФильтрЦенныхБумаг) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностиПоЦеннымБумагамТПлюс.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоОснованию
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.Основание
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоКонтрагенту
		|			ТОГДА ВЫБОР
		|					КОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.Основание.Брокер.ЮрФизЛицо
		|					ИНАЧЕ _ЗадолженностиПоЦеннымБумагамТПлюс.Основание.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоЦеннойБумаге
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.ЦеннаяБумага
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамТПлюс.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	_ЗадолженностиПоЦеннымБумагамОстатки КАК _ЗадолженностиПоЦеннымБумагамТПлюс
		|ГДЕ
		|	НЕ _ЗадолженностиПоЦеннымБумагамТПлюс.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоКонтрагенту
		|			ТОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &РасшифровкаПоЦеннойБумаге
		|			ТОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(&Период, &ФильтрЦенныхБумаг) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиИОстаткиЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностиИОстаткиЦБ.Основание КАК Основание,
		|	_ЗадолженностиИОстаткиЦБ.Контрагент КАК Контрагент,
		|	_ЗадолженностиИОстаткиЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ЗадолженностиИОстаткиЦБ.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(_ЗадолженностиИОстаткиЦБ.ПроданоВРЕПО) КАК ПроданоВРЕПО,
		|	СУММА(_ЗадолженностиИОстаткиЦБ.КупленоПоРЕПО) КАК КупленоПоРЕПО,
		|	СУММА(_ЗадолженностиИОстаткиЦБ.ПроданоТПлюс) КАК ПроданоТПлюс,
		|	СУММА(_ЗадолженностиИОстаткиЦБ.КупленоТПлюс) КАК КупленоТПлюс
		|ПОМЕСТИТЬ _ПортфельЦенныхБумаг
		|ИЗ
		|	_ЗадолженностиИОстаткиЦБ КАК _ЗадолженностиИОстаткиЦБ
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностиИОстаткиЦБ.СчетДоверительногоУправления,
		|	_ЗадолженностиИОстаткиЦБ.Основание,
		|	_ЗадолженностиИОстаткиЦБ.Контрагент,
		|	_ЗадолженностиИОстаткиЦБ.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЗадолженностиИОстаткиЦБ");
	
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("Период",								Период);
	Запрос.УстановитьПараметр("РасшифровкаПоОснованию",				РасшифровкаПоОснованию);
	Запрос.УстановитьПараметр("РасшифровкаПоКонтрагенту",			РасшифровкаПоКонтрагенту);
	Запрос.УстановитьПараметр("РасшифровкаПоЦеннойБумаге",			РасшифровкаПоЦеннойБумаге);	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрЦенныхБумаг",	ФильтрЦенныхБумаг);	
	
	Если Не ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ИмяВременнойТаблицы = "_ПортфельЦенныхБумаг";
	КонецЕсли;
	
	// Когда нужно поместить результат в менеджер ВТ:
	//  - если в менеджере есть ВТ, то ничего не делаем
	//  - если в менеджере нет ВТ, то формируем запрос для получения данных из регистров и помещения их в ВТ
	// Когда не нужно помещать результат в менеджер ВТ:
	//  - если в менеджере есть ВТ, формируем запрос на получение данных из ВТ
	//  - если в менеджере нет ВТ, то формируем запрос для получения данных из регистров
	
	Если ПоместитьВоВременнуюТаблицу Тогда
		
		Если МенеджерВременныхТаблиц = Неопределено Тогда
			МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		КонецЕсли;
		
		Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицы) = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ _ПортфельЦенныхБумаг", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);	
		Иначе
			Запрос.Текст = "";
		КонецЕсли;

		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ _ПортфельЦенныхБумаг", "");	
		
		Если МенеджерВременныхТаблиц <> Неопределено
			И МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицы) <> Неопределено
		Тогда
		
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ %1", ИмяВременнойТаблицы);	
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Запрос;	
	
КонецФункции

Функция ПолучитьЦенныеБумагиКлиента(Клиент, Организация, Период, РасшифровкаПоОснованию = Ложь, РасшифровкаПоКонтрагенту = Ложь, РасшифровкаПоЦеннойБумаге = Ложь, ПоместитьВоВременнуюТаблицу = Ложь, ИмяВременнойТаблицы = "_ЦенныеБумагиКлиента", МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	// Получаем действующие счета д/у клиента
	
	ИмяВременнойТаблицыСчетовКлиента = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(Клиент, Организация, Период, Истина, , МенеджерВременныхТаблиц);
	
	// Получаем ценные бумаги	
	
	ФильтрЦенныхБумаг = СтрШаблон("(Организация, СчетДоверительногоУправления) В (ВЫБРАТЬ Организация, СчетДоверительногоУправления ИЗ %1)", ИмяВременнойТаблицыСчетовКлиента);
		
	Запрос = ПолучитьЗапросПортфеляЦенныхБумаг(Организация, Период, ФильтрЦенныхБумаг, РасшифровкаПоОснованию, РасшифровкаПоКонтрагенту, РасшифровкаПоЦеннойБумаге, ПоместитьВоВременнуюТаблицу, ИмяВременнойТаблицы, МенеджерВременныхТаблиц);
	
	Если ПоместитьВоВременнуюТаблицу Тогда
		
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда // если ВТ уже есть, то выполнять нечего
			Запрос.Выполнить();
		КонецЕсли;
		
		РезультатФункции = ИмяВременнойТаблицы;
		
	Иначе
		
		Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда // он должен быть задействован для получения счетов д/у клиента
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		КонецЕсли;		
		
		РезультатФункции = Запрос.Выполнить().Выгрузить();		
		
	КонецЕсли;
	
	Возврат РезультатФункции;	
	
КонецФункции

Функция ПолучитьПортфельЦенныхБумаг(Организация, СчетДоверительногоУправления, ЦенныеБумаги = Неопределено, Период, РасшифровкаПоОснованию = Ложь, РасшифровкаПоКонтрагенту = Ложь, РасшифровкаПоЦеннойБумаге = Ложь) Экспорт
	
	// Получаем фильтр ценных бумаг	
	
	ТЗ_ЦенныеБумаги = Новый ТаблицаЗначений;
	ТЗ_ЦенныеБумаги.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	Если ТипЗнч(ЦенныеБумаги) = Тип("ТаблицаЗначений") Тогда
		ТЗ_ЦенныеБумаги = ЦенныеБумаги;
	ИначеЕсли ТипЗнч(ЦенныеБумаги) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ТЗ_ЦенныеБумаги.Добавить(), ЦенныеБумаги);
	ИначеЕсли ЦенныеБумаги = Неопределено Тогда
		ТЗ_ЦенныеБумаги.Добавить();
	Иначе
		ВызватьИсключение "Некорректное значение параметра ""ЦенныеБумаги""";
	КонецЕсли;	
	
	Если ЦенныеБумаги = Неопределено Тогда
		ФильтрЦенныхБумаг = "(Организация, СчетДоверительногоУправления) В (ВЫБРАТЬ Организация, СчетДоверительногоУправления ИЗ _ЦенныеБумаги)";
	Иначе	
		ФильтрЦенныхБумаг = "(Организация, СчетДоверительногоУправления, Рынок, ЦеннаяБумага) В (ВЫБРАТЬ Организация, СчетДоверительногоУправления, Рынок, ЦеннаяБумага ИЗ _ЦенныеБумаги)";
	КонецЕсли;	
	
	// Компонуем запрос	
	
	Запрос = ПолучитьЗапросПортфеляЦенныхБумаг(Организация, Период, ФильтрЦенныхБумаг, РасшифровкаПоОснованию, РасшифровкаПоКонтрагенту, РасшифровкаПоЦеннойБумаге);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Организация КАК Организация,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Закладные)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ВалютныеПары
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары)
		|		КОГДА ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ПустаяСсылка)
		|	КОНЕЦ КАК Рынок,
		|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	&ЦенныеБумаги КАК ЦенныеБумаги
		|;" + Запрос.Текст;
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦенныеБумаги",					ТЗ_ЦенныеБумаги);

	Возврат Запрос.Выполнить().Выгрузить();
 
КонецФункции

Функция ПолучитьОблигацииСРасчетнымКупоном() Экспорт 
	
	ТаблицаОблигаций = Новый ТаблицаЗначений();

	ТаблицаОблигаций.Колонки.Добавить("Облигация",		Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	ТаблицаОблигаций.Колонки.Добавить("ДатаНачала",		Новый ОписаниеТипов("Дата"));
	ТаблицаОблигаций.Колонки.Добавить("ДатаОкончания",	Новый ОписаниеТипов("Дата"));
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг");
	СтрокаТаблицыОблигаций.ДатаНачала = '20200818';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВейлФинанс");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстандарт");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Пересвет");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДОМ.РФ_003");
	СтрокаТаблицыОблигаций.ДатаНачала = '20201002';
	СтрокаТаблицыОблигаций.ДатаОкончания = '20210402';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДОМ.РФ_025");
	СтрокаТаблицыОблигаций.ДатаНачала = '20201002';
	СтрокаТаблицыОблигаций.ДатаОкончания = '20210101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрХолдинг_004");
	СтрокаТаблицыОблигаций.ДатаНачала = '20200409';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_Дол");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_До2");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВТБ_060");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВТБ_067");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Сбербанк_324");
	СтрокаТаблицыОблигаций.ДатаНачала = '00010101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_SIBUR_4_1/8_10/");
	СтрокаТаблицыОблигаций.ДатаНачала = '20221101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_SIBUR_2.95_07/0");
	СтрокаТаблицыОблигаций.ДатаНачала = '20221101';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_VTB_9_1/2_12/29");
	СтрокаТаблицыОблигаций.ДатаНачала = '20221206';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	СтрокаТаблицыОблигаций = ТаблицаОблигаций.Добавить();
	СтрокаТаблицыОблигаций.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_CBOM_Finance_XS1601094755");
	СтрокаТаблицыОблигаций.ДатаНачала = '20230510';
	СтрокаТаблицыОблигаций.ДатаОкончания = '00010101';
	
	Возврат ТаблицаОблигаций;
	
КонецФункции

Функция ПолучитьОблигацииСРасчетнымКупономНаДату(НаДату) Экспорт 

	ТаблицаОблигаций = ПолучитьОблигацииСРасчетнымКупоном();
	
	МассивОблигаций = Новый Массив();
	
	Для каждого СтрокаТаблицыОблигаций Из ТаблицаОблигаций Цикл
		Если (СтрокаТаблицыОблигаций.ДатаНачала = '00010101' ИЛИ СтрокаТаблицыОблигаций.ДатаНачала <= НаДату)
			И (СтрокаТаблицыОблигаций.ДатаОкончания = '00010101' ИЛИ СтрокаТаблицыОблигаций.ДатаОкончания >= НаДату) Тогда
			МассивОблигаций.Добавить(СтрокаТаблицыОблигаций.Облигация);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОблигаций;

КонецФункции 

Функция ПолучитьДатыПримененияРасчетногоКупона(Облигация) Экспорт 

	ТаблицаОблигаций = ПолучитьОблигацииСРасчетнымКупоном();
	
	СтрокиОблигации = ТаблицаОблигаций.НайтиСтроки(Новый Структура("Облигация", Облигация));
	Если СтрокиОблигации.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
	    Возврат Новый Структура("ДатаНачала,ДатаОкончания", СтрокиОблигации[0].ДатаНачала, СтрокиОблигации[0].ДатаОкончания);
	КонецЕсли;

КонецФункции 

// В переданном документе заполняет ценные бумаги по ISIN и находит партии по номеру и дате сделки
//
//	Параметры:
//		ДокументОбъект 				- Объект документа 
//		АдресВоВременномХранилище 	- Строка - адрес файла Excel во временном хранилище
//
Процедура ЗаполнитьЦенныеБумагиИПартииПоДаннымФайлаExcel(ДокументОбъект, АдресВоВременномХранилище) Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресВоВременномХранилище) Тогда
		
		ПутьКФайлу				= ПолучитьИмяВременногоФайла("xlsx");
			
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
		ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
		
		УдалитьИзВременногоХранилища(АдресВоВременномХранилище);
		
	Иначе
		Возврат;
	КонецЕсли;

	ЗаполнитьПартии = ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ВыводЦенныхБумаг");
	
	ТаблицаФайла = Новый ТабличныйДокумент;
	ТаблицаФайла.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	МассивСтрокФайла = Новый Массив;
	
	ИсходныеДанныеПоЦеннымБумагам = ДокументОбъект.ЦенныеБумаги.Выгрузить();
		
	ИсходныеДанныеПоЦеннымБумагам.Колонки.Добавить("ISIN", 				Новый ОписаниеТипов("Строка",,,, 	Новый КвалификаторыСтроки(30)));
	ИсходныеДанныеПоЦеннымБумагам.Колонки.Добавить("НомерСделки", 		Новый ОписаниеТипов("Строка",,,, 	Новый КвалификаторыСтроки(16)));
	ИсходныеДанныеПоЦеннымБумагам.Колонки.Добавить("НомерСтрокиФайла", 	Новый ОписаниеТипов("Число",,,		Новый КвалификаторыЧисла(10, 0)));
	
	// Если в файле несколько закладок, они загружаются в отдельные области
	// Найдем область, соответствующую первой закладке
	НомерПоследнейСтрокиОбласти = 0;
	Для Каждого ТекОбласть Из ТаблицаФайла.Области Цикл
		Если ТекОбласть.Верх = 1 Тогда
			НомерПоследнейСтрокиОбласти = ТекОбласть.Низ;
			Прервать;                     		
		КонецЕсли;
	КонецЦикла;	
	
	Если НомерПоследнейСтрокиОбласти = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка чтения файла");
		Возврат;		
	КонецЕсли;
	
	Отказ = Ложь;
	НомерПервойСтрокиДанных = 0;
	Для НомСтр = 1 По НомерПоследнейСтрокиОбласти Цикл
		
		Количество = СтрЗаменить(ТаблицаФайла.Область(НомСтр, 7,НомСтр, 7).Текст, Символы.НПП, "");
		
		Если Количество = "" Тогда	
			Продолжить;
		КонецЕсли;
		
		Если НомерПервойСтрокиДанных = 0 И РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(СтрЗаменить(Количество, ",", ""), , Ложь) Тогда 
			// Нашли количество - считаем, что это первая строка данных
			НомерПервойСтрокиДанных = НомСтр;			
		ИначеЕсли НомерПервойСтрокиДанных = 0 Тогда
			Продолжить;
		КонецЕсли;
				
		ISIN = СокрЛП(ТаблицаФайла.Область(НомСтр, 4,НомСтр, 4).Текст);
		
		НоваяСтрока = ИсходныеДанныеПоЦеннымБумагам.Добавить();
		
		НоваяСтрока.ISIN				= ISIN;
		НоваяСтрока.НомерСтрокиФайла	= НомСтр;
		   		
		Попытка			
			НоваяСтрока.Количество = Число(Количество);
		Исключение                             			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("При загрузке из файла произошла ошибка: %1!%2Строка №%3. Загрузка прервана",  + ОписаниеОшибки(), Символы.ПС, НоваяСтрока.НомерСтрокиФайла),,,, Отказ);			
			Прервать;                          			
		КонецПопытки;

		// В поручении другие колонки не заполняем
		Если Не ЗаполнитьПартии Тогда		
			Продолжить;
		КонецЕсли;
		
		// В выводе дополняем данными по партиям
		НоваяСтрока.НомерСделки = СокрЛП(СтрЗаменить(ТаблицаФайла.Область(НомСтр, 5,НомСтр, 5).Текст, Символы.НПП, ""));
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена. Обработано " + Строка(НомерПоследнейСтрокиОбласти) + " строк.");
	
	КоличествоСтрокДанных = ИсходныеДанныеПоЦеннымБумагам.Количество();
	Если КоличествоСтрокДанных = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НомерПоследнейСтрокиДанных = ИсходныеДанныеПоЦеннымБумагам[КоличествоСтрокДанных - 1].НомерСтрокиФайла;	
	
	#Область Текст_запроса
	
	Запрос = Новый Запрос(
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ИсходныеДанныеПоЦеннымБумагам.НомерСтрокиФайла КАК НомерСтроки,
	    |	ИсходныеДанныеПоЦеннымБумагам.ISIN КАК ISIN,
	    |	ИсходныеДанныеПоЦеннымБумагам.НомерСделки КАК НомерСделки,
	    |	ИсходныеДанныеПоЦеннымБумагам.Количество КАК Количество
	    |ПОМЕСТИТЬ _ИсходныеДанныеПоЦеннымБумагам
	    |ИЗ
	    |	&ИсходныеДанныеПоЦеннымБумагам КАК ИсходныеДанныеПоЦеннымБумагам
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ИсходныеДанныеПоЦеннымБумагам.НомерСтроки КАК НомерСтроки,
	    |	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	_ИсходныеДанныеПоЦеннымБумагам.ISIN КАК ISIN,
	    |	_ИсходныеДанныеПоЦеннымБумагам.НомерСделки КАК НомерСделки,
	    |	_ИсходныеДанныеПоЦеннымБумагам.Количество КАК Количество,
	    |	КодыВТорговыхСистемахСрезПоследних.Объект ЕСТЬ НЕ NULL  КАК ЦеннаяБумагаНайдена
	    |ПОМЕСТИТЬ _ЦенныеБумаги
	    |ИЗ
	    |	_ИсходныеДанныеПоЦеннымБумагам КАК _ИсходныеДанныеПоЦеннымБумагам
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
	    |		ПО _ИсходныеДанныеПоЦеннымБумагам.ISIN = КодыВТорговыхСистемахСрезПоследних.Код
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	    |				&Период,
	    |				Организация = &Организация
	    |					И СчетДоверительногоУправления = &СчетДоверительногоУправления
	    |					И ДепозитарныйСчет = &ДепозитарныйСчет
	    |					И Рынок = &Рынок) КАК ОстаткиЦенныхБумагОстатки
	    |		ПО (КодыВТорговыхСистемахСрезПоследних.Объект = ОстаткиЦенныхБумагОстатки.ЦеннаяБумага)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
	    |	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
	    |	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	    |	ВЫБОР
	    |		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.Сделка)
	    |			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.Сделка).НомерСделки
	    |		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
	    |			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки
	    |		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
	    |			ТОГДА ВводЦенныхБумагЦенныеБумаги.НомерСделки
	    |		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстатки.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
	    |			ТОГДА РеклассификацияАктивовЕПСПартии.НомерСделки
	    |		ИНАЧЕ """"
	    |	КОНЕЦ КАК НомерСделки,
	    |	БухПартииЦенныхБумагОстатки.Партия.Дата КАК ДатаПартии,
	    |	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоНаПартии
	    |ПОМЕСТИТЬ _БухПартииЦенныхБумагОстатки
	    |ИЗ
	    |	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	    |			&Период,
	    |			Организация = &Организация
	    |				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	    |				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	    |				И Рынок = &Рынок) КАК БухПартииЦенныхБумагОстатки
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
	    |		ПО БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
	    |			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
	    |		ПО БухПартииЦенныхБумагОстатки.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
	    |			И БухПартииЦенныхБумагОстатки.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
	    |ГДЕ
	    |	&ЗаполнитьПартии
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БухПартииЦенныхБумагОстатки.Партия) КАК Партия,
	    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БухПартииЦенныхБумагОстатки.СтрокаПартии) КАК СтрокаПартии
	    |ПОМЕСТИТЬ _БухПартииЦенныхБумагОстаткиСОднойПартией
	    |ИЗ
	    |	_БухПартииЦенныхБумагОстатки КАК БухПартииЦенныхБумагОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	БухПартииЦенныхБумагОстатки.ЦеннаяБумага
	    |
	    |ИМЕЮЩИЕ
	    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БухПартииЦенныхБумагОстатки.Партия) = 1 И
	    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БухПартииЦенныхБумагОстатки.СтрокаПартии) = 1
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	_БухПартииЦенныхБумагОстатки.Партия КАК Партия,
	    |	_БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
	    |	_БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	    |	_БухПартииЦенныхБумагОстатки.НомерСделки КАК НомерСделки,
	    |	_БухПартииЦенныхБумагОстатки.ДатаПартии КАК ДатаПартии,
	    |	_БухПартииЦенныхБумагОстатки.КоличествоНаПартии КАК КоличествоНаПартии,
	    |	_БухПартииЦенныхБумагОстаткиСОднойПартией.ЦеннаяБумага ЕСТЬ НЕ NULL  КАК ОднаПартия
	    |ПОМЕСТИТЬ _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии
	    |ИЗ
	    |	_БухПартииЦенныхБумагОстатки КАК _БухПартииЦенныхБумагОстатки
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _БухПартииЦенныхБумагОстаткиСОднойПартией КАК _БухПартииЦенныхБумагОстаткиСОднойПартией
	    |		ПО _БухПартииЦенныхБумагОстатки.ЦеннаяБумага = _БухПартииЦенныхБумагОстаткиСОднойПартией.ЦеннаяБумага
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_ЦенныеБумаги.ISIN КАК ISIN,
	    |	_ЦенныеБумаги.НомерСтроки КАК НомерСтроки,
	    |	_ЦенныеБумаги.НомерСделки КАК НомерСделки,
	    |	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	_ЦенныеБумаги.Количество КАК Количество,
	    |	_ЦенныеБумаги.ЦеннаяБумагаНайдена КАК ЦеннаяБумагаНайдена,
	    |	_ЦенныеБумаги.НомерСделки <> """" КАК ЕстьНомерСделки,
	    |	_ЦенныеБумаги.НомерСделки <> """"
	    |			И _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.Партия ЕСТЬ НЕ NULL 
	    |		ИЛИ _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.Партия ЕСТЬ НЕ NULL  КАК ПартияНайдена,
	    |	_БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.Партия КАК Партия,
	    |	_БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.СтрокаПартии КАК СтрокаПартии,
	    |	_БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.ДатаПартии КАК ДатаПартии,
	    |	_БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.КоличествоНаПартии КАК КоличествоНаПартии,
	    |	_БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.УчетныйАктивЕПС КАК УчетныйАктивЕПС
	    |ПОМЕСТИТЬ _Результат
	    |ИЗ
	    |	_ЦенныеБумаги КАК _ЦенныеБумаги
	    |		ЛЕВОЕ СОЕДИНЕНИЕ _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии КАК _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии
	    |		ПО _ЦенныеБумаги.ЦеннаяБумага = _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.ЦеннаяБумага
	    |			И (ВЫБОР
	    |				КОГДА _ЦенныеБумаги.НомерСделки <> """"
	    |					ТОГДА _ЦенныеБумаги.НомерСделки = _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.НомерСделки
	    |				ИНАЧЕ _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.УчетныйАктивЕПС В (&УчетныеАктивыПоАС)
	    |						И _БухПартииЦенныхБумагОстаткиСПризнакомОднойПартии.ОднаПартия
	    |			КОНЕЦ)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	_Результат.ЦеннаяБумага КАК ЦеннаяБумага,
	    |	_Результат.Количество КАК Количество,
	    |	ЗНАЧЕНИЕ(Документ.Сделка.) КАК Партия,
	    |	0 КАК СтрокаПартии,
	    |	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.) КАК УчетныйАктивЕПС
	    |ИЗ
	    |	_Результат КАК _Результат
	    |ГДЕ
	    |	_Результат.УчетныйАктивЕПС ЕСТЬ NULL");
	
	#КонецОбласти
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",					ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ДокументОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Рынок",							ДокументОбъект.Рынок);
	Запрос.УстановитьПараметр("ДепозитарныйСчет",				ДокументОбъект.ДепозитарныйСчет);
	Запрос.УстановитьПараметр("ИсходныеДанныеПоЦеннымБумагам",	ИсходныеДанныеПоЦеннымБумагам);
	Запрос.УстановитьПараметр("Период",							Новый Граница(ДокументОбъект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ЗаполнитьПартии",				ЗаполнитьПартии);
	Запрос.УстановитьПараметр("УчетныеАктивыПоАС", 				Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости());
	
	ЦенныеБумагиБезУчетныхАктивов = Запрос.Выполнить().Выгрузить();	
	
	Отказ = Ложь;
	Если ЗаполнитьПартии Тогда
		ЗаполнитьУчетныеАктивыЕПСИПоместитьВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, ДокументОбъект.Дата, ДокументОбъект, ЦенныеБумагиБезУчетныхАктивов, "_ЦенныеБумагиСУчетнымиАктивамиЕПС", Отказ);
	КонецЕсли;
	
	// Если Отказ = Истина, используем исходную таблицу, без дозаполненных учетных активов ЕПС	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Результат.ISIN КАК ISIN,
		|	_Результат.НомерСтроки КАК НомерСтроки,
		|	_Результат.НомерСделки КАК НомерСделки,
		|	_Результат.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Результат.Количество КАК Количество,
		|	_Результат.КоличествоНаПартии КАК КоличествоНаПартии,
		|	_Результат.ЦеннаяБумагаНайдена КАК ЦеннаяБумагаНайдена,
		|	_Результат.ПартияНайдена КАК ПартияНайдена,
		|	_Результат.ЕстьНомерСделки КАК ЕстьНомерСделки,
		|	_Результат.Партия КАК Партия,
		|	_Результат.СтрокаПартии КАК СтрокаПартии,
		|	_Результат.ДатаПартии КАК ДатаПартии,
		|	&УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	_Результат КАК _Результат
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ДатаПартии,
		|	СтрокаПартии";
	
	Если Отказ Или Не ЗаполнитьПартии Тогда 		
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УчетныйАктивЕПС", "_Результат.УчетныйАктивЕПС");
		
	Иначе	
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "_Результат КАК _Результат", "_Результат КАК _Результат		    
			|ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумагиСУчетнымиАктивамиЕПС КАК _ЦенныеБумагиСУчетнымиАктивамиЕПС
			|ПО _Результат.ЦеннаяБумага = _ЦенныеБумагиСУчетнымиАктивамиЕПС.ЦеннаяБумага
			|И _Результат.НомерСтроки = _ЦенныеБумагиСУчетнымиАктивамиЕПС.НомерСтроки");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УчетныйАктивЕПС", "ЕСТЬNULL(_Результат.УчетныйАктивЕПС, _ЦенныеБумагиСУчетнымиАктивамиЕПС.УчетныйАктивЕПС)");
		
	КонецЕсли;

	ЦенныеБумаги = Запрос.Выполнить().Выгрузить();	
	
	Если ДокументОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
		ТипЦБСтрокой = "акцию";
	ИначеЕсли ДокументОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		ТипЦБСтрокой = "облигацию";
	Иначе
		ТипЦБСтрокой = "пай";
	КонецЕсли;
	
	// Проверяем, все ли ценные бумаги найдены по ISIN
	СтрокиСПустымиЦБ = ЦенныеБумаги.НайтиСтроки(Новый Структура("ЦеннаяБумагаНайдена", Ложь));
	Для Каждого СтрокаСПустойЦБ Из СтрокиСПустымиЦБ Цикл		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось определить %1 по ISIN '%2'! Строка  №%3 файла. Загрузка прервана", ТипЦБСтрокой, СтрокаСПустойЦБ.ISIN, СтрокаСПустойЦБ.НомерСтроки));	
	КонецЦикла;
	
	Если ЗаполнитьПартии Тогда
		
		// Проверяем, все ли партии найдены
		СтрокиСПустымиПартиями = ЦенныеБумаги.НайтиСтроки(Новый Структура("ПартияНайдена, ЕстьНомерСделки", Ложь, Истина));
		Для Каждого СтрокаСПустойПартией Из СтрокиСПустымиПартиями Цикл		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось найти партию для ценной бумаги %1 по номеру сделки '%2'! Строка №%3 файла", СтрокаСПустойПартией.ЦеннаяБумага, СтрокаСПустойПартией.НомерСделки, СтрокаСПустойПартией.НомерСтроки));	
		КонецЦикла;
		
		// Распределяем загружаемое количество по FIFO в партиях
		КоличествоСтрокТаблицы = ЦенныеБумаги.Количество();		
		МассивСтрокКУдалению = Новый Массив;
		
		Для НомерСтроки = НомерПервойСтрокиДанных По НомерПоследнейСтрокиДанных Цикл
			
			СтрокиПоПартии = ЦенныеБумаги.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));
			
			// Если несколько строк, нужно распределить количество
			КоличествоНайденныхСтрок = СтрокиПоПартии.Количество();
			Если КоличествоНайденныхСтрок > 1 Тогда
				
				КоличествоКРаспределению = СтрокиПоПартии[0].Количество;
				Для Сч = 0 По КоличествоНайденныхСтрок - 1 Цикл	
					Если КоличествоКРаспределению = 0 Тогда
						МассивСтрокКУдалению.Добавить(СтрокиПоПартии[Сч]);
						Продолжить;
					КонецЕсли;
					СтрокиПоПартии[Сч].Количество = ?(КоличествоКРаспределению >= СтрокиПоПартии[Сч].КоличествоНаПартии, СтрокиПоПартии[Сч].КоличествоНаПартии, КоличествоКРаспределению);
					КоличествоКРаспределению = КоличествоКРаспределению - СтрокиПоПартии[Сч].Количество;
				КонецЦикла;
				
				Если КоличествоКРаспределению > 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось распределить %1 шт %2 по партиям! Строка №%3 файла", КоличествоКРаспределению, СтрокиПоПартии[Сч].ЦеннаяБумага,  СтрокиПоПартии[Сч].НомерСтроки)); 
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
			ЦенныеБумаги.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
	Иначе
		// При загрузке в поручение просто сворачиваем, в нем нет данных по партиям
		ЦенныеБумаги.Свернуть("ЦеннаяБумага", "Количество");		
	КонецЕсли;
		
	ДокументОбъект.ЦенныеБумаги.Загрузить(ЦенныеБумаги);
	
КонецПроцедуры

// Для переданной таблицы ценных бумаг заполняет учетный актив ЕПС и помещает результат в менеджер временных таблиц
//
//	Параметры:
//		- МенеджерВременныхТаблиц 	- менеджер временны таблиц
//		- Период					- Дата среза	
//      - ДанныеОбъекта				- данные исходного документа
//      - ТаблицаЦенныхБумаг		- таблица значений с ценными бумагами
//      - ИмяВременнойТаблицы		- имя временной таблицы для помещения результата
//
Процедура ЗаполнитьУчетныеАктивыЕПСИПоместитьВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, Период, ДанныеОбъекта, ТаблицаЦенныхБумаг, ИмяВременнойТаблицы = "_УчетныеАктивыЕПС", Отказ = Ложь) Экспорт
	
	// Получаем учетный актив ЕПС из таблицы,
	// а если он там не указан, то исходя из остатков на партиях	
	Запрос = Новый Запрос(		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаЦБ.Партия В (НЕОПРЕДЕЛЕНО, &ПустыеСсылкиПартий)
		|		И ТаблицаЦБ.СтрокаПартии = 0 КАК НетДанныхОПартии,
		|	ТаблицаЦБ.Партия КАК Партия,
		|	ТаблицаЦБ.СтрокаПартии КАК СтрокаПартии,
		|	ТаблицаЦБ.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ТаблицаЦБ.Количество КАК Количество,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки
		|ПОМЕСТИТЬ _ТаблицаЦБ
		|ИЗ
		|	&ТаблицаЦБ КАК ТаблицаЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ _ОстаткиПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ТаблицаЦБ.ЦеннаяБумага
		|					ИЗ
		|						_ТаблицаЦБ)) КАК БухПартииЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаЦБ.НомерСтроки КАК НомерСтроки,
		|	_ТаблицаЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаЦБ.НетДанныхОПартии КАК НетДанныхОПартии,
		|	_ТаблицаЦБ.Партия КАК Партия,
		|	_ТаблицаЦБ.СтрокаПартии КАК СтрокаПартии,
		|	_ТаблицаЦБ.Количество КАК Количество,
		|	ЕСТЬNULL(_ОстаткиПартий.УчетныйАктивЕПС, ЕСТЬNULL(_НераспределенныеУчетныеАктивыПартий.УчетныйАктивЕПС, _ТаблицаЦБ.УчетныйАктивЕПС)) КАК УчетныйАктивЕПС,
		|	_ОстаткиПартий.УчетныйАктивЕПС ЕСТЬ НЕ NULL 
		|		ИЛИ _НераспределенныеУчетныеАктивыПартий.УчетныйАктивЕПС ЕСТЬ НЕ NULL  КАК ПодборПоДаннымОстатковПартий
		|ПОМЕСТИТЬ _ТаблицаСЗаполненнымиУчетнымиАктивами
		|ИЗ
		|	_ТаблицаЦБ КАК _ТаблицаЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПартий КАК _ОстаткиПартий
		|		ПО _ТаблицаЦБ.ЦеннаяБумага = _ОстаткиПартий.ЦеннаяБумага
		|			И _ТаблицаЦБ.Партия = _ОстаткиПартий.Партия
		|			И _ТаблицаЦБ.СтрокаПартии = _ОстаткиПартий.СтрокаПартии
		|			И (_ТаблицаЦБ.УчетныйАктивЕПС = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			_ОстаткиПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|			_ОстаткиПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|		ИЗ
		|			_ОстаткиПартий КАК _ОстаткиПартий
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаЦБ КАК _ТаблицаЦБ
		|				ПО (_ТаблицаЦБ.ЦеннаяБумага = _ОстаткиПартий.ЦеннаяБумага)
		|					И (_ТаблицаЦБ.Партия = _ОстаткиПартий.Партия)
		|					И (_ТаблицаЦБ.СтрокаПартии = _ОстаткиПартий.СтрокаПартии)
		|					И (_ТаблицаЦБ.Количество >= _ОстаткиПартий.Количество)
		|		ГДЕ
		|			_ТаблицаЦБ.ЦеннаяБумага ЕСТЬ NULL) КАК _НераспределенныеУчетныеАктивыПартий
		|		ПО _ТаблицаЦБ.ЦеннаяБумага = _НераспределенныеУчетныеАктивыПартий.ЦеннаяБумага
		|			И (_ТаблицаЦБ.НетДанныхОПартии)
		|			И (_ТаблицаЦБ.УчетныйАктивЕПС = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.НомерСтроки КАК НомерСтроки,
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.Партия КАК Партия,
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.СтрокаПартии КАК СтрокаПартии,
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.Количество КАК Количество,
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.ПодборПоДаннымОстатковПартий КАК ПодборПоДаннымОстатковПартий,
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.УчетныйАктивЕПС В (&УчетныеАктивыОцениваемыеПоАС) КАК ОценкаПоАмортизированнойСтоимости
		|ПОМЕСТИТЬ #ИмяВременнойТаблицы#
		|ИЗ
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами КАК _ТаблицаСЗаполненнымиУчетнымиАктивами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦенныеБумагиСРазличнымиУчетнымиАктивамиНаОстатках
		|ИЗ
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами КАК _ТаблицаСЗаполненнымиУчетнымиАктивами
		|ГДЕ
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.ПодборПоДаннымОстатковПартий
		|	И _ТаблицаСЗаполненнымиУчетнымиАктивами.НетДанныхОПартии
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаСЗаполненнымиУчетнымиАктивами.ЦеннаяБумага
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ТаблицаСЗаполненнымиУчетнымиАктивами.УчетныйАктивЕПС) > 1");

	УчетныеАктивыОцениваемыеПоАС = Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости();
	ПустыеСсылкиПартий			 = СистемныеФункции.ПустыеСсылкиСоставногоТипа(Метаданные.ОпределяемыеТипы.Партия.Тип);
	
	Запрос.УстановитьПараметр("Период",						  Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",                  ДанныеОбъекта.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДанныеОбъекта.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Рынок",                        ДанныеОбъекта.Рынок);
	Запрос.УстановитьПараметр("ТаблицаЦБ",					  ТаблицаЦенныхБумаг);
	Запрос.УстановитьПараметр("ПустыеСсылкиПартий",			  ПустыеСсылкиПартий);
	Запрос.УстановитьПараметр("УчетныеАктивыОцениваемыеПоАС", УчетныеАктивыОцениваемыеПоАС);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяВременнойТаблицы#", ИмяВременнойТаблицы);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();

	// Если не удалось определить, как оцениваются бумаги - по СС или по АС, то сообщаем об этом и прерываем оценку		
	БумагиСРазличнымиУчетнымиАктивамиНаОстатках = МенеджерВременныхТаблиц.Таблицы["_ЦенныеБумагиСРазличнымиУчетнымиАктивамиНаОстатках"].ПолучитьДанные().Выгрузить();
	
	Если БумагиСРазличнымиУчетнымиАктивамиНаОстатках.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не удалось однозначно определить учетный актив ЕПС для некоторых ценных бумаг:
				|- %1", СтрСоединить(БумагиСРазличнымиУчетнымиАктивамиНаОстатках.ВыгрузитьКолонку(0), Символы.ПС + "- ")), , , , Отказ);		
	КонецЕсли;
		
КонецПроцедуры 