
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Период = ТекущаяДата();
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	Элементы.Организация.Видимость = ПолныеПрава;
	Элементы.ОрганизацияСсылка.Видимость = Не ПолныеПрава;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСведенияОФайлах();
	УстановитьОтборСпискаФизЛиц();
	ЗаполнитьСписокФизЛицНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если ЭтаФорма.ФизЛица.Количество() > 0 И Вопрос("Таблица физических лиц уже содержит данные. Перезаполнить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСписокФизЛицНаСервере();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЭтаФорма.ФизЛица.Количество() > 0 И Вопрос("Таблица физических лиц уже содержит данные. Перезаполнить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСписокФизЛицНаСервере();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	УстановитьОтборСпискаФизЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицаФизЛицоПриИзменении(Элемент)
	ЗаполнитьСписокФизЛицНаСервере(Элементы.ФизЛица.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаСайтНажатие(Элемент)
	ЗапуститьПриложение("http://services.fms.gov.ru/info-service.htm?sid=2000");
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            	= ЭтаФорма.ПутьККаталогу;
	Диалог.МножественныйВыбор 	= Ложь; 
	Диалог.Заголовок          	= "Выберите каталог"; 
	
	Диалог.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда 
		ЭтаФорма.ПутьККаталогу = Диалог.Каталог;
		ОбновитьСведенияОФайлах();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.ПутьККаталогу);
КонецПроцедуры


#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗагрузитьФайл(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗагрузитьФайл");
	Попытка
		ВыполнитьКомандаЗагрузитьФайл();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаЗагрузитьФайл()
	
		ТекстСообщения = "";
		Если ЗначениеЗаполнено(ЭтаФорма.ПутьККаталогу) Тогда
			Файл = Новый Файл(ЭтаФорма.ПутьККаталогу);
			Если Не Файл.Существует() Тогда
				ТекстСообщения = "Указанный каталог не существует";
			ИначеЕсли Не Файл.ЭтоКаталог() Тогда
				ТекстСообщения = "Указанный путь не является каталогом";
			КонецЕсли; 
		Иначе
			ТекстСообщения = "Не заполнен путь к каталогу";
		КонецЕсли; 
	
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ПутьККаталогу");
			Возврат;
	
		КонецЕсли; 	
	
		Состояние("Скачивание списка недействительных паспортов...");
	
		Путь = ЭтаФорма.ПутьККаталогу + ?(Прав(ЭтаФорма.ПутьККаталогу, 1) = "\", "", "\");
	
		//КопироватьФайл("https://guvm.mvd.ru/upload/expired-passports/list_of_expired_passports.csv.bz2", Путь + "list_of_expired_passports.csv.bz2");
		
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
		ПолучитьДвоичныеДанные7zip(АдресВоВременномХранилище);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		
			Состояние("Распаковка списка...");
		
			ДвоичныеДанные.Записать(Путь + "7za.exe");
		
			СтрокаЗапуска = Путь + "7za.exe x -y list_of_expired_passports.csv.bz2";
			ЗапуститьПриложение(СтрокаЗапуска, Путь, Истина);
		
			ОбновитьСведенияОФайлах();
		
			Состояние("Файл обновлен");
		
			//УдалитьФайлы(Путь + "list_of_expired_passports.csv.bz2");
			УдалитьФайлы(Путь + "7za.exe");
		
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать архиватор 7za.exe");
		КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСписокФизЛиц(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗаполнитьСписокФизЛиц");
	Попытка
		ВыполнитьКомандаЗаполнитьСписокФизЛиц();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаЗаполнитьСписокФизЛиц()
	
		ЗаполнитьСписокФизЛицНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьСписокФизЛиц(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПроверитьСписокФизЛиц");
	Попытка
		ВыполнитьКомандаПроверитьСписокФизЛиц();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаПроверитьСписокФизЛиц()
	
		Путь = ЭтаФорма.ПутьККаталогу + ?(Прав(ЭтаФорма.ПутьККаталогу, 1) = "\", "", "\");
		Файл = Новый Файл(Путь + "list_of_expired_passports.csv");
	
		Если Не Файл.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден файл списка недействительных паспортов",, "ПутьККаталогу");
			Возврат;
		КонецЕсли; 
	
		Состояние("Выполняется поиск по списку недействительных паспортов...");
	
		УдалитьФайлы(ЭтаФорма.ПутьККаталогу, "РезультатПроверки?.txt");
	
		СтрокаПоискаПолная = ПолучитьСтрокуПоиска();
	
		МассивДляПоиска = СтрРазделить(СтрокаПоискаПолная, " ");
		НомерПроверки = 0;
		СтрокаПоиска = "";
	
		Для Индекс = 0 По МассивДляПоиска.Количество()-1 Цикл

			СерияНомер = МассивДляПоиска[Индекс];
			СтрокаПоиска = СтрокаПоиска + " " + СерияНомер;

			Если (Индекс > 0 И Индекс%300 = 0) 
				Или Индекс = МассивДляПоиска.Количество()-1 Тогда
			
				НомерПроверки = НомерПроверки + 1;
			
				СтрокаПоиска = Сред(СтрокаПоиска, 2);		
				СтрокаКоманды = "findstr /B /L """ + СтрокаПоиска + """ """ + Путь + "list_of_expired_passports.csv"" > """ + Путь + "РезультатПроверки" + НомерПроверки + ".txt""";
				КомандаСистемы(СтрокаКоманды);
			
				СтрокаПоиска = "";

			КонецЕсли;

		КонецЦикла;
	
		МассивНедействительных = Новый Массив;
		Для НомерФайла = 1 По НомерПроверки Цикл

		 	Текст = Новый ЧтениеТекста(Путь + "РезультатПроверки" + НомерФайла + ".txt");
			Стр = Текст.ПрочитатьСтроку();
			Пока Стр <> Неопределено Цикл
			    МассивНедействительных.Добавить(Стр);
			    Стр = Текст.ПрочитатьСтроку();
			КонецЦикла;

		КонецЦикла; 
	
		Для каждого СтрокаФизЛица Из ЭтаФорма.ФизЛица Цикл
			СтрокаФизЛица.ПаспортДействителен = МассивНедействительных.Найти(СтрокаФизЛица.СерияНомер) = Неопределено;
			СтрокаФизЛица.ПроверкаВыполнена = Истина;
		КонецЦикла;
	
		Состояние("Поиск завершен");
	
		Недействительные = ЭтаФорма.ФизЛица.НайтиСтроки(Новый Структура("ПаспортДействителен", Ложь));
		Если Недействительные.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недействительных паспортов не обнаружено");
			ЭтаФорма.РежимОтбора = 2;
		Иначе
			ЭтаФорма.РежимОтбора = 0;
		КонецЕсли; 
		УстановитьОтборСпискаФизЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьДействительные(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСкрытьДействительные");
	Попытка
		ВыполнитьКомандаСкрытьДействительные();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаСкрытьДействительные()
	
		Элементы.ФизЛицаКомандаСкрытьДействительные.Пометка = Не Элементы.ФизЛицаКомандаСкрытьДействительные.Пометка;
		УстановитьОтборСпискаФизЛиц();
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ОбновитьСведенияОФайлах()

	Путь = ЭтаФорма.ПутьККаталогу + ?(Прав(ЭтаФорма.ПутьККаталогу, 1) = "\", "", "\");
	
	ОбновитьСведенияОФайле(Путь + "list_of_expired_passports.csv.bz2", "Архив", "СведенияОбАрхиве", "АрхивУстарел");
	ОбновитьСведенияОФайле(Путь + "list_of_expired_passports.csv", "Файл списка", "СведенияОФайлеСписка", "ФайлСпискаУстарел");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияОФайле(ПутьКФайлу, ПредствалениеФайла, ИмяРеквизитаСведения, ИмяРеквизитаУстарел) 

	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда
		ВремяИзменения = Файл.ПолучитьВремяИзменения();
		ЭтаФорма[ИмяРеквизитаСведения] = ПредствалениеФайла + " скачан " + Формат(ВремяИзменения, "ДЛФ=DD");
		ЭтаФорма[ИмяРеквизитаУстарел] = ((НачалоДня(ТекущаяДата()) - НачалоДня(ВремяИзменения)) / 3600 / 24 >= 7);
	Иначе
		ЭтаФорма[ИмяРеквизитаСведения] = ПредствалениеФайла + " не найден";
		ЭтаФорма[ИмяРеквизитаУстарел] = Истина;
	КонецЕсли;	

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокФизЛицНаСервере(СтрокаФизЛицо = Неопределено)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если СтрокаФизЛицо = Неопределено Тогда
		//РегистрыСведений.ЖурналСверкиСоСписками.ЗаполнитьТаблицуФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Объект.Период, Объект.Организация);
		ЗаполнитьТаблицуФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Объект.Период, Объект.Организация);
	Иначе
		ТекСтрока = ЭтаФорма.ФизЛица.НайтиПоИдентификатору(СтрокаФизЛицо);
		Запрос.УстановитьПараметр("ФизЛицо", ТекСтрока.ФизЛицо);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&ФизЛицо КАК ФизЛицо
			|ПОМЕСТИТЬ _ФизическиеЛица";
		Запрос.Выполнить();
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Период", 		Объект.Период);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ФизическиеЛица.ФизЛицо КАК ФизЛицо,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности, """") + "","" + ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности, """") КАК СерияНомер,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности, """") КАК Серия,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности, """") КАК Номер,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя, """") КАК Имя,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия, """") КАК Фамилия,
		|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, """") КАК Отчество,
		|	ЛОЖЬ КАК ПаспортДействителен,
		|	ЛОЖЬ КАК ПроверкаВыполнена
		|ИЗ
		|	_ФизическиеЛица КАК _ФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО _ФизическиеЛица.ФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|			И (РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности В (ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортСССР)))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фамилия,
		|	Имя,
		|	Отчество,
		|	СерияНомер";

	Если СтрокаФизЛицо = Неопределено Тогда
	
		ТаблицаФизЛиц = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаТаблицаФизЛиц Из ТаблицаФизЛиц Цикл
			СтрокаТаблицаФизЛиц.СерияНомер = СтрЗаменить(СтрокаТаблицаФизЛиц.СерияНомер, " ", "");
		КонецЦикла; 
		
		ЗначениеВРеквизитФормы(ТаблицаФизЛиц, "ФизЛица");
		
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ТекСтрока, Выборка);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьДвоичныеДанные7zip(АдресВоВременномХранилище)

	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные = ОбработкаНаСервере.ПолучитьМакет("zip");
	ПоместитьВоВременноеХранилище(ДвоичныеДанные, АдресВоВременномХранилище);

КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуПоиска()

	МассивСерияНомер = ЭтаФорма.ФизЛица.Выгрузить(, "СерияНомер").ВыгрузитьКолонку(0);
	Возврат СтрСоединить(МассивСерияНомер, " ");
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборСпискаФизЛиц()

	СтруктураОтбора = Новый Структура;
	
	Если ЭтаФорма.РежимОтбора = 0 Тогда
		СтруктураОтбора.Вставить("ПаспортДействителен", Ложь);
	ИначеЕсли ЭтаФорма.РежимОтбора = 1 Тогда
		СтруктураОтбора.Вставить("ПаспортДействителен", Истина);
	Иначе
		Элементы.ФизЛица.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли; 
	
	Элементы.ФизЛица.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);

КонецПроцедуры

Процедура ЗаполнитьТаблицуФизическихЛиц(МенеджерВременныхТаблиц, Период, Организация, ФизЛицо = Неопределено) Экспорт

	Если МенеджерВременныхТаблиц.Таблицы.Найти("_ФизическиеЛица") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период", 		ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ФизЛицо", 		ФизЛицо);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентыДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|			И (ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &Период)
		|	И (&ФизЛицо = НЕОПРЕДЕЛЕНО
		|			ИЛИ КлиентыДоверительногоУправленияСрезПоследних.Клиент В (&ФизЛицо))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И (&ФизЛицо = НЕОПРЕДЕЛЕНО
		|					ИЛИ Пайщик В (&ФизЛицо))) КАК ДолиПайщиковВИнвестиционномФондеОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик = ЮрФизЛица.Ссылка
		|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|			И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения >= &Период)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаПайщика.Пайщик
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО ЗаявкаПайщика.Пайщик = ЮрФизЛица.Ссылка
		|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ЗаявкаПайщика.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|			И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения > &Период)
		|ГДЕ
		|	ЗаявкаПайщика.Многократная
		|	И ЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление)
		|	И ЗаявкаПайщика.Организация = &Организация
		|	И (&ФизЛицо = НЕОПРЕДЕЛЕНО
		|			ИЛИ ЗаявкаПайщика.Пайщик В (&ФизЛицо))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЮрФизЛица.Ссылка
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица
		|ГДЕ
		|	НЕ &ФизЛицо = НЕОПРЕДЕЛЕНО
		|	И ЮрФизЛица.Ссылка В(&ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ _ФизическиеЛица
		|ИЗ
		|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаЮридическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели
		|			ПО РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка
		|		ПО _КлиентыДоверительногоУправления.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо
		|ИЗ
		|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаФизическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаФизическогоЛицаПредставителиВыгодоприобретатели
		|			ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо
		|		ПО _КлиентыДоверительногоУправления.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_КлиентыДоверительногоУправления.Клиент
		|ИЗ
		|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ПО _КлиентыДоверительногоУправления.Клиент = ЮрФизЛица.Ссылка
		|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КлиентыДоверительногоУправления";
	
	Запрос.Выполнить();

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСведенияОФайлах(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновитьСведенияОФайлах");
	Попытка
		ВыполнитьКомандаОбновитьСведенияОФайлах();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаОбновитьСведенияОФайлах()
	
		ОбновитьСведенияОФайлах();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры


 


#КонецОбласти
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
