
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

	// начальное заполнение формы
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ШаблонКИД = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ШаблонКИД");
	
	Объект.ДатаКлючевогоИнформационногоДокумента = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
	ОбновитьДатуРезультатовИнвестированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьАктуальностиИнфляции();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаСервере
Процедура ДобавитьДанныеДляРасчетаДоходностиПИФИОтклоненияОтИнфляцииВЗапрос(Запрос, Дата, Отказ) Экспорт
	
	// Процедура используется во внешней обработке _КлючевойИнформационныйДокумент и внешнем отчете _РасчетДоходностиПИФиОтклоненияОтИнфляции
	
	// Запрос помещает в менеджер временных таблиц:
	//	1. Данные по стоимости пая, СЧА и РСА ПИФ:
	//		- на дату, переданную в параметре Дата
	//		- на конец предыдущих 6 календарных лет (по рабочим датам) от этой даты; при этом, если дата окончания формирования ПИФ не ранее 5го года,
	//        то на последний рабочий день месяца даты окончания формирования ПИФ (строка предыдущего года заменяется на эту).
	//	 	- на конец предыдущих 1, 3, 6, 12, 36, 60 месяцев (по рабочим дням) от этой даты
	//
	//	2. Данные по месячной инфляции (ИПЦкКонцуПредыдущегоМесяца) за месяц даты из параметра, а также за 60 предыдущих месяцев
	// 	   При этом, если данные по инфляции за месяц даты из параметра отсутствуют, для этого месяца используются данные за предыдущий месяц
	//
	//  3. Данные по доходам к выплате пайщикам за периоды из п. 1
	
	Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В запросе, переданном в ДобавитьДанныеДляРасчетаДоходностиПИФИОтклоненияОтИнфляцииВЗапрос, не определен менеджер временных таблиц",,,, Отказ);
		Возврат;
	КонецЕсли;
			
	Запрос.УстановитьПараметр("ДатаРезультатовИнвестирования", 	Дата);
	Запрос.УстановитьПараметр("ТекущаяДата", 	ТекущаяДата());
	
	#Область Текст_запроса
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ДатаОкончанияФормированияПИФ.Значение КАК ДАТА) КАК Дата,
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ДатаОкончанияФормированияПИФ.Значение КАК ДАТА), ГОД, -1), ГОД) КАК Год
		|ПОМЕСТИТЬ _ДатаОкончанияФормированияПИФ
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ДатаОкончанияФормированияПИФ
		|ГДЕ
		|	ДатаОкончанияФормированияПИФ.Объект В
		|			(ВЫБРАТЬ
		|				_КлиентДоверительногоУправления.Клиент
		|			ИЗ
		|				_КлиентДоверительногоУправления)
		|	И ДатаОкончанияФормированияПИФ.Свойство.Ключ = ""ДатаОкончанияФормированияПИФ""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДатаРезультатовИнвестирования"" КАК ВидИнтервала,
		|	&ДатаРезультатовИнвестирования КАК Дата,
		|	&ДатаРезультатовИнвестирования КАК ДатаСЧА
		|ПОМЕСТИТЬ _ДатыСведений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Месяцы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -1), МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Месяцы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -3), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -3), МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Месяцы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -6), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -6), МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Месяцы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -12), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -12), МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Месяцы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -36), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -36), МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Месяцы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -60), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -60), МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Годы"",
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(_ДатаОкончанияФормированияПИФ.Дата, ГОД, -1), ГОД),
		|	МАКСИМУМ(_ДатаОкончанияФормированияПИФ.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатаОкончанияФормированияПИФ КАК _ДатаОкончанияФормированияПИФ
		|		ПО ДанныеКалендаря.Дата = _ДатаОкончанияФормированияПИФ.Дата
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -5), ГОД) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -1), ГОД)
		|
		|СГРУППИРОВАТЬ ПО
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(_ДатаОкончанияФормированияПИФ.Дата, ГОД, -1), ГОД)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Годы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -1), ГОД) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -1), ГОД)
		|
		|ИМЕЮЩИЕ
		|	НЕ КОНЕЦПЕРИОДА(МАКСИМУМ(ДанныеКалендаря.Дата), ГОД) В
		|			(ВЫБРАТЬ
		|				_ДатаОкончанияФормированияПИФ.Год
		|			ИЗ
		|				_ДатаОкончанияФормированияПИФ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Годы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -2), ГОД) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -2), ГОД)
		|
		|ИМЕЮЩИЕ
		|	НЕ КОНЕЦПЕРИОДА(МАКСИМУМ(ДанныеКалендаря.Дата), ГОД) В
		|			(ВЫБРАТЬ
		|				_ДатаОкончанияФормированияПИФ.Год
		|			ИЗ
		|				_ДатаОкончанияФормированияПИФ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Годы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -3), ГОД) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -3), ГОД)
		|
		|ИМЕЮЩИЕ
		|	НЕ КОНЕЦПЕРИОДА(МАКСИМУМ(ДанныеКалендаря.Дата), ГОД) В
		|			(ВЫБРАТЬ
		|				_ДатаОкончанияФормированияПИФ.Год
		|			ИЗ
		|				_ДатаОкончанияФормированияПИФ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Годы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -4), ГОД) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -4), ГОД)
		|
		|ИМЕЮЩИЕ
		|	НЕ КОНЕЦПЕРИОДА(МАКСИМУМ(ДанныеКалендаря.Дата), ГОД) В
		|			(ВЫБРАТЬ
		|				_ДатаОкончанияФормированияПИФ.Год
		|			ИЗ
		|				_ДатаОкончанияФормированияПИФ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Годы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -5), ГОД) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -5), ГОД)
		|
		|ИМЕЮЩИЕ
		|	НЕ КОНЕЦПЕРИОДА(МАКСИМУМ(ДанныеКалендаря.Дата), ГОД) В
		|			(ВЫБРАТЬ
		|				_ДатаОкончанияФормированияПИФ.Год
		|			ИЗ
		|				_ДатаОкончанияФормированияПИФ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Годы"",
		|	МАКСИМУМ(ДанныеКалендаря.Дата),
		|	МАКСИМУМ(ДанныеКалендаря.Дата)
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -6), ГОД) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, ГОД, -6), ГОД)
		|
		|ИМЕЮЩИЕ
		|	НЕ КОНЕЦПЕРИОДА(МАКСИМУМ(ДанныеКалендаря.Дата), ГОД) В
		|			(ВЫБРАТЬ
		|				_ДатаОкончанияФормированияПИФ.Год
		|			ИЗ
		|				_ДатаОкончанияФормированияПИФ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентДоверительногоУправления.СчетДоверительногоУправления КАК СчетДУ,
		|	_ДатыСведений.Дата КАК Дата,
		|	_ДатыСведений.ВидИнтервала КАК ВидИнтервала,
		|	СЧА.Значение КАК СЧА,
		|	РСА.Значение КАК РСА,
		|	СтоимостьПая.Значение КАК СтоимостьПая
		|ПОМЕСТИТЬ _СтоимостьПаяИСЧА
		|ИЗ
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыСведений КАК _ДатыСведений
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧА
		|		ПО (СЧА.Организация = &Организация)
		|			И (СЧА.СубъектАналитики = _КлиентДоверительногоУправления.СчетДоверительногоУправления)
		|			И (СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (СЧА.Период = _ДатыСведений.ДатаСЧА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК РСА
		|		ПО (РСА.Организация = &Организация)
		|			И (РСА.СубъектАналитики = _КлиентДоверительногоУправления.СчетДоверительногоУправления)
		|			И (РСА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов))
		|			И (РСА.Период = _ДатыСведений.ДатаСЧА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СтоимостьПая
		|		ПО (СтоимостьПая.Организация = &Организация)
		|			И (СтоимостьПая.СубъектАналитики = _КлиентДоверительногоУправления.СчетДоверительногоУправления)
		|			И (СтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
		|			И (СтоимостьПая.Период = _ДатыСведений.ДатаСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК Дата,
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ _ДатыИнфляции
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -60), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -1), МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПроцентныеПоказателиСрезПоследних.ДатаЗначения КАК ДатаЗначения,
		|	ПроцентныеПоказателиСрезПоследних.ЗначениеПоказателя / 100 КАК Значение,
		|	ПроцентныеПоказателиСрезПоследних.ЗначениеПоказателя КАК ИПЦ
		|ПОМЕСТИТЬ _Инфляция
		|ИЗ
		|	РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|			&ТекущаяДата,
		|			Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.ИПЦкКонцуПредыдущегоМесяца)
		|				И ДатаЗначения В
		|					(ВЫБРАТЬ
		|						_ДатыИнфляции.Дата
		|					ИЗ
		|						_ДатыИнфляции)
		|				И Прогноз = ЛОЖЬ
		|				И Источник = &ЮрФизЛицо_Росстат) КАК ПроцентныеПоказателиСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&ДатаРезультатовИнвестирования, МЕСЯЦ), ДЕНЬ),
		|	ЕСТЬNULL(ПроцентныеПоказателиТекущегоМесяца.ЗначениеПоказателя, ПроцентныеПоказателиПрошлогоМесяца.ЗначениеПоказателя) / 100,
		|	ЕСТЬNULL(ПроцентныеПоказателиТекущегоМесяца.ЗначениеПоказателя, ПроцентныеПоказателиПрошлогоМесяца.ЗначениеПоказателя)
		|ИЗ
		|	РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|			&ТекущаяДата,
		|			Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.ИПЦкКонцуПредыдущегоМесяца)
		|				И ДатаЗначения = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&ДатаРезультатовИнвестирования, МЕСЯЦ), ДЕНЬ)
		|				И Прогноз = ЛОЖЬ
		|				И Источник = &ЮрФизЛицо_Росстат) КАК ПроцентныеПоказателиТекущегоМесяца
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|				&ТекущаяДата,
		|				Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.ИПЦкКонцуПредыдущегоМесяца)
		|					И ДатаЗначения = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаРезультатовИнвестирования, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ)
		|					И Прогноз = ЛОЖЬ
		|					И Источник = &ЮрФизЛицо_Росстат) КАК ПроцентныеПоказателиПрошлогоМесяца
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатаОкончанияФормированияПИФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыИнфляции";
	
	#КонецОбласти
	
	Запрос.Выполнить();
	
	#Область Доход_по_паям
	
	ДатыСведений = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДатыСведений"].ПолучитьДанные().Выгрузить();
	
	// Добавляем в отдельные временные таблицы обороты по доходам пайщиков в расчете на пай за период для каждой строки	
	НомерСтроки = 1;
	Запрос.Текст = "";
	Для Каждого СтрокаСведений Из ДатыСведений Цикл
		
		//Строку вида "ДатаРезультатовИнвестирования" пропускаем
		Если СтрокаСведений.ВидИнтервала = "ДатаРезультатовИнвестирования" Тогда
			Продолжить;
		КонецЕсли;
				
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&ВидИнтервала КАК ВидИнтервала,
			|	&НачалоПериода КАК НачалоПериода,			
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход / ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток
			|	КОНЕЦ КАК Сумма
			|ПОМЕСТИТЬ _ДоходПоПаям
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1),
			|			&КонецПериода,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_КлиентДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_КлиентДоверительногоУправления)
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям)) КАК ЗадолженностиПоДенежнымСредствамОбороты,
			|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И ПаевойИнвестиционныйФонд В
			|					(ВЫБРАТЬ
			|						_КлиентДоверительногоУправления.Клиент
			|					ИЗ
			|						_КлиентДоверительногоУправления)) КАК ДолиПайщиковВИнвестиционномФондеОстатки";
		
		Если Не ПустаяСтрока(Запрос.Текст) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ _ДоходПоПаям", ""); 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ");
			
			Запрос.Текст = Запрос.Текст + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";
					
		КонецЕсли;	
		
		СтрНомер = Формат(НомерСтроки, "ЧГ=0");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,	"&НачалоПериода",	"&НачалоПериода" + СтрНомер);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,	"&КонецПериода",	"&КонецПериода" + СтрНомер);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,	"&ВидИнтервала",	"&ВидИнтервала" + СтрНомер);
		
		Запрос.Текст = Запрос.Текст + ТекстЗапроса;
		
		Запрос.УстановитьПараметр("ВидИнтервала" + СтрНомер,	СтрокаСведений.ВидИнтервала);
		Запрос.УстановитьПараметр("НачалоПериода" + СтрНомер,	СтрокаСведений.ДатаСЧА);
		Запрос.УстановитьПараметр("КонецПериода"+ СтрНомер,		КонецГода(СтрокаСведений.ДатаСЧА + 864000));
		Дат = СтрокаСведений.Дата;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Запрос.Выполнить();
	
	Запрос.Текст = "УНИЧТОЖИТЬ _ДатыСведений"; 
	
	Запрос.Выполнить();
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОчиститьДанные();
	Если Не (ЗначениеЗаполнено(Объект.ПаевойИнвестиционныйФонд) И Объект.ДатаКлючевогоИнформационногоДокумента <> '00010101') Тогда		
		Возврат;
	КонецЕсли;
	
	ДанныеДляЗаполнения = Неопределено;
	ТаблицаРисков.Очистить();
		
	Отказ = Ложь;
	ПолучитьСтруктуруДанныхНаСервере(Отказ);
	
	Если ДанныеДляЗаполнения = Неопределено Или Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные для заполнения документа");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.Реквизиты);
	
	НомерЛицензииУК = НомерЛицензииУК + " от " + ДанныеДляЗаполнения.Реквизиты.ДатаВыдачиЛицензииУК;
	
	Для Сч = 1 По 5 Цикл
				
		СтруктураЗначений = "";
		Если ДанныеДляЗаполнения.ИнвестиционныеРиски.Свойство("Строка"+СокрЛП(Сч), СтруктураЗначений) Тогда
			НоваяСтрока = ТаблицаРисков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗначений);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
			
	Отказ = Ложь;
				
	Если ДанныеДляЗаполнения = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала необходимо нажать 'Обновить'");
		Возврат;
	КонецЕсли;
	
	СессияСбораСтатистики 	= "";
	ПолноеИмяОтчета 		= "";
	
	ЗарегистрироватьНачалоСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики);
	
	ПолучитьСтруктуруДанныхНаСервере(Отказ, Истина);
	
	ИмяФайлаШаблонаКИД = ПолучитьИмяВременногоФайла("docx");
	ШаблонКИД.Записать(ИмяФайлаШаблонаКИД);
		
	Отказ = Ложь;
	
	Попытка
		
		// создадим документ MS Word на основании сохраненного шаблона
		WordApp = Новый COMОбъект("Word.Application");
					
		Реквизиты = ДанныеДляЗаполнения.Реквизиты;
		
		NewDoc = WordApp.Application.Documents.Add(ИмяФайлаШаблонаКИД, False, , Истина);
		
		WordVars = NewDoc.Variables;
		Для Каждого Реквизит Из Реквизиты Цикл
			WordVars.Item(Реквизит.Ключ).Value = Реквизит.Значение;
		КонецЦикла;
		
		// Выводим таблицу рисков
		ИнвестиционныеРиски = ДанныеДляЗаполнения.ИнвестиционныеРиски;
						
		Content = NewDoc.Content;
		
		НомерДобавляемойСтроки = 3;
		Для Каждого ТекСтрокаРисков Из ИнвестиционныеРиски Цикл
			
			Если ТекСтрокаРисков.Ключ = "Строка1" Тогда
				
				// Строка есть в шаблоне, только заполняем текст
				Content.Tables(2).Cell(2,1).Range.Text = СокрЛП(ТекСтрокаРисков.Значение.ВидРиска);
				Content.Tables(2).Cell(2,2).Range.Text = СокрЛП(ТекСтрокаРисков.Значение.ВероятностьРеализации);
				Content.Tables(2).Cell(2,3).Range.Text = СокрЛП(ТекСтрокаРисков.Значение.ОбъемПотерь);
				
			Иначе
				
				// добавляем строку в конец таблицы
				Content.Tables(2).Rows.Add();        
				Content.Tables(2).Cell(НомерДобавляемойСтроки,1).Range.Text = СокрЛП(ТекСтрокаРисков.Значение.ВидРиска);
				Content.Tables(2).Cell(НомерДобавляемойСтроки,2).Range.Text = СокрЛП(ТекСтрокаРисков.Значение.ВероятностьРеализации);
				Content.Tables(2).Cell(НомерДобавляемойСтроки,3).Range.Text = СокрЛП(ТекСтрокаРисков.Значение.ОбъемПотерь);
				
				НомерДобавляемойСтроки = НомерДобавляемойСтроки + 1;
			
			КонецЕсли;
			
		КонецЦикла;
					
		NewDoc.Bookmarks("КартинкаДиаграммы").Range.Select();
		Selection = WordApp.Application.Selection;
		
		ЕстьВтораяСноска = Ложь;
		ЕстьТретьяСноска = Ложь;
		Если ДанныеДляЗаполнения.ВыводитьДиаграмму Тогда		
			ИмяФайлаКартинки = ПолучитьИмяВременногоФайла(".bmp");
			ПолучитьИзВременногоХранилища(ДанныеДляЗаполнения.АдресКартинкиВХранилище).Записать(ИмяФайлаКартинки);
			Picture = Selection.InlineShapes.AddPicture(ИмяФайлаКартинки, Ложь, Истина);
			Если ДанныеДляЗаполнения.ДобавитьСноскуПодДиаграммой Тогда
				Если ДанныеДляЗаполнения.ПериодПриостановкиПИФ <> Неопределено Тогда
					
					// 2022 год присутствует в диаграмме в течение 5 лет
					Если Объект.ДатаКлючевогоИнформационногоДокумента >= '20230131' И Объект.ДатаКлючевогоИнформационногоДокумента < '20280101' Тогда							
						Selection.TypeText(Символы.ПС + "* Доходность за 2022 год отражает результат за период с 01.01.2022 г. по 28.02.2022 г. по причине временного приостановления выдачи и погашения инвестиционных паёв Фонда и в связи с тем, что в результате этого стоимость активов Фонда не рассчитывалась за период с 01.03.2022 г. по 31.12.2022 г." + Символы.ВК);
						ЕстьВтораяСноска = Истина;
					КонецЕсли;					
					
					// 2023 год присутствует в диаграмме в течение 5 лет
					Если Объект.ДатаКлючевогоИнформационногоДокумента >= '20240131' И Объект.ДатаКлючевогоИнформационногоДокумента < '20290101' Тогда							
						Selection.TypeText(Символы.ПС + "** Доходность за 2023 год отражает результат за период с 17.03.2023 г. по 29.12.2023 г. в связи с возобновлением выдачи и погашения инвестиционных паёв Фонда. Стоимость активов Фонда не рассчитывалась в период с 01.01.2023 г. по 16.03.2023 г." + Символы.ВК);
						ЕстьТретьяСноска = Истина;
					КонецЕсли;
					
				Иначе
					Selection.TypeText(Символы.ПС + "(*) Доходность за " + Формат(ДанныеДляЗаполнения.ДатаФормированияПИФ, "ДФ=yyyy") + " г. за период с " + Формат(ДанныеДляЗаполнения.ДатаФормированияПИФ, "ДФ=dd.MM.yyyy") + " г. по " + Формат(КонецГода(ДанныеДляЗаполнения.ДатаФормированияПИФ), "ДФ=dd.MM.yyyy") + " г.");
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Selection.TypeText("Доходность за календарный год не указывается, с даты формирования Фонда прошло менее года.");
		КонецЕсли; 
		
		Если ДанныеПоИнфляцииНеАктуальны Тогда
			NewDoc.Bookmarks("ШрифтОтклоненияОтИнфляции").Range.Select();
			Selection = WordApp.Application.Selection;
			Selection.Font.ColorIndex = 6;
		КонецЕсли;
		
		Если Реквизиты.Звездочка = "*" Тогда
			
			NewDoc.Bookmarks("Разрыв2").Range.Select();
			Selection = WordApp.Application.Selection;
			Selection.InsertBreak(6);
			
			Если Не (ЕстьВтораяСноска Или ЕстьТретьяСноска) Тогда
				Selection.InsertBreak(6);
			КонецЕсли;
			
			NewDoc.Bookmarks("Разрыв4").Range.Select();
			Selection = WordApp.Application.Selection;
			Selection.InsertBreak(6);
			
		Иначе
			
			NewDoc.Bookmarks("Разрыв5").Range.Select();
			Selection = WordApp.Application.Selection;
			Selection.InsertBreak(6);

			NewDoc.Bookmarks("Разрыв1").Range.Select();
			Selection = WordApp.Application.Selection;
			Selection.InsertBreak(7);
			
			NewDoc.Bookmarks("Разрыв2").Range.Select();
			Selection = WordApp.Application.Selection;
			Selection.InsertBreak(6);
			
			Если Не (ЕстьВтораяСноска Или ЕстьТретьяСноска) Тогда
				Selection.InsertBreak(6);
			КонецЕсли;
			
			Если Не ЕстьТретьяСноска Тогда
				NewDoc.Bookmarks("Разрыв3").Range.Select();
				Selection = WordApp.Application.Selection;
				Selection.InsertBreak(7);
			КонецЕсли; 
			
		КонецЕсли;
			
		NewDoc.Fields.Update();
		
		WordApp.Application.Visible = Истина;
		
		ОбработкаПрерыванияПользователя();
				
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);	
	КонецПопытки;
	
	// удалим файл шаблона
	Попытка
		УдалитьФайлы(ИмяФайлаШаблонаКИД);
		УдалитьФайлы(ИмяФайлаКартинки);
	Исключение
	КонецПопытки;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Печать документа завершилась с ошибкой");
	Иначе
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		WordApp.Application.Activate();
	КонецЕсли;  
	
	ЗарегистрироватьОкончаниеСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики);
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ДатаКлючевогоИнформационногоДокументаПриИзменении(Элемент)
		
	ОбновитьДатуРезультатовИнвестированияНаСервере();
	
	ОбновитьВидимостьАктуальностиИнфляции();
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ОчиститьДанные()
	
	ДанныеДляЗаполнения = Неопределено;
	
	ТаблицаРисков.Очистить();
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ВебСтраницаПИФ");
	МассивРеквизитов.Добавить("ВебСтраницаСД");
	МассивРеквизитов.Добавить("ВебСтраницаУК");
	МассивРеквизитов.Добавить("МинимальнаяСуммаЗачисления");
	МассивРеквизитов.Добавить("ПолноеНаименованиеПИФ");
	МассивРеквизитов.Добавить("ПолноеНаименованиеСД");
	МассивРеквизитов.Добавить("ПолноеНаименованиеУК");
	МассивРеквизитов.Добавить("ПроцентВознагражденияСД");
	МассивРеквизитов.Добавить("ПроцентВознагражденияПрочие");
	МассивРеквизитов.Добавить("ПроцентВознагражденияУК");
	МассивРеквизитов.Добавить("СтоимостьПая");
	МассивРеквизитов.Добавить("СЧА");
	МассивРеквизитов.Добавить("ТелефонУК");
	МассивРеквизитов.Добавить("ФактическийАдресУК");
	МассивРеквизитов.Добавить("ЮридическийАдресУК");
	МассивРеквизитов.Добавить("НомерЛицензииУК");
		
	Для Каждого ТекЭлемент Из МассивРеквизитов Цикл
		ЭтаФорма[ТекЭлемент] = "";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ПаевойИнвестиционныйФонд = "";
	ОчиститьДанные();
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьАктуальностиИнфляции()
	
	Этаформа.Элементы.ДекорацияАктуальность.Видимость		= ДанныеПоИнфляцииНеАктуальны;
	ЭтаФорма.Элементы.КомандаЗагрузитьДанныеИПЦ.Видимость	= ДанныеПоИнфляцииНеАктуальны;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуРезультатовИнвестированияНаСервере()
	
	Если Объект.ДатаКлючевогоИнформационногоДокумента = '00010101' Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, является ли дата КИД последним рабочим днем месяца
	Если Объект.ДатаКлючевогоИнформационногоДокумента = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, КонецМесяца(Объект.ДатаКлючевогоИнформационногоДокумента)) Тогда
		Объект.ДатаРезультатовИнвестирования = Объект.ДатаКлючевогоИнформационногоДокумента;
	Иначе
		Объект.ДатаРезультатовИнвестирования = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, КонецМесяца(ДобавитьМесяц(Объект.ДатаКлючевогоИнформационногоДокумента, -1)));
	КонецЕсли;
	
	ОбновитьАктуальностьИнфляцииНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАктуальностьИнфляцииНаСервере()
	
	ЗначениеИнфляции = РегистрыСведений.ПроцентныеПоказатели.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Показатель,Прогноз,Источник,ДатаЗначения", Перечисления.ВидыПроцентныхПоказателей.ИПЦкКонцуПредыдущегоМесяца, Ложь, ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Росстат"), НачалоДня(КонецМесяца(Объект.ДатаРезультатовИнвестирования)))).ЗначениеПоказателя;	
	ДанныеПоИнфляцииНеАктуальны = ЗначениеИнфляции = 0;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСтоимостьАктивовНаДатуВЗапрос(Запрос, Дата, СчетДоверительногоУправления, ВыводитьАктивыКакВПеречнеИмуществаПИФ, Отказ)
	
	Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В запросе, переданном в ДобавитьСтоимостьАктивовНаДатуВЗапрос, не определен менеджер временных таблиц",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.Рынок КАК Рынок,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) КАК СуммаНаКонец,
		|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК СуммаКупонаНаКонец,
		|	СУММА(СтоимостьПереоценки.Количество) КАК КоличествоНаКонец,
		|	СтоимостьПереоценки.Источник КАК Источник,
		|	НастройкиФормированияСЧАСрезПоследних.НКДВСправедливойСтоимостиЦБ КАК НКДВСправедливойСтоимостиЦБ,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки
		|ПОМЕСТИТЬ _СтоимостьПереоценки
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки,
		|	РегистрСведений.НастройкиФормированияСЧА.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиФормированияСЧАСрезПоследних
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.Активность
		|	И СтоимостьПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.Источник,
		|	НастройкиФормированияСЧАСрезПоследних.НКДВСправедливойСтоимостиЦБ,
		|	СтоимостьПереоценки.ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки,
		|	СтоимостьПереоценки.Рынок";
	
	Запрос.Выполнить();

	Если ВыводитьАктивыКакВПеречнеИмуществаПИФ Тогда
		
		Запрос.Текст = 	
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ИмущественныеПрава)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаСНедвижимостью)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ПраваАренды)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.ОбъектыНедвижимости)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
			|			ТОГДА ""- денежные средства в пути""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.Оплата)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Справочник.Договоры)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеКупона)
			|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеКупона).Облигация
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
			|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
			|		КОГДА (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода))
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.РешениеОбИзмененииУставногоКапиталаООО)
			|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВкладуВУставныйКапиталООО)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) В (ТИП(Документ.ПриходПроцентовПоКредитномуИнструменту), ТИП(Документ.ЗакрытиеКредитногоИнструмента))
			|				И ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗайму), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеОсновнойДолг))
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
			|	КОНЕЦ КАК СубъектАналитики,
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
			|				ИЛИ &ОтражатьРЕПОВРазделе <> ""Займы""
			|					И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|			ТОГДА """"
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеОсновнойДолгИПроценты))
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.Займы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты)
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеОсновнойДолгИПроценты))
			|				И &ОтражатьРЕПОВРазделе = ""Займы""
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности
			|	КОНЕЦ КАК ВидЗадолженности,
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
			|			ТОГДА """"
			|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
			|	КОНЕЦ КАК Контрагент,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
			|				ИЛИ ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Основание,
			|	НЕОПРЕДЕЛЕНО КАК Валюта,
			|	СУММА(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета) КАК СуммаНаКонец
			|ПОМЕСТИТЬ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
			|ИЗ
			|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
			|ГДЕ
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
			|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
			|
			|СГРУППИРОВАТЬ ПО
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива,
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ИмущественныеПрава)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаСНедвижимостью)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ПраваАренды)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.ОбъектыНедвижимости)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
			|			ТОГДА ""- денежные средства в пути""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.Оплата)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Справочник.Договоры)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеКупона)
			|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеКупона).Облигация
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
			|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
			|		КОГДА (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода))
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
			|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.РешениеОбИзмененииУставногоКапиталаООО)
			|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВкладуВУставныйКапиталООО)
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) В (ТИП(Документ.ПриходПроцентовПоКредитномуИнструменту), ТИП(Документ.ЗакрытиеКредитногоИнструмента))
			|				И ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗайму), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеОсновнойДолг))
			|			ТОГДА ""- прочая дебиторская задолженность""
			|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
			|				ИЛИ &ОтражатьРЕПОВРазделе <> ""Займы""
			|					И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|			ТОГДА """"
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеОсновнойДолгИПроценты))
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.Займы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты)
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеОсновнойДолгИПроценты))
			|				И &ОтражатьРЕПОВРазделе = ""Займы""
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
			|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
			|			ТОГДА """"
			|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
			|				ИЛИ ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ";
		
	Иначе	
	
		Запрос.Текст = 		
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент КАК Контрагент,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Основание,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
			|	СУММА(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета) КАК СуммаНаКонец
			|ПОМЕСТИТЬ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
			|ИЗ
			|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
			|ГДЕ
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
			|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность
			|
			|СГРУППИРОВАТЬ ПО
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание,
			|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта
			|";
	
	КонецЕсли;

	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.СуммаНаКонец) КАК СуммаНаКонец
		|ПОМЕСТИТЬ _ОбщаяДебиторскаяЗадолженность
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаНаКонец КАК СуммаНаКонец
		|	ИЗ
		|		_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|	ГДЕ
		|		_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|		И ВЫБОР
		|				КОГДА &ОтражатьРЕПОВРазделе = ""Займы""
		|					ТОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_СтоимостьПереоценки.СуммаКупонаНаКонец
		|	ИЗ
		|		_СтоимостьПереоценки КАК _СтоимостьПереоценки
		|	ГДЕ
		|		НЕ _СтоимостьПереоценки.НКДВСправедливойСтоимостиЦБ) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.СуммаНаКонец) КАК СуммаНаКонец
		|ПОМЕСТИТЬ _ОбщаяСтоимостьАктивов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаНаКонец КАК СуммаНаКонец
		|	ИЗ
		|		_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|	ГДЕ
		|		_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_СтоимостьПереоценки.СуммаНаКонец + _СтоимостьПереоценки.СуммаКупонаНаКонец
		|	ИЗ
		|		_СтоимостьПереоценки КАК _СтоимостьПереоценки) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_СтоимостьПереоценки.СуммаНаКонец + ВЫБОР
		|			КОГДА _СтоимостьПереоценки.НКДВСправедливойСтоимостиЦБ
		|				ТОГДА _СтоимостьПереоценки.СуммаКупонаНаКонец
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНаКонец
		|ПОМЕСТИТЬ _СтоимостьПереоценки_Итоговая
		|ИЗ
		|	_СтоимостьПереоценки КАК _СтоимостьПереоценки
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтоимостьПереоценки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_СтоимостьПереоценки.СуммаКупонаНаКонец) КАК СуммаКупонаНаКонец
		|ПОМЕСТИТЬ _СтоимостьКупона
		|ИЗ
		|	_СтоимостьПереоценки КАК _СтоимостьПереоценки,
		|	_ОбщаяДебиторскаяЗадолженность КАК _ОбщаяДебиторскаяЗадолженность
		|ГДЕ
		|	НЕ _СтоимостьПереоценки.НКДВСправедливойСтоимостиЦБ
		|	И ВЫБОР
		|			КОГДА НЕ &ВыводитьАктивыКакВПеречнеИмуществаПИФ
		|				ТОГДА _СтоимостьПереоценки.СуммаКупонаНаКонец / _ОбщаяДебиторскаяЗадолженность.СуммаНаКонец * 100 > 1
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И _СтоимостьПереоценки.СуммаКупонаНаКонец <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтоимостьПереоценки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент КАК Контрагент,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Основание,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаНаКонец КАК СуммаНаКонец
		|ПОМЕСТИТЬ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая
		|ИЗ
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам,
		|	_ОбщаяДебиторскаяЗадолженность КАК _ОбщаяДебиторскаяЗадолженность
		|ГДЕ
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И ВЫБОР
		|			КОГДА &ОтражатьРЕПОВРазделе = ""Займы""
		|				ТОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ВыводитьАктивыКакВПеречнеИмуществаПИФ
		|				ТОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаНаКонец / _ОбщаяДебиторскаяЗадолженность.СуммаНаКонец * 100 > 1
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта,
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаНаКонец
		|ИЗ
		|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|			ИЛИ ВЫБОР
		|				КОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|						И &ОтражатьРЕПОВРазделе = ""Займы""
		|					ТОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СтоимостьПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам";
	
	Запрос.Выполнить();
	
КонецПроцедуры
	
&НаСервере
Процедура ПолучитьСтруктуруДанныхНаСервере(Отказ, ТолькоДиаграмма = Ложь)
	
	Если ТолькоДиаграмма Тогда
		СтруктураДанных = ДанныеДляЗаполнения;
	Иначе	
		СтруктураДанных = Новый Структура;	
		СтруктураПолейФайла = Новый Структура;
		СтруктураДанных.Вставить("Реквизиты", СтруктураПолейФайла);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", Объект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("ДатаКИД", Объект.ДатаКлючевогоИнформационногоДокумента);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо"));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	&ЮрФизЛицо КАК ЮрФизЛицоОрганизации,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо КАК СпецДеп
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаКИД, СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &ПаевойИнвестиционныйФонд";
	
	Запрос.Выполнить();
	
	Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КлиентДоверительногоУправления").ПолучитьДанные().Выбрать();
	
	СчетДоверительногоУправления = Неопределено;   	
	
	ВыводитьАктивыКакВПеречнеИмуществаПИФ = Объект.ДатаКлючевогоИнформационногоДокумента >= '20231001';
	
	Если Выборка.Следующий() Тогда		
	                            		
		Запрос.УстановитьПараметр("ОтражатьРЕПОВРазделе", РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьЗначениеНастройки(Объект.ДатаКлючевогоИнформационногоДокумента, Выборка.СчетДоверительногоУправления, "_ОтчетностьЦБ", "ОтражатьРЕПОВРазделе"));
		Запрос.УстановитьПараметр("ДатаРезультатовИнвестирования", Объект.ДатаРезультатовИнвестирования);
		Запрос.УстановитьПараметр("ЮрФизЛицо_Росстат", ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Росстат"));
		Запрос.УстановитьПараметр("ВыводитьАктивыКакВПеречнеИмуществаПИФ", ВыводитьАктивыКакВПеречнеИмуществаПИФ);
		
		СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		ДобавитьСтоимостьАктивовНаДатуВЗапрос(Запрос, Объект.ДатаКлючевогоИнформационногоДокумента, СчетДоверительногоУправления, ВыводитьАктивыКакВПеречнеИмуществаПИФ, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные о ПИФе " + СокрЛП(Объект.ПаевойИнвестиционныйФонд) + " в " + СокрЛП(Объект.Организация),,,, Отказ);		
		Возврат;
	КонецЕсли;
	
	ПериодПриостановкиПИФ = Справочники.ПаевыеИнвестиционныеФонды.ПериодПриостановкиОперацийСПаями(СчетДоверительногоУправления);
	ЭтоПриостановленныйПИФ = БухгалтерскийУчет.ОпределитьНастройкиУчета(Объект.ДатаРезультатовИнвестирования, Объект.Организация, СчетДоверительногоУправления).ПриостановленРасчетСЧА;
	ДобавитьДанныеДляРасчетаДоходностиПИФИОтклоненияОтИнфляцииВЗапрос(Запрос, Объект.ДатаРезультатовИнвестирования, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Область Текст_запроса

	Если ТолькоДиаграмма Тогда
		
		Запрос.УстановитьПараметр("ЕстьПериодПриостановки", ПериодПриостановкиПИФ <> Неопределено);
		
		Запрос.Текст = 
		    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	ДатаОкончанияФормированияПИФ.Значение КАК ДатаФормированияПИФ
		    |ПОМЕСТИТЬ _Реквизиты
		    |ИЗ
		    |	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДатаОкончанияФормированияПИФ
		    |		ПО (ДатаОкончанияФормированияПИФ.Объект = _КлиентДоверительногоУправления.Клиент)
		    |			И (ДатаОкончанияФормированияПИФ.Свойство.Ключ = ""ДатаОкончанияФормированияПИФ"")
		    |;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	ГОД(_НаКонецГода.Дата) КАК ГодЧислом,
		    |	ВЫБОР
		    |		КОГДА &ЕстьПериодПриостановки
		    |				И ГОД(_НаКонецГода.Дата) = 2022
		    |			ТОГДА -35.75
		    |		КОГДА &ЕстьПериодПриостановки
		    |				И ГОД(_НаКонецГода.Дата) = 2023
		    |			ТОГДА 81.28
		    |		КОГДА ЕСТЬNULL(_НаНачалоГода.СтоимостьПая, 0) = 0
		    |				ИЛИ ЕСТЬNULL(_НаКонецГода.СтоимостьПая, 0) = 0
		    |			ТОГДА ""-""
		    |		ИНАЧЕ ВЫРАЗИТЬ((_НаКонецГода.СтоимостьПая - _НаНачалоГода.СтоимостьПая + ЕСТЬNULL(_ДоходПоПаям.Сумма, 0)) / _НаНачалоГода.СтоимостьПая * 100 КАК ЧИСЛО(15, 2))
		    |	КОНЕЦ КАК Доходность
		    |ПОМЕСТИТЬ _ДоходностьДляДиаграммы
		    |ИЗ
		    |	_СтоимостьПаяИСЧА КАК _НаНачалоГода
		    |		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаяИСЧА КАК _НаКонецГода
		    |		ПО _НаНачалоГода.СчетДУ = _НаКонецГода.СчетДУ
		    |			И (_НаКонецГода.ВидИнтервала = ""Годы"")
		    |			И (ГОД(_НаНачалоГода.Дата) + 1 = ГОД(_НаКонецГода.Дата))
		    |		ЛЕВОЕ СОЕДИНЕНИЕ _ДоходПоПаям КАК _ДоходПоПаям
		    |		ПО _НаНачалоГода.ВидИнтервала = _ДоходПоПаям.ВидИнтервала
		    |			И _НаНачалоГода.Дата = _ДоходПоПаям.НачалоПериода
		    |ГДЕ
		    |	_НаНачалоГода.ВидИнтервала = ""Годы""
		    |	И ГОД(_НаКонецГода.Дата) ЕСТЬ НЕ NULL ";

	Иначе	
	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛицАнкетныеУК.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеУК,
			|	&ДатаКИД КАК ДатаДокумента_Дата,
			|	&ДатаРезультатовИнвестирования КАК ДатаРезультатовИнвестирования_Дата,
			|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаВыдачиЛицензииУК_ДатаПрописью,
			|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Номер КАК НомерЛицензииУК,
			|	_КлиентДоверительногоУправления.Клиент.НомерПравил КАК НомерПравилПИФ,
			|	_КлиентДоверительногоУправления.Клиент.ДатаПравил КАК ДатаПравилПИФ_ДатаПрописью,
			|	РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК ПолноеНаименованиеПИФ,
			|	_КлиентДоверительногоУправления.Клиент КАК ПИФ,
			|	_КлиентДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ОрганВыдавшийЛицензию КАК ОрганВыдавшийЛицензиюУК,
			|	РеквизитыЮридическихЛицСД.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеСД,
			|	ДатаОкончанияФормированияПИФ.Значение КАК ДатаОкончанияФормированияПИФ_Дата,
			|	ДатаОкончанияФормированияПИФ.Значение КАК ДатаФормированияПИФ,
			|	ОписаниеИнвестиционнойСтратегии.Значение КАК ОписаниеИнвестиционнойСтратегии,
			|	ВидИнвестиционнойСтратегии.Значение КАК ВидИнвестиционнойСтратегии,
			|	ВидыАктивовДляИнвестирования.Значение КАК ОписаниеАктивовИнвестирования,
			|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.МинимальнаяСуммаЗачисления КАК МинимальнаяСуммаЗачисления_Число,
			|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.НастройкаРасчетаРезервовЗаВознаграждениеУправляющего КАК НастройкаВознагражденияУК,
			|	0 КАК ПроцентВознагражденияУК,
			|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего КАК НастройкаВознагражденияПрочие,
			|	0 КАК ПроцентВознагражденияПрочие,
			|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.НастройкаРасчетаРезервовЗаВознаграждениеДепозитария КАК НастройкаВознагражденияСД,
			|	0 КАК ПроцентВознагражденияСД,
			|	0 КАК ПроцентВознагражденияВсего,
			|	ВебСтраницаСД.Представление КАК ВебСтраницаСД,
			|	РеквизитыЮридическихЛицАнкетныеУК.ВебСтраница КАК ВебСтраницаУК,
			|	РеквизитыЮридическихЛицАнкетныеУК.Телефоны КАК ТелефонУК,
			|	РеквизитыЮридическихЛицАнкетныеУК.ФактическийАдрес КАК ФактическийАдресУК,
			|	РеквизитыЮридическихЛицАнкетныеУК.ЮридическийАдрес КАК ЮридическийАдресУК,
			|	ЕСТЬNULL(ДатаВозникновенияОснованияДляПрекращенияПИФ.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозникнованияОснованияДляПрекращенияПИФ
			|ПОМЕСТИТЬ _Реквизиты
			|ИЗ
			|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(&ДатаКИД, Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)) КАК СтатусыЛицензийОрганизацииСрезПоследних
			|		ПО _КлиентДоверительногоУправления.ЮрФизЛицоОрганизации = СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ЮрФизЛицо
			|			И (СтатусыЛицензийОрганизацииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&ДатаКИД,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСД
			|		ПО _КлиентДоверительногоУправления.СпецДеп = РеквизитыЮридическихЛицСД.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДатаОкончанияФормированияПИФ
			|		ПО (ДатаОкончанияФормированияПИФ.Объект = _КлиентДоверительногоУправления.Клиент)
			|			И (ДатаОкончанияФормированияПИФ.Свойство.Ключ = ""ДатаОкончанияФормированияПИФ"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДатаВозникновенияОснованияДляПрекращенияПИФ
			|		ПО (ДатаВозникновенияОснованияДляПрекращенияПИФ.Объект = _КлиентДоверительногоУправления.Клиент)
			|			И (ДатаВозникновенияОснованияДляПрекращенияПИФ.Свойство.Ключ = ""ДатаВозникновенияОснованияПрекращенияФонда"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ОписаниеИнвестиционнойСтратегии
			|		ПО (ОписаниеИнвестиционнойСтратегии.Объект = _КлиентДоверительногоУправления.Клиент)
			|			И (ОписаниеИнвестиционнойСтратегии.Свойство.Ключ = ""ОписаниеИнвестиционнойСтратегии"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ВидИнвестиционнойСтратегии
			|		ПО (ВидИнвестиционнойСтратегии.Объект = _КлиентДоверительногоУправления.Клиент)
			|			И (ВидИнвестиционнойСтратегии.Свойство.Ключ = ""ВидИнвестиционнойСтратегии"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ВидыАктивовДляИнвестирования
			|		ПО (ВидыАктивовДляИнвестирования.Объект = _КлиентДоверительногоУправления.Клиент)
			|			И (ВидыАктивовДляИнвестирования.Свойство.Ключ = ""ВидыАктивовДляИнвестирования""),
			|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
			|			&ДатаКИД,
			|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ВебСтраница)
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|				И Объект В
			|					(ВЫБРАТЬ
			|						_КлиентДоверительногоУправления.СпецДеп
			|					ИЗ
			|						_КлиентДоверительногоУправления)) КАК ВебСтраницаСД,
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|			&ДатаКИД,
			|			Организация = &Организация
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицАнкетныеУК,
			|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&ДатаКИД, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних,
			|	РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаКИД, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК РеквизитыПИФСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.ВидАктива КАК ВидАктива,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.СделкаРЕПО)
			|					И &ОтражатьРЕПОВРазделе <> ""Займы""
			|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|		ИНАЧЕ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.ВидЗадолженности
			|	КОНЕЦ КАК ВидЗадолженности,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.СделкаРЕПО)
			|					И &ОтражатьРЕПОВРазделе <> ""Займы""
			|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.СубъектАналитики
			|	КОНЕЦ КАК СубъектАналитики,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.СубъектАналитики КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.СделкаРЕПО)
			|				И &ОтражатьРЕПОВРазделе <> ""Займы""
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).Контрагент
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.Сделка).Контрагент
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.СделкаРЕПО)
			|				И &ОтражатьРЕПОВРазделе = ""Займы""
			|			ТОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Контрагент
			|		ИНАЧЕ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Контрагент
			|	КОНЕЦ КАК Контрагент,
			|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Основание,
			|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.СуммаНаКонец КАК СуммаНаКонец,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.СубъектАналитики КАК Справочник.БанковскиеСчета).Валюта.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.СделкаРЕПО)
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).ВалютаСделки.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.Сделка).ВалютаСделки.Наименование
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК Валюта,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.Сделка).МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.Сделка).НомерСделки
			|					ИНАЧЕ ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.Сделка).НомерПорученияУБрокера
			|				КОНЕЦ
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.СделкаРЕПО)
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).НомерСделкиСЦентральнымКонтрагентом
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).НомерСделки
			|					ИНАЧЕ ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).НомерПорученияУБрокера
			|				КОНЕЦ
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК НомерСделки,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.Сделка)
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.Сделка).Дата
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание) = ТИП(Документ.СделкаРЕПО)
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.Основание КАК Документ.СделкаРЕПО).Дата
			|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
			|	КОНЕЦ КАК ДатаСделки
			|ПОМЕСТИТЬ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности
			|ИЗ
			|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая КАК _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая
			|ГДЕ
			|	НЕ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.СубъектАналитики ССЫЛКА Справочник.Займы
			|	И _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам_Итоговая.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)";
		
		Запрос.Выполнить();	
		
		Если ВыводитьАктивыКакВПеречнеИмуществаПИФ Тогда
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива КАК ВидАктива,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание = ЗНАЧЕНИЕ(Документ.Сделка.)
				|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.СделкаРЕПО)
				|			ТОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА ""дебиторская задолженность (денежные средства в пути)""
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО)
				|			ТОГДА ""дебиторская задолженность""
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики
				|	КОНЕЦ КАК СубъектАналитики,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
				|				ИЛИ &ОтражатьРЕПОВРазделе <> ""Займы""
				|					И _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности
				|	КОНЕЦ КАК ВидЗадолженности,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Контрагент
				|	КОНЕЦ КАК Контрагент,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Валюта КАК Валюта,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.НомерСделки КАК НомерСделки,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ДатаСделки КАК ДатаСделки,
				|	СУММА(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СуммаНаКонец) КАК СуммаНаКонец
				|ПОМЕСТИТЬ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
				|ИЗ
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности КАК _СтоимостьАктивовНеЦББезКредиторскойЗадолженности
				|
				|СГРУППИРОВАТЬ ПО
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Валюта,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.НомерСделки,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ДатаСделки,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание = ЗНАЧЕНИЕ(Документ.Сделка.)
				|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.СделкаРЕПО)
				|			ТОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА ""дебиторская задолженность (денежные средства в пути)""
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО)
				|			ТОГДА ""дебиторская задолженность""
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
				|				ИЛИ &ОтражатьРЕПОВРазделе <> ""Займы""
				|					И _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Контрагент
				|	КОНЕЦ";
			
		Иначе
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива КАК ВидАктива,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание = ЗНАЧЕНИЕ(Документ.Сделка.)
				|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.СделкаРЕПО)
				|			ТОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА ""дебиторская задолженность (денежные средства в пути)""
				|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.НачислениеЗадолженности)
				|				ИЛИ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО)
				|				ИЛИ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|					И (ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.Оплата)
				|						ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.РешениеОбИзмененииУставногоКапиталаООО)
				|						ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) В (ТИП(Документ.ПриходПроцентовПоКредитномуИнструменту), ТИП(Документ.ЗакрытиеКредитногоИнструмента)))
				|			ТОГДА ""дебиторская задолженность""
				|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.ПогашениеКупона)
				|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание КАК Документ.ПогашениеКупона).Облигация
				|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
				|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики
				|	КОНЕЦ КАК СубъектАналитики,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
				|				ИЛИ &ОтражатьРЕПОВРазделе <> ""Займы""
				|					И _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности
				|	КОНЕЦ КАК ВидЗадолженности,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Контрагент
				|	КОНЕЦ КАК Контрагент,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Валюта КАК Валюта,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.НомерСделки КАК НомерСделки,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ДатаСделки КАК ДатаСделки,
				|	СУММА(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СуммаНаКонец) КАК СуммаНаКонец
				|ПОМЕСТИТЬ _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
				|ИЗ
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности КАК _СтоимостьАктивовНеЦББезКредиторскойЗадолженности
				|
				|СГРУППИРОВАТЬ ПО
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание = ЗНАЧЕНИЕ(Документ.Сделка.)
				|				ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.СделкаРЕПО)
				|			ТОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА ""дебиторская задолженность (денежные средства в пути)""
				|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.НачислениеЗадолженности)
				|				ИЛИ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО)
				|				ИЛИ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|					И (ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.Оплата)
				|						ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.РешениеОбИзмененииУставногоКапиталаООО)
				|						ИЛИ ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) В (ТИП(Документ.ПриходПроцентовПоКредитномуИнструменту), ТИП(Документ.ЗакрытиеКредитногоИнструмента)))
				|			ТОГДА ""дебиторская задолженность""
				|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.ПогашениеКупона)
				|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание КАК Документ.ПогашениеКупона).Облигация
				|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
				|			ТОГДА ВЫРАЗИТЬ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
				|				ИЛИ &ОтражатьРЕПОВРазделе <> ""Займы""
				|					И _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидЗадолженности
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
				|				И ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
				|			ТОГДА """"
				|		ИНАЧЕ _СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Контрагент
				|	КОНЕЦ,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.Валюта,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.НомерСделки,
				|	_СтоимостьАктивовНеЦББезКредиторскойЗадолженности.ДатаСделки";
		
		КонецЕсли;
	
		Запрос.Выполнить();	
		Запрос.Текст = 		
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ВложенныйЗапрос.Количество) КАК КоличествоОбъектовИнвестирования
			|ПОМЕСТИТЬ _КоличествоОбъектов
			|ИЗ
			|	(ВЫБРАТЬ
			|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _СтоимостьПереоценки_Итоговая.ЦеннаяБумага) КАК Количество
			|	ИЗ
			|		_СтоимостьПереоценки_Итоговая КАК _СтоимостьПереоценки_Итоговая
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _СтоимостьКупона.ЦеннаяБумага)
			|	ИЗ
			|		_СтоимостьКупона КАК _СтоимостьКупона
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		СУММА(1)
			|	ИЗ
			|		_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам) КАК ВложенныйЗапрос
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_СтоимостьПаяИСЧА.СтоимостьПая, 0) = 0
			|			ТОГДА ""-""
			|		ИНАЧЕ ВЫРАЗИТЬ((_НаДатуРезультатовИнвестирования.СтоимостьПая - _СтоимостьПаяИСЧА.СтоимостьПая + ЕСТЬNULL(_ДоходПоПаям.Сумма, 0)) / _СтоимостьПаяИСЧА.СтоимостьПая * 100 КАК ЧИСЛО(15, 2))
			|	КОНЕЦ КАК Доходность,
			|	_СтоимостьПаяИСЧА.СчетДУ КАК СчетДУ,
			|	_СтоимостьПаяИСЧА.Дата КАК Дата
			|ПОМЕСТИТЬ _ДоходностьДляТаблицы
			|ИЗ
			|	_СтоимостьПаяИСЧА КАК _СтоимостьПаяИСЧА
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаяИСЧА КАК _НаДатуРезультатовИнвестирования
			|		ПО _СтоимостьПаяИСЧА.СчетДУ = _НаДатуРезультатовИнвестирования.СчетДУ
			|			И (_НаДатуРезультатовИнвестирования.ВидИнтервала = ""ДатаРезультатовИнвестирования"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДоходПоПаям КАК _ДоходПоПаям
			|		ПО _СтоимостьПаяИСЧА.ВидИнтервала = _ДоходПоПаям.ВидИнтервала
			|			И _СтоимостьПаяИСЧА.Дата = _ДоходПоПаям.НачалоПериода
			|ГДЕ
			|	_СтоимостьПаяИСЧА.ВидИнтервала = ""Месяцы""
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ГОД(_НаКонецГода.Дата) КАК ГодЧислом,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_НаНачалоГода.СтоимостьПая, 0) = 0
			|				ИЛИ _НаКонецГода.СтоимостьПая ЕСТЬ NULL
			|			ТОГДА ""-""
			|		ИНАЧЕ ВЫРАЗИТЬ((_НаКонецГода.СтоимостьПая - _НаНачалоГода.СтоимостьПая + ЕСТЬNULL(_ДоходПоПаям.Сумма, 0)) / _НаНачалоГода.СтоимостьПая * 100 КАК ЧИСЛО(15, 2))
			|	КОНЕЦ КАК Доходность
			|ПОМЕСТИТЬ _ДоходностьДляДиаграммы
			|ИЗ
			|	_СтоимостьПаяИСЧА КАК _НаНачалоГода
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаяИСЧА КАК _НаКонецГода
			|		ПО _НаНачалоГода.СчетДУ = _НаКонецГода.СчетДУ
			|			И (_НаКонецГода.ВидИнтервала = ""Годы"")
			|			И (ГОД(_НаНачалоГода.Дата) + 1 = ГОД(_НаКонецГода.Дата))
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДоходПоПаям КАК _ДоходПоПаям
			|		ПО _НаНачалоГода.ВидИнтервала = _ДоходПоПаям.ВидИнтервала
			|			И _НаНачалоГода.Дата = _ДоходПоПаям.НачалоПериода
			|ГДЕ
			|	_НаНачалоГода.ВидИнтервала = ""Годы""
			|	И ГОД(_НаКонецГода.Дата) ЕСТЬ НЕ NULL 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СведенияОбОценкеИнвестиционныхРисков.ВидИнвестиционногоРиска КАК ВидРиска,
			|	СведенияОбОценкеИнвестиционныхРисков.ВероятностьРеализацииИнвестиционногоРиска КАК ВероятностьРеализации,
			|	СведенияОбОценкеИнвестиционныхРисков.ОбъемПотерьПриРеализацииИнвестиционногоРиска КАК ОбъемПотерь,
			|	СведенияОбОценкеИнвестиционныхРисков.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ _ИнвестиционныеРиски
			|ИЗ
			|	РегистрСведений.СведенияОбОценкеИнвестиционныхРисков КАК СведенияОбОценкеИнвестиционныхРисков
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			МАКСИМУМ(СведенияОбОценкеИнвестиционныхРисков.Дата) КАК Дата,
			|			СведенияОбОценкеИнвестиционныхРисков.Организация КАК Организация,
			|			СведенияОбОценкеИнвестиционныхРисков.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|		ИЗ
			|			РегистрСведений.СведенияОбОценкеИнвестиционныхРисков КАК СведенияОбОценкеИнвестиционныхРисков
			|		ГДЕ
			|			СведенияОбОценкеИнвестиционныхРисков.Организация = &Организация
			|			И СведенияОбОценкеИнвестиционныхРисков.СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_КлиентДоверительногоУправления.СчетДоверительногоУправления
			|					ИЗ
			|						_КлиентДоверительногоУправления)
			|			И СведенияОбОценкеИнвестиционныхРисков.Дата <= &ТекущаяДата
			|		
			|		СГРУППИРОВАТЬ ПО
			|			СведенияОбОценкеИнвестиционныхРисков.Организация,
			|			СведенияОбОценкеИнвестиционныхРисков.СчетДоверительногоУправления) КАК ПоследняяРегистрацияРисков
			|		ПО СведенияОбОценкеИнвестиционныхРисков.Организация = ПоследняяРегистрацияРисков.Организация
			|			И СведенияОбОценкеИнвестиционныхРисков.СчетДоверительногоУправления = ПоследняяРегистрацияРисков.СчетДоверительногоУправления
			|			И СведенияОбОценкеИнвестиционныхРисков.Дата = ПоследняяРегистрацияРисков.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СтоимостьПереоценки_Итоговая.СуммаНаКонец КАК Сумма,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Акции)
			|			ТОГДА ""акции, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
			|					ИНАЧЕ КодыВТорговыхСистемахISIN.Код
			|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|			ТОГДА ""облигации, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
			|					ИНАЧЕ КодыВТорговыхСистемахISIN.Код
			|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Векселя)
			|			ТОГДА ""векселя, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Векселя).Серия + "" "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Векселя).Номер + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
			|			ТОГДА ""депозитарные расписки, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
			|					ИНАЧЕ КодыВТорговыхСистемахISIN.Код
			|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|			ТОГДА ""доли, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Закладные)
			|			ТОГДА ""закладные, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + КодыВТорговыхСистемахISIN.Код
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|			ТОГДА ""ипотечные сертификаты участия, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
			|					ИНАЧЕ КодыВТорговыхСистемахISIN.Код
			|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|			ТОГДА ""паи, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
			|						ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
			|					ИНАЧЕ КодыВТорговыхСистемахISIN.Код
			|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала.Наименование
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
			|						ТОГДА ""фьючерсы, ""
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
			|						ТОГДА ""опционы, ""
			|					КОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Спот)
			|						ТОГДА ""споты, ""
			|				КОНЕЦ + ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).Наименование + "" "" + КодыВТорговыхСистемахISIN.Код
			|	КОНЕЦ КАК ОписаниеАктива,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСделки
			|ПОМЕСТИТЬ _ОбщаяТаблицаАктивов
			|ИЗ
			|	_СтоимостьПереоценки_Итоговая КАК _СтоимостьПереоценки_Итоговая
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаКИД, ) КАК РеквизитыПИФСрезПоследних
			|		ПО (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|					ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
			|			КОНЕЦ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&ДатаКИД,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитента
			|		ПО (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Паи)
			|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Доли)
			|					ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
			|				КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага) = ТИП(Справочник.Закладные)
			|					ТОГДА ВЫРАЗИТЬ(_СтоимостьПереоценки_Итоговая.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
			|				ИНАЧЕ _СтоимостьПереоценки_Итоговая.ЦеннаяБумага.Эмитент.ЮрФизЛицо
			|			КОНЕЦ = РеквизитыЭмитента.ЮрФизЛицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаКИД, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахISIN
			|		ПО _СтоимостьПереоценки_Итоговая.ЦеннаяБумага = КодыВТорговыхСистемахISIN.Объект
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_СтоимостьКупона.СуммаКупонаНаКонец,
			|	""дебиторская задолженность по купонному доходу: "" + ""облигации, "" + РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + ВЫБОР
			|		КОГДА ВЫРАЗИТЬ(_СтоимостьКупона.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
			|			ТОГДА ВЫРАЗИТЬ(_СтоимостьКупона.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
			|		ИНАЧЕ КодыВТорговыхСистемахISIN.Код
			|	КОНЕЦ + "", "" + ВЫРАЗИТЬ(_СтоимостьКупона.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование,
			|	ДАТАВРЕМЯ(1, 1, 1)
			|ИЗ
			|	_СтоимостьКупона КАК _СтоимостьКупона
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&ДатаКИД,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитента
			|		ПО _СтоимостьКупона.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЭмитента.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаКИД, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахISIN
			|		ПО _СтоимостьКупона.ЦеннаяБумага = КодыВТорговыхСистемахISIN.Объект
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаНаКонец,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
			|				И _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути)
			|			ТОГДА ""денежные средства на банковских счетах ("" + РеквизитыКонтрагента.КраткоеНаименованиеПоУставу + "", ОГРН "" + РеквизитыКонтрагента.ОГРН + ""), "" + _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
			|			ТОГДА ""средства, находящиеся у профессиональных участников рынка ценных бумаг ("" + РеквизитыКонтрагента.КраткоеНаименованиеПоУставу + "", ОГРН "" + РеквизитыКонтрагента.ОГРН + ""), RUB""
			|		КОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики = ""дебиторская задолженность""
			|			ТОГДА ""дебиторская задолженность ("" + РеквизитыКонтрагента.КраткоеНаименованиеПоУставу + "", ОГРН "" + РеквизитыКонтрагента.ОГРН + ""), RUB""
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.Сделка)
			|			ТОГДА ""дебиторская задолженность (по сделке № "" + _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.НомерСделки + "" от 'ДатаСделки'"" + ЕСТЬNULL("", "" + РеквизитыКонтрагента.КраткоеНаименованиеПоУставу + "", ОГРН "" + РеквизитыКонтрагента.ОГРН, """") + ""), "" + _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.СделкаРЕПО)
			|			ТОГДА ""дебиторская задолженность (по сделке РЕПО № "" + _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.НомерСделки + "" от 'ДатаСделки'"" + ЕСТЬNULL("", "" + РеквизитыКонтрагента.КраткоеНаименованиеПоУставу + "", ОГРН "" + РеквизитыКонтрагента.ОГРН, """") + ""), "" + _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта
			|		КОГДА ТИПЗНАЧЕНИЯ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.ОбъектыНедвижимости)
			|			ТОГДА _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики.Наименование
			|		ИНАЧЕ ВЫРАЗИТЬ(_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СТРОКА)
			|	КОНЕЦ,
			|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ДатаСделки
			|ИЗ
			|	_СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&ДатаКИД,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКонтрагента
			|		ПО _СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент = РеквизитыКонтрагента.ЮрФизЛицо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 5
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(_ОбщаяТаблицаАктивов.Сумма / ФинансовыеПоказатели.Значение * 100 КАК ЧИСЛО(26, 8))
			|	КОНЕЦ КАК ДоляКрупнейшегоОбъектаИнвестирования,
			|	_ОбщаяТаблицаАктивов.ОписаниеАктива КАК КрупнейшийОбъектИнвестирования,
			|	_ОбщаяТаблицаАктивов.ДатаСделки КАК ДатаСделки
			|ИЗ
			|	_ОбщаяТаблицаАктивов КАК _ОбщаяТаблицаАктивов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|		ПО (ФинансовыеПоказатели.Период = &ДатаКИД)
			|			И (ФинансовыеПоказатели.Организация = &Организация)
			|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов))
			|			И (ФинансовыеПоказатели.СубъектАналитики В
			|				(ВЫБРАТЬ
			|					_КлиентДоверительногоУправления.СчетДоверительногоУправления
			|				ИЗ
			|					_КлиентДоверительногоУправления))
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДоляКрупнейшегоОбъектаИнвестирования УБЫВ";
					
	КонецЕсли;
	
	#КонецОбласти
	
	СтруктураДанных.Вставить("ЭтоПриостановленныйПИФ", 	ЭтоПриостановленныйПИФ);
	СтруктураДанных.Вставить("ПериодПриостановкиПИФ", 	ПериодПриостановкиПИФ);
	
	ПоложениеПодписей = ?(СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Интеллектфонд") Или СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Протон"), ПоложениеПодписейКДиаграмме.Край, ПоложениеПодписейКДиаграмме.КрайВнутри);
	
	Если ТолькоДиаграмма Тогда
		
		Запрос.Выполнить();
		ПолучитьДиаграммуНаСервере(Запрос, СтруктураДанных, ТолькоДиаграмма, Отказ, ПериодПриостановкиПИФ, ПоложениеПодписей);		
		Возврат;
		
	КонецЕсли;
		
	// Выполняем запрос
	КрупнейшиеОбъекты = Запрос.Выполнить().Выгрузить();
	
	СтоимостьПаяИСЧА = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СтоимостьПаяИСЧА").ПолучитьДанные().Выгрузить();
	
	Если СтоимостьПаяИСЧА.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные по стоимости пая и СЧА за период деятельности фонда",,,, Отказ);		
		Возврат;
	КонецЕсли;
	
	СтоимостьПаяИСЧА.Сортировать("Дата Убыв");
	
	Если СтоимостьПаяИСЧА[0].СтоимостьПая = Null Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные о стоимости пая и СЧА на дату определения результатов от инвестирования. Документ регистрации стоимости активов за эту дату еще не сформирован",,,, Отказ);		
		Возврат;
	КонецЕсли;
		
	// Добавляем крупнейшие объекты
	Сч = 1;
	Для Каждого СтрокаОбъекта Из КрупнейшиеОбъекты Цикл
		СтруктураПолейФайла.Вставить(КрупнейшиеОбъекты.Колонки[0].Имя + СокрЛП(Сч), Формат(СтрокаОбъекта[0], "ЧДЦ=2; ЧН=0,00"));
		СтруктураПолейФайла.Вставить(КрупнейшиеОбъекты.Колонки[1].Имя + СокрЛП(Сч), ?(СтрокаОбъекта[2] = '00010101', СокрЛП(СтрокаОбъекта[1]), СтрЗаменить(СокрЛП(СтрокаОбъекта[1]), "'ДатаСделки'", Формат(СтрокаОбъекта[2], "ДФ=dd.MM.yyyy"))));
		Сч = Сч + 1;
	КонецЦикла;

	Пока Сч <= 5 Цикл
		СтруктураПолейФайла.Вставить(КрупнейшиеОбъекты.Колонки[0].Имя + СокрЛП(Сч), "-");
		СтруктураПолейФайла.Вставить(КрупнейшиеОбъекты.Колонки[1].Имя + СокрЛП(Сч), "-");
		Сч = Сч + 1;
	КонецЦикла;

	КоличествоОбъектов = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КоличествоОбъектов").ПолучитьДанные().Выгрузить();
	
	СтруктураПолейФайла.Вставить("КоличествоОбъектовИнвестирования",  ?(КоличествоОбъектов.Количество() = 0, 0, КоличествоОбъектов[0].КоличествоОбъектовИнвестирования));
	
	Реквизиты = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Реквизиты").ПолучитьДанные().Выгрузить();
	
	Если Реквизиты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для вывода!",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	СтрокаРеквизитов = Реквизиты[0];
	Для Каждого ТекКолонка Из Реквизиты.Колонки Цикл
		
		Если ТекКолонка.Имя = "ПИФ" Или ТекКолонка.Имя = "СчетДоверительногоУправления" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекКолонка.Имя = "ДатаФормированияПИФ" Тогда
			СтруктураДанных.Вставить("ДатаФормированияПИФ", СтрокаРеквизитов[ТекКолонка.Имя]);
		ИначеЕсли ТекКолонка.Имя = "ДатаВозникнованияОснованияДляПрекращенияПИФ" Тогда
			СтруктураДанных.Вставить("ДатаВозникнованияОснованияДляПрекращенияПИФ", СтрокаРеквизитов[ТекКолонка.Имя]);	
		ИначеЕсли СтрНайти(ТекКолонка.Имя, "_ДатаПрописью") > 0 Тогда
			СтруктураПолейФайла.Вставить(СтрЗаменить(ТекКолонка.Имя, "_ДатаПрописью", ""), Формат(СтрокаРеквизитов[ТекКолонка.Имя], "ДФ='dd MMMM yyyy'"));
		ИначеЕсли СтрНайти(ТекКолонка.Имя, "_Дата") > 0 Тогда
			СтруктураПолейФайла.Вставить(СтрЗаменить(ТекКолонка.Имя, "_Дата", ""), Формат(СтрокаРеквизитов[ТекКолонка.Имя], "ДФ=dd.MM.yyyy"));
		ИначеЕсли СтрНайти(ТекКолонка.Имя, "_Число") > 0 Тогда
			СтруктураПолейФайла.Вставить(СтрЗаменить(ТекКолонка.Имя, "_Число", ""), Формат(СтрокаРеквизитов[ТекКолонка.Имя], "ЧРД=,"));	
		ИначеЕсли СтрНачинаетсяС(ТекКолонка.Имя, "НастройкаВознаграждения") Тогда	
			СтруктураПолейФайла.Вставить(СтрЗаменить(ТекКолонка.Имя, "Настройка", "Процент"), 
					Справочники.НастройкиРасчета.Рассчитать(СтрокаРеквизитов[ТекКолонка.Имя], Новый Структура("Период", Объект.ДатаКлючевогоИнформационногоДокумента)));
		ИначеЕсли ТекКолонка.Имя = "ПроцентВознагражденияВсего" Тогда
			СтруктураПолейФайла.Вставить(ТекКолонка.Имя, СтруктураПолейФайла.ПроцентВознагражденияУК + СтруктураПолейФайла.ПроцентВознагражденияСД + СтруктураПолейФайла.ПроцентВознагражденияПрочие);			
		ИначеЕсли СтрНачинаетсяС(ТекКолонка.Имя, "ПроцентВознаграждения") Тогда
			Продолжить;					
		Иначе
			Если ТекКолонка.Имя = "ОписаниеИнвестиционнойСтратегии" И ПустаяСтрока(СтрокаРеквизитов[ТекКолонка.Имя]) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните доп.свойство фонда ""Описание инвестиционной стратегии""!");
			ИначеЕсли ТекКолонка.Имя = "ВидИнвестиционнойСтратегии" И ПустаяСтрока(СтрокаРеквизитов[ТекКолонка.Имя]) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните доп.свойство фонда ""Вид инвестиционной стратегии""!");
			ИначеЕсли ТекКолонка.Имя = "ОписаниеАктивовИнвестирования" И ПустаяСтрока(СтрокаРеквизитов[ТекКолонка.Имя]) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните доп.свойство фонда ""Виды активов для инвестирования""!");
			КонецЕсли;
			СтруктураПолейФайла.Вставить(ТекКолонка.Имя, СтрокаРеквизитов[ТекКолонка.Имя]);
		КонецЕсли;
		
	КонецЦикла;
	
	ИнвестиционныеРиски = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ИнвестиционныеРиски").ПолучитьДанные().Выгрузить();
			
	Если ИнвестиционныеРиски.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют сведения об инвестиционных рисках",,,, Отказ);		
		Возврат;
	КонецЕсли;

	ИнвестиционныеРиски.Сортировать("НомерСтроки");
	
	СтруктураИнвестиционныхРисков = Новый Структура;
	Сч = 1;
	Для Каждого СтрокаРиска Из ИнвестиционныеРиски Цикл
		СтруктураИнвестиционныхРисков.Вставить("Строка" + СокрЛП(Сч), Новый Структура("ВидРиска, ВероятностьРеализации, ОбъемПотерь", СтрокаРиска.ВидРиска, СтрокаРиска.ВероятностьРеализации, СтрокаРиска.ОбъемПотерь));
		Сч = Сч + 1;
	КонецЦикла;
	СтруктураДанных.Вставить("ИнвестиционныеРиски", СтруктураИнвестиционныхРисков);
	
	ВыводитьДиаграмму = Год(Объект.ДатаРезультатовИнвестирования) <> Год(СтрокаРеквизитов.ДатаОкончанияФормированияПИФ_Дата);	
	СтруктураДанных.Вставить("ВыводитьДиаграмму", ВыводитьДиаграмму);
	
	// Если дата КИД и дата результатов инвестирования совпадают, то дату результатов показывать не нужно
	Если Объект.ДатаКлючевогоИнформационногоДокумента = Объект.ДатаРезультатовИнвестирования Тогда
		СтруктураПолейФайла.Вставить("ДатаРезультатовИнвестирования", " ");
	КонецЕсли;
	
	// Минимальную сумму зачисления нужно указать числом и прописью
	СтруктураПолейФайла.Вставить("МинимальнаяСуммаЗачисления", Формат(СтрокаРеквизитов["МинимальнаяСуммаЗачисления_Число"], "ЧРД=,") + " (" + ЧислоПрописью(СтрокаРеквизитов["МинимальнаяСуммаЗачисления_Число"], "L=ru_RU;SN=false;FN=false;FS=false", ",,,,,,,,0") + ")");
	
	ВебСтраницаПИФ 	= ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "Обработка.ОтправкаДанныхПИФНаСайт", СтрокаРеквизитов["СчетДоверительногоУправления"]);
	ВебСтраницаУК 	= СтруктураПолейФайла.ВебСтраницаУК;
	НайдТочкаРуУК 	= СтрНайти(ВебСтраницаУК, ".ru");
	НайдТочкаРуПИФ 	= СтрНайти(ВебСтраницаПИФ, ".ru");
	
	
	//Заменяем в кусочек адресе ПИФ на правильную страницу УК
	ВебСтраницаПИФ = СтрЗаменить(ВебСтраницаПИФ, Лев(ВебСтраницаПИФ, НайдТочкаРуПИФ), Лев(ВебСтраницаУК, НайдТочкаРуУК));
	
	СтруктураПолейФайла.Вставить("ВебСтраницаПИФ", ВебСтраницаПИФ);
		
	СтрокаСтоимости = СтоимостьПаяИСЧА[0];
	СтруктураПолейФайла.Вставить("СтоимостьПая", Формат(СтрокаСтоимости.СтоимостьПая, "ЧДЦ=2; ЧРД=,; ЧН=0,00"));
	СтруктураПолейФайла.Вставить("СЧА", Формат(СтрокаСтоимости.СЧА, "ЧДЦ=2; ЧРД=,; ЧН=0,00"));

	Инфляция = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Инфляция").ПолучитьДанные().Выгрузить();
	Инфляция.Сортировать("ДатаЗначения Убыв");
	
	// Собираем инфляцию для заданных периодов (1, 3, 6 месяцев, 1, 3, 5 лет);
	Инфляция1Месяц 		= 1;
	Инфляция3Месяца 	= 1;
	Инфляция6Месяцев 	= 1;
	Инфляция1Год 		= 1;
	Инфляция3Года	 	= 1;
	Инфляция5Лет 		= 1;
	
	ИндексПоследнейСтроки = Инфляция.Количество() - 1;
	Накоплено = 1;
	Для Сч = 0 По ИндексПоследнейСтроки Цикл
		Накоплено = Накоплено * Инфляция[Сч].Значение;
		Если Сч = 0 Тогда
			Инфляция1Месяц = Накоплено;
		ИначеЕсли Сч = 2 Тогда
			Инфляция3Месяца = Накоплено;
		ИначеЕсли Сч = 5 Тогда
			Инфляция6Месяцев = Накоплено;	
		ИначеЕсли Сч = 11 Тогда
			Инфляция1Год = Накоплено;		
		ИначеЕсли Сч = 35 Тогда
			Инфляция3Года = Накоплено;	
		ИначеЕсли Сч = 59 Тогда
			Инфляция5Лет = Накоплено;		
		КонецЕсли;		
	КонецЦикла;
	
	Инфляция1Месяц	 	= Окр((Инфляция1Месяц - 1) * 100, 2, 1);
	Инфляция3Месяца 	= Окр((Инфляция3Месяца - 1) * 100, 2, 1);
	Инфляция6Месяцев 	= Окр((Инфляция6Месяцев - 1) * 100, 2, 1);
	Инфляция1Год 		= Окр((Инфляция1Год - 1) * 100, 2, 1);
	Инфляция3Года 		= Окр((Инфляция3Года - 1) * 100, 2, 1);
	Инфляция5Лет		= Окр((Инфляция5Лет - 1) * 100, 2, 1);
	
	ДоходностьДляТаблицы = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДоходностьДляТаблицы").ПолучитьДанные().Выгрузить();
	ДоходностьДляТаблицы.Сортировать("Дата Убыв");
	
	ДобавитьПоляДоходности(СтруктураПолейФайла, ДоходностьДляТаблицы, 0, Инфляция1Месяц, 	"Доходность1Месяц", 	"ОтклонениеОтИнфляции1Месяц",	"ОтклонениеОтИндекса1Месяц");
	ДобавитьПоляДоходности(СтруктураПолейФайла, ДоходностьДляТаблицы, 1, Инфляция3Месяца, 	"Доходность3Месяца", 	"ОтклонениеОтИнфляции3Месяца", 	"ОтклонениеОтИндекса3Месяца");
	ДобавитьПоляДоходности(СтруктураПолейФайла, ДоходностьДляТаблицы, 2, Инфляция6Месяцев, 	"Доходность6Месяцев", 	"ОтклонениеОтИнфляции6Месяцев", "ОтклонениеОтИндекса6Месяцев");
	ДобавитьПоляДоходности(СтруктураПолейФайла, ДоходностьДляТаблицы, 3, Инфляция1Год, 		"Доходность1Год", 		"ОтклонениеОтИнфляции1Год", 	"ОтклонениеОтИндекса1Год");
	ДобавитьПоляДоходности(СтруктураПолейФайла, ДоходностьДляТаблицы, 4, Инфляция3Года, 	"Доходность3Года", 		"ОтклонениеОтИнфляции3Года", 	"ОтклонениеОтИндекса3Года");
	ДобавитьПоляДоходности(СтруктураПолейФайла, ДоходностьДляТаблицы, 5, Инфляция5Лет, 		"Доходность5Лет", 		"ОтклонениеОтИнфляции5Лет", 	"ОтклонениеОтИндекса5Лет");
	
	ПолучитьДиаграммуНаСервере(Запрос, СтруктураДанных, ТолькоДиаграмма, Отказ,, ПоложениеПодписей);		
	
	СтруктураДанных.Реквизиты.Вставить("Звездочка", Символы.НПП);
	СтруктураДанных.Реквизиты.Вставить("ТекстПриостановленногоПИФ", Символы.НПП);
	
	// Для приостановленного ПИФ очищаем отдельные поля и таблицы	
	Если ПериодПриостановкиПИФ <> Неопределено Тогда
		ПодготовитьДанныеДляПриостановленногоПИФ(СтруктураДанных, Объект.ДатаКлючевогоИнформационногоДокумента, Объект.ДатаРезультатовИнвестирования);
	КонецЕсли;	
	
	ИнформацияОВозникновенииОснованияДляПрекращенияФонда = " ";
	Если ЗначениеЗаполнено(СтруктураДанных.ДатаВозникнованияОснованияДляПрекращенияПИФ) Тогда
		ИнформацияОВозникновенииОснованияДляПрекращенияФонда = СтрШаблон("9. Паевой инвестиционный фонд находится в стадии прекращения. Дата возникновения основания прекращения фонда %1 г. Прекращение паевого инвестиционного фонда осуществляется управляющей компанией.",
			Формат(СтруктураДанных.ДатаВозникнованияОснованияДляПрекращенияПИФ, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	СтруктураДанных.Реквизиты.Вставить("ИнформацияОВозникновенииОснованияДляПрекращенияФонда", ИнформацияОВозникновенииОснованияДляПрекращенияФонда);
	
	ДанныеДляЗаполнения = СтруктураДанных;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьДиаграммуНаСервере(Запрос, СтруктураДанных, ТолькоДиаграмма, Отказ, ПериодПриостановкиПИФ = Неопределено, ПоложениеПодписей = Неопределено)
	
	ВыводитьДиаграмму = СтруктураДанных.ВыводитьДиаграмму;
	
	Если Не ВыводитьДиаграмму Тогда 
		Возврат;
	КонецЕсли;
	
	// Определяем год с датой окончания формирования, добавляем (*) в подпись года
	Если ТолькоДиаграмма Тогда
		
		Реквизиты = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Реквизиты").ПолучитьДанные().Выгрузить();
		
		Если Реквизиты.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для вывода!",,,, Отказ);		
			Возврат;			
		КонецЕсли;
		ГодФормированияПИФ = Год(Реквизиты[0].ДатаФормированияПИФ);
		ВыводитьДиаграмму = Год(Объект.ДатаРезультатовИнвестирования) <> ГодФормированияПИФ;
		
	Иначе
		
		ГодФормированияПИФ = Год(СтруктураДанных.ДатаФормированияПИФ);    		
		
	КонецЕсли;                                                            
	
	ДоходностьДляДиаграммы = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДоходностьДляДиаграммы").ПолучитьДанные().Выгрузить();
	
	ДоходностьДляДиаграммы.Сортировать("ГодЧислом");
	ДоходностьДляДиаграммы.Колонки.Вставить(0, "Год", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(8)));
	Для Каждого СтрокаДоходности Из ДоходностьДляДиаграммы Цикл     		
		СтрокаДоходности.Год = Формат(СтрокаДоходности.ГодЧислом, "ЧГ=0");
	КонецЦикла;                                                    
	  
	ДобавитьСноскуПодДиаграммой = Ложь;
	НайдСтрокиДоходности = ДоходностьДляДиаграммы.НайтиСтроки(Новый Структура("ГодЧислом", ГодФормированияПИФ));
	Если НайдСтрокиДоходности.Количество() > 0 Тогда
		НайдСтрокиДоходности[0].Год = НайдСтрокиДоходности[0].Год + " (*)";
		ДобавитьСноскуПодДиаграммой = Истина;
	КонецЕсли;
	
	// Редактируем подписи к диаграмме для приостановленного ПИФ
	Если ПериодПриостановкиПИФ <> Неопределено Тогда
		
		// 2022 и 2023 годы помечаем звездочками
		НайдСтрокиДоходности = ДоходностьДляДиаграммы.НайтиСтроки(Новый Структура("ГодЧислом", 2022));
		Если НайдСтрокиДоходности.Количество() > 0 Тогда
			НайдСтрокиДоходности[0].Год = НайдСтрокиДоходности[0].Год + " *";
			ДобавитьСноскуПодДиаграммой = Истина;
		КонецЕсли;
		
		НайдСтрокиДоходности = ДоходностьДляДиаграммы.НайтиСтроки(Новый Структура("ГодЧислом", 2023));
		Если НайдСтрокиДоходности.Количество() > 0 Тогда
			НайдСтрокиДоходности[0].Год = НайдСтрокиДоходности[0].Год + " **";
			ДобавитьСноскуПодДиаграммой = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
	СтруктураДанных.Вставить("ДобавитьСноскуПодДиаграммой", ДобавитьСноскуПодДиаграммой);
	
	ДоходностьДляДиаграммы.Колонки.Удалить(1);
	
	ДиаграммаДоходности.Очистить();
	
	Если ВыводитьДиаграмму Тогда
		
		ДиаграммаДоходности.Обновление = Ложь;
		
		ДиаграммаДоходности.ТипДиаграммы 				= ТипДиаграммы.Гистограмма;
		ДиаграммаДоходности.ВидПодписей 				= ВидПодписейКДиаграмме.Нет;
		ДиаграммаДоходности.ОбластьЗаголовка.Текст 		= "Доходность за календарный год, %";
		ДиаграммаДоходности.ОбластьЗаголовка.Шрифт 		= Новый Шрифт("Times New Roman", 14, Ложь);
		ДиаграммаДоходности.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;	
		ДиаграммаДоходности.СерииВСтроках 				= Ложь;
		ДиаграммаДоходности.ОсьЗначений.БазовоеЗначение = 0;
		ДиаграммаДоходности.ОсьТочек.БазовоеЗначение 	= 0;
		ДиаграммаДоходности.ПоложениеПодписей 			= ПоложениеПодписей;
		
		МассивЦветов = Новый Массив;
		МассивЦветов.Добавить(Новый Цвет(79, 129, 189));	
		ДиаграммаДоходности.ОписаниеПалитрыЦветов.УстановитьПалитру(МассивЦветов);
		ДиаграммаДоходности.ВидПодписей = ВидПодписейКДиаграмме.Значение;

		ДиаграммаДоходности.ИсточникДанных = ДоходностьДляДиаграммы;
		
		ДиаграммаДоходности.ОбластьПостроения.Шрифт 						= Новый Шрифт("Times New Roman", 9, Ложь);
		ДиаграммаДоходности.ОбластьПостроения.ШкалаТочек.ШрифтПодписей 		= Новый Шрифт("Times New Roman", 7, Ложь);
		ДиаграммаДоходности.ОбластьПостроения.ШкалаСерий.ШрифтПодписей 		= Новый Шрифт("Times New Roman", 7, Ложь);
		ДиаграммаДоходности.ОбластьПостроения.ШкалаЗначений.ШрифтПодписей 	= Новый Шрифт("Times New Roman", 7, Ложь);
		ДиаграммаДоходности.ОбластьПостроения.ШкалаЗначений.ШагШкалы 		= 5;
		ДиаграммаДоходности.ОбластьПостроения.ШкалаЗначений.ПоложениеШкалы 	= ПоложениеШкалыДиаграммы.Край;
		ДиаграммаДоходности.ОбластьПостроения.ШкалаТочек.ПоложениеШкалы 	= ПоложениеШкалыДиаграммы.Край;
		ДиаграммаДоходности.ОбластьПостроения.ШкалаСерий.ПоложениеШкалы 	= ПоложениеШкалыДиаграммы.Край;
				
		ДиаграммаДоходности.Обновление = Истина;
				
		АдресКартинкиВХранилище = ПоместитьВоВременноеХранилище(ДиаграммаДоходности.ПолучитьКартинку(600,400,ФорматКартинки.BMP).ПолучитьДвоичныеДанные());
		
		СтруктураДанных.Вставить("АдресКартинкиВХранилище", АдресКартинкиВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПоляДоходности(СтруктураПолейФайла, ДоходностьДляТаблицы, ИндексСтроки, Инфляция, ИмяПоляДоходности, ИмяПоляОтклонения, ИмяПоляИндекса)
	
	Доходность = ДоходностьДляТаблицы[ИндексСтроки].Доходность;
	Если ТипЗнч(Доходность) = Тип("Число") Тогда
		ОтклонениеОтИнфляции = Доходность - Инфляция;		
	Иначе
		ОтклонениеОтИнфляции = "-";
		Доходность = "-";
	КонецЕсли;
	
	СтруктураПолейФайла.Вставить(ИмяПоляДоходности, Доходность);
	СтруктураПолейФайла.Вставить(ИмяПоляОтклонения, ОтклонениеОтИнфляции);
	СтруктураПолейФайла.Вставить(ИмяПоляИндекса,	"-");
		
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНачалоСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики)
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	
	ПолноеИмяОтчета = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	СессияСбораСтатистики   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		ПолноеИмяОтчета,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики)

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	СтрСохраняемыеДанные = "ДатаКлючевогоИнформационногоДокумента,Организация,ПаевойИнвестиционныйФонд";
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, Объект);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

&НаСервереБезКонтекста
Процедура КомандаЗагрузитьДанныеИПЦНаСервере()
	
	ИмпортПроцентныхПоказателей = Обработки.ИмпортПроцентныхПоказателей.Создать();
	ИмпортПроцентныхПоказателей.ДатаЗагрузки = ТекущаяДата();
	ИмпортПроцентныхПоказателей.ИмпортИндексовПотребительскихЦен();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьДанныеИПЦ(Команда)
	
	КомандаЗагрузитьДанныеИПЦНаСервере();
	ОбновитьАктуальностьИнфляцииНаСервере();
	ОбновитьВидимостьАктуальностиИнфляции();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьДанныеДляПриостановленногоПИФ(СтруктураДанных, ДатаДокумента, ДатаРезультатовИнвестирования)
	
	// Если ПИФ приостановлен, в основных таблицах нужно вывести прочерки	
	Если СтруктураДанных.ЭтоПриостановленныйПИФ Тогда
		
		ТаблицаРисков = Новый Структура("Строка1", Новый Структура("ВидРиска,ОбъемПотерь,ВероятностьРеализации", "-", "-", "-"));
		СтруктураДанных.Вставить("ИнвестиционныеРиски", ТаблицаРисков);
		      		
		МассивКлючей = Новый Массив;
		Для Каждого ТекРеквизит Из СтруктураДанных.Реквизиты Цикл
			Если СтрНачинаетсяС(ТекРеквизит.Ключ, "ОтклонениеОтИнфляции")
				Или СтрНачинаетсяС(ТекРеквизит.Ключ, "Доходность")
				Или ТекРеквизит.Ключ = "СЧА"
				Или ТекРеквизит.Ключ = "СтоимостьПая"
				Тогда
				
				МассивКлючей.Добавить(ТекРеквизит.Ключ);
			КонецЕсли;
			
		КонецЦикла;
			
		Для Сч = 1 По 5 Цикл
			МассивКлючей.Добавить("ДоляКрупнейшегоОбъектаИнвестирования" + СокрЛП(Сч)); 	
			МассивКлючей.Добавить("КрупнейшийОбъектИнвестирования" + СокрЛП(Сч)); 	
		КонецЦикла;
				
		Для Каждого Ключ Из МассивКлючей Цикл             		
			СтруктураДанных.Реквизиты.Вставить(Ключ, "-");
		КонецЦикла;
		
		СтруктураДанных.Реквизиты.Вставить("ДатаРезультатовИнвестирования", " ");

		СтруктураДанных.Реквизиты.Вставить("Звездочка", "*");
		СтруктураДанных.Реквизиты.Вставить("ТекстПриостановленногоПИФ", "____________________________" + Символы.ВК +
								"* Информация не заполняется в соответствии с разъяснениями Банка России от 11.03.2022 №38-3-8/630 по причине временного приостановления с 02.03.2022 г. выдачи и погашения инвестиционных паёв и в связи с тем, что в результате этого стоимость активов Фонда не рассчитывается.");
		
	Иначе
		
		// Если у ПИФ был период приостановки, таблицу доходности нужно заполнять постепенно от даты окончания периода приостановки
		ДатаОкончанияПриостановки = СтруктураДанных.ПериодПриостановкиПИФ.ДатаОкончания;
		
		// Через 13 месяцев заполняются все показатели
		Если НачалоМесяца(ДатаРезультатовИнвестирования) >= НачалоМесяца(ДобавитьМесяц(ДатаОкончанияПриостановки, 13)) Тогда
			Возврат;
		КонецЕсли; 			
		
		МассивИнтервалов = Новый Массив;
		
		// 3 года, 5 лет отражаем с месяца, в котором у ПИФа закончился период приостановки		
		Если НачалоМесяца(ДатаРезультатовИнвестирования) >= НачалоМесяца(ДатаОкончанияПриостановки) Тогда
			МассивИнтервалов.Добавить("3Года");
			МассивИнтервалов.Добавить("5Лет");
		КонецЕсли;
		
		// 1 месяц - со следующего месяца от даты окончания периода приостановки
		Если НачалоМесяца(ДатаРезультатовИнвестирования) >= НачалоМесяца(ДобавитьМесяц(ДатаОкончанияПриостановки, 1)) Тогда
			МассивИнтервалов.Добавить("1Месяц");
		КонецЕсли;
		
		// 3 месяц - через четыре месяца от даты окончания периода приостановки
		Если НачалоМесяца(ДатаРезультатовИнвестирования) >= НачалоМесяца(ДобавитьМесяц(ДатаОкончанияПриостановки, 3)) Тогда
			МассивИнтервалов.Добавить("3Месяца");
		КонецЕсли;
		
		// 6 месяцев - через семь месяцев от даты окончания периода приостановки
		Если НачалоМесяца(ДатаРезультатовИнвестирования) >= НачалоМесяца(ДобавитьМесяц(ДатаОкончанияПриостановки, 6)) Тогда
			МассивИнтервалов.Добавить("6Месяцев");
		КонецЕсли;
		
		// 1 год - через двенадцать месяцев от даты окончания периода приостановки
		Если НачалоМесяца(ДатаРезультатовИнвестирования) >= НачалоМесяца(ДобавитьМесяц(ДатаОкончанияПриостановки, 12)) Тогда
			МассивИнтервалов.Добавить("1Год");
		КонецЕсли;
				
		МассивКлючей = Новый Массив;
		Для Каждого ТекРеквизит Из СтруктураДанных.Реквизиты Цикл
			
			Если Не (СтрНачинаетсяС(ТекРеквизит.Ключ, "ОтклонениеОтИнфляции")
				Или СтрНачинаетсяС(ТекРеквизит.Ключ, "Доходность"))	Тогда				
				Продолжить;
			КонецЕсли;	
			
			ДобавитьКлюч = Истина;
			Для Каждого Интервал Из МассивИнтервалов Цикл 
				Если СтрЗаканчиваетсяНа(ТекРеквизит.Ключ, Интервал) Тогда
					ДобавитьКлюч = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ДобавитьКлюч Тогда
				МассивКлючей.Добавить(ТекРеквизит.Ключ);
			КонецЕсли;
			
		КонецЦикла;
						
		Для Каждого Ключ Из МассивКлючей Цикл             		
			СтруктураДанных.Реквизиты.Вставить(Ключ, "-");
		КонецЦикла;
				
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти



