
Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.ИнвестиционныеПрофили.КонтрольПовышенияДопустимогоРискаПоСтандартнымСтратегиям(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		Если ОбщегоНазначения.ОбъектИспользуетсяВБазеДанных(ЭтотОбъект.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Элемент справочника используется в объектах базы данных. Посмотреть список таких объектов можно через меню Все Фукнции - Стандартные - Поиск ссылок на объекты.", 
				ЭтотОбъект,,, 
				Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
