
&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	//возьмем настройки из Баланса, чтобы распределять результат по строкам: 
	НастройкиОтчета = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Отчет.Период, Отчет.СчетДоверительногоУправления, "РегламентированныйОтчетБаланс");
	
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ЭтотОбъект.Результат, НастройкиОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда) 
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	КомандаСформироватьНаСервере(); 
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат); 

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Параметры.Свойство("СчетДоверительногоУправления") Тогда
		Отчет.СчетДоверительногоУправления = Параметры.СчетДоверительногоУправления; 
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Отчет.Период = Параметры.Период;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) 
		И ЗначениеЗаполнено(Отчет.Период) Тогда
		КомандаСформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры
